{"name":"14:24","price":"(ऐ नबी!) क्या आपने नहीं देखा कि अल्लाह ने एक पवित्र कलिमा[10] का उदाहरण कैसे दिया (कि वह) एक पवित्र वृक्ष की तरह है, जिसकी जड़ (भूमि में) सुदृढ़ है और जिसकी शाखा आकाश में है?","arabic":"أَلَمۡ تَرَ كَيۡفَ ضَرَبَ ٱللَّهُ مَثَلٗا كَلِمَةٗ طَيِّبَةٗ كَشَجَرَةٖ طَيِّبَةٍ أَصۡلُهَا ثَابِتٞ وَفَرۡعُهَا فِي ٱلسَّمَآءِ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim","Chapter Ibrahim","Surah 14","Chapter 14","Abraham","إبراهيم"],"ayahNumber":1774,"juzNumber":13,"footnotes":"10. (पवित्र कलिमा) से अभिप्राय \"ला इलाहा इल्लल्लाह\" है। जो इस्लाम का धर्म सूत्र है। इसका अर्थ यह है कि अल्लाह के सिवा कोई सच्चा पूज्य नहीं है। और यही एकेश्वरवाद का मूलाधार है। अब्दुल्लाह बिन उमर रज़ियल्लाहू अन्हुमा कहते हैं कि हम रसूलुल्लाह सल्लल्लाहू अलैहि व सल्लम के पास थे कि आपने कहा : मुझे ऐसा वृक्ष बताओ जो मुसलमान के समान होता है। जिसका पत्ता नहीं गिरता, तथा प्रत्येक समय अपना फल दिया करता है? इब्ने उमर ने कहा : मेरे मन में यह बात आई कि वह खजूर का वृक्ष है। और अबू बक्र तथा उमर को देखा कि बोल नहीं रहे हैं, इसलिए मैंने भी बोलना अच्छा नहीं समझा। जब वे कुछ नहीं बोले, तो रसूलुल्लाह सल्लल्लाहु अलैहि व सल्लम ने कहा : वह खजूर का वृक्ष है। (संक्षिप्त अनुवाद के साथ, सह़ीह़ बुख़ारी : 4698, सह़ीह़ मुस्लिम : 2811)","lang":"hi","version":{"key":"hindi_omari","direction":"ltr","language_iso_code":"hi","version":"1.1.4","last_update":1675069101,"title":"Hindi Translation","description":"Translation of the Quran meanings into Indian by Azizul-Haqq Al-Umary."},"meta":{"transliteration":"alam tara kayfa ḍaraba al-lahu mathalan kalimatan ṭayyibatan kashajaratin ṭayyibatin aṣluhā thābitun wafarʿuhā fī al-samāi ","translations":["Do not","you see","how","Allah sets forth","Allah sets forth","the example","a word","good","(is) like a tree","good","its root","(is) firm","and its branches","(are) in","the sky","(24)"],"transliterationArr":["alam","tara","kayfa","ḍaraba","al-lahu","mathalan","kalimatan","ṭayyibatan","kashajaratin","ṭayyibatin","aṣluhā","thābitun","wafarʿuhā","fī","al-samāi",null],"verseTiming":[[1,0,62],[2,62,494],[3,494,1082],[4,1082,1563],[5,1563,2702],[6,2702,3900],[7,3900,5846],[8,5846,7602],[9,7602,9548],[10,9548,11112],[11,11112,12806],[12,12806,14264],[13,14264,15450],[14,15450,17065],[15,17065,18503],[16,18503,19250],[17,19250,21137]]}}