{"name":"15:9","price":"निःसंदेह हमने ही यह ज़िक्र (क़ुरआन) उतारी है और निःसंदेह हम ही इसकी अवश्य रक्षा करने वाले[3] हैं।","arabic":"إِنَّا نَحۡنُ نَزَّلۡنَا ٱلذِّكۡرَ وَإِنَّا لَهُۥ لَحَٰفِظُونَ","category":["15 (Al-Hijr)","Al-Hijr","Surah Al-Hijr","Chapter Al-Hijr","Hijr","Surah Hijr","Chapter Hijr","Al Hijr","Surah Al Hijr","Chapter Al Hijr","Surah 15","Chapter 15","The Rock","الحِجر"],"ayahNumber":1811,"juzNumber":14,"footnotes":"3. यह ऐतिहासिक सत्य है। इस विश्व के धर्म ग्रंथों में क़ुरआन ही एक ऐसा धर्म ग्रंथ है जिसमें उसके अवतरित होने के समय से अब तक एक अक्षर तो क्या एक मात्रा का भी परिवर्तन नहीं हुआ। और न हो सकता है। यह विशेषता इस विश्व के किसी भी धर्म ग्रंथ को प्राप्त नहीं है। तौरात हो अथवा इंजील या इस विश्व के अन्य धर्म शास्त्र हों, सब में इतने परिवर्तन किए गए हैं कि सत्य मूल धर्म की पहचान असंभव हो गई है। इसी प्रकार इस (क़ुरआन) की व्याख्या जिसे ह़दीस कहा जाता है, वह भी सुरक्षित है। और उसका पालन किए बिना किसी का जीवन इस्लामी नहीं हो सकता। क्योंकि क़ुरआन का आदेश है कि रसूल (सल्लल्लाहु अलैहि व सल्लम) तुम्हें जो दें उसको ले लो। और जिससे रोक दें उससे रुक जाओ। (देखिए सूरतुल-ह़श्र, आयत : 7) क़ुरआन कहता है कि ऐ नबी! अल्लाह ने आप पर क़ुरआन इसलिए उतारा है कि आप लोगों के लिए उसकी व्याख्या कर दें। क़ुरआन कहता है कि ऐ नबी! (सूरतुन-नह़्ल, आयत : 44) जिस व्याख्या से नमाज़, रोज़ा आदि इस्लामी अनिवार्य कर्तव्यों की विधि का ज्ञान होता है। इसीलिए उसको सुरक्षित किया गया है। और हम ह़दीस के एक-एक रावी के जन्म और मौत का समय और उसकी पूरी दशा को जानते हैं। और यह भी जानते हैं कि वह विश्वसनीय है या नहीं? इस प्रकार हम यह कह सकते हैं कि इस संसार में इस्लाम के सिवा कोई धर्म ऐसा नहीं है, जिसकी मूल पुस्तकें तथा उसके नबी की सारी बातें सुरक्षित हों।","lang":"hi","version":{"key":"hindi_omari","direction":"ltr","language_iso_code":"hi","version":"1.1.4","last_update":1675069101,"title":"Hindi Translation","description":"Translation of the Quran meanings into Indian by Azizul-Haqq Al-Umary."},"meta":{"transliteration":"innā naḥnu nazzalnā al-dhik'ra wa-innā lahu laḥāfiẓūna ","translations":["Indeed, We","We","have sent down","the Reminder","and indeed, We","of it","(are) surely Guardians","(9)"],"transliterationArr":["innā","naḥnu","nazzalnā","al-dhik'ra","wa-innā","lahu","laḥāfiẓūna",null],"verseTiming":[[1,0,1450],[2,1450,1990],[3,1990,3030],[4,3030,3930],[5,3930,5270],[6,5270,5890],[7,5890,9015]]}}