{"name":"24:11","price":"निःसंदेह जो लोग झूठ गढ़[11] लाए हैं, वे तुम्हारे ही भीतर के एक समूह हैं। तुम उसे अपने लिए बुरा मत समझो, बल्कि वह तुम्हारे लिए बेहतर[12] है। उनमें से प्रत्येक आदमी के लिए गुनाह में से उतना ही भाग है, जितना उसने कमाया। और उनमें से जो उसके बड़े भाग का ज़िम्मेदार[13] बना, उसके लिए बहुत बड़ी यातना है।","arabic":"إِنَّ ٱلَّذِينَ جَآءُو بِٱلۡإِفۡكِ عُصۡبَةٞ مِّنكُمۡۚ لَا تَحۡسَبُوهُ شَرّٗا لَّكُمۖ بَلۡ هُوَ خَيۡرٞ لَّكُمۡۚ لِكُلِّ ٱمۡرِيٕٖ مِّنۡهُم مَّا ٱكۡتَسَبَ مِنَ ٱلۡإِثۡمِۚ وَٱلَّذِي تَوَلَّىٰ كِبۡرَهُۥ مِنۡهُمۡ لَهُۥ عَذَابٌ عَظِيمٞ","category":["24 (An-Nur)","An-Nur","Surah An-Nur","Chapter An-Nur","Nur","Surah Nur","Chapter Nur","An Nur","Surah An Nur","Chapter An Nur","Surah 24","Chapter 24","The Light","النُّور"],"ayahNumber":2802,"juzNumber":18,"footnotes":"11. यहाँ से आयत 26 तक उस मिथ्यारोपण का वर्णन किया गया है, जो मुनाफ़िक़ों ने नबी सल्लल्लाहु अलैहि व सल्लम की पत्नी आयशा (रज़ियल्लाहु अन्हा) पर बनी मुस्तलिक़ के युद्ध में वापसी के समय लगाया था। इस युद्ध से वापसी के समय नबी सल्लल्लाहु अलैहि व सल्लम ने एक स्थान पर पड़ाव किया। अभी कुछ रात रह गई थी कि यात्रा की तैयारी होने लगी। उस समय आयशा (रज़ियल्लाहु अन्हा) उस स्थान से दूर शौच के लिए गईं और उनका हार टूटकर गिर गया। वह उसकी खोज में रह गईं। सेवकों ने उनकी पालकी को सवारी पर यह समझ कर लाद दिया कि वह उसमें होंगी। वह आईं तो वहीं लेट गईं कि कोई अवश्य खोजने आएगा। थोड़ी देर में सफ़वान पुत्र मुअत्तल (रज़ियल्लाहु अन्हु) जो यात्रियों के पीछे उन की गिरी-पड़ी चीज़ों को संभालने का काम करते थे, वहाँ आ गए। और इन्ना लिल्लाह पढ़ी, जिससे आप जाग गईं और उनको पहचान लिया। क्योंकि उन्होंने पर्दें का आदेश आने से पहले उन्हें देखा था। उन्होंने आपको अपने ऊँट पर सवार किया और स्वयं पैदल चलकर यात्रियों से जा मिले। मुनाफ़िक़ों ने इस अवसर को उचित जाना, और उनके मुखिया अब्दुल्लाह बिन उबय्य ने कहा कि यह एकांत अकारण नहीं था। और आयशा (रज़ियल्लाहु अन्हा) को सफ़वान के साथ कलंकित कर दिया। और उस के षड्यंत्र में कुछ सच्चे मुसलमान भी आ गए। इसका पूरा विवरण ह़दीस में मिलेगा। (देखिए सह़ीह़ बुख़ारी : 4750) 12. अर्थ यह है कि इस दुःख पर तुम्हें प्रतिफल मिलेगा। 13. इससे तात्पर्य अब्दुल्लाह बिन उबय्य मुनाफ़िक़ों का मुखिया है।","lang":"hi","version":{"key":"hindi_omari","direction":"ltr","language_iso_code":"hi","version":"1.1.4","last_update":1675069101,"title":"Hindi Translation","description":"Translation of the Quran meanings into Indian by Azizul-Haqq Al-Umary."},"meta":{"transliteration":"inna alladhīna jāū bil-if'ki ʿuṣ'batun minkum lā taḥsabūhu sharran lakum bal huwa khayrun lakum likulli im'ri-in min'hum mā ik'tasaba mina al-ith'mi wa-alladhī tawallā kib'rahu min'hum lahu ʿadhābun ʿaẓīmun ","translations":["Indeed","those who","brought","the lie","(are) a group","among you","(Do) not","think it","bad","for you","nay","it","(is) good","for you","For every","person","among them","(is) what","he earned","of","the sin","and the one who","took upon himself a greater share of it","took upon himself a greater share of it","among them ","for him","(is) a punishment","great","(11)"],"transliterationArr":["inna","alladhīna","jāū","bil-if'ki","ʿuṣ'batun","minkum","lā","taḥsabūhu","sharran","lakum","bal","huwa","khayrun","lakum","likulli","im'ri-in","min'hum","mā","ik'tasaba","mina","al-ith'mi","wa-alladhī","tawallā","kib'rahu","min'hum","lahu","ʿadhābun","ʿaẓīmun",null],"verseTiming":[[1,0,1480],[2,1480,2480],[3,2480,4850],[4,4850,5810],[5,5810,6620],[6,6620,8730],[7,8730,9110],[8,9110,10340],[9,10340,11000],[10,11000,12270],[11,12270,12670],[12,12670,13100],[13,13100,13800],[14,13800,15160],[15,15160,15900],[16,15900,16600],[17,16600,18090],[18,18090,19010],[19,19010,19880],[20,19880,20190],[21,20190,20920],[22,20920,22490],[23,22490,23490],[24,23490,24540],[25,24540,25420],[26,25420,25980],[27,25980,26920],[28,26920,29455]]}}