{"name":"24:2","price":"जो व्यभिचार[1] करने वाली महिला है और जो व्यभिचार करने वाला पुरुष है, दोनों में से प्रत्येक को सौ कोड़े मारो। और तुम्हें अल्लाह के धर्म के विषय में उन दोनों पर कोई तरस न आए[2], यदि तुम अल्लाह तथा अंतिम दिन पर ईमान रखते हो। और आवश्यक है कि उनके दंड के समय ईमानवालों का एक समूह उपस्थित[3] हो।","arabic":"ٱلزَّانِيَةُ وَٱلزَّانِي فَٱجۡلِدُواْ كُلَّ وَٰحِدٖ مِّنۡهُمَا مِاْئَةَ جَلۡدَةٖۖ وَلَا تَأۡخُذۡكُم بِهِمَا رَأۡفَةٞ فِي دِينِ ٱللَّهِ إِن كُنتُمۡ تُؤۡمِنُونَ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِۖ وَلۡيَشۡهَدۡ عَذَابَهُمَا طَآئِفَةٞ مِّنَ ٱلۡمُؤۡمِنِينَ","category":["24 (An-Nur)","An-Nur","Surah An-Nur","Chapter An-Nur","Nur","Surah Nur","Chapter Nur","An Nur","Surah An Nur","Chapter An Nur","Surah 24","Chapter 24","The Light","النُّور"],"ayahNumber":2793,"juzNumber":18,"footnotes":"1. व्यभिचार से संबंधित आरंभिक आदेश सूरतुन्-निसा, आयत : 15 में आ चुका है। अब यहाँ निश्चित रूप से उसका दंड निर्धारित कर दिया गया है। आयत में वर्णित सौ कोड़े दंड अविवाहित व्यभिचारी तथा व्याभिचारिणी के लिए हैं। आप (सल्लल्लाहु अलैहि व सल्लम) अविवाहित व्यभिचारी को सौ कोड़े मारने का और एक वर्ष देश से निकाल देने का आदेश देते थे। (सह़ीह़ बुख़ारी : 6831) किंतु यदि दोनों में कोई विवाहित है, तो उसके लिए रज्म (पत्थरों से मार डालने) का दंड है। आप सल्लल्लाहु अलैहि व सल्लम ने फरमाया : मुझसे (शिक्षा) ले लो, मुझसे (शिक्षा) ले लो। अल्लाह ने उनके लिए राह बना दी। अविवाहित के लिए सौ कोड़े और विवाहित के लिए रज्म है। (सह़ीह़ मुस्लिम : 1690, अबूदाऊद : 4418) इत्यादि। आप सल्लल्लाहु अलैहि व सल्लम ने अपने युग में रज्म का दंड दिया, जिसके सह़ीह़ ह़दीसों में कई उदाहरण हैं। और ख़ुलफ़ा-ए-राशिदीन के युग में भी यही दंड दिया गया। और इसपर मुस्लिम समुदाय का इज्मा (सर्वसम्मति) है। व्यभिचार ऐसा घोर पाप है, जिससे पारिवारिक व्यवस्था अस्त-व्यस्त हो जाती है। पति-पत्नि को एक-दूसरे पर विश्वास नहीं रह जाता। और यदि कोई शिशु जन्म ले, तो उसके पालन-पोषण की गंभीर समस्या सामने आती है। इसीलिये इस्लाम ने इसका घोर दंड रखा है ताकि समाज और समाज वालों को शांत और सुरक्षित रखा जाए। 2. अर्थात दया भाव के कारण दंड देने से न रुक जाओ। 3. ताकि लोग दंड से शिक्षा लें।","lang":"hi","version":{"key":"hindi_omari","direction":"ltr","language_iso_code":"hi","version":"1.1.4","last_update":1675069101,"title":"Hindi Translation","description":"Translation of the Quran meanings into Indian by Azizul-Haqq Al-Umary."},"meta":{"transliteration":"al-zāniyatu wal-zānī fa-ij'lidū kulla wāḥidin min'humā mi-ata jaldatin walā takhudh'kum bihimā rafatun fī dīni al-lahi in kuntum tu'minūna bil-lahi wal-yawmi al-ākhiri walyashhad ʿadhābahumā ṭāifatun mina al-mu'minīna ","translations":["The fornicatress","and the fornicator","[then] flog","each","one","of them","(with) hundred","lash(es)","And (let) not","withhold you","pity for them","pity for them","concerning","(the) religion of Allah","(the) religion of Allah","if","you","believe","in Allah","and the Day","the Last","And let witness","their punishment","a group","of","the believers","(2)"],"transliterationArr":["al-zāniyatu","wal-zānī","fa-ij'lidū","kulla","wāḥidin","min'humā","mi-ata","jaldatin","walā","takhudh'kum","bihimā","rafatun","fī","dīni","al-lahi","in","kuntum","tu'minūna","bil-lahi","wal-yawmi","al-ākhiri","walyashhad","ʿadhābahumā","ṭāifatun","mina","al-mu'minīna",null],"verseTiming":[[1,0,1910],[2,1910,3120],[3,3120,4240],[4,4240,4980],[5,4980,5920],[6,5920,7800],[7,7800,8440],[8,8440,10200],[9,10200,10830],[10,10830,12970],[11,12970,13730],[12,13730,15370],[13,15370,16010],[14,16010,16650],[15,16650,17540],[16,17540,18580],[17,18580,20050],[18,20050,21430],[19,21430,22540],[20,22540,23690],[21,23690,24750],[22,24750,26880],[23,26880,28450],[24,28450,30870],[25,30870,31000],[26,31000,32570],[27,32570,36645]]}}