{"name":"2:228","price":"तथा जिन स्त्रियों को तलाक़ दे दी गई है, वे तीन बार मासिक धर्म आने तक अपने आपको (विवाह से) प्रतीक्षा में रखें। और उनके लिए ह़लाल (वैध) नहीं कि वह चीज़ छिपाएँ जो अल्लाह ने उनके गर्भाशयों में पैदा[143] की है, यदि वे अल्लाह तथा अंतिम दिन पर ईमान रखती हैं। तथा उनके पति इस अवधि में उन्हें वापस लौटाने के अधिक हक़दार[144] हैं, यदि वे मामला ठीक रखने[145] का इरादा रखते हों। तथा परंपरा के अनुसार उन (स्त्रियों)[146] के लिए उसी तरह अधिकार (हक़) है, जैसे उनके ऊपर (पुरुषों का) अधिकार है। तथा पुरुषों को उन (स्त्रियों) पर एक दर्जा प्राप्त है और अल्लाह सब पर प्रभुत्वशाली, पूर्ण हिकमत वाला है।","arabic":"وَٱلۡمُطَلَّقَٰتُ يَتَرَبَّصۡنَ بِأَنفُسِهِنَّ ثَلَٰثَةَ قُرُوٓءٖۚ وَلَا يَحِلُّ لَهُنَّ أَن يَكۡتُمۡنَ مَا خَلَقَ ٱللَّهُ فِيٓ أَرۡحَامِهِنَّ إِن كُنَّ يُؤۡمِنَّ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِۚ وَبُعُولَتُهُنَّ أَحَقُّ بِرَدِّهِنَّ فِي ذَٰلِكَ إِنۡ أَرَادُوٓاْ إِصۡلَٰحٗاۚ وَلَهُنَّ مِثۡلُ ٱلَّذِي عَلَيۡهِنَّ بِٱلۡمَعۡرُوفِۚ وَلِلرِّجَالِ عَلَيۡهِنَّ دَرَجَةٞۗ وَٱللَّهُ عَزِيزٌ حَكِيمٌ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":235,"juzNumber":2,"footnotes":"143. अर्थात मासिक धर्म अथवा गर्भ को। 144. यह बताया गया है कि पति तलाक़ के पश्चात् पत्नी को लौटाना चाहे तो उसे इसका अधिकार है। क्योंकि विवाह का मूल लक्ष्य मिलाप है, अलगाव नहीं। 145. हानि पहुँचाने अथवा दुःख देने के लिए नहीं। 146. यहाँ यह ज्ञातव्य है कि जब इस्लाम आया तो संसार यह जानता ही न था कि स्त्रियों के भी कुछ अधिकार हो सकते हैं। स्त्रियों को संतान उत्पन्न करने का एक साधन समझा जाता था, और उनकी मुक्ति इसी में थी कि वह पुरुषों की सेवा करें। प्राचीन धर्मानुसार स्त्री को पुरुष की संपत्ति समझा जाता था। पुरुष तथा स्त्री समान नहीं थे। स्त्री में मानव आत्मा के स्थान पर एक दूसरी आत्मा होती थी। रूमी विधान में भी स्त्री का स्थान पुरुष से बहुत नीचे था। जब कभी मानव शब्द बोला जाता, तो उससे संबोधित पुरुष होता था। स्त्री, पुरुष के साथ खड़ी नहीं हो सकती थी। कुछ अमानवीय विचारों में जन्म से पाप का सारा बोझ स्त्री पर डाल दिया जाता। आदम के पाप का कारण ह़व्वा हुई। इस लिए पाप का पहला बीज स्त्री के हाथों पड़ा। और वही शैतान का साधन बनी। अब सदा स्त्री में पाप की प्रेरणा उभरती रहेगी। धार्मिक विषय में भी स्त्री पुरुष के समान न हो सकी। परंतु इस्लाम ने केवल स्त्रियों के अधिकार का विचार ही नहीं दिया, बल्कि खुला एलान कर दिया कि जैसे पुरुषों के अधिकार हैं, वैस स्त्रियों के भी पुरुषों पर अधिकार हैं। क़ुरआन ने इन चार शब्दों में स्त्री को वह सब कुछ दे दिया है जो उसका अधिकार था। और जो उसे कभी नहीं मिला था। इन शब्दों द्वारा उसके सम्मान और समता की घोषणा कर दी। दामपत्य जीवन तथा सामाजिकता की कोई ऐसी बात नहीं जो इन चार शब्दों में न आ गई हो। यद्यपि आगे यह भी कहा गया है कि पुरुषों के लिए स्त्रियों पर एक विशेष प्रधानता है। ऐसा क्यों है? इसका कारण हमें आगामी सूरतुन-निसा में मिल जाता है कि यह इस लिए है कि पुरुष अपना धन स्त्रियों पर खर्च करते हैं। अर्थात पारिवारिक जीवन की व्यवस्था के लिए एक व्यवस्थापक अवश्य होना चाहिए। और इसका भार पुरुषों पर रखा गया है। यही उनकी प्रधानता तथा विशेषता है, जो केवल एक भार है। इससे पुरुष की जन्म से कोई प्रधानता सिद्ध नहीं होती। यह केवल एक पारिवारिक व्यवस्था के कारण हुआ है।","lang":"hi","version":{"key":"hindi_omari","direction":"ltr","language_iso_code":"hi","version":"1.1.4","last_update":1675069101,"title":"Hindi Translation","description":"Translation of the Quran meanings into Indian by Azizul-Haqq Al-Umary."},"meta":{"transliteration":"wal-muṭalaqātu yatarabbaṣna bi-anfusihinna thalāthata qurūin walā yaḥillu lahunna an yaktum'na mā khalaqa al-lahu fī arḥāmihinna in kunna yu'minna bil-lahi wal-yawmi al-ākhiri wabuʿūlatuhunna aḥaqqu biraddihinna fī dhālika in arādū iṣ'lāḥan walahunna mith'lu alladhī ʿalayhinna bil-maʿrūfi walilrrijāli ʿalayhinna darajatun wal-lahu ʿazīzun ḥakīmun ","translations":["And the women who are divorced","shall wait","concerning themselves","(for) three","monthly periods","And (it is) not","lawful","for them","that","they conceal","what","(has been) created","(by) Allah","in","their wombs","if","they","believe","in Allah","and the Day","[the] Last","And their husbands","(have) better right","to take them back","in","that (period)","if","they wish","(for) reconciliation","And for them","(is the) like","(of) that which","(is) on them","in a reasonable manner","and for the men","over them","(is) a degree","And Allah","(is) All-Mighty","All-Wise","(228)"],"transliterationArr":["wal-muṭalaqātu","yatarabbaṣna","bi-anfusihinna","thalāthata","qurūin","walā","yaḥillu","lahunna","an","yaktum'na","mā","khalaqa","al-lahu","fī","arḥāmihinna","in","kunna","yu'minna","bil-lahi","wal-yawmi","al-ākhiri","wabuʿūlatuhunna","aḥaqqu","biraddihinna","fī","dhālika","in","arādū","iṣ'lāḥan","walahunna","mith'lu","alladhī","ʿalayhinna","bil-maʿrūfi","walilrrijāli","ʿalayhinna","darajatun","wal-lahu","ʿazīzun","ḥakīmun",null],"verseTiming":[[1,0,1710],[2,1710,3030],[3,3030,5570],[4,5570,6570],[5,6570,8790],[6,8790,9320],[7,9320,10060],[8,10060,11290],[9,11290,11700],[10,11700,13050],[11,13050,13440],[12,13440,14030],[13,14030,14730],[14,14730,16090],[15,16090,18160],[16,18160,19170],[17,19170,20330],[18,20330,21880],[19,21880,22860],[20,22860,23810],[21,23810,24670],[22,24670,27400],[23,27400,28200],[24,28200,29940],[25,29940,30360],[26,30360,31080],[27,31080,31440],[28,31440,33510],[29,33510,34860],[30,34860,36650],[31,36650,37130],[32,37130,37890],[33,37890,39410],[34,39410,41679],[35,41679,43320],[36,43320,44980],[37,44980,46130],[38,46130,47050],[39,47050,47980],[40,47980,50005]]}}