{"name":"30:6","price":"यह अल्लाह का वादा है। अल्लाह अपने वादे[1] के विरुद्ध नहीं करता। परंतु अधिकतर लोग नहीं जानते।","arabic":"وَعۡدَ ٱللَّهِۖ لَا يُخۡلِفُ ٱللَّهُ وَعۡدَهُۥ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يَعۡلَمُونَ","category":["30 (Ar-Rum)","Ar-Rum","Surah Ar-Rum","Chapter Ar-Rum","Rum","Surah Rum","Chapter Rum","Ar Rum","Surah Ar Rum","Chapter Ar Rum","Surah 30","Chapter 30","The Romans","الرُّوم"],"ayahNumber":3415,"juzNumber":21,"footnotes":"1. इन आयतों के अंदर दो भविष्यवाणियाँ की गई हैं। जो क़ुरआन शरीफ़ तथा स्वयं नबी (सल्लल्लाहु अलैहि व सल्लम) के सत्य होने का ऐतिहासिक प्रमाण हैं। यह वह युग था जब नबी (सल्लल्लाहु अलैहि व सल्लम) और मक्का के क़ुरैश के बीच युद्ध आरंभ हो गया था। रूम के राजा क़ैसर को उस समय, ईरान के राजा किस्रा ने पराजित कर दिया था। जिससे मक्का वासी प्रसन्न थे। क्योंकि वह अग्नि के पुजारी थे। और रूमी ईसाई अकाशीय धर्म के अनुयायी थे। और कह रहे थे कि हम मिश्रणवादी भी इसी प्रकार मुसलमानों को पराजित कर देंगे जिस प्रकार रूमियों को ईरानियों ने पराजित किया। इसी पर यह दो भविष्यवाणी की गई कि रूमी कुछ वर्षों में फिर विजयी हो जाएँगे और यह भविष्यवाणी इसके साथ पूरी होगी कि मुसलमान भी उसी समय विजय होकर प्रसन्न हो रहे होंगे। और ऐसा ही हुआ कि 9 वर्ष के भीतर रूमियों ने ईरानियों को पराजित कर दिया।","lang":"hi","version":{"key":"hindi_omari","direction":"ltr","language_iso_code":"hi","version":"1.1.4","last_update":1675069101,"title":"Hindi Translation","description":"Translation of the Quran meanings into Indian by Azizul-Haqq Al-Umary."},"meta":{"transliteration":"waʿda al-lahi lā yukh'lifu al-lahu waʿdahu walākinna akthara al-nāsi lā yaʿlamūna ","translations":["(It is the) Promise","(of) Allah","(Does) not","fail","Allah","(in) His promise","but","most (of)","[the] people","(do) not","know","(6)"],"transliterationArr":["waʿda","al-lahi","lā","yukh'lifu","al-lahu","waʿdahu","walākinna","akthara","al-nāsi","lā","yaʿlamūna",null],"verseTiming":[[1,0,830],[2,830,4110],[3,4110,4510],[4,4510,5340],[5,5340,6300],[6,6300,7340],[7,7340,9350],[8,9350,10190],[9,10190,11949],[10,11949,12299],[11,12299,15384]]}}