{"name":"31:34","price":"निःसंदेह अल्लाह ही के पास क़ियामत का ज्ञान[17] है और वही वर्षा उतारता है, और वह जानता है जो कुछ गर्भाशयों में है, और कोई प्राणी नहीं जानता कि वह कल क्या कमाएगा, और कोई प्राणी नहीं जानता कि वह किस धरती में मरेगा। निःसंदेह अल्लाह सब कुछ जानने वाला, हर चीज़ की ख़बर रखने वाला है।","arabic":"إِنَّ ٱللَّهَ عِندَهُۥ عِلۡمُ ٱلسَّاعَةِ وَيُنَزِّلُ ٱلۡغَيۡثَ وَيَعۡلَمُ مَا فِي ٱلۡأَرۡحَامِۖ وَمَا تَدۡرِي نَفۡسٞ مَّاذَا تَكۡسِبُ غَدٗاۖ وَمَا تَدۡرِي نَفۡسُۢ بِأَيِّ أَرۡضٖ تَمُوتُۚ إِنَّ ٱللَّهَ عَلِيمٌ خَبِيرُۢ","category":["31 (Luqman)","Luqman","Surah Luqman","Chapter Luqman","Surah 31","Chapter 31","Luqman","لقمَان"],"ayahNumber":3503,"juzNumber":21,"footnotes":"17. अबू हुरैरह (रज़ियल्लाहु अन्हु) फरमाते हैं कि नबी सल्लल्लाहु अलैहि व सल्लम एक दिन लोगों के बीच बैठे हुए थे कि एक व्यक्ति आ गया, और प्रश्न किया कि अल्लाह के रसूल! ईमान क्या है? आपने कहा : ईमान यह है कि तुम अल्लाह पर तथा उसके फ़रिश्तों, उसके सब रसूलों और उससे मिलने और फिर दोबारा जीवित किए जाने पर ईमान लाओ। उसने कहा : इस्लाम क्या है? आपने कहा : इस्लाम यह है कि केवल अल्लाह की इबादत करो और किसी वस्तु को उसका साझी न बनाओ, तथा नमाज़ की स्थापना करो और ज़कात दो, तथा रमज़ान के रोज़े रखो। उसने कहा : एहसान किया है? आपने कहा : एहसान यह है कि अल्लाह की इबादत ऐसे करो जैसे तुम उसे देख रहे हो। यदि यह न हो सके, तो यह ख़्याल रखो कि निश्चय वह तुम्हें देख रहा है। उसने कहा : प्रलय कब होगी? आप ने कहा : मैं प्रश्नकर्ता से अधिक नहीं जानता। परंतु मैं तुम्हें उसकी कुछ निशानियाँ बताऊँगा : जब स्त्री अपने स्वामिनी को जन्म देगी और जब नंगे निःवस्त्र लोग मुखिया हो जाएँगे। क़ियामत उन पाँच बातों में से एक है जो अल्लाह के सिवा कोई नहीं जानता। और आपने यही आयत पढ़ी। फिर वह व्यक्ति चला गया। आपने कहा : उसे बुलाओ, तो वह नहीं मिला। आपने फरमाया : यह जिबरील थे, तुम्हें तुम्हारा धर्म सिखाने आए थे। (सह़ीह़ बुख़ारी : 4777)","lang":"hi","version":{"key":"hindi_omari","direction":"ltr","language_iso_code":"hi","version":"1.1.4","last_update":1675069101,"title":"Hindi Translation","description":"Translation of the Quran meanings into Indian by Azizul-Haqq Al-Umary."},"meta":{"transliteration":"inna al-laha ʿindahu ʿil'mu al-sāʿati wayunazzilu al-ghaytha wayaʿlamu mā fī al-arḥāmi wamā tadrī nafsun mādhā taksibu ghadan wamā tadrī nafsun bi-ayyi arḍin tamūtu inna al-laha ʿalīmun khabīrun ","translations":["Indeed","Allah","with Him","(is the) knowledge","(of) the Hour","and He sends down","the rain","and knows","what","(is) in","the wombs","And not","knows","any soul","what","it will earn","tomorrow","and not","knows","any soul","in what","land","it will die","Indeed","Allah","(is) All-Knower","All-Aware","(34)"],"transliterationArr":["inna","al-laha","ʿindahu","ʿil'mu","al-sāʿati","wayunazzilu","al-ghaytha","wayaʿlamu","mā","fī","al-arḥāmi","wamā","tadrī","nafsun","mādhā","taksibu","ghadan","wamā","tadrī","nafsun","bi-ayyi","arḍin","tamūtu","inna","al-laha","ʿalīmun","khabīrun",null],"verseTiming":[[1,0,1300],[2,1300,2090],[3,2090,3650],[4,3650,4230],[5,4230,5230],[6,5230,6310],[7,6310,7180],[8,7180,8090],[9,8090,8490],[10,8490,8720],[11,8720,11709],[12,11709,12729],[13,12729,13539],[14,13539,14159],[15,14159,15729],[16,15729,16579],[17,16579,17279],[18,17279,18199],[19,18199,19039],[20,19039,20559],[21,20559,21369],[22,21369,22669],[23,22669,25529],[24,25529,26989],[25,26989,27959],[26,27959,28939],[27,28939,32924]]}}