{"name":"34:28","price":"तथा हमने आपको[28] समस्त मनुष्यों के लिए शुभ सूचना देने वाला और डराने वाला ही बनाकर भेजा है। किन्तु अधिकतर लोग नहीं जानते।","arabic":"وَمَآ أَرۡسَلۡنَٰكَ إِلَّا كَآفَّةٗ لِّلنَّاسِ بَشِيرٗا وَنَذِيرٗا وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يَعۡلَمُونَ","category":["34 (Saba)","Saba","Surah Saba","Chapter Saba","Surah 34","Chapter 34","Sheba","سَبَأ"],"ayahNumber":3634,"juzNumber":22,"footnotes":"28. इस आयत में अल्लाह ने मुह़्म्मद (सल्लल्लाहु अलैहि व सल्लम) के विश्वव्यापि रसूल तथा सर्व मनुष्य जाति के पथ प्रदर्शक होने की घोषणा की है। जिसे सूरतुल-आराफ़, आयत संख्या : 158, तथा सूरतुल-फ़ुर्क़ान आयत संख्या : 1 में भी वर्णित किया गया है। इसी प्रकार आप (सल्लल्लाहु अलैहि व सल्लम) ने फरमाया कि मुझे पाँच ऐसी चीज़ें दी गई हैं जो मुझसे पूर्व किसी नबी को नहीं दी गईं। और वे ये हैं : 1. एक महीने की दूरी तक शत्रुओं के दिलों में मेरी धाक द्वारा मेरी सहायता की गई है। 2. पूरी धरती मेरे लिए मस्जिद तथा पवित्र बना दी गई है। 3. युद्ध में प्राप्त धन मेरे लिए वैध कर दिया गया है, जो पहले किसी नबी के लिये वैध नहीं किया गया। 4. मुझे सिफ़ारिश का अधिकार दिया गया है। 5. मुझसे पहले के नबी मात्र अपने समुदाय के लिए भेजे जाते थे, परंतु मुझे संपूर्ण मानव जाति के लिए नबी बनाकर भेजा गया है। (सह़ीह़ बुख़ारी : 335) आयत का भावार्थ यह है कि आपके आगमन के पश्चात् आपपर ईमान लाना तथा आपके लाए धर्म विधान क़ुरआन का अनुपालन करना पूरे मानव विश्व पर अनिवार्य है। और यही सत्धर्म तथा मुक्ति मार्ग है। जिसे अधिक्तर लोग नहीं जानते। नबी (सल्लल्लाहु अलैहि व सल्लम) ने फरमाया : उसकी शपथ जिसके हाथ में मेरे प्राण हैं! इस उम्मत का कोई यहूदी और ईसाई मुझे सुनेगा और मौत से पहले मेरे धर्म पर ईमान नहीं लाएगा, तो वह नरक में जाएगा। (सह़ीह़ मुस्लिम : 153)","lang":"hi","version":{"key":"hindi_omari","direction":"ltr","language_iso_code":"hi","version":"1.1.4","last_update":1675069101,"title":"Hindi Translation","description":"Translation of the Quran meanings into Indian by Azizul-Haqq Al-Umary."},"meta":{"transliteration":"wamā arsalnāka illā kāffatan lilnnāsi bashīran wanadhīran walākinna akthara al-nāsi lā yaʿlamūna ","translations":["And not","We have sent you","except","comprehensively","to mankind","(as) a giver of glad tidings","and (as) a warner","But","most","[the] people","(do) not","know","(28)"],"transliterationArr":["wamā","arsalnāka","illā","kāffatan","lilnnāsi","bashīran","wanadhīran","walākinna","akthara","al-nāsi","lā","yaʿlamūna",null],"verseTiming":[[1,0,2140],[2,2140,3400],[3,3400,4050],[4,4050,7240],[5,7240,8930],[6,8930,10250],[7,10250,11860],[8,11860,13410],[9,13410,14180],[10,14180,15460],[11,15460,15760],[12,15760,18135]]}}