{"name":"3:121","price":"तथा (ऐ नबी! वह समय याद करो) जब आप अपने घर से निकले, ईमान वालों को युद्ध[65] के मोर्चों पर नियुक्त कर रहे थे तथा अल्लाह सब कुछ सुनने वाला, जानने वाला है।","arabic":"وَإِذۡ غَدَوۡتَ مِنۡ أَهۡلِكَ تُبَوِّئُ ٱلۡمُؤۡمِنِينَ مَقَٰعِدَ لِلۡقِتَالِۗ وَٱللَّهُ سَمِيعٌ عَلِيمٌ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":414,"juzNumber":4,"footnotes":"65. साधारण भाष्यकारों ने इसे उह़ुद के युद्ध से संबंधित माना है। जो बद्र के युद्ध के पश्चात् सन् 3 हिज्री में हुआ। जिसमें क़ुरैश ने बद्र की पराजय का बदला लेने के लिए तीन हज़ार की सेना के साथ उह़ुद पर्वत के समीप पड़ाव डाल दिया। जब आपको इसकी सूचना मिली तो मुसलमानों से परामर्श किया। अधिकांश की राय हुई कि मदीना नगर से बाहर निकल कर युद्ध किया जाए। और आप सल्लल्लाहु अलैहि व सल्लम एक हज़ार मुसलमानों को लेकर निकले। जिसमें से अब्दुल्लाह बिन उबय्य मुनाफ़िक़ों का प्रमुख अपने तीन सौ साथियों के साथ वापस हो गया। आपने रणक्षेत्र में अपने पीछे से शत्रु के आक्रमण से बचाव के लिए 70 धनुर्धरों को नियुक्त कर दिया। और उनका सेनापति अब्दुल्लाह बिन जुबैर को बना दिया। तथा यह आदेश दिया कि कदापि इस स्थान को न छोड़ना। युद्ध आरंभ होते ही क़ुरैश पराजित हो कर भाग खड़े हुए। यह देखकर धनुर्धरों में से अधिकांश ने अपना स्थान छोड़ दिया। क़ुरैश के सेनापति ख़ालिद पुत्र वलीद ने अपने सवारों के साथ फिर कर धनुर्धरों के स्थान पर आक्रमण कर दिया। फिर आकस्मात् मुसलमानों पर पीछे से आक्रमण करके उनकी विजय को पराजय में बदल दिया। जिसमें आप सल्लल्लाहु अलैहि व सल्लम को भी आघात पहुँचा। (तफ़्सीर इब्ने कसीर।)","lang":"hi","version":{"key":"hindi_omari","direction":"ltr","language_iso_code":"hi","version":"1.1.4","last_update":1675069101,"title":"Hindi Translation","description":"Translation of the Quran meanings into Indian by Azizul-Haqq Al-Umary."},"meta":{"transliteration":"wa-idh ghadawta min ahlika tubawwi-u al-mu'minīna maqāʿida lil'qitāli wal-lahu samīʿun ʿalīmun ","translations":["And when","you left early morning","from","your household","to post","the believers","(to take) positions","for the battle","And Allah","(is) All-Hearing","All-Knowing","(121)"],"transliterationArr":["wa-idh","ghadawta","min","ahlika","tubawwi-u","al-mu'minīna","maqāʿida","lil'qitāli","wal-lahu","samīʿun","ʿalīmun",null],"verseTiming":[[1,0,720],[2,720,1640],[3,1640,2010],[4,2010,2860],[5,2860,3890],[6,3890,5420],[7,5420,6630],[8,6630,9040],[9,9040,10360],[10,10360,11500],[11,11500,13745]]}}