{"name":"42:38","price":"तथा जिन लोगों ने अपने रब का हुक्म माना और नमाज़ क़ायम की और उनका काम आपस में परामर्श करना है[29] और जो कुछ हमने उन्हें दिया है उसमें से ख़र्च करते हैं।","arabic":"وَٱلَّذِينَ ٱسۡتَجَابُواْ لِرَبِّهِمۡ وَأَقَامُواْ ٱلصَّلَوٰةَ وَأَمۡرُهُمۡ شُورَىٰ بَيۡنَهُمۡ وَمِمَّا رَزَقۡنَٰهُمۡ يُنفِقُونَ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura","Chapter Ash-Shura","Shura","Surah Shura","Chapter Shura","Ash Shura","Surah Ash Shura","Chapter Ash Shura","Surah 42","Chapter 42","The Consultation","الشُّورىٰ"],"ayahNumber":4310,"juzNumber":25,"footnotes":"29. इस आयत में ईमान वालों का एक उत्तम गुण बताया गया है कि वे अपने प्रत्येक महत्वपूर्ण कार्य परस्पर परामर्श से करते हैं। सूरत आल-इमरान आयत : 159 में नबी (सल्लल्लाहु अलैहि व सल्लम) को आदेश दिया गया है कि आप मुसलमानों से परामर्श करें। तो आप सभी महत्वपूर्ण कार्यों में उनसे परामर्श करते थे। यही नीति तत्पश्चात् आदरणीय ख़लीफ़ा उमर (रज़ियल्लाहु अन्हु) ने भी अपनाई। जब आप घायल हो गए और जीवन की आशा न रही, तो आपने छह व्यक्तियों को नियुक्त कर दिया कि वे आपस के परामर्श से किसी को ख़लीफ़ा चुन लें। और उन्होंने आदरणीय उसमान (रज़ियल्लाहु अन्हु) को ख़लीफ़ा चुन लिया। इस्लाम पहला धर्म है जिसने परामर्श की व्यवस्था की नींव डाली। किंतु यह परामर्श केवल देश का शासन चलाने के विषयों तक सीमित है। फिर भी जिन विषयों में क़ुरआन तथा ह़दीस की शिक्षाएँ मौजूद हों उनमें किसी परामर्श की आवश्यकता नहीं है।","lang":"hi","version":{"key":"hindi_omari","direction":"ltr","language_iso_code":"hi","version":"1.1.4","last_update":1675069101,"title":"Hindi Translation","description":"Translation of the Quran meanings into Indian by Azizul-Haqq Al-Umary."},"meta":{"transliteration":"wa-alladhīna is'tajābū lirabbihim wa-aqāmū al-ṣalata wa-amruhum shūrā baynahum wamimmā razaqnāhum yunfiqūna ","translations":["And those who","respond","to their Lord","and establish","prayer","and their affairs","(are conducted by) consultation","among them","and from what","We have provided them","they spend","(38)"],"transliterationArr":["wa-alladhīna","is'tajābū","lirabbihim","wa-aqāmū","al-ṣalata","wa-amruhum","shūrā","baynahum","wamimmā","razaqnāhum","yunfiqūna",null],"verseTiming":[[1,0,1240],[2,1240,2540],[3,2540,3820],[4,3820,4810],[5,4810,5980],[6,5980,7130],[7,7130,8030],[8,8030,9130],[9,9130,10770],[10,10770,12310],[11,12310,15985]]}}