{"name":"46:29","price":"तथा जब हमने तुम्हारी ओर जिन्नों के एक गिरोह[19] को फेरा, जो क़ुरआन को ध्यान से सुनते थे। तो जब वे उसके पास पहुँचे, तो उन्होंने कहा : चुप हो जाओ। फिर जब वह पूरा हो गया, तो अपनी क़ौम की ओर सचेतकर्ता बनकर लौटे।","arabic":"وَإِذۡ صَرَفۡنَآ إِلَيۡكَ نَفَرٗا مِّنَ ٱلۡجِنِّ يَسۡتَمِعُونَ ٱلۡقُرۡءَانَ فَلَمَّا حَضَرُوهُ قَالُوٓاْ أَنصِتُواْۖ فَلَمَّا قُضِيَ وَلَّوۡاْ إِلَىٰ قَوۡمِهِم مُّنذِرِينَ","category":["46 (Al-Ahqaf)","Al-Ahqaf","Surah Al-Ahqaf","Chapter Al-Ahqaf","Ahqaf","Surah Ahqaf","Chapter Ahqaf","Al Ahqaf","Surah Al Ahqaf","Chapter Al Ahqaf","Surah 46","Chapter 46","The Dunes","الأحقاف"],"ayahNumber":4539,"juzNumber":26,"footnotes":"19. आदरणीय इब्ने अब्बास (रज़ियल्लाहु अन्हुमा) कहते हैं कि एक बार नबी (सल्लल्लाहु अलैहि व सल्लम) अपने कुछ अनुयायियों (सह़ाबा) के साथ उकाज़ के बाज़ार की ओर जा रहे थे। इन दिनों शैतानों को आकाश की सूचनाएँ मिलनी बंद हो गई थीं। तथा उनपर आकाश से अंगारे फेंके जा रहे थे। तो वे इस खोज में पूर्व तथा पश्चिम की दिशाओं में निकले कि इस का क्या कारण है? कुछ शैतान तिहामा (ह़िजाज़) की ओर भी आए और आप (सल्लल्लाहु अलैहि व सल्लम) तक पहुँच गए। उस समय आप \"नखला\" में फ़ज्र की नमाज़ पढ़ा रहे थे। जब जिन्नों ने क़ुरआन सुना, तो उसकी ओर कान लगा दिए। फिर कहा कि यही वह चीज़ है जिसके कारण हमको आकाश की सूचनाएँ मिलनी बंद हो गई हैं। और अपनी जाति से जा कर यह बात कही। तथा अल्लाह ने यह आयत अपने नबी पर उतारी। (सह़ीह़ बुख़ारी : 4921) इन आयतों में संकेत है कि नबी (सल्लल्लाहु अलैहि व सल्लम) जैसे मनुष्यों के नबी थे, वैसे ही जिन्नों के भी नबी थे। और सभी नबी मनुष्यों में आए। (देखिए सूरतुन-नह़्ल, आयत : 43, सूरतुल-फ़ुरक़ान, आयत : 20)","lang":"hi","version":{"key":"hindi_omari","direction":"ltr","language_iso_code":"hi","version":"1.1.4","last_update":1675069101,"title":"Hindi Translation","description":"Translation of the Quran meanings into Indian by Azizul-Haqq Al-Umary."},"meta":{"transliteration":"wa-idh ṣarafnā ilayka nafaran mina al-jini yastamiʿūna al-qur'āna falammā ḥaḍarūhu qālū anṣitū falammā quḍiya wallaw ilā qawmihim mundhirīna ","translations":["And when","We directed","to you","a party","of","the jinn","listening","(to) the Quran","And when","they attended it","they said","Listen quietly","And when","it was concluded","they turned back","to","their people","(as) warners","(29)"],"transliterationArr":["wa-idh","ṣarafnā","ilayka","nafaran","mina","al-jini","yastamiʿūna","al-qur'āna","falammā","ḥaḍarūhu","qālū","anṣitū","falammā","quḍiya","wallaw","ilā","qawmihim","mundhirīna",null],"verseTiming":[[1,0,710],[2,710,3590],[3,3590,4490],[4,4490,5170],[5,5170,6320],[6,6320,7640],[7,7640,9240],[8,9240,10650],[9,10650,12160],[10,12160,13390],[11,13390,15660],[12,15660,17720],[13,17720,19920],[14,19920,20710],[15,20710,21550],[16,21550,22140],[17,22140,23160],[18,23160,28865]]}}