{"name":"49:4","price":"निःसंदेह जो लोग आपको कमरों के बाहर से पुकारते[2] हैं, उनमें से अधिकांश नहीं समझते।","arabic":"إِنَّ ٱلَّذِينَ يُنَادُونَكَ مِن وَرَآءِ ٱلۡحُجُرَٰتِ أَكۡثَرُهُمۡ لَا يَعۡقِلُونَ","category":["49 (Al-Hujurat)","Al-Hujurat","Surah Al-Hujurat","Chapter Al-Hujurat","Hujurat","Surah Hujurat","Chapter Hujurat","Al Hujurat","Surah Al Hujurat","Chapter Al Hujurat","Surah 49","Chapter 49","The Rooms","الحُجرَات"],"ayahNumber":4616,"juzNumber":26,"footnotes":"2. ह़दीस में है कि बनी तमीम के कुछ सवार नबी (सल्लल्लाहु अलैहि व सल्लम) के पास आए, तो आदरणीय अबू बक्र (रज़ियल्लाहु अन्हु) ने कहा कि क़ाक़ाअ बिन उमर को इनका प्रमुख बनाया जाए। और आदरणीय उमर (रज़ियल्लाहु अन्हु) ने कहा : बल्कि अक़रअ बिन ह़ाबिस को बनाया जाए। तो अबू बक्र (रज़ियल्लाहु अन्हु) ने कहा : तुम केवल मेरा विरोध करना चाहते हो। उमर (रज़ियल्लाहु अन्हु) ने कहा : यह बात नहीं है। और दोनों में विवाद होने लगा और उनके स्वर ऊँचे हो गए। इसी पर यह आयत उतरी। (सह़ीह़ बुख़ारी : 4847) इन आयतों में नबी (सल्लल्लाहु अलैहि व सल्लम) के मान-मर्यादा तथा आपका आदर-सम्मान करने की शिक्षा और आदेश दिय गया है। एक ह़दीस में है कि नबी (सल्लल्लाहु अलैहि व सल्लम) ने साबित बिन क़ैस (रज़ियल्लाहु अन्हु) को नहीं पाया, तो एक व्यक्ति से पता लगाने को कहा। वह उनके घर गए, तो वह सिर झुकाए बैठे थे। पूछने पर कहा : बुरा हो गया। नबी (सल्लल्लाहु अलैहि व सल्लम) के पास ऊँची आवाज़ से बोलता था, जिसके कारण मेरे सारे कर्म व्यर्थ हो गए। आपने यह सुनकर कहा : उसे बता दो कि वह नारकी नहीं, वह स्वर्ग में जाएगा। (सह़ीह़ बुख़ारी : 4846)","lang":"hi","version":{"key":"hindi_omari","direction":"ltr","language_iso_code":"hi","version":"1.1.4","last_update":1675069101,"title":"Hindi Translation","description":"Translation of the Quran meanings into Indian by Azizul-Haqq Al-Umary."},"meta":{"transliteration":"inna alladhīna yunādūnaka min warāi al-ḥujurāti aktharuhum lā yaʿqilūna ","translations":["Indeed","those who","call you","from","behind","the private chambers","most of them","(do) not","understand","(4)"],"transliterationArr":["inna","alladhīna","yunādūnaka","min","warāi","al-ḥujurāti","aktharuhum","lā","yaʿqilūna",null],"verseTiming":[[1,0,1490],[2,1490,2450],[3,2450,3960],[4,3960,5110],[5,5110,7890],[6,7890,9180],[7,9180,10240],[8,10240,10780],[9,10780,14195]]}}