{"name":"49:6","price":"ऐ ईमान वालो! यदि कोई दुराचारी (अवज्ञाकारी)[4] तुम्हारे पास कोई सूचना लेकर आए, तो उसकी अच्छी तरह जाँच-पड़ताल कर लिया करो। ऐसा न हो कि तुम किसी समुदाय को अज्ञानता के कारण हानि पहुँचा दो, फिर अपने किए पर पछताओ।","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِن جَآءَكُمۡ فَاسِقُۢ بِنَبَإٖ فَتَبَيَّنُوٓاْ أَن تُصِيبُواْ قَوۡمَۢا بِجَهَٰلَةٖ فَتُصۡبِحُواْ عَلَىٰ مَا فَعَلۡتُمۡ نَٰدِمِينَ","category":["49 (Al-Hujurat)","Al-Hujurat","Surah Al-Hujurat","Chapter Al-Hujurat","Hujurat","Surah Hujurat","Chapter Hujurat","Al Hujurat","Surah Al Hujurat","Chapter Al Hujurat","Surah 49","Chapter 49","The Rooms","الحُجرَات"],"ayahNumber":4618,"juzNumber":26,"footnotes":"4. इसमें इस्लाम का यह नियम बताया गया है कि बिना छान-बीन के किसी की ऐसी बात न मानी जाए जिसका संबंध दीन अथवा बहुत गंभीर समस्या से हो। अथवा उसके कारण कोई बहुत बड़ी समस्या उत्पन्न हो सकती हो। और जैसा कि आप जानते हैं कि अब यह नियम संसार के कोने-कोने में फैल गया है। सारे न्यायालयों में इसी के अनुसार न्याय किया जाता है। और जो इसके विरुद्ध निर्णय करता है उसकी कड़ी आलोचना की जाती है। तथा अब नबी सल्लल्लाहु अलैहि व सल्लम की मृत्यु के पश्चात् यह नियम आप सल्लल्लाहु अलैहि व सल्लम की ह़दीस पाक के लिए भी है। यह छान-बीन किये बग़ैर कि वह सह़ीह़ है या नहीं, उसपर अमल नहीं किया जाना चाहिए। और इस चीज़ को इस्लाम के विद्वानों ने पूरा कर किया है कि अल्लाह के रसूल की वे हदीसें कौन सी हैं जो सह़ीह़ हैं तथा वे कौन सी ह़दीसें हैं जो सह़ीह़ नहीं हैं। यह विशेषता केवल इस्लाम की है। संसार का कोई धर्म यह विशेषता नहीं रखता।","lang":"hi","version":{"key":"hindi_omari","direction":"ltr","language_iso_code":"hi","version":"1.1.4","last_update":1675069101,"title":"Hindi Translation","description":"Translation of the Quran meanings into Indian by Azizul-Haqq Al-Umary."},"meta":{"transliteration":"yāayyuhā alladhīna āmanū in jāakum fāsiqun binaba-in fatabayyanū an tuṣībū qawman bijahālatin fatuṣ'biḥū ʿalā mā faʿaltum nādimīna ","translations":["O you who believe","O you who believe","O you who believe","If","comes to you","a wicked person","with information","investigate","lest","you harm","a people","in ignorance","then you become","over","what","you have done","regretful","(6)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","in","jāakum","fāsiqun","binaba-in","fatabayyanū","an","tuṣībū","qawman","bijahālatin","fatuṣ'biḥū","ʿalā","mā","faʿaltum","nādimīna",null],"verseTiming":[[1,0,3120],[2,3120,4110],[3,4110,5480],[4,5480,6630],[5,6630,7830],[6,7830,10380],[7,10380,12190],[8,12190,13400],[9,13400,15470],[10,15470,19020],[11,19020,20040],[12,20040,21100],[13,21100,22920],[14,22920,25110],[15,25110,26290],[16,26290,26960],[17,26960,27240],[18,27240,28460],[19,28460,31055]]}}