{"name":"5:67","price":"ऐ रसूल![42] जो कुछ आपपर आपके पालनहार की ओर से उतारा गया है, उसे पहुँचा दें। और यदि आपने (ऐसा) न किया, तो आपने उसका संदेश नहीं पहुँचाया। और अल्लाह आपको लोगों से बचाएगा।[43] निःसंदेह अल्लाह काफ़िर लोगों को मार्गदर्शन नहीं प्रदान करता।","arabic":"۞ يَٰٓأَيُّهَا ٱلرَّسُولُ بَلِّغۡ مَآ أُنزِلَ إِلَيۡكَ مِن رَّبِّكَۖ وَإِن لَّمۡ تَفۡعَلۡ فَمَا بَلَّغۡتَ رِسَالَتَهُۥۚ وَٱللَّهُ يَعۡصِمُكَ مِنَ ٱلنَّاسِۗ إِنَّ ٱللَّهَ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلۡكَٰفِرِينَ","category":["5 (Al-Ma'idah)","Al-Ma'idah","Surah Al-Ma'idah","Chapter Al-Ma'idah","Ma'idah","Surah Ma'idah","Chapter Ma'idah","Al Ma'idah","Surah Al Ma'idah","Chapter Al Ma'idah","Surah 5","Chapter 5","The Table Spread","المَائدة"],"ayahNumber":736,"juzNumber":6,"footnotes":"42. अर्थात मुह़म्मद सल्लल्लाहु अलैहि व सल्लम। 43. नबी (सल्लल्लाहु अलैहि व सल्लम) के नबी होने के पश्चात् आपपर विरोधियों ने कई बार प्राण घातक आक्रमण का प्रयास किया। जब आपने मक्का में सफ़ा पर्वत से एकेश्वरवाद का उपदेश दिया, तो आपके चचा अबू लहब ने आपपर पत्थर चलाए। फिर उसी युग में आप काबा के पास नमाज़ पढ़ रहे थे कि अबू जह्ल ने आपकी गर्दन रौंदने का प्रयास किया, किंतु आपके रक्षक फ़रिश्तों को देखकर भागा। और जब क़ुरैश ने यह योजना बनाई कि आपको वध कर दिया जाए, और प्रत्येक क़बीले का एक युवक आपके द्वार पर तलवार लेकर खड़ा रहे और आप निकलें तो सब एक साथ प्रहार कर दें, तब भी आप उनके बीच से निकल गए और किसी ने देखा भी नहीं। फिर आपने अपने साथी अबू बक्र के साथ हिजरत के समय सौर पर्वत की गुफा में शरण ली। काफ़िर गुफा के मुँह तक आपकी खोज में आ पहुँचे, उन्हें आपके साथी ने देखा, किंतु वे आपको नहीं देख सके। तथा जब आप वहाँ से मदीना चले, तो सुराक़ा नामी एक व्यक्ति ने क़रैश के पुरस्कार के लोभ में आकर आपका पीछा किया। किंतु उसके घोड़े के अगले पैर भूमि में धंस गए। उसने आपको गुहारा, आपने दुआ कर दी, और उसका घोड़ा निकल गया। उसने ऐसा प्रयास तीन बार किया, फिर भी असफल रहा। आपने उसको क्षमा कर दिया। और यह देखकर वह मुसलमान हो गया। आपने फरमाया कि एक दिन तुम अपने हाथ में ईरान के राजा का कंगन पहनोगे। और उमर बिन ख़त्ताब के युग में यह बात सच साबित हुई। मदीने में भी यहूदियों के क़बीले बनू नज़ीर ने छत के ऊपर से आप पर भारी पत्थर गिराने का प्रयास किया, जिससे अल्लाह ने आपको सूचित कर दिया। ख़ैबर की एक यहूदी स्त्री ने आपको विष मिलाकर बकरी का मांस खिलाया। परंतु आपपर उसका कोई बड़ा प्रभाव नहीं हुआ। जबकि आपका एक साथी उसे खाकर मर गया। एक युद्ध यात्रा में आप अकेले एक वृक्ष के नीचे सो गए। एक व्यक्ति आया और आप की तलवार लेकर कहा : मुझसे आपको कौन बचाएगा? आपने कहा : अल्लाह! यह सुनकर वह काँपने लगा और उस के हाथ से तलवार गिर गई। आपने उसे क्षमा कर दिया। इन सब घटनाओं से यह सिद्ध हो जाता है कि अल्लाह ने आपकी रक्षा करने का जो वचन आपको दिया, उसको पूरा कर दिया।","lang":"hi","version":{"key":"hindi_omari","direction":"ltr","language_iso_code":"hi","version":"1.1.4","last_update":1675069101,"title":"Hindi Translation","description":"Translation of the Quran meanings into Indian by Azizul-Haqq Al-Umary."},"meta":{"transliteration":"yāayyuhā al-rasūlu balligh mā unzila ilayka min rabbika wa-in lam tafʿal famā ballaghta risālatahu wal-lahu yaʿṣimuka mina al-nāsi inna al-laha lā yahdī al-qawma al-kāfirīna ","translations":["O","Messenger","Convey","what","has been revealed","to you","from","your Lord","and if","not","you do","then not","you (have) conveyed","His Message","And Allah","will protect you","from","the people","Indeed","Allah","(does) not","guide","the people","the disbelieving","(67)"],"transliterationArr":["yāayyuhā","al-rasūlu","balligh","mā","unzila","ilayka","min","rabbika","wa-in","lam","tafʿal","famā","ballaghta","risālatahu","wal-lahu","yaʿṣimuka","mina","al-nāsi","inna","al-laha","lā","yahdī","al-qawma","al-kāfirīna",null],"verseTiming":[[1,0,2630],[2,2630,3630],[3,3630,4400],[4,4400,6120],[5,6120,7540],[6,7540,8320],[7,8320,8460],[8,8460,9900],[9,9900,10220],[10,10220,10800],[11,10800,11560],[12,11560,12230],[13,12230,13270],[14,13270,14760],[15,14760,15680],[16,15680,16730],[17,16730,17170],[18,17170,19860],[19,19860,20960],[20,20960,21870],[21,21870,22180],[22,22180,22870],[23,22870,23600],[24,23600,26175]]}}