{"name":"60:1","price":"ऐ लोगो जो ईमान लाए हो! मेरे शत्रुओं तथा अपने शत्रुओं को मित्र न बनाओ। तुम उनकी ओर मैत्री[1] का संदेश भेजते हो, हालाँकि निश्चय उन्होंने उस सत्य का इनकार किया है, जो तुम्हारे पास आया है। वे रसूल को तथा तुमको इस कारण निकालते हैं कि तुम अपने पालनहार अल्लाह पर ईमान लाए हो। यदि तुम मेरी राह में जिहाद के लिए और मेरी प्रसन्नता तलाश करने के लिए निकले हो (तो ऐसा मत करो)। तुम गुप्त रूप से उनकी ओर मैत्री का संदेश भेजते हो, हालाँकि मैं अधिक जानने वाला हूँ, जो कुछ तुमने छिपाया और जो तुमने ज़ाहिर किया। तथा तुममें से जो भी ऐसा करेगा, तो निश्चय वह सीधे रास्ते से भटक गया।","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَّخِذُواْ عَدُوِّي وَعَدُوَّكُمۡ أَوۡلِيَآءَ تُلۡقُونَ إِلَيۡهِم بِٱلۡمَوَدَّةِ وَقَدۡ كَفَرُواْ بِمَا جَآءَكُم مِّنَ ٱلۡحَقِّ يُخۡرِجُونَ ٱلرَّسُولَ وَإِيَّاكُمۡ أَن تُؤۡمِنُواْ بِٱللَّهِ رَبِّكُمۡ إِن كُنتُمۡ خَرَجۡتُمۡ جِهَٰدٗا فِي سَبِيلِي وَٱبۡتِغَآءَ مَرۡضَاتِيۚ تُسِرُّونَ إِلَيۡهِم بِٱلۡمَوَدَّةِ وَأَنَا۠ أَعۡلَمُ بِمَآ أَخۡفَيۡتُمۡ وَمَآ أَعۡلَنتُمۡۚ وَمَن يَفۡعَلۡهُ مِنكُمۡ فَقَدۡ ضَلَّ سَوَآءَ ٱلسَّبِيلِ","category":["60 (Al-Mumtahanah)","Al-Mumtahanah","Surah Al-Mumtahanah","Chapter Al-Mumtahanah","Mumtahanah","Surah Mumtahanah","Chapter Mumtahanah","Al Mumtahanah","Surah Al Mumtahanah","Chapter Al Mumtahanah","Surah 60","Chapter 60","She that is to be Examined","الممتحنة"],"ayahNumber":5151,"juzNumber":28,"footnotes":"1. मक्का वासियों ने जब ह़ुदैबिया की संधि का उल्लंघन किया, तो नबी (सल्लल्लाहु अलैहि व सल्लम) ने मक्का पर आक्रमण करने के लिए गुप्त रूप से मुसलमानों को तैयारी का आदेश दे दिया। उसी बीच आपकी इस योजना से सूचित करने के लिए ह़ातिब बिन अबी बलतआ ने एक पत्र एक नारी के माध्यम से मक्का वासियों को भेज दिया। जिसकी सूचना नबी (सल्लल्लाहु अलैहि व सल्लम) को वह़्य द्वारा दे दी गई। आपने आदरणीय अली, मिक़दाद तथा ज़बैर से कहा कि जाओ, रौज़ा ख़ाख़ (एक स्थान का नाम) में एक स्त्री मिलेगी जो मक्का जा रही होगी। उसके पास एक पत्र है वह ले आओ। ये लोग वह पत्र लाए। तब नबी (सल्लल्लाहु अलैहि व सल्लम ने कहा : ऐ ह़ातिब! यह क्या है? उन्होंने कहा : यह काम मैंने कुफ़्र तथा अपने धर्म से फिर जाने के कारण नहीं किया है। बल्कि इसका कारण यह है कि अन्य मुहाजिरीन के मक्का में संबंधी हैं। जो उनके परिवार तथा धनों की रक्षा करते हैं। पर मेरा वहाँ कोई संबंधी नहीं है, इस लिए मैंने चाहा कि उन्हें सूचित कर दूँ। ताकि वे मेरे आभारी रहें। और मेरे समीपवर्तियों की रक्षा करें। आपने उनकी सच्चाई के कारण उन्हें कुछ नहीं कहा। फिर भी अल्लाह ने चेतावनी के रूप में यह आयतें उतारीं ताकि भविष्य में कोई मुसलमान काफ़िरों से ऐसा मैत्री संबंध न रखे। (सह़ीह़ बुख़ारी : 4890)","lang":"hi","version":{"key":"hindi_omari","direction":"ltr","language_iso_code":"hi","version":"1.1.4","last_update":1675069101,"title":"Hindi Translation","description":"Translation of the Quran meanings into Indian by Azizul-Haqq Al-Umary."},"meta":{"transliteration":"yāayyuhā alladhīna āmanū lā tattakhidhū ʿaduwwī waʿaduwwakum awliyāa tul'qūna ilayhim bil-mawadati waqad kafarū bimā jāakum mina al-ḥaqi yukh'rijūna al-rasūla wa-iyyākum an tu'minū bil-lahi rabbikum in kuntum kharajtum jihādan fī sabīlī wa-ib'tighāa marḍātī tusirrūna ilayhim bil-mawadati wa-anā aʿlamu bimā akhfaytum wamā aʿlantum waman yafʿalhu minkum faqad ḍalla sawāa al-sabīli ","translations":["O you","who","believe","(Do) not","take","My enemies","and your enemies","(as) allies","offering","them","love","while","they have disbelieved","in what","came to you","of","the truth","driving out","the Messenger","and yourselves","because","you believe","in Allah","your Lord","If","you","come forth","(to) strive","in","My way","and (to) seek","My Pleasure","You confide","to them","love","but I Am","most knowing","of what","you conceal","and what","you declare","And whoever","does it","among you","then certainly","he has strayed","(from the) straight","path","(1)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","lā","tattakhidhū","ʿaduwwī","waʿaduwwakum","awliyāa","tul'qūna","ilayhim","bil-mawadati","waqad","kafarū","bimā","jāakum","mina","al-ḥaqi","yukh'rijūna","al-rasūla","wa-iyyākum","an","tu'minū","bil-lahi","rabbikum","in","kuntum","kharajtum","jihādan","fī","sabīlī","wa-ib'tighāa","marḍātī","tusirrūna","ilayhim","bil-mawadati","wa-anā","aʿlamu","bimā","akhfaytum","wamā","aʿlantum","waman","yafʿalhu","minkum","faqad","ḍalla","sawāa","al-sabīli",null],"verseTiming":[[1,0,2870],[2,2870,3700],[3,3700,4660],[4,4660,4970],[5,4970,6060],[6,6060,6960],[7,6960,8320],[8,8320,10740],[9,10740,11610],[10,11610,13080],[11,13080,14380],[12,14380,14840],[13,14840,15620],[14,15620,16190],[15,16190,18570],[16,18570,19510],[17,19510,20340],[18,20340,21440],[19,21440,22440],[20,22440,23790],[21,23790,24700],[22,24700,25720],[23,25720,26680],[24,26680,27750],[25,27750,28860],[26,28860,30300],[27,30300,31300],[28,31300,32620],[29,32620,33020],[30,33020,34110],[31,34110,36590],[32,36590,37540],[33,37540,39450],[34,39450,40930],[35,40930,42260],[36,42260,42830],[37,42830,43620],[38,43620,45430],[39,45430,46560],[40,46560,48620],[41,48620,51100],[42,51100,52160],[43,52160,53220],[44,53220,54540],[45,54540,55080],[46,55080,55690],[47,55690,57760],[48,57760,59755]]}}