{"name":"63:1","price":"जब आपके पास मुनाफ़िक़ आते हैं, तो कहते हैं : हम गवाही देते हैं कि निःसंदेह आप निश्चय अल्लाह के रसूल हैं। तथा अल्लाह जानता है कि निःसंदेह आप निश्चय अल्लाह के रसूल हैं और अल्लाह गवाही देता है कि मुनाफ़िक़ निश्चित रूप से झूठे[1] हैं।","arabic":"إِذَا جَآءَكَ ٱلۡمُنَٰفِقُونَ قَالُواْ نَشۡهَدُ إِنَّكَ لَرَسُولُ ٱللَّهِۗ وَٱللَّهُ يَعۡلَمُ إِنَّكَ لَرَسُولُهُۥ وَٱللَّهُ يَشۡهَدُ إِنَّ ٱلۡمُنَٰفِقِينَ لَكَٰذِبُونَ","category":["63 (Al-Munafiqun)","Al-Munafiqun","Surah Al-Munafiqun","Chapter Al-Munafiqun","Munafiqun","Surah Munafiqun","Chapter Munafiqun","Al Munafiqun","Surah Al Munafiqun","Chapter Al Munafiqun","Surah 63","Chapter 63","The Hypocrites","المنافقون"],"ayahNumber":5189,"juzNumber":28,"footnotes":"1. आदरणीय ज़ैद पुत्र अर्क़म (रज़ियल्लाहु अन्हु) कहते हैं कि एक युद्ध में मैंने (मुनाफ़िक़ों के प्रमुख) अब्दुल्लाह पुत्र उबय्य को कहते हुए सुना कि उनपर ख़र्च न करो जो अल्लाह के रसूल के पास हैं। यहाँ तक कि वे आपके आस-पास से बिखर जाएँ। और यदि हम मदीना वापस गए, तो हम सम्मानित उससे अपमानित (इससे अभिप्राय वह मुसलमानों को ले रहे थे।) को अवश्य निकाल देंगे। मैंने अपने चाचा को यह बात बता दी। और उन्होंने नबी (सल्लल्लाहु अलैहि व सल्लम) को बता दी। तो आप (सल्लल्लाहु अलैहि व सल्लम) ने अब्दुल्लाह पुत्र उबय्य को बुलाया। उसने और उसके साथियों ने शपथ ले ली कि उन्होंने यह बात नहीं कही है। इस कारण मुझे झूठा समझ लिया गया। जिसपर मुझे बड़ा शोक हुआ और मैं घर में रहने लगा। फिर अल्लाह ने यह सूरह उतारी, तो आपने मुझे बुलाकर सुनाई और कहा : ऐ ज़ैद! अल्लाह ने तुम्हें सच्चा सिद्ध कर दिया है। (सह़ीह़ बुख़ारी : 4900)","lang":"hi","version":{"key":"hindi_omari","direction":"ltr","language_iso_code":"hi","version":"1.1.4","last_update":1675069101,"title":"Hindi Translation","description":"Translation of the Quran meanings into Indian by Azizul-Haqq Al-Umary."},"meta":{"transliteration":"idhā jāaka al-munāfiqūna qālū nashhadu innaka larasūlu al-lahi wal-lahu yaʿlamu innaka larasūluhu wal-lahu yashhadu inna al-munāfiqīna lakādhibūna ","translations":["When","come to you","the hypocrites","they say","We testify","that you","(are) surely (the) Messenger","(of) Allah","And Allah","knows","that you","(are) surely His Messenger","and Allah","testifies","that","the hypocrites","(are) surely liars","(1)"],"transliterationArr":["idhā","jāaka","al-munāfiqūna","qālū","nashhadu","innaka","larasūlu","al-lahi","wal-lahu","yaʿlamu","innaka","larasūluhu","wal-lahu","yashhadu","inna","al-munāfiqīna","lakādhibūna",null],"verseTiming":[[1,0,650],[2,650,2930],[3,2930,4560],[4,4560,5410],[5,5410,6250],[6,6250,7730],[7,7730,8740],[8,8740,9590],[9,9590,10630],[10,10630,11490],[11,11490,12820],[12,12820,14320],[13,14320,15260],[14,15260,16130],[15,16130,17460],[16,17460,19220],[17,19220,22295]]}}