{"name":"66:1","price":"ऐ नबी! आप उस चीज़ को क्यों हराम करते हैं, जिसे अल्लाह ने आपके लिए हलाल किया है? आप अपनी पत्नियों की प्रसन्नता[1] चाहते हैं? तथा अल्लाह अति क्षमाशील, अत्यंत दयावान् है।","arabic":"يَٰٓأَيُّهَا ٱلنَّبِيُّ لِمَ تُحَرِّمُ مَآ أَحَلَّ ٱللَّهُ لَكَۖ تَبۡتَغِي مَرۡضَاتَ أَزۡوَٰجِكَۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ","category":["66 (At-Tahrim)","At-Tahrim","Surah At-Tahrim","Chapter At-Tahrim","Tahrim","Surah Tahrim","Chapter Tahrim","At Tahrim","Surah At Tahrim","Chapter At Tahrim","Surah 66","Chapter 66","The Prohibition","التحريم"],"ayahNumber":5230,"juzNumber":28,"footnotes":"1. ह़दीस में है कि आप सल्लल्लाहु अलैहि व सल्लम अस्र की नमाज़ के पश्चात् अपनी सब पत्नियों के यहाँ कुछ देर के लिए जाया करते थे। एक बार कई दिन अपनी पत्नी ज़ैनब (रज़ियल्लाहु अन्हा) के यहाँ अधिक देर तक रह गए। कारण यह था कि वह आपको मधु पिलाती थीं। आपकी पत्नी आइशा तथा ह़फ़्सा (रज़ियल्लाहु अन्हुमा) ने योजना बनाई कि जब आप आएँ, तो जिसके पास जाएँ वह यह कहे कि आपके मुँह से मग़ाफ़ीर (एक प्रकार का फूल जिसमें दुर्गंध होती है) की गंध आ रही है। और उन्होंने यही किया। जिसपर आपने शपथ ले ली कि अब मधु नहीं पिऊँगा। उसी पर यह आयत उतरी। (बुख़ारी : 4912) इसमें यह संकेत भी है कि नबी (सल्लल्लाहु अलैहि व सल्लम) को भी किसी ह़लाल को ह़राम करने अथवा ह़राम को ह़लाल करने का कोई अधिकार नहीं था।","lang":"hi","version":{"key":"hindi_omari","direction":"ltr","language_iso_code":"hi","version":"1.1.4","last_update":1675069101,"title":"Hindi Translation","description":"Translation of the Quran meanings into Indian by Azizul-Haqq Al-Umary."},"meta":{"transliteration":"yāayyuhā al-nabiyu lima tuḥarrimu mā aḥalla al-lahu laka tabtaghī marḍāta azwājika wal-lahu ghafūrun raḥīmun ","translations":["O","Prophet","Why (do)","you prohibit","what","has made lawful","Allah","for you","seeking","(to) please","your wives","And Allah","(is) Oft-Forgiving","Most Merciful","(1)"],"transliterationArr":["yāayyuhā","al-nabiyu","lima","tuḥarrimu","mā","aḥalla","al-lahu","laka","tabtaghī","marḍāta","azwājika","wal-lahu","ghafūrun","raḥīmun",null],"verseTiming":[[1,0,2770],[2,2770,4410],[3,4410,4760],[4,4760,5780],[5,5780,7830],[6,7830,8580],[7,8580,9500],[8,9500,10350],[9,10350,11280],[10,11280,12270],[11,12270,13780],[12,13780,14720],[13,14720,15750],[14,15750,18305]]}}