{"name":"96:5","price":"उसने इनसान को वह सिखाया, जो वह नहीं जानता था।[1]","arabic":"عَلَّمَ ٱلۡإِنسَٰنَ مَا لَمۡ يَعۡلَمۡ","category":["96 (Al-Alaq)","Al-Alaq","Surah Al-Alaq","Chapter Al-Alaq","Alaq","Surah Alaq","Chapter Alaq","Al Alaq","Surah Al Alaq","Chapter Al Alaq","Surah 96","Chapter 96","The Clot","العلق"],"ayahNumber":6111,"juzNumber":30,"footnotes":"1. (1-5) इन आयतों में प्रथम वह़्य (प्रकाशना) का वर्णन है। नबी (सल्लल्लाहु अलैहि व सल्लम) मक्का से कुछ दूर \"जबल नूर\" (ज्योति पर्वत) की एक गुफा में जिसका नाम \"ह़िरा\" है जाकर एकांत में अल्लाह को याद किया करते थे। और वहीं कई दिन तक रह जाते थे। एक दिन आप इसी गुफा में थे कि अकस्मात आपपर प्रथम वह़्य (प्रकाशना) लेकर फ़रिश्ता उतरा। और आपसे कहा : \"पढ़ो\"। आपने कहा : मैं पढ़ना नहीं जानता। इसपर फ़रिश्ते ने आपको अपने सीने से लगाकर दबाया। इसी प्रकार तीन बार किया और आपको पाँच आयतें सुनाईं। यह प्रथम प्रकाशना थी। अब आप मुह़म्मद पुत्र अब्दुल्लाह से मुह़म्मद रसूलुल्लाह होकर डरते-काँपते घर आए। इस समय आपकी आयु 40 वर्ष थी। घर आकर कहा कि मुझे चादर उढ़ा दो। जब कुछ शांत हुए तो अपनी पत्नी ख़दीजा (रज़ियल्लाहु अन्हा) को पूरी बात सुनाई। उन्होंने आपको सांत्वना दी और अपने चाचा के पुत्र \"वरक़ा बिन नौफ़ल\" के पास ले गईं जो ईसाई विद्वान थे। उन्होंने आपकी बात सुनकर कहा : यह वही फ़रिश्ता है जो मूसा (अलैहिस्सलाम) पर उतारा गया था। काश मैं तुम्हारी नुबुव्वत (दूतत्व) के समय शक्तिशाली युवक होता और उस समय तक जीवित रहता जब तुम्हारी जाति तुम्हें मक्का से निकाल देगी! आपने कहा : क्या लोग मुझे निकाल देंगे? वरक़ा ने कहा : कभी ऐसा नहीं हुआ कि जो आप लाए हैं, उससे शत्रुता न की गई हो। यदि मैंने आपका वह समय पाया, तो आपकी भरपूर सहायता करूँगा। परंतु कुछ ही समय गुज़रा था कि वरक़ा का देहाँत हो गया। और वह समय आया जब आपको 13 वर्ष बाद मक्का से निकाल दिया गया। और आप मदीना की ओर हिजरत (प्रस्थान) कर गए। (देखिए : इब्ने कसीर) आयत संख्या 1 से 5 तक निर्देश दिया गया है कि अपने पालनहार के नाम से उसके आदेश क़ुरआन का अध्ययन करो जिसने इनसान को रक्त के लोथड़े से बनाया। तो जिसने अपनी शक्ति और दक्षता से जीता जागता इनसान बना दिया, वह उसे पुनः जीवित कर देने की भी शक्ति रखता है। फिर ज्ञान अर्थात क़ुरआन प्रदान किए जाने की शुभ सूचना दी गई है।","lang":"hi","version":{"key":"hindi_omari","direction":"ltr","language_iso_code":"hi","version":"1.1.4","last_update":1675069101,"title":"Hindi Translation","description":"Translation of the Quran meanings into Indian by Azizul-Haqq Al-Umary."},"meta":{"transliteration":"ʿallama al-insāna mā lam yaʿlam ","translations":["Taught","man","what","not","he knew","(5)"],"transliterationArr":["ʿallama","al-insāna","mā","lam","yaʿlam",null],"verseTiming":[[1,0,900],[2,900,3010],[3,3010,3350],[4,3350,3770],[5,3770,4615]]}}