{"name":"9:38","price":"ऐ ईमान वालो! तुम्हें क्या हो गया है कि जब तुमसे कहा जाता है कि अल्लाह की राह में निकलो, तो तुम धरती की ओर बहुत बोझल हो जाते हो? क्या तुम आख़िरत (परलोक) की तुलना में दुनिया के जीवन से खुश हो गए हो? तो दुनिया के जीवन का सामान आख़िरत के मुकाबले में बहुत थोड़ा है।[19]","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ مَا لَكُمۡ إِذَا قِيلَ لَكُمُ ٱنفِرُواْ فِي سَبِيلِ ٱللَّهِ ٱثَّاقَلۡتُمۡ إِلَى ٱلۡأَرۡضِۚ أَرَضِيتُم بِٱلۡحَيَوٰةِ ٱلدُّنۡيَا مِنَ ٱلۡأٓخِرَةِۚ فَمَا مَتَٰعُ ٱلۡحَيَوٰةِ ٱلدُّنۡيَا فِي ٱلۡأٓخِرَةِ إِلَّا قَلِيلٌ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1273,"juzNumber":10,"footnotes":"19. ये आयतें तबूक के युद्ध से संबंधित हैं। तबूक मदीना और शाम के बीच एक स्थान का नाम है। जो मदीना से 610 किलोमीटर दूर है। सन् 9 हिजरी में नबी सल्लल्लाहु अलैहि व सल्लम को यह सूचना मिली कि रोम के राजा क़ैसर ने मदीने पर आक्रमण करने का आदेश दिया है। यह मुसलमानों के लिए अरब से बाहर एक बड़ी शक्ति से युद्ध करने का प्रथम अवसर था। अतः आपने तैयारी और कूच का एलान कर दिया। यह बड़ा भीषण समय था, इसलिए मुसलमानों को प्रेरणा दी जा रही है कि इस युद्ध के लिए निकलें। तबूक का युद्ध : मक्का की विजय के पश्चात् ऐसे समाचार मिलने लगे कि रोम का राजा क़ैसर मुसलमानों पर आक्रमण करने की तैयारी कर रहा है। नबी सल्लल्लाहु अलैहि व सल्लम ने जब यह सुना, तो आपने भी मुसलमानों को तैयारी का आदेश दे दिया। उस समय स्थिति बड़ी गंभीर थी। कड़ी धूप तथा खजूरों के पकने का समय था। सवारी तथा यात्रा के संसाधन की कमी थी। मदीना के मुनाफ़िक़ अबु आमिर राहिब के द्वारा ग़स्सान के ईसाई राजा और क़ैसर से मिले हुए थे। उन्होंने मदीना के पास अपने षड्यंत्र के लिए एक मस्जिद भी बना ली थी। और चाहते थे कि मुसलमान पराजित हो जाएँ। वे नबी सल्लल्लाहु अलैहि व सल्ल्म और मुसलमानों का उपहास करते थे। और तबूक की यात्रा के बीच आपपर प्राण-घातक आक्रमण भी किया। और बहुत से मुनाफ़िक़ों ने आपका साथ भी नहीं दिया और झूठे बहाने बना लिए। रजब सन् 9 हिजरी में नबी सल्लल्लाहु अलैहि व सल्लम तीस हज़ार मुसलमानों के साथ निकले। इनमें दस हज़ार सवार थे। तबूक पहुँचकर पता चला कि क़ैसर और उसके सहयोगियों ने साहस खो दिया है। क्योंकि इससे पहले मूता के रणक्षेत्र में तीन हज़ार मुसलमानों ने एक लाख ईसाइयों का मुक़ाबला किया था। इसलिए क़ैसर तीस हज़ार की सेना से भिड़ने का साहस न कर सका। आप सल्लल्लाहु अलैहि व सल्लम ने तबूक में बीस दिन रहकर रूमियों के अधीन इस क्षेत्र के राज्यों को अपने अधीन बनाया। जिससे इस्लामी राज्य की सीमाएँ रूमी राज्य की सीमा तक पहुँच गईं। जब आप मदीना पहुँचे तो मुनाफ़िक़ों ने झूठे बहाने बनाकर क्षमा माँग ली। तीन मुसलमान जो आपके साथ आलस्य के कारण नहीं जा सके थे और अपना दोष स्वीकार कर लिया था आपने उनका सामाजिक बहिष्कार कर दिया। किंतु अल्लाह ने उन तीनों को भी उनके सत्य के कारण क्षमा कर दिया। आपने उस मस्जिद को भी गिराने का आदेश दिया, जिसे मुनाफ़िक़ों ने अपने षड्यंत्र का केंद्र बनाया था।","lang":"hi","version":{"key":"hindi_omari","direction":"ltr","language_iso_code":"hi","version":"1.1.4","last_update":1675069101,"title":"Hindi Translation","description":"Translation of the Quran meanings into Indian by Azizul-Haqq Al-Umary."},"meta":{"transliteration":"yāayyuhā alladhīna āmanū mā lakum idhā qīla lakumu infirū fī sabīli al-lahi ithāqaltum ilā al-arḍi araḍītum bil-ḥayati al-dun'yā mina al-ākhirati famā matāʿu al-ḥayati al-dun'yā fī al-ākhirati illā qalīlun ","translations":["O you who believe","O you who believe","O you who believe","What","(is the matter) with you","when","it is said","to you","go forth","in","(the) way","(of) Allah","you cling heavily","to","the earth","Are you pleased","with the life","(of) the world","(rather) than","the Hereafter","But what","(is the) enjoyment","(of) the life","(of) the world","in (comparison to)","the hereafter","except","a little","(38)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","mā","lakum","idhā","qīla","lakumu","infirū","fī","sabīli","al-lahi","ithāqaltum","ilā","al-arḍi","araḍītum","bil-ḥayati","al-dun'yā","mina","al-ākhirati","famā","matāʿu","al-ḥayati","al-dun'yā","fī","al-ākhirati","illā","qalīlun",null],"verseTiming":[[1,0,3320],[2,3320,4430],[3,4430,5570],[4,5570,6030],[5,6030,6750],[6,6750,7320],[7,7320,8120],[8,8120,8720],[9,8720,10400],[10,10400,10860],[11,10860,12130],[12,12130,12790],[13,12790,14450],[14,14450,14790],[15,14790,16060],[16,16060,16950],[17,16950,17290],[18,17290,18300],[19,18300,19390],[20,19390,20510],[21,20510,20920],[22,20920,22790],[23,22790,23430],[24,23430,24310],[25,24310,25540],[26,25540,26620],[27,26620,26860],[28,26860,28330],[29,28330,29140],[30,29140,32225]]}}