{"name":"9:60","price":"ज़कात तो केवल फ़क़ीरों[24] और मिस्कीनों के लिए और उसपर नियुक्त कार्यकर्ताओं[25] के लिए तथा उनके लिए है जिनके दिलों को परचाना[26] अभीष्ट हो, और दास मुक्त करने में और क़र्ज़दारों एवं तावान भरने वालों में और अल्लाह के मार्ग में तथा यात्रियों के लिए है। यह अल्लाह की ओर से एक दायित्व है[27] और अल्लाह सब कुछ जानने वाला, पूर्ण हिकमत वाला है।","arabic":"۞ إِنَّمَا ٱلصَّدَقَٰتُ لِلۡفُقَرَآءِ وَٱلۡمَسَٰكِينِ وَٱلۡعَٰمِلِينَ عَلَيۡهَا وَٱلۡمُؤَلَّفَةِ قُلُوبُهُمۡ وَفِي ٱلرِّقَابِ وَٱلۡغَٰرِمِينَ وَفِي سَبِيلِ ٱللَّهِ وَٱبۡنِ ٱلسَّبِيلِۖ فَرِيضَةٗ مِّنَ ٱللَّهِۗ وَٱللَّهُ عَلِيمٌ حَكِيمٞ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1295,"juzNumber":10,"footnotes":"24. क़ुरआन ने यहाँ फ़क़ीर और मिस्कीन के शब्दों का प्रयोग किया है। फ़क़ीर का अर्थ है जिसके पास कुछ न हो। परंतु मिस्कीन वह है जिसके पास कुछ धन हो, मगर उसकी आवश्यकता की पूर्ति न होती हो। 25. जो ज़कात के काम में लगे हों। 26. इससे अभिप्राय वे हैं जो नए-नए इस्लाम लाए हों। तो उनके लिए भी ज़कात है। या जो इस्लाम में रूचि रखते हों, और इस्लाम के सहायक हों। 27.संसार में कोई धर्म ऐसा नहीं है जिसने दीन-दुखियों की सहायता और सेवा की प्रेरणा न दी हो। और उसे इबादत (वंदना) का अनिवार्य अंश न कहा हो। परंतु इस्लाम की यह विशेषता है कि उसने प्रत्येक धनी मुसलमान पर एक विशेष कर निरिधारित कर दिया है जो उसपर अपनी पूरी आय का ह़िसाब करके प्रत्येक वर्ष देना अनिवार्य है। फिर उसे इतना महत्व दिया है कि कर्मों में नमाज़ के पश्चात् उसी का स्थान है। और क़ुरआन में दोनों कर्मों की चर्चा एक साथ करके यह स्पष्ट कर दिया गया है कि किसी समुदाय में इस्लामी जीवन के सबसे पहले यही दो लक्षण हैं, नमाज़ तथा ज़कात। यदि इस्लाम में ज़कात के नियम का पालन किया जाए तो समाज में कोई ग़रीब नहीं रह जाएगा। और धनवानों तथा निर्धनों के बीच प्रेम की ऐसी भावना पैदा हो जाएगी कि पूरा समाज सुखी और शांतिमय बन जाएगा। ब्याज का भी निवारण हो जाएगा। तथा धन कुछ हाथों में सीमित न रहकर उसका लाभ पूरे समाज को मिलेगा। फिर इस्लाम ने इसका नियम निर्धारित किया है। जिसका पूरा विवरण ह़दीसों में मिलेगा और यह भी निश्चित कर दिया है कि ज़कात का धन किनको दिया जाएगा और इस आयत में उन्हीं की चर्चा की गई है, जो ये हैं : 1. फ़क़ीर 2. मिस्कीन, 3. ज़कात के कार्यकर्ता, 4. नए मुसलमान, 5. दास-दासी, 6. ऋणी, 7. अल्लाह के मार्ग में, 8. और यात्री। अल्लाह के मार्ग से अभिप्राय अल्लाह की राह में जिहाद करने वाले लोग हैं।","lang":"hi","version":{"key":"hindi_omari","direction":"ltr","language_iso_code":"hi","version":"1.1.4","last_update":1675069101,"title":"Hindi Translation","description":"Translation of the Quran meanings into Indian by Azizul-Haqq Al-Umary."},"meta":{"transliteration":"innamā al-ṣadaqātu lil'fuqarāi wal-masākīni wal-ʿāmilīna ʿalayhā wal-mu-alafati qulūbuhum wafī al-riqābi wal-ghārimīna wafī sabīli al-lahi wa-ib'ni al-sabīli farīḍatan mina al-lahi wal-lahu ʿalīmun ḥakīmun ","translations":["Only","the charities","(are) for the poor","and the needy","and those who collect","them","and the ones inclined","their hearts","and in","the (freeing of) the necks","and for those in debt","and in","(the) way","(of) Allah","and the wayfarer ","and the wayfarer ","an obligation","from","Allah","And Allah","(is) All-Knowing","All-Wise","(60)"],"transliterationArr":["innamā","al-ṣadaqātu","lil'fuqarāi","wal-masākīni","wal-ʿāmilīna","ʿalayhā","wal-mu-alafati","qulūbuhum","wafī","al-riqābi","wal-ghārimīna","wafī","sabīli","al-lahi","wa-ib'ni","al-sabīli","farīḍatan","mina","al-lahi","wal-lahu","ʿalīmun","ḥakīmun",null],"verseTiming":[[1,0,2019],[2,2019,3419],[3,3419,6499],[4,6499,8119],[5,8119,9789],[6,9789,10899],[7,10899,12679],[8,12679,14099],[9,14099,14509],[10,14509,15649],[11,15649,17499],[12,17499,18069],[13,18069,19309],[14,19309,19909],[15,19909,20549],[16,20549,23659],[17,23659,24889],[18,24889,25909],[19,25909,28999],[20,28999,30069],[21,30069,30989],[22,30989,34454]]}}