{"name":"10:47","price":"47. Ҳар бир миллат учун пайғамбар бўлур. Бас, қачон пайғамбарлари келганида, ўша (миллат)ларга зулм қилинмаган ҳолда, уларнинг ўрталарида адолат билан ҳукм қилинур.","arabic":"وَلِكُلِّ أُمَّةٖ رَّسُولٞۖ فَإِذَا جَآءَ رَسُولُهُمۡ قُضِيَ بَيۡنَهُم بِٱلۡقِسۡطِ وَهُمۡ لَا يُظۡلَمُونَ","category":["10 (Yunus)","Yunus","Surah Yunus","Chapter Yunus","Surah 10","Chapter 10","Jonah","يونُس"],"ayahNumber":1411,"juzNumber":11,"footnotes":"И з о ҳ. Ислом таълимотига кўра, бу олам имтиҳон олами бўлиб, ҳар бир киши мана шу имтиҳонда ўта олган-олмаганига қараб Охиратда мукофот ёки жазога мустаҳиқ бўлади. Бандалар ўзларининг зиммаларидаги бурчларини ва ҳақ-ҳуқуқларини таниб, ҳақ йўлни топиб, имтиҳондан муваффақият билан ўтишлари учун уларга Аллоҳ таоло пайғамбарлари орқали Ўз кўрсатмаларини юборади. Бу пайғамбарларнинг аввалгиси Одам алайҳиссалом бўлса, сўнггиси Муҳаммад алайҳис-салоту вас-саломдирлар. Бу иккалаларининг ўртасида юз минглаб пайғамбарлар ўтганлар. Бинобарин, дунёда бирон-бир миллат йўқки, у миллатга Аллоҳ пайғамбарларининг даъвати етмаган бўлса. Юқоридаги оятда уқтирилишича, Аллоҳ таоло Ўзи яратган ҳар бир миллатга пайғамбар юбориб, Ўз динига даъват қилади. Қачонки, у миллат ўша пайғамбарни ёлғончи қилиб, у келтирган диндан юз ўгирса, Қиёмат Кунида у миллатга ўша пайғамбар гувоҳлигида адолат билан жазо берилади. Бу оят: «То пайғамбар юбормагунча ҳеч кимни жазолагувчи эмасмиз», деган мазмундаги Исро сурасининг 14-оятига ҳамоҳангдир.","lang":"uz","version":{"key":"uzbek_mansour","direction":"ltr","language_iso_code":"uz","version":"1.0.0","last_update":1490389200,"title":"Uzbek translation - Alauddin Mansour","description":"Translation of the Quran meanings into Uzbek by Alauddin Mansour, printed in 1430 H. Notice: Some referred translated verses corrected by Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walikulli ummatin rasūlun fa-idhā jāa rasūluhum quḍiya baynahum bil-qis'ṭi wahum lā yuẓ'lamūna ","translations":["And for every","nation","(is) a Messenger","So when","comes","their Messenger","it will be judged","between them","in justice","and they","(will) not","be wronged","(47)"],"transliterationArr":["walikulli","ummatin","rasūlun","fa-idhā","jāa","rasūluhum","quḍiya","baynahum","bil-qis'ṭi","wahum","lā","yuẓ'lamūna",null],"verseTiming":[[1,0,1170],[2,1170,2810],[3,2810,6139],[4,6139,7509],[5,7509,9669],[6,9669,10959],[7,10959,11599],[8,11599,13279],[9,13279,14479],[10,14479,15069],[11,15069,15529],[12,15529,19034]]}}