{"name":"10:90","price":"90. Биз Бани Исроилни денгиздан ўтказганимиздан кейин уларга зулму зўравонлик қилиш учун Фиръавн ва унинг лашкари қувиб етди. Энди унга (Фиръавнга денгизда) ғарқ бўлиш (пайти) етганида эса, у деди: «Ҳеч қандай илоҳ йўқ, магар Бани Исроил иймон келтирган Зот — Аллоҳгина борлигига иймон келтирдим. Мен мусулмонлардандирман — Аллоҳга бўйинсунувчилардандирман».","arabic":"۞ وَجَٰوَزۡنَا بِبَنِيٓ إِسۡرَٰٓءِيلَ ٱلۡبَحۡرَ فَأَتۡبَعَهُمۡ فِرۡعَوۡنُ وَجُنُودُهُۥ بَغۡيٗا وَعَدۡوًاۖ حَتَّىٰٓ إِذَآ أَدۡرَكَهُ ٱلۡغَرَقُ قَالَ ءَامَنتُ أَنَّهُۥ لَآ إِلَٰهَ إِلَّا ٱلَّذِيٓ ءَامَنَتۡ بِهِۦ بَنُوٓاْ إِسۡرَٰٓءِيلَ وَأَنَا۠ مِنَ ٱلۡمُسۡلِمِينَ","category":["10 (Yunus)","Yunus","Surah Yunus","Chapter Yunus","Surah 10","Chapter 10","Jonah","يونُس"],"ayahNumber":1454,"juzNumber":11,"footnotes":"И з о ҳ. Ривоят қилишларича, Мусо пайғамбар Бани Исроил қавми билан бирга Фиръавннинг зулмидан қутулиш учун Мисрдан чиқиб кетаётганларида, йўлларини тўсиб турган денгиз Аллоҳнинг қудрати билан иккига бўлиниб, ундан ҳаммалари соғ-омон ўтиб оладилар. Уларнинг ортидан қувиб келаётган Фиръавн ва унинг лашкари эса, денгизнинг ўртасига етганларида иккига бўлинган денгиз бирлашиб, барчалари ғарқ бўлиб кетадилар. Шунда бостириб келаётган денгиз тўлқинларини кўриб, ўлими кўзига кўриниб қолган Фиръавн ўзининг ҳеч қандай худо эмас (ҳолбуки, шу пайтгача у ўзини худо деб даъво қилиб келарди), балки ҳамма сингари оддий одам эканлигини бўйнига олиб, ягона Аллоҳдан ўзга бирон илоҳ йўқлигига иймон келтиради ва «мен мусулмонлардан, яъни Аллоҳга сўзсиз итоат қилгувчиларданман», дейди. Лекин қуйидаги оятлардан маълум бўлишича, Аллоҳ унинг иймонини қабул қилмайди, балки бошқа одамлар кўриб, ибрат олсинлар, деб унинг жасади денгиз соҳилига чиқариб ташланади. Бу ояти карималар Ислом таълимотидаги «бутун ҳаётини кофирлик-даҳрийлик билан ўтказиб, ниҳоят жони чиқар пайтида Аллоҳга иймон келтирган кимсаларнинг иймони мақбул эмас», деган ақиданинг асосидир.","lang":"uz","version":{"key":"uzbek_mansour","direction":"ltr","language_iso_code":"uz","version":"1.0.0","last_update":1490389200,"title":"Uzbek translation - Alauddin Mansour","description":"Translation of the Quran meanings into Uzbek by Alauddin Mansour, printed in 1430 H. Notice: Some referred translated verses corrected by Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wajāwaznā bibanī is'rāīla al-baḥra fa-atbaʿahum fir'ʿawnu wajunūduhu baghyan waʿadwan ḥattā idhā adrakahu al-gharaqu qāla āmantu annahu lā ilāha illā alladhī āmanat bihi banū is'rāīla wa-anā mina al-mus'limīna ","translations":["And We took across","(the) Children","(of) Israel ","the sea","and followed them","Firaun","and his hosts","(in) rebellion","and enmity","until","when","overtook him","the drowning","he said","I believe","that","(there is) no","god","except","the One","in Whom believe","in Whom believe","the Children of Israel","the Children of Israel","and I am","of","the Muslims","(90)"],"transliterationArr":["wajāwaznā","bibanī","is'rāīla","al-baḥra","fa-atbaʿahum","fir'ʿawnu","wajunūduhu","baghyan","waʿadwan","ḥattā","idhā","adrakahu","al-gharaqu","qāla","āmantu","annahu","lā","ilāha","illā","alladhī","āmanat","bihi","banū","is'rāīla","wa-anā","mina","al-mus'limīna",null],"verseTiming":[[1,0,1500],[2,1500,3610],[3,3610,6810],[4,6810,7610],[5,7610,9040],[6,9040,10180],[7,10180,11460],[8,11460,12170],[9,12170,15320],[10,15320,17539],[11,17539,19469],[12,19469,20469],[13,20469,21329],[14,21329,21819],[15,21819,23959],[16,23959,25539],[17,25539,27519],[18,27519,28299],[19,28299,28949],[20,28949,31479],[21,31479,32459],[22,32459,33109],[23,33109,35088],[24,35088,38128],[25,38128,38718],[26,38718,39028],[27,39028,42243]]}}