{"name":"12:58","price":"58. Юсуфнинг оға-инилари (Мисрга) келишиб, унинг ҳузури кирганларида, уларни таниди. Улар эса (Юсуф)ни танимаган эдилар.","arabic":"وَجَآءَ إِخۡوَةُ يُوسُفَ فَدَخَلُواْ عَلَيۡهِ فَعَرَفَهُمۡ وَهُمۡ لَهُۥ مُنكِرُونَ","category":["12 (Yusuf)","Yusuf","Surah Yusuf","Chapter Yusuf","Surah 12","Chapter 12","Joseph","يوسُف"],"ayahNumber":1654,"juzNumber":13,"footnotes":"И з о ҳ. Ривоятларга қараганда, оға-инилари кириб келганларида Юсуф ўзининг таниганини уларга билдирмай: «Сизлар кимсизлар, қаердан келдингиз?», деб сўраган экан. Шунда У «Бизлар Шом мамлакатининг Канъон деган юртданмиз. Ўзимиз чорвадорларданмиз. Озиқ-овқат ахтариб келдик», деб жавоб қиладилар. Юсуф: «Эҳтимол, бизнинг юртимизга жосуслик учун келгандирсизлар», дейди. Улар айтадилар: «Аллоҳ сақласин! Бизлар ўзининг энг суюкли боласидан айрилиб ғам-андуҳда қолган бир пайғамбарнинг ўғилларимиз. Бизлар ҳаммамиз ўн икки ўғилмиз. Бу ерга келган ўнтамиз бир ота-онаданмиз. Йўқолган инимиз билан унинг биродари эса бизнинг ота бир, она бошқа иниларимиз бўлади. Ўша инимиз биз билан ўйнаб саҳрога чиққанида йўқолиб қолган эди, шу сабабдан унинг биродарини отамиз бизларга ишонмай ўзи билан олиб қолди». Бу сўзларни эшитгач, Юсуф ходимларига уларнинг барча эҳтиёжларини қондиришни амр этади.","lang":"uz","version":{"key":"uzbek_mansour","direction":"ltr","language_iso_code":"uz","version":"1.0.0","last_update":1490389200,"title":"Uzbek translation - Alauddin Mansour","description":"Translation of the Quran meanings into Uzbek by Alauddin Mansour, printed in 1430 H. Notice: Some referred translated verses corrected by Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wajāa ikh'watu yūsufa fadakhalū ʿalayhi faʿarafahum wahum lahu munkirūna ","translations":["And came","(the) brothers","(of) Yusuf","and they entered","upon him","and he recognized them","but they","knew him not","knew him not","(58)"],"transliterationArr":["wajāa","ikh'watu","yūsufa","fadakhalū","ʿalayhi","faʿarafahum","wahum","lahu","munkirūna",null],"verseTiming":[[1,0,2550],[2,2550,3430],[3,3430,4310],[4,4310,5370],[5,5370,6290],[6,6290,7600],[7,7600,8140],[8,8140,8830],[9,8830,12825]]}}