{"name":"15:9","price":"9. Албатта, бу эслатмани (яъни, Қуръонни) Биз Ўзимиз нозил қилдик ва шубҳасиз, Ўзимиз уни сақлагувчимиз.","arabic":"إِنَّا نَحۡنُ نَزَّلۡنَا ٱلذِّكۡرَ وَإِنَّا لَهُۥ لَحَٰفِظُونَ","category":["15 (Al-Hijr)","Al-Hijr","Surah Al-Hijr","Chapter Al-Hijr","Hijr","Surah Hijr","Chapter Hijr","Al Hijr","Surah Al Hijr","Chapter Al Hijr","Surah 15","Chapter 15","The Rock","الحِجر"],"ayahNumber":1811,"juzNumber":14,"footnotes":"И з о ҳ. Ушбу ояти карима асрлар оша Қуръоннинг илоҳий Китоб эканини қайта-қайта исботлаб келмоқда. Узоқ ўтмишни қўйиб турайлик, мана шу бизнинг асримизнинг ўзида бу азиз китобни йўқ қилиш учун қанчадан-қанча хуружлар бўлмади. Уни ўтга ёқдилар, дарёларга оқиздилар, қабрларга кўмдилар. Бугина эмас! Яна Қуръонни ёд олган ёки ҳаётини шу илоҳий китобга амал қилиб ўтказмоқни истаган миллионлаб улуғ зотларни қириб йўқотиб юбордилар. Кейин-чи? Кейин бошқа миллионлар қўлларида, тилларида ва дилларида бирор ҳарфи ҳам заҳаланмаган шу азиз китоб билан пайдо бўлдилар! «Шубҳасиз, Ўзимиз уни сақлагувчимиз», деган илоҳий сўзлар ўз тасдиғини топди. Ислом таълимотига кўра Қуръон илоҳий китобларнинг сўнггисидир. Бинобарин, мана шу оятда уни то Қиёмат йўқотмай, бузмай сақлашни Аллоҳ таоло Ўз зиммасига олгандир. Шу боис, бошқа — илгариги умматларга нозил қилинган илоҳий китобларга ўзгаришлар киритилиб, бузилгани ҳолда (масалан, Инжилнинг етмишдан ортиқ таржималари бор, лекин асл нусхаси ҳеч қаерда мавжуд эмас). Қуръон мана, ўн тўрт асрдан буён Пайғамбар алайҳис-салоту вас-саломга қандай нозил қилинган бўлса, (йўқ қилишга уринишлар, бало-офатлардан асралиб) худди ўшандай сақланиб келмоқда.","lang":"uz","version":{"key":"uzbek_mansour","direction":"ltr","language_iso_code":"uz","version":"1.0.0","last_update":1490389200,"title":"Uzbek translation - Alauddin Mansour","description":"Translation of the Quran meanings into Uzbek by Alauddin Mansour, printed in 1430 H. Notice: Some referred translated verses corrected by Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"innā naḥnu nazzalnā al-dhik'ra wa-innā lahu laḥāfiẓūna ","translations":["Indeed, We","We","have sent down","the Reminder","and indeed, We","of it","(are) surely Guardians","(9)"],"transliterationArr":["innā","naḥnu","nazzalnā","al-dhik'ra","wa-innā","lahu","laḥāfiẓūna",null],"verseTiming":[[1,0,1450],[2,1450,1990],[3,1990,3030],[4,3030,3930],[5,3930,5270],[6,5270,5890],[7,5890,9015]]}}