{"name":"17:75","price":"75. У ҳолда, албатта, Биз сизга дунё (азобини) ҳам, Охират (азобини) ҳам икки ҳисса қилиб тотдирган бўлур эдик, сўнгра ўзингиз учун Бизга қарши бирон мададкор топа олмаган бўлур эдингиз.","arabic":"إِذٗا لَّأَذَقۡنَٰكَ ضِعۡفَ ٱلۡحَيَوٰةِ وَضِعۡفَ ٱلۡمَمَاتِ ثُمَّ لَا تَجِدُ لَكَ عَلَيۡنَا نَصِيرٗا","category":["17 (Al-Isra)","Al-Isra","Surah Al-Isra","Chapter Al-Isra","Isra","Surah Isra","Chapter Isra","Al Isra","Surah Al Isra","Chapter Al Isra","Surah 17","Chapter 17","The Night Journey","الإسرَاء"],"ayahNumber":2104,"juzNumber":15,"footnotes":"И з о ҳ. Мушриклар Пайғамбар алайҳис-салоту вас-саломга эргашишлари учун у киши ҳам ўзларининг баъзи шартларини қабул этишларини талаб қиладилар. Шунда Аллоҳ таоло Ўз пайғамбарини мушриклар фитнасидан огоҳ этиб юқоридаги оятларни нозил қилади. Улуғ саҳобалардан Ибн Аббос розияллоҳу анҳу айтишларича, бу оятларда гарчи Пайғамбар алайҳис-салоту вас-саломга хитоб қилинган бўлса-да, булар у кишининг умматлари учун ҳам танбеҳ бўлиб, Аллоҳ таоло уларни кофирлар кўрсатган йўлларга эргашмасликка буюради, акс ҳолда дунёю Охиратда бахтсиз бўлиб қолишлари тўғрисида огоҳлантиради.","lang":"uz","version":{"key":"uzbek_mansour","direction":"ltr","language_iso_code":"uz","version":"1.0.0","last_update":1490389200,"title":"Uzbek translation - Alauddin Mansour","description":"Translation of the Quran meanings into Uzbek by Alauddin Mansour, printed in 1430 H. Notice: Some referred translated verses corrected by Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"idhan la-adhaqnāka ḍiʿ'fa al-ḥayati waḍiʿ'fa al-mamāti thumma lā tajidu laka ʿalaynā naṣīran ","translations":["Then","We (would) have made you taste","double","(in) the life","and double","(after) the death","Then","not","you (would) have found","for you","against Us","any helper","(75)"],"transliterationArr":["idhan","la-adhaqnāka","ḍiʿ'fa","al-ḥayati","waḍiʿ'fa","al-mamāti","thumma","lā","tajidu","laka","ʿalaynā","naṣīran",null],"verseTiming":[[1,0,480],[2,480,2180],[3,2180,2750],[4,2750,3950],[5,3950,4660],[6,4660,5790],[7,5790,6930],[8,6930,7320],[9,7320,8000],[10,8000,8440],[11,8440,9480],[12,9480,11135]]}}