{"name":"18:24","price":"24.  Магар «Иншоаллоҳ – Аллоҳ хоҳласа», (денг! Бу сўзларни айтишни) унутиб қолдирган вақтингизда (ёдингизга тушиши билан): Парвардигорингизни зикр қилинг (яъни, «Иншоаллоҳ», денг) ва: «Шояд Парвардигорим мени бундан ҳам (яъни, Асҳобул-Каҳф воқеаси ҳақида хабар беришдан ҳам) яқинроқ (менинг ҳақ пайғамбар эканлигимга яхшироқ далолат қиладиган) Тўғри Йўлга ҳидоят қилса», денг!","arabic":"إِلَّآ أَن يَشَآءَ ٱللَّهُۚ وَٱذۡكُر رَّبَّكَ إِذَا نَسِيتَ وَقُلۡ عَسَىٰٓ أَن يَهۡدِيَنِ رَبِّي لِأَقۡرَبَ مِنۡ هَٰذَا رَشَدٗا","category":["18 (Al-Kahf)","Al-Kahf","Surah Al-Kahf","Chapter Al-Kahf","Kahf","Surah Kahf","Chapter Kahf","Al Kahf","Surah Al Kahf","Chapter Al Kahf","Surah 18","Chapter 18","The Cave","الكَهف"],"ayahNumber":2164,"juzNumber":15,"footnotes":"И з о ҳ. Муфассирлар ривоят қилишларича, бу икки оят нозил қилинишига қуйидаги воқеа сабаб бўлгандир, яҳудийлар қурайшлик арабларга: «Бориб Муҳаммаддан сўранглар-чи, агар ҳақиқатан ҳам пайғамбар бўлса, сизларга руҳ — жон ҳақида, Асҳобул-Каҳф ва Зул-қарнайн тўғрисида хабар берсин», деган эканлар. Улар келиб Пайғамбар алайҳис-салоту вас-саломдан шу ҳақда сўраганларида, у зот: «Эртага келинглар, албатта сизларга жавоб қилурман», дебдилару, «Иншоаллоҳ» сўзини қўшмабдилар. Шунда бир қанча вақт ваҳий келиши тўхтаб, сўнгра Пайғамбар алайҳис-салоту вас-саломга бир танбеҳ бўлиб юқоридаги оятлар нозил бўлгандир.","lang":"uz","version":{"key":"uzbek_mansour","direction":"ltr","language_iso_code":"uz","version":"1.0.0","last_update":1490389200,"title":"Uzbek translation - Alauddin Mansour","description":"Translation of the Quran meanings into Uzbek by Alauddin Mansour, printed in 1430 H. Notice: Some referred translated verses corrected by Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"illā an yashāa al-lahu wa-udh'kur rabbaka idhā nasīta waqul ʿasā an yahdiyani rabbī li-aqraba min hādhā rashadan ","translations":["Except","If","Allah wills","Allah wills","And remember","your Lord","when","you forget","and say","Perhaps","[that]","will guide me","my Lord","to a nearer (way)","than","this","right way","(24)"],"transliterationArr":["illā","an","yashāa","al-lahu","wa-udh'kur","rabbaka","idhā","nasīta","waqul","ʿasā","an","yahdiyani","rabbī","li-aqraba","min","hādhā","rashadan",null],"verseTiming":[[1,0,2130],[2,2130,2370],[3,2370,5360],[4,5360,8160],[5,8160,8890],[6,8890,9880],[7,9880,10490],[8,10490,11390],[9,11390,11900],[10,11900,14010],[11,14010,14500],[12,14500,15940],[13,15940,16780],[14,16780,17920],[15,17920,18560],[16,18560,18960],[17,18960,20475]]}}