{"name":"21:69","price":"69. Биз айтдик: «Эй олов, сен Иброҳим учун салқин ва омонлик бўл!»","arabic":"قُلۡنَا يَٰنَارُ كُونِي بَرۡدٗا وَسَلَٰمًا عَلَىٰٓ إِبۡرَٰهِيمَ","category":["21 (Al-Anbiya)","Al-Anbiya","Surah Al-Anbiya","Chapter Al-Anbiya","Anbiya","Surah Anbiya","Chapter Anbiya","Al Anbiya","Surah Al Anbiya","Chapter Al Anbiya","Surah 21","Chapter 21","The Prophets","الأنبيَاء"],"ayahNumber":2552,"juzNumber":17,"footnotes":"И з о ҳ. Муфассирлар айтишларича, Иброҳим алайҳиссалом манжаниқдан отилган лаҳзада унинг ёнига фаришта Жаброил келиб: «Менга бирон ҳожат-тилагинг борми?», деб сўраган эканлар, Иброҳим: «Сенга (яъни, ёлғиз Аллоҳдан ўзга бирон кимсага) эҳтиёжим йўқ», деб жавоб берибдилар. «Парвардигорга-чи?», сўрабди Жаброил, «Парвардигорим ўзи аҳволимдан огоҳдир», дебдилар Иброҳим. Шунда Аллоҳ таоло оловга юқорида зикр қилинган фармонини юбориб, унинг ёруғи қолиб, иссиғи йўқолибди. Иброҳим алайҳиссаломнинг эса боғланган арқони ёниб битибди-ю, у кишининг ўзига озор етмабди. Қиссадан ҳисса шуки, кимда-ким Иброҳим пайғамбар каби ёлғиз Аллоҳ таолога бандалик қилиб, У зотдан ўзга бирон кимсадан мадад-ёрдам тиламаса, Аллоҳ уни ўтда куйдирмас, сувда чўктирмас.","lang":"uz","version":{"key":"uzbek_mansour","direction":"ltr","language_iso_code":"uz","version":"1.0.0","last_update":1490389200,"title":"Uzbek translation - Alauddin Mansour","description":"Translation of the Quran meanings into Uzbek by Alauddin Mansour, printed in 1430 H. Notice: Some referred translated verses corrected by Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qul'nā yānāru kūnī bardan wasalāman ʿalā ib'rāhīma ","translations":["We said","O fire","Be","cool[ness]","and safe[ty]","for","Ibrahim","(69)"],"transliterationArr":["qul'nā","yānāru","kūnī","bardan","wasalāman","ʿalā","ib'rāhīma",null],"verseTiming":[[1,0,980],[2,980,2200],[3,2200,3020],[4,3020,4060],[5,4060,5850],[6,5850,8180],[7,8180,10975]]}}