{"name":"22:39","price":"39. Ҳужумга учраётган зотларга мазлум бўлганлари сабабли (жанг қилиш) изни берилди. Албатта Аллоҳ уларни ғолиб қилишга қодирдир.","arabic":"أُذِنَ لِلَّذِينَ يُقَٰتَلُونَ بِأَنَّهُمۡ ظُلِمُواْۚ وَإِنَّ ٱللَّهَ عَلَىٰ نَصۡرِهِمۡ لَقَدِيرٌ","category":["22 (Al-Hajj)","Al-Hajj","Surah Al-Hajj","Chapter Al-Hajj","Hajj","Surah Hajj","Chapter Hajj","Al Hajj","Surah Al Hajj","Chapter Al Hajj","Surah 22","Chapter 22","The Pilgrimage","الحَجّ"],"ayahNumber":2634,"juzNumber":17,"footnotes":"И з о ҳ. Муфассирлар айтишларича, ушбу оят мусулмонларга жиҳод қилиш учун берилган биринчи рухсатдир. Пайғамбар алайҳис-салоту вас-салом Маккада турган пайтларида ҳам саҳобалар у кишининг ҳузурларига кўп марта мушрикларнинг қилаётган ҳужумларидан шикоят қилиб келар эдилар. Лекин у зот: «Сабр қилинглар, менга ҳали Парвардигорим томонидан жанг қилишга рухсат берилгани йўқ», деб қайтарардилар. Дарҳақиқат, Қуръони Каримдаги етмишдан ортиқ оятда мусулмонлар кофирларга қарши жиҳоддан қайтарилгандир. Мадинага ҳижрат қилинганидан кейин Ислом давлати барпо бўлгач, мазлум мусулмонларга золим кофирларга қарши жиҳод қилиш изни берилди ва бу жангда албатта Аллоҳ йўлида курашган зотлар ғолиб бўлиши башорат қилинди.","lang":"uz","version":{"key":"uzbek_mansour","direction":"ltr","language_iso_code":"uz","version":"1.0.0","last_update":1490389200,"title":"Uzbek translation - Alauddin Mansour","description":"Translation of the Quran meanings into Uzbek by Alauddin Mansour, printed in 1430 H. Notice: Some referred translated verses corrected by Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"udhina lilladhīna yuqātalūna bi-annahum ẓulimū wa-inna al-laha ʿalā naṣrihim laqadīrun ","translations":["Permission is given","to those who","are being fought","because they","were wronged","And indeed","Allah","for","their victory","(is) surely Able","(39)"],"transliterationArr":["udhina","lilladhīna","yuqātalūna","bi-annahum","ẓulimū","wa-inna","al-laha","ʿalā","naṣrihim","laqadīrun",null],"verseTiming":[[1,0,700],[2,700,1960],[3,1960,3560],[4,3560,5670],[5,5670,6780],[6,6780,8730],[7,8730,9690],[8,9690,10400],[9,10400,11500],[10,11500,14105]]}}