{"name":"24:11","price":"11. Шак-шубҳасиз, бу бўҳтонни (вужудга) келтирган кимсалар ўзларингиздан бўлган бир тўдадир. Уни сизлар ўзларингиз учун ёмонлик деб ўйламанглар, балки у сизлар учун яхшиликдир Улардан (яъни, бўҳтончилардан) ҳар бир киши учун ўзи касб қилган гуноҳ(га яраша жазо) бордир. Уларнинг орасидаги (гуноҳнинг) каттасини кўтарган кимса учун улуғ азоб бордир.","arabic":"إِنَّ ٱلَّذِينَ جَآءُو بِٱلۡإِفۡكِ عُصۡبَةٞ مِّنكُمۡۚ لَا تَحۡسَبُوهُ شَرّٗا لَّكُمۖ بَلۡ هُوَ خَيۡرٞ لَّكُمۡۚ لِكُلِّ ٱمۡرِيٕٖ مِّنۡهُم مَّا ٱكۡتَسَبَ مِنَ ٱلۡإِثۡمِۚ وَٱلَّذِي تَوَلَّىٰ كِبۡرَهُۥ مِنۡهُمۡ لَهُۥ عَذَابٌ عَظِيمٞ","category":["24 (An-Nur)","An-Nur","Surah An-Nur","Chapter An-Nur","Nur","Surah Nur","Chapter Nur","An Nur","Surah An Nur","Chapter An Nur","Surah 24","Chapter 24","The Light","النُّور"],"ayahNumber":2802,"juzNumber":18,"footnotes":"И з о ҳ. Ушбу оятда мазкур бўлган «бўҳтон»нинг тарихи бундайдир: Пайғамбар алайҳис-салоту вас-салом саҳобалари билан бирга бир ғазотдан қайтар эканлар, Мадинага яқинлашиб қолганларида қоронғу кечада аскарларга бир оз ором олиш учун рухсат берадилар. Шунда Пайғамбар алайҳис-салоту вас-салом билан бирга ғазотга чиққан жуфти ҳалоллари Оиша (Аллоҳ ундан рози бўлсин) ҳожат учун чиқиб, аскарлардан анча узоққа кетиб қолади ва қайтиб келганида карвон жилиб кетганини кўради. Шу пайт одатда карвон ортидан қолган нарсаларни йиғиб юриш учун тайинланган бир саҳоба келиб қолиб, Оишани кўриб танийди ва уни туяга миндириб, ўзи яёв ҳолда карвоннинг ортидан етказиб боради. Буни кўрган айрим мунофиқ кимсалар Оишани бадном қилишиб турли миш-мишлар тарқатадилар. Бу миш-мишларни эшитган Пайғамбар алайҳис-салоту вас-салом ҳам, Оиша ҳам, Абу Бакр Сиддиқ ҳам ва бошқа мусулмонлар ҳам ниҳоятда изтиробда қоладилар. Орадан тўла бир ой вақт ўтгандан сўнггина Пайғамбар алайҳис-салоту вас-саломга юқорида мазкур бўлган ва қуйида зикр қилинадиган оятлар нозил бўлиб, Оишанинг поклиги аниқланади ва бу миш-миш бўҳтон эканлиги ошкор бўлади ҳамда бўҳтончиларнинг ҳар бири учун қилган гуноҳига яраша жазо берилиши, уларнинг каттаси бўлган мунофиқ учун эса Охиратда улуғ азоб борлиги ҳақида хабар берилади. Аллоҳ таоло бу можарони мўминлар учун ёмонлик эмас, балки яхшилик, Оишанинг Каломуллоҳ гувоҳлигида оқланиши деб атайди.","lang":"uz","version":{"key":"uzbek_mansour","direction":"ltr","language_iso_code":"uz","version":"1.0.0","last_update":1490389200,"title":"Uzbek translation - Alauddin Mansour","description":"Translation of the Quran meanings into Uzbek by Alauddin Mansour, printed in 1430 H. Notice: Some referred translated verses corrected by Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"inna alladhīna jāū bil-if'ki ʿuṣ'batun minkum lā taḥsabūhu sharran lakum bal huwa khayrun lakum likulli im'ri-in min'hum mā ik'tasaba mina al-ith'mi wa-alladhī tawallā kib'rahu min'hum lahu ʿadhābun ʿaẓīmun ","translations":["Indeed","those who","brought","the lie","(are) a group","among you","(Do) not","think it","bad","for you","nay","it","(is) good","for you","For every","person","among them","(is) what","he earned","of","the sin","and the one who","took upon himself a greater share of it","took upon himself a greater share of it","among them ","for him","(is) a punishment","great","(11)"],"transliterationArr":["inna","alladhīna","jāū","bil-if'ki","ʿuṣ'batun","minkum","lā","taḥsabūhu","sharran","lakum","bal","huwa","khayrun","lakum","likulli","im'ri-in","min'hum","mā","ik'tasaba","mina","al-ith'mi","wa-alladhī","tawallā","kib'rahu","min'hum","lahu","ʿadhābun","ʿaẓīmun",null],"verseTiming":[[1,0,1480],[2,1480,2480],[3,2480,4850],[4,4850,5810],[5,5810,6620],[6,6620,8730],[7,8730,9110],[8,9110,10340],[9,10340,11000],[10,11000,12270],[11,12270,12670],[12,12670,13100],[13,13100,13800],[14,13800,15160],[15,15160,15900],[16,15900,16600],[17,16600,18090],[18,18090,19010],[19,19010,19880],[20,19880,20190],[21,20190,20920],[22,20920,22490],[23,22490,23490],[24,23490,24540],[25,24540,25420],[26,25420,25980],[27,25980,26920],[28,26920,29455]]}}