{"name":"25:29","price":"29. Аниқки, менга эслатма — Қуръон келганидан сўнг, ўша (фалончи) мени йўлдан оздирди». (У кунда) шайтон (ҳаёти дунёда ўзига эргашган барча) инсонни ёрдамсиз қўйгувчидир.","arabic":"لَّقَدۡ أَضَلَّنِي عَنِ ٱلذِّكۡرِ بَعۡدَ إِذۡ جَآءَنِيۗ وَكَانَ ٱلشَّيۡطَٰنُ لِلۡإِنسَٰنِ خَذُولٗا","category":["25 (Al-Furqan)","Al-Furqan","Surah Al-Furqan","Chapter Al-Furqan","Furqan","Surah Furqan","Chapter Furqan","Al Furqan","Surah Al Furqan","Chapter Al Furqan","Surah 25","Chapter 25","The Criterion","الفُرقان"],"ayahNumber":2884,"juzNumber":19,"footnotes":"И з о ҳ. Бу оятлардаги «золим» Ақаба ибн Абу Муъайт, фалончи эса Убай ибн Халафдир. Ақаба Пайғамбар алайҳис-салоту вас-саломнинг даъватларини қабул қилиб, Исломга кирганидан сўнг ўша дўсти Убай уни йўлдан оздириб, васвасага солиши оқибатида муртад бўлиб, диндан чиқади. Мазкур оятларда Аллоҳ таоло ана шундай шайтонларнинг васвасаларига учиб, ўз динларидан воз кечадиган золимларнинг Қиёмат Кунидаги аҳволини тасвирлайди ва шайтонлар унга Охиратда бирон ёрдам бермаслигини таъкидлайди.","lang":"uz","version":{"key":"uzbek_mansour","direction":"ltr","language_iso_code":"uz","version":"1.0.0","last_update":1490389200,"title":"Uzbek translation - Alauddin Mansour","description":"Translation of the Quran meanings into Uzbek by Alauddin Mansour, printed in 1430 H. Notice: Some referred translated verses corrected by Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"laqad aḍallanī ʿani al-dhik'ri baʿda idh jāanī wakāna al-shayṭānu lil'insāni khadhūlan ","translations":["Verily","he led me astray","from","the Reminder","after","[when]","it (had) come to me","And is","the Shaitaan","to the man","a deserter","(29)"],"transliterationArr":["laqad","aḍallanī","ʿani","al-dhik'ri","baʿda","idh","jāanī","wakāna","al-shayṭānu","lil'insāni","khadhūlan",null],"verseTiming":[[1,0,680],[2,680,1990],[3,1990,2450],[4,2450,3310],[5,3310,3990],[6,3990,4420],[7,4420,7510],[8,7510,8300],[9,8300,9730],[10,9730,12000],[11,12000,13715]]}}