{"name":"27:37","price":"37. Сен (қавмингга) қайтиб бориб (айтгинки, агар ҳузуримга бўйинсунган ҳолларида келмасалар) албатта биз уларга шундай қўшин билан борурмизки, улар унга асло бас кела олмаслар ва албатта биз уларни (қишлоқларидан) мағлуб ҳолларида қувиб чиқарурмиз».","arabic":"ٱرۡجِعۡ إِلَيۡهِمۡ فَلَنَأۡتِيَنَّهُم بِجُنُودٖ لَّا قِبَلَ لَهُم بِهَا وَلَنُخۡرِجَنَّهُم مِّنۡهَآ أَذِلَّةٗ وَهُمۡ صَٰغِرُونَ","category":["27 (An-Naml)","An-Naml","Surah An-Naml","Chapter An-Naml","Naml","Surah Naml","Chapter Naml","An Naml","Surah An Naml","Chapter An Naml","Surah 27","Chapter 27","The Ant","النَّمْل"],"ayahNumber":3196,"juzNumber":19,"footnotes":"И з о ҳ. Билқийснинг элчиси унинг олдига ҳадя билан қайтиб бориб Сулаймон алайҳиссаломнинг жавобларини етказгач, у «Бу оддий подшоҳ эмаслигини билган эдим», деди ва Сулаймон пайғамбарга: «Мен сенинг кимлигингни ва даъват қилаётган дининг қандай дин эканлигини билиш учун ўз аъёнларим билан ҳузурингга бормоқдаман», деган хабар билан чопар юбориб, ўзи ўн икки минг одам билан йўлга тушди. Қачонки улар Сулаймон алайҳиссаломнинг қароргоҳларига етиб келишларига бир фарсах (олти чақирим атрофида) қолганида у зот бундан хабар топиб, уларга ўзининг ҳақ пайғамбар эканлигини исботлайдиган бир мўъжиза кўрсатиш ва малика Билқийснинг фаҳму-фаросатини синаш мақсадида қўл остидаги халойиққа қараб:","lang":"uz","version":{"key":"uzbek_mansour","direction":"ltr","language_iso_code":"uz","version":"1.0.0","last_update":1490389200,"title":"Uzbek translation - Alauddin Mansour","description":"Translation of the Quran meanings into Uzbek by Alauddin Mansour, printed in 1430 H. Notice: Some referred translated verses corrected by Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"ir'jiʿ ilayhim falanatiyannahum bijunūdin lā qibala lahum bihā walanukh'rijannahum min'hā adhillatan wahum ṣāghirūna ","translations":["Return","to them","surely, we will come to them","with hosts","not","(is) resistance","for them","of it","and surely, we will drive them out","from there","(in) humiliation","and they","(will be) abased","(37)"],"transliterationArr":["ir'jiʿ","ilayhim","falanatiyannahum","bijunūdin","lā","qibala","lahum","bihā","walanukh'rijannahum","min'hā","adhillatan","wahum","ṣāghirūna",null],"verseTiming":[[1,0,940],[2,940,2080],[3,2080,5850],[4,5850,6990],[5,6990,7590],[6,7590,8330],[7,8330,9430],[8,9430,10110],[9,10110,13540],[10,13540,16180],[11,16180,19719],[12,19719,20969],[13,20969,22549],[14,22549,26624]]}}