{"name":"28:56","price":"56. (Эй Муҳаммад алайҳис-салоту вас-салом), аниқки, сиз ўзингиз суйган кишиларни ҳидоят қила олмассиз, лекин Аллоҳ Ўзи хоҳлаган кишиларни ҳидоят қилур. У ҳидоят топгувчи зотларни яхшироқ билгувчидир.","arabic":"إِنَّكَ لَا تَهۡدِي مَنۡ أَحۡبَبۡتَ وَلَٰكِنَّ ٱللَّهَ يَهۡدِي مَن يَشَآءُۚ وَهُوَ أَعۡلَمُ بِٱلۡمُهۡتَدِينَ","category":["28 (Al-Qasas)","Al-Qasas","Surah Al-Qasas","Chapter Al-Qasas","Qasas","Surah Qasas","Chapter Qasas","Al Qasas","Surah Al Qasas","Chapter Al Qasas","Surah 28","Chapter 28","The Stories","القَصَص"],"ayahNumber":3308,"juzNumber":20,"footnotes":"И з о ҳ. Ушбу оят Пайғамбар алайҳис-салоту вас-саломнинг амакилари Абу Толиб ҳақида нозил бўлгандир. Маълумки, Абу Толиб Муҳаммад алайҳис-салоту вас-саломни болалик чоғларидан бошлаб ўз оталиғига олиб то умрининг охиригача ҳам у зотга ҳомийлик қилган бўлса-да, ўзи Исломга кирмаган эди. Абу Толиб пайғамбаримизни ўз ўғлидек яхши кўрар ва у зотни мудом бошқа мушрикларнинг хуружларидан ҳимоя қилиб келар эди. Шунинг учун ҳам унга ўлим соати яқинлашганида, Пайғамбар алайҳис-салоту вас-салом уни кофир ҳолда ўлиб кетишини истамай: «Эй амаки, «Ла илоҳа иллаллоҳ» денг, мен Қиёмат Кунида сизни мўмин ҳолда вафот қилган деб гувоҳлик берай», деганларида, у: «Мен сенинг йўлинг ҳақ эканлигини биламан, аммо одамлар: «Абу Толиб ўлимдан қўрқиб иймон келтирди», дейишларини хоҳламайман», деб жавоб берган экан. Шунда, ўзининг суюкли амакиси дунёдан беиймон кўз юмаётганидан беҳад ғам-ғуссага тўлган пайғамбарига Ҳақ таоло юқоридаги оятни нозил қилган.","lang":"uz","version":{"key":"uzbek_mansour","direction":"ltr","language_iso_code":"uz","version":"1.0.0","last_update":1490389200,"title":"Uzbek translation - Alauddin Mansour","description":"Translation of the Quran meanings into Uzbek by Alauddin Mansour, printed in 1430 H. Notice: Some referred translated verses corrected by Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"innaka lā tahdī man aḥbabta walākinna al-laha yahdī man yashāu wahuwa aʿlamu bil-muh'tadīna ","translations":["Indeed, you","(can) not","guide","whom","you love","but","Allah","guides","whom","He wills","And He","(is) most knowing","(of) the guided ones","(56)"],"transliterationArr":["innaka","lā","tahdī","man","aḥbabta","walākinna","al-laha","yahdī","man","yashāu","wahuwa","aʿlamu","bil-muh'tadīna",null],"verseTiming":[[1,0,1520],[2,1520,1910],[3,1910,2850],[4,2850,3260],[5,3260,4290],[6,4290,6000],[7,6000,6890],[8,6890,7830],[9,7830,8090],[10,8090,12040],[11,12040,12590],[12,12590,13500],[13,13500,17925]]}}