{"name":"29:12","price":"12. Кофир бўлган кимсалар иймон келтирган зотларга: «Сизлар бизларнинг йўлимизга эргашинглар, гуноҳларингизни бизлар кўтарурмиз», дедилар. Ҳолбуки, улар (мўминларнинг) гуноҳларидан бирон нарсани кўтара олгувчи эмасдирлар. Албатта улар ёлғончидирлар.","arabic":"وَقَالَ ٱلَّذِينَ كَفَرُواْ لِلَّذِينَ ءَامَنُواْ ٱتَّبِعُواْ سَبِيلَنَا وَلۡنَحۡمِلۡ خَطَٰيَٰكُمۡ وَمَا هُم بِحَٰمِلِينَ مِنۡ خَطَٰيَٰهُم مِّن شَيۡءٍۖ إِنَّهُمۡ لَكَٰذِبُونَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut","Chapter Al-Ankabut","Ankabut","Surah Ankabut","Chapter Ankabut","Al Ankabut","Surah Al Ankabut","Chapter Al Ankabut","Surah 29","Chapter 29","The Spider","العَنكَبُوت"],"ayahNumber":3352,"juzNumber":20,"footnotes":"И з о ҳ. Ушбу оят Қурайш катталари иймон келтирган кишиларга: «Қайта тирилиш, Қиёматдаги ҳисоб-китоб деган нарсалар йўқ нарсалардир. Киши дунёга бир марта келади, бундан бошқа дунё йўқдир. Сизлар бизнинг йўлимизга юраверинглар, агар у дунё ҳақидаги гаплар рост чиқиб, Қиёмат қойим бўлса барча гуноҳларингизни биз бўйнимизга олурмиз ва сизлар азобга дучор бўлмассизлар», дейишганида нозил қилинган бўлиб, улар мўминларнинг бирон гуноҳини бўйинларига олишга қодир эмасликлари ҳақида огоҳлантиради. Қуйидаги оятда одамларни Ҳақ йўлидан оздирган бундай кимсалар ўзларининг гуноҳларига қўшиб тобеъларининг гуноҳларига ҳам жавобгар бўлишлари ҳақида хабар берилади. Саҳиҳул-Бухорийда ривоят қилинган бир ҳадиси шариф ҳам бу ояти каримага ҳаммазмундир: «Ким одамларни залолатга даъват қилса, унинг зиммасида ўзига эргашган кимсаларнинг гуноҳлари ҳам бўлур, аммо уларнинг ўз устларидаги гуноҳлари ҳам заррача камаймас».","lang":"uz","version":{"key":"uzbek_mansour","direction":"ltr","language_iso_code":"uz","version":"1.0.0","last_update":1490389200,"title":"Uzbek translation - Alauddin Mansour","description":"Translation of the Quran meanings into Uzbek by Alauddin Mansour, printed in 1430 H. Notice: Some referred translated verses corrected by Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waqāla alladhīna kafarū lilladhīna āmanū ittabiʿū sabīlanā walnaḥmil khaṭāyākum wamā hum biḥāmilīna min khaṭāyāhum min shayin innahum lakādhibūna ","translations":["And said","those who","disbelieve","to those who","believe","Follow","our way","and we will carry","your sins","But not","they","(are) going to carry","of","their sins","any","thing","Indeed, they","(are) surely liars","(12)"],"transliterationArr":["waqāla","alladhīna","kafarū","lilladhīna","āmanū","ittabiʿū","sabīlanā","walnaḥmil","khaṭāyākum","wamā","hum","biḥāmilīna","min","khaṭāyāhum","min","shayin","innahum","lakādhibūna",null],"verseTiming":[[1,0,870],[2,870,1900],[3,1900,2800],[4,2800,3950],[5,3950,4790],[6,4790,5730],[7,5730,7040],[8,7040,8210],[9,8210,9740],[10,9740,10340],[11,10340,11280],[12,11280,12700],[13,12700,13110],[14,13110,14690],[15,14690,15660],[16,15660,18120],[17,18120,20590],[18,20590,23955]]}}