{"name":"2:219","price":"219. Сиздан ароқ (ичкилик) ва қимор ҳақида сўрайдилар. Айтинг: «Буларда катта гуноҳ ва одамлар учун фойдалар бор. Буларнинг гуноҳи фойдасидан каттароқдир». Ва Сиздан (эй Муҳаммад алайҳис-салоту вас-салом), нималарни эҳсон қилишни сўрайдилар. (Ўзингиздан) ортганини, деб жавоб қилинг! Шундай қилиб, тафаккур қилишингиз учун Аллоҳ сизларга ўз оятларини баён этади. ","arabic":"۞ يَسۡـَٔلُونَكَ عَنِ ٱلۡخَمۡرِ وَٱلۡمَيۡسِرِۖ قُلۡ فِيهِمَآ إِثۡمٞ كَبِيرٞ وَمَنَٰفِعُ لِلنَّاسِ وَإِثۡمُهُمَآ أَكۡبَرُ مِن نَّفۡعِهِمَاۗ وَيَسۡـَٔلُونَكَ مَاذَا يُنفِقُونَۖ قُلِ ٱلۡعَفۡوَۗ كَذَٰلِكَ يُبَيِّنُ ٱللَّهُ لَكُمُ ٱلۡأٓيَٰتِ لَعَلَّكُمۡ تَتَفَكَّرُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":226,"juzNumber":2,"footnotes":"И з о ҳ. Ислом келган даврдан ичкилик ичиш, қимор ўйнаш каби иллатлар жамиятнинг ҳаётига сингиб кетган оддий ишлар эди. Шунинг учун Қуръон буларни дафъатан ҳаром қилмади — зотан бундай иллатларни фақат юқорининг буйруғи билан йўқотиш имконсиздир — балки аввало бу ишлардан келадиган фойда-зарарларни кўрсатиш ва одамларнинг буларга бўлган муносабатларини ўзгартириш йўлини тутди. Яъни, бу ҳаром нарсаларни мусулмонларнинг қўлларидан тортиб олишдан илгари кўнгилларидан тортиб олди. Шу боисдан кейинроқ келган «Ароқ, қимор... шайтон амалидан бўлган ҳаром нарсалардир» деган оят нозил бўлиши билан мусулмонлар бу иллатлардан бирйўла қутулдилар.                              И з о ҳ. Ислом дини етим-есирларни оталиққа олишни буюради. Бу оят уларнинг ота-оналаридан мерос бўлиб қолган молларига қандай муносабатда бўлиш лозимлиги ҳақидадир. Мусулмонлар ўз оталиқларидаги етимлар молларини қандай сарф қилаётганларига кўз-қулоқ бўлиб туришларини Қуръон «ислоҳ» деб атаб, шундай қилишга буюради ва уларнинг молларини ўз молларига қўшиб ишлатишларига ҳам рухсат беради. Фақат бу иш билан етимларнинг манфаатини кўзлаганларни ҳам, ўз фойдаларини ўйлаганларни ҳам, Аллоҳ, албатта билиши таъкидланади. Шунингдек, Аллоҳ истаса мусулмонларни бундай қулайликлардан маҳрум қилган бўлиши мумкин эканлиги уқтирилади.","lang":"uz","version":{"key":"uzbek_mansour","direction":"ltr","language_iso_code":"uz","version":"1.0.0","last_update":1490389200,"title":"Uzbek translation - Alauddin Mansour","description":"Translation of the Quran meanings into Uzbek by Alauddin Mansour, printed in 1430 H. Notice: Some referred translated verses corrected by Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yasalūnaka ʿani al-khamri wal-maysiri qul fīhimā ith'mun kabīrun wamanāfiʿu lilnnāsi wa-ith'muhumā akbaru min nafʿihimā wayasalūnaka mādhā yunfiqūna quli al-ʿafwa kadhālika yubayyinu al-lahu lakumu al-āyāti laʿallakum tatafakkarūna ","translations":["They ask you","about","[the] intoxicants","and [the] games of chance","Say","In both of them","(is) a sin","great","and (some) benefits","for [the] people","But sin of both of them","(is) greater","than","(the) benefit of (the) two","And they ask you","what","they (should) spend","Say","The surplus","Thus","makes clear","Allah","to you","[the] Verses","so that you may","ponder","(219)"],"transliterationArr":["yasalūnaka","ʿani","al-khamri","wal-maysiri","qul","fīhimā","ith'mun","kabīrun","wamanāfiʿu","lilnnāsi","wa-ith'muhumā","akbaru","min","nafʿihimā","wayasalūnaka","mādhā","yunfiqūna","quli","al-ʿafwa","kadhālika","yubayyinu","al-lahu","lakumu","al-āyāti","laʿallakum","tatafakkarūna",null],"verseTiming":[[1,0,1220],[2,1220,1540],[3,1540,2260],[4,2260,3310],[5,3310,3990],[6,3990,6260],[7,6260,7450],[8,7450,8890],[9,8890,9940],[10,9940,11290],[11,11290,13780],[12,13780,14560],[13,14560,14790],[14,14790,16640],[15,16640,18550],[16,18550,19240],[17,19240,20970],[18,20970,21370],[19,21370,21980],[20,21980,23390],[21,23390,24340],[22,24340,25040],[23,25040,25570],[24,25570,26690],[25,26690,27760],[26,27760,30755]]}}