{"name":"2:39","price":"39. Оятларимизни инкор қилиб, ёлғон деган кимсалар эса дўзах эгалари бўлиб, унда абадий қолажаклар.","arabic":"وَٱلَّذِينَ كَفَرُواْ وَكَذَّبُواْ بِـَٔايَٰتِنَآ أُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلنَّارِۖ هُمۡ فِيهَا خَٰلِدُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":46,"juzNumber":1,"footnotes":"И з о ҳ . Юқоридаги оятлардан бизга Одамзод Аллоҳнинг Ердаги сир-асрорини биладиган халифаси экани ва ҳатто бегуноҳ фаришталар ҳам унга таъзим қилишлари маълум бўлгани каби шайтоннинг сўзига кириш уни жаннатдан маҳрум қилгани, энди Ерда тинч, осойишта яшаш учун шайтони лаъиннинг васвасаларига учмаслик зарурлиги уқтирилади. Энди, Одамзоднинг коинотдаги энг азиз ва мукаррам зот экани баён қилинганидан кейин сўз Бани Исроил (Исроил — Яъқуб пайғамбарнинг номларидан бири, бани Исроил — Исроил болалари дейилганда яҳудийлар тушунилади) ҳақида кетади. Уларнинг ким эканликлари, қилмишлари ва топажак оқибатлари ҳақидаги батафсил ҳикояда (40-141- оятлар) ақл эгалари учун ибратлар бордир.","lang":"uz","version":{"key":"uzbek_mansour","direction":"ltr","language_iso_code":"uz","version":"1.0.0","last_update":1490389200,"title":"Uzbek translation - Alauddin Mansour","description":"Translation of the Quran meanings into Uzbek by Alauddin Mansour, printed in 1430 H. Notice: Some referred translated verses corrected by Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-alladhīna kafarū wakadhabū biāyātinā ulāika aṣḥābu al-nāri hum fīhā khālidūna ","translations":["And those","who disbelieve[d]","and deny","Our Signs","those","(are the) companions","(of) the Fire","they","in it","(will) abide forever","(39)"],"transliterationArr":["wa-alladhīna","kafarū","wakadhabū","biāyātinā","ulāika","aṣḥābu","al-nāri","hum","fīhā","khālidūna",null],"verseTiming":[[1,0,1150],[2,1150,1980],[3,1980,3080],[4,3080,5900],[5,5900,8260],[6,8260,9120],[7,9120,12790],[8,12790,13190],[9,13190,14060],[10,14060,17475]]}}