{"name":"30:5","price":"5. Аллоҳ (румликларни) ғолиб қилгани сабабли. (Аллоҳ) Ўзи хоҳлаган кишини ғолиб қилур. У қудрат ва раҳм-шафқат Эгасидир.","arabic":"بِنَصۡرِ ٱللَّهِۚ يَنصُرُ مَن يَشَآءُۖ وَهُوَ ٱلۡعَزِيزُ ٱلرَّحِيمُ","category":["30 (Ar-Rum)","Ar-Rum","Surah Ar-Rum","Chapter Ar-Rum","Rum","Surah Rum","Chapter Rum","Ar Rum","Surah Ar Rum","Chapter Ar Rum","Surah 30","Chapter 30","The Romans","الرُّوم"],"ayahNumber":3414,"juzNumber":21,"footnotes":"И з о ҳ. Рум мамлакати арабларга яқин бўлиб, румликлар насроний динига мансуб, форслар эса мажусий эдилар. Шунинг учун ҳам форслар ғолиб бўлгани ҳақидаги хабар Маккага етиб келганида, Макка мушриклари қувонишиб мўмин-мусулмонларга «Сенлар Қуръонга ишонганларинг каби румликлар Инжилга ишонишади, форслар эса худди бизларга ўхшаб ҳеч қандай илоҳий китобга иймон келтиришмаган. Мана бугун форслар румликларни енгишганидек, яқинда бизлар ҳам сенларни енгамиз», дер эдилар. Шунда юқоридаги оятлар нозил бўлиб, мўминларга таскини дил бахш этди ва дарҳақиқат, у оятларнинг берган башорати рост бўлиб чиқди. Барча Ислом уламоларининг наздида, ушбу оятлар ғайб-келажак ҳақидаги бу ҳақ хабарни берганлиги Муҳаммад алайҳис-салоту вас-салом Аллоҳнинг пайғамбари эканликларига, Қуръон эса Аллоҳнинг каломи эканлигига яна бир далилдир.","lang":"uz","version":{"key":"uzbek_mansour","direction":"ltr","language_iso_code":"uz","version":"1.0.0","last_update":1490389200,"title":"Uzbek translation - Alauddin Mansour","description":"Translation of the Quran meanings into Uzbek by Alauddin Mansour, printed in 1430 H. Notice: Some referred translated verses corrected by Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"binaṣri al-lahi yanṣuru man yashāu wahuwa al-ʿazīzu al-raḥīmu ","translations":["With (the) help","(of) Allah","He helps","whom","He wills","And He","(is) the All-Mighty","the Most Merciful","(5)"],"transliterationArr":["binaṣri","al-lahi","yanṣuru","man","yashāu","wahuwa","al-ʿazīzu","al-raḥīmu",null],"verseTiming":[[1,0,1090],[2,1090,4060],[3,4060,5750],[4,5750,6680],[5,6680,9409],[6,9409,9909],[7,9909,11059],[8,11059,14084]]}}