{"name":"33:20","price":"20. Улар (яъни, мунофиқлар қўрқоқликлари сабабли кофир фирқалар Мадина атрофидан тарқаб кетганларидан кейин ҳам) у фирқаларни кетмаган, деб ўйлайдилар ва агар у фирқалар (яна қайтиб) қолсалар (мунофиқлар шаҳарда — сизларнинг ичингизда эмас, балки саҳрода) кўчманчи бадавийлар орасида бўлиб, сизларнинг ҳоли-хабарларингиз ҳақида сўраб-билиб туришни дўст тутадилар. Агар улар сизларнинг орангизда бўлганларида ҳам камдан-кам жанг қилган бўлур эдилар.","arabic":"يَحۡسَبُونَ ٱلۡأَحۡزَابَ لَمۡ يَذۡهَبُواْۖ وَإِن يَأۡتِ ٱلۡأَحۡزَابُ يَوَدُّواْ لَوۡ أَنَّهُم بَادُونَ فِي ٱلۡأَعۡرَابِ يَسۡـَٔلُونَ عَنۡ أَنۢبَآئِكُمۡۖ وَلَوۡ كَانُواْ فِيكُم مَّا قَٰتَلُوٓاْ إِلَّا قَلِيلٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab","Chapter Al-Ahzab","Ahzab","Surah Ahzab","Chapter Ahzab","Al Ahzab","Surah Al Ahzab","Chapter Al Ahzab","Surah 33","Chapter 33","The Combined Forces","الأحزَاب"],"ayahNumber":3553,"juzNumber":21,"footnotes":"И з о ҳ. Юқоридаги (9-20) оятларда ҳижратнинг бешинчи санасида бўлиб ўтган ва Ислом тарихида «Хандақ жанги» деган ном билан қолган бир жанг тафсилоти баён қилинди. Муфассирларнинг ёзишларича, воқеа бундай бўлган экан: Макка ва Мадина атрофларидаги бир неча қабила-фирқалар мусулмонларни йўқ қилиб юбориш учун тил бириктиришиб, ўн икки мингдан ортиқ қўшин тўплайдилар ва Мадинага юриш қиладилар. Бу шум хабардан воқиф бўлгач, Пайғамбар алайҳис-салоту вас-салом уч минг чоғли аскарлари билан Мадинанинг четига чиқиб, саҳобалардан Салмони Форсийнинг маслаҳатларига кўра зудлик билан шаҳарнинг чор-атрофига хандақ кавлайдилар ва ўзлари ҳимояга ҳозир бўлиб турадилар. Шу орада ҳар тарафдан етиб келган турли фирқаларнинг йўлини шу пайтгача араб урушларида қўлланилмаган усул — хандақ тўсади ва улар Мадинани тўрт томонидан қуршаб қамал қиладилар, аммо шаҳар ичига кириш чорасини топа олмайдилар. Шаҳар аҳолиси эса қамал қилиб турган ёвнинг ваҳшатидан даҳшатга тушади ва шунда мўмин ким-у, мунофиқ кимлиги ажралиб қолади: Мўминлар Аллоҳ таолонинг нусратига кўз тикиб, Пайғамбар алайҳис-салоту вас-салом теварагига янада жипслашадилар, мунофиқлар эса бутунлай ноумидликка тушиб, ўзгаларни ҳам васвасага сола бошлайдилар. Мана шу зайлда бир ойга яқин муддат кечганидан сўнг, бир куни тўсатдан ҳаво совуб, қаттиқ бўрон туради ва қамал қилиб турганлар ёққан ўт-оловларни ўчириб, тиккан чодир-ўтовларини ўчириб кетади ва улар Мадинага киришдан умидлари узилиб, ортларига қайтиб кетишдан ўзга чора топа олмай қоладилар. Шундай қилиб, Аллоҳ таоло ушбу оғир дамларда мўминларнинг иймонларини яна бир бор имтиҳон қилади ва тил учида иймон келтирсалар-да, дилларида мараз-нифоқ бўлган кимсаларнинг кирдикорларини фош этади.","lang":"uz","version":{"key":"uzbek_mansour","direction":"ltr","language_iso_code":"uz","version":"1.0.0","last_update":1490389200,"title":"Uzbek translation - Alauddin Mansour","description":"Translation of the Quran meanings into Uzbek by Alauddin Mansour, printed in 1430 H. Notice: Some referred translated verses corrected by Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yaḥsabūna al-aḥzāba lam yadhhabū wa-in yati al-aḥzābu yawaddū law annahum bādūna fī al-aʿrābi yasalūna ʿan anbāikum walaw kānū fīkum mā qātalū illā qalīlan ","translations":["They think","the confederates","(have) not","withdrawn","And if","(should) come","the confederates","they would wish","if","that they (were)","living in (the) desert","among","the Bedouins","asking","about","your news","And if","they were","among you","not","they would fight","except","a little","(20)"],"transliterationArr":["yaḥsabūna","al-aḥzāba","lam","yadhhabū","wa-in","yati","al-aḥzābu","yawaddū","law","annahum","bādūna","fī","al-aʿrābi","yasalūna","ʿan","anbāikum","walaw","kānū","fīkum","mā","qātalū","illā","qalīlan",null],"verseTiming":[[1,0,1060],[2,1060,2240],[3,2240,2560],[4,2560,3620],[5,3620,5050],[6,5050,5600],[7,5600,6710],[8,6710,7660],[9,7660,8040],[10,8040,10650],[11,10650,11590],[12,11590,11810],[13,11810,13010],[14,13010,14080],[15,14080,14480],[16,14480,18560],[17,18560,19040],[18,19040,19790],[19,19790,20710],[20,20710,21580],[21,21580,23790],[22,23790,24430],[23,24430,26045]]}}