{"name":"34:14","price":"14. Энди қачонки Биз (Сулаймонга) ўлимни ҳукм қилгач, унинг ўлимига фақат асосини еяётган (ёғоч) кемирувчи қуртгина дадолат қилди. Бас, қачонки у қулаб тушгач, жинларга аниқ бўлдики, агар улар ғайбни билгувчи бўлганларида бу хор қилгувчи азобда-меҳнатда қолмаган бўлур эдилар.","arabic":"فَلَمَّا قَضَيۡنَا عَلَيۡهِ ٱلۡمَوۡتَ مَا دَلَّهُمۡ عَلَىٰ مَوۡتِهِۦٓ إِلَّا دَآبَّةُ ٱلۡأَرۡضِ تَأۡكُلُ مِنسَأَتَهُۥۖ فَلَمَّا خَرَّ تَبَيَّنَتِ ٱلۡجِنُّ أَن لَّوۡ كَانُواْ يَعۡلَمُونَ ٱلۡغَيۡبَ مَا لَبِثُواْ فِي ٱلۡعَذَابِ ٱلۡمُهِينِ","category":["34 (Saba)","Saba","Surah Saba","Chapter Saba","Surah 34","Chapter 34","Sheba","سَبَأ"],"ayahNumber":3620,"juzNumber":22,"footnotes":"И з о ҳ. Мазкур оятларда ота-ўғил — Довуд ва Сулаймон пайғамбарларга Аллоҳ таоло ато этган неъматлар санаб ўтилди. Дарҳақиқат, Аллоҳ таоло Довуд алайҳиссаломга шундай хуш овоз берган эканки, у киши Забурни тиловат қилганларида осмонда учиб кетаётган қушлар тек қотар ва чор атрофдаги тоғу-тошлар билан бирга у зотга жўровоз бўлиб тиловат қилишар экан. Ўша замонда темирчилик ҳунари ниҳоят даражада равнақ топган бўлиб, темирчилар ўзларининг асбоб-анжомлари воситасида истаган нарсаларини ясай олар эканлар. Асли касби совутсозлик бўлган Довуд пайғамбар эса шундай фазилатга эга эканларки, қўллари теккан темир ҳамирдек мулойим бўлиб қолар ва у зот бирон асбоб-анжомсиз уни ўзлари хоҳлаган шаклга киритар эдилар. Бу мўъжизанинг гувоҳи бўлган кишилар Довуднинг ҳақ пайғамбар эканига иймон келтиришар эди. Энди Сулаймон алайҳиссаломга эса Аллоҳ таоло инсу-жин подшоҳлигини ато этган эди. Учар шамоллар ҳам у зотнинг инон-ихтиёрида бўлиб, истаган жойларига бир зумда элтиб қўяр эди. Сулаймон пайғамбарга берилган мўъжизалардан яна бири мис булоғи бўлиб, ривоят қилинишича, ундан сув ўрнига муздек мис оқиб ётар, пайғамбар измидаги жинлар эса ўша мисдан у зотнинг хоҳлаган нарсаларини ясаб беришар экан. Ушбу сўнгги оят айрим кишиларнинг жинлар ғайбни — яъни келажакда рўй берадиган воқеа-ҳодисаларни биладилар, деган гумонларини рад этади. Чунки улар то ўтирган ҳолларида жон таслим қилган Сулаймон алайҳиссаломнинг суяниб ўтирган асоларини бир йил давомида ёғоч қурти еб ерга қулаб тушмагунларича у зотнинг вафот қилганларини билмаганлар ва тиним билмасдан пайғамбар уларга буюрган оғир меҳнатда — баланд қаср бино қилишда давом этганлар. Ушбу оятларда Аллоҳ таоло ато этган фазлу-марҳаматига шукр қилиб ўтган солиҳ пайғамбарлар ҳақида ҳикоя қилинган бўлса, қуйидаги оятларда Аллоҳ берган неъматларга ношукурлик қилганлари оқибатида улардан маҳрум қилиниб, ҳалокатга гирифтор бўлган қавм тўғрисида сўз юритилади.","lang":"uz","version":{"key":"uzbek_mansour","direction":"ltr","language_iso_code":"uz","version":"1.0.0","last_update":1490389200,"title":"Uzbek translation - Alauddin Mansour","description":"Translation of the Quran meanings into Uzbek by Alauddin Mansour, printed in 1430 H. Notice: Some referred translated verses corrected by Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"falammā qaḍaynā ʿalayhi al-mawta mā dallahum ʿalā mawtihi illā dābbatu al-arḍi takulu minsa-atahu falammā kharra tabayyanati al-jinu an law kānū yaʿlamūna al-ghayba mā labithū fī al-ʿadhābi al-muhīni ","translations":["Then when","We decreed","for him","the death","not","indicated to them","[on]","his death","except","a creature","(of) the earth","eating","his staff","But when","he fell down","became clear","(to) the jinn","that","if","they had","known","the unseen","not","they (would have) remained","in","the punishment","humiliating","(14)"],"transliterationArr":["falammā","qaḍaynā","ʿalayhi","al-mawta","mā","dallahum","ʿalā","mawtihi","illā","dābbatu","al-arḍi","takulu","minsa-atahu","falammā","kharra","tabayyanati","al-jinu","an","law","kānū","yaʿlamūna","al-ghayba","mā","labithū","fī","al-ʿadhābi","al-muhīni",null],"verseTiming":[[1,0,1530],[2,1530,2480],[3,2480,3280],[4,3280,3990],[5,3990,4310],[6,4310,5200],[7,5200,5830],[8,5830,7940],[9,7940,11040],[10,11040,11820],[11,11820,12580],[12,12580,13280],[13,13280,15840],[14,15840,17110],[15,17110,17740],[16,17740,18850],[17,18850,20210],[18,20210,20440],[19,20440,20910],[20,20910,21680],[21,21680,22830],[22,22830,23530],[23,23530,23890],[24,23890,24620],[25,24620,24840],[26,24840,25760],[27,25760,28655]]}}