{"name":"35:28","price":"28. Шунингдек одамлар, жониворлар ва чорва ҳайвонлари орасида ҳам ранг-баранглари бордир. Аллоҳдан бандалари орасидаги олим-билимдонларгина қўрқур. Шак-шубҳасиз, Аллоҳ қудратли, мағфиратлидир.","arabic":"وَمِنَ ٱلنَّاسِ وَٱلدَّوَآبِّ وَٱلۡأَنۡعَٰمِ مُخۡتَلِفٌ أَلۡوَٰنُهُۥ كَذَٰلِكَۗ إِنَّمَا يَخۡشَى ٱللَّهَ مِنۡ عِبَادِهِ ٱلۡعُلَمَٰٓؤُاْۗ إِنَّ ٱللَّهَ عَزِيزٌ غَفُورٌ","category":["35 (Fatir)","Fatir","Surah Fatir","Chapter Fatir","Surah 35","Chapter 35","The Originator","فَاطِر"],"ayahNumber":3688,"juzNumber":22,"footnotes":"И з о ҳ. Бу икки оятда оламдаги барча мавжудотнинг яратгувчиси ёлғиз Аллоҳ таоло эканлиги таъкидланмоқда. Дарҳақиқат, илм-маърифат эгаси бўлган ҳар бир инсон осмондан ёғилган бир хил рангдаги сув сабабли қора ердан униб чиқадиган рангу рўйи турли-туман бўлган наботот оламига, усти кўриниши ҳам, остида яширган хазина-дафиналари ҳам ранго ранг тоғу-тошларга — жамодот оламига ва заминнинг осту-устида тарқалиб, ўзларига юкланган вазифаларни бош тортмасдан бажариб юрган ҳайвонот оламининг ранг-баранглигига ва ниҳоят мана шу барча мавжудотдан фойдаланиб, уларни бошқаришни ўз зиммасига олган инсонларнинг рангу рўйлари ҳам, феъли атвор ва удум анъаналари ҳам неча турфа эканлигига тафаккур ва ибрат назари билан боқса, Яратганнинг қудрату-хунармандчилигига тасанно айтмасдан қолмас. Шунинг учун ҳам мазкур оятда Аллоҳдан фақат ҳақиқий илм-маърифат эгалари қўрқишлари уқтириб ўтилди.","lang":"uz","version":{"key":"uzbek_mansour","direction":"ltr","language_iso_code":"uz","version":"1.0.0","last_update":1490389200,"title":"Uzbek translation - Alauddin Mansour","description":"Translation of the Quran meanings into Uzbek by Alauddin Mansour, printed in 1430 H. Notice: Some referred translated verses corrected by Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wamina al-nāsi wal-dawābi wal-anʿāmi mukh'talifun alwānuhu kadhālika innamā yakhshā al-laha min ʿibādihi al-ʿulamāu inna al-laha ʿazīzun ghafūrun ","translations":["And among","men","and moving creatures","and the cattle","(are) various","[their] colors","likewise","Only","fear","Allah","among","His slaves","those who have knowledge","Indeed","Allah","(is) All-Mighty","Oft-Forgiving","(28)"],"transliterationArr":["wamina","al-nāsi","wal-dawābi","wal-anʿāmi","mukh'talifun","alwānuhu","kadhālika","innamā","yakhshā","al-laha","min","ʿibādihi","al-ʿulamāu","inna","al-laha","ʿazīzun","ghafūrun",null],"verseTiming":[[1,0,570],[2,570,2100],[3,2100,5690],[4,5690,6980],[5,6980,7980],[6,7980,9740],[7,9740,11180],[8,11180,12980],[9,12980,13590],[10,13590,14370],[11,14370,14700],[12,14700,15750],[13,15750,18970],[14,18970,20620],[15,20620,21360],[16,21360,22210],[17,22210,25305]]}}