{"name":"38:28","price":"28. Балки Биз иймон келтирган ва яхши амаллар қилган зотларни Ерда бузғунчилик қилиб юрган кимсалар каби қилиб қўюрмиз?! Балки Биз тақводор зотларни фисқу-фужур қилиб юрган кимсалар каби қилиб қўюрмиз?! (Йўқ, асло ундоқ бўлмас!)","arabic":"أَمۡ نَجۡعَلُ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ كَٱلۡمُفۡسِدِينَ فِي ٱلۡأَرۡضِ أَمۡ نَجۡعَلُ ٱلۡمُتَّقِينَ كَٱلۡفُجَّارِ","category":["38 (Sad)","Sad","Surah Sad","Chapter Sad","Surah 38","Chapter 38","Saad","ص"],"ayahNumber":3998,"juzNumber":23,"footnotes":"И з о ҳ. Юқоридаги икки оятни шундай тушунмоқ лозим: Аллоҳ таоло осмону замин ва улар ўртасидаги бирон нарсани беҳуда яратган эмасдир. Балки У зот коинотдаги ҳар бир мавжудотни етук ҳикмат билан яратиб, уларни Ўзининг ердаги халифаси бўлмиш инсон манфаати учун бўйсундириб қўйди. Шунингдек, У зот борлиқдаги ҳар бир нарсага алоҳида сурат ва сийрат ато этиб, то Қиёмат амал қилиб ўтадиган ҳаёт қонунини белгилаб қўйди. Бас, энг кичик заррадан тортиб энг йирик сайёрагача ҳар бир мавжудот Яратган белгилаб қўйган ана ўша қонунга сўзсиз амал қилиши лозим. Акс ҳолда ҳам илоҳий қонунни бузувчи ҳалокатга юз тутади, ҳам олам интизомига футур етади. Энди ушбу оламнинг азизу мукаррам бир бўлаги ва Ер юзининг халифаси бўлмиш Инсон учун Аллоҳ таоло томонидан нозил қилинган илоҳий қонун Шариати Исломийядирки, Аллоҳга иймон келтирган ва шариат кўрсатмаларига амал қилган Инсон ҳам ўзи икки дунё саодатига эришади, ҳам унинг атрофидаги олам ундан бирон озор кўрмайди. Акс ҳолда эса илоҳий қонунни инкор этиб, унга бўйинсунмаган кимсалар ҳам ўзлари яшаб турган оламга жабр-зулм қиладилар, ҳам мана шу жиноятларига яраша жазо оладилар. Тўғри, кўп ҳолларда ушбу имтиҳон олами бўлмиш дунёда яхши билан ёмон, золим билан мазлум, мўмин кофир ёнма-ён — яхши баҳосини, ёмон жазосини олмасдан ўтавериши мумкин. Аммо имтиҳон ўтиб, ҳаёти дунё ниҳоясига етиб, Охират диёрига борилгач, албатта Ер юзидаги халифаликни ўрнига қўйиб иймон ва яхши амаллар билан ўтган тақводор зотлар ўзлари учун тайёрлаб қўйилган мукофотларни, Яратганни унутиб Ерда бузғунчилик қилиб ўтган фосиқлар эса ҳақиқий жазоларини олишлари аниқдир.","lang":"uz","version":{"key":"uzbek_mansour","direction":"ltr","language_iso_code":"uz","version":"1.0.0","last_update":1490389200,"title":"Uzbek translation - Alauddin Mansour","description":"Translation of the Quran meanings into Uzbek by Alauddin Mansour, printed in 1430 H. Notice: Some referred translated verses corrected by Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"am najʿalu alladhīna āmanū waʿamilū al-ṣāliḥāti kal-muf'sidīna fī al-arḍi am najʿalu al-mutaqīna kal-fujāri ","translations":["Or","should We treat","those who","believe","and do","righteous deeds","like those who spread corruption","in","the earth","Or","should We treat","the pious","like the wicked","(28)"],"transliterationArr":["am","najʿalu","alladhīna","āmanū","waʿamilū","al-ṣāliḥāti","kal-muf'sidīna","fī","al-arḍi","am","najʿalu","al-mutaqīna","kal-fujāri",null],"verseTiming":[[1,0,450],[2,450,1160],[3,1160,2120],[4,2120,3270],[5,3270,3970],[6,3970,5460],[7,5460,7020],[8,7020,7230],[9,7230,8090],[10,8090,8460],[11,8460,9230],[12,9230,10590],[13,10590,14035]]}}