{"name":"3:128","price":"128. (Эй Муҳаммад алайҳис-салоту вас-салом), Сиз учун бу ишда (яъни, бандаларга нажот бериш ёки уларни ҳалок қилиш ишида) ҳеч бир нарса (яъни, инон-ихтиёр) йўқдир. (Аллоҳнинг Ўзи) ё уларнинг тавбаларини қабул қилар ёки золимликлари сабабли азоблар.","arabic":"لَيۡسَ لَكَ مِنَ ٱلۡأَمۡرِ شَيۡءٌ أَوۡ يَتُوبَ عَلَيۡهِمۡ أَوۡ يُعَذِّبَهُمۡ فَإِنَّهُمۡ ظَٰلِمُونَ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":421,"juzNumber":4,"footnotes":"И з о ҳ. Бу оят Уҳуд жангида Пайғамбар алайҳис-салоту вас-саломнинг тишлари синиб, юзлари ёрилганида у зот, «ўз паиғамбарларининг юзини қонга бўяган қавм қандай нажот топсин?», дея умидсизликка тушиб, Абу Суфён ибн Ҳарб, Сафвон ибн Умайя, Суҳайл ибн Амр ва Ҳорис ибн Ҳишом каби мушрикларнинг катталарини дуои баъд қилганларида Аллоҳ таоло уларни дуои баъд қилишдан қайтариб, ушбу оятни нозил қилди. Ва Пайғамбар алайҳис-салоту вас-саломга асл вазифаси эслатилди: сизнинг вазифангиз ҳақни етказиш, одамларни Тўғри Йўлга етаклаш ва уларнинг фойдаларини кўзлашдир. Бандаларнинг иши эса Аллоҳга ҳавола, Ўзи хоҳлаганини ҳидоят қилади ва хоҳлаганини адаштиради.","lang":"uz","version":{"key":"uzbek_mansour","direction":"ltr","language_iso_code":"uz","version":"1.0.0","last_update":1490389200,"title":"Uzbek translation - Alauddin Mansour","description":"Translation of the Quran meanings into Uzbek by Alauddin Mansour, printed in 1430 H. Notice: Some referred translated verses corrected by Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"laysa laka mina al-amri shayon aw yatūba ʿalayhim aw yuʿadhibahum fa-innahum ẓālimūna ","translations":["Not","for you","of","the decision","(of) anything","whether","He turns","to them","or","punishes them","for indeed, they","(are) wrongdoers","(128)"],"transliterationArr":["laysa","laka","mina","al-amri","shayon","aw","yatūba","ʿalayhim","aw","yuʿadhibahum","fa-innahum","ẓālimūna",null],"verseTiming":[[1,0,830],[2,830,1260],[3,1260,1600],[4,1600,2520],[5,2520,3390],[6,3390,3780],[7,3780,4690],[8,4690,5860],[9,5860,6190],[10,6190,7780],[11,7780,9660],[12,9660,13295]]}}