{"name":"3:174","price":"174. Бас, у юришдан бирон нохушлик етмай, Аллоҳнинг неъмат ва фазли билан қайтдилар. Улар Аллоҳнинг ризолигини истадилар. Аллоҳ эса улуғ фазлу марҳамат Соҳибидир.","arabic":"فَٱنقَلَبُواْ بِنِعۡمَةٖ مِّنَ ٱللَّهِ وَفَضۡلٖ لَّمۡ يَمۡسَسۡهُمۡ سُوٓءٞ وَٱتَّبَعُواْ رِضۡوَٰنَ ٱللَّهِۗ وَٱللَّهُ ذُو فَضۡلٍ عَظِيمٍ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":467,"juzNumber":4,"footnotes":"И з о ҳ. Юқоридаги оятларда мусулмонларнинг Уҳуд жангидан кейинги аҳволи баён қилинди. Ривоят қилишларича, мушриклар Уҳудда мусулмонлар устидан ғалаба қилиб, уйларига қайтгач, йўлда: «Нега уларни бутунлай қириб ташламадик?», деб надомат қилдилар. Бу гап Расулуллоҳга етиб келганида у зот мушрикларнинг дилига қўрқув солиш ва уларга ўзларини ҳали куч-қувватга эга эканликларини кўрсатиб қўйиш учун мусулмонларни уларнинг ортидан юришга чақирадилар. Мусулмонлар Уҳуд жангида кўп талофот ва жароҳатлар олганларига қарамай, пайғамбарнинг даъватларига «Лаббай!» деб жавоб бердилар ва баъзи бир «шайтон»ларнинг «Қурайшлик мушрикларнинг сон-саноқсиз лашкари бор», деган васвасалари ҳам уларни қўрқита олмади, балки иймонларини зиёда қилди, холос. Улар Пайғамбар алайҳис-салоту вас-салом билан бирга мушрикларнинг ортидан бориб Ҳамро ал-Асад деган жойда уларга етиб олдилар. Шунда Аллоҳ таоло мушрикларнинг дилларига бир қўрқув солди ва улар мусулмонларга қарши жанг қилишга журъат қила олмадилар ва мусулмонлар эсон-омон Мадинага қайтиб келдилар.","lang":"uz","version":{"key":"uzbek_mansour","direction":"ltr","language_iso_code":"uz","version":"1.0.0","last_update":1490389200,"title":"Uzbek translation - Alauddin Mansour","description":"Translation of the Quran meanings into Uzbek by Alauddin Mansour, printed in 1430 H. Notice: Some referred translated verses corrected by Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"fa-inqalabū biniʿ'matin mina al-lahi wafaḍlin lam yamsashum sūon wa-ittabaʿū riḍ'wāna al-lahi wal-lahu dhū faḍlin ʿaẓīmin ","translations":["So they returned","with (the) Favor","of","Allah","and Bounty","not","touched them","any harm","And they followed","(the) pleasure","(of) Allah","and Allah","(is) Possessor","(of) Bounty","great","(174)"],"transliterationArr":["fa-inqalabū","biniʿ'matin","mina","al-lahi","wafaḍlin","lam","yamsashum","sūon","wa-ittabaʿū","riḍ'wāna","al-lahi","wal-lahu","dhū","faḍlin","ʿaẓīmin",null],"verseTiming":[[1,0,2260],[2,2260,3590],[3,3590,4840],[4,4840,5870],[5,5870,6810],[6,6810,7460],[7,7460,8760],[8,8760,11910],[9,11910,13160],[10,13160,14230],[11,14230,16960],[12,16960,18100],[13,18100,18490],[14,18490,19400],[15,19400,21945]]}}