{"name":"3:31","price":"31. (Эй Муҳаммад алайҳис-салоту вас-салом), айтинг: «Агар Аллоҳни севсангиз, менга эргашинглар. Шунда Аллоҳ сизларни севади ва гуноҳларингизни мағфират қилади. Аллоҳ (гуноҳларни) мағфират қилгувчи, меҳрибондир». ","arabic":"قُلۡ إِن كُنتُمۡ تُحِبُّونَ ٱللَّهَ فَٱتَّبِعُونِي يُحۡبِبۡكُمُ ٱللَّهُ وَيَغۡفِرۡ لَكُمۡ ذُنُوبَكُمۡۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":324,"juzNumber":3,"footnotes":"И з о ҳ. Эй Пайғамбар, айтинг: «Агар Аллоҳни чиндан яхши кўрсангиз, менга эргашинг ва зоҳиру ботинда менга иймон келтиринг, шунда Аллоҳ сизларни яхши кўради ва гуноҳларингизни кечиради. Шубҳасиз, У мўмин бандаларининг гуноҳларини кечирувчи ва уларга меҳрибон Зотдир». Бу ояти карима Аллоҳ таолонинг муҳаббатини даъво қилган, лекин Унинг пайғамбари Муҳаммад соллаллоҳу алайҳи ва салламга ҳаққи-рост эргашмаган ва у зотнинг буйруқ ва қайтариқларига итоат қилмаган ҳар бир кишига қарши ҳукмдир. Зеро, бундай кимса то Расулуллоҳ соллаллоҳу алайҳи ва салламга ҳақиқий маънода эргашмас экан, ўз даъвосида ёлғончидир.","lang":"uz","version":{"key":"uzbek_mansour","direction":"ltr","language_iso_code":"uz","version":"1.0.0","last_update":1490389200,"title":"Uzbek translation - Alauddin Mansour","description":"Translation of the Quran meanings into Uzbek by Alauddin Mansour, printed in 1430 H. Notice: Some referred translated verses corrected by Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qul in kuntum tuḥibbūna al-laha fa-ittabiʿūnī yuḥ'bib'kumu al-lahu wayaghfir lakum dhunūbakum wal-lahu ghafūrun raḥīmun ","translations":["Say","If","you","love","Allah","then follow me","will love you","Allah","and He will forgive","for you","your sins","And Allah","(is) Oft-Forgiving","Most Merciful","(31)"],"transliterationArr":["qul","in","kuntum","tuḥibbūna","al-laha","fa-ittabiʿūnī","yuḥ'bib'kumu","al-lahu","wayaghfir","lakum","dhunūbakum","wal-lahu","ghafūrun","raḥīmun",null],"verseTiming":[[1,0,500],[2,500,1690],[3,1690,2980],[4,2980,4210],[5,4210,5140],[6,5140,6810],[7,6810,8030],[8,8030,8980],[9,8980,10030],[10,10030,10580],[11,10580,12380],[12,12380,13480],[13,13480,13900],[14,13900,17585]]}}