{"name":"43:58","price":"58. Улар: «Бизларнинг илоҳларимиз яхшироқми ёки уми (яъни, Ийсоми?!) дедилар. Улар (бу мисолни) сизга фақат талашиб-тортишиш учунгина келтирдилар. Ахир улар хусуматчи-урушқоқ қавмдирлар!","arabic":"وَقَالُوٓاْ ءَأَٰلِهَتُنَا خَيۡرٌ أَمۡ هُوَۚ مَا ضَرَبُوهُ لَكَ إِلَّا جَدَلَۢاۚ بَلۡ هُمۡ قَوۡمٌ خَصِمُونَ","category":["43 (Az-Zukhruf)","Az-Zukhruf","Surah Az-Zukhruf","Chapter Az-Zukhruf","Zukhruf","Surah Zukhruf","Chapter Zukhruf","Az Zukhruf","Surah Az Zukhruf","Chapter Az Zukhruf","Surah 43","Chapter 43","The Gold Adornments","الزُّخْرُف"],"ayahNumber":4383,"juzNumber":25,"footnotes":"И з о ҳ. Бу оятлар мушриклар Ийсо бинни Марямни мисол қилиб, Муҳаммад алайҳис-салоту вас-саломни мулзам этмоқчи бўлишгани хусусидадир. Пайғамбар алайҳис-салоту вас-салом қурайшликларга «(Эй мушриклар), сизлар ҳам, Аллоҳни қўйиб сиғинаётган бутларингиз ҳам жаҳаннам ўтинларидир», оятини (Анбиё сураси, 98-оят) тиловат қилганларида, мушриклар ғазабга минишиб: «Эй Муҳаммад, бу фақат бизларга тегишлими ёки барча миллатларгами?», деб сўрашади, Ҳазрат уларга: «Бу оят барча замонлардаги мушриклар ва улар сиғинадиган нарсаларга тегишлидир», деб жавоб бергач, улардан бири туриб: «Ахир сен Ийсони Аллоҳнинг пайғамбари деб эдинг-ку! Ҳолбуки, насронийлар уни худо деб сиғинадилар. Бас, агар Ийсо насронийлар уни худо қилиб олганлари сабабли дўзахга тушадиган бўлса, бизлар ҳам ўз худоларимиз билан дўзахга тушишга розимиз. Энди бизларга айтгин-чи, бизларнинг худоларимиз яхшироқми ёки Ийсоми?!», деди. Шунда юқоридаги оятлар нозил бўлиб, Ийсо пайғамбар вафот топиб кетгандан кейин насронийлар у зотни худо қилиб олишганлари учун у киши айбдор эмасликлари, бу мушриклар эса фақат талашиб-тортишиш учунгина бундай беҳуда мисолларни келтиришлари баён этилади. Қуйидаги оятларда Ийсо бинни Марям ким бўлганликлари хусусида яна бир бор уқтирилади.","lang":"uz","version":{"key":"uzbek_mansour","direction":"ltr","language_iso_code":"uz","version":"1.0.0","last_update":1490389200,"title":"Uzbek translation - Alauddin Mansour","description":"Translation of the Quran meanings into Uzbek by Alauddin Mansour, printed in 1430 H. Notice: Some referred translated verses corrected by Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waqālū aālihatunā khayrun am huwa mā ḍarabūhu laka illā jadalan bal hum qawmun khaṣimūna ","translations":["And they said","Are our gods","better","or","he","Not","they present it","to you","except","(for) argument","Nay","they","(are) a people","argumentative","(58)"],"transliterationArr":["waqālū","aālihatunā","khayrun","am","huwa","mā","ḍarabūhu","laka","illā","jadalan","bal","hum","qawmun","khaṣimūna",null],"verseTiming":[[1,0,2410],[2,2410,4050],[3,4050,4880],[4,4880,5280],[5,5280,6310],[6,6310,6650],[7,6650,7720],[8,7720,8190],[9,8190,8950],[10,8950,9850],[11,9850,10740],[12,10740,11120],[13,11120,11830],[14,11830,14655]]}}