{"name":"48:15","price":"15. Ҳали сизлар (Хайбар жангида қўлга киритган) ўлжаларини олиш учун кетаётган вақтингизда (жиҳодга чиқмасдан) қолган кимсалар: «Бизлар ҳам (ўша ўлжалардан олиш учун) сизларга эргашишимизга (йўл) қўйинглар», дерлар. Улар Аллоҳнинг каломини ўзгартирмоқчи бўладилар. Айтинг: «Ҳаргиз бизларга эргашмайсизлар! Аллоҳ илгари мана шундай дегандир». Энди улар: «Йуқ, сизлар бизларга ҳасад-бахиллик қилмоқдасизлар», дерлар. Йўқ, улар камдан-кам нарсаларнигина англарлар.","arabic":"سَيَقُولُ ٱلۡمُخَلَّفُونَ إِذَا ٱنطَلَقۡتُمۡ إِلَىٰ مَغَانِمَ لِتَأۡخُذُوهَا ذَرُونَا نَتَّبِعۡكُمۡۖ يُرِيدُونَ أَن يُبَدِّلُواْ كَلَٰمَ ٱللَّهِۚ قُل لَّن تَتَّبِعُونَا كَذَٰلِكُمۡ قَالَ ٱللَّهُ مِن قَبۡلُۖ فَسَيَقُولُونَ بَلۡ تَحۡسُدُونَنَاۚ بَلۡ كَانُواْ لَا يَفۡقَهُونَ إِلَّا قَلِيلٗا","category":["48 (Al-Fath)","Al-Fath","Surah Al-Fath","Chapter Al-Fath","Fath","Surah Fath","Chapter Fath","Al Fath","Surah Al Fath","Chapter Al Fath","Surah 48","Chapter 48","The Victory","الفتح"],"ayahNumber":4598,"juzNumber":26,"footnotes":"И з о ҳ. Пайғамбар алайҳис-салоту вас-салом бошлиқ саҳобалар Ҳудайбийя сулҳидан қайтишгач, Хайбар воҳасидаги яҳудийларга қарши жанг қилишиб, ғалаба қозонадилар ва катта ўлжаларни қўлга киритадилар. Бу ўлжалардан хабар топган мунофиқлар ўзлари жангдан қочган бўлсалар-да, ўлжадан хомтамаъ бўлганларида, мазкур оят орқали уларга кескин рад жавоби берилади ва Аллоҳ таоло бу ўлжаларни фақат Ҳудайбийя сулҳида иштирок этган кишилар учун хос қилиб қўйгани баён этилади, ҳамда у мунофиқларнинг Аллоҳ буюрган ҳукмларидаги ҳикматни англай олмасликлари ҳам ошкор қилинади.","lang":"uz","version":{"key":"uzbek_mansour","direction":"ltr","language_iso_code":"uz","version":"1.0.0","last_update":1490389200,"title":"Uzbek translation - Alauddin Mansour","description":"Translation of the Quran meanings into Uzbek by Alauddin Mansour, printed in 1430 H. Notice: Some referred translated verses corrected by Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"sayaqūlu al-mukhalafūna idhā inṭalaqtum ilā maghānima litakhudhūhā dharūnā nattabiʿ'kum yurīdūna an yubaddilū kalāma al-lahi qul lan tattabiʿūnā kadhālikum qāla al-lahu min qablu fasayaqūlūna bal taḥsudūnanā bal kānū lā yafqahūna illā qalīlan ","translations":["Will say","those who remained behind","when","you set forth","towards","(the) spoils of war","to take it","Allow us","(to) follow you","They wish","to","change","(the) Words","(of) Allah","Say","Never","will you follow us","Thus","Allah said","Allah said","before","before","Then they will say","Nay","you envy us","Nay","they were","not","understanding","except","a little","(15)"],"transliterationArr":["sayaqūlu","al-mukhalafūna","idhā","inṭalaqtum","ilā","maghānima","litakhudhūhā","dharūnā","nattabiʿ'kum","yurīdūna","an","yubaddilū","kalāma","al-lahi","qul","lan","tattabiʿūnā","kadhālikum","qāla","al-lahu","min","qablu","fasayaqūlūna","bal","taḥsudūnanā","bal","kānū","lā","yafqahūna","illā","qalīlan",null],"verseTiming":[[1,0,1140],[2,1140,2850],[3,2850,3290],[4,3290,5160],[5,5160,5760],[6,5760,6770],[7,6770,8440],[8,8440,9620],[9,9620,11480],[10,11480,12640],[11,12640,12940],[12,12940,14130],[13,14130,15770],[14,15770,18310],[15,18310,18580],[16,18580,19870],[17,19870,21630],[18,21630,23340],[19,23340,23840],[20,23840,24870],[21,24870,25970],[22,25970,26380],[23,26380,28700],[24,28700,29080],[25,29080,30810],[26,30810,31610],[27,31610,32490],[28,32490,32880],[29,32880,34150],[30,34150,34990],[31,34990,36265]]}}