{"name":"48:27","price":"27. Қасамки, Аллоҳ Ўз пайғамбарига (у киши кўрган) тушни ҳаққи-рост қилди: албатта сизлар (эй мўминлар), иншоаллоҳ Масжидул-Харомга тинч-омон бошларингизни (сочларингизни) қирдирган ва (ёки) қисқартирган ҳолларингизда хавф-хатарсиз кирурсизлар. Бас, (Аллоҳ) сизлар билмаган нарсани билиб, ундан (Макка фатҳидан) олдин яқин бир ғалабани (Хайбар жангидаги ғалабани муяссар) қилди.","arabic":"لَّقَدۡ صَدَقَ ٱللَّهُ رَسُولَهُ ٱلرُّءۡيَا بِٱلۡحَقِّۖ لَتَدۡخُلُنَّ ٱلۡمَسۡجِدَ ٱلۡحَرَامَ إِن شَآءَ ٱللَّهُ ءَامِنِينَ مُحَلِّقِينَ رُءُوسَكُمۡ وَمُقَصِّرِينَ لَا تَخَافُونَۖ فَعَلِمَ مَا لَمۡ تَعۡلَمُواْ فَجَعَلَ مِن دُونِ ذَٰلِكَ فَتۡحٗا قَرِيبًا","category":["48 (Al-Fath)","Al-Fath","Surah Al-Fath","Chapter Al-Fath","Fath","Surah Fath","Chapter Fath","Al Fath","Surah Al Fath","Chapter Al Fath","Surah 48","Chapter 48","The Victory","الفتح"],"ayahNumber":4610,"juzNumber":26,"footnotes":"И з о ҳ. Муфассирлар ривоят қилишларича, Пайғамбар алайҳис-салоту вас-салом Ҳудайбийя сулҳидан илгари тушларида саҳобалари билан бирга Маккага кирганларини ва Каъбатуллоҳни тавоф қилишгач, айримлари сочларини қирдириб, айримлари қисқартириб ҳаж-умра маросимларини адо этганларини кўрган ва саҳобаларга бу тушларини сўзлаб берган эканлар. Бундай хушхабардан бениҳоя шодланган саҳобалар Расулуллоҳ билан бирга Умра ибодатини адо этиш учун Маккаи Мукаррама томон юриш қиладилар. Лекин Ҳудайбийя водийсига етиб келганларида мушриклар тарафидан йўллари тўсилиб, икки ўртада ўтган оятларда мазкур бўлган сулҳ тузилгач, Маккага кира олмасдан Мадинага қайтиб кетишаётганида мунофиқ кимсалар: «Муҳаммаднинг кўрган туши рост чиқмади-ку!» деб, мусулмонлар орасида иғво тарқатганларида, юқоридаги оят нозил бўлиб, Пайғамбар алайҳис-салоту вас-саломнинг тушлари шак-шубҳасиз, ўнгидан келиши, аммо Аллоҳ таоло бандалар билмайдиган сир-асрорларни билиб, Макка фатҳидан аввал Хайбар жангидаги ғалабани муяссар қилгани ҳақида хабар берилди. Мана шундан кейин орадан бир йил кечгач, Макка мусулмонлар томонидан фатҳ қилинди.","lang":"uz","version":{"key":"uzbek_mansour","direction":"ltr","language_iso_code":"uz","version":"1.0.0","last_update":1490389200,"title":"Uzbek translation - Alauddin Mansour","description":"Translation of the Quran meanings into Uzbek by Alauddin Mansour, printed in 1430 H. Notice: Some referred translated verses corrected by Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"laqad ṣadaqa al-lahu rasūlahu al-ru'yā bil-ḥaqi latadkhulunna al-masjida al-ḥarāma in shāa al-lahu āminīna muḥalliqīna ruūsakum wamuqaṣṣirīna lā takhāfūna faʿalima mā lam taʿlamū fajaʿala min dūni dhālika fatḥan qarīban ","translations":["Certainly","Allah has fulfilled","Allah has fulfilled","His Messenger's","vision","in truth","Surely, you will enter","Al-Masjid Al-Haraam","Al-Masjid Al-Haraam","if","Allah wills","Allah wills","secure","having shaved","your heads","and shortened","not","fearing","But He knew","what","not","you knew","and He made","besides","besides","that","a victory","near","(27)"],"transliterationArr":["laqad","ṣadaqa","al-lahu","rasūlahu","al-ru'yā","bil-ḥaqi","latadkhulunna","al-masjida","al-ḥarāma","in","shāa","al-lahu","āminīna","muḥalliqīna","ruūsakum","wamuqaṣṣirīna","lā","takhāfūna","faʿalima","mā","lam","taʿlamū","fajaʿala","min","dūni","dhālika","fatḥan","qarīban",null],"verseTiming":[[1,0,660],[2,660,1300],[3,1300,2260],[4,2260,3290],[5,3290,4380],[6,4380,5900],[7,5900,7890],[8,7890,8910],[9,8910,10000],[10,10000,11390],[11,11390,13780],[12,13780,14670],[13,14670,17680],[14,17680,18940],[15,18940,20400],[16,20400,21710],[17,21710,23460],[18,23460,23800],[19,23800,27280],[20,27280,28160],[21,28160,28550],[22,28550,28910],[23,28910,29910],[24,29910,30830],[25,30830,31470],[26,31470,32590],[27,32590,33370],[28,33370,35200],[29,35200,36905]]}}