{"name":"48:3","price":"3. ҳамда Аллоҳ сизга қудратли ёрдам бериши учун (сизга очиқ фатҳ ато этдик).","arabic":"وَيَنصُرَكَ ٱللَّهُ نَصۡرًا عَزِيزًا","category":["48 (Al-Fath)","Al-Fath","Surah Al-Fath","Chapter Al-Fath","Fath","Surah Fath","Chapter Fath","Al Fath","Surah Al Fath","Chapter Al Fath","Surah 48","Chapter 48","The Victory","الفتح"],"ayahNumber":4586,"juzNumber":26,"footnotes":"И з о ҳ. Сура мана шундай файзи илоҳий — кечмиш-келмиш барча гуноҳларни мағфират қилиш, илоҳий неъматларни комил қилиб бериш, Тўғри Йўлга ҳидоят, Аллоҳ таоло томонидан бериладиган Қудратли мадад ва очиқ-равшан фатҳ-ғалабани эълон қилиш билан бошланди. Шунинг учун ҳам Пайғамбар алайҳис-салоту вас-салом ушбу сура нозил бўлганида, «Бу кеча менга дунё ва ундаги бор нарсадан суюклироқ бўлган бир сура нозил қилинди», деган эканлар. Хўш, мазкур ғалаба қандай ғалаба эди? Ислом тарихидан маълумки, Ҳижрий олтинчи сананинг охирида (милодий 627 йилда) Расулуллоҳ ўзларининг бир ярим мингга яқин саҳобалари билан Умра (суннат бўлган ҳаж ибодати) қилиш ниятида Мадинаи Мунавварадан Маккаи Мукаррамага қараб йўл оладилар. Улар уруш ғаразида кетмаётганларини билдириш учун Маккага етиб борганларида қурбонлиқ қилиш учун олган чорва ҳайвонларини олдиларига солиб ҳайдаб борадилар. Лекин мусулмонлар Макка яқинидаги Ҳудайбийя деб номланган бир водийга етиб келганларида мушриклар уларни Байтуллоҳга киришдан тўсадилар. Шунда Муҳаммад алайҳис-салоту вас-салом мақсадлари Макка шаҳрини эгаллаб олиш эмас, балки Каъбатуллоҳни зиёрат-тавоф қилиб қайтиб чиқиб кетиш эканлигини етказиш учун Усмон ибн Аффон розияллоҳу анҳу бошлиқ бир гуруҳ элчиларни Макка катталари олдига юборганларида улар Усмонни ҳибсга оладилар, лекин Пайғамбар алайҳис-салоту вас-саломга мушриклар Усмонни қатл қилдилар, деган хабар боради. Шунда Расулуллоҳ саҳобаларни Маккани фатҳ этиш учун байъат-қасамёд қилишга чақирганларида, уларнинг барчалари байъат қиладиларки, бу ҳақда сура давомида алоҳида ҳикоя қилинади. Мусулмонларнинг қасамёдларини эшитиб даҳшатга тушиб қолган мушриклар ўз одамларини Ҳудайбийяга жўнатиб, бу йил мусулмонларни Каъбатуллоҳга йўлатмасликларини ва агар рози бўлсалар, келгуси йилда ўзлари мусулмонларга бемалол зиёрат қилишлари учун Маккани бўшатиб беришларини билдириб, сулҳ таклиф қиладилар. Пайғамбаримиз бу таклифни қабул қиладилар ва бу сулҳ дини Ислом тарихидаги бурилиш нуқталаридан бири бўлиб қолади. Чунки бундан бор-йўғи бир йил олдин мусулмонларни Ер юзидан йўқ қилиб юбориш ғаразида жуда катта лашкар билан Мадинага борган Макка мушриклари бугунга келиб уларга қарши урушиш у ёқда турсин, ўзлари яраш таклиф қилмоқда эдиларки, бу ўз моҳият эътибори билан Ислом динининг Ҳақ ва ўлмайдиган бир дин эканлигини эътироф этиш эди. Бу сулҳнинг Маккадаги ва бошқа атроф-жавонибдаги одамларга жуда катта таъсири бўлиб, мусулмонларнинг улар билан бевосита мулоқот қилишлари ва Исломга даъват этишлари натижасида минглаб кишилар бу ҳақ динга иймон келтирадилар.","lang":"uz","version":{"key":"uzbek_mansour","direction":"ltr","language_iso_code":"uz","version":"1.0.0","last_update":1490389200,"title":"Uzbek translation - Alauddin Mansour","description":"Translation of the Quran meanings into Uzbek by Alauddin Mansour, printed in 1430 H. Notice: Some referred translated verses corrected by Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wayanṣuraka al-lahu naṣran ʿazīzan ","translations":["And Allah may help you","And Allah may help you","(with) a help","mighty","(3)"],"transliterationArr":["wayanṣuraka","al-lahu","naṣran","ʿazīzan",null],"verseTiming":[[1,0,1940],[2,1940,2750],[3,2750,3550],[4,3550,5305]]}}