{"name":"49:12","price":"12. Эй мўминлар, кўп гумон(лар)дан четланинглар! Чунки айрим гумон(лар) гуноҳдир! (Ўзгаларнинг айблари ортидан) жосуслик қилиб юрманглар ва айримларингиз айримларни ғийбат қилмасин! Сизлардан бирон киши ўзининг ўлган биродарининг гўштини ейишни яхши кўрурми?! Ана ёмон кўрдингизми?! (Бас, гуноҳи бундан-да ортиқ бўлган ғийбатни ҳам ёмон кўрингиз)! Аллоҳдан қўрқингиз! Албатта Аллоҳ тавбаларни қабул қилгувчи, меҳрибондир.","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱجۡتَنِبُواْ كَثِيرٗا مِّنَ ٱلظَّنِّ إِنَّ بَعۡضَ ٱلظَّنِّ إِثۡمٞۖ وَلَا تَجَسَّسُواْ وَلَا يَغۡتَب بَّعۡضُكُم بَعۡضًاۚ أَيُحِبُّ أَحَدُكُمۡ أَن يَأۡكُلَ لَحۡمَ أَخِيهِ مَيۡتٗا فَكَرِهۡتُمُوهُۚ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ تَوَّابٞ رَّحِيمٞ","category":["49 (Al-Hujurat)","Al-Hujurat","Surah Al-Hujurat","Chapter Al-Hujurat","Hujurat","Surah Hujurat","Chapter Hujurat","Al Hujurat","Surah Al Hujurat","Chapter Al Hujurat","Surah 49","Chapter 49","The Rooms","الحُجرَات"],"ayahNumber":4624,"juzNumber":26,"footnotes":"И з о ҳ. Мазкур ояти каримада мўминлар жамиятдаги тартиб-интизомни издан чиқарадиган ва меҳр-оқибат йўқолиб кетишига сабаб бўладиган уч иллатдан қайтарилдилар. Булардан биринчиси, ўзгалар ҳақида ёмон гумон қилиш, иккинчиси, бировларнинг айбларини ахтариб топиш учун орқаларидан жосуслик-айғоқчилик қилиб юришдир. Шариати Исломияда шахснинг зоҳирда қилаётган иш-амали ва айтган сўзи мўътабардир. Яъни, масалан бир кишининг муайян бир айб ё жиноятга дахлдор эканлигига аниқ ҳужжат бўлмас экан, унинг ўша айб ё жиноятда гумон қилиниши ҳаромдир. Фақат унинг мунофиқлиги ёки хоинлиги аниқ бўлиб қолган тақдирдагина у ҳақда ёмон гумон қилиш ва ундан ҳазар қилиш вожибдир. Чунки Пайғамбар алайҳис-салоту вас-салом айтганларидек: «Мўмин киши бир тешикдан (яъни, унда яшириниб ётган илон ё чаёндан) икки марта чақилмайди». Юқоридаги оятда яна ғийбатдан қайтарилди. Ғийбат ўзи нима? Бу тўғрида пайғамбаримиз шундай деганлар: «Ғийбат — биродарингнинг ортидан ўзи эшитиб қолса хафа бўладиган айб-нуқсонини айтишингдир». Демак, бир мўминнинг ортидан унда бўлмаган айбларни унга нисбат бериш ғийбат эмас, балки унинг ҳақига бўхтон ва туҳмат бўлар экан, унда бўлган айбларни ортидан айтиш эса уни сифатлаш эмас, балки ғийбат қилиш бўлар экин. Энди ғийбатнинг нақадар оғир гуноҳ эканлиги хусусида мазкур оятда Аллоҳ таоло томонидан келтирилган мисол ибратлидир. Чунки ақл-ҳуши жойида бўлган бирон инсон бошқа бир инсоннинг гўштини ейишни истамайди. Энди агар ўша инсон ўзининг биродари бўлсачи, яна камига ўлган ҳолда бўлса-чи! Унинг гўштини ейиш дунёдаги энг ваҳший ҳайвон ҳам ҳазар қиладиган бир жиноятдир! Бир мўминнинг ортидан ғийбат қилиш ана ўшандан-да оғирроқ жиноятдир! Шунинг учун ҳам Пайғамбар алайҳис-салоту вас-салом: «Ғийбат қилиш (бировни ноҳақ) ўлдиришдан-да ёмонроқдир», деганлар.","lang":"uz","version":{"key":"uzbek_mansour","direction":"ltr","language_iso_code":"uz","version":"1.0.0","last_update":1490389200,"title":"Uzbek translation - Alauddin Mansour","description":"Translation of the Quran meanings into Uzbek by Alauddin Mansour, printed in 1430 H. Notice: Some referred translated verses corrected by Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāayyuhā alladhīna āmanū ij'tanibū kathīran mina al-ẓani inna baʿḍa al-ẓani ith'mun walā tajassasū walā yaghtab baʿḍukum baʿḍan ayuḥibbu aḥadukum an yakula laḥma akhīhi maytan fakarih'tumūhu wa-ittaqū al-laha inna al-laha tawwābun raḥīmun ","translations":["O you who believe","O you who believe","O you who believe","Avoid","much","of","the assumption","Indeed","some","assumption","(is) sin","And (do) not","spy","and (do) not","backbite","some of you","(to) others","Would like","one of you","to","eat","(the) flesh","(of) his brother","dead","Nay, you would hate it","And fear Allah","And fear Allah","indeed","Allah","(is) Oft-Returning","Most Merciful","(12)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","ij'tanibū","kathīran","mina","al-ẓani","inna","baʿḍa","al-ẓani","ith'mun","walā","tajassasū","walā","yaghtab","baʿḍukum","baʿḍan","ayuḥibbu","aḥadukum","an","yakula","laḥma","akhīhi","maytan","fakarih'tumūhu","wa-ittaqū","al-laha","inna","al-laha","tawwābun","raḥīmun",null],"verseTiming":[[1,0,3100],[2,3100,4160],[3,4160,4980],[4,4980,6000],[5,6000,6900],[6,6900,8280],[7,8280,9940],[8,9940,11230],[9,11230,11980],[10,11980,13450],[11,13450,14730],[12,14730,15330],[13,15330,16700],[14,16700,17260],[15,17260,17970],[16,17970,20120],[17,20120,21440],[18,21440,22660],[19,22660,23670],[20,23670,25120],[21,25120,26180],[22,26180,27050],[23,27050,28780],[24,28780,31930],[25,31930,33360],[26,33360,36050],[27,36050,37310],[28,37310,38190],[29,38190,39270],[30,39270,41875]]}}