{"name":"4:3","price":"3. Агар етим қизларга адолат қила олмасликдан қўрқсангиз, сизлар учун никоҳи ҳалол бўлган аёлларга иккита, учта, тўрттадан уйланаверинглар. Энди агар (хотинлар орасида) адолат қила олмасликдан қўрқсангиз, битта аёлга (уйланинг) ёки қўл остингиздаги чўри билан (кифояланинг). Мана шу жабру зулмга ўтиб кетмаслигингизга яқинроқ ишдир.","arabic":"وَإِنۡ خِفۡتُمۡ أَلَّا تُقۡسِطُواْ فِي ٱلۡيَتَٰمَىٰ فَٱنكِحُواْ مَا طَابَ لَكُم مِّنَ ٱلنِّسَآءِ مَثۡنَىٰ وَثُلَٰثَ وَرُبَٰعَۖ فَإِنۡ خِفۡتُمۡ أَلَّا تَعۡدِلُواْ فَوَٰحِدَةً أَوۡ مَا مَلَكَتۡ أَيۡمَٰنُكُمۡۚ ذَٰلِكَ أَدۡنَىٰٓ أَلَّا تَعُولُواْ","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":496,"juzNumber":4,"footnotes":"И з о ҳ. Уламолар мазкур оятни куйидагича тафсир қиладилар: шариат ҳукмича, ота-онадан ажраб, етим бўлиб қолган қизни ўз қарамоғига олган одам у қизга уйланишга ҳаққи бор. Лекин одатда бундай ҳолларда кўпинча қизнинг ҳаққи-маҳрини тўла-тўкис қилиб бермай, арзон-гаров уйланиб олиш пайига тушилади. Шунинг учун Қуръон: «Етим қизларнинг ҳақини адо қила олмасликдан қўрқсангиз, сизлар учун никоҳи ҳалол бўлган аёлларга иккита, учта, тўрттадан уйланаверинг», деб рухсат беради ва дарҳол у хотинлар ўртасида адолат қилиш шарт эканини таъкидлайди. Қолаверса, Исломдаги бу қонун Қуръон нозил бўлган даврда кенг тарқалган кўпхотинлиликни тартибга солиш учун жорий қилингандир. Чунки Ислом келишидан илгари бир эркак қўл остида ўнлаб аёллар ҳар қандай ҳақ-ҳуқуқ, адолат ва ҳурмат-эътибордан маҳрум бўлган ҳолда кун кўрар эдилар. Ислом келгач, бу саноқ энг кўпи билан тўртта бўлиши мумкинлиги ва албатта ўртада адолат барқарор бўлиши шарт эканлиги қонун қилинди. Лекин барибир ҳақли суратда шундай савол туғилади: модомики адолат мурод экан, нима сабабдан бир эркакка фақат биргина аёл билан турмуш қилиш амр этилмади? Ислом уламолари бу саволга шундай жавоб қиладилар; маълумки, Ислом — воқеий диндир. Яъни у инсонларни покиза ҳаёт кечиришга даъват қилишда ғайривоқеий йўлларни тутмайди. Бинобарин, бу қонунда ҳам воқеий инсоний ҳаёт назарда тутилган. Биринчидан, асрлар давомидаги тажрибалар кўрсатишича, ўғил боладан кўра қиз бола кўпроқ туғилади. Иккинчидан, аёл киши эркак кишидан кўра узунроқ умр кўриши ҳам воқеий ҳақиқатдир. Учинчидан, турли фожеалар, хусусан, уруш ва тўқнашувларда асосан эркаклар ҳалок бўладилар. Мана шу ва яна бошқа кўп сабаблар натижасида инсоният оламида мудом аёлларнинг саноғи эркакларникидан ортиқ бўлади. Демак, бир эркак фақат бир аёлга уйланиши мумкин дейилса, эркаклар саноғидан ортиб қолган аёлларга зулм қилинган бўлур эди. Яъни, бу аёллар ўзларининг турмуш қуриш ва она бўлиш ҳуқуқларидан маҳрум бўлиб қолар эдилар. Натижада жамиятда нопоклик ва маиший бузуқликлар юзага келади. Шунинг учун Ислом моддий имкониятлари бўлган кишиларга агар адолат қила олишнинг уддасидан чиқсалар бирдан ортиқ аёл билан турмуш қуришга рухсат беради ва шу йўл билан бирга аёллар ўртасида адолат қилмай, фақат шаҳвоний нафсини қондириш учунгина кўп хотин олишга ружуъ қўйган кимсалар учун Охиратда ашаддий азоб борлиги ҳақида огоҳлантиради.","lang":"uz","version":{"key":"uzbek_mansour","direction":"ltr","language_iso_code":"uz","version":"1.0.0","last_update":1490389200,"title":"Uzbek translation - Alauddin Mansour","description":"Translation of the Quran meanings into Uzbek by Alauddin Mansour, printed in 1430 H. Notice: Some referred translated verses corrected by Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-in khif'tum allā tuq'siṭū fī al-yatāmā fa-inkiḥū mā ṭāba lakum mina al-nisāi mathnā wathulātha warubāʿa fa-in khif'tum allā taʿdilū fawāḥidatan aw mā malakat aymānukum dhālika adnā allā taʿūlū ","translations":["And if","you fear","that not","you will be able to do justice","with","the orphans","then marry","what","seems suitable","to you","from","the women","two","or three","or four","But if","you fear","that not","you can do justice","then (marry) one","or","what","possesses","your right hand","That","(is) more appropriate","that (may) not","you oppress","(3)"],"transliterationArr":["wa-in","khif'tum","allā","tuq'siṭū","fī","al-yatāmā","fa-inkiḥū","mā","ṭāba","lakum","mina","al-nisāi","mathnā","wathulātha","warubāʿa","fa-in","khif'tum","allā","taʿdilū","fawāḥidatan","aw","mā","malakat","aymānukum","dhālika","adnā","allā","taʿūlū",null],"verseTiming":[[1,0,680],[2,680,1590],[3,1590,2350],[4,2350,3430],[5,3430,3650],[6,3650,4830],[7,4830,6650],[8,6650,6910],[9,6910,7750],[10,7750,8160],[11,8160,9020],[12,9020,12610],[13,12610,14250],[14,14250,14520],[15,14520,15410],[16,15410,16480],[17,16480,17020],[18,17020,20040],[19,20040,20860],[20,20860,21940],[21,21940,24400],[22,24400,24990],[23,24990,25850],[24,25850,26650],[25,26650,27730],[26,27730,29210],[27,29210,29630],[28,29630,30070],[29,30070,30920],[30,30920,32780],[31,32780,33660],[32,33660,35870],[33,35870,36610],[34,36610,37995]]}}