{"name":"56:59","price":"59. Уни сизлар (комил инсон қилиб) яратурмисизлар ёки Биз яратгувчимизми?!","arabic":"ءَأَنتُمۡ تَخۡلُقُونَهُۥٓ أَمۡ نَحۡنُ ٱلۡخَٰلِقُونَ","category":["56 (Al-Waqi'ah)","Al-Waqi'ah","Surah Al-Waqi'ah","Chapter Al-Waqi'ah","Waqi'ah","Surah Waqi'ah","Chapter Waqi'ah","Al Waqi'ah","Surah Al Waqi'ah","Chapter Al Waqi'ah","Surah 56","Chapter 56","The Inevitable","الواقعة"],"ayahNumber":5038,"juzNumber":27,"footnotes":"И з о ҳ. Дарҳақиқат, бу инсон кўз ўнгида доимо такрорланиб турганлиги сабабли эътибор берилмайдиган буюк бир мўъжизадир: наҳотки киши баданидан ажралиб чиқиб турадиган тер, кўз ёши каби бўлган бир томчи сувдан — манийдан — озгина муддат ўтгач, ўз-ўзидан эркак ё аёл жинсига мансуб, эшитгувчи, кўргувчи бир инсон пайдо бўлиб қолса. Тасаввур ҳам қилиб бўлмайдиган бу иш қандай содир бўлди? Ахир бу инсон ўзининг суяклари, гўшти ва териси билан томирлари-ю, тук ва тирноқлари билан ҳамда фақат ўзигагина хос бўлган хулқи-табиати билан қаерга яшириниб олган эди?! Қайси бир доно одам бир томчи сув ўз-ўзидан мана шундай инсонга айланган дея олади? Ҳеч ким! Чунки маний она бачадонига тушиши биланоқ эр-хотиннинг иш-амали битган: улар ўша бир томчи сувдан ҳомила пайдо бўладими-йўқми билишга қодир эмаслар, энди бу ёғи ёлғиз Яратганнинг хоҳишига ҳавола. Агар У зот хоҳласа, Ўз қудрати билан бир хил ҳужайрадан иборат бўлган ўша манийдан инсоннинг жамийки аъзоларининг ҳар бири ўзига хос бўлган минг-минглаб ҳужайраларини пайдо қилади ва ҳар бир аъзонинг ҳужайрасига ўз вазифасини пайдо қилади ва унга жон киритади... Дарҳақиқат, бу илоҳий мўъжизада ақл юритгувчи кишилар учун етарли ибрат бордир.","lang":"uz","version":{"key":"uzbek_mansour","direction":"ltr","language_iso_code":"uz","version":"1.0.0","last_update":1490389200,"title":"Uzbek translation - Alauddin Mansour","description":"Translation of the Quran meanings into Uzbek by Alauddin Mansour, printed in 1430 H. Notice: Some referred translated verses corrected by Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"a-antum takhluqūnahu am naḥnu al-khāliqūna ","translations":["Is it you","who create it","or","(are) We","the Creators","(59)"],"transliterationArr":["a-antum","takhluqūnahu","am","naḥnu","al-khāliqūna",null],"verseTiming":[[1,0,1840],[2,1840,5000],[3,5000,5530],[4,5530,6130],[5,6130,9855]]}}