{"name":"67:2","price":"2. (Эй инсонлар, У) сизларнинг қайсиларингиз чиройлироқ-яхшироқ амал қилгувчи эканлигингизни имтиҳон қилиш учун ўлим ва ҳаётни яраттан Зотдир. У қудратли ва мағфиратлидир.","arabic":"ٱلَّذِي خَلَقَ ٱلۡمَوۡتَ وَٱلۡحَيَوٰةَ لِيَبۡلُوَكُمۡ أَيُّكُمۡ أَحۡسَنُ عَمَلٗاۚ وَهُوَ ٱلۡعَزِيزُ ٱلۡغَفُورُ","category":["67 (Al-Mulk)","Al-Mulk","Surah Al-Mulk","Chapter Al-Mulk","Mulk","Surah Mulk","Chapter Mulk","Al Mulk","Surah Al Mulk","Chapter Al Mulk","Surah 67","Chapter 67","The Sovereignty","الملك"],"ayahNumber":5243,"juzNumber":29,"footnotes":"И з о ҳ. Демак, Аллоҳ таоло ҳар бир инсоннинг мана шу ҳаёти дунёда қилиб ўтадиган амалларини синаб, Охиратда ўша амалга яраша мукофот-жазо бериш учун ўлим ва ҳаётни яратган экан. Ушбу ояти каримада ўлим сўзи ҳаёт сўзидан муқаддам келтирилишига сабаб, ўлим калимасининг мазмуни ҳаёт калимасининг маъносидан теранроқ, қамровлироқ эканлигидир. Чунки ҳаёт сўзи мана шу ўткинчи дунёда яшашнинг бошланишини билдирса, ўлим сўзи Охират диёридаги мангу ҳаётнинг бошланишини англатади. Демак, ўлим юзаки қараганда ҳаётнинг интиҳоси бўлиб кўринса-да, аслида у мангу ҳаётнинг ибтидосидир. Бу хусусда Пайғамбар алайҳис-салоту вас-салом шундай деганлар: «Жоним қўлида бўлган Зотга — Аллоҳга қасамки, сизлар менинг сўзларимни улардан (ўликлардан) яхшироқ англагувчи эмассизлар. Фақат улар жавоб қила олмайдилар, холос».","lang":"uz","version":{"key":"uzbek_mansour","direction":"ltr","language_iso_code":"uz","version":"1.0.0","last_update":1490389200,"title":"Uzbek translation - Alauddin Mansour","description":"Translation of the Quran meanings into Uzbek by Alauddin Mansour, printed in 1430 H. Notice: Some referred translated verses corrected by Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"alladhī khalaqa al-mawta wal-ḥayata liyabluwakum ayyukum aḥsanu ʿamalan wahuwa al-ʿazīzu al-ghafūru ","translations":["The One Who","created","death","and life","that He may test you","which of you","(is) best","(in) deed","And He","(is) the All-Mighty","the Oft-Forgiving","(2)"],"transliterationArr":["alladhī","khalaqa","al-mawta","wal-ḥayata","liyabluwakum","ayyukum","aḥsanu","ʿamalan","wahuwa","al-ʿazīzu","al-ghafūru",null],"verseTiming":[[1,0,1050],[2,1050,1640],[3,1640,2520],[4,2520,3760],[5,3760,5130],[6,5130,6220],[7,6220,6980],[8,6980,8390],[9,8390,8930],[10,8930,10050],[11,10050,13845]]}}