{"name":"68:16","price":"16. Яқинда Биз уни тумшуғидан тамғалаб қўяжакмиз!","arabic":"سَنَسِمُهُۥ عَلَى ٱلۡخُرۡطُومِ","category":["68 (Al-Qalam)","Al-Qalam","Surah Al-Qalam","Chapter Al-Qalam","Qalam","Surah Qalam","Chapter Qalam","Al Qalam","Surah Al Qalam","Chapter Al Qalam","Surah 68","Chapter 68","The Pen","القلم"],"ayahNumber":5287,"juzNumber":29,"footnotes":"И з о ҳ. Бу оятлар малъун кофир Валид ибн Муғийра ҳақида нозил бўлгандир. У Қуръон оятларига аввалгилардан қолган афсоналар, деб, Пайғамбаримизга эса мажнун, деб туҳмат қилганида Аллоҳ таоло унинг бир эмас, тўққиз иллатини фош қилади. Шунда у мазкур иллатлардан саккизтасини рад эта олмайди, аммо тўққизинчи, бенасаб-ҳароми деган номни кўтара олмай, (чунки то Аллоҳ таоло Ўз ояти билан ошкор қилгунича Валид ўзининг ҳароми эканлигидан бехабар эди) бу шармандаликни ўзидан дафъ қилиш учун туққан онасини қисти-бастига олиб сўроққа тутганида онаси ҳақиқатан унинг зинодан бўлган бола эканлигини тан олади. Саҳобалардан Ибн Аббос (Аллоҳ ундан рози бўлсин) гувоҳлик беришларича, Аллоҳ таоло Ўзи ваъда қилганидек, Валид ибн Муғийра Бадр жангида «тумшуғидан тамғаланади», яъни худди бурнидан қилич еб, ўлгунича одамлар орасида ўша «тамға»си билан юради. Мана, ушбу оятларда бир кофир кимсанинг кирдикори ва кўргулиги ҳақида хабар берилгач, қуйидаги оятларда Аллоҳ таоло ато этган неъматларга ношукурлик-нонкўрлик қилганлари учун бутун Макка аҳли қаҳатчилик ва очарчиликка мубтало қилинганлари баён этилиб, илгари ҳам Аллоҳ таоло имтиҳон қилиш учун берган ноз-неъматлардан камбағал-бечораларнинг ҳақларини бермасдан бахиллик қилганлари сабабли бир боғнинг эгалари бор будларидан маҳрум бўлганлари тўғрисидаги бир ибратли қисса сўйланади. Қиссанинг аввали будир: Маккадан унча узоқ бўлмаган Яман диёрида жуда катта мевали боғ эгаси бўлган бир киши ўтган эди. У ҳар йили ҳосил пишганида ундан камбағал-мискинларнинг ҳақ-улушларини ажратиб берарди. Лекин у киши вафот этгач, мевазор-боғнинг эгалари бўлиб қолган фарзандлари бошқа йўлни тутадилар. Қуйидаги оятларда Аллоҳ таоло мана шу ҳақда ҳикоя қилади.","lang":"uz","version":{"key":"uzbek_mansour","direction":"ltr","language_iso_code":"uz","version":"1.0.0","last_update":1490389200,"title":"Uzbek translation - Alauddin Mansour","description":"Translation of the Quran meanings into Uzbek by Alauddin Mansour, printed in 1430 H. Notice: Some referred translated verses corrected by Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"sanasimuhu ʿalā al-khur'ṭūmi ","translations":["We will brand him","on","the snout","(16)"],"transliterationArr":["sanasimuhu","ʿalā","al-khur'ṭūmi",null],"verseTiming":[[1,0,980],[2,980,1640],[3,1640,5305]]}}