{"name":"71:7","price":"7. Дарвоқеъ, ҳар қачон мен уларни Сенинг мағфиратингга (сабаб бўладиган дин йўлига) даъват қилсам, улар (менинг сўзларимни эшитмаслик учун) бармоқларини қулоқларига тиқиб, (мени кўрмаслик учун юзу кўзларига) кийимларини ўраб-чирмаб олдилар ва (ўз куфрларида) оёқ тираб турдилар ҳамда (менга итоат этишдан бош тортиб) кибр-ҳаво қилдилар.","arabic":"وَإِنِّي كُلَّمَا دَعَوۡتُهُمۡ لِتَغۡفِرَ لَهُمۡ جَعَلُوٓاْ أَصَٰبِعَهُمۡ فِيٓ ءَاذَانِهِمۡ وَٱسۡتَغۡشَوۡاْ ثِيَابَهُمۡ وَأَصَرُّواْ وَٱسۡتَكۡبَرُواْ ٱسۡتِكۡبَارٗا","category":["71 (Nuh)","Nuh","Surah Nuh","Chapter Nuh","Surah 71","Chapter 71","Noah","نوح"],"ayahNumber":5426,"juzNumber":29,"footnotes":"И з о ҳ. Муҳтарам ўқувчи эътибор берган бўлса, Нуҳ пайғамбарнинг қавмлари орасидаги кофир кимсалар Муҳаммад алайҳис-салоту вас-салом замонларидаги ва ундан кейинги даврлардаги кофирларга ўхшаб Аллоҳнинг динидан юз ўгириб, терс қараб кетмайдилар, балки улар худди ёш болаларга ўхшаб бармоқларини қулоқларига тиқиб, юзу кўзларини рўмоллар билан ўраб олишиб, Ҳақ йўлидан қайсарлик билан бош тортадилар. Бунга сабаб, Қуръони Карим бизларга ушбу сурада неча ўнг минг йиллар илгари ўтган, иккинчи Одам Ато ҳисобланмиш Нуҳ алайҳиссалом замонларидан, яъни башариятнинг айни гўдаклик палласидан ҳикоя қилмоқда. Қуръоннинг бу ажиб услуби, яъни, ҳар бир давр ҳақида айни ўша даврнинг руҳи — тили билан сўзлаши — тасвирлаши ҳам унинг илоҳий мўъжиза эканлигига яна бир далолатдир. Зеро, Муҳаммад алайҳис-салоту вас-саломдек хат-саводи бўлмаган бир киши ўзининг инсоний онг — шуури билан узоқ ўтмиш қаърига сингиб кетган қавм-қабилаларнинг ҳар бирини «ўз тили» билан сўзлата олиши мумкин бўлмаган бир ишдирки, бунга фақат барча замонларда ҳаёт ва барча нарсадан огоҳ бўлган азалий ва абадий Зот — Аллоҳ таологина қодирдир.","lang":"uz","version":{"key":"uzbek_mansour","direction":"ltr","language_iso_code":"uz","version":"1.0.0","last_update":1490389200,"title":"Uzbek translation - Alauddin Mansour","description":"Translation of the Quran meanings into Uzbek by Alauddin Mansour, printed in 1430 H. Notice: Some referred translated verses corrected by Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-innī kullamā daʿawtuhum litaghfira lahum jaʿalū aṣābiʿahum fī ādhānihim wa-is'taghshaw thiyābahum wa-aṣarrū wa-is'takbarū is'tik'bāran ","translations":["And indeed, I","every time","I invited them","that You may forgive","them","they put","their fingers","in","their ears","and covered themselves","(with) their garments","and persisted","and were arrogant","(with) pride","(7)"],"transliterationArr":["wa-innī","kullamā","daʿawtuhum","litaghfira","lahum","jaʿalū","aṣābiʿahum","fī","ādhānihim","wa-is'taghshaw","thiyābahum","wa-aṣarrū","wa-is'takbarū","is'tik'bāran",null],"verseTiming":[[1,0,1600],[2,1600,2540],[3,2540,3730],[4,3730,4760],[5,4760,5260],[6,5260,7110],[7,7110,8400],[8,8400,10150],[9,10150,11540],[10,11540,14470],[11,14470,15860],[12,15860,17510],[13,17510,18890],[14,18890,19960],[15,19960,21210],[16,21210,22430],[17,22430,23510],[18,23510,25595]]}}