{"name":"72:2","price":"2. Ҳақ йўлга ҳидоят қиладиган (бир ажиб Қуръонни эшитдик) ва дарҳол унга иймон келтирдик. Бизлар (энди) Парвардигоримизга ҳаргиз бирон кимсани шерик қилмасмиз».","arabic":"يَهۡدِيٓ إِلَى ٱلرُّشۡدِ فَـَٔامَنَّا بِهِۦۖ وَلَن نُّشۡرِكَ بِرَبِّنَآ أَحَدٗا","category":["72 (Al-Jinn)","Al-Jinn","Surah Al-Jinn","Chapter Al-Jinn","Jinn","Surah Jinn","Chapter Jinn","Al Jinn","Surah Al Jinn","Chapter Al Jinn","Surah 72","Chapter 72","The Jinn","الجن"],"ayahNumber":5449,"juzNumber":29,"footnotes":"И з о ҳ. Саҳобалардан Ибн Аббос (Аллоҳ ундан рози бўлсин) гувоҳлик беришларича, Пайғамбар алайҳис-салоту вас-салом Бомдод намозини ўқиётган чоғларида бир гуруҳ жинлар ҳозир бўлишиб, Қуръон оятларини тинглаганлар ва дарҳол унга иймон келтирганлар. Лекин Расулуллоҳ уларнинг келишганидан ҳам, Каломуллоҳга қулоқ тутишганидан ҳам бехабар эдилар. Қачонки ушбу сура нозил қилинганидан кейингина у зот бу воқеадан воқиф бўлдилар. Юқоридаги оятларда жинларнинг Қуръонни эшитишлари билан «бу башар сўзи эмас, балки илоҳий мўьжиза», деб иймон келтирганлари тўғрисида хабар берилишидан кўзланган мақсад, муфассирларнинг айтишларича, биринчидан, барча инсониятга Каломуллоҳ фақат инсонлар учунгина эмас, балки жинлар олами учун ҳам илоҳий кўрсатма бўлиб нозил қилинганини эълон қилиш бўлса, иккинчидан, Муҳаммад алайҳис-салоту вас-саломни шахсан танийдиган ва у кишининг хат-саводлари йўқ эканлигини ҳам жуда яхши биладиган Макка аҳлига — арабларга, ўзларининг тилларида нозил бўлган, фасоҳат-балоғатининг беназирлигидан саводсиз одам эмас, балки дунёдаги энг етук адиблар бирлашиб ҳам ёза олишлари имконсиз бўлган бир Китобга — ҳатто жинлар ҳам эшитибоқ иймон келтирган Каломуллоҳга улар (Макка аҳли) иймон келтирмаганлари учун танбеҳ-дашном беришдир. Энди қуйидаги оятларда Аллоҳ таоло мўмин жинлар тилидан ҳикоя қилишда давом этади.","lang":"uz","version":{"key":"uzbek_mansour","direction":"ltr","language_iso_code":"uz","version":"1.0.0","last_update":1490389200,"title":"Uzbek translation - Alauddin Mansour","description":"Translation of the Quran meanings into Uzbek by Alauddin Mansour, printed in 1430 H. Notice: Some referred translated verses corrected by Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yahdī ilā al-rush'di faāmannā bihi walan nush'rika birabbinā aḥadan ","translations":["It guides","to","the right way","so we believe","in it","and never","we will associate","with our Lord","anyone","(2)"],"transliterationArr":["yahdī","ilā","al-rush'di","faāmannā","bihi","walan","nush'rika","birabbinā","aḥadan",null],"verseTiming":[[1,0,2410],[2,2410,2790],[3,2790,3520],[4,3520,5490],[5,5490,6360],[6,6360,6790],[7,6790,8190],[8,8190,10390],[9,10390,11685]]}}