{"name":"75:4","price":"4. Йўқ, Биз унинг бармоқларини (ҳам) тиклаб жойига келтиришга қодир бўлган Зотдирмиз!","arabic":"بَلَىٰ قَٰدِرِينَ عَلَىٰٓ أَن نُّسَوِّيَ بَنَانَهُۥ","category":["75 (Al-Qiyamah)","Al-Qiyamah","Surah Al-Qiyamah","Chapter Al-Qiyamah","Qiyamah","Surah Qiyamah","Chapter Qiyamah","Al Qiyamah","Surah Al Qiyamah","Chapter Al Qiyamah","Surah 75","Chapter 75","The Resurrection","القيامة"],"ayahNumber":5555,"juzNumber":29,"footnotes":"И з о ҳ. Аллоҳ таоло Қиёмат Кунида ҳар бир инсоннинг бармоқларигача тиклаб — асл ҳолига келтириши ҳақидаги хабардан икки нарсани уқиш мумкин: Биринчидан, шундай кичик нозик бармоқларни тиклашга қодир бўлган Зот бошқа суяк-сўнгакларни ҳам тиклай олиши шубҳасиздир. Иккинчидан, Қиёмат қойим бўлганида ҳар бир банда ҳаёти-дунёда қилиб ўтган барча яхши-ёмон амалларига жавоб берар экан, унинг бармоқлари бутун бўлиши ўта муҳимдир. Чунки дунёдаги ҳеч бир кишининг бармоқ изи иккинчи кишининг бармоқ изига ўхшамайди. (Бу ҳақиқатни илм-фан ўрганиб, исботлашидан неча аср илгари Қуръони Карим бир оғиз сўз билан айтиб қўйганининг ўзи барча инсонни ҳар бир бармоғигача яратган ҳам, ушбу азиз Китобни юборган ҳам ёлғиз Аллоҳ эканига очиқ далолатдир)! Бинобарин, қилинган барча эзгулик ҳам, ёмонлик ҳам адолат тарозусида тортилиб, ўзининг мукофот ёки жазосини оладиган Кунда ҳар бир бармоқ ўз эгасининг ҳаёти-дунёда қилиб ўтган қилмишларига жонли гувоҳ бўлиши шубҳасиздир.","lang":"uz","version":{"key":"uzbek_mansour","direction":"ltr","language_iso_code":"uz","version":"1.0.0","last_update":1490389200,"title":"Uzbek translation - Alauddin Mansour","description":"Translation of the Quran meanings into Uzbek by Alauddin Mansour, printed in 1430 H. Notice: Some referred translated verses corrected by Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"balā qādirīna ʿalā an nusawwiya banānahu ","translations":["Nay","(We are) Able","on","that","We can restore","his fingertips","(4)"],"transliterationArr":["balā","qādirīna","ʿalā","an","nusawwiya","banānahu",null],"verseTiming":[[1,0,690],[2,690,1960],[3,1960,3790],[4,3790,4080],[5,4080,5770],[6,5770,7395]]}}