{"name":"76:1","price":"1. Аниқки, инсоннинг устига замондан у тилга олгулик бир нарса бўлмаган вақт-муддат ҳам келгандир.","arabic":"هَلۡ أَتَىٰ عَلَى ٱلۡإِنسَٰنِ حِينٞ مِّنَ ٱلدَّهۡرِ لَمۡ يَكُن شَيۡـٔٗا مَّذۡكُورًا","category":["76 (Al-Insan)","Al-Insan","Surah Al-Insan","Chapter Al-Insan","Insan","Surah Insan","Chapter Insan","Al Insan","Surah Al Insan","Chapter Al Insan","Surah 76","Chapter 76","Man","الإنسان"],"ayahNumber":5592,"juzNumber":29,"footnotes":"И з о ҳ. Ушбу ояти каримани муфассирлар икки хил тафсир қилганлар. Биринчи тафсир: Аллоҳ таоло Ер юзидаги барча мавжудотни ва ундаги ҳаёт кечиришга қулай мувофиқ иқлимни Инсон учун яратгандир. Лекин Аллоҳ мана шу оламни яратганидан то Одам алайҳиссаломни яратиб, унга жон ато этгунича орадан ўтган узун бир муддатда инсон исмли, Яратганнинг Ер юзидаги халифаси бўлгувчи жонзот дунёга келиши зикр қилинмаган — тилга олинмаган эди. Иккинчи тафсир: Одамзот она қорнида пайдо бўлганидан тортиб, то инсон шаклига кириб, унга жон ато этилгунича ўтадиган муддатда уни аввал нутфа, сўнг лахта қон, кейин бир парча гўшт деб номланади-ю, аммо уни ҳали инсон дейилмайди. Аниқки, ҳар бир инсон то онадан таваллуд топгунича мана шу савдоларни ўз бошидан ўтказгандир.","lang":"uz","version":{"key":"uzbek_mansour","direction":"ltr","language_iso_code":"uz","version":"1.0.0","last_update":1490389200,"title":"Uzbek translation - Alauddin Mansour","description":"Translation of the Quran meanings into Uzbek by Alauddin Mansour, printed in 1430 H. Notice: Some referred translated verses corrected by Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"hal atā ʿalā al-insāni ḥīnun mina al-dahri lam yakun shayan madhkūran ","translations":["Has","(there) come","upon","man","a period","of","time","not","he was","a thing","mentioned","(1)"],"transliterationArr":["hal","atā","ʿalā","al-insāni","ḥīnun","mina","al-dahri","lam","yakun","shayan","madhkūran",null],"verseTiming":[[1,0,400],[2,400,940],[3,940,1380],[4,1380,3180],[5,3180,3870],[6,3870,4970],[7,4970,5830],[8,5830,6160],[9,6160,7320],[10,7320,8020],[11,8020,10475]]}}