{"name":"7:105","price":"105. Менинг зиммамда Аллоҳ шаънига фақат ҳақни айтиш бордир. Мана, сизларга Парвардигорингиздан ҳужжат келтирдим. Бас, энди Бани Исроилни мен билан бирга (ўз юртларига) жўнатгин».","arabic":"حَقِيقٌ عَلَىٰٓ أَن لَّآ أَقُولَ عَلَى ٱللَّهِ إِلَّا ٱلۡحَقَّۚ قَدۡ جِئۡتُكُم بِبَيِّنَةٖ مِّن رَّبِّكُمۡ فَأَرۡسِلۡ مَعِيَ بَنِيٓ إِسۡرَٰٓءِيلَ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":1059,"juzNumber":9,"footnotes":"И з о ҳ. Муфассирларнинг ёзишларича, асли авлодлари Муқаддас Замин (Шом)дан бўлган Бани Исроил қавмининг Мисрга ўрнашиб қолишларига сабаб — Юсуф алайҳис-саломнинг замонларида Яъқуб алайҳис-саломнинг уруғ-авлодлари Мисрга келишиб, шу ерда уй-жой, бола-чақа қилиб қолиб кетадилар. Қачонки давлат устига Фиръавн келгач, уларни қул қилиб, энг оғир ишларда ишлата бошлади. Шунда Мусо пайғамбар Бани Исроилни бу асирликдан қутқариб, ота-боболарининг ватани Муқаддас Замин (Шом)га олиб кетмоқчи бўлади. Энди қуйидаги оятларда Мусо келтирган мўъжизалар баён қилинади.","lang":"uz","version":{"key":"uzbek_mansour","direction":"ltr","language_iso_code":"uz","version":"1.0.0","last_update":1490389200,"title":"Uzbek translation - Alauddin Mansour","description":"Translation of the Quran meanings into Uzbek by Alauddin Mansour, printed in 1430 H. Notice: Some referred translated verses corrected by Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"ḥaqīqun ʿalā an lā aqūla ʿalā al-lahi illā al-ḥaqa qad ji'tukum bibayyinatin min rabbikum fa-arsil maʿiya banī is'rāīla ","translations":["Obligated","on","that","not","I say","about","Allah","except","the truth","Verily","I (have) come to you","with a clear Sign","from","your Lord","so send","with me","(the) Children","(of) Israel","(105)"],"transliterationArr":["ḥaqīqun","ʿalā","an","lā","aqūla","ʿalā","al-lahi","illā","al-ḥaqa","qad","ji'tukum","bibayyinatin","min","rabbikum","fa-arsil","maʿiya","banī","is'rāīla",null],"verseTiming":[[1,0,1070],[2,1070,3100],[3,3100,3360],[4,3360,5450],[5,5450,6260],[6,6260,6740],[7,6740,7640],[8,7640,8220],[9,8220,8930],[10,8930,10170],[11,10170,12010],[12,12010,13280],[13,13280,14610],[14,14610,15900],[15,15900,17000],[16,17000,17630],[17,17630,19470],[18,19470,24365]]}}