{"name":"7:163","price":"163. (Эй Муҳаммад алайҳис-салоту вас-салом), улардан (яҳудийлардан) денгиз олдидаги қишлоқ ҳақида — шанба куни ҳаддан ошганлари ҳақида (яъни, манъ қилинганига қарамасдан шанба куни балиқ овлаганлари ҳақида) сўранг. Ўшанда, шанбалик қилган (яъни, балиқ овламаган) кунларида балиқлар (сув юзида) очиқ келар эди, шанбалик қилмаган кунларида (яъни, шанбадан бошқа кунларда) эса келмас эди. Уларни итоатсиз бўлганлари сабабли мана шундай имтиҳон қилурмиз. ","arabic":"وَسۡـَٔلۡهُمۡ عَنِ ٱلۡقَرۡيَةِ ٱلَّتِي كَانَتۡ حَاضِرَةَ ٱلۡبَحۡرِ إِذۡ يَعۡدُونَ فِي ٱلسَّبۡتِ إِذۡ تَأۡتِيهِمۡ حِيتَانُهُمۡ يَوۡمَ سَبۡتِهِمۡ شُرَّعٗا وَيَوۡمَ لَا يَسۡبِتُونَ لَا تَأۡتِيهِمۡۚ كَذَٰلِكَ نَبۡلُوهُم بِمَا كَانُواْ يَفۡسُقُونَ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":1117,"juzNumber":9,"footnotes":"И з о ҳ. Муфассирлардан Қуртубийнинг ёзишларича, бу воқеа Довуд алайҳис-салом замонларида бўлган экан. Ўшанда шанба кунлари балиқлар сон-саноқсиз бўлиб сув юзида оқиб келар, эртасига эса дарёда биронта балиқ қолмас экан. Бу фурсатдан фойдаланган иблис айрим яҳудийларни васвасага солиб, улар дарё четларида тез ҳовузлар кавлашиб, шанба кунлари балиқларни қамаб олишадиган, эртасига эса ўша ҳовузлардан тутиб кетадиган бўлган эдилар. Бу қилмишлари оқибатида улар Аллоҳнинг имтиҳонидан ўта олмаган эканлар. Юқоридаги оятда эътиқодсизларни Аллоҳ ўтиб бўлмайдиган бало-имтиҳонларга гирифтор қилишига ҳам ишора бордир. Ўшанда яҳудийлар уч тоифага бўлиниб қолган эканлар: бир тоифа юқорида айтилган шанба кунлари балиқ овлайверадиган итоатсизлар, иккинчи тоифа ўзларини бу жиноятдан сақлаб, ўзгаларни ҳам ундан қайтарадиганлар, учинчи тоифа эса ўзлари у кунда балиқ тутмай, ўзгаларни ҳам ундан қайтармайдиганлар эди. Қуйидаги оятда мана шу учинчи ва иккинчи тоифа ўртасида бўлиб ўтган савол-жавоб зикр этилади.","lang":"uz","version":{"key":"uzbek_mansour","direction":"ltr","language_iso_code":"uz","version":"1.0.0","last_update":1490389200,"title":"Uzbek translation - Alauddin Mansour","description":"Translation of the Quran meanings into Uzbek by Alauddin Mansour, printed in 1430 H. Notice: Some referred translated verses corrected by Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wasalhum ʿani al-qaryati allatī kānat ḥāḍirata al-baḥri idh yaʿdūna fī al-sabti idh tatīhim ḥītānuhum yawma sabtihim shurraʿan wayawma lā yasbitūna lā tatīhim kadhālika nablūhum bimā kānū yafsuqūna ","translations":["And ask them","about","the town","which","was","situated","(by) the sea","when","they transgressed","in","the (matter of) Sabbath","when","came to them","their fish","(on the) day","(of) their Sabbath","visibly","and (on the) day","not","they had Sabbath","(they did) not","come to them","Thus","We test them","because","they were","defiantly disobeying","(163)"],"transliterationArr":["wasalhum","ʿani","al-qaryati","allatī","kānat","ḥāḍirata","al-baḥri","idh","yaʿdūna","fī","al-sabti","idh","tatīhim","ḥītānuhum","yawma","sabtihim","shurraʿan","wayawma","lā","yasbitūna","lā","tatīhim","kadhālika","nablūhum","bimā","kānū","yafsuqūna",null],"verseTiming":[[1,0,1330],[2,1330,1740],[3,1740,2990],[4,2990,3870],[5,3870,4770],[6,4770,5930],[7,5930,6860],[8,6860,7210],[9,7210,8290],[10,8290,8540],[11,8540,9470],[12,9470,9840],[13,9840,11130],[14,11130,12700],[15,12700,13290],[16,13290,14460],[17,14460,15730],[18,15730,16820],[19,16820,18170],[20,18170,19760],[21,19760,20330],[22,20330,21470],[23,21470,23470],[24,23470,24390],[25,24390,24760],[26,24760,26140],[27,26140,26490],[28,26490,27890],[29,27890,29660],[30,29660,31560],[31,31560,32130],[32,32130,33220],[33,33220,37015]]}}