{"name":"84:19","price":"19. Албатта сизлар (эй инсонлар), табақадан табақага минурсизлар (яъни, бир ҳолдан иккинчи ҳолга кўчиб турурсизлар).","arabic":"لَتَرۡكَبُنَّ طَبَقًا عَن طَبَقٖ","category":["84 (Al-Inshiqaq)","Al-Inshiqaq","Surah Al-Inshiqaq","Chapter Al-Inshiqaq","Inshiqaq","Surah Inshiqaq","Chapter Inshiqaq","Al Inshiqaq","Surah Al Inshiqaq","Chapter Al Inshiqaq","Surah 84","Chapter 84","The Splitting Open","الإنشقاق"],"ayahNumber":5903,"juzNumber":30,"footnotes":"И з о ҳ. Ушбу оятларда Аллоҳ таолонинг илоҳий қалами билан ҳар бир инсоннинг ҳаёт-мамотидаги бир ҳолдан иккинчи ҳолга кўчиши тўғрисида бетакрор манзара чизиб берилди. Дарҳақиқат, худди уфқни қон йиғлатиб кун ботиб, сўнг атрофни тун зулмати қоплаб, кейин самога балқиб чиққан тўлин ой кечани бамисоли кундузга айлантириб, агар ерга игна тушса топилгудек ёруғ қилиб юборгани каби ҳар бир инсон ҳам ўз ҳаётининг шомида устида турган яқинларини қон йиғлатиб, ўлим деб аталган остонадан ҳатлайди. Энди у ёш тамоман бошқа бир ҳолат — худди тун қоронғулиги янглиғ қабр зулмати. Лекин бу асло сўнгги ҳолат эмас, балки киши бошидаги ҳолатлар занжирининг бир ҳалқаси холос. Навдатдаги ҳолат Қиёмат қойим бўлган Кунда рўй беради. У Кунда худди тўлин ой тун қоронғулигида яшириниб ётган барча нарсани ошкор қилганидек, ҳар бир кишининг қоронғу ўтмиши ибтидосидан интиҳосигача, ипидан-игнасигача ёритилиб, ҳисоб-китоб қилинади ва навбат кейинги ҳолатларга келади. Улар энди абадий саодат ёки мангу азобдир! Шундоқ экан...","lang":"uz","version":{"key":"uzbek_mansour","direction":"ltr","language_iso_code":"uz","version":"1.0.0","last_update":1490389200,"title":"Uzbek translation - Alauddin Mansour","description":"Translation of the Quran meanings into Uzbek by Alauddin Mansour, printed in 1430 H. Notice: Some referred translated verses corrected by Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"latarkabunna ṭabaqan ʿan ṭabaqin ","translations":["You will surely embark","(to) stage","from","stage","(19)"],"transliterationArr":["latarkabunna","ṭabaqan","ʿan","ṭabaqin",null],"verseTiming":[[1,0,2340],[2,2340,3120],[3,3120,4410],[4,4410,5395]]}}