{"name":"88:20","price":"20. Ва Ернинг қандай ёйиб-текислаб қўйилганига (ибрат назари билан боқмайдиларми?!)","arabic":"وَإِلَى ٱلۡأَرۡضِ كَيۡفَ سُطِحَتۡ","category":["88 (Al-Ghashiyah)","Al-Ghashiyah","Surah Al-Ghashiyah","Chapter Al-Ghashiyah","Ghashiyah","Surah Ghashiyah","Chapter Ghashiyah","Al Ghashiyah","Surah Al Ghashiyah","Chapter Al Ghashiyah","Surah 88","Chapter 88","The Overwhelming Event","الغاشية"],"ayahNumber":5987,"juzNumber":30,"footnotes":"И з о ҳ. Ушбу оятларда кишиларнинг назари аввало ҳайвонот оламидан «Саҳро кемаси» деб ном олган туяга қаратилмоқда. Дарҳақиқат, саҳро аҳли учун туя ҳам алоқа воситаси, ҳам оғир юкларни ташувчи ва оғир вазифаларни бажарувчи хизматкор, унинг юнги кийим бўлса, сути тўйимли ва суюмли таом. У ўзи баҳайбат ва ниҳоят даражада баққувват бўлишига қарамасдан ёш гўдак етакласа ҳам бўйсуниб кетаверади. Унга миниш ёки вазмин юкларни ортиш ўта қулай: бир ишора билан олдингизга чўкиб, гўё бир харсанг тошдек қилт этмасдан туради, миниб олгач эса яна бир ишора билан у «харсанг тош» ўрнидан кўчиб, исталган тарафга равона бўлади. Булар туянинг ташқаридан кузатилган пайтда кўзга ташланадиган жиҳатларидир. Энди унинг вужудига ибрат назари билан қаралса у ойлаб овқатсиз, сувсиз юра олишидан тортиб, унинг баданидаги ҳар бир аъзо нақадар саҳрога мослаб яратилганини кўриб Яратганнинг қудратига тан бермай илож йўқ. Энди яна кўриб, ибрат олишимиз лозим бўлган мавжудотлардан бири устимизда «том» бўлиб, бизларни бошқа сайёралар ва бошқа оламлардан етиши мумкин бўлган зиён заҳматдан сақлаб тургувчи осмон бўлса, яна бири «ернинг қозиқлари» бўлган тоғлардирки, улар ўзларининг атрофидаги иқлимни мудом мўътадиллаштириб туришларидан ташқари ичларида инсонлар учун зарур бўлган хазиналарни ҳам асраб берадилар. Энди тоғлардан ерга тушадиган бўлсак, у ҳам бизлар яшашимиз, уй-жойлар бино қилишимиз ва экинзорлар, боғ-роғлар барпо этишимиз учун қулай-текис қилиб қўйилибди. Хўш, буларнинг барчаси ўз-ўзидан пайдо бўлиб, шундай аниқ ва ҳикматли тартиб-интизомга келиб қолдиларми? Ёки бу мавжудотларнинг ҳар бирини одамлар ўз қўллари билан яратиб, мана шундай жойлаштириб қўйдилармикин? Бу икки тахминнинг ҳам тўғри эмаслигини билиш учун катта илмнинг ҳожати йўқ, фақат тоза, заҳарланмаган фикр ва озгина инсоф бўлса бас, мазкур мавжудотларни яратиш фақат барча оламлар Парвардигори бўлмиш Аллоҳ таолонинг қудрат қўлидан келиши маълум бўлади-қолади. Шунинг учун ҳам юқоридаги оятларда барча инсонлар Еру осмондаги нарсаларга холис кўз билан, ибрат олиш учун назар солишга даъват қилиндилар. Қуйидаги оятларда Пайғамбар алайҳис-салоту вас-саломга кишиларни Исломга даъват этишда мана шундай ибратли мисоллар билан панд-насиҳат қилиш йўлини тутмоқ амр этилди.","lang":"uz","version":{"key":"uzbek_mansour","direction":"ltr","language_iso_code":"uz","version":"1.0.0","last_update":1490389200,"title":"Uzbek translation - Alauddin Mansour","description":"Translation of the Quran meanings into Uzbek by Alauddin Mansour, printed in 1430 H. Notice: Some referred translated verses corrected by Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-ilā al-arḍi kayfa suṭiḥat ","translations":["And towards","the earth","how","it is spread out","(20)"],"transliterationArr":["wa-ilā","al-arḍi","kayfa","suṭiḥat",null],"verseTiming":[[1,0,590],[2,590,1530],[3,1530,2070],[4,2070,3375]]}}