{"name":"90:4","price":"4. Дарҳақиқат, Биз инсонни меҳнат-машаққатга яратдик.","arabic":"لَقَدۡ خَلَقۡنَا ٱلۡإِنسَٰنَ فِي كَبَدٍ","category":["90 (Al-Balad)","Al-Balad","Surah Al-Balad","Chapter Al-Balad","Balad","Surah Balad","Chapter Balad","Al Balad","Surah Al Balad","Chapter Al Balad","Surah 90","Chapter 90","The City","البلد"],"ayahNumber":6027,"juzNumber":30,"footnotes":"И з о ҳ. Яъни, инсон ўзига жон ато этилганидан то ўша жон баданини тарк қилиб чиқиб кетгунича меҳнат-машаққатда ҳаёт кечиради. Бу борада мусулмон ҳам, кофир ҳам бир-бирига ўхшаган меҳнат-машаққатларни бошдан ўтказадилар. Лекин мусулмон киши Яратувчи буюрган иш-амалларда жон куйдиради, ўзининг куч-ғайратини имкон қадар савобли ишларга сарфлайди ва керак бўлса Ҳақ йўлида жонини қурбон қилиб, Охиратдаги мангу роҳат-фароғатга эришади. Аммо кофир, эътиқодсиз кимсалар эса арзон ҳою-ҳаваслар ва ўзларига ҳам, ўзгаларга ҳам бефойда-бевафо бўлган пуфак орзу-хаёлларга етиш йўлида жонларини жабборга бериб, оқибатда бу дунёдаги меҳнат-машаққатларидан ташқари у дунёдаги дўзах азоби-машаққатига ҳам гирифтор бўладилар. Қуйидаги оятларда ана шундай топган мол-дунёси ва куч-қуввати билан мағрурланиб, Пайғамбар алайҳис-салоту вас-саломга ва бошқа мўминларга дилозорлик қилиб юрадиган бир кимса ҳақида ҳикоя қилинади.","lang":"uz","version":{"key":"uzbek_mansour","direction":"ltr","language_iso_code":"uz","version":"1.0.0","last_update":1490389200,"title":"Uzbek translation - Alauddin Mansour","description":"Translation of the Quran meanings into Uzbek by Alauddin Mansour, printed in 1430 H. Notice: Some referred translated verses corrected by Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"laqad khalaqnā al-insāna fī kabadin ","translations":["Certainly","We have created","man","(to be) in","hardship","(4)"],"transliterationArr":["laqad","khalaqnā","al-insāna","fī","kabadin",null],"verseTiming":[[1,0,610],[2,610,1480],[3,1480,3680],[4,3680,4130],[5,4130,5275]]}}