{"name":"2:218","price":"Certes, ceux qui ont cru, émigré et lutté dans le sentier d’Allah, ceux-là espèrent la miséricorde d’Allah. Et Allah est Pardonneur et Miséricordieux.","arabic":"إِنَّ ٱلَّذِينَ ءَامَنُواْ وَٱلَّذِينَ هَاجَرُواْ وَجَٰهَدُواْ فِي سَبِيلِ ٱللَّهِ أُوْلَٰٓئِكَ يَرۡجُونَ رَحۡمَتَ ٱللَّهِۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":225,"juzNumber":2,"footnotes":"[86] Ceux qui ont cru et émigré...: ceux qui ont fait l’Hégire avec le Prophète ou qui l’ont rejoint à Médine. Et lutté...: parmi les droits de la belligérance, il y a celui de tuer l’ennemi pour se défendre et défendre l’Islam (voir supra vv. 190 et 216). Mais le mot «jihād» (traduit par lutte) a un sens beaucoup plus large. Dans S. 8, v. 72, on parle de lutter corps et biens, à quoi le Ḥadīṯ ajoute même «par la langue», et «par tout autre effort» y compris l’effort contre soi-même. La «guerre sainte» dont il est si souvent question dans les écrits européens sur l’Islam, n’est qu’une traduction erronée du mot «jihād». Or ce mot signifie aussi «effort collectif», où il n’est question ni de guerre ni de tuerie, moins encore de sainteté. La guerre, dans le sentier d’Allah est, certes, obligation en Islam. La «guerre dans le sentier d’Allah» exige le sacrifice et la renonciation à tout but profane (gloire, patriotisme, pillage, excès, conquêtes, etc;); et la vie, dans son ensemble, doit reposer sur les principes de paix juste et équitable, comme le dit si bien le Prophète; or, c’est dans ce sens de «lutte dans le sentier d’Allah» que la guerre se justifie. Toutefois, la guerre qui vise à convertir par la force, à l’Islam, est strictement interdite (voir S. 2, v. 256).","lang":"fr","version":{"key":"french_hameedullah","direction":"ltr","language_iso_code":"fr","version":"1.0.1","last_update":1641816964,"title":"French Translation - Muhammad Hamidullah","description":"Translation of the Quran meanings into French by Muhammad Hamidullah. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"inna alladhīna āmanū wa-alladhīna hājarū wajāhadū fī sabīli al-lahi ulāika yarjūna raḥmata al-lahi wal-lahu ghafūrun raḥīmun ","translations":["Indeed","those who","believed","and those who","emigrated","and strove","in","(the) way","(of) Allah ","those","they hope","(for) Mercy","(of) Allah","And Allah","(is) Oft-Forgiving","Most Merciful","(218)"],"transliterationArr":["inna","alladhīna","āmanū","wa-alladhīna","hājarū","wajāhadū","fī","sabīli","al-lahi","ulāika","yarjūna","raḥmata","al-lahi","wal-lahu","ghafūrun","raḥīmun",null],"verseTiming":[[1,0,1150],[2,1150,2030],[3,2030,3040],[4,3040,4000],[5,4000,5040],[6,5040,6070],[7,6070,6430],[8,6430,7420],[9,7420,7940],[10,7940,10330],[11,10330,11290],[12,11290,11950],[13,11950,14270],[14,14270,15350],[15,15350,16470],[16,16470,19015]]}}