{"name":"2:3","price":"Ceux qui croient à l’invisible et accomplissent la prière ( As-Ṣalāt ) et qui dépensent [dans l’obéissance à Allah] de ce que Nous leur avons attribué.","arabic":"ٱلَّذِينَ يُؤۡمِنُونَ بِٱلۡغَيۡبِ وَيُقِيمُونَ ٱلصَّلَوٰةَ وَمِمَّا رَزَقۡنَٰهُمۡ يُنفِقُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":10,"juzNumber":1,"footnotes":"[5] L’invisible: tout ce que nous ne pouvons percevoir et connaître et même tout ce dont nous ne pouvons même pas réaliser l’existence passée, présente ou future. Ṣalāt: signifie ici non pas la prière seulement, mais les prières quotidiennes comportant des récitations, des invocations, des mouvements et des attitudes définis. <br />Il y a cinq Ṣalāt quotidiennes: à l’aube, peu après que le soleil passe le méridien, tard dans l’après-midi, tout de suite après le coucher du soleil, et enfin à la disparition du crépuscule. Pour les pays près des deux régions polaires, on a dû aménager ces horaires. - La Ṣalāt hebdomadaire du vendredi remplace, ce jour-là, la deuxième Ṣalāt, celle de midi. - Les Ṣalāt des deux fêtes (˒idul Fiṭr et ˒idul Aḍḥa) sont recommandées par le Prophète, mais non obligatoires. <br />A part le nombre de cycles d’actes (Rak˒at), toutes ces Ṣalāt se ressemblent quant à la façon de les accomplir: on fait les ablutions (voir S. 5, v. 6) on se met debout et on se tourne vers la Ka˒ba à la Mecque (voir S. 2, v. 144) - en Europe occidentale, vers le sud-est - et on formule l’intention de prier. On récite la première sourate du Coran «Al-Fātiḥa», en la faisant suivre de quelques versets coraniques ou d’une courte sourate. Puis on s’incline, mettant les mains sur les genoux et on se redresse; ensuite, on se prosterne, posant le front sur le sol, puis on s’assied, et après une deuxième prosternation, on se remet debout. Tout cela constitue un «cycle d’actes», une Rak˒a.  On fait dans le deuxième cycle Rakat la même chose que dans le premier, mais au lieu de se mettre debout après les prosternations, on reste assis et on récite le tachahhud [glorification d’Allah, salut au Prophète (صلى الله عليه وسلم), à soi-même et à tous les bons croyants et témoignage de l’unicité d’Allah]. Si la Ṣalāt a deux cycles (comme lors de l’aube), elle se termine par le salut final, après le tachahhud. Sinon, on se lève et on fait un nouveau cycle (dans la 4e Ṣalāt il y a trois cycles, et dans les 2e, 3e et 5e, quatre cycles), et on termine la Ṣalāt en saluant, tournant la tête à droite puis à gauche. <br />Dépensent dans l’obéissance à Allah: en Islam, on est obligé de donner un pourcentage de ce que l’on possède, annuellement, et ce d’après un barème établi: c’est la Zakāt. D’ailleurs on peut donner pour un acte de pure charité ce qu’on veut. Sont visées dans ce verset toutes les dépenses faites dans l’obéissance à Allah: la Zakāt, la dépense concernant les parents et les proches, les largesses bénévoles, etc.","lang":"fr","version":{"key":"french_hameedullah","direction":"ltr","language_iso_code":"fr","version":"1.0.1","last_update":1641816964,"title":"French Translation - Muhammad Hamidullah","description":"Translation of the Quran meanings into French by Muhammad Hamidullah. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"alladhīna yu'minūna bil-ghaybi wayuqīmūna al-ṣalata wamimmā razaqnāhum yunfiqūna ","translations":["Those who","believe","in the unseen","and establish","the prayer","and out of what","We have provided them","they spend","(3)"],"transliterationArr":["alladhīna","yu'minūna","bil-ghaybi","wayuqīmūna","al-ṣalata","wamimmā","razaqnāhum","yunfiqūna",null],"verseTiming":[[1,0,1040],[2,1040,2190],[3,2190,3090],[4,3090,4260],[5,4260,5220],[6,5220,6580],[7,6580,7990],[8,7990,11365]]}}