{"name":"2:43","price":"Et accomplissez la prière (As-Ṣalāt), et acquittez l'aumône (Az- Zakāt) , et inclinez-vous avec ceux qui s’inclinent.","arabic":"وَأَقِيمُواْ ٱلصَّلَوٰةَ وَءَاتُواْ ٱلزَّكَوٰةَ وَٱرۡكَعُواْ مَعَ ٱلرَّٰكِعِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":50,"juzNumber":1,"footnotes":"[18] Acquittez la Zakāt (voir aussi v. 3 et 110): les termes mêmes de ces versets montrent qu’il existe une Zakāt, distincte de l’aumône en charité, faite «bénévolement». La Zakāt est prélevée par les gouvernements islamiques, à des époques fixes, dans des proportions prédéterminées, et avec des sanctions contre l’infraction. Le taux diffère selon les objets imposables: épargnes, récoltes, mines, troupeaux de bestiaux, etc.... L’Islam coordonne le temporel et le spirituel dans un plus grand ensemble, et exige que toutes les actions de l’homme soient marquées par la foi en Allah et conformes à Ses commandements. C’est ainsi que payer la Zakāt est un acte d’adoration d’Allah par le moyen des biens, tout comme la Ṣalāt est «adoration par corps et esprit». Rappelons que la Zakāt sur les épargnes, quoique obligatoire, a quelquefois été laissée à la discrétion du croyant, en ce sens qu’il pouvait la payer directement aux bénéficiaires désignés par le Coran (S. 9, v. 60), sans l’intermédiaire du gouvernement. Le Coran emploie aussi les mots Ṣadaqāt (S. 9, v. 29 & 60) et Haqq (S. 6, v. 141), qui s’appliquent à la Zakāt. A l’opposé, le mot «ZAKAT» s’applique exclusivement à la «ZAKAT» imposée.","lang":"fr","version":{"key":"french_hameedullah","direction":"ltr","language_iso_code":"fr","version":"1.0.1","last_update":1641816964,"title":"French Translation - Muhammad Hamidullah","description":"Translation of the Quran meanings into French by Muhammad Hamidullah. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-aqīmū al-ṣalata waātū al-zakata wa-ir'kaʿū maʿa al-rākiʿīna ","translations":["And establish","the prayer","and give","zakah","and bow down","with","those who bow down","(43)"],"transliterationArr":["wa-aqīmū","al-ṣalata","waātū","al-zakata","wa-ir'kaʿū","maʿa","al-rākiʿīna",null],"verseTiming":[[1,0,1030],[2,1030,2060],[3,2060,2770],[4,2770,3800],[5,3800,4710],[6,4710,5080],[7,5080,7915]]}}