{"name":"9:31","price":"31. Zij namen hun rabbijnen en monniken tot hun heren naast Allah en (zij namen ook) de Messiah, zoon van Maryam (tot hun heer), terwijl zij bevolen waren om niemand behalve de Ene God te aanbidden. Geen heeft het recht aanbeden te worden behalve Hij. Verheven is Hij boven datgene wat zij aan deelgenoten toekennen. [1]","arabic":"ٱتَّخَذُوٓاْ أَحۡبَارَهُمۡ وَرُهۡبَٰنَهُمۡ أَرۡبَابٗا مِّن دُونِ ٱللَّهِ وَٱلۡمَسِيحَ ٱبۡنَ مَرۡيَمَ وَمَآ أُمِرُوٓاْ إِلَّا لِيَعۡبُدُوٓاْ إِلَٰهٗا وَٰحِدٗاۖ لَّآ إِلَٰهَ إِلَّا هُوَۚ سُبۡحَٰنَهُۥ عَمَّا يُشۡرِكُونَ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1266,"juzNumber":10,"footnotes":"[1] Een metgezel van de profeet was vóór zijn bekering tot de Islam, een christen. Hij vertelde op een dag aan de profeet dat hij niet de mensen ging aanbidden. Zijn begrip van aanbidding was dat het ging om knielen en buigen. De profeet antwoordde met een tegenvraag. Hij reageerde namelijk met de vraag of zij niet hetgeen wat verboden was, tot toegestaan hebben verklaard, en hetgeen toegestaan was zij niet tot verboden hebben verklaard. De metgezel die gaf als antwoord op de vraag dat dat klopte. Waarop de profeet antwoordde dat dat ook een aanbidding is. Het valt zelfs onder grote shirk (afgoderij). Want alleen Allah bepaald wat verboden en toegestaan is. Dus wanneer een koning of geleerde halal maakt wat Allah sht haram heeft gemaakt of andersom dan is dat een grote vorm van Shirk in de Roeboebijah dus in de alleenrecht van Allah in zijn heerschappij.","lang":"nl","version":{"key":"dutch_center","direction":"ltr","language_iso_code":"nl","version":"2.0.4","last_update":1710543568,"title":"Dutch translation","description":"Translation of the meanings of the Noble Qur’an into the Dutch language, for the Dutch Islamic Center - in progress."},"meta":{"transliteration":"ittakhadhū aḥbārahum waruh'bānahum arbāban min dūni al-lahi wal-masīḥa ib'na maryama wamā umirū illā liyaʿbudū ilāhan wāḥidan lā ilāha illā huwa sub'ḥānahu ʿammā yush'rikūna ","translations":["They have taken","their rabbis","and their monks","(as) Lords","besides","besides","Allah","and the Messiah","son","(of) Maryam","And not","they were commanded","except","that they worship","One God","One God","(There) is no","god","except","Him","Glory be to Him","from what","they associate (with Him)","(31)"],"transliterationArr":["ittakhadhū","aḥbārahum","waruh'bānahum","arbāban","min","dūni","al-lahi","wal-masīḥa","ib'na","maryama","wamā","umirū","illā","liyaʿbudū","ilāhan","wāḥidan","lā","ilāha","illā","huwa","sub'ḥānahu","ʿammā","yush'rikūna",null],"verseTiming":[[1,0,2690],[2,2690,4190],[3,4190,5800],[4,5800,6940],[5,6940,8890],[6,8890,9710],[7,9710,10610],[8,10610,11890],[9,11890,12410],[10,12410,13280],[11,13280,15130],[12,15130,15850],[13,15850,17300],[14,17300,18350],[15,18350,20850],[16,20850,23010],[17,23010,23930],[18,23930,26510],[19,26510,28260],[20,28260,29660],[21,29660,32399],[22,32399,33309],[23,33309,34259],[24,34259,34809],[25,34809,36659],[26,36659,38669],[27,38669,42004]]}}