{"name":"15:22","price":"22. Y enviamos los vientos fertilizantes[436] y hacemos descender la lluvia del cielo de la que les damos de beber y cuyas reservas no dependen de ustedes.","arabic":"وَأَرۡسَلۡنَا ٱلرِّيَٰحَ لَوَٰقِحَ فَأَنزَلۡنَا مِنَ ٱلسَّمَآءِ مَآءٗ فَأَسۡقَيۡنَٰكُمُوهُ وَمَآ أَنتُمۡ لَهُۥ بِخَٰزِنِينَ","category":["15 (Al-Hijr)","Al-Hijr","Surah Al-Hijr","Chapter Al-Hijr","Hijr","Surah Hijr","Chapter Hijr","Al Hijr","Surah Al Hijr","Chapter Al Hijr","Surah 15","Chapter 15","The Rock","الحِجر"],"ayahNumber":1824,"juzNumber":14,"footnotes":"[436]  Al-lah utiliza la palabra fertilizante porque el viento introduce en las nubes partículas de polvo u otras partículas alrededor de las cuales se condensa el vapor para que pueda llover. Aunque las nubes estén llenas de vapor de agua, la lluvia no puede descender si no hay un núcleo de condensación formado por partículas pesadas alrededor de las cuales se acumula todo el vapor de agua condensado. Actualmente, se utiliza, a veces, un procedimiento denominado“la siembra de nubes” para manipular el clima y aumentar la precipitación que cae de las nubes. \nLa acción del viento también ayuda a apilar pequeñas nubes o cúmulos hasta que se forman las grandes nubes de lluvia o cumulonimbusque descargan grandes tormentas.","lang":"es","version":{"key":"spanish_montada_latin","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1539032400,"title":"Spanish Translation (Latin America) - Noor International","description":"Translation of the Quran meanings into Spanish (Latin America) by Noor International (Ed. 2017)"},"meta":{"transliteration":"wa-arsalnā al-riyāḥa lawāqiḥa fa-anzalnā mina al-samāi māan fa-asqaynākumūhu wamā antum lahu bikhāzinīna ","translations":["And We have sent","the winds","fertilizing","and We sent down","from","the sky","water","and We gave it to you to drink","And not","you","of it","(are) retainers","(22)"],"transliterationArr":["wa-arsalnā","al-riyāḥa","lawāqiḥa","fa-anzalnā","mina","al-samāi","māan","fa-asqaynākumūhu","wamā","antum","lahu","bikhāzinīna",null],"verseTiming":[[1,0,1250],[2,1250,2400],[3,2400,3450],[4,3450,5700],[5,5700,6060],[6,6060,8390],[7,8390,10670],[8,10670,14940],[9,14940,17200],[10,17200,18970],[11,18970,20570],[12,20570,21200],[13,21200,23825]]}}