{"name":"15:9","price":"9. En verdad, Nosotros hemos revelado la Exhortación (el Corán) y Nosotros la protegeremos[432]”.","arabic":"إِنَّا نَحۡنُ نَزَّلۡنَا ٱلذِّكۡرَ وَإِنَّا لَهُۥ لَحَٰفِظُونَ","category":["15 (Al-Hijr)","Al-Hijr","Surah Al-Hijr","Chapter Al-Hijr","Hijr","Surah Hijr","Chapter Hijr","Al Hijr","Surah Al Hijr","Chapter Al Hijr","Surah 15","Chapter 15","The Rock","الحِجر"],"ayahNumber":1811,"juzNumber":14,"footnotes":"[432]  El Corán es la única revelación de Al-lah que no ha sido modificada por el hombre y que se conserva tal y como fue revelada al Profeta Muhammad —que Al-lah lo bendiga y le dé la paz—. En esta aleya, Al-lah asegura que Él la preservará, y así ha sucedido, pues el hecho de que el Corán haya sido memorizado desde su inicio por numerosos compañeros del Profeta —que Al-lah lo bendiga y le dé la paz— que lo recogieron por escrito y lo iban transmitiendo oralmente, a su vez, a otros creyentes ha sido clave para su preservación sin tergiversaciones. Hoy en día, el Corán es memorizado por musulmanes de todas partes del mundo a través de instructores que han sido certificados por otros anteriores, hasta completar una cadena sucesiva de memoriones que se remonta al Mensajero de Al-lah —que Al-lah lo bendiga y le dé la paz—. Además, en el salat se recita parte del Corán, y es tradición completar todo el Corán durante los rezos del mes de ramadán, lo que ayuda a preservar la memorización del texto.","lang":"es","version":{"key":"spanish_montada_latin","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1539032400,"title":"Spanish Translation (Latin America) - Noor International","description":"Translation of the Quran meanings into Spanish (Latin America) by Noor International (Ed. 2017)"},"meta":{"transliteration":"innā naḥnu nazzalnā al-dhik'ra wa-innā lahu laḥāfiẓūna ","translations":["Indeed, We","We","have sent down","the Reminder","and indeed, We","of it","(are) surely Guardians","(9)"],"transliterationArr":["innā","naḥnu","nazzalnā","al-dhik'ra","wa-innā","lahu","laḥāfiẓūna",null],"verseTiming":[[1,0,1450],[2,1450,1990],[3,1990,3030],[4,3030,3930],[5,3930,5270],[6,5270,5890],[7,5890,9015]]}}