{"name":"16:15","price":"15. Y ha establecido en la tierra firmes montañas[454] para impedir que esta temblase con ustedes, y ha dispuesto en ella ríos y caminos para que puedan guiarlos.","arabic":"وَأَلۡقَىٰ فِي ٱلۡأَرۡضِ رَوَٰسِيَ أَن تَمِيدَ بِكُمۡ وَأَنۡهَٰرٗا وَسُبُلٗا لَّعَلَّكُمۡ تَهۡتَدُونَ","category":["16 (An-Nahl)","An-Nahl","Surah An-Nahl","Chapter An-Nahl","Nahl","Surah Nahl","Chapter Nahl","An Nahl","Surah An Nahl","Chapter An Nahl","Surah 16","Chapter 16","The Bee","النَّحل"],"ayahNumber":1916,"juzNumber":14,"footnotes":"[454]  Esta aleya hace referencia a las raíces de las montañas que son descritas como estacas en la aleya 7 de la sura 78. La geología moderna ha demostrado que las montañas poseen profundas raíces bajo la corteza terrestre que desempeñan un papel importante en la estabilización de esta, ralentizando, al parecer, el movimiento de las placas tectónicas. La teoría de las raíces de las montañas no fue introducida hasta 1865 por el astrónomo real Sir George Airy. Otro significado posible de la aleya es que las raíces de las montañas evitan que estas se muevan o se tambaleen. De hecho, la isostasia (la condición de equilibrio que presenta la superficie terrestre debido a la diferencia de densidad de sus partes) relaciona la altura de las montañas con la profundidad de las raíces, es decir, a mayor altura, las raíces son más profundas buscando siempre el equilibrio.","lang":"es","version":{"key":"spanish_montada_latin","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1539032400,"title":"Spanish Translation (Latin America) - Noor International","description":"Translation of the Quran meanings into Spanish (Latin America) by Noor International (Ed. 2017)"},"meta":{"transliteration":"wa-alqā fī al-arḍi rawāsiya an tamīda bikum wa-anhāran wasubulan laʿallakum tahtadūna ","translations":["And He has cast","in","the earth","firm mountains","lest","it should shake","with you","and rivers","and roads","so that you may","be guided","(15)"],"transliterationArr":["wa-alqā","fī","al-arḍi","rawāsiya","an","tamīda","bikum","wa-anhāran","wasubulan","laʿallakum","tahtadūna",null],"verseTiming":[[1,0,1200],[2,1200,1400],[3,1400,2340],[4,2340,3470],[5,3470,4680],[6,4680,5700],[7,5700,6510],[8,6510,8160],[9,8160,9260],[10,9260,10900],[11,10900,13825]]}}