{"name":"16:59","price":"59. se oculta de la gente por la mala noticia que ha recibido y duda acerca de dejarla vivir, a pesar de la vergüenza (que siente), o de enterrarla viva[461]. ¡Qué malo es lo que deciden (los idólatras al atribuir hijas a Al-lah, cuando ellos las desprecian y prefieren a los varones)!","arabic":"يَتَوَٰرَىٰ مِنَ ٱلۡقَوۡمِ مِن سُوٓءِ مَا بُشِّرَ بِهِۦٓۚ أَيُمۡسِكُهُۥ عَلَىٰ هُونٍ أَمۡ يَدُسُّهُۥ فِي ٱلتُّرَابِۗ أَلَا سَآءَ مَا يَحۡكُمُونَ","category":["16 (An-Nahl)","An-Nahl","Surah An-Nahl","Chapter An-Nahl","Nahl","Surah Nahl","Chapter Nahl","An Nahl","Surah An Nahl","Chapter An Nahl","Surah 16","Chapter 16","The Bee","النَّحل"],"ayahNumber":1960,"juzNumber":14,"footnotes":"[461]  La situación de la mujer en la Arabia preislámica era pésima: apenas gozaban de derechos; no podían heredar, mientras que podían formar parte de la herencia; algunas tribus enterraban a las niñas al nacer por miedo a que llevasen la deshonra a sus familias (al ser violadas o hechas esclavas por los enemigos), y también por miedo a la pobreza; estaban poco consideradas porque eran un gasto económico y no proporcionaban ningún beneficio económico a la familia, como tampoco servían para la guerra. El Islam elevó la posición de la mujer concediéndole derechos de acuerdo con su naturaleza (ver la nota 228 de la aleya 2). Además, prohibió la antigua práctica de asesinar a las niñas enterrándolas vivas y ensalzó el papel de la mujer como madre (el Profeta —que Al-lah lo bendiga y le dé la paz— dijo que el Paraíso está a los pies de la madre), a la vez que alentó a cuidar a las hijas. (Dijo también el Profeta —que Al-lah lo bendiga y le dé la paz—: “Quien cuide a dos hijas hasta su madurez, llegará al Día de la Resurrección conmigo así”, y unió sus dedos para ilustrar sus palabras).","lang":"es","version":{"key":"spanish_montada_latin","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1539032400,"title":"Spanish Translation (Latin America) - Noor International","description":"Translation of the Quran meanings into Spanish (Latin America) by Noor International (Ed. 2017)"},"meta":{"transliteration":"yatawārā mina al-qawmi min sūi mā bushira bihi ayum'sikuhu ʿalā hūnin am yadussuhu fī al-turābi alā sāa mā yaḥkumūna ","translations":["He hides himself","from","the people","(because) of","the evil","of what","he has been given good news","about","Should he keep it","in","humiliation","or","bury it","in","the dust","Unquestionably","evil","(is) what","they decide","(59)"],"transliterationArr":["yatawārā","mina","al-qawmi","min","sūi","mā","bushira","bihi","ayum'sikuhu","ʿalā","hūnin","am","yadussuhu","fī","al-turābi","alā","sāa","mā","yaḥkumūna",null],"verseTiming":[[1,0,1380],[2,1380,1720],[3,1720,2510],[4,2510,3400],[5,3400,5910],[6,5910,6270],[7,6270,7230],[8,7230,8000],[9,8000,9480],[10,9480,10100],[11,10100,11030],[12,11030,11380],[13,11380,12720],[14,12720,12970],[15,12970,15650],[16,15650,16460],[17,16460,18870],[18,18870,19370],[19,19370,22275]]}}