{"name":"17:13","price":"13. Y cada hombre cargará con sus propias obras (y pecados[485]). Y el Día de la Resurrección le daremos un registro, que encontrará abierto (donde constará todo lo que haya realizado).","arabic":"وَكُلَّ إِنسَٰنٍ أَلۡزَمۡنَٰهُ طَٰٓئِرَهُۥ فِي عُنُقِهِۦۖ وَنُخۡرِجُ لَهُۥ يَوۡمَ ٱلۡقِيَٰمَةِ كِتَٰبٗا يَلۡقَىٰهُ مَنشُورًا","category":["17 (Al-Isra)","Al-Isra","Surah Al-Isra","Chapter Al-Isra","Isra","Surah Isra","Chapter Isra","Al Isra","Surah Al Isra","Chapter Al Isra","Surah 17","Chapter 17","The Night Journey","الإسرَاء"],"ayahNumber":2042,"juzNumber":15,"footnotes":"[485]  Cada persona pagará por sus propios pecados el Día de la Resurrección y no será juzgada por lo que otros hayan cometido, por lo que el concepto del pecado original no existe en el Islam. Los hombres nacen sin pecado alguno, son como un libro en blanco e inmaculado porque no heredan el pecado de Adán y Eva; sus faltas y malas acciones no empiezan a registrarse hasta que llegan a la pubertad. \nEn la Biblia también encontramos más de un versículo que sostiene que nadie puede cargar con los pecados de otro: “El hijo no cargará con la culpa del padre, ni el padre cargará con la injusticia del hijo, la justicia del justo será sobre él y la impiedad del impío será sobre él” (Ezequiel 18: 20). No obstante, el cristianismo se basa en la creencia de la redención, en la creencia de que Jesús —la paz de Al-lah esté con él— murió para redimir al hombre del pecado original que heredó de sus padres Adán y Eva, y es imprescindible para el cristiano creer en ello para obtener la salvación. Debe mencionarse que la base del cristianismo, el concepto de la redención, no se encuentra en la Biblia y que contradice lo que ella misma afirma en versículos como el mencionado anteriormente.","lang":"es","version":{"key":"spanish_montada_latin","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1539032400,"title":"Spanish Translation (Latin America) - Noor International","description":"Translation of the Quran meanings into Spanish (Latin America) by Noor International (Ed. 2017)"},"meta":{"transliteration":"wakulla insānin alzamnāhu ṭāirahu fī ʿunuqihi wanukh'riju lahu yawma al-qiyāmati kitāban yalqāhu manshūran ","translations":["And (for) every","man","We have fastened to him","his fate","in","his neck","and We will bring forth","for him","(on the) Day","(of) the Resurrection","a record","which he will find","wide open","(13)"],"transliterationArr":["wakulla","insānin","alzamnāhu","ṭāirahu","fī","ʿunuqihi","wanukh'riju","lahu","yawma","al-qiyāmati","kitāban","yalqāhu","manshūran",null],"verseTiming":[[1,0,810],[2,810,2960],[3,2960,4450],[4,4450,7549],[5,7549,7979],[6,7979,9269],[7,9269,10259],[8,10259,10869],[9,10869,11519],[10,11519,12829],[11,12829,14009],[12,14009,15559],[13,15559,17934]]}}