{"name":"17:23","price":"23. Y Al-lah ha ordenado adorarlo solo a Él y tratar a los padres con amabilidad y respeto. Si uno de ellos, o ambos, alcanzan la vejez en tu presencia, no les digas ninguna palabra de reproche ni les faltes al respeto, y háblales con dulzura[486].","arabic":"۞ وَقَضَىٰ رَبُّكَ أَلَّا تَعۡبُدُوٓاْ إِلَّآ إِيَّاهُ وَبِٱلۡوَٰلِدَيۡنِ إِحۡسَٰنًاۚ إِمَّا يَبۡلُغَنَّ عِندَكَ ٱلۡكِبَرَ أَحَدُهُمَآ أَوۡ كِلَاهُمَا فَلَا تَقُل لَّهُمَآ أُفّٖ وَلَا تَنۡهَرۡهُمَا وَقُل لَّهُمَا قَوۡلٗا كَرِيمٗا","category":["17 (Al-Isra)","Al-Isra","Surah Al-Isra","Chapter Al-Isra","Isra","Surah Isra","Chapter Isra","Al Isra","Surah Al Isra","Chapter Al Isra","Surah 17","Chapter 17","The Night Journey","الإسرَاء"],"ayahNumber":2052,"juzNumber":15,"footnotes":"[486]  El tratar bien a los padres es de suma importancia en el Islam, los hijos deben obedecerlos (siempre que no suponga desobedecer a Al-lah) y cuidar de ellos aunque no sean musulmanes. Esta obligación suele mencionarseen el Corán inmediatamente después de la obligación de adorar solamente a Al-lah(ver la aleya 36 de la sura 4, la 151 de la sura 6 y la 83 de la sura 2). La familia es la base de la sociedad musulmana. Según la tradición del Profeta —que Al-lah lo bendiga y le dé la paz— un hombre se acercó a él y le preguntó quién de entre los suyos tenía más derechos sobre él. El Profeta —que Al-lah lo bendiga y le dé la paz— respondió: “Tu madre”; entonces él preguntó: “¿Quién después?”, a lo que el Profeta —que Al-lah lo bendiga y le dé la paz— respondió de nuevo: “Tu madre”. El hombre volvió a preguntar: “¿Quién es el siguiente?”, y el Profeta —que Al-lah lo bendiga y le dé la paz— respondió de nuevo: “Tu madre”. Cuando el hombre le preguntó quién después de ella, el Profeta —que Al-lah lo bendiga y le dé la paz— le dijo: “Tu padre”.","lang":"es","version":{"key":"spanish_montada_latin","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1539032400,"title":"Spanish Translation (Latin America) - Noor International","description":"Translation of the Quran meanings into Spanish (Latin America) by Noor International (Ed. 2017)"},"meta":{"transliteration":"waqaḍā rabbuka allā taʿbudū illā iyyāhu wabil-wālidayni iḥ'sānan immā yablughanna ʿindaka al-kibara aḥaduhumā aw kilāhumā falā taqul lahumā uffin walā tanharhumā waqul lahumā qawlan karīman ","translations":["And has decreed","your Lord","that (do) not","worship","except","Him Alone","and to the parents","(be) good","Whether","reach","with you","the old age","one of them","or","both of them","then (do) not","say","to both of them","a word of disrespect","and (do) not","repel them","but speak","to them","a word","noble","(23)"],"transliterationArr":["waqaḍā","rabbuka","allā","taʿbudū","illā","iyyāhu","wabil-wālidayni","iḥ'sānan","immā","yablughanna","ʿindaka","al-kibara","aḥaduhumā","aw","kilāhumā","falā","taqul","lahumā","uffin","walā","tanharhumā","waqul","lahumā","qawlan","karīman",null],"verseTiming":[[1,0,840],[2,840,1610],[3,1610,2420],[4,2420,4310],[5,4310,6879],[6,6879,7979],[7,7979,9729],[8,9729,11639],[9,11639,12929],[10,12929,14939],[11,14939,16549],[12,16549,17399],[13,17399,20159],[14,20159,20519],[15,20519,21749],[16,21749,22419],[17,22419,23079],[18,23079,25829],[19,25829,26409],[20,26409,27709],[21,27709,28289],[22,28289,30629],[23,30629,31999],[24,31999,32529],[25,32529,34109],[26,34109,34619],[27,34619,35499],[28,35499,37129],[29,37129,39064]]}}