{"name":"18:24","price":"24. salvo (si añades): “Si Al-lah quiere”[523]. Y recuerda a tu Señor (con alabanzas, pídele perdón y busca en Él refugio del Demonio) si olvidas mencionar dichas palabras. Y pide a tu Señor (entonces) que te guie hacia el camino más correcto (si te preguntan algo cuya respuesta desconoces).","arabic":"إِلَّآ أَن يَشَآءَ ٱللَّهُۚ وَٱذۡكُر رَّبَّكَ إِذَا نَسِيتَ وَقُلۡ عَسَىٰٓ أَن يَهۡدِيَنِ رَبِّي لِأَقۡرَبَ مِنۡ هَٰذَا رَشَدٗا","category":["18 (Al-Kahf)","Al-Kahf","Surah Al-Kahf","Chapter Al-Kahf","Kahf","Surah Kahf","Chapter Kahf","Al Kahf","Surah Al Kahf","Chapter Al Kahf","Surah 18","Chapter 18","The Cave","الكَهف"],"ayahNumber":2164,"juzNumber":15,"footnotes":"[523]  El motivo de la revelación de esta aleya fue que cuando los incrédulos de la Meca le preguntaron al Profeta —que Al-lah lo bendiga y le dé la paz— que les contara la historia de los jóvenes de la caverna, siguiendo la sugerencia de los rabinos de Medina para ponerlo a prueba, él les contestó que se la contaría al día siguiente, con la convicción de que Al-lah se la revelaría en ese tiempo, pero no dijo “si Al-lah quiere”. Entonces, Al-lah tardó quince días en revelarle la historia como reprobación por su respuesta. Como curiosidad, cabe mencionar que la expresión española “ojalá” tiene su origen en la expresión árabe lau sha Al-lah que significa “si Al-lah quiere”, aunque con el paso del tiempo ha perdido su significado original.","lang":"es","version":{"key":"spanish_montada_latin","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1539032400,"title":"Spanish Translation (Latin America) - Noor International","description":"Translation of the Quran meanings into Spanish (Latin America) by Noor International (Ed. 2017)"},"meta":{"transliteration":"illā an yashāa al-lahu wa-udh'kur rabbaka idhā nasīta waqul ʿasā an yahdiyani rabbī li-aqraba min hādhā rashadan ","translations":["Except","If","Allah wills","Allah wills","And remember","your Lord","when","you forget","and say","Perhaps","[that]","will guide me","my Lord","to a nearer (way)","than","this","right way","(24)"],"transliterationArr":["illā","an","yashāa","al-lahu","wa-udh'kur","rabbaka","idhā","nasīta","waqul","ʿasā","an","yahdiyani","rabbī","li-aqraba","min","hādhā","rashadan",null],"verseTiming":[[1,0,2130],[2,2130,2370],[3,2370,5360],[4,5360,8160],[5,8160,8890],[6,8890,9880],[7,9880,10490],[8,10490,11390],[9,11390,11900],[10,11900,14010],[11,14010,14500],[12,14500,15940],[13,15940,16780],[14,16780,17920],[15,17920,18560],[16,18560,18960],[17,18960,20475]]}}