{"name":"18:9","price":"9. No pienses (¡oh, Muhammad!) que la historia de los jóvenes de la caverna[511] y de Ar-Raqim[512] es uno de Nuestros milagros más sorprendentes[513].","arabic":"أَمۡ حَسِبۡتَ أَنَّ أَصۡحَٰبَ ٱلۡكَهۡفِ وَٱلرَّقِيمِ كَانُواْ مِنۡ ءَايَٰتِنَا عَجَبًا","category":["18 (Al-Kahf)","Al-Kahf","Surah Al-Kahf","Chapter Al-Kahf","Kahf","Surah Kahf","Chapter Kahf","Al Kahf","Surah Al Kahf","Chapter Al Kahf","Surah 18","Chapter 18","The Cave","الكَهف"],"ayahNumber":2149,"juzNumber":15,"footnotes":"[511]  Algunos comentaristas creen que se trataba de los hijos de los reyes y líderes de Bizancio. Estos jóvenes se negaron a seguir las prácticas idólatras de su pueblo y ocultaban su fe por miedo a lo que podía sucederles. Cuando fueron descubiertos y comparecieron ante el rey, confesaron su fe y fueron amenazados si no regresaban a la religión de su pueblo, por esta razón, decidieron huir.\n[512]  No se sabe exactamente qué significa Ar-Raqim. Algunos comentaristas opinan que es el nombre del valle donde se hallaba la caverna, otros que es el nombre de la ciudad y otros que es la inscripción de piedra donde se escribió al historia de los jóvenes que fue finalmente depositada en la entrada de la caverna para que la gente conociera lo que sucedió.\n[513]  Pues más sorprendente es la creación de los cielos y de la tierra y todo lo que contiene.","lang":"es","version":{"key":"spanish_montada_latin","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1539032400,"title":"Spanish Translation (Latin America) - Noor International","description":"Translation of the Quran meanings into Spanish (Latin America) by Noor International (Ed. 2017)"},"meta":{"transliteration":"am ḥasib'ta anna aṣḥāba al-kahfi wal-raqīmi kānū min āyātinā ʿajaban ","translations":["Or","have you thought","that","(the) companions","(of) the cave","and the inscription","were","among","Our Signs","a wonder","(9)"],"transliterationArr":["am","ḥasib'ta","anna","aṣḥāba","al-kahfi","wal-raqīmi","kānū","min","āyātinā","ʿajaban",null],"verseTiming":[[1,0,490],[2,490,1440],[3,1440,2310],[4,2310,3290],[5,3290,4260],[6,4260,5450],[7,5450,6240],[8,6240,6640],[9,6640,8050],[10,8050,9465]]}}