{"name":"19:51","price":"51. Y recuerda (¡oh, Muhammad!) lo que te hemos revelado en el Libro (el Corán) acerca de Moisés. Adoraba solamente a Al-lah con sincera devoción[552] y fue un Mensajero y un Profeta[553].","arabic":"وَٱذۡكُرۡ فِي ٱلۡكِتَٰبِ مُوسَىٰٓۚ إِنَّهُۥ كَانَ مُخۡلَصٗا وَكَانَ رَسُولٗا نَّبِيّٗا","category":["19 (Maryam)","Maryam","Surah Maryam","Chapter Maryam","Surah 19","Chapter 19","Mary","مَريَم"],"ayahNumber":2301,"juzNumber":16,"footnotes":"[552]  También puede significar que Al-lah lo había purificado de cualquier impureza o que lo había escogido entre los demás hombres.\n[553]  A pesar de que los términos “Profeta” y “Mensajero” parecen sinónimos y se utilizan normalmente como tales, la mayoría de los exégetas musulmanes ven algunas diferencias entre ellos. La palabra “Mensajero” suele ser la traducción del árabe rasul, y se refiere a la persona que recibe una revelación de Al-lah y se le ordena transmitirla; mientras que la palabra «Profeta» suele ser la traducción del árabe nabi e indica a la persona que recibe una revelación pero no se le ordena transmitirla. El Sheij Al Islam Ibn Taimiiah sostuvo, no obstante, que el Mensajero es el que es enviado a personas incrédulas; mientras que el Profeta es el que es enviado a personas creyentes con la ley del mensajero que lo precedió con el objetivo de enseñarla y de juzgar entre los hombres. ","lang":"es","version":{"key":"spanish_montada_latin","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1539032400,"title":"Spanish Translation (Latin America) - Noor International","description":"Translation of the Quran meanings into Spanish (Latin America) by Noor International (Ed. 2017)"},"meta":{"transliteration":"wa-udh'kur fī al-kitābi mūsā innahu kāna mukh'laṣan wakāna rasūlan nabiyyan ","translations":["And mention","in","the Book","Musa","Indeed, he","was","chosen","and was","a Messenger","a Prophet","(51)"],"transliterationArr":["wa-udh'kur","fī","al-kitābi","mūsā","innahu","kāna","mukh'laṣan","wakāna","rasūlan","nabiyyan",null],"verseTiming":[[1,0,990],[2,990,1180],[3,1180,2400],[4,2400,5010],[5,5010,6460],[6,6460,7220],[7,7220,8830],[8,8830,9710],[9,9710,10730],[10,10730,13075]]}}