{"name":"19:7","price":"7. (Al-lah le respondió a través de un ángel diciéndole:) “¡Zacarías!, te anunciamos la llegada de un hijo que se llamará Yahia (Juan). No hemos asignado este nombre a nadie con anterioridad[543]”.","arabic":"يَٰزَكَرِيَّآ إِنَّا نُبَشِّرُكَ بِغُلَٰمٍ ٱسۡمُهُۥ يَحۡيَىٰ لَمۡ نَجۡعَل لَّهُۥ مِن قَبۡلُ سَمِيّٗا","category":["19 (Maryam)","Maryam","Surah Maryam","Chapter Maryam","Surah 19","Chapter 19","Mary","مَريَم"],"ayahNumber":2257,"juzNumber":16,"footnotes":"[543]  Yahia es comúnmente traducido como Juan Bautista, pero el nombre de Juan procede realmente de Yuhanna o Yuhanan. El nombre Yuhanna era conocido y usado entre los hebreos antes del nacimiento de Juan Bautista, pero no así el de Yahia, como afirma esta aleya del Corán. La traducción de la Biblia al árabe respeta la diferencia de los dos nombres, los cuales poseen raíces distintas, y Juan Bautista aparece como Yahia mientras que el “Evangelio del apóstol Juan”, por ejemplo, aparece como el “Evangelio de Yuhanna”. \nEsta aleya puede entenderse también en otro sentido, y puede significar que el nacimiento de Juan no se pareció al de ningún hombre, pues su padre era un hombre anciano y su madre, una mujer estéril.","lang":"es","version":{"key":"spanish_montada_latin","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1539032400,"title":"Spanish Translation (Latin America) - Noor International","description":"Translation of the Quran meanings into Spanish (Latin America) by Noor International (Ed. 2017)"},"meta":{"transliteration":"yāzakariyyā innā nubashiruka bighulāmin us'muhu yaḥyā lam najʿal lahu min qablu samiyyan ","translations":["O Zakariya","Indeed, We","[We] give you glad tidings","of a boy","his name","(will be) Yahya","not","We (have) assigned","[for] it","before","before","(this) name","(7)"],"transliterationArr":["yāzakariyyā","innā","nubashiruka","bighulāmin","us'muhu","yaḥyā","lam","najʿal","lahu","min","qablu","samiyyan",null],"verseTiming":[[1,0,3350],[2,3350,4640],[3,4640,5990],[4,5990,7280],[5,7280,8250],[6,8250,8930],[7,8930,9660],[8,9660,10590],[9,10590,11150],[10,11150,11480],[11,11480,12810],[12,12810,14845]]}}