{"name":"1:1","price":"1. (Empiezo)[2] con el nombre de Al-lah[3], el Clemente, el Misericordioso[4].","arabic":"بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah","Chapter Al-Fatihah","Fatihah","Surah Fatihah","Chapter Fatihah","Al Fatihah","Surah Al Fatihah","Chapter Al Fatihah","Surah 1","Chapter 1","The Opening","الفَاتِحَة"],"ayahNumber":1,"juzNumber":1,"footnotes":"[2]  A pesar de que, tradicionalmente, el encabezamiento de cada sura, conocido como el basmalah, ha sido traducido como “En el nombre de Al-lah […]”, la mayoría de los comentaristas opinan que debe sobrentenderse: “Empiezo la recitación del Corán con el nombre de Al-lah, buscando ayuda en Él, […]”. Por este motivo esta traducción ha optado por una expresión más cercana a su significado real, pero abreviada. No hay un consenso acerca de si el basmalah constituye la primera aleya (o verso coránico) de esta sura o simplemente la encabeza como en el resto de los capítulos del Sagrado Corán —con la excepción de la sura 9 (At-Taubah), donde no aparece—, aunque la opinión más extendida es la de considerarla como la primera aleya de la sura Al Fatihah.\n[3]  Al-lah es el nombre propio de Dios en árabe. A diferencia de la palabra “Dios”, el término “Al-lah” no tiene plural, por lo que no da pie a ambigüedades, y proviene del artículo árabe al más la palabra ilah (divinidad, el que es adorado); así pues, significa: el (único) que merece ser adorado. Cabe destacar que el nombre que Dios recibe en arameo es Al-laha, muy cercano a Al-lah; mientras que entre las palabras hebreas que más se utilizan para designar a Dios y que aparecen en la Biblia, se encuentran: Eloh, Elah y su plural mayestático Elohim. Al-lah aparece a veces escrito como “Allah” o transliterado al español como “Alá”; en cualquier caso hace referencia al Único y Verdadero Dios, que es el mismo Dios de los cristianos y judíos.\n[4]  Los adjetivos “Clemente” y “Misericordioso” no recogen la diferencia que la lengua árabe establece entre Rahman y Rahim. Rahman, traducido aquí como Clemente, es un adjetivo solamente atribuible a Al-lah y hace referencia a Su misericordia, en el sentido más extenso, para con toda Su creación. El adjetivo Rahim, traducido como Misericordioso, también hace referencia a la misericordia de Al-lah, pero a una misericordia más específica sobre Sus siervos creyentes.","lang":"es","version":{"key":"spanish_montada_latin","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1539032400,"title":"Spanish Translation (Latin America) - Noor International","description":"Translation of the Quran meanings into Spanish (Latin America) by Noor International (Ed. 2017)"},"meta":{"transliteration":"bis'mi al-lahi al-raḥmāni al-raḥīmi ","translations":["In (the) name","(of) Allah","the Most Gracious","the Most Merciful","(1)"],"transliterationArr":["bis'mi","al-lahi","al-raḥmāni","al-raḥīmi",null],"verseTiming":[[1,0,580],[2,580,1409],[3,1409,2502],[4,2502,5840]]}}