{"name":"21:109","price":"109. Y si dan la espalda a aquello a lo que los exhortas, diles, ¡oh, Muhammad!: “Realmente, les he informado a todos con equidad[619] (y estamos en igualdad de condiciones); y no sé si (el castigo) que se les ha prometido está cerca o lejos.","arabic":"فَإِن تَوَلَّوۡاْ فَقُلۡ ءَاذَنتُكُمۡ عَلَىٰ سَوَآءٖۖ وَإِنۡ أَدۡرِيٓ أَقَرِيبٌ أَم بَعِيدٞ مَّا تُوعَدُونَ","category":["21 (Al-Anbiya)","Al-Anbiya","Surah Al-Anbiya","Chapter Al-Anbiya","Anbiya","Surah Anbiya","Chapter Anbiya","Al Anbiya","Surah Al Anbiya","Chapter Al Anbiya","Surah 21","Chapter 21","The Prophets","الأنبيَاء"],"ayahNumber":2592,"juzNumber":17,"footnotes":"[619]  Esta aleya podría entenderse dentro del contexto de la declaración de guerra entre el Profeta —que Al-lah lo bendiga y le dé la paz— y los idólatras tras quedar anulado todo acuerdo o tratado de paz entre ellos, y el significado que tendría sería: “Realmente, les he informado a todos con equidadde que no tengo nada que ver con ustedes ni ustedes tienen nada que ver conmigo y de que no hay ningún pacto entre nosotros” (ver las primeras seis aleyas de la sura 9). Otra interpretación que defienden algunos comentaristas es: “Realmente, les he transmitido todo lo que Al-lah me ordenó transmitirles y tenemos el mismo conocimiento sobre lo que les he advertido”.","lang":"es","version":{"key":"spanish_montada_latin","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1539032400,"title":"Spanish Translation (Latin America) - Noor International","description":"Translation of the Quran meanings into Spanish (Latin America) by Noor International (Ed. 2017)"},"meta":{"transliteration":"fa-in tawallaw faqul ādhantukum ʿalā sawāin wa-in adrī aqarībun am baʿīdun mā tūʿadūna ","translations":["But if","they turn away","then say","I (have) announced to you","equally","equally","And not","I know","whether is near","or","far","what","you are promised","(109)"],"transliterationArr":["fa-in","tawallaw","faqul","ādhantukum","ʿalā","sawāin","wa-in","adrī","aqarībun","am","baʿīdun","mā","tūʿadūna",null],"verseTiming":[[1,0,810],[2,810,2260],[3,2260,2920],[4,2920,5010],[5,5010,5580],[6,5580,6190],[7,6190,8090],[8,8090,8620],[9,8620,10590],[10,10590,11650],[11,11650,12240],[12,12240,13710],[13,13710,14930],[14,14930,17335]]}}