{"name":"21:30","price":"30. ¿Acaso no saben, quienes rechazan la verdad, que los cielos y la tierra estaban juntos, formando una sola unidad[599], y los separamos? E hicimos que el agua fuera el origen de todo lo creado[600]. ¿No creerán, pues?","arabic":"أَوَلَمۡ يَرَ ٱلَّذِينَ كَفَرُوٓاْ أَنَّ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ كَانَتَا رَتۡقٗا فَفَتَقۡنَٰهُمَاۖ وَجَعَلۡنَا مِنَ ٱلۡمَآءِ كُلَّ شَيۡءٍ حَيٍّۚ أَفَلَا يُؤۡمِنُونَ","category":["21 (Al-Anbiya)","Al-Anbiya","Surah Al-Anbiya","Chapter Al-Anbiya","Anbiya","Surah Anbiya","Chapter Anbiya","Al Anbiya","Surah Al Anbiya","Chapter Al Anbiya","Surah 21","Chapter 21","The Prophets","الأنبيَاء"],"ayahNumber":2513,"juzNumber":17,"footnotes":"[599]  La afirmación de que los cielos y la tierra estaban unidos al principio de los tiempos formando una sola unidad está completamente de acuerdo con la teoría moderna del Big Bang acerca del origen del universo, que afirma que el universo tuvo su origen en una gran explosión y que desde entonces está en expansión. La energía se condensó en materia, principalmente en átomos de hidrógeno y de helio, estos átomos se acumularon en grandes nubes que se fueron alejando unas de otras y formaron un día las galaxias tras continuas reacciones nucleares. Esta teoría era impensable hace más de 1.400 años, cuando no se tenía ningún tipo de conocimiento sobre la física nuclear.\n[600]  Hoy en día sabemos por la ciencia que la célula es la base de la vida y que el 80% del citoplasma es agua. Las investigaciones modernas también han demostrado que la mayoría de los organismos vivos están compuestos por agua hasta en un 90%, mientras que el 80% de la sangre es agua. Asimismo, todos los seres vivos necesitan agua para su subsistencia. También es sabido que las primeras formas de vida tuvieron lugar en un ambiente acuático, pues las plantas marinas precedieron a los animales acuáticos y la vida en la tierra fue posterior. Además, funciones tan importantes en los seres vivos como la nutrición, la excreción, la reproducción, el crecimiento, etc., no pueden efectuarse sin agua. Todos estos datos no podían conocerse en el tiempo del Profeta Muhammad —que Al-lah lo bendiga y le dé la paz—.","lang":"es","version":{"key":"spanish_montada_latin","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1539032400,"title":"Spanish Translation (Latin America) - Noor International","description":"Translation of the Quran meanings into Spanish (Latin America) by Noor International (Ed. 2017)"},"meta":{"transliteration":"awalam yara alladhīna kafarū anna al-samāwāti wal-arḍa kānatā ratqan fafataqnāhumā wajaʿalnā mina al-māi kulla shayin ḥayyin afalā yu'minūna ","translations":["Do not","see","those who","disbelieved","that","the heavens","and the earth","were","a joined entity","then We parted them","and We made","from","[the] water","every","living thing","living thing","Then will not","they believe","(30)"],"transliterationArr":["awalam","yara","alladhīna","kafarū","anna","al-samāwāti","wal-arḍa","kānatā","ratqan","fafataqnāhumā","wajaʿalnā","mina","al-māi","kulla","shayin","ḥayyin","afalā","yu'minūna",null],"verseTiming":[[1,0,900],[2,900,1250],[3,1250,2230],[4,2230,4380],[5,4380,5310],[6,5310,6870],[7,6870,7870],[8,7870,8760],[9,8760,9970],[10,9970,12130],[11,12130,14050],[12,14050,14350],[13,14350,17110],[14,17110,17660],[15,17660,18510],[16,18510,19320],[17,19320,20110],[18,20110,22725]]}}