{"name":"23:18","price":"18. Y hacemos que descienda lluvia del cielo en una cantidad determinada[651], y la tierra (la absorbe y) la almacena[652]. Y (si quisiéramos) podríamos hacerla desaparecer.","arabic":"وَأَنزَلۡنَا مِنَ ٱلسَّمَآءِ مَآءَۢ بِقَدَرٖ فَأَسۡكَنَّٰهُ فِي ٱلۡأَرۡضِۖ وَإِنَّا عَلَىٰ ذَهَابِۭ بِهِۦ لَقَٰدِرُونَ","category":["23 (Al-Mu'minun)","Al-Mu'minun","Surah Al-Mu'minun","Chapter Al-Mu'minun","Mu'minun","Surah Mu'minun","Chapter Mu'minun","Al Mu'minun","Surah Al Mu'minun","Chapter Al Mu'minun","Surah 23","Chapter 23","The Believers","المُؤمِنُون"],"ayahNumber":2691,"juzNumber":18,"footnotes":"[651]  La cantidad de lluvia que desciende equivale a la misma cantidad que ha sido evaporada (unos 513 trillones de toneladas al año), por eso es una cantidad determinada que se mantiene constante año tras año, de manera que el agua circula continuamente según un ciclo equilibrado, necesario para preservar la vida del planeta. Este conocimiento era impensable hace unos 1.400 años.\n[652]  Hace años no se conocía el origen del agua subterránea. Se pensaba que los vientos empujaban el agua de los océanos hacia el interior de los continentes y que el agua regresaba a los océanos a través de un pasadizo secreto o del Gran Abismo. En tiempos de Platón dicho pasadizo se conocía con el nombre de Tartarus e incluso el filósofo Descartes del siglo XVIII apoyaba dicha opinión. Hasta el siglo XIX prevaleció la teoría de Aristóteles, según la cual el agua se condensaba en frías cavernas de las montañas y formaba lagos subterráneos que alimentaban los manantiales. Hoy sabemos que el origen del agua subterránea es la lluvia que se infiltra a través de las grietas del suelo, pero hace 1.400 no se conocía su origen.","lang":"es","version":{"key":"spanish_montada_latin","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1539032400,"title":"Spanish Translation (Latin America) - Noor International","description":"Translation of the Quran meanings into Spanish (Latin America) by Noor International (Ed. 2017)"},"meta":{"transliteration":"wa-anzalnā mina al-samāi māan biqadarin fa-askannāhu fī al-arḍi wa-innā ʿalā dhahābin bihi laqādirūna ","translations":["And We send down","from","the sky","water","in (due) measure","then We cause it to settle","in","the earth","And indeed, We","on","taking it away","taking it away","surely (are) Able","(18)"],"transliterationArr":["wa-anzalnā","mina","al-samāi","māan","biqadarin","fa-askannāhu","fī","al-arḍi","wa-innā","ʿalā","dhahābin","bihi","laqādirūna",null],"verseTiming":[[1,0,2430],[2,2430,2780],[3,2780,5180],[4,5180,7870],[5,7870,8709],[6,8709,11929],[7,11929,12179],[8,12179,13489],[9,13489,15439],[10,15439,16099],[11,16099,17139],[12,17139,18609],[13,18609,21784]]}}