{"name":"2:106","price":"106. No revocamos la validez de un precepto ni hacemos que caiga en el olvido sin remplazarlo por otro mejor o similar[41]. ¿Acaso no sabes que Al-lah tiene poder sobre todas las cosas?","arabic":"۞ مَا نَنسَخۡ مِنۡ ءَايَةٍ أَوۡ نُنسِهَا نَأۡتِ بِخَيۡرٖ مِّنۡهَآ أَوۡ مِثۡلِهَآۗ أَلَمۡ تَعۡلَمۡ أَنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":113,"juzNumber":1,"footnotes":"[41]  Algunas aleyas que tratan sobre prohibiciones, licencias, mandatos o castigos han sido sustituidas por otras a lo largo de la revelación. Algunas de estas aleyas han sido completamente eliminadas, mientras que la mayoría de ellas siguen presentes en el Sagrado Corán, aunque han perdido su validez. Por ejemplo, antes de que las aleyas 11 y 12 de la sura 4, acerca de la ley de la herencia, fueran reveladas, la aleya 180 de la sura 2 ordenaba a los musulmanes testar a favor de los parientes más cercanos. Posteriormente, los herederos legítimos tendrían su parte establecida por la ley y el testamento solo podría realizarse a favor de quienes no fueran herederos legítimos. La derogación de un precepto por otro obedece a la voluntad y sabiduría de Al-lah, Quien siempre busca lo mejor para Sus siervos en todo momento.  ","lang":"es","version":{"key":"spanish_montada_latin","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1539032400,"title":"Spanish Translation (Latin America) - Noor International","description":"Translation of the Quran meanings into Spanish (Latin America) by Noor International (Ed. 2017)"},"meta":{"transliteration":"mā nansakh min āyatin aw nunsihā nati bikhayrin min'hā aw mith'lihā alam taʿlam anna al-laha ʿalā kulli shayin qadīrun ","translations":["What","We abrogate","(of)","a sign","or","[We] cause it to be forgotten","We bring","better","than it","or","similar (to) it","Do not","you know","that","Allah","over","every","thing","(is) All-Powerful","(106)"],"transliterationArr":["mā","nansakh","min","āyatin","aw","nunsihā","nati","bikhayrin","min'hā","aw","mith'lihā","alam","taʿlam","anna","al-laha","ʿalā","kulli","shayin","qadīrun",null],"verseTiming":[[1,0,670],[2,670,2140],[3,2140,2520],[4,2520,3510],[5,3510,3840],[6,3840,5460],[7,5460,6060],[8,6060,6810],[9,6810,9840],[10,9840,10210],[11,10210,11250],[12,11250,12180],[13,12180,12990],[14,12990,14210],[15,14210,15030],[16,15030,15600],[17,15600,16200],[18,16200,17960],[19,17960,20695]]}}