{"name":"2:115","price":"115. Y a Al-lah pertenece el Oriente y el Occidente (pues a Él pertenece el dominio de toda la tierra). Y en cualquier dirección[42] que se vuelvan (para rezar), hallarán el rostro[43] de Al-lah (y Él se encuentra arriba, sobre Su Trono). En verdad, la misericordia y el favor de Al-lah (sobre Sus criaturas) son inmensos, y Él tiene conocimiento sobre todas las cosas.","arabic":"وَلِلَّهِ ٱلۡمَشۡرِقُ وَٱلۡمَغۡرِبُۚ فَأَيۡنَمَا تُوَلُّواْ فَثَمَّ وَجۡهُ ٱللَّهِۚ إِنَّ ٱللَّهَ وَٰسِعٌ عَلِيمٞ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":122,"juzNumber":1,"footnotes":"[42]  Esta aleya fue revelada en la ciudad de Medina para permitir cualquier dirección como alquibla a quienes realizasen rezos voluntarios, a quienes se hallasen de viaje y tuviesen dificultad para encontrar o seguir la alquibla o en caso de miedo por la proximidad del enemigo. Otra opinión es que esta aleya fue revelada tras el cambio de alquibla de Jerusalén a la Kaaba, en La Meca.\n[43]  A pesar de que hay aleyas quehablan del rostro o de las manos de Al-lah, sería erróneo y contrario al credo islámico imaginarnos Su rostro, por ejemplo, como algo semejante al nuestro, pues Al-lah, exaltado sea, no puede comparase con nada existente que el hombre pueda conocer. Afirmamos Sus nombres y Sus características, tal y como Él ha revelado, pero no sabemos cómo son ni nos corresponde intentar imaginárnoslos (“[…] no hay nada ni nadie parecido a Él –ni en Su naturaleza ni en Sus características ni en Sus acciones–; y Él oye y ve todas las cosas”; sura 42,aleya11).","lang":"es","version":{"key":"spanish_montada_latin","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1539032400,"title":"Spanish Translation (Latin America) - Noor International","description":"Translation of the Quran meanings into Spanish (Latin America) by Noor International (Ed. 2017)"},"meta":{"transliteration":"walillahi al-mashriqu wal-maghribu fa-aynamā tuwallū fathamma wajhu al-lahi inna al-laha wāsiʿun ʿalīmun ","translations":["And for Allah","(is) the east","and the west","so wherever","you turn","[so] there","(is the) face","(of) Allah","Indeed","Allah","(is) All-Encompassing","All-Knowing","(115)"],"transliterationArr":["walillahi","al-mashriqu","wal-maghribu","fa-aynamā","tuwallū","fathamma","wajhu","al-lahi","inna","al-laha","wāsiʿun","ʿalīmun",null],"verseTiming":[[1,0,1350],[2,1350,2270],[3,2270,3500],[4,3500,5010],[5,5010,6020],[6,6020,7450],[7,7450,7960],[8,7960,10740],[9,10740,11770],[10,11770,12680],[11,12680,13660],[12,13660,15755]]}}