{"name":"2:125","price":"125. Y (recuerda) cuando hicimos de la Kaaba[45] un lugar que los hombres visitan con asiduidad y un refugio seguro para la gente. ¡Tomen, hombres, la roca sobre la que se alzaba Abraham (para construir la Kaaba) como un lugar de culto![46] Y ordenamos a Abraham y a Ismael purificar la Casa (la Kaaba) para aquellos que la circunvalasen (como acto de adoración), para quienes buscaran en ella un lugar de retiro para adorar a Al-lah o para quienes allí rezaran inclinándose y postrándose.","arabic":"وَإِذۡ جَعَلۡنَا ٱلۡبَيۡتَ مَثَابَةٗ لِّلنَّاسِ وَأَمۡنٗا وَٱتَّخِذُواْ مِن مَّقَامِ إِبۡرَٰهِـۧمَ مُصَلّٗىۖ وَعَهِدۡنَآ إِلَىٰٓ إِبۡرَٰهِـۧمَ وَإِسۡمَٰعِيلَ أَن طَهِّرَا بَيۡتِيَ لِلطَّآئِفِينَ وَٱلۡعَٰكِفِينَ وَٱلرُّكَّعِ ٱلسُّجُودِ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":132,"juzNumber":1,"footnotes":"[45]  La Kaaba es un lugar de culto consagrado exclusivamente a Al-lah, construido hace casi 4.000 años por Abraham y su hijo Ismael —la paz de Al-lah esté con ellos—por mandato de Al-lah. Fue construida sobre el lugar donde Adán —la paz de Al-lah esté con Él— erigió el primer santuario para adorar al Único Dios. Ha sido reconstruida en varias ocasiones a lo largo del tiempo, pero todavía conserva una de las piedras de la construcción original de Abraham: la piedra negra, que fue entregada por el ángel Gabriel a Abraham, y que marca el inicio de cada vuelta o circunvalación que se realiza alrededor de la Kaaba como ritual de adoración a Al-lah. Es importante mencionar que los musulmanes no adoran la Kaaba ni hay nada valioso en su interior, sino que es la alquibla o el punto de convergencia hacia el cual todos los musulmanes se orientan para rezar, como si fuera el corazón de la comunidad islámica.\n[46]  El Profeta Abraham —que Al-lah le dé la paz— solía alzarse sobre una roca para construir la parte superior de la Kaaba. Cuando finalizó la construcción, le fue ordenado rezar cerca de dicha roca tras haber completado el ritual de circunvalación alrededor de la Kaaba. Esta roca conserva las huellas de los pies de Abraham —que Al-lah le dé la paz— y se toma, normalmente, como el punto donde se sitúa el Imam para dirigir el rezo en congregación.","lang":"es","version":{"key":"spanish_montada_latin","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1539032400,"title":"Spanish Translation (Latin America) - Noor International","description":"Translation of the Quran meanings into Spanish (Latin America) by Noor International (Ed. 2017)"},"meta":{"transliteration":"wa-idh jaʿalnā al-bayta mathābatan lilnnāsi wa-amnan wa-ittakhidhū min maqāmi ib'rāhīma muṣallan waʿahid'nā ilā ib'rāhīma wa-is'māʿīla an ṭahhirā baytiya lilṭṭāifīna wal-ʿākifīna wal-rukaʿi al-sujūdi ","translations":["And when","We made","the House","a place of return","for mankind","and (a place of) security","and (said), \"Take","[from]","(the) standing place","(of) Ibrahim","(as) a place of prayer","And We made a covenant","with","Ibrahim","and Ishmael","[that]","[You both] purify","My House","for those who circumambulate","and those who seclude themselves for devotion and prayer","and those who bow down","and those who prostrate","(125)"],"transliterationArr":["wa-idh","jaʿalnā","al-bayta","mathābatan","lilnnāsi","wa-amnan","wa-ittakhidhū","min","maqāmi","ib'rāhīma","muṣallan","waʿahid'nā","ilā","ib'rāhīma","wa-is'māʿīla","an","ṭahhirā","baytiya","lilṭṭāifīna","wal-ʿākifīna","wal-rukaʿi","al-sujūdi",null],"verseTiming":[[1,0,750],[2,750,1670],[3,1670,2520],[4,2520,3540],[5,3540,5280],[6,5280,6740],[7,6740,7940],[8,7940,8330],[9,8330,9810],[10,9810,11220],[11,11220,12760],[12,12760,15170],[13,15170,17140],[14,17140,18600],[15,18600,20180],[16,20180,21270],[17,21270,22350],[18,22350,23330],[19,23330,25000],[20,25000,26060],[21,26060,26890],[22,26890,29960],[23,29960,31670],[24,31670,32880],[25,32880,35475]]}}