{"name":"2:3","price":"3. esos que creen en el gaib[9], cumplen con el salat[10] (respetando sus horas y sus condiciones) y dan (en caridad) de lo que les hemos proveído;","arabic":"ٱلَّذِينَ يُؤۡمِنُونَ بِٱلۡغَيۡبِ وَيُقِيمُونَ ٱلصَّلَوٰةَ وَمِمَّا رَزَقۡنَٰهُمۡ يُنفِقُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":10,"juzNumber":1,"footnotes":"[9]  Gaib: Este término engloba todo aquello que, de no tener fe en la revelación, escapa a nuestra comprensión y a nuestros sentidos y cuyo conocimiento nos ha llegado a través de Al-lah y de lo que Él informó a Sus profetas, como la existencia de los ángeles, de los yinn (ver la nota de la aleya 34), del Paraíso, del Infierno, del Día del Juicio Final, etc.\n[10]  El salat equivale al rezo islámico y consiste principalmente en una serie de acciones que incluyen movimientos—como inclinaciones y postraciones—, la recitación de algunas aleyas del Corán y alabanzas a Al-lah. Está compuesto por una serie de unidades o raka’ y está sujeto a varias condiciones. Se ha preferido transliterar la palabra del árabe y no utilizar su traducción al español “oración” para que no se confunda con las plegarias o invocaciones comunes en todas las religiones. No obstante, se ha dejado la palabra en plural “rezos” para no forzar el plural de la palabra salat en español.","lang":"es","version":{"key":"spanish_montada_latin","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1539032400,"title":"Spanish Translation (Latin America) - Noor International","description":"Translation of the Quran meanings into Spanish (Latin America) by Noor International (Ed. 2017)"},"meta":{"transliteration":"alladhīna yu'minūna bil-ghaybi wayuqīmūna al-ṣalata wamimmā razaqnāhum yunfiqūna ","translations":["Those who","believe","in the unseen","and establish","the prayer","and out of what","We have provided them","they spend","(3)"],"transliterationArr":["alladhīna","yu'minūna","bil-ghaybi","wayuqīmūna","al-ṣalata","wamimmā","razaqnāhum","yunfiqūna",null],"verseTiming":[[1,0,1040],[2,1040,2190],[3,2190,3090],[4,3090,4260],[5,4260,5220],[6,5220,6580],[7,6580,7990],[8,7990,11365]]}}