{"name":"2:34","price":"34. Y (recuérdales, oh, Muhammad) cuando dijimos a los ángeles: “¡Póstrense ante Adán![17]“; y se postraron todos salvo Iblis[18], quien se negó, se envaneció y fue de los que se rebelan.","arabic":"وَإِذۡ قُلۡنَا لِلۡمَلَٰٓئِكَةِ ٱسۡجُدُواْ لِأٓدَمَ فَسَجَدُوٓاْ إِلَّآ إِبۡلِيسَ أَبَىٰ وَٱسۡتَكۡبَرَ وَكَانَ مِنَ ٱلۡكَٰفِرِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":41,"juzNumber":1,"footnotes":"[17]  Mediante esta postración, Al-lah no pedía a los ángeles que adoraran a Adán, sino que estaba poniendo a prueba su obediencia a Él.\n[18]  Iblis es el nombre que el Demonio recibe en el Corán y que suele traducirse como Satanás o Satán. Debido a que los nombres que el Demonio recibe en la cultura judeocristiana son varios (Lucifer, Satanás, Satán, Belial, etc.) y que hay diferencias de opinión con respecto a ellos, en esta traducción se ha optado por respetar el término Iblis, que en árabe significa “quien desespera de la misericordia de Al-lah”.\nIblis es, pues, el líder de los demonios y no un ángel como en la tradición cristiana; mas gozaba de un alto rango que le permitía estar en compañía de los ángeles. Al-lah creó a los humanos de barro, a los ángeles de luz y a los yinn de fuego. Los yinn, a veces traducidos como “genios”, son criaturas con libre albedrío como los seres humanos a los que, normalmente, no podemos ver; mientras que los ángeles fueron creados para obedecer a Al-lah y no pueden desobedecerlo en nada. Algunos yinn son creyentes y obedecen a Al-lah, pero aquellos que se rebelan contra Él son llamados demonios y siguen a su líder Iblis (ver la aleya 50 de la sura 18).","lang":"es","version":{"key":"spanish_montada_latin","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1539032400,"title":"Spanish Translation (Latin America) - Noor International","description":"Translation of the Quran meanings into Spanish (Latin America) by Noor International (Ed. 2017)"},"meta":{"transliteration":"wa-idh qul'nā lil'malāikati us'judū liādama fasajadū illā ib'līsa abā wa-is'takbara wakāna mina al-kāfirīna ","translations":["And when","We said","to the angels","Prostrate","to Adam","[so] they prostrated","except","Iblis","He refused","and was arrogant","and became","of","the disbelievers","(34)"],"transliterationArr":["wa-idh","qul'nā","lil'malāikati","us'judū","liādama","fasajadū","illā","ib'līsa","abā","wa-is'takbara","wakāna","mina","al-kāfirīna",null],"verseTiming":[[1,0,650],[2,650,1440],[3,1440,4370],[4,4370,5120],[5,5120,6020],[6,6020,8200],[7,8200,10340],[8,10340,11240],[9,11240,11850],[10,11850,13000],[11,13000,13750],[12,13750,14050],[13,14050,16755]]}}