{"name":"33:26","price":"26. E hizo que aquellos que las apoyaron de entre los judíos (que vivían en las proximidades de Medina)[803] saliesen de sus fortalezas, e infundió terror en sus corazones; a unos los mataron y a otros los hicieron prisioneros.","arabic":"وَأَنزَلَ ٱلَّذِينَ ظَٰهَرُوهُم مِّنۡ أَهۡلِ ٱلۡكِتَٰبِ مِن صَيَاصِيهِمۡ وَقَذَفَ فِي قُلُوبِهِمُ ٱلرُّعۡبَ فَرِيقٗا تَقۡتُلُونَ وَتَأۡسِرُونَ فَرِيقٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab","Chapter Al-Ahzab","Ahzab","Surah Ahzab","Chapter Ahzab","Al Ahzab","Surah Al Ahzab","Chapter Al Ahzab","Surah 33","Chapter 33","The Combined Forces","الأحزَاب"],"ayahNumber":3559,"juzNumber":21,"footnotes":"[803]  Se refiere a los judíos de la tribu de Banu Quraidha que traicionaron al Profeta Muhammad —que Al-lah lo bendiga y le dé la paz— rompiendo su pacto de defender a los creyentes contra una agresión extranjera. Dicha tribu se alió con las otras tribus de incrédulos que habían acampado fuera de Medina para atacar la ciudad cuando esta se encontrase desprotegida con el fin de exterminar a las mujeres, niños y ancianos que había en su interior, así como a los pocos guardias que velaban por ellos. Al acabar la contienda, el Profeta Muhammad —que Al-lah lo bendiga y le dé la paz— se dirigió a la tribu de Banu Quraidha. Estos se rindieron con la condición de que un antiguo amigo y aliado de ellos que había aceptado el Islam, Sa’ad Bin Mu’adh, dictaminase sobre ellos, pues pensaban que este perdonaría sus vidas. Sin embargo, Sa’ad dictaminó que los hombres fueran ejecutados y las mujeres y niños fueran tomados como prisioneros; y el Profeta Muhammad —que Al-lah lo bendiga y le dé la paz— mandó que se cumpliera la sentencia de quien los mismos judíos habían solicitado.","lang":"es","version":{"key":"spanish_montada_latin","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1539032400,"title":"Spanish Translation (Latin America) - Noor International","description":"Translation of the Quran meanings into Spanish (Latin America) by Noor International (Ed. 2017)"},"meta":{"transliteration":"wa-anzala alladhīna ẓāharūhum min ahli al-kitābi min ṣayāṣīhim waqadhafa fī qulūbihimu al-ruʿ'ba farīqan taqtulūna watasirūna farīqan ","translations":["And He brought down","those who","backed them","among","(the) People","(of) the Scripture","from","their fortresses","and cast","into","their hearts","[the] terror","a group","you killed","and you took captive","a group","(26)"],"transliterationArr":["wa-anzala","alladhīna","ẓāharūhum","min","ahli","al-kitābi","min","ṣayāṣīhim","waqadhafa","fī","qulūbihimu","al-ruʿ'ba","farīqan","taqtulūna","watasirūna","farīqan",null],"verseTiming":[[1,0,1760],[2,1760,2730],[3,2730,4250],[4,4250,5080],[5,5080,5600],[6,5600,6570],[7,6570,7020],[8,7020,9090],[9,9090,9870],[10,9870,10150],[11,10150,11270],[12,11270,12540],[13,12540,13340],[14,13340,13620],[15,13620,14840],[16,14840,15680],[17,15680,17270],[18,17270,18690],[19,18690,19990],[20,19990,21555]]}}