{"name":"3:121","price":"121. Y (recuerda, ¡oh, Muhammad!) cuando saliste de tu hogar por la madrugada para asignar a los creyentes sus puestos en la batalla (de Uhud[116]). Y Al-lah todo lo oye y todo lo sabe.","arabic":"وَإِذۡ غَدَوۡتَ مِنۡ أَهۡلِكَ تُبَوِّئُ ٱلۡمُؤۡمِنِينَ مَقَٰعِدَ لِلۡقِتَالِۗ وَٱللَّهُ سَمِيعٌ عَلِيمٌ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":414,"juzNumber":4,"footnotes":"[116]  La batalla de Uhud es la segunda gran batalla del Islam y tuvo lugar el tercer año de la Hégira en el monte Uhud, situado a unos cinco kilómetros de la ciudad de Medina. Tras la pérdida que los incrédulos de La Meca sufrieron en Badr, estos prepararon una ofensiva para vengarse de los musulmanes, para lo que reunieron un ejército de unos 3.000 hombres. Los musulmanes salieron a su encuentro con un ejército de 1.000 hombres, aunque los hipócritas de la ciudad preferían quedarse en Medina y no estaban de acuerdo con la decisión del Profeta —que Al-lah lo bendiga y le dé la paz—. Uno de los hipócritas regresó a la ciudad con una tercera parte del ejército antes de llegar a Uhud, molesto con el Profeta —que Al-lah lo bendiga y le dé la paz— por no haber tenido en cuenta su opinión de no salir al encuentro de los incrédulos de La Meca. Posteriormente, él y sus seguidores se excusarían diciendo que no sabían que ese día iban a luchar y que por esa razón regresaron a Medina. La batalla supuso un gran revés para los musulmanes que padecieron las consecuencias de desobedecer las órdenes del Profeta Muhammad —que Al-lah lo bendiga y le dé la paz—, ya que los arqueros, quienes protegían al resto de los combatientes musulmanes desde lo alto del monte, abandonaron sus puestos para tomar el botín pese a la prohibición del Profeta —que Al-lah lo bendiga y le dé la paz— y fueron sorprendidos por detrás, de manera que perdieron una batalla que tenían prácticamente ganada.","lang":"es","version":{"key":"spanish_montada_latin","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1539032400,"title":"Spanish Translation (Latin America) - Noor International","description":"Translation of the Quran meanings into Spanish (Latin America) by Noor International (Ed. 2017)"},"meta":{"transliteration":"wa-idh ghadawta min ahlika tubawwi-u al-mu'minīna maqāʿida lil'qitāli wal-lahu samīʿun ʿalīmun ","translations":["And when","you left early morning","from","your household","to post","the believers","(to take) positions","for the battle","And Allah","(is) All-Hearing","All-Knowing","(121)"],"transliterationArr":["wa-idh","ghadawta","min","ahlika","tubawwi-u","al-mu'minīna","maqāʿida","lil'qitāli","wal-lahu","samīʿun","ʿalīmun",null],"verseTiming":[[1,0,720],[2,720,1640],[3,1640,2010],[4,2010,2860],[5,2860,3890],[6,3890,5420],[7,5420,6630],[8,6630,9040],[9,9040,10360],[10,10360,11500],[11,11500,13745]]}}