{"name":"47:18","price":"18. ¿Acaso esperan a que les sorprenda la Hora? En verdad, ya han aparecido algunas de sus señales[940]. Y cuando esta tenga lugar, ¿de qué les servirán las advertencias?","arabic":"فَهَلۡ يَنظُرُونَ إِلَّا ٱلسَّاعَةَ أَن تَأۡتِيَهُم بَغۡتَةٗۖ فَقَدۡ جَآءَ أَشۡرَاطُهَاۚ فَأَنَّىٰ لَهُمۡ إِذَا جَآءَتۡهُمۡ ذِكۡرَىٰهُمۡ","category":["47 (Muhammad)","Muhammad","Surah Muhammad","Chapter Muhammad","Surah 47","Chapter 47","Muhammad","مُحَمَّد"],"ayahNumber":4563,"juzNumber":26,"footnotes":"[940]  Las señales indicadoras de la proximidad de la Hora final se dividen en menores y mayores. Las mayores han sido comentadas en la nota de la aleya 158 de la sura 6. En cuanto a las menores, empezaron a manifestarse tras la llegada del Profeta Muhammad —que Al-lah lo bendiga y le dé la paz— y son muy numerosas; entre ellas destacan la partición de la luna en dos (que tuvo lugar en tiempos del Profeta —que Al-lah lo bendiga y le dé la paz—) o profecías recogidas en dichos del Profeta —que Al-lah lo bendiga y le dé la paz—, como: “Cuando veas a los pastores (anteriormente) desamparados y descalzos, competir en la construcción de altos edificios”.","lang":"es","version":{"key":"spanish_montada_latin","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1539032400,"title":"Spanish Translation (Latin America) - Noor International","description":"Translation of the Quran meanings into Spanish (Latin America) by Noor International (Ed. 2017)"},"meta":{"transliteration":"fahal yanẓurūna illā al-sāʿata an tatiyahum baghtatan faqad jāa ashrāṭuhā fa-annā lahum idhā jāathum dhik'rāhum ","translations":["Then do","they wait","but","(for) the Hour","that","it should come to them","suddenly","But indeed","have come","its indications","Then how","to them","when","has come to them","their reminder","(18)"],"transliterationArr":["fahal","yanẓurūna","illā","al-sāʿata","an","tatiyahum","baghtatan","faqad","jāa","ashrāṭuhā","fa-annā","lahum","idhā","jāathum","dhik'rāhum",null],"verseTiming":[[1,0,680],[2,680,2550],[3,2550,3200],[4,3200,4430],[5,4430,5410],[6,5410,8040],[7,8040,9400],[8,9400,10020],[9,10020,12190],[10,12190,14060],[11,14060,16420],[12,16420,17070],[13,17070,17730],[14,17730,20460],[15,20460,22315]]}}