{"name":"4:31","price":"31. Si evitan los pecados graves[140] que se les han prohibido, borraremos sus faltas y los admitiremos en un lugar honorable (el Paraíso).","arabic":"إِن تَجۡتَنِبُواْ كَبَآئِرَ مَا تُنۡهَوۡنَ عَنۡهُ نُكَفِّرۡ عَنكُمۡ سَيِّـَٔاتِكُمۡ وَنُدۡخِلۡكُم مُّدۡخَلٗا كَرِيمٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":524,"juzNumber":5,"footnotes":"[140]  Según un dicho (hadiz) del Profeta —que Al-lah lo bendiga y le dé la paz—, los pecados graves en el Islam son siete: adorar a otros además de a Al-lah, matar a alguien sin una causa justa, practicar la hechicería, tratar con intereses (usura), gastar los bienes de los huérfanos, huir del enemigo al comienzo de la batalla y acusar a una mujer virtuosa de adulterio o fornicación. Según otro dicho, los peores pecados son: adorar a otros además de a Al-lah, matar a alguien injustamente y tratar mal a los padres. Otro dicho del Profeta —que Al-lah lo bendiga y le dé la paz— sostiene que el peor de los pecados es dar falso testimonio. Todos los pecados mencionados son de suma gravedad, y el único que no puede ser perdonado sin el debido arrepentimiento es el adorar a otros y equipararlos con Al-lah.","lang":"es","version":{"key":"spanish_montada_latin","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1539032400,"title":"Spanish Translation (Latin America) - Noor International","description":"Translation of the Quran meanings into Spanish (Latin America) by Noor International (Ed. 2017)"},"meta":{"transliteration":"in tajtanibū kabāira mā tun'hawna ʿanhu nukaffir ʿankum sayyiātikum wanud'khil'kum mud'khalan karīman ","translations":["If","you avoid","great (sins)","(of) what","you are forbidden","from [it]","We will remove","from you","your evil deeds","and We will admit you","(to) an entrance","noble","(31)"],"transliterationArr":["in","tajtanibū","kabāira","mā","tun'hawna","ʿanhu","nukaffir","ʿankum","sayyiātikum","wanud'khil'kum","mud'khalan","karīman",null],"verseTiming":[[1,0,690],[2,690,2690],[3,2690,5430],[4,5430,5760],[5,5760,6760],[6,6760,7380],[7,7380,8350],[8,8350,9690],[9,9690,11320],[10,11320,14050],[11,14050,15800],[12,15800,17240],[13,17240,18710],[14,18710,19900],[15,19900,21005]]}}