{"name":"6:98","price":"98. Y Él es Quien los ha creado a partir de un solo ser (Adán), y (ha decretado para ustedes) un lugar de residencia[215] (en el útero) y un lugar de almacenamiento (en la columna vertebral[216]). Ciertamente, hemos explicado las pruebas (de Nuestro poder) para las gentes que reflexionan.","arabic":"وَهُوَ ٱلَّذِيٓ أَنشَأَكُم مِّن نَّفۡسٖ وَٰحِدَةٖ فَمُسۡتَقَرّٞ وَمُسۡتَوۡدَعٞۗ قَدۡ فَصَّلۡنَا ٱلۡأٓيَٰتِ لِقَوۡمٖ يَفۡقَهُونَ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":887,"juzNumber":7,"footnotes":"[215]  También puede significar, según algunos comentaristas, un lugar de residencia en la tierra y un lugar de almacenamiento en la tumba.\n[216]  Los órganos sexuales masculinos (los testículos) y los femeninos (los ovarios) se desarrollan en el feto cerca de los riñones, concretamente entre la columna vertebral y las costillas once y doce. Posteriormente descienden hasta su posición final; pero incluso entonces y en la edad adulta, el suministro sanguíneo y nervioso de dichos órganos procede de la arteria aorta abdominal, situada entre la columna vertebral y las costillas, y el drenaje linfático también regresa a dicha zona. Posiblemente la zona de la columna vertebral es considerada como un almacén debido a que en las gónadas se encuentran las células sexuales que todavía no han dado lugar a un nuevo ser; y solo Al-lah conoce la verdad.","lang":"es","version":{"key":"spanish_montada_latin","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1539032400,"title":"Spanish Translation (Latin America) - Noor International","description":"Translation of the Quran meanings into Spanish (Latin America) by Noor International (Ed. 2017)"},"meta":{"transliteration":"wahuwa alladhī ansha-akum min nafsin wāḥidatin famus'taqarrun wamus'tawdaʿun qad faṣṣalnā al-āyāti liqawmin yafqahūna ","translations":["And He","(is) the One Who","(has) produced you","from","a soul","single","so (there is) a place of dwelling","and a resting place","Certainly","We have made clear","the Signs","for a people","(who) understand","(98)"],"transliterationArr":["wahuwa","alladhī","ansha-akum","min","nafsin","wāḥidatin","famus'taqarrun","wamus'tawdaʿun","qad","faṣṣalnā","al-āyāti","liqawmin","yafqahūna",null],"verseTiming":[[1,0,530],[2,530,2960],[3,2960,4730],[4,4730,5810],[5,5810,8090],[6,8090,10119],[7,10119,12489],[8,12489,13859],[9,13859,14799],[10,14799,15809],[11,15809,17159],[12,17159,18979],[13,18979,21894]]}}