{"name":"9:41","price":"41. Salgan a luchar[309] sea cual sea su estado[310], y combatan con sus bienes y sus vidas por la causa de Al-lah. Eso es lo mejor para ustedes, ¡si supieran!","arabic":"ٱنفِرُواْ خِفَافٗا وَثِقَالٗا وَجَٰهِدُواْ بِأَمۡوَٰلِكُمۡ وَأَنفُسِكُمۡ فِي سَبِيلِ ٱللَّهِۚ ذَٰلِكُمۡ خَيۡرٞ لَّكُمۡ إِن كُنتُمۡ تَعۡلَمُونَ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1276,"juzNumber":10,"footnotes":"[309]  Esta aleya y las posteriores fueron reveladas acerca de la batalla de Tabuk, una zona al norte de la península donde el Profeta —que Al-lah lo bendiga y le dé la paz— se dirigía para enfrentarse a los bizantinos, enemigos del Islam, poco después de la batalla de Hunain, en el año noveno después de la Hégira. El excesivo calor y la distancia hizo que los hipócritas y algunos creyentes trataran de excusarse para no salir a combatir. Finalmente, la batalla no se produjo porque el ejército bizantino abandonó el lugar antes de la llegada del ejército musulmán, y los creyentes regresaron a Medina sanos y salvos.\n[310]  Literalmente dice: “tanto ligeros como pesados”, y significa: “tanto si son jóvenes como si son viejos, fuertes o débiles, ricos o pobres”. Más tarde, esta aleya quedaría abrogada por la 91 de esta mismasura, que exentaba de la lucha a los débiles y enfermos y a quienes no dispusiesen de medios.","lang":"es","version":{"key":"spanish_montada_latin","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1539032400,"title":"Spanish Translation (Latin America) - Noor International","description":"Translation of the Quran meanings into Spanish (Latin America) by Noor International (Ed. 2017)"},"meta":{"transliteration":"infirū khifāfan wathiqālan wajāhidū bi-amwālikum wa-anfusikum fī sabīli al-lahi dhālikum khayrun lakum in kuntum taʿlamūna ","translations":["Go forth","light","or heavy","and strive","with your wealth","and your lives","in","(the) way","(of) Allah","That","(is) better","for you","if","you","know","(41)"],"transliterationArr":["infirū","khifāfan","wathiqālan","wajāhidū","bi-amwālikum","wa-anfusikum","fī","sabīli","al-lahi","dhālikum","khayrun","lakum","in","kuntum","taʿlamūna",null],"verseTiming":[[1,0,1920],[2,1920,4090],[3,4090,5910],[4,5910,7110],[5,7110,8980],[6,8980,11050],[7,11050,11460],[8,11460,12660],[9,12660,15070],[10,15070,16170],[11,16170,17050],[12,17050,17750],[13,17750,19010],[14,19010,20840],[15,20840,24535]]}}