{"name":"2:142","price":"Ibijuju mu bayahudi n’ibitazi bimeze nkabo, bizovuga n’agasuzuguro biti: “Ni igiki catumye abislamu bahindura ubutumbero bwa “Bayti l-Maqdis[18]”, bahora berekezako mu gusenga?”. Ntumwa y’Imana! Bibwire uti: “Ubuseruko n’uburengero n’ibiri hagati yabwo, vyose ni ivy’Imana Allah, aho dutumbera hose rero tuba twubahiriza ibwirizwa ry’Imana Allah. Irongora mu baja bayo uwo Ishatse mu nzira yayo igororotse”.","arabic":"۞ سَيَقُولُ ٱلسُّفَهَآءُ مِنَ ٱلنَّاسِ مَا وَلَّىٰهُمۡ عَن قِبۡلَتِهِمُ ٱلَّتِي كَانُواْ عَلَيۡهَاۚ قُل لِّلَّهِ ٱلۡمَشۡرِقُ وَٱلۡمَغۡرِبُۚ يَهۡدِي مَن يَشَآءُ إِلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":149,"juzNumber":2,"footnotes":"[18] Bayti l-Maqdis ivugwa ng'aha, ni umusigiti mweranda wa mbere wubatswe muri Palestina. Bivugwa ko woba wubatswe n'abamalayika, canke ko wubatswe na Nuhu canke uruvyaro rwiwe, ukaba wagiye urasanurwa n'Intumwa z'Imana zakurikiye mu nyuma; nka Dawudi, Sulayimani, n'izindi. Ni wo musigiti uza ubwa kabiri mu misigiti yubashwe isabwa kugenderwa mu bwislamu, havuye umusigiti w'i Makka n'umusigiti wubatswe n'Intumwa Muhamadi (nyakugira amahoro n'impuhwe z'Imana Allah) \ni Madina. Ni muri uwo musigiti nyene Intumwa Muhamadi (nyakugira amahoro n'impuhwe z'Imana Allah) yareruwe ijanwa mw'ijuru mw'ijoro ryiswe \"ijoro ry'iduzwa ry'Intumwa mw'ijuru\". Ni bwo butumbero bwa mbere rero, abislamu bahora berekezako mu gusenga imbere yuko babwirizwa kwerekeza i Makka.","lang":"rn","version":{"key":"ikirundi_gehiti","direction":"ltr","language_iso_code":"rn","version":"1.0.2","last_update":1708340549,"title":"Kirundi(Rundi) Translation","description":false},"meta":{"transliteration":"sayaqūlu al-sufahāu mina al-nāsi mā wallāhum ʿan qib'latihimu allatī kānū ʿalayhā qul lillahi al-mashriqu wal-maghribu yahdī man yashāu ilā ṣirāṭin mus'taqīmin ","translations":["Will say","the foolish ones","from","the people","What","(has) turned them","from","their direction of prayer","which","they were used to","[on it]","Say","For Allah","(is) the east","and the west","He guides","whom","He wills","to","a path","straight","(142)"],"transliterationArr":["sayaqūlu","al-sufahāu","mina","al-nāsi","mā","wallāhum","ʿan","qib'latihimu","allatī","kānū","ʿalayhā","qul","lillahi","al-mashriqu","wal-maghribu","yahdī","man","yashāu","ilā","ṣirāṭin","mus'taqīmin",null],"verseTiming":[[1,0,3230],[2,3230,5820],[3,5820,6100],[4,6100,7370],[5,7370,7730],[6,7730,8840],[7,8840,9740],[8,9740,10770],[9,10770,11620],[10,11620,12380],[11,12380,13460],[12,13460,14170],[13,14170,15250],[14,15250,16250],[15,16250,17720],[16,17720,18510],[17,18510,18680],[18,18680,21720],[19,21720,22180],[20,22180,23220],[21,23220,26685]]}}