{"name":"33:56","price":"Mu vy’ukuri Imana Allah, Irahayagiza Umuvugishwamana (nyakugira amahoro n’impuhwe z’Imana Allah) ku batoni bayo mu bamalayika; abamalayika bayo na bo bakamuhayagiza banamusabira kuri Yo. Emwe bemeye Imana Allah n’Intumwa yayo bakubahiriza n’amabwirizwa yayo! Ni kuri izo mvo rero zo kwubaha no kwubahiriza uyo Muvugishwamana, mutegetswe kumusabira amahoro n’impuhwe z’Imana Allah[17].","arabic":"إِنَّ ٱللَّهَ وَمَلَٰٓئِكَتَهُۥ يُصَلُّونَ عَلَى ٱلنَّبِيِّۚ يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ صَلُّواْ عَلَيۡهِ وَسَلِّمُواْ تَسۡلِيمًا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab","Chapter Al-Ahzab","Ahzab","Surah Ahzab","Chapter Ahzab","Al Ahzab","Surah Al Ahzab","Chapter Al Ahzab","Surah 33","Chapter 33","The Combined Forces","الأحزَاب"],"ayahNumber":3589,"juzNumber":22,"footnotes":"[17] Harakiriwe uburyo bwinshi bwo gusabira amahoro n’impuhwe Umuvugishwamana Muhamadi (nyakugira amahoro n’impuhwe z’Imana Allah); muri bwo, ni ubu bukurikira: “ALLAAHUMMA SWALLI ALAA MUHAMMADIN WA'ALAA AALI MUHAMMADIN KAMAA SWALLAYTA ALAA IBRAAHIIMA WA'ALAA AALI IBRAAHIIMA, INNAKA HAMIIDUN MAJIIDUN. ALLAAHUMMA BAARIK ALAA MUHAMMADIN WA'ALAA AALI MUHAMMADIN KAMAA BAARAKTA ALAA IBRAAHIIMA WA'ALAA AALI IBRAAHIIMA, INNAKA HAMIIDUN MAJIIDUN”. (Ewe Mana yanje Rurema Allah! Hundagaza impuhwe zawe ku Ntumwa Muhamadi n'umuryango w'Intumwa Muhamadi, nk'uko Wahundagaje impuhwe zawe ku Ntumwa Ibrahimu n'umuryango w'Intumwa Ibrahimu. Mu vy'ukuri Wewe, ni Nyenugushimagizwa, Nyeniteka. Ewe Mana Yanje Rurema Allah! Hezagira Intumwa Muhamadi n'umuryango w'Intumwa Muhamadi, nk'uko Wahezagiye Intumwa Ibrahimu n'umuryango w'Intumwa Ibrahimu. Mu vy'ukuri Wewe, ni Nyenugushimagizwa, Nyeniteka).","lang":"rn","version":{"key":"ikirundi_gehiti","direction":"ltr","language_iso_code":"rn","version":"1.0.2","last_update":1708340549,"title":"Kirundi(Rundi) Translation","description":false},"meta":{"transliteration":"inna al-laha wamalāikatahu yuṣallūna ʿalā al-nabiyi yāayyuhā alladhīna āmanū ṣallū ʿalayhi wasallimū taslīman ","translations":["Indeed","Allah","and His Angels","send blessings","upon","the Prophet","O you who believe","O you who believe","O you who believe","Send blessings","on him","and greet him","(with) greetings","(56)"],"transliterationArr":["inna","al-laha","wamalāikatahu","yuṣallūna","ʿalā","al-nabiyi","yāayyuhā","alladhīna","āmanū","ṣallū","ʿalayhi","wasallimū","taslīman",null],"verseTiming":[[1,0,1080],[2,1080,2000],[3,2000,5120],[4,5120,6350],[5,6350,6720],[6,6720,8440],[7,8440,11770],[8,11770,12740],[9,12740,13750],[10,13750,14590],[11,14590,15360],[12,15360,16510],[13,16510,18415]]}}