{"name":"43:57","price":"Ntumwa y’Imana! Igihe uciriwe agace ka Isa mwene Mariyamu, ababangikanyamana mu bantu warungitsweko bariko barahazana na we, baciye bicwa n’akamwemwe ko baronse icitwazo c’uko imana zabo babangikanya n’Imana Allah, ari nka Isa mwene Mariyamu ku banaswara[8];","arabic":"۞ وَلَمَّا ضُرِبَ ٱبۡنُ مَرۡيَمَ مَثَلًا إِذَا قَوۡمُكَ مِنۡهُ يَصِدُّونَ","category":["43 (Az-Zukhruf)","Az-Zukhruf","Surah Az-Zukhruf","Chapter Az-Zukhruf","Zukhruf","Surah Zukhruf","Chapter Zukhruf","Az Zukhruf","Surah Az Zukhruf","Chapter Az Zukhruf","Surah 43","Chapter 43","The Gold Adornments","الزُّخْرُف"],"ayahNumber":4382,"juzNumber":25,"footnotes":"[8] Ivyo vyabaye igihe hahishurwa Aayah ya 98 mu gisomwa c’Abavugishwamana: “Bagarariji! Mu vy’ukuri mwebwe hamwe n’ibigirwamana vy’ubwoko bwose, mwasenga mu gishingo c’Imana Allah, ni ibicanirizo vy’umuriro wa Jahannamu; mwebwe mwese rero mutegerezwa kuwinjira”. Ababangikanyamana baciye bavuga bati: “Turemeye ko imana zacu ziba nka Isa mwene Mariyamu ku banaswara”, haca hahishurwa Aayah ya 101 muri ico gisomwa nyene: “Mu vy’ukuri, abo Twamaze kumenya ko bafise amahirwe yo kwinjira mu Bwami bw’ijuru, abo ni bo rero bazokwigizwa kure y’umuriro wa Jahannamu”; yerekana ko ikizotabwa mu muriro kuko cabangikanijwe n’Imana Allah, ari icasenzwe kigashima gusengwa mu gishingo cayo.","lang":"rn","version":{"key":"ikirundi_gehiti","direction":"ltr","language_iso_code":"rn","version":"1.0.2","last_update":1708340549,"title":"Kirundi(Rundi) Translation","description":false},"meta":{"transliteration":"walammā ḍuriba ub'nu maryama mathalan idhā qawmuka min'hu yaṣiddūna ","translations":["And when","is presented","(the) son","(of) Maryam","(as) an example","behold","Your people","about it","laughed aloud","(57)"],"transliterationArr":["walammā","ḍuriba","ub'nu","maryama","mathalan","idhā","qawmuka","min'hu","yaṣiddūna",null],"verseTiming":[[1,0,1620],[2,1620,2160],[3,2160,2660],[4,2660,3500],[5,3500,4250],[6,4250,4860],[7,4860,5750],[8,5750,6350],[9,6350,9155]]}}