{"name":"16:8","price":"Ал силер минишиңер үчүн жана кооздук-сулуулук үчүн (ойноктогон) аттарды, качырларды жана эшектерди (жаратты).[1] Жана силер билбеген нерселерди да жаратат.[2]","arabic":"وَٱلۡخَيۡلَ وَٱلۡبِغَالَ وَٱلۡحَمِيرَ لِتَرۡكَبُوهَا وَزِينَةٗۚ وَيَخۡلُقُ مَا لَا تَعۡلَمُونَ","category":["16 (An-Nahl)","An-Nahl","Surah An-Nahl","Chapter An-Nahl","Nahl","Surah Nahl","Chapter Nahl","An Nahl","Surah An Nahl","Chapter An Nahl","Surah 16","Chapter 16","The Bee","النَّحل"],"ayahNumber":1909,"juzNumber":14,"footnotes":"[1] Аллах бул аятта эшек, качыр жана аттарды “миниш жана кооздук үчүн” жараткандыгын айтууда.”Этин жешиңер үчүн” деген жок. Себеби, эшек менен качырдын эти желбейт. Жылкыны да этин жеш максатында союуу дурус эмес. Максат: азайып кетпесин. Эгер азайып кетүү коркунучу жок болсо, жегенден зыян (күнөө) жок.\n [2] Бул аяттагы “силер” деген сөз сахабаларга багытталган. Аллах таала келечекте сахабаларга маалым болбогон “аттарды” жаратамын деди. Ал “аттардан” максат азыркы күндөгү минүүгө, учууга, сууда сүзүүгө пайдаланылып жаткан ар түрдүү темир “аттар” болушу да мүмкүн. Аллах Билүүчү.","lang":"ky","version":{"key":"kyrgyz_hakimov","direction":"ltr","language_iso_code":"ky","version":"1.0.2","last_update":1708440100,"title":"Kyrgyz translation","description":"Translation of the meanings of the Noble Qur’an into the Kyrgyz language, translated by Shams al-Din Hakimov Abd al-Khaleq, reviewed and developed under the supervision of the Rowad Translation Center."},"meta":{"transliteration":"wal-khayla wal-bighāla wal-ḥamīra litarkabūhā wazīnatan wayakhluqu mā lā taʿlamūna ","translations":["And horses","and mules","and donkeys","for you to ride them","and (as) adornment","And He creates","what","not","you know","(8)"],"transliterationArr":["wal-khayla","wal-bighāla","wal-ḥamīra","litarkabūhā","wazīnatan","wayakhluqu","mā","lā","taʿlamūna",null],"verseTiming":[[1,0,1360],[2,1360,2740],[3,2740,4180],[4,4180,6060],[5,6060,7640],[6,7640,8800],[7,8800,9360],[8,9360,9750],[9,9750,12675]]}}