{"name":"17:78","price":"(О, Мухаммад!) Күн чак түштөн (батышка) оогондо, түн караңгысына чейин намаз оку. Жана таңдын намазын да (оку). Чынында, таңдын намазы күбө болунган (намаз).[1]","arabic":"أَقِمِ ٱلصَّلَوٰةَ لِدُلُوكِ ٱلشَّمۡسِ إِلَىٰ غَسَقِ ٱلَّيۡلِ وَقُرۡءَانَ ٱلۡفَجۡرِۖ إِنَّ قُرۡءَانَ ٱلۡفَجۡرِ كَانَ مَشۡهُودٗا","category":["17 (Al-Isra)","Al-Isra","Surah Al-Isra","Chapter Al-Isra","Isra","Surah Isra","Chapter Isra","Al Isra","Surah Al Isra","Chapter Al Isra","Surah 17","Chapter 17","The Night Journey","الإسرَاء"],"ayahNumber":2107,"juzNumber":15,"footnotes":"[1] Бул аятта Аллах таала Өз пайгамбарын беш убак намазды толук окууга буюрууда. Күн батышка оогондон кечке чейин Бешим жана Дигер (Аср) намазы, түн караңгысы бүт ааламды каптай баштаганда Шам намазы, ал эми толук каптаганда Куптан намазы окулат. Бул аяттагы Таңкы намаздын пазилет-артыкчылыгынын бири ал “Күбө болунган намаз”. Башкача айтканда бул намазга Аллах жана Күн-Түн периштелери күбө болушат. Бул намаздын арабча контекстте «Куран» деп аталганын себеби, анда башка намаздарга караганда узунураак сүрөлөр окулат.","lang":"ky","version":{"key":"kyrgyz_hakimov","direction":"ltr","language_iso_code":"ky","version":"1.0.2","last_update":1708440100,"title":"Kyrgyz translation","description":"Translation of the meanings of the Noble Qur’an into the Kyrgyz language, translated by Shams al-Din Hakimov Abd al-Khaleq, reviewed and developed under the supervision of the Rowad Translation Center."},"meta":{"transliteration":"aqimi al-ṣalata lidulūki al-shamsi ilā ghasaqi al-layli waqur'āna al-fajri inna qur'āna al-fajri kāna mashhūdan ","translations":["Establish","the prayer","at the decline","(of) the sun","till","(the) darkness","(of) the night","and Quran","at dawn","indeed","the Quran","(at) the dawn","is","ever witnessed","(78)"],"transliterationArr":["aqimi","al-ṣalata","lidulūki","al-shamsi","ilā","ghasaqi","al-layli","waqur'āna","al-fajri","inna","qur'āna","al-fajri","kāna","mashhūdan",null],"verseTiming":[[1,0,680],[2,680,1780],[3,1780,2840],[4,2840,3820],[5,3820,4400],[6,4400,5090],[7,5090,5950],[8,5950,7170],[9,7170,7920],[10,7920,9360],[11,9360,10370],[12,10370,11370],[13,11370,12020],[14,12020,13495]]}}