{"name":"20:76","price":"Түбүнөн дарыялар аккан, бейиштер бар. Алар анда түбөлүк калышат! Бул (күнөөлөрдөн жана каапырчылыктан) таза боло алгандардын сыйлыгы![1]","arabic":"جَنَّٰتُ عَدۡنٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَاۚ وَذَٰلِكَ جَزَآءُ مَن تَزَكَّىٰ","category":["20 (Ta-Ha)","Ta-Ha","Surah Ta-Ha","Chapter Ta-Ha","Ha","Surah Ha","Chapter Ha","Ta Ha","Surah Ta Ha","Chapter Ta Ha","Surah 20","Chapter 20","Ta-Ha","طه"],"ayahNumber":2424,"juzNumber":16,"footnotes":"[1] Муса далилдер менен жеңип чыкканына карабай, Фараон менен анын ойондору Исраил коомун эзип, көп «кудайларына» сыйынтууну улантышты. Муса болсо, элин Исламга (жалгыз Аллахка моюн сунууга) даават кылып, Исраил урпактарын тымызын алып чыгып кетүүнүн аракетинде болду. Исраил урпагы намаздарын жарыя окуудан корккону үчүн үйлөрүн мечит кылып алышат. Алар ээн-эркин намаз окуй турган күн келээр бекен деп эңсеп жашап жүрүштү. Убагы жетип, ошондой күн келди: Муса түндүн абалкы бөлүгүндө аларды жашыруун түрдө Мисирден сыртка чыгарып кетти. Эрте менен окуядан кабардар болгон Фараон аскерлери менен кууп, деңизге жакын жерде алардын караанын көрдү. Качкындар эмне кыларын билбей, коркуп калышты. Арт жакта Фараон, алдыда деңиз. Бирок, эмнегедир Муса катыржам. Себеби, ал Аллах Өз пайгамбарын өлүмгө салып бербешине ишенген. Ошондой болду. Аллах ага: «Таягың менен деңизге урсаң Исраил урпагынын он эки уруусу үчүн он эки жол ачылат» деп вахий жиберди. Муса буйрукту аткарганда, деңиз суусу тоо-тоо болуп түрүлүп, куп-кургак он эки жол пайда болду. Кийинки аяттар ушул окуялар жөнүндө.","lang":"ky","version":{"key":"kyrgyz_hakimov","direction":"ltr","language_iso_code":"ky","version":"1.0.2","last_update":1708440100,"title":"Kyrgyz translation","description":"Translation of the meanings of the Noble Qur’an into the Kyrgyz language, translated by Shams al-Din Hakimov Abd al-Khaleq, reviewed and developed under the supervision of the Rowad Translation Center."},"meta":{"transliteration":"jannātu ʿadnin tajrī min taḥtihā al-anhāru khālidīna fīhā wadhālika jazāu man tazakkā ","translations":["Gardens","(of) Eden","flows","from","underneath them","the rivers","abiding forever","in it","And that","(is) the reward","(for him) who","purifies himself","(76)"],"transliterationArr":["jannātu","ʿadnin","tajrī","min","taḥtihā","al-anhāru","khālidīna","fīhā","wadhālika","jazāu","man","tazakkā",null],"verseTiming":[[1,0,2390],[2,2390,3770],[3,3770,4670],[4,4670,5310],[5,5310,6650],[6,6650,8040],[7,8040,9430],[8,9430,10550],[9,10550,10760],[10,10760,14440],[11,14440,14940],[12,14940,17395]]}}