{"name":"21:80","price":"Биз Даудга силерди сокку-зыяндан сактай турган (зоот) кийимдерди жасоону үйрөттүк. Эми шүгүр кылаарсыңар?![1]","arabic":"وَعَلَّمۡنَٰهُ صَنۡعَةَ لَبُوسٖ لَّكُمۡ لِتُحۡصِنَكُم مِّنۢ بَأۡسِكُمۡۖ فَهَلۡ أَنتُمۡ شَٰكِرُونَ","category":["21 (Al-Anbiya)","Al-Anbiya","Surah Al-Anbiya","Chapter Al-Anbiya","Anbiya","Surah Anbiya","Chapter Anbiya","Al Anbiya","Surah Al Anbiya","Chapter Al Anbiya","Surah 21","Chapter 21","The Prophets","الأنبيَاء"],"ayahNumber":2563,"juzNumber":17,"footnotes":"[1] Согуштарда денени найза, жаанын огу жана кылычтан сактай турган зоот кийим Дауд пайгамбардан мурда болгон эмес. Демек, Аллах таала Дауд пайгамбар аркылуу инсаниятка чоң жакшылык берди. Бул шүгүр кылууга татыктуу нерсе. Кээ бир тафсирчилер: «Аллах темирди Даудка моюн сундургандан улам, аны камыр ийлегендей ийлеп, эч бир кыздырбай эле каалаган нерсесин жасап алчу. Бул Аллахтын Даудка берген пайгамбарлык моожизасы болчу» дешет. Мына ушундан улам «темирдин пири Дөөт» деген туура эмес түшүнүк калыптанган. Дауд эч нерсенин пири эмес. Андагы бардык касиеттер Аллах тааладан.","lang":"ky","version":{"key":"kyrgyz_hakimov","direction":"ltr","language_iso_code":"ky","version":"1.0.2","last_update":1708440100,"title":"Kyrgyz translation","description":"Translation of the meanings of the Noble Qur’an into the Kyrgyz language, translated by Shams al-Din Hakimov Abd al-Khaleq, reviewed and developed under the supervision of the Rowad Translation Center."},"meta":{"transliteration":"waʿallamnāhu ṣanʿata labūsin lakum lituḥ'ṣinakum min basikum fahal antum shākirūna ","translations":["And We taught him","(the) making","(of) coats of armor","for you","to protect you","from","your battle","Then will","you","(be) grateful","(80)"],"transliterationArr":["waʿallamnāhu","ṣanʿata","labūsin","lakum","lituḥ'ṣinakum","min","basikum","fahal","antum","shākirūna",null],"verseTiming":[[1,0,1720],[2,1720,2600],[3,2600,3460],[4,3460,4130],[5,4130,5960],[6,5960,7030],[7,7030,8400],[8,8400,8940],[9,8940,10430],[10,10430,13475]]}}