{"name":"22:39","price":"(Каапырлар тарабынан) чабуулга туш болгон (ыймандуу) адамдарга, зулумдук көргөндөрү себептүү (душмандарына каршы согушууга) уруксат берилди. Албетте, Аллах аларга жардам берүүгө кудуреттүү![1]","arabic":"أُذِنَ لِلَّذِينَ يُقَٰتَلُونَ بِأَنَّهُمۡ ظُلِمُواْۚ وَإِنَّ ٱللَّهَ عَلَىٰ نَصۡرِهِمۡ لَقَدِيرٌ","category":["22 (Al-Hajj)","Al-Hajj","Surah Al-Hajj","Chapter Al-Hajj","Hajj","Surah Hajj","Chapter Hajj","Al Hajj","Surah Al Hajj","Chapter Al Hajj","Surah 22","Chapter 22","The Pilgrimage","الحَجّ"],"ayahNumber":2634,"juzNumber":17,"footnotes":"[1] Бул мусулмандарды эң алгачкы ирет согушка буюрган аят. Алар Мединага көчүп (хижрат кылып) өзүнчө ислам мамлекетин курап, күч кубатка ээ болгонго чейин Мекке мушриктеринен көп зулумдук көрүштү. Мединага көчүп келгенден кийин деле кордуктар токтободу. Сабыры түгөнгөн сахабалар пайгамбарыбызга келип; «Согушпайлыбы, биз деле?!» деп кайра-кайра суроо-талап коюшса да, ал: «Аллахтан буйрук келмейинче согуш жок» деп жооп берчү. Акыр акыбетте зарыктырган, өч алууну сагынткан уруксат ушинтип келген.","lang":"ky","version":{"key":"kyrgyz_hakimov","direction":"ltr","language_iso_code":"ky","version":"1.0.2","last_update":1708440100,"title":"Kyrgyz translation","description":"Translation of the meanings of the Noble Qur’an into the Kyrgyz language, translated by Shams al-Din Hakimov Abd al-Khaleq, reviewed and developed under the supervision of the Rowad Translation Center."},"meta":{"transliteration":"udhina lilladhīna yuqātalūna bi-annahum ẓulimū wa-inna al-laha ʿalā naṣrihim laqadīrun ","translations":["Permission is given","to those who","are being fought","because they","were wronged","And indeed","Allah","for","their victory","(is) surely Able","(39)"],"transliterationArr":["udhina","lilladhīna","yuqātalūna","bi-annahum","ẓulimū","wa-inna","al-laha","ʿalā","naṣrihim","laqadīrun",null],"verseTiming":[[1,0,700],[2,700,1960],[3,1960,3560],[4,3560,5670],[5,5670,6780],[6,6780,8730],[7,8730,9690],[8,9690,10400],[9,10400,11500],[10,11500,14105]]}}