{"name":"25:21","price":"Бизге жолугууну үмүт кылбаган (ыймансыз) адамдар «Эгер бизге периште түшсө же Раббибизди (өз көзүбүз менен) көрсөк (ошондо гана ыйман келтирмекпиз)» - дешет.[1] Алар өздөрүнчө текеберленип жана аябай таш-жүрөк болуп кетишкен.","arabic":"۞ وَقَالَ ٱلَّذِينَ لَا يَرۡجُونَ لِقَآءَنَا لَوۡلَآ أُنزِلَ عَلَيۡنَا ٱلۡمَلَٰٓئِكَةُ أَوۡ نَرَىٰ رَبَّنَاۗ لَقَدِ ٱسۡتَكۡبَرُواْ فِيٓ أَنفُسِهِمۡ وَعَتَوۡ عُتُوّٗا كَبِيرٗا","category":["25 (Al-Furqan)","Al-Furqan","Surah Al-Furqan","Chapter Al-Furqan","Furqan","Surah Furqan","Chapter Furqan","Al Furqan","Surah Al Furqan","Chapter Al Furqan","Surah 25","Chapter 25","The Criterion","الفُرقان"],"ayahNumber":2876,"juzNumber":19,"footnotes":"[1] Алар «бизге периштеден пайгамбар келсе, же адам пайгамбардын жанында периште жардамчысы болмоюнча жана Аллах бизге көрүнмөйүнчө Мухаммадка ыйман келтирбейбиз» дешти. Эми, алардын ыйман келтириши үчүн Аллахтын Өзү келип, «Мухаммадды мен жибергеним ырас» деп тастыктап кетиши керек экен. Бул алардын жүрөгүнөн чыккан сөз эмес. Алар периштелерди, өздөрүнө тастыктоочу же пайгамбар болуп келгенин эч качан көрүшпөйт. Көргөн мезгилде башкачараак абалда көрүшөт: 1) Жан алгыч периште келип, кыйнап, жанын сууруп жатканда, 2) Мүрзөгө коюлганда Мункар жана Накир деген эки периште суракка тартканда, тили сөзгө келбей, чулдурап калгандан кийин баштарына союл менен чаап азап беришкенде, 3) Кайра тирилгенде беттери менен сүйрөп, түртүп, кордоп, сурак майданына периштелер айдап барганда, 4) Тозок периштелери жан ооруткан азаптын түрүн көргөзгөндө.","lang":"ky","version":{"key":"kyrgyz_hakimov","direction":"ltr","language_iso_code":"ky","version":"1.0.2","last_update":1708440100,"title":"Kyrgyz translation","description":"Translation of the meanings of the Noble Qur’an into the Kyrgyz language, translated by Shams al-Din Hakimov Abd al-Khaleq, reviewed and developed under the supervision of the Rowad Translation Center."},"meta":{"transliteration":"waqāla alladhīna lā yarjūna liqāanā lawlā unzila ʿalaynā al-malāikatu aw narā rabbanā laqadi is'takbarū fī anfusihim waʿataw ʿutuwwan kabīran ","translations":["And said","those who","(do) not","expect","(the) meeting with Us","Why not","are sent down","to us","the Angels","or","we see","our Lord","Indeed","they have become arrogant","within","themselves","and (become) insolent","(with) insolence","great","(21)"],"transliterationArr":["waqāla","alladhīna","lā","yarjūna","liqāanā","lawlā","unzila","ʿalaynā","al-malāikatu","aw","narā","rabbanā","laqadi","is'takbarū","fī","anfusihim","waʿataw","ʿutuwwan","kabīran",null],"verseTiming":[[1,0,820],[2,820,1850],[3,1850,2300],[4,2300,3420],[5,3420,6019],[6,6019,8159],[7,8159,9409],[8,9409,10219],[9,10219,12949],[10,12949,13219],[11,13219,13969],[12,13969,14689],[13,14689,16089],[14,16089,17269],[15,17269,19159],[16,19159,21039],[17,21039,21779],[18,21779,23139],[19,23139,25264]]}}