{"name":"2:153","price":"Оо, момундар! (диний жана дүйнөлүк ишиңерде) сабыр жана намаз[1] менен кубаттангыла! Албетте, Аллах, сабырдуулар менен бирге.","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱسۡتَعِينُواْ بِٱلصَّبۡرِ وَٱلصَّلَوٰةِۚ إِنَّ ٱللَّهَ مَعَ ٱلصَّٰبِرِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":160,"juzNumber":2,"footnotes":"[1] Намаз – диндин түркүгү, момундардын нуру жана пенде менен Аллахты байланыштырып турган “ыйык көпүрө”. Эгер адам баласы намазды бардык талаптары менен аткарса, анда “хузур” деген нерсе пайда болот. “Хузур” – бул намаздын маңызы. “Хузур” абалына кирүү үчүн адамдын жүрөгү “Мен Раббимдин хузурунда (алдында) олтурам” деп сезиш керек. Ошондо, анын жүрөгү ойгоо болот. Намаздагы ар бир сөз, ар бир кыймыл аракеттин маанисин түшүнөт. Раббисине кулдук макаамында (даражасында) туруп, өз муктаждыктарын жалбарып сурайт. Мындай намаз адамга чоң жардам (кубат) берет жана адамды жаман жөрөлгөлөрдөн кайтарат.","lang":"ky","version":{"key":"kyrgyz_hakimov","direction":"ltr","language_iso_code":"ky","version":"1.0.2","last_update":1708440100,"title":"Kyrgyz translation","description":"Translation of the meanings of the Noble Qur’an into the Kyrgyz language, translated by Shams al-Din Hakimov Abd al-Khaleq, reviewed and developed under the supervision of the Rowad Translation Center."},"meta":{"transliteration":"yāayyuhā alladhīna āmanū is'taʿīnū bil-ṣabri wal-ṣalati inna al-laha maʿa al-ṣābirīna ","translations":["O you","who","believe[d]","Seek help","through patience","and the prayer","Indeed","Allah","(is) with","the patient ones","(153)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","is'taʿīnū","bil-ṣabri","wal-ṣalati","inna","al-laha","maʿa","al-ṣābirīna",null],"verseTiming":[[1,0,2700],[2,2700,3740],[3,3740,4460],[4,4460,5620],[5,5620,6560],[6,6560,7320],[7,7320,9180],[8,9180,10220],[9,10220,11090],[10,11090,11470],[11,11470,14475]]}}