{"name":"2:150","price":"Кай тараптан чыксаң да, жүзүңдү “Аль-Харам” мечити тарапка бур! Силер дагы (оо, момундар,) үстүңөрдөн адамдарга далил болуп калбаш үчүн, кай жерде болсоңор да жүзүңөрдү ал тарапка бургула! Ал эми, алардын арасынан заалым болуп бүткөн адамдар (далилге деле карабай, бузук сөздөрүн тарата беришет). Алардан коркпогула, Мен силерге жакшылыктарымды толук кылып берүүм үчүн жана туура жолго багыт алууңар үчүн Менден гана корккула![1]","arabic":"وَمِنۡ حَيۡثُ خَرَجۡتَ فَوَلِّ وَجۡهَكَ شَطۡرَ ٱلۡمَسۡجِدِ ٱلۡحَرَامِۚ وَحَيۡثُ مَا كُنتُمۡ فَوَلُّواْ وُجُوهَكُمۡ شَطۡرَهُۥ لِئَلَّا يَكُونَ لِلنَّاسِ عَلَيۡكُمۡ حُجَّةٌ إِلَّا ٱلَّذِينَ ظَلَمُواْ مِنۡهُمۡ فَلَا تَخۡشَوۡهُمۡ وَٱخۡشَوۡنِي وَلِأُتِمَّ نِعۡمَتِي عَلَيۡكُمۡ وَلَعَلَّكُمۡ تَهۡتَدُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":157,"juzNumber":2,"footnotes":"[1] Аллах таала ыймандуулардын арасынан бекем ишенимдегилерди тандап алуу үчүн жана Өзүнө гана белгилүү себептерден улам Иерусалимди убактылуу кыбыла кылып бергенде, өчөшкөн дин душмандары, пайгамбарга каршы чоң далил таап алгансып: \"ал кантип Ибрахимдин дининдемин деп жүрөт? Анда Ибрахимдин жана Исмаилдин кыбласы (Кааба) бул жакта калып, Иерусалимге (Байтул Макдиске) карап намаз окуганы эмнеси - ыя?!\" деп чуу көтөрүшкөн. Бирок, Аллах таала кыбыланы кайрадан Каабага буруп берүү менен яхуди, христиан жана мушриктерден турган дин душмандарынын \"далилдерин\" жокко чыгарды. Бирок, кээ бир жүрөгүндө былыгы бар залым адамдар тынчып калган жок. Себеби, аларга далил таасир этпейт. Яхудилер, мунафыктар жана мушриктер кыбыланы алмаштыруунун тегерегинде чынында, аябай чоң фитна чыгарып жиберишкен. Ошондуктан, Аллах бул маселени мусулмандарга өтө кылдаттык менен, кайра-кайра кайталап чечип берди жана дин душмандарынын ызы-чуусунан коркпой, Өзүнөн гана коркууга буюрду. Ошондо гана аларга Аллахтын жакшылыктары толук берилмек. Ошондо гана алар дин жолунда адашпай туура жүрүшмөк.","lang":"ky","version":{"key":"kyrgyz_hakimov","direction":"ltr","language_iso_code":"ky","version":"1.0.2","last_update":1708440100,"title":"Kyrgyz translation","description":"Translation of the meanings of the Noble Qur’an into the Kyrgyz language, translated by Shams al-Din Hakimov Abd al-Khaleq, reviewed and developed under the supervision of the Rowad Translation Center."},"meta":{"transliteration":"wamin ḥaythu kharajta fawalli wajhaka shaṭra al-masjidi al-ḥarāmi waḥaythu mā kuntum fawallū wujūhakum shaṭrahu li-allā yakūna lilnnāsi ʿalaykum ḥujjatun illā alladhīna ẓalamū min'hum falā takhshawhum wa-ikh'shawnī wali-utimma niʿ'matī ʿalaykum walaʿallakum tahtadūna ","translations":["And from","wherever","you start forth","[so] turn","your face","(in the) direction","(of) Al-Masjid","Al-Haraam","And wherever","that","you (all) are","[so] turn","your faces","(in) its direction","so that not","will be","for the people","against you","any argument","except","those who","wronged","among them","so (do) not","fear them","but fear Me","And that I complete","My favor","upon you","[and] so that you may","(be) guided","(150)"],"transliterationArr":["wamin","ḥaythu","kharajta","fawalli","wajhaka","shaṭra","al-masjidi","al-ḥarāmi","waḥaythu","mā","kuntum","fawallū","wujūhakum","shaṭrahu","li-allā","yakūna","lilnnāsi","ʿalaykum","ḥujjatun","illā","alladhīna","ẓalamū","min'hum","falā","takhshawhum","wa-ikh'shawnī","wali-utimma","niʿ'matī","ʿalaykum","walaʿallakum","tahtadūna",null],"verseTiming":[[1,0,700],[2,700,1270],[3,1270,2040],[4,2040,2830],[5,2830,3560],[6,3560,4030],[7,4030,5110],[8,5110,7070],[9,7070,8310],[10,8310,8640],[11,8640,10290],[12,10290,11440],[13,11440,12410],[14,12410,13400],[15,13400,14380],[16,14380,15190],[17,15190,16560],[18,16560,17540],[19,17540,18530],[20,18530,19060],[21,19060,20010],[22,20010,20800],[23,20800,21580],[24,21580,22130],[25,22130,23440],[26,23440,25010],[27,25010,25570],[28,25570,26840],[29,26840,28040],[30,28040,29710],[31,29710,30630],[32,30630,31680],[33,31680,33010],[34,33010,35765]]}}