{"name":"2:169","price":"Шайтан силерди жаман, бузук иштерге жана Аллах жөнүндө билбеген нерсеңерди сүйлөөгө буюрат.[1]","arabic":"إِنَّمَا يَأۡمُرُكُم بِٱلسُّوٓءِ وَٱلۡفَحۡشَآءِ وَأَن تَقُولُواْ عَلَى ٱللَّهِ مَا لَا تَعۡلَمُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":176,"juzNumber":2,"footnotes":"[1] Аллах жөнүндө билбей сүйлөгөн адамдар төмөндөгүлөр: 1) Ким Аллахты Өзү жана пайгамбары сыпаттабаган сыпат менен сыпаттаса же Өзү жана пайгамбары атаган сыпат менен атабаса – Аллах жөнүндө билбей сүйлөгөн болот. 2) Ким “Аллахтын теңдеши, шериги, баласы бар» десе – Аллах жөнүндө билбей сүйлөгөн болот. 3) Ким “олуя кишилердин арбактары алардан жардам сураган кишини Аллахка жакындаштырат” деп тастыктаса – Аллах жөнүндө билбей сүйлөгөн болот. 4) Ким Курандан же хадистен далилин билбей туруп, “Аллах палан нерсени адал кылган, түкүнчө нерсени арам кылган” деген сыяктуу сөздөрдү сүйлөсө – Аллах жөнүндө билбей сүйлөгөн болот. 5) Ким Куран же сахих хадистен далили болбой туруп: “Аллах паландай макулукту түкүндөй максат менен жаратты” десе – Аллах жөнүндө билбей сүйлөгөн болот. 6) Ким Аллахтын жана элчисинин сөздөрүн өз оюна ылайыктап таавил кылып (бурмалап) сүйлөсө – Аллах жөнүндө билбей сүйлөгөн болот.","lang":"ky","version":{"key":"kyrgyz_hakimov","direction":"ltr","language_iso_code":"ky","version":"1.0.2","last_update":1708440100,"title":"Kyrgyz translation","description":"Translation of the meanings of the Noble Qur’an into the Kyrgyz language, translated by Shams al-Din Hakimov Abd al-Khaleq, reviewed and developed under the supervision of the Rowad Translation Center."},"meta":{"transliteration":"innamā yamurukum bil-sūi wal-faḥshāi wa-an taqūlū ʿalā al-lahi mā lā taʿlamūna ","translations":["Only","he commands you","to (do) the evil","and the shameful","and that","you say","about","Allah","what","not","you know","(169)"],"transliterationArr":["innamā","yamurukum","bil-sūi","wal-faḥshāi","wa-an","taqūlū","ʿalā","al-lahi","mā","lā","taʿlamūna",null],"verseTiming":[[1,0,1590],[2,1590,3090],[3,3090,5430],[4,5430,8140],[5,8140,9190],[6,9190,10360],[7,10360,10720],[8,10720,11500],[9,11500,11870],[10,11870,12220],[11,12220,14375]]}}