{"name":"2:89","price":"Качан аларга Аллахтан өздөрүндө болгон нерсени (Тооратты) тастыктаган бир китеп (Куран) келгенде жана мындан мурун каапырларга (араб мушриктерине) каршы (дал ушул китеп жана ушул пайгамбардан) жардам күтүп жатышкан болчу. Анан, качан аларга өздөрү таанып-билген нерсе келгенде, ага каапыр болушту![1] Каапырларга Аллахтын наалаты болсун!","arabic":"وَلَمَّا جَآءَهُمۡ كِتَٰبٞ مِّنۡ عِندِ ٱللَّهِ مُصَدِّقٞ لِّمَا مَعَهُمۡ وَكَانُواْ مِن قَبۡلُ يَسۡتَفۡتِحُونَ عَلَى ٱلَّذِينَ كَفَرُواْ فَلَمَّا جَآءَهُم مَّا عَرَفُواْ كَفَرُواْ بِهِۦۚ فَلَعۡنَةُ ٱللَّهِ عَلَى ٱلۡكَٰفِرِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":96,"juzNumber":1,"footnotes":"[1] Медина яхудилери Тооратта алдын ала кабар берилген пайгамбарды жакын арада биздин арабыздан чыгат деп күтүп жатышкан. Анткени, алар эгер араб мушриктери менен согушуп калчу болсо, «жакында биздин арабыздан бир пайгамбар чыгат. Биз ошол пайгамбар менен келип, силерге көргүлүктү көргөзөбүз» деп коркутушчу. Анан ошол – өздөрү күткөн, тааныган пайгамбар өздөрүнүн (хижаздыктардын) арасынан, чыкты. Бирок улуту яхуди эмес, араб (Мухаммад) эле. Ага Аллах таала Куран китебин түшүрдү. «Аларга Аллахтын алдынан өздөрүндө болгон нерсени (Тооратты) тастыктаган бир китеп (жана пайгамбар) келди». Бирок..., яхудилер кечээ гана өздөрү өтө ынтызарлык менен күтүп жаткан пайгамбардан жана ага түшүрүлгөн Курандан жүз бурушту жана каапыр болушту.","lang":"ky","version":{"key":"kyrgyz_hakimov","direction":"ltr","language_iso_code":"ky","version":"1.0.2","last_update":1708440100,"title":"Kyrgyz translation","description":"Translation of the meanings of the Noble Qur’an into the Kyrgyz language, translated by Shams al-Din Hakimov Abd al-Khaleq, reviewed and developed under the supervision of the Rowad Translation Center."},"meta":{"transliteration":"walammā jāahum kitābun min ʿindi al-lahi muṣaddiqun limā maʿahum wakānū min qablu yastaftiḥūna ʿalā alladhīna kafarū falammā jāahum mā ʿarafū kafarū bihi falaʿnatu al-lahi ʿalā al-kāfirīna ","translations":["And when","came to them","a Book","of","from","Allah","confirming","what (was)","with them","though they used to","from","before","(that), pray for victory","over","those who","disbelieved ","then when","came to them","what","they recognized","they disbelieved","in it","So (the) curse","(of) Allah","(is) on","the disbelievers","(89)"],"transliterationArr":["walammā","jāahum","kitābun","min","ʿindi","al-lahi","muṣaddiqun","limā","maʿahum","wakānū","min","qablu","yastaftiḥūna","ʿalā","alladhīna","kafarū","falammā","jāahum","mā","ʿarafū","kafarū","bihi","falaʿnatu","al-lahi","ʿalā","al-kāfirīna",null],"verseTiming":[[1,0,1520],[2,1520,3720],[3,3720,4630],[4,4630,5670],[5,5670,6930],[6,6930,7630],[7,7630,8600],[8,8600,9360],[9,9360,10140],[10,10140,11212],[11,11212,12285],[12,12285,12928],[13,12928,14263],[14,14263,14590],[15,14590,15560],[16,15560,16230],[17,16230,17760],[18,17760,20190],[19,20190,20920],[20,20920,21700],[21,21700,22480],[22,22480,23250],[23,23250,24240],[24,24240,24980],[25,24980,25330],[26,25330,28265]]}}