{"name":"31:13","price":"Бир кезде Лукман[1] баласына насаат кылып, (мындай) деди: «Оо, балам Аллахка шерик кошпогун! Чындыгында ширк деген – бул чоң зулум!","arabic":"وَإِذۡ قَالَ لُقۡمَٰنُ لِٱبۡنِهِۦ وَهُوَ يَعِظُهُۥ يَٰبُنَيَّ لَا تُشۡرِكۡ بِٱللَّهِۖ إِنَّ ٱلشِّرۡكَ لَظُلۡمٌ عَظِيمٞ","category":["31 (Luqman)","Luqman","Surah Luqman","Chapter Luqman","Surah 31","Chapter 31","Luqman","لقمَان"],"ayahNumber":3482,"juzNumber":21,"footnotes":"[1] Лукман көпчүлүк тафсирчи улумалардын пикири боюнча пайгамбар эмес, даанышмандыгы менен гана атактуу болгон киши. Даанышмандык бул аалымдыктан жогорку даража. Даанышман адам иштердин өтө назик, кылдат сырларын (келечектен башка) билип турат. Иштердин, пейилдердин, сөздөрдүн ордун билет, билгенине дайым амал кылат. Сөзү менен иши бир болот. Аллах Лукманга ушул касиетти (нээматты) берип: «Шүгүр кыл» деп буюрууда. Шүгүр - бул нээмат Ээсине (нээмат бергенге) ыраазычылык билдирүү. Ал эми, Аллахга ыраазычылык билдирүү Анын жалгыз Өзүнө ибадат кылуу менен гана болот.","lang":"ky","version":{"key":"kyrgyz_hakimov","direction":"ltr","language_iso_code":"ky","version":"1.0.2","last_update":1708440100,"title":"Kyrgyz translation","description":"Translation of the meanings of the Noble Qur’an into the Kyrgyz language, translated by Shams al-Din Hakimov Abd al-Khaleq, reviewed and developed under the supervision of the Rowad Translation Center."},"meta":{"transliteration":"wa-idh qāla luq'mānu li-ib'nihi wahuwa yaʿiẓuhu yābunayya lā tush'rik bil-lahi inna al-shir'ka laẓul'mun ʿaẓīmun ","translations":["And when","said","Luqman","to his son","while he","(was) instructing him","O my son","(Do) not","associate partners","with Allah","Indeed","associating partners","(is) surely an injustice","great","(13)"],"transliterationArr":["wa-idh","qāla","luq'mānu","li-ib'nihi","wahuwa","yaʿiẓuhu","yābunayya","lā","tush'rik","bil-lahi","inna","al-shir'ka","laẓul'mun","ʿaẓīmun",null],"verseTiming":[[1,0,650],[2,650,1210],[3,1210,2090],[4,2090,3080],[5,3080,3660],[6,3660,4690],[7,4690,5950],[8,5950,6270],[9,6270,7070],[10,7070,9890],[11,9890,11040],[12,11040,11860],[13,11860,12810],[14,12810,15855]]}}