{"name":"33:4","price":"Аллах эч бир адамдын көкүрөгүндө эки жүрөк жараткан эмес (ошол сыяктуу эле) силер «зихар»[1] кылган жубайыңарды силерге эне кылып койгон жок. Жана силердин бакма балаңарды өз перзентиңер(дей) кылган жок. Бул силердин оозуңардагы гана сөзүңөр. Аллах акыйкатты гана сүйлөйт. Жана Ал (эң туура) жолго баштайт.[2]","arabic":"مَّا جَعَلَ ٱللَّهُ لِرَجُلٖ مِّن قَلۡبَيۡنِ فِي جَوۡفِهِۦۚ وَمَا جَعَلَ أَزۡوَٰجَكُمُ ٱلَّٰٓـِٔي تُظَٰهِرُونَ مِنۡهُنَّ أُمَّهَٰتِكُمۡۚ وَمَا جَعَلَ أَدۡعِيَآءَكُمۡ أَبۡنَآءَكُمۡۚ ذَٰلِكُمۡ قَوۡلُكُم بِأَفۡوَٰهِكُمۡۖ وَٱللَّهُ يَقُولُ ٱلۡحَقَّ وَهُوَ يَهۡدِي ٱلسَّبِيلَ","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab","Chapter Al-Ahzab","Ahzab","Surah Ahzab","Chapter Ahzab","Al Ahzab","Surah Al Ahzab","Chapter Al Ahzab","Surah 33","Chapter 33","The Combined Forces","الأحزَاب"],"ayahNumber":3537,"juzNumber":21,"footnotes":"[1] «Зихар» - бул бир кишинин өз аялына «Сенин көкүрөгүң (же белиң, же балтырың, же билегиң) апамдыкына окшойт экен» - деп, анын бир уяттуу жерин апасыныкына окшотуу. Исламдан илгери арабтар, эгер бир киши аялын «зихар» кылса «Эми аялың сага апа болуп калды» - деп өкүм чыгарып жүрүшкөн. Аллах бул аят менен Исламга чейинки доордон калган «зихарды да», «зихар» себептүү араб мушриктери чыгарган өкүмдү да жокко чыгарды. Бир адамда бир эле жүрөк болгондой, бир эле эне болот. Эгер шайтан азгырып аялын «зихар» кылса, тообо кылып, каффаарат төлөп жашай берет, талак түшпөйт.\n[2] Исламга чейинки доорунун мыйзамы боюнча бакма бала өзүнүн канынан жаралган перзент катары кабыл алынып, багып алган атанын ысымын алып, анын өз перзенти сыяктуу мурас алуу укугуна да ээ болгон. Аллах бул аятта ушул эрежени да бекер кылды. Эми Ислам өкүмү боюнча бакма бала анын ысымын көтөрбөйт. Бул дүйнөгө келүүсүнө себеп болгон атасынын аты менен «Баланчанын баласы» деп аталат. Аллахтын ушул жолу - Акыйкат жана эң туура жол.","lang":"ky","version":{"key":"kyrgyz_hakimov","direction":"ltr","language_iso_code":"ky","version":"1.0.2","last_update":1708440100,"title":"Kyrgyz translation","description":"Translation of the meanings of the Noble Qur’an into the Kyrgyz language, translated by Shams al-Din Hakimov Abd al-Khaleq, reviewed and developed under the supervision of the Rowad Translation Center."},"meta":{"transliteration":"mā jaʿala al-lahu lirajulin min qalbayni fī jawfihi wamā jaʿala azwājakumu allāī tuẓāhirūna min'hunna ummahātikum wamā jaʿala adʿiyāakum abnāakum dhālikum qawlukum bi-afwāhikum wal-lahu yaqūlu al-ḥaqa wahuwa yahdī al-sabīla ","translations":["Not","Allah (has) made","Allah (has) made","for any man","[of]","two hearts","in","his interior","And not","He (has) made","your wives","whom","you declare unlawful","[of them]","(as) your mothers","And not","He has made","your adopted sons","your sons","That","(is) your saying","by your mouths","but Allah","says","the truth","and He","guides","(to) the Way","(4)"],"transliterationArr":["mā","jaʿala","al-lahu","lirajulin","min","qalbayni","fī","jawfihi","wamā","jaʿala","azwājakumu","allāī","tuẓāhirūna","min'hunna","ummahātikum","wamā","jaʿala","adʿiyāakum","abnāakum","dhālikum","qawlukum","bi-afwāhikum","wal-lahu","yaqūlu","al-ḥaqa","wahuwa","yahdī","al-sabīla",null],"verseTiming":[[1,0,400],[2,400,930],[3,930,1850],[4,1850,2690],[5,2690,4670],[6,4670,5590],[7,5590,6020],[8,6020,7180],[9,7180,7720],[10,7720,8410],[11,8410,9720],[12,9720,12090],[13,12090,13490],[14,13490,15100],[15,15100,17670],[16,17670,18250],[17,18250,18930],[18,18930,22070],[19,22070,25030],[20,25030,26000],[21,26000,27580],[22,27580,29410],[23,29410,30370],[24,30370,31190],[25,31190,32000],[26,32000,32470],[27,32470,33120],[28,33120,36025]]}}