{"name":"33:69","price":"Оо, ыйман келтиргендер! Силер (Мухаммадка мамиле кылганда) Мусаны иренжиткен адамдар сыяктуу болбогула! Анан Аллах аны (Мусаны) алар айткан сөздөн аруулаган.[1] (Себеби) Ал Аллахтын алдында урматтуу (пайгамбар).","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَكُونُواْ كَٱلَّذِينَ ءَاذَوۡاْ مُوسَىٰ فَبَرَّأَهُ ٱللَّهُ مِمَّا قَالُواْۚ وَكَانَ عِندَ ٱللَّهِ وَجِيهٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab","Chapter Al-Ahzab","Ahzab","Surah Ahzab","Chapter Ahzab","Al Ahzab","Surah Al Ahzab","Chapter Al Ahzab","Surah 33","Chapter 33","The Combined Forces","الأحزَاب"],"ayahNumber":3602,"juzNumber":22,"footnotes":"[1] Муса алейхи салам ыйбалуу адам болгондуктан эч кимге денесин көргөзбөйт болчу. Муну жүрөгү бузук адамдар башкача жоромолдошуп «Муса жумурткасы чоңойуп кеткен ооруга жолуккан же болбосо, денеси ак (ала) болуп калган. Ошондуктан денесин элден жашырат» деп ушак таратып жиберишкен. Күндөрдүн биринде Муса ээн жерде жуунуп бүтүп, эми чапанын алайын десе..., үстүнө чапанын койгон чоң таш качып баратыптыр! «Эй, таш, токто!» деп кууп кете берип, ошол бойдон коому чогулуп турган жерге барып калганын билбей калыптыр. Таш ошондо гана токтоп, Муса болсо өзүн элейип тиктеп турган элден уялып, денесин жапканга шашыптыр. Аллах, Өз пайгамбарын ушакчылардын уу сөзүнөн ушинтип аруулаган экен.","lang":"ky","version":{"key":"kyrgyz_hakimov","direction":"ltr","language_iso_code":"ky","version":"1.0.2","last_update":1708440100,"title":"Kyrgyz translation","description":"Translation of the meanings of the Noble Qur’an into the Kyrgyz language, translated by Shams al-Din Hakimov Abd al-Khaleq, reviewed and developed under the supervision of the Rowad Translation Center."},"meta":{"transliteration":"yāayyuhā alladhīna āmanū lā takūnū ka-alladhīna ādhaw mūsā fabarra-ahu al-lahu mimmā qālū wakāna ʿinda al-lahi wajīhan ","translations":["O you who believe","O you who believe","O you who believe","(Do) not","be","like those who","abused","Musa","then Allah cleared him","then Allah cleared him","of what","they said","And he was","near","Allah","honorable","(69)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","lā","takūnū","ka-alladhīna","ādhaw","mūsā","fabarra-ahu","al-lahu","mimmā","qālū","wakāna","ʿinda","al-lahi","wajīhan",null],"verseTiming":[[1,0,2440],[2,2440,3380],[3,3380,4380],[4,4380,4760],[5,4760,5710],[6,5710,6930],[7,6930,7660],[8,7660,8380],[9,8380,9560],[10,9560,10340],[11,10340,11450],[12,11450,12440],[13,12440,13580],[14,13580,14770],[15,14770,15620],[16,15620,16695]]}}