{"name":"3:127","price":"(Бадрдагы бул жеңиш) каапырлардын бир ныптасын кесип, (бир сыйра) эзип, (канчалык ачуулары келсе да) үмүтсүз абалда кайтып кетүүлөрү үчүн (берилди).[1]","arabic":"لِيَقۡطَعَ طَرَفٗا مِّنَ ٱلَّذِينَ كَفَرُوٓاْ أَوۡ يَكۡبِتَهُمۡ فَيَنقَلِبُواْ خَآئِبِينَ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":420,"juzNumber":4,"footnotes":"[1] Бир жолу талкаланып кеткен мушриктер кайрадан күч жыйнап “Ухуд” согушу үчүн келишет. Пайгамбарыбыз кайрадан (121-аятта айтылгандай) Мединадан чыгып, өз аскерлерин майдандарга эң жакшы орноштурат. Бирок, ал көргөзгөн согуш орундарында бекем турбагандыктан жана айтылган сөзгө кулак салбагандыктан улам бул ирет мусулмандар жеңилип, улук пайгамбардын тиштери сынып, чыкыйы жарылат. Бул согушта мушриктердин жеңилбей, аман кеткендеринин дагы бир сыры, кийин ал мушриктердин көпчүлүгү Исламга кирет. Аллах алардын тообаларын кабыл алат жана күнөөлөрүн кечирет. Ошентип, ошол согуштан кийин пайгамбарыбыз саллаллоху алайхи ва саллам каапырлардын жеңип кеткенине өкүнүп, “Өз пайгамбарынын бетин жардырып, тишин сындыртып отурган коом кантип жеңишке жетмек!” - деп, коомунан наалып, Абу Суфян, Сафван бин Умайя, Хаарис бин Хаашим сыяктуу мушриктердин жетекчилерин каргап, каңырыгы түтөп отурганда ушул аят түшөт.","lang":"ky","version":{"key":"kyrgyz_hakimov","direction":"ltr","language_iso_code":"ky","version":"1.0.2","last_update":1708440100,"title":"Kyrgyz translation","description":"Translation of the meanings of the Noble Qur’an into the Kyrgyz language, translated by Shams al-Din Hakimov Abd al-Khaleq, reviewed and developed under the supervision of the Rowad Translation Center."},"meta":{"transliteration":"liyaqṭaʿa ṭarafan mina alladhīna kafarū aw yakbitahum fayanqalibū khāibīna ","translations":["That He may cut off","a part","of","those who","disbelieved","or","suppress them","so (that) they turn back","disappointed","(127)"],"transliterationArr":["liyaqṭaʿa","ṭarafan","mina","alladhīna","kafarū","aw","yakbitahum","fayanqalibū","khāibīna",null],"verseTiming":[[1,0,1220],[2,1220,1870],[3,1870,2870],[4,2870,3990],[5,3990,6130],[6,6130,6510],[7,6510,7920],[8,7920,9840],[9,9840,14325]]}}