{"name":"3:41","price":"(Закария) айтты: “О, Раббим! (жүрөгүм тынчтанып, санаасыз болушум үчүн) мага (кемпиримдин боюнда болгонун билдирген) бир сыр - белги бере көр!” (Аллах) Айтты: “Сенин белгиң: (тилден калып) үч күн адамдарга ишаарат менен гана сүйлөп каласың.[1] Эми, Раббиңди көп зикир кыл жана эртели-кеч Аны даңктап, тасбих айт!”\n(Кийинки аятта Аллах таала Имрандын кызы Марямдын окуясын улантат. Ошентип, Марям кыз чоңойгондо ибадатта, тазалык-такыбаада эң бир жогорку даражага жетет).","arabic":"قَالَ رَبِّ ٱجۡعَل لِّيٓ ءَايَةٗۖ قَالَ ءَايَتُكَ أَلَّا تُكَلِّمَ ٱلنَّاسَ ثَلَٰثَةَ أَيَّامٍ إِلَّا رَمۡزٗاۗ وَٱذۡكُر رَّبَّكَ كَثِيرٗا وَسَبِّحۡ بِٱلۡعَشِيِّ وَٱلۡإِبۡكَٰرِ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":334,"juzNumber":3,"footnotes":"[1] Ошол аяндан соң Закария үч күн тилден калып, ишаарат менен гана сүйлөшө баштады. Бирок, адамдарга сүйлөгөнгө айланбаган тили Аллахты зикир кылганда, тасбих (даңктоо сөздөрү) айтканда кадимкидей эле сөзгө келе берди. Демек, Аллах ошондо Закарияга эки сыр-белги берген экен: биринчиси - үч күн тилден калуусу, экинчиси - сакоо (дудук) тилинин Аллахты эскергенде сүйлөп калышы.","lang":"ky","version":{"key":"kyrgyz_hakimov","direction":"ltr","language_iso_code":"ky","version":"1.0.2","last_update":1708440100,"title":"Kyrgyz translation","description":"Translation of the meanings of the Noble Qur’an into the Kyrgyz language, translated by Shams al-Din Hakimov Abd al-Khaleq, reviewed and developed under the supervision of the Rowad Translation Center."},"meta":{"transliteration":"qāla rabbi ij'ʿal lī āyatan qāla āyatuka allā tukallima al-nāsa thalāthata ayyāmin illā ramzan wa-udh'kur rabbaka kathīran wasabbiḥ bil-ʿashiyi wal-ib'kāri ","translations":["He said","My Lord","make","for me","a sign","He said","your sign","(is) that not","you will speak","(to) the people","(for) three","days","except","(with) gestures","And remember","your Lord","much","and glorify (Him)","in the evening","and (in) the morning","(41)"],"transliterationArr":["qāla","rabbi","ij'ʿal","lī","āyatan","qāla","āyatuka","allā","tukallima","al-nāsa","thalāthata","ayyāmin","illā","ramzan","wa-udh'kur","rabbaka","kathīran","wasabbiḥ","bil-ʿashiyi","wal-ib'kāri",null],"verseTiming":[[1,0,860],[2,860,1580],[3,1580,2220],[4,2220,4010],[5,4010,5470],[6,5470,6150],[7,6150,7310],[8,7310,8150],[9,8150,9250],[10,9250,10930],[11,10930,12090],[12,12090,13430],[13,13430,14260],[14,14260,15900],[15,15900,16670],[16,16670,17690],[17,17690,19460],[18,19460,20500],[19,20500,21920],[20,21920,25815]]}}