{"name":"48:1","price":"(Оо, Мухаммад), Чынында, Биз сага анык жеңиш бердик.[1]","arabic":"إِنَّا فَتَحۡنَا لَكَ فَتۡحٗا مُّبِينٗا","category":["48 (Al-Fath)","Al-Fath","Surah Al-Fath","Chapter Al-Fath","Fath","Surah Fath","Chapter Fath","Al Fath","Surah Al Fath","Chapter Al Fath","Surah 48","Chapter 48","The Victory","الفتح"],"ayahNumber":4584,"juzNumber":26,"footnotes":"[1] Хижранын алтынчы жылында Мухаммад саллаллоху алайхи ва саллам миңден ашык сахабалары менен Умра зыяратын жасоо үчүн Меккеге келишет. Бирок, шаарга жакын «Худайбия» деген жерден аларды Мекке мушриктери шаарга киргизбей тосуп чыгышат. Ортодо чоң чыр, талаш-тартыш башталып, мусулмандар акыркы деми, бир тамчы каны калганга чейин душман менен кармашууга ант (байьат) беришет. Бул антташуу «Байьатур-ризван» (Аллахты ыраазы кылган ант) деген ат менен Ислам тарыхына кирген. Талаш-тартыштын натыйжасы мусулмандар менен мушриктердин ортосунда он жылдык тынчтык, өз ара кол салбастык келишиминин түзүлүшү менен бүтөт. Келишим боюнча мусулмандар бул жолкусунда Меккеге кирбей кайтып кетишет. Кийинки жылда келишкенде мушриктер шаарды бошотуп беришет. Араб урууларынан каалаганы мусулмандарга, каалаганы мушриктерге кошулууга укуктуу болот ж.б.у.с. көп маселелер каралат. Бул келишимде мушриктерге көбүрөөк укук каралгандыктан жана Меккеде төрөлүп чоңойгон мусулмандар алты жылдык сагыныч-кусалыктарынан кийин «Туулган шаарымды көрөмүн, Байтуллахты тооп кылып, Аллахка ибадат кыламын» деп турганда, шаардын астанасынан кайтып кетип жатышкандыктан, кээ бирөөлөр муну жеңилиш катары кабыл алышат. Бирок, Аллах тааланын вахийи менен гана иш жүргүзгөн пайгамбарыбыз келишим шарттары канчалык оор болсо да, он жылдык тынчтык мөөнөтүндө Ислам динин көбүрөөк жүрөктөргө жеткирүү мүмкүнчүлүгү тургандыктан, сабыр кылат жана момундарды да сабыр кылууга чакырат. «Худайбия келишими» чын-чынына келгенде мусулмандар үчүн жеңиштин башталышы болду. Ушул жылдан кийин оож алган даават натыйжасында тегеректеги араб уруулары, топ-топ болуп Исламды кабыл ала башташты. Бул сүрө мусулмандар Худайбиядан кайтып келе жатышканда түшкөн.","lang":"ky","version":{"key":"kyrgyz_hakimov","direction":"ltr","language_iso_code":"ky","version":"1.0.2","last_update":1708440100,"title":"Kyrgyz translation","description":"Translation of the meanings of the Noble Qur’an into the Kyrgyz language, translated by Shams al-Din Hakimov Abd al-Khaleq, reviewed and developed under the supervision of the Rowad Translation Center."},"meta":{"transliteration":"innā fataḥnā laka fatḥan mubīnan ","translations":["Indeed","We have given victory","to you","a victory","clear","(1)"],"transliterationArr":["innā","fataḥnā","laka","fatḥan","mubīnan",null],"verseTiming":[[1,0,1440],[2,1440,2520],[3,2520,2870],[4,2870,3480],[5,3480,6245]]}}