{"name":"4:159","price":"Китеп ээлеринин бардыгы (яхудийлери да христиандары да) ага өлүмүнөн бир аз мурун ыйман келтиришет. Жана Кыямат Күндө болсо, ал (Иса) алардын (өзү жөнүндө жалган ишенимде болгондордун) зыянына күбөлүк берет.[1]","arabic":"وَإِن مِّنۡ أَهۡلِ ٱلۡكِتَٰبِ إِلَّا لَيُؤۡمِنَنَّ بِهِۦ قَبۡلَ مَوۡتِهِۦۖ وَيَوۡمَ ٱلۡقِيَٰمَةِ يَكُونُ عَلَيۡهِمۡ شَهِيدٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":652,"juzNumber":6,"footnotes":"[1] Бул аятка эки түрлүү тафсир айтылат: 1. Китеп ээлеринин бардыгы өздөрүнүн өлүмүнө бир аз калып, жан алкымына келгенде Исага “Албетте, Иса Аллахтын пендеси (кулу) жана пайгамбары болгон. Кудай да болгон эмес, Кудайдын баласы да болгон эмес” деп, туура ыйман келтиришет. Бирок, анда кеч болуп калат. Жан алкымга келгендеги ыйман эсепке алынбайт. 2. Кыяматка жакын калганда Иса - Аллахтын буйругу менен - жер бетине түшүп, Дажжалды өлтүрөт. Мухаммад саллаллоху алайхи ва салламдын динин жер жүзүнө жайылтып, исламдык бийлик орнотот. Ал өз оозу менен өзүнүн Кудай эмес экенин, Мухаммад саллаллоху алайхи ва салламдын ак пайгамбар экенин) айткандан кийин табигый өлүм менен өлөт. Чындыкты Исанын өз оозунан уккан “Китеп ээлери Исага өлүмүнөн бир аз мурун ыйман келтиришет”. Жер бетинде “Иса Кудай эмес. Аллахтын кулу жана элчиси” деп ыйман келтирбеген бир да яхудий же христиан калбайт.","lang":"ky","version":{"key":"kyrgyz_hakimov","direction":"ltr","language_iso_code":"ky","version":"1.0.2","last_update":1708440100,"title":"Kyrgyz translation","description":"Translation of the meanings of the Noble Qur’an into the Kyrgyz language, translated by Shams al-Din Hakimov Abd al-Khaleq, reviewed and developed under the supervision of the Rowad Translation Center."},"meta":{"transliteration":"wa-in min ahli al-kitābi illā layu'minanna bihi qabla mawtihi wayawma al-qiyāmati yakūnu ʿalayhim shahīdan ","translations":["And (there is) not","from","(the) People","(of) the Book","but","surely he believes","in him","before","his death","And (on the) Day","(of) the Resurrection","he will be","against them","a witness","(159)"],"transliterationArr":["wa-in","min","ahli","al-kitābi","illā","layu'minanna","bihi","qabla","mawtihi","wayawma","al-qiyāmati","yakūnu","ʿalayhim","shahīdan",null],"verseTiming":[[1,0,540],[2,540,1540],[3,1540,2170],[4,2170,3150],[5,3150,3950],[6,3950,5980],[7,5980,6500],[8,6500,7210],[9,7210,8110],[10,8110,8850],[11,8850,10180],[12,10180,10920],[13,10920,11900],[14,11900,13425]]}}