{"name":"4:2","price":"(О, ыймандуулар!) Жетимдерге өз малдарын бергиле. Ыпылас нерсени тазага алмаштырбагыла жана алардын малын өз малыңарга кошуп жебегиле. Анткени, ал - чоң күнөө![1]","arabic":"وَءَاتُواْ ٱلۡيَتَٰمَىٰٓ أَمۡوَٰلَهُمۡۖ وَلَا تَتَبَدَّلُواْ ٱلۡخَبِيثَ بِٱلطَّيِّبِۖ وَلَا تَأۡكُلُوٓاْ أَمۡوَٰلَهُمۡ إِلَىٰٓ أَمۡوَٰلِكُمۡۚ إِنَّهُۥ كَانَ حُوبٗا كَبِيرٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":495,"juzNumber":4,"footnotes":"[1] Бул аят ата-энелери өлүп, бирөөнүн аталык (опекундук) карамагында калган жетимдердин укугун коргоп, аталык милдетин өз мойнуна алган момундарга, кол астындагы жетимдердин мурас мүлкүн алар эрезеге жеткенде өз колдоруна тапшырууну буюруп, жетимдин малын кыянаттык менен жегендикти ыпыластык деп жарыялап, өздөрүнүн адал - пакиза мүлкүн кыянаттык менен булгап албагыла деп эскертүүдө жана өзүңөрдүн малыңарды гана жегиле бирок, жетимдердин малын кошуп жебегиле деп таалим берүүдө. “Ыпыласты пакизага алмаштырбагыла” деген сөздүн дагы бир мааниси, өзүңөрдүн төмөн, сапаты начар мүлкүңөрдү жетимдердин асыл-таза буюмдарына алмаштырып койбогула дегенди да түшүндүрөт. Кыскасы, бул аят жетимдерге, айрыкча, тарбиясы кол астында болгон жетимдерге адилет менен мамиле кылууга буюрат.","lang":"ky","version":{"key":"kyrgyz_hakimov","direction":"ltr","language_iso_code":"ky","version":"1.0.2","last_update":1708440100,"title":"Kyrgyz translation","description":"Translation of the meanings of the Noble Qur’an into the Kyrgyz language, translated by Shams al-Din Hakimov Abd al-Khaleq, reviewed and developed under the supervision of the Rowad Translation Center."},"meta":{"transliteration":"waātū al-yatāmā amwālahum walā tatabaddalū al-khabītha bil-ṭayibi walā takulū amwālahum ilā amwālikum innahu kāna ḥūban kabīran ","translations":["And give","(to) the orphans","their wealth","and (do) not","exchange","the bad","with the good","and (do) not","consume","their wealth","with","your wealth","Indeed, it","is","a sin","great","(2)"],"transliterationArr":["waātū","al-yatāmā","amwālahum","walā","tatabaddalū","al-khabītha","bil-ṭayibi","walā","takulū","amwālahum","ilā","amwālikum","innahu","kāna","ḥūban","kabīran",null],"verseTiming":[[1,0,850],[2,850,3420],[3,3420,4840],[4,4840,5410],[5,5410,6650],[6,6650,7680],[7,7680,8950],[8,8950,9940],[9,9940,12140],[10,12140,13590],[11,13590,15330],[12,15330,17240],[13,17240,18600],[14,18600,19400],[15,19400,20990],[16,20990,22465]]}}