{"name":"58:1","price":"(Оо, Мухаммад!) Өзүнүн күйөөсү жөнүндө сени менен сөз талашып, Аллахка арызданган аялдын сөзүн Аллах укту. Аллах экөөңөрдүн талаш сөзүңөрдү угат. Аллах – Угуучу, Көрүүчү![1]","arabic":"قَدۡ سَمِعَ ٱللَّهُ قَوۡلَ ٱلَّتِي تُجَٰدِلُكَ فِي زَوۡجِهَا وَتَشۡتَكِيٓ إِلَى ٱللَّهِ وَٱللَّهُ يَسۡمَعُ تَحَاوُرَكُمَآۚ إِنَّ ٱللَّهَ سَمِيعُۢ بَصِيرٌ","category":["58 (Al-Mujadila)","Al-Mujadila","Surah Al-Mujadila","Chapter Al-Mujadila","Mujadila","Surah Mujadila","Chapter Mujadila","Al Mujadila","Surah Al Mujadila","Chapter Al Mujadila","Surah 58","Chapter 58","The Pleading Woman","المجادلة"],"ayahNumber":5105,"juzNumber":28,"footnotes":"[1] Исламга чейинки доордогу арабдар арасында «зихар» деген салт бар болчу. «Зихар» деген сөздүн түз мааниси «жон», «бел» дегенди түшүндүрөт. Маселен, бир эркек аялы менен жатканда ага «сенин жонуң (же белиң же мойнуң, же денең, же саның ж.б.у.с.) менин апамдын жонуна окшойт экен» десе, же аялы менен араздаша кеткенде ага «сен мага апамдын белиндей болуп кал!» десе – бүттү. Ошол бир гана сөз менен талак түшүп аялы апасы сыяктуу болуп калган жана мындай абалда аялы менен ажырашууга туура келген. Күндөрдүн биринде пайгамбарыбыз саллаллоху алайхи ва салламга картайып калган сахаба аялдардын бири Хавла бинти Саълаба келип: «Оо, Аллахтын элчиси! Күйөөмө мен гүлгүн курагымда керек болуп, эми керегим тийбей калыптыр! Ал мени зихар кылды. Бирок, мен ажырашууну каалабаймын. Ортодо перзенттерибиз бар!» деп арызданат. Бирок, пайгамбарыбыз саллаллоху алайхи ва салам Аллах тааладан жаңы өкүм келбегени себептүү, салт боюнча «сен анда эриңе талак болуптурсуң» дейт. Каңырыгы түтөгөн аял зихар салтына баш ийгиси келбей, пайгамбарыбыз менен сөз талашып, акырында «Оо, Аллахым! Мен Өзүңө арызданамын!» - деп жалбарат жана кетпей, отуруп алат. Ошол маалда пайгамбарыбыз унчукпай калат. Ошол маалда ага Аллах тааладан зихар өкүмүн жокко чыгарган аяттар түшкөн.","lang":"ky","version":{"key":"kyrgyz_hakimov","direction":"ltr","language_iso_code":"ky","version":"1.0.2","last_update":1708440100,"title":"Kyrgyz translation","description":"Translation of the meanings of the Noble Qur’an into the Kyrgyz language, translated by Shams al-Din Hakimov Abd al-Khaleq, reviewed and developed under the supervision of the Rowad Translation Center."},"meta":{"transliteration":"qad samiʿa al-lahu qawla allatī tujādiluka fī zawjihā watashtakī ilā al-lahi wal-lahu yasmaʿu taḥāwurakumā inna al-laha samīʿun baṣīrun ","translations":["Indeed","Allah has heard","Allah has heard","(the) speech","(of one) who","disputes with you","concerning","her husband","and she directs her complaint","to","Allah","And Allah","hears","(the) dialogue of both of you","Indeed","Allah","(is) All-Hearer","All-Seer","(1)"],"transliterationArr":["qad","samiʿa","al-lahu","qawla","allatī","tujādiluka","fī","zawjihā","watashtakī","ilā","al-lahi","wal-lahu","yasmaʿu","taḥāwurakumā","inna","al-laha","samīʿun","baṣīrun",null],"verseTiming":[[1,0,370],[2,370,900],[3,900,1770],[4,1770,2310],[5,2310,3020],[6,3020,4120],[7,4120,4470],[8,4470,5450],[9,5450,7680],[10,7680,8000],[11,8000,8700],[12,8700,9690],[13,9690,10450],[14,10450,12120],[15,12120,13850],[16,13850,14610],[17,14610,16120],[18,16120,18735]]}}