{"name":"59:1","price":"Аллахка асмандар жана жердегинин бардыгы тасбих айтты! Ал – Кудуреттүү, Даанышман![1]","arabic":"سَبَّحَ لِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۖ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","category":["59 (Al-Hashr)","Al-Hashr","Surah Al-Hashr","Chapter Al-Hashr","Hashr","Surah Hashr","Chapter Hashr","Al Hashr","Surah Al Hashr","Chapter Al Hashr","Surah 59","Chapter 59","The Exile","الحشر"],"ayahNumber":5127,"juzNumber":28,"footnotes":"[1] \"Хашр\"дын мааниси \"Сүргүн\". Бул сүрөнүн дагы бир аталышы \"Бану Назир\". Анткени, сүрөдө Бану Назир яхудилерин сүргүн кылуу окуясы баяндалат. Окуучуга сүрө аяттары түшүнүктүүрөөк болушу үчүн окуяларга учкай токтолуп кетебиз. Пайгамбарыбыз саллалоху алайхи ва саллам Меккеден Мединага хижрат кылып келген учурда бул жерде бир нече яхуди уруулары жашаган. Бану Назир ошол уруулардын бири. Пайгамбарыбыз Мединага ислам динин жайылта баштаганда яхуди уруулары менен өз ара тынчтык жана кол салышпастык келишимин түзгөн. Анан, белгилүү \"бадр\" согушунда аз сандуу мусулмандар үч эсе көп Мекке мушриктерин жеңип алышканда, яхудилер далбасага түшүп \"Булардын эсебин таппаса болбойт\" деп ойлоп жүрүшкөн. Арадан көп узабай \"Ухуд\" согушу болуп, анда мусулмандар жеңилет. Дал ушундай мезгилди күтүп турган яхудилер мушриктерге жетип барышып, алар менен мусулмандарга каршы сүйлөшүүнү сүйлөшүшөт. Дагы бир мезгилде пайгамбарыбыз бир жумуш менен Бану Назирге барып, бир үйдүн түбүндө эс алып турганда яхудилер үстүнөн чоң таш кулатышып, жанына кастык жасашат. Пайгамбарыбыз саллалоху алайхи ва саллам Аллахтан келген вахий кабары себептүү эки кутумдан тең кабардар болот жана тезинен Мединага барып, Бану Назирге каршы кол курап келип, алардын чептерин курчоого алып, курма бактарын кыйдырып, кысымды күчөтөт. Арадан бир нече күн өткөндөн соң, яхудилер элчи жиберишип, кыянаттык менен бузган келишимдерин жаңылоону сунуш кылышат. Бирок, пайгамбарыбыз саллалоху алайхи ва саллам кыянатчылар менен эч кандай келишим болбостугун билдирет жана яхудилерге мөөнөт берип, ар бир адам бир төө көтөргүдөй жүк-тагын алып шаардан чыгып кетүүнү талап кылат. Кыянатчы Бану Назир уруусу ушинтип \"Хайбар\" деген жерге сүргүн кылынат. Бирок, яхудилер тымызын кыянаттарын уланта бергени себептүү кийинчерээк алар Хайбардан да куулуп чыгарылат. Ошондуктан, сүрөнүн башында Бану Назир сүргүнүн \"биринчи сүргүн\" деп аталган.","lang":"ky","version":{"key":"kyrgyz_hakimov","direction":"ltr","language_iso_code":"ky","version":"1.0.2","last_update":1708440100,"title":"Kyrgyz translation","description":"Translation of the meanings of the Noble Qur’an into the Kyrgyz language, translated by Shams al-Din Hakimov Abd al-Khaleq, reviewed and developed under the supervision of the Rowad Translation Center."},"meta":{"transliteration":"sabbaḥa lillahi mā fī al-samāwāti wamā fī al-arḍi wahuwa al-ʿazīzu al-ḥakīmu ","translations":["Glorifies","[to] Allah","whatever","(is) in","the heavens","and whatever","(is) in","the earth","And He","(is) the All-Mighty","the All-Wise","(1)"],"transliterationArr":["sabbaḥa","lillahi","mā","fī","al-samāwāti","wamā","fī","al-arḍi","wahuwa","al-ʿazīzu","al-ḥakīmu",null],"verseTiming":[[1,0,820],[2,820,1600],[3,1600,1890],[4,1890,2090],[5,2090,3330],[6,3330,3800],[7,3800,4010],[8,4010,4810],[9,4810,5220],[10,5220,6260],[11,6260,8945]]}}