{"name":"68:42","price":"(Кыямат) күнү Балтыр ачылып, (бардык элдер) сажда кылууга чакырылганда, алар (мушриктер сажда кылууга) жарабай калышат.[1]","arabic":"يَوۡمَ يُكۡشَفُ عَن سَاقٖ وَيُدۡعَوۡنَ إِلَى ٱلسُّجُودِ فَلَا يَسۡتَطِيعُونَ","category":["68 (Al-Qalam)","Al-Qalam","Surah Al-Qalam","Chapter Al-Qalam","Qalam","Surah Qalam","Chapter Qalam","Al Qalam","Surah Al Qalam","Chapter Al Qalam","Surah 68","Chapter 68","The Pen","القلم"],"ayahNumber":5313,"juzNumber":29,"footnotes":"[1] Бул аят Кыяматтагы оор абал жөнүндө кабар берет. Абу Саид Худрий разияллоху анху мындай хадис риваят кылган: يوم القيامة يشتد الأمر ويصعب هوله, ويأتي الله تعالى لفصل القضاء بين الخلائق، فيكشف عن ساقه الكريمة التي لا يشبهها شيء, قال صلى الله عليه وسلم: \"يكشف ربنا عن ساقه, فيسجد له كل مؤمن ومؤمنة, ويبقى مَن كان يسجد في الدنيا؛ رياء وسمعة, فيذهب ليسجد, فيعود ظهره طبقًا واحدًا\" رواه البخاري: 4919 “ Мен Расулуллах саллаллоху алайхи ва салламдын мындай дегенин уктум: “(Кыяматтагы оор күндө) Раббибиз калк-калайыкка өкүм кылуу үчүн келет жана Өзүнүн (эч нерсеге окшобогон) Балтырын ачат. Анан Ага ар бир ыймандуу эркек-аял саждага жыгылат. Ошондо бул дүйнөдө эл көрсүнгө гана ийилип жүргөндөр (жана тап-такыр сажда кылбагандар) дагы сажда кылуу үчүн барышат. Бирок, алардын омурткалары катып (саждага жарабай) калат.” (Бухарий: 4919-хадис. Муслим: 183-хадис)","lang":"ky","version":{"key":"kyrgyz_hakimov","direction":"ltr","language_iso_code":"ky","version":"1.0.2","last_update":1708440100,"title":"Kyrgyz translation","description":"Translation of the meanings of the Noble Qur’an into the Kyrgyz language, translated by Shams al-Din Hakimov Abd al-Khaleq, reviewed and developed under the supervision of the Rowad Translation Center."},"meta":{"transliteration":"yawma yuk'shafu ʿan sāqin wayud'ʿawna ilā al-sujūdi falā yastaṭīʿūna ","translations":["(The) Day","will be uncovered","from","the shin","and they will be called","to","prostrate","but not","they will be able","(42)"],"transliterationArr":["yawma","yuk'shafu","ʿan","sāqin","wayud'ʿawna","ilā","al-sujūdi","falā","yastaṭīʿūna",null],"verseTiming":[[1,0,570],[2,570,1370],[3,1370,1950],[4,1950,3710],[5,3710,4810],[6,4810,5190],[7,5190,6220],[8,6220,6750],[9,6750,10415]]}}