{"name":"71:1","price":"Биз Нухту өз коомуна элчи-пайгамбар кылып жибердик (жана ага): «Аларга катуу азап келишинен мурда коомуңду (тозок азабынан) эскерткин»[1] - (деп вахий кылдык).","arabic":"إِنَّآ أَرۡسَلۡنَا نُوحًا إِلَىٰ قَوۡمِهِۦٓ أَنۡ أَنذِرۡ قَوۡمَكَ مِن قَبۡلِ أَن يَأۡتِيَهُمۡ عَذَابٌ أَلِيمٞ","category":["71 (Nuh)","Nuh","Surah Nuh","Chapter Nuh","Surah 71","Chapter 71","Noah","نوح"],"ayahNumber":5420,"juzNumber":29,"footnotes":"[1] Аллах таала эч бир элди жана эч бир адамды эскертмейинче жазалабайт. “Эскертүү” дегени эмне? Эмне үчүн Аллах таала көп аяттарда Өзүнүн пайгамбарларына “коомуңа үйрөткүн” дебей, “коомуңа эскерткин” деп буюрат? Анткени, ар бир пайгамбардын элдери көп учурда Аллах таала, акырет, бейиш жана тозок бар экенин эң жакшы билишкен. Анда алардын каапырчылыгы эмнеде? Алардын каапырчылыгы өздөрүнүн пенделик милдеттерин унутканында! Аллах таалага ишенип, бирок ибадат кылбаганында! Жок. Алар Аллахты жана акыретти тап-такыр эстеринен чыгарып жиберишкен эмес. Кез-кези менен Аллах тааланы эстеп калышчу. Кайсы мезгилдерде? Ооба. Баштарына кайгы-капа түшкөндө. Ошондо алар Аллах таалага өтө ыклас менен дуба жана тообо кылышып, эгер ушул кырсыктан аман сактаса, Өзүнө гана сыйынууга убада берип жиберишет. Аллах таала алардан кайгыны арылтканда, азыр эле айткан сөздөрүн, берген убадаларын унутуп, дагы каапырчылык иштерин улантышат.","lang":"ky","version":{"key":"kyrgyz_hakimov","direction":"ltr","language_iso_code":"ky","version":"1.0.2","last_update":1708440100,"title":"Kyrgyz translation","description":"Translation of the meanings of the Noble Qur’an into the Kyrgyz language, translated by Shams al-Din Hakimov Abd al-Khaleq, reviewed and developed under the supervision of the Rowad Translation Center."},"meta":{"transliteration":"innā arsalnā nūḥan ilā qawmihi an andhir qawmaka min qabli an yatiyahum ʿadhābun alīmun ","translations":["Indeed, We","[We] sent","Nuh","to","his people","that","Warn","your people","from","before","[that]","comes to them","a punishment","painful","(1)"],"transliterationArr":["innā","arsalnā","nūḥan","ilā","qawmihi","an","andhir","qawmaka","min","qabli","an","yatiyahum","ʿadhābun","alīmun",null],"verseTiming":[[1,0,2810],[2,2810,3900],[3,3900,4620],[4,4620,5100],[5,5100,7190],[6,7190,7550],[7,7550,8770],[8,8770,9570],[9,9570,10480],[10,10480,11230],[11,11230,12170],[12,12170,13200],[13,13200,14140],[14,14140,16835]]}}