{"name":"71:5","price":"(Нух) айтты : «Оо, Раббим! Мен коомумду түнү-күнү (токтоосуз) даават кылдым.[1]","arabic":"قَالَ رَبِّ إِنِّي دَعَوۡتُ قَوۡمِي لَيۡلٗا وَنَهَارٗا","category":["71 (Nuh)","Nuh","Surah Nuh","Chapter Nuh","Surah 71","Chapter 71","Noah","نوح"],"ayahNumber":5424,"juzNumber":29,"footnotes":"[1] Бул аятта дааватчыга чоң сабак бар. Демек, даават деген белгилүү убакытка чектелбейт, өмүр бою жасалат. Нух пайгамбардын иштеген иши, сүйлөгөн сөзү, жасаган кыймыл аракети, адеп-ахлагы, коомдогу мамилесинин өзү даават болду. Эл динди анын өзүнөн, сөзүнөн, ар бир кыймылынан, жүрүш-турушунан, адамдар менен мамилесинен көрө алды. Мына ушундай даават кылгандан кийин кандай натыйжа болду? Өзү айтат: “Бирок менин дааватым алардын (акыйкаттан) качуусун гана көбөйттү! (Оо, Аллахым) Сен аларды кечирүүң үчүн мен ар качан аларды даават кылып баштасам, манжаларын кулактарына тыгып, кийимдери менен оронуп алып (мени укпай, көшөргөн бойдон ширк ибадаттарын) уланта беришти жана аябай текеберленишти” Мунун мааниси эмне? Нух түшүнүктүү кылып жеткире албадыбы динди? Жок, андай эмес. Мунун эки себеби бар эле:\n 1) Аллахтын туура жолуна багытталуу (хидаят) Аллах тааланын гана колунда. Аллах хидаятка баштабаган адамдар пайгамбар даават кылса да туура жолго түшпөйт.\n 2) Көралбастык жана текеберлик. Ар бир коомдун бузуку каапырлары көбүнчө мансаптуу жана бай адамдардан болот. Аларга Аллах тааланы эскертип даават кылынса, “Биздей ак сөөктөргө ушул кембагал акыл үйрөтөбү?” деп ичи тарлык жана текеберчилик менен дааватты четке кагышат.","lang":"ky","version":{"key":"kyrgyz_hakimov","direction":"ltr","language_iso_code":"ky","version":"1.0.2","last_update":1708440100,"title":"Kyrgyz translation","description":"Translation of the meanings of the Noble Qur’an into the Kyrgyz language, translated by Shams al-Din Hakimov Abd al-Khaleq, reviewed and developed under the supervision of the Rowad Translation Center."},"meta":{"transliteration":"qāla rabbi innī daʿawtu qawmī laylan wanahāran ","translations":["He said","My Lord","Indeed, I","invited","my people","night","and day","(5)"],"transliterationArr":["qāla","rabbi","innī","daʿawtu","qawmī","laylan","wanahāran",null],"verseTiming":[[1,0,550],[2,550,1190],[3,1190,2540],[4,2540,3350],[5,3350,4110],[6,4110,5550],[7,5550,7435]]}}