{"name":"72:11","price":"Биздин арабызда (ыймандуу) жакшыларыбыз да, андан башкачаларыбыз да бар. Биз ар кандай жолдогулар элек.[1]","arabic":"وَأَنَّا مِنَّا ٱلصَّٰلِحُونَ وَمِنَّا دُونَ ذَٰلِكَۖ كُنَّا طَرَآئِقَ قِدَدٗا","category":["72 (Al-Jinn)","Al-Jinn","Surah Al-Jinn","Chapter Al-Jinn","Jinn","Surah Jinn","Chapter Jinn","Al Jinn","Surah Al Jinn","Chapter Al Jinn","Surah 72","Chapter 72","The Jinn","الجن"],"ayahNumber":5458,"juzNumber":29,"footnotes":"[1] Жиндердин арасында инсандар менен байланыш жасагандары бар. Эгер кайсы адамдын байланыштагы жини ыймандуу болсо, ага ар кандай нерселерди айтып башын оорутпайт. Эгер сураса учурдагы кээ бир сырларды дароо билип келип, кабарлашы мүмкүн. Себеби Аллах таала аларга биз элестете албай турган ылдамдуулукту берген. Ал эми кимдин байланышкан жини каапыр болсо анын кулагына жалгандан “кайып кабарларын” шыбырап, ал аркылуу адамдарды шылдыңдап, маскара кылышат. Ошондуктан мусулмандар билиши керек: арабыздагы “эртең андай болот, мындай болот”, “мага кайыптан, космостон кабар келет” деп “кайыптан” сүйлөгөндөр ошол каапыр жиндердин адамдардын башы айлантуучу өнөктөштөрү","lang":"ky","version":{"key":"kyrgyz_hakimov","direction":"ltr","language_iso_code":"ky","version":"1.0.2","last_update":1708440100,"title":"Kyrgyz translation","description":"Translation of the meanings of the Noble Qur’an into the Kyrgyz language, translated by Shams al-Din Hakimov Abd al-Khaleq, reviewed and developed under the supervision of the Rowad Translation Center."},"meta":{"transliteration":"wa-annā minnā al-ṣāliḥūna waminnā dūna dhālika kunnā ṭarāiqa qidadan ","translations":["And that [we]","among us","(are) the righteous","and among us","(are) other than","that","We","(are on) ways","different","(11)"],"transliterationArr":["wa-annā","minnā","al-ṣāliḥūna","waminnā","dūna","dhālika","kunnā","ṭarāiqa","qidadan",null],"verseTiming":[[1,0,1580],[2,1580,2530],[3,2530,3990],[4,3990,5430],[5,5430,6030],[6,6030,7240],[7,7240,8410],[8,8410,11170],[9,11170,12115]]}}