{"name":"73:19","price":"Албетте, бул(айтылганд)ар эскертүү гана. Ким кааласа Раббисине (алып баруучу туура) жолду (тандап) алат.[1]","arabic":"إِنَّ هَٰذِهِۦ تَذۡكِرَةٞۖ فَمَن شَآءَ ٱتَّخَذَ إِلَىٰ رَبِّهِۦ سَبِيلًا","category":["73 (Al-Muzzammil)","Al-Muzzammil","Surah Al-Muzzammil","Chapter Al-Muzzammil","Muzzammil","Surah Muzzammil","Chapter Muzzammil","Al Muzzammil","Surah Al Muzzammil","Chapter Al Muzzammil","Surah 73","Chapter 73","The Enshrouded One","المزمل"],"ayahNumber":5494,"juzNumber":29,"footnotes":"[1] Кезектеги (20-) аятты түшүнүү үчүн дагы кайрадан сүрөнүн башындагы төрт аятка кайтып, алардын маанилерин көңүлдөн өткөрүүгө туура келет. Ошентип, сүрөнүн башындагы “Эй, оронуп жатуучу! Түндөсү тур (жана ибадат кыл!) Бир аз гана бөлүгүндө: жарымында (уктасаң) мейли. Же болбосо, (уйкуңду) андан (жарымдан) бир аз кемит же бир аз кош жана Куранды кыраатын келиштирип оку!” деген аят түшкөндө мусулмандарга түндүн жарымында же үчтөн экисинде же үчтөн биринде туруп, ибадат кылуу парыз болгон эле. Мусулмандар бул буйрукту аткарууга бекем киришишти. Кээ бирөөлөрү айтылган убакта тура албай (ибадат сааттарын анык эсептей албай) калуудан коркуп, түнү менен намаз окугандыктан тамандары шишип кетчү. Ушинтип, арадан бир жылга жакын убакыт өткөндө ушул (20-) аят түшүп, мурунку аяттын өкүмүн жокко чыгарды. Эми, мусулмандар үчүн түнкү ибадаттар парыз (милдет) ибадат эмес, нафил (ыктыярдуу) ибадат болуп калды.","lang":"ky","version":{"key":"kyrgyz_hakimov","direction":"ltr","language_iso_code":"ky","version":"1.0.2","last_update":1708440100,"title":"Kyrgyz translation","description":"Translation of the meanings of the Noble Qur’an into the Kyrgyz language, translated by Shams al-Din Hakimov Abd al-Khaleq, reviewed and developed under the supervision of the Rowad Translation Center."},"meta":{"transliteration":"inna hādhihi tadhkiratun faman shāa ittakhadha ilā rabbihi sabīlan ","translations":["Indeed","this","(is) a Reminder","then whoever","wills","(let him) take","to","his Lord","a way","(19)"],"transliterationArr":["inna","hādhihi","tadhkiratun","faman","shāa","ittakhadha","ilā","rabbihi","sabīlan",null],"verseTiming":[[1,0,1160],[2,1160,2140],[3,2140,3640],[4,3640,4750],[5,4750,6850],[6,6850,7660],[7,7660,8210],[8,8210,9180],[9,9180,10835]]}}