{"name":"8:30","price":"(О, Мухаммад) эстегин, каапырлар (бир кезде) сени (журтуңда) калтырууга, же өлтүрүүгө, же болбосо, сүргүн кылууга айла издешкен. Алар айлакерлик кылышат, Аллах да айлакерлик кылат. Аллах айлакерлердин мыктысы.[1]","arabic":"وَإِذۡ يَمۡكُرُ بِكَ ٱلَّذِينَ كَفَرُواْ لِيُثۡبِتُوكَ أَوۡ يَقۡتُلُوكَ أَوۡ يُخۡرِجُوكَۚ وَيَمۡكُرُونَ وَيَمۡكُرُ ٱللَّهُۖ وَٱللَّهُ خَيۡرُ ٱلۡمَٰكِرِينَ","category":["8 (Al-Anfal)","Al-Anfal","Surah Al-Anfal","Chapter Al-Anfal","Anfal","Surah Anfal","Chapter Anfal","Al Anfal","Surah Al Anfal","Chapter Al Anfal","Surah 8","Chapter 8","The Spoils of War","الأنفَال"],"ayahNumber":1190,"juzNumber":9,"footnotes":"[1] Абу Жахл бин Хишам башчылыгындагы мушриктердин башчылары Меккеде исламдык дааватка чекит коюу үчүн түндөрдүн биринде масилетке чогулушат. “Эмне кылабыз, – дешет алар – ата-бабаларыбыздын динине, каада-салтына каршы болгон мына бул Мухаммадды жөн койобузбу, өлтүрөбүзбү же сүргүн кылып таштайлыбы?” Ошондо алар Мухаммад саллаллоху алайхи ва салламды айлакерлик менен өлтүрүү долбоорун түзүшөт. Долбоор боюнча курайш урууларынын бардыгынан бирден жигит тандап алышып, кылыч менен куралдандырылат. Бардыгы эл аягы тынганда Мухаммаддын үйүнө барып, ага бир адам сыяктуу кол салышмак болот. Ошондо анын каны (куну) урууларга тарап кетмек жана Бану Хашим (Мухаммаддын уруусу) жанга-жан алалбай, кун пулун алуу менен тынчтанып калмак. Мына ушул кутумду аткарганы желдеттер жолго чыкканда, Аллах Өз пайгамбарына окуянын кабарын билдирет жана эмне кылуу керектигин үйрөтөт. Алар келгенде Мухаммад саллаллоху алайхи ва саллам, капыстан бет маңдайдан чыга калып, аларга топурак чачып жиберет. Аллахтын кудурети менен бардыгынын көздөрүнө чаң толуп, абдырап, көрбөй калганда Аллахтын элчиси чыгып кетет. Ушул кетиште досу Абу Бакр экөө туп-туура Мединага барып, Аллах аны жана башка мусулмандарды мединалык ансарилер менен кубаттандырат. Ал жерде күч жыйнап, бир нече жылдан соң кайра келип, ата журту Меккени фатх кылат. Ошентип, Аллахтын айлакерлиги мушриктердин амалкерлигинен жогору келет.","lang":"ky","version":{"key":"kyrgyz_hakimov","direction":"ltr","language_iso_code":"ky","version":"1.0.2","last_update":1708440100,"title":"Kyrgyz translation","description":"Translation of the meanings of the Noble Qur’an into the Kyrgyz language, translated by Shams al-Din Hakimov Abd al-Khaleq, reviewed and developed under the supervision of the Rowad Translation Center."},"meta":{"transliteration":"wa-idh yamkuru bika alladhīna kafarū liyuth'bitūka aw yaqtulūka aw yukh'rijūka wayamkurūna wayamkuru al-lahu wal-lahu khayru al-mākirīna ","translations":["And when","plotted","against you","those who","disbelieved","that they restrain you","or","kill you","or","drive you out","And they were planning","and (also) was planning","Allah","And Allah","is (the) Best","(of) the Planners","(30)"],"transliterationArr":["wa-idh","yamkuru","bika","alladhīna","kafarū","liyuth'bitūka","aw","yaqtulūka","aw","yukh'rijūka","wayamkurūna","wayamkuru","al-lahu","wal-lahu","khayru","al-mākirīna",null],"verseTiming":[[1,0,740],[2,740,1630],[3,1630,2040],[4,2040,3170],[5,3170,4100],[6,4100,5700],[7,5700,6100],[8,6100,7510],[9,7510,7960],[10,7960,11090],[11,11090,13080],[12,13080,14120],[13,14120,16750],[14,16750,17810],[15,17810,18390],[16,18390,21785]]}}