{"name":"9:25","price":"Аллах силерге көп орундарда жана Хунейн (деген жердеги согуш) күнүндө да жардам берди: бир кезде силерди саныңардын көптүгү кубантып жиберди эле, кийин бул силерге эч кандай пайда бербей калды жана силер үчүн жер кенен болгонуна карабай тар көрүнүп, артыңарга качып калдыңар.[1]","arabic":"لَقَدۡ نَصَرَكُمُ ٱللَّهُ فِي مَوَاطِنَ كَثِيرَةٖ وَيَوۡمَ حُنَيۡنٍ إِذۡ أَعۡجَبَتۡكُمۡ كَثۡرَتُكُمۡ فَلَمۡ تُغۡنِ عَنكُمۡ شَيۡـٔٗا وَضَاقَتۡ عَلَيۡكُمُ ٱلۡأَرۡضُ بِمَا رَحُبَتۡ ثُمَّ وَلَّيۡتُم مُّدۡبِرِينَ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1260,"juzNumber":10,"footnotes":"[1] Пайгамбарыбыз Меккени фатх кылган (өзүнө караткан) жылда, мусулмандарга каршы Хаваазин уруусу күч жыйнап жатканы жөнүндө угуп он эки миң аскер менен аларга каршы аттанат жана Мекке менен Медина ортосундагы Хунейн деген жерде эки аскер жолугушат. Мусулман аскерлеринин арасында Исламга эми гана кирген Меккелик мусулмандар (кечээки мушриктер) көп эле. Алар жалпы эсеби төрт миң гана болгон душман аскерин тоотпой, өздөрүнүн көп сандуулугуна маашырланып, (жардам Аллахтан экенин унутуп) согушка киришет … Бирок, душмандын колу жогору келип, тыркырап кача башташат. Душмандын каршысында жүз чакты берилген сахабалар менен гана калган пайгамбарыбыз: “Мен качпаймын, мен чыныгы пайгамбар, Абдул-Мутталип деген каарман атам бар!” деп ураан чакырып, жалгыз өзү атынын башын душман тарапка буруп чабуулга өтөт. Муну көргөн абасы Аббас бин Абдул-Мутталиб мусулмандардын алдынан тосуп чыгып, “Эй, Бакара сүрөсүнүн эли, кайткыла!” деп, аларды кайтарып, бир адам сыяктуу тартипке салып, кайрадан чабуулга өтүшөт.","lang":"ky","version":{"key":"kyrgyz_hakimov","direction":"ltr","language_iso_code":"ky","version":"1.0.2","last_update":1708440100,"title":"Kyrgyz translation","description":"Translation of the meanings of the Noble Qur’an into the Kyrgyz language, translated by Shams al-Din Hakimov Abd al-Khaleq, reviewed and developed under the supervision of the Rowad Translation Center."},"meta":{"transliteration":"laqad naṣarakumu al-lahu fī mawāṭina kathīratin wayawma ḥunaynin idh aʿjabatkum kathratukum falam tugh'ni ʿankum shayan waḍāqat ʿalaykumu al-arḍu bimā raḥubat thumma wallaytum mud'birīna ","translations":["Verily","Allah helped you","Allah helped you","in","regions","many","and (on the) day","(of) Hunain","when","pleased you","your multitude","but not","availed","you","anything","and (was) straitened","for you","the earth","(in spite) of its vastness","(in spite) of its vastness","then","you turned back","fleeing","(25)"],"transliterationArr":["laqad","naṣarakumu","al-lahu","fī","mawāṭina","kathīratin","wayawma","ḥunaynin","idh","aʿjabatkum","kathratukum","falam","tugh'ni","ʿankum","shayan","waḍāqat","ʿalaykumu","al-arḍu","bimā","raḥubat","thumma","wallaytum","mud'birīna",null],"verseTiming":[[1,0,810],[2,810,1910],[3,1910,2790],[4,2790,3260],[5,3260,4370],[6,4370,6510],[7,6510,7290],[8,7290,8460],[9,8460,8860],[10,8860,10490],[11,10490,11740],[12,11740,12450],[13,12450,13130],[14,13130,14910],[15,14910,16780],[16,16780,18120],[17,18120,19260],[18,19260,20220],[19,20220,20830],[20,20830,22450],[21,22450,23540],[22,23540,24620],[23,24620,25650],[24,25650,26120],[25,26120,27210],[26,27210,28860],[27,28860,29990],[28,29990,33945]]}}