{"name":"9:77","price":"Андан соң, Аллахка берген убадасына кыянат кылышканы жана жалган сүйлөшкөнү себептүү, Аллах алардын жүрөктөрүнө кыяматка чейин (өзгөрбөй турган) эки жүздүүлүктү салып койду.[1]","arabic":"فَأَعۡقَبَهُمۡ نِفَاقٗا فِي قُلُوبِهِمۡ إِلَىٰ يَوۡمِ يَلۡقَوۡنَهُۥ بِمَآ أَخۡلَفُواْ ٱللَّهَ مَا وَعَدُوهُ وَبِمَا كَانُواْ يَكۡذِبُونَ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1312,"juzNumber":10,"footnotes":"[1] Тафсирчи аалымдар бул (сараңдык жөнүндөгү) аяттар Саьлаба деген бир мунафык жөнүндө түшкөн дешет. Бир күнү Саьлаба пайгамбар саллаллоху алайхи ва салламга келип: “Мага дуба кылыңыз. Эгер Аллах мени бай кылса кедейлерге көп садака кылып, тууган-уруктун арасын улап дагы көп жакшылыктар кыламын” дептир. Пайгамбар саллаллоху алайхи ва саллам дуба кылган экен, койлору көбөйүп, короого батпай, шаардан сыртка чыгып кетиптир. Койлору дагы бир аз көбөйгөндө беш убак намазды токтотуп, Жума намазына эле катышып калыптыр. Дагы бир аз көбөйгөндө Жумага да “колу тийбей калыптыр”. Күнү-түнү кой санап калгандан улам, пайгамбар жиберген зекет чогултуучуларга зекетин да чыгарып бербей коюптур. Муну уккан пайгамбарыбыз үч жолу “Саьлабанын шору катып калды” деп кайгырат. Ошондон кийин Саьлаба жана ага окшогондордун анык мунафыктыгы жөнүндө жогорудагы аяттар түшкөндө Саьлаба өз адамы аркылуу пайгамбарга байлыгынын зекетин жиберип, пайгамбар аны кабыл кылбай койот. Пайгамбарыбыз кайтыш болгонго чейин андан зекет малын кабыл албайт. Пайгамбарыбыздан кийин, Саьлаба байлыгынын зекетин биринчи халифа Абу Бакрга алып келсе ал да кабыл албаптыр. Андан кийинки халифтер Умар менен Усман дагы анын зекетин кабыл албай коюшкан экен. Аллахтын каргышына калган Саьлаба Усмандын тушунда кайтыш болуптур.","lang":"ky","version":{"key":"kyrgyz_hakimov","direction":"ltr","language_iso_code":"ky","version":"1.0.2","last_update":1708440100,"title":"Kyrgyz translation","description":"Translation of the meanings of the Noble Qur’an into the Kyrgyz language, translated by Shams al-Din Hakimov Abd al-Khaleq, reviewed and developed under the supervision of the Rowad Translation Center."},"meta":{"transliteration":"fa-aʿqabahum nifāqan fī qulūbihim ilā yawmi yalqawnahu bimā akhlafū al-laha mā waʿadūhu wabimā kānū yakdhibūna ","translations":["So He penalized them","(with) hypocrisy","in","their hearts","until","the day","when they will meet Him","because","they broke","(the covenant with) Allah","what","they had promised Him","and because","they used to","lie","(77)"],"transliterationArr":["fa-aʿqabahum","nifāqan","fī","qulūbihim","ilā","yawmi","yalqawnahu","bimā","akhlafū","al-laha","mā","waʿadūhu","wabimā","kānū","yakdhibūna",null],"verseTiming":[[1,0,1590],[2,1590,3680],[3,3680,4100],[4,4100,5520],[5,5520,6200],[6,6200,6850],[7,6850,8440],[8,8440,10490],[9,10490,11360],[10,11360,12350],[11,12350,12730],[12,12730,14350],[13,14350,17890],[14,17890,18710],[15,18710,19760],[16,19760,20260],[17,20260,21430],[18,21430,22250],[19,22250,23250],[20,23250,27015]]}}