{"name":"17:79","price":"Ngươi (Thiên Sứ Muhammad) hãy thức một phần trong đêm để Tahajjud(5), một việc làm thêm dành cho Ngươi(6), mong rằng Ngươi sẽ được Thượng Đế của Ngươi nâng Ngươi lên một vị trí vinh dự đáng ca ngợi.","arabic":"وَمِنَ ٱلَّيۡلِ فَتَهَجَّدۡ بِهِۦ نَافِلَةٗ لَّكَ عَسَىٰٓ أَن يَبۡعَثَكَ رَبُّكَ مَقَامٗا مَّحۡمُودٗا","category":["17 (Al-Isra)","Al-Isra","Surah Al-Isra","Chapter Al-Isra","Isra","Surah Isra","Chapter Isra","Al Isra","Surah Al Isra","Chapter Al Isra","Surah 17","Chapter 17","The Night Journey","الإسرَاء"],"ayahNumber":2108,"juzNumber":15,"footnotes":"(5) Đa số học giả nói rằng Tahajjud là lễ nguyện Salah Sunnah trong đêm từ sau lễ nguyện Salah ‘Isha’ trở đi cho đến Azdaan Fajr. Một số học giả cho rằng Tahajjud là lễ nguyện Salah Sunnah sau khi ngủ thức dậy trong đêm. Tuy nhiên, tất cả đều đồng thuận rằng lễ nguyện Salah Sunnah càng khuya càng tốt, đặc biệt là vào một phần ba cuối của đêm. \n(6) Có hai luồng quan điểm: một luồng quan điểm giảng giải rằng lễ nguyện Salah trong đêm là Wajib (bắt buộc) dành riêng cho mỗi mình Thiên Sứ Muhammad; còn luồng quan điểm thứ hai thì nói rằng lễ nguyện Salah trong đêm là Sunnah (khuyến khích) dành riêng cho Thiên Sứ Muhammad bởi vì Người đã được tha thứ tất cả tội lội trước đây cũng như sau này, riêng đối với các tín đồ của Người thì các lễ nguyện Salah Sunnah sẽ bôi xóa các tội lỗi của họ.","lang":"vi","version":{"key":"vietnamese_rwwad","direction":"ltr","language_iso_code":"vi","version":"1.0.6","last_update":1699531102,"title":"Vietnamese translation - Rowwad Translation Center","description":"Translation of the Quran meanings into Vietnamese by Rowwad Translation Center with cooperation with Islamhouse.com"},"meta":{"transliteration":"wamina al-layli fatahajjad bihi nāfilatan laka ʿasā an yabʿathaka rabbuka maqāman maḥmūdan ","translations":["And from","the night","arise from sleep for prayer","with it","(as) additional","for you","it may be","that","will raise you","your Lord","(to) a station","praiseworthy","(79)"],"transliterationArr":["wamina","al-layli","fatahajjad","bihi","nāfilatan","laka","ʿasā","an","yabʿathaka","rabbuka","maqāman","maḥmūdan",null],"verseTiming":[[1,0,660],[2,660,1630],[3,1630,2900],[4,2900,3520],[5,3520,4890],[6,4890,5300],[7,5300,5980],[8,5980,6720],[9,6720,9080],[10,9080,10000],[11,10000,10910],[12,10910,13385]]}}