{"name":"2:104","price":"Hỡi những người có đức tin, các ngươi chớ nói (với Thiên Sứ Muhammad) bằng tiếng Raa’ina(5), đổi lại các ngươi hãy nói (với Y) bằng tiếng Unzhurna, và các ngươi hãy lắng nghe (lời Y dạy). Còn những kẻ vô đức tin (rồi đây) sẽ phải chịu sự trừng phạt đau đớn.","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَقُولُواْ رَٰعِنَا وَقُولُواْ ٱنظُرۡنَا وَٱسۡمَعُواْۗ وَلِلۡكَٰفِرِينَ عَذَابٌ أَلِيمٞ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":111,"juzNumber":1,"footnotes":"(5) Những người Do Thái thường hay dùng những tiếng hay những từ ngữ có âm tiết giông giống nhau để nhạo báng hoặc nguyền rủa Thiên Sứ Muhammad. Đã có nhiều Hadith cho biết rằng những người Do Thái mỗi khi chào Salam đến Thiên Sứ Muhammad, thay vì nói Assalam Alaykum thì họ lại nói Assaam Alaykum, Assalam có nghĩa là bằng an còn Assaam có nghĩa là cái chết, ý họ muốn dùng tiếng Assaam để nguyền rủa Người. Tương tự, khi họ muốn nói với Thiên Sứ Muhammad “hãy lắng nghe chúng tôi”, thay vì họ nói “Raa’ina” thì họ lại nói “ari’na” có nghĩa là ngu ngốc, ý của họ muốn nhạo báng Người. Cho nên, Allah ra lệnh cho những người có đức tin không dùng tiếng “Raa’ina” nữa mà hãy dùng tiếng “Unzhurna” để thay thế khi nói chuyện với Thiên Sứ Muhammad.","lang":"vi","version":{"key":"vietnamese_rwwad","direction":"ltr","language_iso_code":"vi","version":"1.0.6","last_update":1699531102,"title":"Vietnamese translation - Rowwad Translation Center","description":"Translation of the Quran meanings into Vietnamese by Rowwad Translation Center with cooperation with Islamhouse.com"},"meta":{"transliteration":"yāayyuhā alladhīna āmanū lā taqūlū rāʿinā waqūlū unẓur'nā wa-is'maʿū walil'kāfirīna ʿadhābun alīmun ","translations":["O you","who","believe[d]","(Do) not","say","Raina","and say","Unzurna","and listen","And for the disbelievers","(is) a punishment","painful","(104)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","lā","taqūlū","rāʿinā","waqūlū","unẓur'nā","wa-is'maʿū","walil'kāfirīna","ʿadhābun","alīmun",null],"verseTiming":[[1,0,2860],[2,2860,3770],[3,3770,4720],[4,4720,5050],[5,5050,6060],[6,6060,7020],[7,7020,7950],[8,7950,9410],[9,9410,10570],[10,10570,12590],[11,12590,13590],[12,13590,15805]]}}