{"name":"2:114","price":"Thế còn ai sai quấy hơn những kẻ đã ngăn cản thiên hạ tụng niệm Allah trong các Masjid(6) của Ngài cũng như không ngừng tìm mọi cách đập phá cho bằng được (các Masjid). Những kẻ đó, phải làm cho họ sợ mỗi khi họ muốn vào các Masjid. Họ phải bị hạ nhục ở trần gian này còn ở Đời Sau họ sẽ phải đối mặt với sự trừng phạt vô cùng khủng khiếp.","arabic":"وَمَنۡ أَظۡلَمُ مِمَّن مَّنَعَ مَسَٰجِدَ ٱللَّهِ أَن يُذۡكَرَ فِيهَا ٱسۡمُهُۥ وَسَعَىٰ فِي خَرَابِهَآۚ أُوْلَٰٓئِكَ مَا كَانَ لَهُمۡ أَن يَدۡخُلُوهَآ إِلَّا خَآئِفِينَۚ لَهُمۡ فِي ٱلدُّنۡيَا خِزۡيٞ وَلَهُمۡ فِي ٱلۡأٓخِرَةِ عَذَابٌ عَظِيمٞ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":121,"juzNumber":1,"footnotes":"(6) Masjid là phiên âm của (مَسْجِدٌ) trong tiếng Ả-rập, theo nghĩa đen của từ có nghĩa là nơi quỳ lạy thờ cúng, số nhiều của tiếng này là (مَسَاجِدُ) – Masa-jid. Trong thuật ngữ Islam, Masjid được dùng để gọi ngôi nhà mà các tín đồ Muslim dâng lễ nguyện Salah tập thể trong đó. Người nói tiếng Việt khi nhắc đến ngôi nhà mà các tín đồ Muslim dâng lễ nguyện Salah tập thể thì họ thường dùng từ “thánh đường” hoặc “nhà thờ” để diễn đạt, có người kỹ hơn một chút thì kết hợp thêm cùng với từ “Hồi giáo” tức “thánh đường Hồi giáo” hoặc “nhà thờ Hồi giáo” để phân biệt với nhà thờ hoặc thánh đường của Thiên Chúa giáo. Xét về mặt ngữ nghĩa thì “nhà thờ” tương đối sát nghĩa hơn “thánh đường”, còn “thánh đường” chưa thực sự chính xác bởi vì “thánh đường” có nghĩa là ngôi nhà của thần thánh trong khi Allah không phải là thần thánh mà là Đấng Tạo Hóa, Đấng Tối Cao, Đấng Đáng Được Thờ Phượng, Thượng Đế của vũ trụ và vạn vật. Tuy nhiên, từ “thánh đường” đã trở nên phổ biến và quen thuộc trong cộng đồng Muslim nói tiếng Việt mỗi khi nhắc đến ngôi nhà mà các tín đồ Muslim dâng lễ nguyện Salah tập thể. Bản dịch Qur’an tiếng Việt này dùng luôn tiếng phiên âm mà không chuyển ngữ với mong muốn tiếng “Masjid” trở thành tiếng đặc trưng của người Muslim nói tiếng Việt khi họ gọi ngôi nhà dâng lễ nguyện Salah tập thể của mình mục đích để khỏi nhằm lẫn với các nơi thờ cúng của người ngoại đạo.","lang":"vi","version":{"key":"vietnamese_rwwad","direction":"ltr","language_iso_code":"vi","version":"1.0.6","last_update":1699531102,"title":"Vietnamese translation - Rowwad Translation Center","description":"Translation of the Quran meanings into Vietnamese by Rowwad Translation Center with cooperation with Islamhouse.com"},"meta":{"transliteration":"waman aẓlamu mimman manaʿa masājida al-lahi an yudh'kara fīhā us'muhu wasaʿā fī kharābihā ulāika mā kāna lahum an yadkhulūhā illā khāifīna lahum fī al-dun'yā khiz'yun walahum fī al-ākhirati ʿadhābun ʿaẓīmun ","translations":["And who","(is) more unjust","than (one) who","prevents","(the) masajid","(of) Allah","to","be mentioned","in them","His name","and strives","for","their destruction","Those","Not","it is","for them","that","they enter them","except","(like) those in fear","For them","in","the world","(is) disgrace","and for them","in","the Hereafter","(is) a punishment","great","(114)"],"transliterationArr":["waman","aẓlamu","mimman","manaʿa","masājida","al-lahi","an","yudh'kara","fīhā","us'muhu","wasaʿā","fī","kharābihā","ulāika","mā","kāna","lahum","an","yadkhulūhā","illā","khāifīna","lahum","fī","al-dun'yā","khiz'yun","walahum","fī","al-ākhirati","ʿadhābun","ʿaẓīmun",null],"verseTiming":[[1,0,738],[2,738,1688],[3,1688,3323],[4,3323,4348],[5,4348,5170],[6,5170,6057],[7,6057,7074],[8,7074,7710],[9,7710,8309],[10,8309,9113],[11,9113,9813],[12,9813,10356],[13,10356,11690],[14,11690,14338],[15,14338,14830],[16,14830,15375],[17,15375,16045],[18,16045,17142],[19,17142,19621],[20,19621,20342],[21,20342,24500],[22,24500,25269],[23,25269,25694],[24,25694,26463],[25,26463,28014],[26,28014,28608],[27,28608,28974],[28,28974,29917],[29,29917,30847],[30,30847,33091]]}}