{"name":"30:5","price":"Về sự phù hộ của Allah. Quả thật, Ngài ban chiến thắng cho người nào Ngài muốn bởi Ngài là Đấng Quyền Năng, Đấng Nhân Từ.(2)","arabic":"بِنَصۡرِ ٱللَّهِۚ يَنصُرُ مَن يَشَآءُۖ وَهُوَ ٱلۡعَزِيزُ ٱلرَّحِيمُ","category":["30 (Ar-Rum)","Ar-Rum","Surah Ar-Rum","Chapter Ar-Rum","Rum","Surah Rum","Chapter Rum","Ar Rum","Surah Ar Rum","Chapter Ar Rum","Surah 30","Chapter 30","The Romans","الرُّوم"],"ayahNumber":3414,"juzNumber":21,"footnotes":"(2) Nguyên nhân Allah mặc khải xuống bốn câu Kinh (2, 3, 4, 5) này là do đã xảy ra cuộc chiến giữa Đế quốc Ba Tư và người La Mã ở một khu vực gần Biển Chết. Trong trận chiến này, người Ba Tư đã giành chiến thắng, và đó là vào năm 619 sau Công nguyên. Những người Muslim cảm thấy buồn trước sự thất bại của người La Mã bởi vì họ là những người dân Kinh Sách và tôn giáo của họ gần với tôn giáo của Islam hơn, còn những người thờ đa thần Quraish thì vui mừng trước chiến thắng của người Ba Tư bởi vì những người Ba Tư cũng thờ đa thần giống như họ. Allah mặc khải xuống hứa với người Muslim rằng rồi đây trong vài năm sau người La Mã sẽ đánh bại Đế quốc Ba Tư trong trận chiến thứ hai. Lời hứa của Qur’an đã được xác thực, sau bảy năm, một trận chiến khác diễn ra giữa người Ba Tư và người La Mã vào năm 626 sau Công nguyên và người La Mã đã thực sự giành chiến thắng. Và đây chính là một trong những phép màu của Kinh Qur’an, khẳng định sứ mạng của Thiên Sứ Muhammad là thật. (Xem Tafsir Ibnu Al-Kathir và Tafsir Ot-Tobari).","lang":"vi","version":{"key":"vietnamese_rwwad","direction":"ltr","language_iso_code":"vi","version":"1.0.6","last_update":1699531102,"title":"Vietnamese translation - Rowwad Translation Center","description":"Translation of the Quran meanings into Vietnamese by Rowwad Translation Center with cooperation with Islamhouse.com"},"meta":{"transliteration":"binaṣri al-lahi yanṣuru man yashāu wahuwa al-ʿazīzu al-raḥīmu ","translations":["With (the) help","(of) Allah","He helps","whom","He wills","And He","(is) the All-Mighty","the Most Merciful","(5)"],"transliterationArr":["binaṣri","al-lahi","yanṣuru","man","yashāu","wahuwa","al-ʿazīzu","al-raḥīmu",null],"verseTiming":[[1,0,1090],[2,1090,4060],[3,4060,5750],[4,5750,6680],[5,6680,9409],[6,9409,9909],[7,9909,11059],[8,11059,14084]]}}