{"name":"33:72","price":"Quả thật, TA đã giao Ama-nah(7) cho các tầng trời và trái đất và núi non nhưng chúng từ chối vì chúng cả sợ nên đã tránh xa nó; nhưng con người đã nhận lãnh nó; rõ ràng (con người) hết sức sai quấy, ngu muội.","arabic":"إِنَّا عَرَضۡنَا ٱلۡأَمَانَةَ عَلَى ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَٱلۡجِبَالِ فَأَبَيۡنَ أَن يَحۡمِلۡنَهَا وَأَشۡفَقۡنَ مِنۡهَا وَحَمَلَهَا ٱلۡإِنسَٰنُۖ إِنَّهُۥ كَانَ ظَلُومٗا جَهُولٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab","Chapter Al-Ahzab","Ahzab","Surah Ahzab","Chapter Ahzab","Al Ahzab","Surah Al Ahzab","Chapter Al Ahzab","Surah 33","Chapter 33","The Combined Forces","الأحزَاب"],"ayahNumber":3605,"juzNumber":22,"footnotes":"(7) Học giả Ibnu Al-Kathir giảng giải câu Kinh này, nói: “Ibnu 'Abbas nói: Ama-nah trong câu Kinh có nghĩa là sự phụng mệnh. (Có lời dẫn thì ghi rằng ông nói Ama-nah chính là các nghĩa vụ bắt buộc – những điều Fardh). Allah phơi bày Ama-nah cho các tầng trời, trái đất và núi non với ý nghĩa nếu chúng thực hiện thì sẽ được ban thưởng nhưng nếu chúng không thực hiện thì sẽ bị trừng phạt, thế là các tầng trời, trái đất và núi non từ chối nhận lãnh Ama-nah. Và rồi khi Allah phơi bày cho Nabi Adam Ama-nah này và Ngài bảo Adam: Ngươi có nhận lãnh nó không? Nabi Adam nói: Thưa Thượng Đế của bề tôi, Ama-nah đó là gì vậy? Allah nói: «إِنْ أَحْسَنْتَ جُزِيْتَ، وَإِنْ أَسَأْتَ عُوْقِبْتَ» “Nếu ngươi phụng mệnh và làm điều tốt ngươi sẽ được ban thưởng, còn nếu ngươi trái lệnh bất tuân và làm điều xấu thì ngươi sẽ bị trừng phạt”. Vậy là Nabi Adam đã chấp nhận lãnh Ama-nah này.”","lang":"vi","version":{"key":"vietnamese_rwwad","direction":"ltr","language_iso_code":"vi","version":"1.0.6","last_update":1699531102,"title":"Vietnamese translation - Rowwad Translation Center","description":"Translation of the Quran meanings into Vietnamese by Rowwad Translation Center with cooperation with Islamhouse.com"},"meta":{"transliteration":"innā ʿaraḍnā al-amānata ʿalā al-samāwāti wal-arḍi wal-jibāli fa-abayna an yaḥmil'nahā wa-ashfaqna min'hā waḥamalahā al-insānu innahu kāna ẓalūman jahūlan ","translations":["Indeed, We","[We] offered","the Trust","to","the heavens","and the earth","and the mountains","but they refused","to","bear it","and they feared","from it","but bore it","the man","Indeed, he","was","unjust","ignorant","(72)"],"transliterationArr":["innā","ʿaraḍnā","al-amānata","ʿalā","al-samāwāti","wal-arḍi","wal-jibāli","fa-abayna","an","yaḥmil'nahā","wa-ashfaqna","min'hā","waḥamalahā","al-insānu","innahu","kāna","ẓalūman","jahūlan",null],"verseTiming":[[1,0,1500],[2,1500,2290],[3,2290,3490],[4,3490,3870],[5,3870,5270],[6,5270,6230],[7,6230,7340],[8,7340,8260],[9,8260,8620],[10,8620,10600],[11,10600,12070],[12,12070,12360],[13,12360,14330],[14,14330,15490],[15,15490,16230],[16,16230,17180],[17,17180,21270],[18,21270,22740],[19,22740,23390],[20,23390,24470],[21,24470,26585]]}}