{"name":"5:27","price":"Ngươi (hỡi Thiên Sứ) hãy đọc cho họ (dân Do Thái) nghe thông tin thật về hai đứa con trai của Adam(13), khi cả hai cùng hiến dâng lễ vật (lên Allah) thì chỉ một người trong hai người họ được chấp nhận còn người kia thì không. (Thế là Qabil tức giận nói với Habil): “Tao phải giết mày.” (Habil) đáp: “Quả thật, Allah chỉ chấp nhận từ những người ngoan đạo mà thôi.”","arabic":"۞ وَٱتۡلُ عَلَيۡهِمۡ نَبَأَ ٱبۡنَيۡ ءَادَمَ بِٱلۡحَقِّ إِذۡ قَرَّبَا قُرۡبَانٗا فَتُقُبِّلَ مِنۡ أَحَدِهِمَا وَلَمۡ يُتَقَبَّلۡ مِنَ ٱلۡأٓخَرِ قَالَ لَأَقۡتُلَنَّكَۖ قَالَ إِنَّمَا يَتَقَبَّلُ ٱللَّهُ مِنَ ٱلۡمُتَّقِينَ","category":["5 (Al-Ma'idah)","Al-Ma'idah","Surah Al-Ma'idah","Chapter Al-Ma'idah","Ma'idah","Surah Ma'idah","Chapter Ma'idah","Al Ma'idah","Surah Al Ma'idah","Chapter Al Ma'idah","Surah 5","Chapter 5","The Table Spread","المَائدة"],"ayahNumber":696,"juzNumber":6,"footnotes":"(13) Nabi Adam và Hauwa’ là hai con người đầu tiên sống trên trái đất, cho nên mỗi lần bà Hauwa mang thai thì Allah đều cho bà mang song thai một trai và một gái. Nabi Adam thường gả chéo đứa con trai của cặp song sinh này với đứa con gái của cặp song sinh kia và ngược lại. Qabil và Habil đều có một đứa em gái song sinh với mình, Qabil lớn hơn Habil và đứa em gái song sinh với Qabil có nhan sắc hơn đứa em gái song sinh với Habil. Habil muốn cưới người chị song sinh với Qabil nhưng Qabil không đồng ý. Nabi Adam cũng ra lệnh bảo Habil lấy người chị song sinh với Qabil và Qabil thì lấy người em gái song sinh với Habil nhưng Qabil quyết không đồng ý. Vậy là Nabi bảo hai đứa con dâng lễ vật cho Allah, lễ vật của ai được Allah chấp nhận thì người đó được quyền cưới người mình muốn. Habil là người chăn nuôi nên đã chọn con cừu đẹp nhất, mập nhất để làm lễ vật. Qabil là người trồng trọt, với bản tính cao ngạo và không chân thành, nên đã chọn đại một nhánh cây lương thực kém nhất làm lễ vật. Cuối cùng Allah cho lửa từ trời phóng xuống đốt lấy con cừu của Habil (đó là cách Allah chấp nhận lễ vật dâng lên Ngài trong thời đó) và bỏ lại nhánh lương thực của Qabil. Thế là Qabil tức giận đòi giết Habil để được quyền cưới em gái song sinh của mình. Con cừu của Habil được nuôi ở Thiên Đàng, sau này là con vật được ban xuống làm vật tế thế mạng cho Nabi Isma’il. (Theo Tafsir Ibnu Al-Kathir)","lang":"vi","version":{"key":"vietnamese_rwwad","direction":"ltr","language_iso_code":"vi","version":"1.0.6","last_update":1699531102,"title":"Vietnamese translation - Rowwad Translation Center","description":"Translation of the Quran meanings into Vietnamese by Rowwad Translation Center with cooperation with Islamhouse.com"},"meta":{"transliteration":"wa-ut'lu ʿalayhim naba-a ib'nay ādama bil-ḥaqi idh qarrabā qur'bānan fatuqubbila min aḥadihimā walam yutaqabbal mina al-ākhari qāla la-aqtulannaka qāla innamā yataqabbalu al-lahu mina al-mutaqīna ","translations":["And recite","to them","the story","(of) two sons","(of) Adam","in truth","when","both offered","a sacrifice","and it was accepted","from","one of them","and not","was accepted","from","the other","Said (the latter)","Surely I will kill you","Said (the former)","Only","accepts","(does) Allah","from","the God fearing","(27)"],"transliterationArr":["wa-ut'lu","ʿalayhim","naba-a","ib'nay","ādama","bil-ḥaqi","idh","qarrabā","qur'bānan","fatuqubbila","min","aḥadihimā","walam","yutaqabbal","mina","al-ākhari","qāla","la-aqtulannaka","qāla","innamā","yataqabbalu","al-lahu","mina","al-mutaqīna",null],"verseTiming":[[1,0,2950],[2,2950,4050],[3,4050,4510],[4,4510,5360],[5,5360,6100],[6,6100,7090],[7,7090,7440],[8,7440,8380],[9,8380,9980],[10,9980,11370],[11,11370,11750],[12,11750,12810],[13,12810,13630],[14,13630,14790],[15,14790,15140],[16,15140,16210],[17,16210,16900],[18,16900,19070],[19,19070,19660],[20,19660,20980],[21,20980,22290],[22,22290,23140],[23,23140,23490],[24,23490,26285]]}}