{"name":"6:35","price":"Nếu sự quay lưng của (những kẻ đa thần) là điều trở ngại lớn cho Ngươi (hỡi Thiên Sứ) thì với khả năng của Ngươi, hãy đào một đường hầm dưới đất hoặc hãy bắt một cái thang lên trời để mang đến cho họ một dấu hiệu (để thuyết phục họ). Quả thật, nếu Allah muốn thì chắc chắn Ngài đã tập hợp toàn bộ họ đi trên chính đạo. Cho nên, Ngươi chớ là kẻ ngu muội.(1)","arabic":"وَإِن كَانَ كَبُرَ عَلَيۡكَ إِعۡرَاضُهُمۡ فَإِنِ ٱسۡتَطَعۡتَ أَن تَبۡتَغِيَ نَفَقٗا فِي ٱلۡأَرۡضِ أَوۡ سُلَّمٗا فِي ٱلسَّمَآءِ فَتَأۡتِيَهُم بِـَٔايَةٖۚ وَلَوۡ شَآءَ ٱللَّهُ لَجَمَعَهُمۡ عَلَى ٱلۡهُدَىٰۚ فَلَا تَكُونَنَّ مِنَ ٱلۡجَٰهِلِينَ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":824,"juzNumber":7,"footnotes":"(1) Thiên Sứ thấy rằng mặc dù đã dành một thời gian dài để khuyên nhủ người dân của mình nhưng họ hầu như không đáp lại lời kêu gọi của Người. Kết quả là đôi khi Người mong muốn sự xuất hiện một dấu hiệu lạ nào đó từ nơi Thượng Đế sẽ làm suy yếu sự ngoan cố của người dân và khiến họ chấp nhận sự hướng dẫn của Người. Câu Kinh này thể hiện phản ứng của Thượng Đế đối với mong muốn của Thiên Sứ. Người được bảo đừng nôn nóng. Người phải kiên trì phấn đấu và tiếp tục làm tròn sứ mạng phù hợp với chỉ thị của Allah. Allah thừa khả năng ban xuống những dấu hiệu lạ và thừa khả năng hướng dẫn toàn bộ đến chính đạo nhưng Ngài đã không coi đó là phương pháp thích hợp để hoàn thành cuộc cách mạng trí tuệ và đạo đức cần thiết hoặc cho sự phát triển của một nền văn minh lành mạnh. Nếu Thiên Sứ không thể kiên nhẫn chịu đựng thái độ bướng bỉnh và sự quay lưng của người dân của Người, và nếu Người nghĩ cần phải làm cho họ chứng kiến một dấu hiệu lạ hữu hình của Thượng Đế, thì Người hãy tập trung tất cả sức mạnh và cố gắng để đào một cái hầm dưới đất hoặc bắt một cái thang lên trời và mang đến một phép lạ đủ mạnh để thay đổi đức tin của những kẻ vô đức tin. Tuy nhiên, Thiên Sứ được cho biết rằng về vấn đề này, Người không nên mong đợi Thượng Đế thực hiện ước muốn của mình, vì những điều như vậy không có chỗ trong kế hoạch của Ngài. Cho nên, Thiên Sứ chớ đâm ra thoái chí và mất kiên nhẫn giống như một kẻ ngu muội.","lang":"vi","version":{"key":"vietnamese_rwwad","direction":"ltr","language_iso_code":"vi","version":"1.0.6","last_update":1699531102,"title":"Vietnamese translation - Rowwad Translation Center","description":"Translation of the Quran meanings into Vietnamese by Rowwad Translation Center with cooperation with Islamhouse.com"},"meta":{"transliteration":"wa-in kāna kabura ʿalayka iʿ'rāḍuhum fa-ini is'taṭaʿta an tabtaghiya nafaqan fī al-arḍi aw sullaman fī al-samāi fatatiyahum biāyatin walaw shāa al-lahu lajamaʿahum ʿalā al-hudā falā takūnanna mina al-jāhilīna ","translations":["And if","is","difficult","for you","their aversion","then if","you are able","to","seek","a tunnel","in","the earth","or","a ladder","into","the sky","so that you bring to them","a Sign","But if","(had) willed","Allah","surely He (would) have gathered them","on","the guidance","So (do) not","be","of","the ignorant","(35)"],"transliterationArr":["wa-in","kāna","kabura","ʿalayka","iʿ'rāḍuhum","fa-ini","is'taṭaʿta","an","tabtaghiya","nafaqan","fī","al-arḍi","aw","sullaman","fī","al-samāi","fatatiyahum","biāyatin","walaw","shāa","al-lahu","lajamaʿahum","ʿalā","al-hudā","falā","takūnanna","mina","al-jāhilīna",null],"verseTiming":[[1,0,1390],[2,1390,1940],[3,1940,2640],[4,2640,3520],[5,3520,4860],[6,4860,5530],[7,5530,6650],[8,6650,7750],[9,7750,8910],[10,8910,10320],[11,10320,10610],[12,10610,11520],[13,11520,11770],[14,11770,13340],[15,13340,13740],[16,13740,16619],[17,16619,18729],[18,18729,20199],[19,20199,20719],[20,20719,23149],[21,23149,24179],[22,24179,25499],[23,25499,25929],[24,25929,27019],[25,27019,28179],[26,28179,30629],[27,30629,31019],[28,31019,35664]]}}