{"name":"7:175","price":"Ngươi (hỡi Thiên Sứ) hãy xướng đọc cho họ nghe chuyện về một người đàn ông(5) mà TA đã ban cho y (kiến thức về) một vài Dấu Hiệu của TA nhưng y đã gạt bỏ chúng nên Shaytan đã bám theo y, thế là y trở thành kẻ lầm lạc.","arabic":"وَٱتۡلُ عَلَيۡهِمۡ نَبَأَ ٱلَّذِيٓ ءَاتَيۡنَٰهُ ءَايَٰتِنَا فَٱنسَلَخَ مِنۡهَا فَأَتۡبَعَهُ ٱلشَّيۡطَٰنُ فَكَانَ مِنَ ٱلۡغَاوِينَ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":1129,"juzNumber":9,"footnotes":"(5) Người đàn ông được đề cập đến thuộc dân Israel có tên gọi là Bal-‘am bin Ba-‘ura. Trong số kiến thức về các Dấu Hiệu của Allah mà Ngài đã ban cho ông ta có kiến thức về các đại danh của Ngài. Người đàn ông này đã biết được một đại danh đặc biệt của Allah. Khi ông ta cầu xin Allah bằng đại danh đó của Ngài, bất cứ điều gì ông ta cầu xin đều được Ngài chấp nhận và đáp lại. Tuy nhiên, vì quá tham vật chất thế gian nên ông ta đã trở thành một kẻ lầm lạc. Có lời nói rằng: Người đàn ông tên Bal’am bin Ba-‘ura này thuộc dân Israel vào thời của Nabi Musa. Allah đã ban cho ông ta kiến thức về các Dấu Hiệu của Ngài. Nabi Musa phái ông ta đi kêu gọi một vị vua của Madyan. Vị vua này đã trọng đãi ông ta và ban cho ông ta nhiều đặc ân khiến ông ta quên mất sứ mạng và trở thành một kẻ lầm lạc.","lang":"vi","version":{"key":"vietnamese_rwwad","direction":"ltr","language_iso_code":"vi","version":"1.0.6","last_update":1699531102,"title":"Vietnamese translation - Rowwad Translation Center","description":"Translation of the Quran meanings into Vietnamese by Rowwad Translation Center with cooperation with Islamhouse.com"},"meta":{"transliteration":"wa-ut'lu ʿalayhim naba-a alladhī ātaynāhu āyātinā fa-insalakha min'hā fa-atbaʿahu al-shayṭānu fakāna mina al-ghāwīna ","translations":["And recite","to them","(the) story","(of the) one whom","We gave [him]","Our Verses","but he detached","[from] them","so followed him","the Shaitaan","and he became","of","those gone astray","(175)"],"transliterationArr":["wa-ut'lu","ʿalayhim","naba-a","alladhī","ātaynāhu","āyātinā","fa-insalakha","min'hā","fa-atbaʿahu","al-shayṭānu","fakāna","mina","al-ghāwīna",null],"verseTiming":[[1,0,680],[2,680,1730],[3,1730,2210],[4,2210,4620],[5,4620,6060],[6,6060,7520],[7,7520,9600],[8,9600,10500],[9,10500,13889],[10,13889,15189],[11,15189,16559],[12,16559,17459],[13,17459,17799],[14,17799,20984]]}}