{"name":"7:190","price":"Tuy nhiên, khi Ngài ban cho hai vợ chồng họ đứa con tốt lành (như họ cầu mong) thì họ lại dựng lên những thần linh ngang vai với Ngài(6) về đứa con mà Ngài đã ban cho vợ chồng họ. Nhưng Allah luôn Tối Thượng vượt bên trên mọi thứ mà họ qui cho Ngài.","arabic":"فَلَمَّآ ءَاتَىٰهُمَا صَٰلِحٗا جَعَلَا لَهُۥ شُرَكَآءَ فِيمَآ ءَاتَىٰهُمَاۚ فَتَعَٰلَى ٱللَّهُ عَمَّا يُشۡرِكُونَ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":1144,"juzNumber":9,"footnotes":"(6) Có Hadith ghi lại rằng, trong những đợt con trai đầu, Adam đặt tên là ‘Abidullah và ‘Abdullah (nghĩa là nô lệ của Allah) nhưng tất cả đều chết yểu, thừa cơ hội nên Iblis đến xúi vợ chồng Adam và Hauwa, bảo: “Nếu hai ngươi đặt tên con trai mình bằng tên khác với cái tên đã từng đặt trước đây thì nó sẽ sống khỏe.” Thế là khi có con trai, Adam đã đặt tên là ‘Abdul Harith (nô lệ của Harith) và đứa con đó lại sống khỏe mạnh. (Trích từ Tafsir At-Tabari). Tuy nhiên, có nhiều Tafsir rằng, sự tổ hợp mà Allah muốn nói đến trong câu Kinh là ám chỉ một số cộng đồng loài người chứ không phải Adam và Hauwa.","lang":"vi","version":{"key":"vietnamese_rwwad","direction":"ltr","language_iso_code":"vi","version":"1.0.6","last_update":1699531102,"title":"Vietnamese translation - Rowwad Translation Center","description":"Translation of the Quran meanings into Vietnamese by Rowwad Translation Center with cooperation with Islamhouse.com"},"meta":{"transliteration":"falammā ātāhumā ṣāliḥan jaʿalā lahu shurakāa fīmā ātāhumā fataʿālā al-lahu ʿammā yush'rikūna ","translations":["But when","He gives them","a good, (child)","they make","for Him","partners","in what","He has given them","But exalted","(is) Allah","above what","they associate (with Him)","(190)"],"transliterationArr":["falammā","ātāhumā","ṣāliḥan","jaʿalā","lahu","shurakāa","fīmā","ātāhumā","fataʿālā","al-lahu","ʿammā","yush'rikūna",null],"verseTiming":[[1,0,2930],[2,2930,4360],[3,4360,6350],[4,6350,7260],[5,7260,7850],[6,7850,10430],[7,10430,12790],[8,12790,14340],[9,14340,15850],[10,15850,16700],[11,16700,18290],[12,18290,21925]]}}