{"name":"8:67","price":"Là một vị Nabi, Y không nên giữ lại các tù binh (trong chiến tranh) mà (hãy giết hết bọn chúng) không chừa tên nào sống trên trái đất.(2) Các ngươi muốn vật chất của trần gian còn Allah muốn (cuộc sống) Đời Sau. Quả thật Allah là Đấng Toàn Năng, Đấng Sáng Suốt.","arabic":"مَا كَانَ لِنَبِيٍّ أَن يَكُونَ لَهُۥٓ أَسۡرَىٰ حَتَّىٰ يُثۡخِنَ فِي ٱلۡأَرۡضِۚ تُرِيدُونَ عَرَضَ ٱلدُّنۡيَا وَٱللَّهُ يُرِيدُ ٱلۡأٓخِرَةَۗ وَٱللَّهُ عَزِيزٌ حَكِيمٞ","category":["8 (Al-Anfal)","Al-Anfal","Surah Al-Anfal","Chapter Al-Anfal","Anfal","Surah Anfal","Chapter Anfal","Al Anfal","Surah Al Anfal","Chapter Al Anfal","Surah 8","Chapter 8","The Spoils of War","الأنفَال"],"ayahNumber":1227,"juzNumber":10,"footnotes":"(2) Mệnh lệnh trong câu Kinh này đã bị xóa và được thế bằng mệnh lệnh trong câu 4 của chương 47 – Muhammad: “Vì vậy, khi các ngươi (hỡi những người có đức tin) giáp mặt với những kẻ vô đức tin (trong trận chiến) thì các ngươi hãy đánh vào cổ của chúng cho đến khi các ngươi thắng được chúng, rồi các ngươi hãy trói chặt chúng lại; sau đó, hoặc các ngươi trả tự do hoặc các ngươi bắt chúng chuộc mạng cho đến khi cuộc chiến chấm dứt. Đó (là lệnh của Allah). Và nếu muốn, Allah có thể đích thân trừng phạt chúng, tuy nhiên, Ngài muốn dùng người này để thử thách người kia. Và những ai bị giết vì con đường của Allah thì Ngài sẽ không bao giờ làm mất công lao của họ.” Thật ra, nguyên nhân câu Kinh 67 trên được mặc khải xuống là: Sau khi những người có đức tin đã giành chiến thắng những kẻ thờ đa thần Quraish trong trận Badr. Những người có đức tin đã bắt được 70 người từ phe địch làm tù binh. Thiên Sứ của Allah đã tham khảo ý kiến các vị Sahabah về việc xử trí những tù binh này như thế nào. Ông Abu Bakr thì cho rằng nên lấy tiền chuộc và thả họ. Ông Umar thì bảo rằng nên chém đầu họ tất cả để gieo nỗi sợ hãi cho kẻ thù như một sự cảnh cáo. Và cuối cùng Thiên Sứ đã lấy ý kiến của ông Abu Bakr và đã xử trí các tù binh theo ý kiến này. Thế là Allah đã mặc khải xuống câu Kinh 67 trên để khẳng định quan điểm của ông 'Umar là đúng và hợp lý trong thời điểm đó; bởi lẽ trong trận chiến Badr lực lượng của Islam vẫn còn ít, nếu xử trí các tù binh bằng cách nhận tiền chuộc và thả họ thì sẽ là bất lợi cho Islam.","lang":"vi","version":{"key":"vietnamese_rwwad","direction":"ltr","language_iso_code":"vi","version":"1.0.6","last_update":1699531102,"title":"Vietnamese translation - Rowwad Translation Center","description":"Translation of the Quran meanings into Vietnamese by Rowwad Translation Center with cooperation with Islamhouse.com"},"meta":{"transliteration":"mā kāna linabiyyin an yakūna lahu asrā ḥattā yuth'khina fī al-arḍi turīdūna ʿaraḍa al-dun'yā wal-lahu yurīdu al-ākhirata wal-lahu ʿazīzun ḥakīmun ","translations":["Not","is","for a Prophet","that","(there) should be","for him","prisoners of war","until","he has battled strenuously","in","the land","You desire","(the) commodities","(of) the world","but Allah","desires","(for you) the Hereafter","And Allah","(is) All-Mighty","All-Wise","(67)"],"transliterationArr":["mā","kāna","linabiyyin","an","yakūna","lahu","asrā","ḥattā","yuth'khina","fī","al-arḍi","turīdūna","ʿaraḍa","al-dun'yā","wal-lahu","yurīdu","al-ākhirata","wal-lahu","ʿazīzun","ḥakīmun",null],"verseTiming":[[1,0,580],[2,580,1230],[3,1230,2610],[4,2610,2870],[5,2870,3770],[6,3770,4530],[7,4530,6560],[8,6560,7410],[9,7410,8320],[10,8320,9180],[11,9180,9400],[12,9400,10760],[13,10760,11960],[14,11960,12590],[15,12590,13780],[16,13780,14940],[17,14940,15770],[18,15770,17500],[19,17500,18530],[20,18530,19550],[21,19550,22915]]}}