{"name":"58:1","price":"1. Sungguh, Allah telah mendengar ucapan perempuan yang mengajukan gugatan kepadamu (Muhammad) tentang suaminya, dan mengadukan (halnya) kepada Allah, dan Allah mendengar percakapan antara kamu berdua. Sesungguhnya Allah Maha Mendengar, Maha Melihat.*(833)","arabic":"قَدۡ سَمِعَ ٱللَّهُ قَوۡلَ ٱلَّتِي تُجَٰدِلُكَ فِي زَوۡجِهَا وَتَشۡتَكِيٓ إِلَى ٱللَّهِ وَٱللَّهُ يَسۡمَعُ تَحَاوُرَكُمَآۚ إِنَّ ٱللَّهَ سَمِيعُۢ بَصِيرٌ","category":["58 (Al-Mujadila)","Al-Mujadila","Surah Al-Mujadila","Chapter Al-Mujadila","Mujadila","Surah Mujadila","Chapter Mujadila","Al Mujadila","Surah Al Mujadila","Chapter Al Mujadila","Surah 58","Chapter 58","The Pleading Woman","المجادلة"],"ayahNumber":5105,"juzNumber":28,"footnotes":"*833). Sebab turunnya ayat ini ialah berhubungan dengan persoalan seorang perempuan yang bernama Khaulah binti Ṡa`labah yang telah dizihar oleh suaminya Aus bin Aṣ-Ṣamit, yaitu dengan mengatakan kepada istrinya, “Kamu bagiku sudah seperti punggung ibuku,” dengan maksud tidak tidak boleh lagi menggauli istrinya, sebagaimana dia tidak boleh menggauli ibunya. Menurut adat Jahiliah kalimat zihar seperti itu sudah sama dengan mentalak istri. Maka Khaulah mengadukan halnya itu kepada Rasulullah -ṣallallāhu 'alaihi wa sallam-, Rasulullah menjawab bahwa dalam hal ini belum ada keputusan Allah. Dan dalam riwayat yang lain Rasulullah mengatakan, “Engkau telah diharamkan menggauli dia.” Lalu Khaulah berkata, “Suamiku belum menyebut kata-kata talak,” kemudian Khaulah berulang-ualng mendesak kepada Rasulullah agar menetapkan suatu keputusan dalam hal ini, sehingga kemudian turunlah ayat ini dan ayat-ayat berikutnya.","lang":"id","version":{"key":"indonesian_sabiq","direction":"ltr","language_iso_code":"id","version":"1.1.2","last_update":1653548470,"title":"Indonesian Translation - Sabeq Company","description":"Translation of the Quran meanings into Indonesian by Sabeq Company, printed in 2016. corrected by Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qad samiʿa al-lahu qawla allatī tujādiluka fī zawjihā watashtakī ilā al-lahi wal-lahu yasmaʿu taḥāwurakumā inna al-laha samīʿun baṣīrun ","translations":["Indeed","Allah has heard","Allah has heard","(the) speech","(of one) who","disputes with you","concerning","her husband","and she directs her complaint","to","Allah","And Allah","hears","(the) dialogue of both of you","Indeed","Allah","(is) All-Hearer","All-Seer","(1)"],"transliterationArr":["qad","samiʿa","al-lahu","qawla","allatī","tujādiluka","fī","zawjihā","watashtakī","ilā","al-lahi","wal-lahu","yasmaʿu","taḥāwurakumā","inna","al-laha","samīʿun","baṣīrun",null],"verseTiming":[[1,0,370],[2,370,900],[3,900,1770],[4,1770,2310],[5,2310,3020],[6,3020,4120],[7,4120,4470],[8,4470,5450],[9,5450,7680],[10,7680,8000],[11,8000,8700],[12,8700,9690],[13,9690,10450],[14,10450,12120],[15,12120,13850],[16,13850,14610],[17,14610,16120],[18,16120,18735]]}}