{"meta":{"id":16,"length":402,"arabic":{"title":"الشمائل المحمدية","author":"الإمام الترمذي","introduction":""},"english":{"title":"Shama'il Muhammadiyah","author":"Imam Tirmidhi","introduction":""}},"chapters":[{"id":1,"bookId":16,"arabic":"باب ما جاء في خلق رسول الله صلى الله عليه وسلم","english":"The Noble Features Of Rasoolullah"},{"id":2,"bookId":16,"arabic":"باب ما جاء في خاتم النبوة","english":"Seal Of Nubuwwah (Prophethood) Of Rasoolullah"},{"id":3,"bookId":16,"arabic":"-باب ما جاء في شعر رسول الله صلى الله عليه وسلم","english":"The Mubarak Hair Of Rasoolullah"},{"id":4,"bookId":16,"arabic":"باب ما جاء في ترجل رسول الله صلى الله عليه وسلم","english":"The Combing Of The Hair Of Rasoolullah"},{"id":5,"bookId":16,"arabic":"باب ما جاء في شيب رسول الله صلى الله عليه وسلم","english":"Appearing Of The White Hair Of Rasoolullah"},{"id":6,"bookId":16,"arabic":"باب ما جاء في خضاب رسول الله صلى الله عليه وسلم","english":"Rasoolullah Using a Dye"},{"id":7,"bookId":16,"arabic":"باب ما جاء في كُحل رسول الله صلى الله عليه وسلم","english":"Kuhl Of Rasoolullah"},{"id":8,"bookId":16,"arabic":"باب ما جاء في لباس رسول الله صلى الله عليه وسلم","english":"The Dressing Of Rasoolullah"},{"id":null,"bookId":16,"arabic":"باب ماجاء في عيش رسول الله صلى الله عليه وسلم","english":"The Standard of Living of Rasoolullah"},{"id":9,"bookId":16,"arabic":"باب ما جاء في خف رسول الله صلى الله عليه وسلم","english":"The Khuff (Leather Socks) Of Rasoolullah"},{"id":10,"bookId":16,"arabic":"باب ماجاء في نعل رسول الله صلى الله عليه وسلم","english":"The Shoes Of Rasoolullah"},{"id":11,"bookId":16,"arabic":"باب ما جاء في ذكر خاتم رسول الله صلى الله عليه وسلم","english":"The Mubarak Ring Of Rasoolullah"},{"id":12,"bookId":16,"arabic":"باب ماجاء في تختم رسول الله صلى الله عليه وسلم","english":"Stating That Rasoolullah Wore The Ring On His Right Hand"},{"id":13,"bookId":16,"arabic":"باب ماجاء في صفة سَيْفِ رَسُولِ اللهِ صلى الله عليه وسلم","english":"The Sword Of Rasoolullah"},{"id":14,"bookId":16,"arabic":"باب ماجاء في صفة درع رَسُولِ اللهِصلى الله عليه وسلم","english":"The Armor Of Rasoolullah"},{"id":15,"bookId":16,"arabic":"باب ما جاء في صفة مغفر رسول الله صلى الله عليه وسلم","english":"The Helmet Of Rasoolullah"},{"id":16,"bookId":16,"arabic":"باب ما جاء في عمامة رسول الله صلى الله عليه وسلم","english":"The Turban Of Rasoolullah"},{"id":17,"bookId":16,"arabic":"باب ما جاء في صفة إزار رسول الله صلى الله عليه وسلم","english":"The Lungi Of Rasoolullah"},{"id":18,"bookId":16,"arabic":"باب ما جاء في مشية رسول الله صلى الله عليه وسلم","english":"The Walking Of Rasoolullah"},{"id":19,"bookId":16,"arabic":"باب ما جاء في تقنع رسول الله صلى الله عليه وسلم","english":"The Qinaa Of Rasoolullah"},{"id":20,"bookId":16,"arabic":"باب ما جاء في جلسته صلى الله عليه وسلم","english":"The Sitting Of Rasoolullah"},{"id":21,"bookId":16,"arabic":"باب ما جاء في تكأة رسول الله صلى الله عليه وسلم","english":"The Pillow Of Rasoolullah"},{"id":22,"bookId":16,"arabic":"باب ما جاء في اتكاء رسول الله صلى الله عليه وسلم","english":"Rasoolullah Leaning On Something Other Than a Pillow"},{"id":23,"bookId":16,"arabic":"باب ما جاء في أكل رسول الله صلى الله عليه وسلم","english":"Description Of The Eating Of Rasoolullah"},{"id":24,"bookId":16,"arabic":"باب ما جاء في صفة خبز رسول الله صلى الله عليه وسلم","english":"The Bread Of Rasoolullah"},{"id":25,"bookId":16,"arabic":"ما جاء في إدام رسول الله صلى الله عليه وسلم","english":"What Rasoolullah Would Eat with Bread"},{"id":26,"bookId":16,"arabic":"باب ما جاء في صفة وضوء رسول الله صلى الله عليه وسلم عند الطعام","english":"Rasoolullah Performing Wudu At The Time Of Eating"},{"id":27,"bookId":16,"arabic":"باب ما جاء في قول رسول الله صلى الله عليه وسلم قبل الطعام وعند الفراغ منه","english":"The Words That Of Rasoolullah Said Before and After Eating"},{"id":28,"bookId":16,"arabic":"باب ما جاء في قدح رسول الله صلى الله عليه وسلم","english":"The Cup Of Rasoolullah"},{"id":29,"bookId":16,"arabic":"باب ما جاء في صفة فاكهة رسول الله صلى الله عليه وسلم","english":"The Fruits Eaten By Rasoolullah"},{"id":30,"bookId":16,"arabic":"باب ما جاء في صفة شراب رسول الله صلى الله عليه وسلم","english":"Description Of The Things Rasoolullah Drank"},{"id":31,"bookId":16,"arabic":"باب ما جاء في شرب رسول الله صلى الله عليه وسلم","english":"Hadith Describing The Manner Rasoolullah Drank"},{"id":32,"bookId":16,"arabic":"باب ما جاء في تعطررسول الله صلى الله عليه وسلم","english":"Rasoolullah Using 'Itr"},{"id":33,"bookId":16,"arabic":"باب كيف كان كلام رسول الله صلى الله عليه وسلم","english":"The Speech Of rasoolullah"},{"id":34,"bookId":16,"arabic":"باب ما جاء في ضحك رسول الله صلى الله عليه وسلم","english":"The Laughing Of Rasoolullah"},{"id":35,"bookId":16,"arabic":"باب ما جاء في صفة مزاح رسول الله صلى الله عليه وسلم","english":"Description Of The Joking Of Rasoolullah"},{"id":36,"bookId":16,"arabic":"باب ما جاء في صفة كلام رسول الله صلى الله عليه وسلم في الشعر","english":"Description Of The Saying Of Rasoolullah On Poetry"},{"id":37,"bookId":16,"arabic":"باب ما جاء في كلام رسول الله صلى الله عليه وسلم في السمر","english":"Story Telling Of Rasoolullah At Night"},{"id":38,"bookId":16,"arabic":"حديث أم زرع","english":"Hadith of Umm Zar`"},{"id":39,"bookId":16,"arabic":"باب في صفة نوم رسول الله صلى الله عليه وسلم في السمر","english":"The Sleeping Of Rasoolullah"},{"id":40,"bookId":16,"arabic":"باب ما جاء في عبادة النبي صلى الله عليه وسلم","english":"Worship And Devotion Of Rasoolullah"},{"id":41,"bookId":16,"arabic":"باب صلاة الضحى","english":"Salaatut Duha (Chaast Prayers)"},{"id":42,"bookId":16,"arabic":"باب صلاة التطوع في البيت","english":"Sayyidina Rasoolullah Performing Nawaafil At Home"},{"id":43,"bookId":16,"arabic":"باب ماجاء في صوم رسول الله صلى الله عليه وسلم","english":"The Fasting Of Sayyidina Rasoolullah"},{"id":44,"bookId":16,"arabic":"باب ماجاء في قراءة رسول الله صلى الله عليه وسلم","english":"The Recital Of Sayyidina Rasoolullah"},{"id":45,"bookId":16,"arabic":"باب ماجاء في بكاء رسول الله صلى الله عليه وسلم","english":"The Weeping Of Sayyidina Rasoolullah"},{"id":46,"bookId":16,"arabic":"باب ماجاء في فراش رسول الله صلى الله عليه وسلم","english":"Narrations Of The Bed Of Sayyidina Rasoolullah"},{"id":47,"bookId":16,"arabic":"باب ماجاء في تواضع رسول الله صلى الله عليه وسلم","english":"The Humbleness Of Sayyidina Rasoolullah"},{"id":48,"bookId":16,"arabic":"باب ماجاء في خلق رسول الله صلى الله عليه وسلم","english":"Noble Character And Habits Of Sayyidina Rasoolullah"},{"id":49,"bookId":16,"arabic":"باب ماجاء في حياء رسول الله صلى الله عليه وسلم","english":"Modesty Of Sayyidina Rasoolullah"},{"id":50,"bookId":16,"arabic":"باب ماجاء في حجامة رسول الله صلى الله عليه وسلم","english":"Hajaamah (Cupping-Cautering) Of Sayyidina Rasoolullah"},{"id":51,"bookId":16,"arabic":"باب ماجاء في أسماء رسول الله صلى الله عليه وسلم","english":"The Names Of Sayyidina Rasoolullah"},{"id":52,"bookId":16,"arabic":"باب ماجاء في عيش رسول الله صلى الله عليه وسلم","english":"The Living Of Sayyidina Rasoolullah"},{"id":53,"bookId":16,"arabic":"باب ماجاء في سن رسول الله صلى الله عليه وسلم","english":"The Noble Age Of Sayyidina Rasoolullah"},{"id":54,"bookId":16,"arabic":"باب ماجاء في وفاة رسول الله صلى الله عليه وسلم","english":"The Death Of Sayyidina Rasoolullah"},{"id":55,"bookId":16,"arabic":"باب ماجاء في ميراث رسول الله صلى الله عليه وسلم","english":"The Legacy Of Sayyidina Rasoolullah"},{"id":56,"bookId":16,"arabic":"باب ماجاء في رؤية رسول الله صلى الله عليه وسلم","english":"The Seeing Of Rasoolullah In a Dream"}],"hadiths":{"0":{"id":49107,"idInBook":392,"chapterId":56,"bookId":16,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي الأَحْوَصِ، عَنْ عَبْدِ اللهِ بْنِ مَسْعُودٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم، قَالَ‏:‏ مَنْ رَآنِي فِي الْمَنَامِ فَقَدْ رَآنِي فَإِنَّ الشَّيْطَانَ لا يَتَمَثَّلُ بِي‏.‏","english":{"narrator":"'Abdullah ibn Mas'ud, that the Prophet said (Allah bless him and give him peace):","text":"“If someone sees me in his sleep, he has indeed seen me, for Satan cannot imitate me!\""},"hadithNumber":392,"hadithId":1},"1":{"id":49108,"idInBook":393,"chapterId":56,"bookId":16,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالا‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي حُصَينٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ مَنْ رَآنِي فِي الْمَنَامِ فَقَدْ رَآنِي، فَإِنَّ الشَّيْطَانَ لا يَتَصَوَّرُ أَوْ قَالَ‏:‏ لا يَتَشَبَّهُ بِي‏.‏","english":{"narrator":"Abu Huraira (may Allah be well pleased with him) said:","text":"“Allah’s Messenger said (Allah bless him and give him peace): ‘If someone sees me in his sleep, he has indeed seen me, for Satan cannot appear in disguise as me’(or: ‘cannot imitate me’).”"},"hadithNumber":393,"hadithId":2},"2":{"id":49109,"idInBook":394,"chapterId":56,"bookId":16,"arabic":"حَدَّثَنَا قُتَيْبَةُ، قَالَ‏:‏ حَدَّثَنَا خَلَفُ بْنُ خَلِيفَةَ، عَنْ أَبِي مَالِكٍ الأَشْجَعِيِّ، عَنْ أَبِيهِ، قَالَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ مَنْ رَآنِي فِي الْمَنَامِ فَقَدْ رَآنِي، قَالَ أَبُو عِيسَى‏:‏ وَأَبُو مَالِكٍ هَذَا هُوَ‏:‏ سَعْدُ بْنُ طَارِقِ بْنِ أَشْيَمَ، وَطَارِقُ بْنُ أَشْيَمَ هُوَ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم، وَقَدْ رَوَى عَنِ النَّبِيِّ صلى الله عليه وسلم أَحَادِيثَ","english":{"narrator":"Abu Malik al-Ashja'i reported that his father said:","text":"\"Allah’s Messenger said (Allah bless him and give him peace): “If someone sees me in his sleep, he has indeed seen me!”"},"hadithNumber":394,"hadithId":3},"3":{"id":49110,"idInBook":395,"chapterId":56,"bookId":16,"arabic":"سَمِعْتُ عَلِيَّ بْنَ حُجْرٍ، يَقُولُ‏:‏ قَالَ خَلَفُ بْنُ خَلِيفَةَ‏:‏ رَأَيْتُ عَمْرَو بْنَ حُرَيْثٍ صَاحِبَ النَّبِيِّ صلى الله عليه وسلم، وَأَنَا غُلامٌ صَغِيرٌ‏","english":{"narrator":"Khalaf ibn Khalifa said:","text":"“I saw Amr ibn Huraith, the Companion of the Prophet (Allah bless him and give him peace), when I was a little boy.”"},"hadithNumber":395,"hadithId":4},"4":{"id":49111,"idInBook":396,"chapterId":56,"bookId":16,"arabic":"حَدَّثَنَا قُتَيْبَةُ هُوَ ابْنُ سَعِيدٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، عَنْ عَاصِمِ بْنِ كُلَيْبٍ، قَالَ‏:‏ حَدَّثَنِي أَبِي، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ مَنْ رَآنِي فِي الْمَنَامِ فَقَدْ رَآنِي، فَإِنَّ الشَّيْطَانَ لا يَتَمَثَّلُنِي، قَالَ أَبِي‏:‏ فَحَدَّثْتُ بِهِ ابْنَ عَبَّاسٍ، فَقُلْتُ‏:‏ قَدْ رَأَيْتُهُ، فَذَكَرْتُ الْحَسَنَ بْنَ عَلِيٍّ، فَقُلْتُ‏:‏ شَبَّهْتُهُ بِهِ، فَقَالَ ابْنُ عَبَّاسٍ‏:‏ إِنَّهُ كَانَ يُشْبِهُهُ‏.‏","english":{"narrator":"'Asim ibn Kulaib’s father heard Abu Huraira say:","text":"“Allah’s Messenger (Allah bless him and give him peace) said: ‘If someone sees me in his sleep, he has indeed seen me, for Satan cannot imitate me!’ The father then related this to Ibn Abbas, saying that he had seen the Prophet. He also mentioned al-Hasan ibn ‘Ali, noting that he resembled the Prophet. To this Ibn 'Abbas replied, ‘Yes, he resembled him.’”"},"hadithNumber":396,"hadithId":5},"5":{"id":49112,"idInBook":397,"chapterId":56,"bookId":16,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ‏:‏ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، وَمُحَمَّدُ بْنُ جَعْفَرٍ، قَالا‏:‏ حَدَّثَنَا عَوْفُ بْنُ أَبِي جَمِيلَةَ، عَنْ يَزِيدَ الْفَارِسِيِّ وَكَانَ يَكْتُبُ الْمَصَاحِفَ، قَالَ‏:‏ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم فِي الْمَنَامِ زَمَنَ ابْنِ عَبَّاسٍ، قَالَ‏:‏ فَقُلْتُ لابْنِ عَبَّاسٍ‏:‏ إِنِّي رَأَيْتُ رَسُولَ اللهِ صلى الله عليه وسلم فِي النَّوْمِ، فَقَالَ ابْنُ عَبَّاسٍ‏:‏ إِنَّ رَسُولَ اللهِ كَانَ، يَقُولُ‏:‏ إِنَّ الشَّيْطَانَ لا يَسْتَطِيعُ أَنْ يَتَشَبَّهَ بِي، فَمَنْ رَآنِي فِي النَّوْمِ فَقَدْ رَآنِي، هَلْ تَسْتَطِيعُ أَنْ تَنْعَتَ هَذَا الرَّجُلَ الَّذِي رَأَيْتَهُ فِي النَّوْمِ‏؟‏ قَالَ‏:‏ نَعَمْ، أَنْعَتُ لَكَ رَجُلا بَيْنَ الرَّجُلَيْنِ، جِسْمُهُ وَلَحْمُهُ أَسْمَرُ إِلَى الْبَيَاضِ، أَكْحَلُ الْعَيْنَيْنِ، حَسَنُ الضَّحِكِ، جَمِيلُ دَوَائِرِ الْوَجْهِ، مَلأَتْ لِحْيَتُهُ مَا بَيْنَ هَذِهِ إِلَى هَذِهِ، قَدْ مَلأَتْ نَحْرَهُ، قَالَ عَوْفٌ‏:‏ وَلا أَدْرِي مَا كَانَ مَعَ هَذَا النَّعْتِ، فَقَالَ ابْنُ عَبَّاسٍ‏:‏ لَوْ رَأَيْتَهُ فِي الْيَقَظَةِ مَا اسْتَطَعْتَ أَنْ تَنْعَتَهُ فَوْقَ هَذَا‏.‏‏\n\nقال أبو عيسى: ويزيد الفارسي هو يزيد بن هرمز وهو أقدم من يزيد الرقاشي وروى يزيد الفارسي عن ابن عباس أحاديث.\nويزيد الرقاشي لم يدرك ابن عباس، وهو يزيد بن أبان الرقاشي وهو يروي عن أنس بن مالك. ويزيد الفارسي ويزيد الرقاشي كلاهما من أهل البصرة وعوف بن أبي جميلة هو عوف الأعرابي.","english":{"narrator":"Yazid al-Farisi, who used to inscribe copies of the Qur’an said:","text":"“I saw the Prophet (Allah bless him and give him peace) in my sleep in the time of Ibn 'Abbas, so I said to Ibn 'Abbas:\n‘I saw Allah’s Messenger (Allah bless him and give him peace) in my sleep!’\nIbn 'Abbas said: “Allah’s Messenger (Allah bless him and give him peace) used to say: ‘Satan cannot imitate me, so if someone sees me in his sleep, he has indeed seen me!’ Can you describe this man whom you saw in your sleep?” “Yes,” he said. “I shall describe for you an average man: his body and his flesh were brown-to-white; he was black eyed, endowed with a pleasant smile and handsome facial features; his beard went from here to here, and it came down over the top of his chest.”\n'Awf said: \"I do not know what could be added to this description,” and Ibn 'Abbas said: \"If you had seen him in the state of wakefulness, you could not have described him more accurately than this.”"},"hadithNumber":397,"hadithId":6},"6":{"id":49113,"idInBook":398,"chapterId":56,"bookId":16,"arabic":"حدثنا أبو داود سليمان بن سلم البلخي، حدثنا النضر بن شميل‏.‏ قال‏:‏ قال عوف الأعرابي‏:‏ أنا أكبر من قتادة‏.‏‏.‏","english":{"narrator":"(Regarding one of the narrators of the previous narration) `Awf (Abu Jamilah) al-A`rabi said:","text":"\"I am older then Qatadah.\""},"hadithNumber":398,"hadithId":7},"7":{"id":49114,"idInBook":399,"chapterId":56,"bookId":16,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ أَبِي زِيَادٍ، قَالَ‏:‏ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، قَالَ‏:‏ حَدَّثَنَا ابْنُ أَخِي ابْنِ شِهَابٍ الزُّهْرِيُّ، عَنْ عَمِّهِ، قَالَ‏:‏ قَالَ أَبُو سَلَمَةَ‏:‏ قَالَ أَبُو قَتَادَةَ‏:‏ قَالَ رَسُولُ اللهِ صلى الله عليه وسلم‏:‏ مَنْ رَآنِي، يَعْنِي فِي النَّوْمِ، فَقَدْ رَأَى الْحَقَّ‏.‏‏.‏","english":{"narrator":"Abu Qatada said:","text":"“Allah’s Messenger said (Allah bless him and give him peace): ‘If someone sees me (meaning in his sleep), he has seen me truly!'”"},"hadithNumber":399,"hadithId":8},"8":{"id":49115,"idInBook":400,"chapterId":56,"bookId":16,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، قَالَ‏:‏ حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْمُخْتَارِ، قَالَ‏:‏ حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسٍ‏:‏ أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم، قَالَ‏:‏ مَنْ رَآنِي فِي الْمَنَامِ فَقَدْ رَآنِي، فَإِنَّ الشَّيْطَانَ لا يَتَخَيَّلُ بِي وَقَالَ‏:‏ وَرُؤْيَا الْمُؤْمِنِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنَ النُّبُوَّةِ‏.‏","english":{"narrator":"Anas said:","text":"\"The Prophet said (Allah bless him and give him peace): 'If someone sees me in his sleep, he has indeed seen me, for Satan cannot impersonate me!' He also said: 'The vision of the believer is one of forty-six parts of Prophethood.'\""},"hadithNumber":400,"hadithId":9},"9":{"id":49116,"idInBook":401,"chapterId":56,"bookId":16,"arabic":"حدثنا محمد بن علي، قال سمعت أبي يقول‏:‏ قال عبد الله ابن المبارك‏:‏ إذا ابتليت بالقضاء فعليك بالأثر‏.‏","english":{"narrator":"Abdu llah ibn al-Mubarak said:","text":"“If you are afflicted with the responsibility of judgeship, you must follow the !”"},"hadithNumber":401,"hadithId":10},"10":{"id":49117,"idInBook":402,"chapterId":56,"bookId":16,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ عَلِيٍّ ، قَالَ : حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ ، قَالَ : أَنْبَأَنَا ابْنُ عَوْنٍ ، عَنِ ابْنِ سِيرِينَ ، قَالَ : \n\" هَذَا الْحَدِيثُ دِينٌ ، فَانْظُرُوا عَمَّنْ تَأَخُذُونَ دِينَكُمْ \" .","english":{"narrator":"Ibn Sirin said:","text":"\"This tradition  is religion, so consider from whom you accept your religion.”"},"hadithNumber":402,"hadithId":11},"11":{"id":49097,"idInBook":382,"chapterId":54,"bookId":16,"arabic":"حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ دَاوُدَ، قَالَ‏:‏ حَدَّثَنَا سَلَمَةُ بْنُ نُبَيْطٍ، عَنْ نُعَيْمِ بْنِ أَبِي هِنْدَ، عَنْ نُبَيْطِ بْنِ شَرِيطٍ، عَنْ سَالِمِ بْنِ عُبَيْدٍ، وَكَانَتْ لَهُ صُحْبَةٌ، قَالَ‏:‏ أُغْمِيَ عَلَى رَسُولِ اللهِ صلى الله عليه وسلم، فِي مَرَضِهِ فَأَفَاقَ، فَقَالَ‏:‏ حَضَرَتِ الصَّلاةُ‏؟‏ فَقَالُوا‏:‏ نَعَمْ فَقَالَ‏:‏ مُرُوا بِلالا فَلْيُؤَذِّنْ، وَمُرُوا أَبَا بَكْرٍ أَنْ يُصَلِّيَ للنَّاسِ أَوْ قَالَ‏:‏ بِالنَّاسِ، قَالَ‏:‏ ثُمَّ أُغْمِيَ عَلَيْهِ، فَأَفَاقَ، فَقَالَ‏:‏ حَضَرَتِ الصَّلاةُ‏؟‏ فَقَالُوا‏:‏ نَعَمْ فَقَالَ‏:‏ مُرُوا بِلالا فَلْيُؤَذِّنْ، وَمُرُوا أَبَا بَكْرٍ فَلْيُصَلِّ بِالنَّاسِ، فَقَالَتْ عَائِشَةُ‏:‏ إِنَّ أَبِي رَجُلٌ أَسِيفٌ، إِذَا قَامَ ذَلِكَ الْمَقَامَ بَكَى فَلا يَسْتَطِيعُ، فَلَوْ أَمَرْتَ غَيْرَهُ، قَالَ‏:‏ ثُمَّ أُغْمِيَ عَلَيْهِ فَأَفَاقَ فَقَالَ‏:‏ مُرُوا بِلالا فَلْيُؤَذِّنْ، وَمُرُوا أَبَا بَكْرٍ فَلْيُصَلِّ بِالنَّاسِ، فَإِنَّكُنَّ صَوَاحِبُ أَوْ صَوَاحِبَاتُ يُوسُفَ، قَالَ‏:‏ فَأُمِرَ بِلالٌ فَأَذَّنَ، وَأُمِرَ أَبُو بَكْرٍ فَصَلَّى بِالنَّاسِ، ثُمَّ إِنَّ رَسُولَ اللهِ صلى الله عليه وسلم، وَجَدَ خِفَّةً، فَقَالَ‏:‏ انْظُرُوا لِي مَنْ أَتَّكِئِ عَلَيْهِ، فَجَاءَتْ بَرِيرَةُ، وَرَجُلٌ آخَرُ، فَاتَّكَأَ عَلَيْهِمَا فَلَمَّا رَآهُ أَبُو بَكْرٍ ذَهَبَ لِينْكُصَ فَأَوْمَأَ إِلَيْهِ أَنْ يَثْبُتَ مَكَانَهُ، حَتَّى قَضَى أَبُو بَكْرٍ صَلاتَهُ‏.‏‏.‏\nثُمَّ إِنَّ رَسُولَ اللهِ صلى الله عليه وسلم قُبِضَ، فَقَالَ عُمَرُ‏:‏ وَاللَّهِ لا أَسْمَعُ أَحَدًا يَذْكُرُ أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم، قُبِضَ إِلا ضَرَبْتُهُ بِسَيْفِي هَذَا، قَالَ‏:‏ وَكَانَ النَّاسُ أُمِّيِّينَ لَمْ يَكُنْ فِيهِمْ نَبِيٌّ قَبْلَهُ، فَأَمْسَكَ النَّاسُ، فَقَالُوا‏:‏ يَا سَالِمُ، انْطَلِقْ إِلَى صَاحِبِ رَسُولِ اللهِ صلى الله عليه وسلم فَادْعُهُ، فَأَتَيْتُ أَبَا بَكْرٍ وَهُوَ فِي الْمَسْجِدِ فَأَتَيْتُهُ أَبْكِي دَهِشًا، فَلَمَّا رَآنِي، قَالَ‏:‏ أَقُبِضَ رَسُولُ اللهِ صلى الله عليه وسلم‏؟‏ قُلْتُ‏:‏ إِنَّ عُمَرَ، يَقُولُ‏:‏ لا أَسْمَعُ أَحَدًا يَذْكُرُ أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قُبِضَ إِلا ضَرَبْتُهُ بِسَيْفِي هَذَا، فَقَالَ لِي‏:‏ انْطَلِقْ، فَانْطَلَقْتُ مَعَهُ، فَجَاءَ هُوَ وَالنَّاسُ قَدْ دَخَلُوا عَلَى رَسُولِ اللهِ صلى الله عليه وسلم، فَقَالَ‏:‏ يَا أَيُّهَا النَّاسُ، أَفْرِجُوا لِي، فَأَفْرَجُوا لَهُ فَجَاءَ حَتَّى أَكَبَّ عَلَيْهِ وَمَسَّهُ، فَقَالَ‏:‏ إِنَّكَ مَيِّتٌ وَإِنَّهُمْ مَيِّتُونَ، ثُمَّ قَالُوا‏:‏ يَا صَاحِبَ رَسُولِ اللهِ صلى الله عليه وسلم، أَقُبِضَ رَسُولُ اللهِ صلى الله عليه وسلم‏؟‏ قَالَ‏:‏ نَعَمْ، فَعَلِمُوا أَنْ قَدْ صَدَقَ، قَالُوا‏:‏ يَا صَاحِبَ رَسُولِ اللهِ صلى الله عليه وسلم، أَيُصَلَّى عَلَى رَسُولِ اللهِ‏؟‏ قَالَ‏:‏ نَعَمْ، قَالُوا‏:‏ وَكَيْفَ‏؟‏ قَالَ‏:‏ يَدْخُلُ قَوْمٌ فَيُكَبِّرُونَ وَيُصَلُّونَ، وَيَدْعُونَ، ثُمَّ يَخْرُجُونَ، ثُمَّ يَدْخُلُ قَوْمٌ فَيُكَبِّرُونَ وَيُصَلُّونَ وَيَدْعُونَ، ثُمَّ يَخْرُجُونَ، حَتَّى يَدْخُلَ النَّاسُ، قَالُوا‏:‏ يَا صَاحِبَ رَسُولِ اللهِ صلى الله عليه وسلم، أَيُدْفَنُ رَسُولُ اللهِ صلى الله عليه وسلم‏؟‏ قَالَ‏:‏ نَعَمْ، قَالُوا‏:‏ أَينَ‏؟‏ قَالَ‏:‏ فِي الْمكَانِ الَّذِي قَبَضَ اللَّهُ فِيهِ رُوحَهُ، فَإِنَّ اللَّهَ لَمْ يَقْبِضْ رُوحَهُ إِلا فِي مَكَانٍ طَيِّبٍ فَعَلِمُوا أَنْ قَدْ صَدَقَ، ثُمَّ أَمَرَهُمْ أَنْ يَغْسِلَهُ بَنُو أَبِيهِ، وَاجْتَمَعَ الْمُهَاجِرُونَ يَتَشَاوَرُونَ، فَقَالُوا‏:‏ انْطَلِقْ بِنَا إِلَى إِخْوانِنَا مِنَ الأَنْصَارِ نُدْخِلُهُمْ مَعَنَا فِي هَذَا الأَمْرِ، فَقَالَتِ الأَنْصَارُ‏:‏ مِنَّا أَمِيرٌ وَمِنْكُمْ أَمِيرٌ، فَقَالَ عُمَرُ بْنُ الْخَطَّابِ‏:‏ مَنْ لَهُ مِثْلُ هَذِهِ الثَّلاثِ ثَانِيَ اثْنَيْنِ إِذْ هُمَا فِي الْغَارِ إِذْ يَقُولُ لِصَاحِبِهِ لا تَحْزَنْ إِنَّ اللَّهَ مَعَنَا مَنْ هُمَا‏؟‏ قَالَ‏:‏ ثُمَّ بَسَطَ يَدَهُ فَبَايَعَهُ وَبَايَعَهُ النَّاسُ بَيْعَةً حَسَنَةً جَمِيلَةً‏.‏","english":{"narrator":"Salim ibn 'Ubaida said:","text":"“Allah’s Messenger (Allah bless him and give him peace) lost consciousness in his illness, then he regained consciousness and said: ‘Has the ritual prayer arrived?’ They said: ‘Yes,’ so he said: ‘Command Bilal to give the call to prayer, and command Abu Bakr to lead the people in prayer.’ Then he lost consciousness, and when he recovered, he said: ‘Has the ritual prayer arrived?’ They said: ‘Yes,’ so he said: ‘Command Bilal to give the call to prayer, and command Abu Bakr to lead the people in prayer.’ 'A'isha then said: ‘My father is a melancholy man. If he is given that responsibility, he will weep and lose command of himself. SO if only you would appoint someone else!'\nHe  said: “Then he lost consciousness and recovered, so he said: ‘Command Bilal to give the call to prayer, and command Abu Bakr to lead the people in prayer, for you are the female companions of Yusuf!’ Bilal was therefore commanded, so he gave the call to prayer, and Abu Bakr was commanded, so he led the people in prayer. Then Allah’s Messenger (Allah bless him and give him peace) felt light in the head, so he said: ‘Find me someone I can lean on!’ Barira and another man therefore came to him, so he leaned on them. When Abu Bakr saw him, the man was about to withdraw, but he signaled for him to stay in his place until Abu Bakr completed his ritual prayer. Then Allah’s Messenger died (Allah bless him and give him peace), so 'Umar said: ‘If I hear anyone mention that Allah’s Messenger (Allah bless him and give him peace) has died, I will strike him with this sword of mine!”’\nHe  said: “The people were unlettered folk among whom there had never come a prophet before, so they held their tongues. But then they said: ‘O Salim, go to the Companion of Allah’s Messenger (Allah bless him and give him peace) and summon him.’ So I went to see Abu Bakr, in the mosque. I came to him weeping and perplexed, so when he saw me, he said: ‘Has Allah’s Messenger died (Allah bless him and give him peace)?’ I replied: 'Umar says: “If anyone mentions that Allah’s Messenger (Allah bless him and give him peace) has died, I will strike him with this sword of mine!” He then said to me: ‘Go outside,’ so I went outside with him. Then he came and found the people in the presence of Allah’s Messenger (Allah bless him and give him peace).\n“He therefore said: ‘O people, get out of my way,’ so they got out of his way. Then he leaned over him and touched him, saying: “You will surely die, and they will surely die.\" .’” (Al-Qur'an.9:4O). Who are the two of them?’ Then he extended his hand, so they pledged allegiance to him, and the people paid him a beautiful homage.”"},"hadithNumber":382,"hadithId":12},"12":{"id":49098,"idInBook":383,"chapterId":54,"bookId":16,"arabic":"حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ الزُّبَيْرِ، شَيْخٌ بَاهِلِيٌّ قَدِيمٌ بَصْرِيٌّ قَالَ‏:‏ حَدَّثَنَا ثَابِتٌ الْبُنَانِيُّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ‏:‏ لَمَّا وَجَدَ رَسُولُ اللهِ صلى الله عليه وسلم، مِنْ كُرَبِ الْمَوْتِ مَا وَجَدَ، قَالَتْ فَاطِمَةُ‏:‏ وَاكَرْبَاهُ، فَقَالَ النَّبِيُّ صلى الله عليه وسلم‏:‏ لا كَرْبَ عَلَى أَبِيكِ بَعْدَ الْيَوْمِ، إِنَّهُ قَدْ حَضَرَ مِنْ أَبِيكِ مَا لَيْسَ بِتَارِكٍ مِنْهُ أَحَدًا الْمُوافَاةُ يَوْمَ الْقِيَامَةِ‏.‏","english":{"narrator":"Anas ibn Malik said:","text":"\"When Allah’s Messenger (Allah bless him and give him peace) was enduring of the agony of death, Fatima (may Allah be well pleased with her) exclaimed: 'Alas for his agony!' to which the Prophet replied (Allah bless him and\ngive him peace): 'Your father will suffer no agony from this day forth. Your father has met the fate from which no one is exempt, and which precedes ones appearance before Allah\non the Day of Resurrection.'”"},"hadithNumber":383,"hadithId":13},"13":{"id":49099,"idInBook":384,"chapterId":54,"bookId":16,"arabic":"حَدَّثَنَا أَبُو الْخَطَّابِ زِيَادُ بْنُ يَحْيَى الْبَصْرِيُّ، وَنَصْرُ بْنُ عَلِيٍّ، قَالا‏:‏ حَدَّثَنَا عَبْدُ رَبِّهِ بْنُ بَارِقٍ الْحَنَفِيُّ، قَالَ‏:‏ سَمِعْتُ جَدِّي أَبَا أُمِّي سِمَاكَ بْنَ الْوَلِيدِ يُحَدِّثُ، أَنَّهُ سَمِعَ ابْنَ عَبَّاسٍ، يُحَدِّثُ أَنَّهُ سَمِعَ رَسُولَ اللهِ صلى الله عليه وسلم، يَقُولُ‏:‏ مَنْ كَانَ لَهُ فَرَطَانِ مِنْ أُمَّتِي أَدْخَلَهُ اللَّهُ تَعَالَى بِهِمَا الْجَنَّةَ، فَقَالَتْ عَائِشَةُ‏:‏ فَمَنْ كَانَ لَهُ فَرَطٌ مِنْ أُمَّتِكَ‏؟‏ قَالَ‏:‏ وَمَنْ كَانَ لَهُ فَرَطٌ يَا مُوَفَّقَةُ قَالَتْ‏:‏ فَمَنْ لَمْ يَكُنْ لَهُ فَرَطٌ مِنْ أُمَّتِكَ‏؟‏ قَالَ‏:‏ فَأَنَا فَرَطٌ لأُمَّتِي، لَنْ يُصَابُوا بِمِثْلِي‏.‏","english":{"narrator":"Ibn 'Abbas (may Allah the Exalted be well pleased with him and his father) related that:","text":"he heard Allah’s Messenger say (Allah bless him and give him peace): 'If someone has two children from my Community who died an untimely death, Allah will cause him to enter the Garden of Paradise on their account,' so 'A'isha said (may Allah be well pleased with her): 'What about someone who has only one child from your Community who has died an untimely death?' He said: 'Also someone who has only one child who has died young, O favored one!' She said: 'So what about someone who does not have any child from your Community who has died as an infant?' He said: 'I am a child of my Community who died an untimely death. Never again will they be afflicted by the loss of the likes of me!'”"},"hadithNumber":384,"hadithId":14},"14":{"id":49060,"idInBook":345,"chapterId":48,"bookId":16,"arabic":"حَدَّثَنَا عَلِيُّ بْنُ خَشْرَمٍ، وَغَيْرُ وَاحِدٍ، قَالُوا‏:‏ حَدَّثَنَا عِيسَى بْنُ يُونُسَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ‏:‏ أَنَّ النَّبِيَّ صلى الله عليه وسلم، كَانَ يَقْبَلُ الْهَدِيَّةَ، وَيُثِيبُ عَلَيْهَا‏.‏","english":{"narrator":"'A’isha said (may Allah be well pleased with her):","text":"\"The Prophet (Allah bless him and give him peace) used to accept gifts and provide recompense of greater value.”"},"hadithNumber":345,"hadithId":15},"15":{"id":49016,"idInBook":301,"chapterId":43,"bookId":16,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ صَالِحٍ، قَالَ‏:‏ حَدَّثَنِي مُعَاوِيَةُ بْنُ صَالِحٍ، عَنْ عَمْرِو بْنِ قَيْسٍ، أَنَّهُ سَمِعَ عَاصِمَ بْنَ حُمَيْدٍ، قَالَ‏:‏ سَمِعْتُ عَوْفَ بْنَ مَالِكٍ، يَقُولُ‏:‏ كُنْتُ مَعَ رَسُولِ اللهِ صلى الله عليه وسلم، لَيْلَةً فَاسْتَاكَ، ثُمَّ تَوَضَّأَ، ثُمَّ قَامَ يُصَلِّي، فَقُمْتُ مَعَهُ فَبَدَأَ فَاسْتَفْتَحَ الْبَقَرَةَ، فَلا يَمُرُّ بِآيَةِ رَحْمَةٍ، إِلا وَقَفَ فَسَأَلَ، وَلا يَمُرُّ بِآيَةِ عَذَابٍ، إِلا وَقَفَ فَتَعَوَّذَ، ثُمَّ رَكَعَ فَمَكَثَ رَاكِعًا بِقَدْرِ قِيَامِهِ، وَيَقُولُ فِي رُكُوعِهِ‏:‏ سُبْحَانَ ذِي الْجَبَرُوتِ وَالْمَلَكُوتِ، وَالْكِبْرِيَاءِ وَالْعَظَمَةِ، ثُمَّ سَجَدَ بِقَدْرِ رُكُوعِهِ، وَيَقُولُ فِي سُجُودِهِ‏:‏ سُبْحَانَ ذِي الْجَبَرُوتِ وَالْمَلَكُوتِ، وَالْكِبْرِيَاءِ وَالْعَظَمَةِ ثُمَّ قَرَأَ آلَ عِمْرَانَ ثُمَّ سُورَةً، يَفْعَلُ مِثْلَ ذَلِكَ في كل ركعة‏.‏","english":{"narrator":"Awf bin Malik said:","text":"\"When I was together with Allah’s Messenger (Allah bless him and give him peace) one night, he cleaned his teeth, then performed the minor ablution, then performed the ritual prayer. I stood up with him, whereupon he began with the Sura of the Cow  followed by another Sura, and he did this in every cycle of the ritual prayer.”"},"hadithNumber":301,"hadithId":16},"16":{"id":48983,"idInBook":268,"chapterId":40,"bookId":16,"arabic":"حَدَّثَنَا إِسْحَاقُ بْنُ مُوسَى الأَنْصَارِيُّ، قَالَ‏:‏ حَدَّثَنَا مَعْنٌ، قَالَ‏:‏ حَدَّثَنَا مَالِكٌ، عَنْ أَبِي النَّضْرِ، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ‏:‏ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُصَلِّي جَالِسًا، فَيَقْرَأُ وَهُوَ جَالِسٌ، فَإِذَا بَقِيَ مِنْ قِرَاءَتِهِ قَدْرُ مَا يَكُونُ ثَلاثِينَ أَوْ أَرْبَعِينَ آيَةً، قَامَ فَقَرَأَ وَهُوَ قَائِمٌ، ثُمَّ رَكَعَ وَسَجَدَ، ثُمَّ صَنَعَ فِي الرَّكْعَةِ الثَّانِيَةِ مِثْلَ ذَلِكَ‏.‏","english":{"narrator":"'A’isha said (may Allah be well pleased with her):","text":"“The Prophet (Allah bless him and give him peace) used to perform the ritual prayer sitting down, so he would also recite the Qur’an while he was seated. If the amount of his recitation remaining was thirty or forty verses, he would rise and recite standing up, and then he would bow and prostrate. Then he would do likewise in the second cycle.”"},"hadithNumber":268,"hadithId":17},"17":{"id":48984,"idInBook":269,"chapterId":40,"bookId":16,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، قَالَ‏:‏ حَدَّثَنَا هُشَيْمٌ، قَالَ‏:‏ حَدَّثَنَا خَالِدٌ الْحَذَّاءُ، عَنْ عَبْدِ اللهِ بْنِ شَقِيقٍ، قَالَ‏:‏ سَأَلْتُ عَائِشَةَ، عَنْ صَلاةِ رَسُولِ اللهِ صلى الله عليه وسلم، عَنْ تَطَوُّعِهِ، فَقَالَتْ‏:‏ كَانَ يُصَلِّي لَيْلا طَوِيلا قَائِمًا، وَلَيْلا طَوِيلا قَاعِدًا، فَإِذَا قَرَأَ وَهُوَ قَائِمٌ رَكَعَ وَسَجَدَ وَهُوَ قَائِمٌ، وَإِذَا قَرَأَ وَهُوَ جَالِسٌ رَكَعَ وَسَجَدَ وَهُوَ جَالِسٌ‏.‏","english":{"narrator":"'Abdullah ibn Shaqiq said:","text":"“I asked 'A’isha (may Allah be well pleased with her) about the voluntary ritual prayers of Allah’s Messenger (Allah bless him and give him peace), and she said: ‘He used to spend a long night performing the ritual prayer while standing, and a long night while sitting, so if he recited the Qur’an while standing, he would bow and prostrate from a standing position, and if he recited while sitting, he would bow and prostrate from a sitting position.”"},"hadithNumber":269,"hadithId":18},"18":{"id":48985,"idInBook":270,"chapterId":40,"bookId":16,"arabic":"حَدَّثَنَا إِسْحَاقُ بْنُ مُوسَى الأَنْصَارِيُّ، قَالَ‏:‏ حَدَّثَنَا مَعْنٌ، قَالَ‏:‏ حَدَّثَنَا مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنِ السَّائِبِ بْنِ يَزِيدَ، عَنِ الْمُطَّلِبِ بْنِ أَبِي وَدَاعَةَ، عَنْ حَفْصَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم، قَالَتْ‏:‏ كَانَ رَسُولُ اللهِ يُصَلِّي فِي سُبْحَتِهِ قَاعِدًا، وَيَقْرَأُ بِالسُّورَةِ وَيُرَتِّلُهَا، حَتَّى تَكُونَ أَطْوَلَ مِنْ أَطْوَلَ مِنْهَا‏.‏","english":{"narrator":"Hafsa, the wife of the Prophet (Allah bless him and give him peace), said:","text":"“Allah’s Messenger (Allah bless him and give him peace) used to perform voluntary ritual prayer sitting down , and he would recite the Sura and pronounce it slowly, so that it would seem to be longer than one that was actually longer than it.”"},"hadithNumber":270,"hadithId":19},"19":{"id":48986,"idInBook":271,"chapterId":40,"bookId":16,"arabic":"حَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدٍ الزَّعْفَرَانِيُّ، قَالَ‏:‏ حَدَّثَنَا الْحَجَّاجُ بْنُ مُحَمَّدٍ، عَنِ ابْنِ جُرَيْجٍ، قَالَ‏:‏ أَخْبَرَنِي عُثْمَانُ بْنُ أَبِي سُلَيْمَانَ، أَنَّ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ أَخْبَرَهُ، أَنَّ عَائِشَةَ أَخْبَرَتْهُ، أَنَّ النَّبِيَّ صلى الله عليه وسلم، لَمْ يَمُتْ، حَتَّى كَانَ أَكْثَرُ صَلاتِهِ وَهُوَ جَالِسٌ‏.‏","english":{"narrator":"A’isha said (may Allah be well pleased with her):","text":"“By the time the Prophet (Allah bless him and give him peace) died, he was performing most of his ritual prayers from a sitting position.”"},"hadithNumber":271,"hadithId":20},"20":{"id":48987,"idInBook":272,"chapterId":40,"bookId":16,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، قَالَ‏:‏ حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، قَالَ‏:‏ حَدَّثَنَا أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ‏:‏ صَلَّيْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم، رَكْعَتَيْنِ قَبْلَ الظُّهْرِ، وَرَكْعَتَيْنِ بَعْدَهَا، وَرَكْعَتَيْنِ بَعْدَ الْمَغْرِبِ فِي بَيْتِهِ، وَرَكْعَتَيْنِ بَعْدَ الْعِشَاءِ فِي بَيْتِهِ‏.‏","english":{"narrator":"Ibn ‘'Umar said (may Allah be well pleased with him and his father):","text":"\"I performed two cycles of ritual prayer with Allah’s Messenger (Allah bless him and give him peace) before the noon prayer, and two cycles after it, and two cycles after the sunset prayer in his house, and two cycles after the evening prayer in his house.”"},"hadithNumber":272,"hadithId":21},"21":{"id":48988,"idInBook":273,"chapterId":40,"bookId":16,"arabic":"حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، قَالَ‏:‏ حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، قَالَ‏:‏ حَدَّثَنَا أَيُّوبُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ‏:‏ حَدَّثَتْنِي حَفْصَةُ‏:‏ أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم، كَانَ يُصَلِّي رَكْعَتَيْنِ حِينَ يَطْلُعُ الْفَجْرُ وَيُنَادِي الْمُنَادِي، قَالَ أَيُّوبُ‏:‏ وَأُرَاهُ، قَالَ‏:‏ خَفِيفَتَيْنِ‏.‏","english":{"narrator":"Ibn 'Umar said (may Allah be well pleased with him and his father):","text":"“Hafsa said:\n'Allah’s Messenger (Allah bless him and give him peace) used to perform two cycles of ritual prayer when the dawn was rising, and the caller  was calling'. And Ayyub said, “I think he described the two prayer cycles as abbreviated.”"},"hadithNumber":273,"hadithId":22},"22":{"id":48989,"idInBook":274,"chapterId":40,"bookId":16,"arabic":"حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ‏:‏ حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ الْفَزَارِيُّ، عَنْ جَعْفَرِ بْنِ بُرْقَانَ، عَنْ مَيْمُونِ بْنِ مِهْرَانَ، عَنِ ابْنِ عُمَرَ، قَالَ‏:‏ حَفِظْتُ مِنْ رَسُولِ اللهِ صلى الله عليه وسلم، ثَمَانِيَ رَكَعَاتٍ‏:‏ رَكْعَتَيْنِ قَبْلَ الظُّهْرِ، وَرَكْعَتَيْنِ بَعْدَهَا، وَرَكْعَتَيْنِ بَعْدَ الْمَغْرِبِ، وَرَكْعَتَيْنِ بَعْدَ الْعِشَاءِ، قَالَ ابْنُ عُمَرَ‏:‏ وَحَدَّثَتْنِي حَفْصَةُ بِرَكْعَتَيِ الْغَدَاةِ، وَلَمْ أَكُنْ أَرَاهُمَا مِنَ النَّبِيِّ صلى الله عليه وسلم‏.‏","english":{"narrator":"Ibn 'Umar said (may Allah be well pleased with him and his father):","text":"\"I recall eight cycles performed by Allah’s Messenger (Allah bless him and give him peace): two cycles before the noon prayer and two cycles after it, two cycles after the sunset prayer, and two cycles after the evening prayer.”\nIbn ‘Umar said: “Hafsa also told me about the two cycles of the early-morning prayer , but I did not see them performed by the Prophet (Allah bless him and give him peace).”"},"hadithNumber":274,"hadithId":23},"23":{"id":48990,"idInBook":275,"chapterId":40,"bookId":16,"arabic":"حَدَّثَنَا أَبُو سَلَمَةَ يَحْيَى بْنُ خَلَفٍ، قَالَ‏:‏ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ عَبْدِ اللهِ بْنِ شَقِيقٍ، قَالَ‏:‏ سَأَلتُ عَائِشَةَ، عَنْ صَلاةِ النَّبِيِّ صلى الله عليه وسلم، قَالَتْ‏:‏ كَانَ يُصَلِّي قَبْلَ الظُّهْرِ رَكْعَتَيْنِ وَبَعْدَهَا رَكْعَتَيْنِ، وَبَعْدَ الْمَغْرِبِ رَكْعَتَيْنِ، وَبَعْدَ الْعِشَاءِ رَكْعَتَيْنِ، وَقَبْلَ الْفَجْرِ ثِنْتَيْنِ‏.‏","english":{"narrator":"Abdullah ibn Shaqiq said:","text":"\"I asked 'A’isha (may Allah be well pleased with her) about the ritual prayer of Allah’s Messenger (Allah bless him and give him peace), and she said: 'He used to perform two cycles of ritual prayer before the noon prayer and two cycles after it, two cycles after the\nsunset prayer, two cycles after the evening prayer, and two before the dawn prayer.’”"},"hadithNumber":275,"hadithId":24},"24":{"id":48991,"idInBook":276,"chapterId":40,"bookId":16,"arabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ‏:‏ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ‏:‏ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، قَالَ‏:‏ سَمِعْتُ عَاصِمَ بْنَ ضَمْرَةَ، يَقُولُ‏:‏ سَأَلْنَا عَلِيًّا، عَنْ صَلاةِ رَسُولِ اللهِ صلى الله عليه وسلم مِنَ النَّهَارِ، فَقَالَ‏:‏ إِنَّكُمْ لا تُطِيقُونَ ذَلِكَ، قَالَ‏:‏ فَقُلْنَا‏:‏ مِنْ أَطَاقَ ذَلِكَ مِنَّا صَلَّى، فَقَالَ‏:‏ كَانَ إِذَا كَانَتِ الشَّمْسُ مِنْ هَهُنَا كَهَيْئَتِهَا مِنْ هَهُنَا عِنْدَ الْعَصْرِ صَلَّى رَكْعَتَيْنِ، وَإِذَا كَانَتِ الشَّمْسُ مِنْ هَهُنَا، كَهَيْئَتِهَا مِنْ هَهُنَا عِنْدَ الظُّهْرِ صَلَّى أَرْبَعًا، وَيُصَلِّي قَبْلَ الظُّهْرِ أَرْبَعًا، وَبَعْدَهَا رَكْعَتَيْنِ، وَقَبْلَ الْعَصْرِ أَرْبَعًا، يَفْصِلُ بَيْنَ كُلِّ رَكْعَتَيْنِ بِالتَّسْلِيمِ عَلَى الْمَلائِكَةِ الْمُقَرَّبِينَ وَالنَّبِيِّينَ، وَمَنْ تَبِعَهُمْ مِنَ الْمُؤْمِنِينَ وَالْمُسْلِمِينَ‏.‏","english":{"narrator":"'Asim ibn Damra said:","text":"“We asked 'Ali (may Allah ennoble his countenance) about the ritual prayer of Allah’s Messenger (Allah bless him and give him peace) in the daytime, and he said:\n‘You would be incapable of that,’ so we said: Anyone of us who is capable of that will perform it!’ He therefore said: ‘When the sun was from over here , at the time of the afternoon prayer, he used to perform two cycles of ritual prayer, and when the sun was from over here, like its appearance from over here, at the time of the midday prayer, he would perform four. He would also perform four cycles before the midday prayer and two after it, and four before the afternoon prayer, separating each pair of cycles with the salutation of peace upon the angels drawn near, and upon the Prophets and the believers and Muslims who follow them'.”"},"hadithNumber":276,"hadithId":25},"25":{"id":48886,"idInBook":171,"chapterId":25,"bookId":16,"arabic":"حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنِ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ رَأَى رَسُولَ اللهِ صلى الله عليه وسلم، تَوَضَّأَ مِنْ أَكْلِ ثَوْرِ أَقِطٍ، ثُمَّ رَآهُ أَكَلَ مِنْ كَتِفِ شَاةٍ، ثُمَّ صَلَّى، وَلَمْ يَتَوَضَّأْ‏.‏","english":{"narrator":"","text":"Abu Huraira (may Allah be well pleased with him) said that he saw Allah’s Messenger (Allah bless him and give him peace) perform the minor ritual ablution because of eating cottage cheese. Then he saw him eat from the flank of a sheep, and then perform the ritual prayer without performing the minor ritual ablution."},"hadithNumber":171,"hadithId":26},"26":{"id":48887,"idInBook":172,"chapterId":25,"bookId":16,"arabic":"حَدَّثَنَا ابْنُ أَبِي عُمَرَ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ وَائِلِ بْنِ دَاوُدَ، عَنِ ابْنِهِ، وَهُوَ بَكْرُ بْنُ وَائِلٍ، عَنِ الزُّهْرِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ‏:‏ أَوْلَمَ رَسُولُ اللهِ صلى الله عليه وسلم عَلَى صَفِيَّةَ بِتَمْرٍ وَسَوِيقٍ‏.‏","english":{"narrator":"Anas ibn Malik said:","text":"\"Allah’s Messenger (Allah bless him and give him peace) gave a wedding banquet for Safiyya consisting of dried dates and parched barley.”"},"hadithNumber":172,"hadithId":27},"27":{"id":48888,"idInBook":173,"chapterId":25,"bookId":16,"arabic":"حَدَّثَنَا الْحُسَيْنُ بْنُ مُحَمَّدٍ الْبَصْرِيُّ، قَالَ‏:‏ حَدَّثَنَا الْفُضَيْلُ بْنُ سُلَيْمَانَ، قَالَ‏:‏ حَدَّثَنِي فَائِدٌ، مَوْلَى عُبَيْدِ اللهِ بْنِ عَلِيِّ بْنِ أَبِي رَافِعٍ مَوْلَى رَسُولِ اللهِ صلى الله عليه وسلم، قَالَ‏:‏ حَدَّثَنِي عُبَيْدُ اللهِ بْنُ عَلِيٍّ، عَنْ جَدَّتِهِ سَلْمَى، أَنَّ الْحَسَنَ بْنَ عَلِيٍّ، وَابْنَ عَبَّاسٍ، وَابْنَ جَعْفَرٍ أَتَوْهَا فَقَالُوا لَهَا‏:‏ اصْنَعِي لَنَا طَعَامًا مِمَّا كَانَ يُعْجِبُ رَسُولَ اللهِ صلى الله عليه وسلم، وَيُحْسِنُ أَكْلَهُ فَقَالَتْ‏:‏ يَا بُنَيَّ لا تَشْتَهِيهِ الْيَوْمَ، قَالَ‏:‏ بَلَى اصْنَعِيهِ لَنَا قَالَ‏:‏ فَقَامَتْ فَأَخَذَتْ مِنْ شَعِيرٍ فَطَحَنَتْهُ، ثُمَّ جَعَلَتْهُ فِي قِدْرٍ، وَصَبَّتْ عَلَيْهِ شَيْئًا مِنْ زَيْتٍ، وَدَقَّتِ الْفُلْفُلَ، وَالتَّوَابِلَ، فَقَرَّبَتْهُ إِلَيْهِمْ، فَقَالَتْ‏:‏ هَذَا مِمَّا كَانَ يُعْجِبُ رَسُولَ اللهِ صلى الله عليه وسلم، وَيُحْسِنُ أَكْلَهُ‏.‏","english":{"narrator":"Salma said that al-Hasan ibn 'Ali, Ibn 'Abbas and Ibn Ja'far came to her and said to her:","text":"\"Make us a meal consisting of that which used to delight Allah’s Messenger (Allah bless him and give him peace), and which used to make his food more palatable!\" She replied: ‘O my dear son, do not wish for it today!’ He said: ‘Oh yes, you must make it for us!’ She therefore got up, took some barley and ground it. Then she put it into a pot, poured some oil over it, crushed the pepper and the spices, and presented it to them. She said: \"This is some of that which used to delight Allah’s Messenger (Allah bless him and give him peace), and which used to make his food \nmore palatable!”"},"hadithNumber":173,"hadithId":28},"28":{"id":48889,"idInBook":174,"chapterId":25,"bookId":16,"arabic":"حَدَّثَنَا مَحْمُودُ بْنُ غَيْلانَ، قَالَ‏:‏ حَدَّثَنَا أَبُو أَحْمَدَ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، عَنِ الأَسْوَدِ بْنِ قَيْسٍ، عَنْ نُبَيْحٍ الْعَنَزِيِّ، عَنْ جَابِرِ بْنِ عَبْدِ اللهِ، قَالَ‏:‏ أَتَانَا النَّبِيُّ صلى الله عليه وسلم، فِي مَنْزِلِنَا، فَذَبَحْنَا لَهُ شَاةً، فَقَالَ‏:‏ كَأَنَّهُمْ عَلِمُوا أَنَّا نُحِبُّ اللَّحْمَ وَفِي الْحَدِيثِ قِصَّةٌ‏.‏","english":{"narrator":"Jabir ibn 'Abdi’llah said:","text":"“The Prophet (Allah bless him and give him peace) came to us in our house, so we slaughtered a sheep for him, and he said: ‘It is as if they knew that we love meat'!\" (This\ntradition is part of a longer story)."},"hadithNumber":174,"hadithId":29},"29":{"id":48890,"idInBook":175,"chapterId":25,"bookId":16,"arabic":"حَدَّثَنَا ابْنُ أَبِي عُمَرَ، قَالَ‏:‏ حَدَّثَنَا سُفْيَانُ، قَالَ‏:‏ حَدَّثَنَا عَبْدُ اللهِ بْنُ مُحَمَّدِ بْنِ عَقِيلٍ، أَنَّهُ سمعَ جَابِرًا ‏(‏ح‏)‏ قَالَ سُفْيَانُ‏:‏ وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُنْكَدِرِ، عَنْ جَابِرٍ، قَالَ‏:‏ خَرَجَ رَسُولُ اللهِ صلى الله عليه وسلم، وَأَنَا مَعَهُ فَدَخَلَ عَلَى امْرَأَةٍ مِنَ الأَنْصَارِ، فذَبَحَتْ لَهُ شَاةً، فَأَكَلَ مِنْهَا، وَأَتَتْهُ بِقِنَاعٍ مِنْ رُطَبٍ، فَأَكَلَ مِنْهُ، ثُمَّ تَوَضَّأَ لِلظُّهْرِ، وَصَلَّى، صلى الله عليه وسلم، ثُمَّ انْصَرَفَ، فَأَتَتْهُ بِعُلالَةٍ مِنْ عُلالَةِ الشَّاةِ، فَأَكَلَ ثُمَّ صَلَّى الْعَصْرَ، وَلَمْ يَتَوَضَّأْ‏.‏","english":{"narrator":"Jabir said:","text":"“Allah’s Messenger (Allah bless him and give him peace) went out and I went with him, then he went in to see a woman from among the Helpers , so she slaughtered a sheep for him and he ate some of it. She also brought him a dish of ripe dates, and he ate some of them. Then he performed the minor ritual ablution for the noon prayer, and performed it. Then he departed, and she\nbrought him a leftover from the remnant of the sheep, and he ate. Then he performed the afternoon ritual prayer but did not perform the minor ritual ablution.”"},"hadithNumber":175,"hadithId":30},"30":{"id":48891,"idInBook":176,"chapterId":25,"bookId":16,"arabic":"حَدَّثَنَا الْعَبَّاسُ بْنُ مُحَمَّدٍ الدُّورِيُّ، قَالَ‏:‏ حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ، قَالَ‏:‏ حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ، عَنْ عُثْمَانَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ يَعْقُوبَ بْنِ أَبِي يَعْقُوبَ، عَنْ أُمِّ الْمُنْذِرِ، قَالَتْ‏:‏ دَخَلَ عَلَيَّ رَسُولُ اللهِ صلى الله عليه وسلم، وَمَعَهُ عَلِيٌّ، وَلَنَا دَوَالٍ مُعَلَّقَةٌ، قَالَتْ‏:‏ فَجَعَلَ رَسُولُ اللهِ صلى الله عليه وسلم يَأْكُلُ وَعَلِيٌّ مَعَهُ يَأْكُلُ، فَقَالَ رَسُولُ اللهِ صلى الله عليه وسلم، لِعَلِيٍّ‏:‏ مَهْ يَا عَلِيُّ، فَإِنَّكَ نَاقَةٌ، قَالَتْ‏:‏ فَجَلَسَ عَلِيٌّ، وَالنَّبِيُّ صلى الله عليه وسلم يَأْكُلُ، قَالَتْ‏:‏ فَجَعَلْتُ لَهُمْ سِلْقًا وَشَعِيرًا، فَقَالَ النَّبِيُّ صلى الله عليه وسلم لِعَلِيٍّ‏:‏ مِنْ هَذَا فَأَصِبْ فَإِنَّ هَذَا أَوْفَقُ لَكَ‏.‏","english":{"narrator":"Umm al-Mundhir said:","text":"“Allah’s Messenger (Allah bless him and give him peace) came to see me with 'Ali. We had some suspended clusters of grapes, so Allah’s Messenger (Allah bless him and give him peace) started to eat, and 'Ali was eating with him. Allah’s Messenger (Allah bless him and give him peace) therefore said to 'Ali: ‘Take it easy, O ‘Ali, for you are a convalescent!’ So 'Ali sat down while the Prophet (Allah bless him and give him peace) ate, and I offered them some chard and barley. The Prophet (Allah bless him and give him peace) said to 'Ali: ‘Eat some of this, for this is more appropriate for you'!”"},"hadithNumber":176,"hadithId":31},"31":{"id":48892,"idInBook":177,"chapterId":25,"bookId":16,"arabic":"حَدَّثَنَا مَحْمُودُ بْنُ غَيْلانَ، قَالَ‏:‏ حَدَّثَنَا بِشْرُ بْنُ السَّرِيِّ، عَنْ سُفْيَانَ، عَنْ طَلْحَةَ بْنِ يَحْيَى، عَنْ عَائِشَةَ بِنْتِ طَلْحَةَ، عَنْ عَائِشَةَ، أُمِّ الْمُؤْمِنِينَ، قَالَتْ‏:‏ كَانَ النَّبِيُّ صلى الله عليه وسلم يَأْتِينِي فَيَقُولُ‏:‏ أَعِنْدَكِ غَدَاءٌ‏؟‏ فَأَقُولُ‏:‏ لا قَالَتْ‏:‏ فَيَقُولُ‏:‏ إِنِّي صَائِمٌ قَالَتْ‏:‏ فَأَتَانِي يَوْمًا، فَقُلْتُ‏:‏ يَا رَسُولَ اللهِ، إِنَّهُ أُهْدِيَتْ لَنَا هَدِيَّةٌ، قَالَ‏:‏ وَمَا هِيَ‏؟‏ قُلْتُ‏:‏ حَيْسٌ، قَالَ‏:‏ أَمَا إِنِّي أَصْبَحْتُ صَائِمًا، قَالَتْ‏:‏ ثُمَّ أَكَلَ‏.‏","english":{"narrator":"'A’isha, the Mother of the Believers (may Allah be well pleased with her), said:","text":"\"The Prophet (Allah bless him and give him peace) used to come to me and say: “Do you have something for lunch?” I would say: “No,” so he would say: “I am fasting.” When he came to me one day, I said: “O Messenger of Allah, we have been given a gift!” He said: “What is it?” I said: “It is a meal of dates mixed with butter and curds.” He said: “As for me,\nI began the day fasting.” But then he ate.”"},"hadithNumber":177,"hadithId":32},"32":{"id":48893,"idInBook":178,"chapterId":25,"bookId":16,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ، قَالَ‏:‏ حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، قَالَ‏:‏ حَدَّثَنَا أَبِي، عَنْ مُحَمَّدِ بْنِ أَبِي يَحْيَى الأَسْلَمِيِّ، عَنْ يَزِيدَ بْنِ أَبِي أُمَيَّةَ الأَعْوَرِ، عَنْ يُوسُفَ بْنِ عَبْدِ اللهِ بْنِ سَلامٍ، قَالَ‏:‏ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم أَخَذَ كِسْرَةً مِنْ خُبْزِ الشَّعِيرِ فَوَضَعَ عَلَيْهَا تَمْرَةً وَقَالَ‏:‏ هَذِهِ إِدَامُ هَذِهِ، وأكل‏.‏","english":{"narrator":"Yusuf ibn 'Abdi’llah ibn Salam said:","text":"“I saw the Prophet (Allah bless him and give him peace) take a slice of barley-bread. Then he put a dried date on it and said: ‘This is the condiment for this,’ and he ate it.”"},"hadithNumber":178,"hadithId":33},"33":{"id":48894,"idInBook":179,"chapterId":25,"bookId":16,"arabic":"حَدَّثَنَا عَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ، قَالَ‏:‏ حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ، عَنْ عَبَّادِ بْنِ الْعَوَّامِ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ‏:‏ أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم كَانَ يُعْجِبُهُ الثُّفْلُ، قَالَ عَبْدُ اللهِ‏:‏ يَعْنِي مَا بَقِيَ مِنَ الطَّعَامِ‏.‏","english":{"narrator":"Anas said about Allah’s Messenger (Allah bless him and give him peace):","text":"\"He used to like the dregs .” 'Abdullah said: “That means what is left over from the meal.”"},"hadithNumber":179,"hadithId":34}}}