{"name":"10:16","price":"(ఇంకా ఇలా) అను: \"ఒకవేళ అల్లాహ్ కోరితే, నేను దీనిని మీకు వినిపించి ఉండేవాడిని కాదు; మరియు ఆయన కూడా దీనిని మీకు తెలిపి ఉండేవాడు కాదు. వాస్తవంగా నేను దీనికి (ఈ గ్రంథ అవతరణకు) పూర్వం మీతో నా వయస్సులోని దీర్ఘకాలాన్ని గడిపాను కదా?[1] ఏమీ? మీరిది గ్రహించలేరా?\"","arabic":"قُل لَّوۡ شَآءَ ٱللَّهُ مَا تَلَوۡتُهُۥ عَلَيۡكُمۡ وَلَآ أَدۡرَىٰكُم بِهِۦۖ فَقَدۡ لَبِثۡتُ فِيكُمۡ عُمُرٗا مِّن قَبۡلِهِۦٓۚ أَفَلَا تَعۡقِلُونَ","category":["10 (Yunus)","Yunus","Surah Yunus","Chapter Yunus","Surah 10","Chapter 10","Jonah","يونُس"],"ayahNumber":1380,"juzNumber":11,"footnotes":"[1] దైవప్రవక్తగా ఎన్నుకొనబడక ముందు ము'హమ్మద్ ('స'అస) 40 సంవత్సరాలు మక్కా వారితో నివసించారు. మరియు వారు అతనిని నమ్మకస్తునిగా (అల్-అమీన్) మరియు ఎన్నడూ అబద్ధమాడని వారి (అ'స్సాదిఖ్)గా సాక్ష్యమిచ్చేవారు. అతనికి ('స'అస) ఏ గురువు లేడు. అతను చదువటం వ్రాయటం ఎరుగరు. ఇది కూడా వారికి బాగా తెలుసు. అలాంటప్పుడు ఈ ఖుర్ఆన్ ఏదైతే ఎన్నో అద్భుత విషయాలను, విజ్ఞాన విషయాలను, నక్షత్రాల విషయాలను, ప్రాచీన ప్రవక్తల గాథలను వివరిస్తుందో, అల్లాహ్ (సు.తా.) తరఫు నుండి గాక మరెవరి తరఫు నుండి రాగలదు. ఎందుకంటే ఇందులో వేయి కంటే ఎక్కువ విజ్ఞాన (Science) విషయాలు ఉన్నాయి. వాటిలో కొన్ని ఇప్పుడిప్పుడే వైజ్ఞానికి ప్రయోగాల ద్వారా సత్యమని నిరూపించబడ్డాయి. ఇకా ఎన్నో నిరూపించబడనున్నాయి. ఇంకొక విశేషమేమిటంటే దివ్య ఖుర్ఆన్ లో సూచించబడిన వైజ్ఞానిక విషయాలలో ఇంత వరకు ఒక్కటి కూడా తప్పని నిరూపించబడలేదు. మరియు దివ్యఖుర్ఆన్ లో సూచించబడిన ఇంకా ఎన్నో వైజ్ఞానిక విషయాలను మానవుడు ఇంతవరకు కూడా అర్థం చేసుకోలేక పోయాడు. .","lang":"te","version":{"key":"telugu_muhammad","direction":"ltr","language_iso_code":"te","version":"1.0.6","last_update":1708432120,"title":"Telugu translation - Abder-Rahim ibn Muhammad","description":"Translation of the Quran meanings into Telugu by Maulana Abder-Rahim ibn Muhammad."},"meta":{"transliteration":"qul law shāa al-lahu mā talawtuhu ʿalaykum walā adrākum bihi faqad labith'tu fīkum ʿumuran min qablihi afalā taʿqilūna ","translations":["Say","If","(had) willed","Allah","not","I (would) have recited it","to you","and not","He (would) have made it known to you","He (would) have made it known to you","Verily","I have stayed","among you","a lifetime","before it","before it","Then will not","you use reason","(16)"],"transliterationArr":["qul","law","shāa","al-lahu","mā","talawtuhu","ʿalaykum","walā","adrākum","bihi","faqad","labith'tu","fīkum","ʿumuran","min","qablihi","afalā","taʿqilūna",null],"verseTiming":[[1,0,520],[2,520,840],[3,840,2990],[4,2990,4060],[5,4060,4450],[6,4450,5870],[7,5870,7030],[8,7030,8710],[9,8710,10900],[10,10900,12290],[11,12290,12960],[12,12960,13820],[13,13820,14710],[14,14710,15530],[15,15530,17820],[16,17820,19440],[17,19440,20310],[18,20310,24045]]}}