{"name":"16:90","price":"నిశ్చయంగా, అల్లాహ్ న్యాయం చేయమని మరియు (ఇతరులకు) మేలు చేయమని మరియు దగ్గరి బంధువులకు సహాయం చేయమని మరియు అశ్లీలత, అధర్మం మరియు దౌర్జన్యాలకు దూరంగా ఉండమని ఆజ్ఞాపిస్తున్నాడు.[1] ఆయన ఈ విధంగా మీకు బోధిస్తున్నాడు, బహుశా మీరు హితబోధ గ్రహిస్తారని.","arabic":"۞ إِنَّ ٱللَّهَ يَأۡمُرُ بِٱلۡعَدۡلِ وَٱلۡإِحۡسَٰنِ وَإِيتَآيِٕ ذِي ٱلۡقُرۡبَىٰ وَيَنۡهَىٰ عَنِ ٱلۡفَحۡشَآءِ وَٱلۡمُنكَرِ وَٱلۡبَغۡيِۚ يَعِظُكُمۡ لَعَلَّكُمۡ تَذَكَّرُونَ","category":["16 (An-Nahl)","An-Nahl","Surah An-Nahl","Chapter An-Nahl","Nahl","Surah Nahl","Chapter Nahl","An Nahl","Surah An Nahl","Chapter An Nahl","Surah 16","Chapter 16","The Bee","النَّحل"],"ayahNumber":1991,"juzNumber":14,"footnotes":"[1] అల్-'అద్లు: తన వారితోనే కాక ఇతరులతో కూడా న్యాయం చేయటం. ఎవరితోనైనా ఉన్న ప్రేమ లేక శత్రుత్వం, న్యాయానికి అడ్డు రాకూడదు. మరొక అర్థం న్యాయంలో హెచ్చు తగ్గులు చేయగూడదు. ధర్మవిషయంలో కూడా ఏ విధమైన అన్యాయం జరుగకూడదు. అల్-ఎ'హ్సాను: అంటే, ఒకటి: మంచినడవడిక మరియు క్షమాగుణం. రెండోది: న్యాయంగా ఇవ్వవలసిన దాని కంటే ఎక్కువ ఇవ్వటం. ఉదా: నూరు రూపాయలు కూలి మాట్లాడుకున్న వానికి పని ముగిసిన తరువాత 110 రూపాయలు ఇవ్వటం. మూడవది: ఏ పని చేసినా కర్తవ్యంగా హృదయపూర్వకంగా చేయటం మరియు ఏకాగ్రచిత్తంతో అల్లాహ్ (సు.తా.)ను ఆరాధించటం (అన్ త'అబుదుల్లాహ్ క అన్నక తరాహు). అల్-ఫ'హ్ షా ఉ': అశ్లీలత, చెడు నడత, అసభ్యకరమైన పని, సిగ్గుమాలిన నడవడిక. ఈ కాలంలో ఫ్యాషన్ పేరు మీద జరిగేవి. స్త్రీపురుషులు సిగ్గు విడిచి, కలసి మెలసి తిరుగటం, డాన్సులు చేయటం, మొదలైనవి. అల్-మున్కరు: షరీయత్ నిషేధించిన పని. అల్-బ'గీ: ఆందోళన, అక్రమము, దౌర్జన్యం.","lang":"te","version":{"key":"telugu_muhammad","direction":"ltr","language_iso_code":"te","version":"1.0.6","last_update":1708432120,"title":"Telugu translation - Abder-Rahim ibn Muhammad","description":"Translation of the Quran meanings into Telugu by Maulana Abder-Rahim ibn Muhammad."},"meta":{"transliteration":"inna al-laha yamuru bil-ʿadli wal-iḥ'sāni waītāi dhī al-qur'bā wayanhā ʿani al-faḥshāi wal-munkari wal-baghyi yaʿiẓukum laʿallakum tadhakkarūna ","translations":["Indeed","Allah","commands","justice","and the good","and giving","(to) relatives","(to) relatives","and forbids","[from]","the immorality","and the bad","and the oppression","He admonishes you","so that you may","take heed","(90)"],"transliterationArr":["inna","al-laha","yamuru","bil-ʿadli","wal-iḥ'sāni","waītāi","dhī","al-qur'bā","wayanhā","ʿani","al-faḥshāi","wal-munkari","wal-baghyi","yaʿiẓukum","laʿallakum","tadhakkarūna",null],"verseTiming":[[1,0,1150],[2,1150,1990],[3,1990,2890],[4,2890,3900],[5,3900,5250],[6,5250,8130],[7,8130,8330],[8,8330,9310],[9,9310,10280],[10,10280,10660],[11,10660,13690],[12,13690,15660],[13,15660,16370],[14,16370,18130],[15,18130,19450],[16,19450,22365]]}}