{"name":"1:1","price":"అనంత కరుణామయుడు అపార కరుణా ప్రదాత అయిన అల్లాహ్[1] పేరుతో[2]","arabic":"بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah","Chapter Al-Fatihah","Fatihah","Surah Fatihah","Chapter Fatihah","Al Fatihah","Surah Al Fatihah","Chapter Al Fatihah","Surah 1","Chapter 1","The Opening","الفَاتِحَة"],"ayahNumber":1,"juzNumber":1,"footnotes":"[1] అల్లాహ్ సుబ్'హానవతా'ఆలా (సు.తా.):అనేది సర్వసృష్టికర్త, మహాన్నతుడు, సర్వపోషకుడు అయిన విశ్వప్రభువు యొక్క పేరు. ఈ పేరుతో ఆయనను తప్ప మరెవ్వరినీ పిలువరాదు. దీనికి సరిసమానమైన పదం వేరే భాషలలో లేదు, ఫార్సీ భాషలోని 'ఖుదా అనే పదం తప్ప. ఇది ఒక ప్రత్యేకమైన విశేషపదం. ఈ పదానికి బహువచనం గానీ, స్త్రీలింగం గానీ లేవు. అల్లాహ్ (సు.తా.) యొక్క స్పష్టమైన నిర్వచనం కొరకు చూడండి, సూరహ్ అల్-ఇ'ఖ్లాస్(112). \n [2] చాలా మంది వ్యాఖ్యాతల అభిప్రాయంలో, ఈ ఆయత్, సూరహ్ అల్ ఫాతి'హా యొక్క భాగం. సూరహ్ అన్ నమ్ల్ (27:30) లో ఇది ఒక ఆయత్ రూపంలో కూడా ఉంది. ప్రతి మంచి పనికి ముందు బిస్మిల్లా హిర్'హ్ మా నిర్ర'హీమ్, చదవాలి. ఉదా: భోజనానికి ముందు, వ'దూ చేసేటప్పుడు. ఖుర్ఆన్ పఠించటం ప్రారంభించేటప్పుడు బిస్మిల్లా హిర్ర'హ్ మా నిర్ర'హీమ్ కు ముందు అ'ఊజు' బిల్లాహి మినష్షయ్'తా నిర్రజీమ్ - శపించ(బహిష్కరించ)బడిన షైతాన్ నుండి రక్షించబడటానికి నేను అల్లాహ్ (సు.తా.) శరణు వేడుకుంటున్నాను - తప్పక చదవాలి. (చూడండి అల్లాహుతా 'ఆలా ఆదేశం, 16:98). దివ్యఖుర్ఆన్ మానవులకు మార్గదర్శిని మరియు హృదయాలకు స్వస్థతనిచ్చేది. షై'తాన్ మార్గభ్రష్టత్వానికి మరియు దురాచారాలకు ప్రోత్సహిస్తాడు. కావున శపించ(బహిష్కరించ)బడిన షై'తాన్ మరియు అతడి అనుచర మూకలు రేకెత్తించే కలతల నుండి కాపాడుకోవటానికి అల్లాహుతా'ఆలా శరణు వేడుకోవాలి. ఈ ఇస్తి'ఆజ'హ్ దివ్యఖుర్ఆన్ యొక్క భాగం కాదనటంలో ఇస్లామీయ శాస్త్రవేత్తలు అందరూ ఏకీభవిస్తున్నారు. కాబట్టి ఇది దివ్యఖుర్ఆన్ లో వ్రాయబడలేదు.","lang":"te","version":{"key":"telugu_muhammad","direction":"ltr","language_iso_code":"te","version":"1.0.6","last_update":1708432120,"title":"Telugu translation - Abder-Rahim ibn Muhammad","description":"Translation of the Quran meanings into Telugu by Maulana Abder-Rahim ibn Muhammad."},"meta":{"transliteration":"bis'mi al-lahi al-raḥmāni al-raḥīmi ","translations":["In (the) name","(of) Allah","the Most Gracious","the Most Merciful","(1)"],"transliterationArr":["bis'mi","al-lahi","al-raḥmāni","al-raḥīmi",null],"verseTiming":[[1,0,580],[2,580,1409],[3,1409,2502],[4,2502,5840]]}}