{"name":"1:5","price":"మేము నిన్నే ఆరాధిస్తున్నాము మరియు నీ సహాయాన్నే అర్థిస్తున్నాము.[1]","arabic":"إِيَّاكَ نَعۡبُدُ وَإِيَّاكَ نَسۡتَعِينُ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah","Chapter Al-Fatihah","Fatihah","Surah Fatihah","Chapter Fatihah","Al Fatihah","Surah Al Fatihah","Chapter Al Fatihah","Surah 1","Chapter 1","The Opening","الفَاتِحَة"],"ayahNumber":5,"juzNumber":1,"footnotes":"[1] 'ఇబాదతున్: ఆరాధన, అంటే ఒకరి ప్రసన్నత కొరకు అత్యంత వినయ విధేయత, నమ్రత, మరియు భీతిని ప్రదర్శించటం. ఇది కేవలం అల్లాహ్ (సు.తా.) కొరకు మాత్రమే తగినది. మానవుడు కేవలం ఆ ఒకే ఒక్క ఆరాధ్య దైవం అయిన అల్లాహుతా'ఆలాను మాత్రమే ఆరాధించాలి. మరియు ప్రతి విషయం, ప్రతి కార్యంలో కేవలం ఆయన సహాయాన్నే అర్థించాలి. తౌ'హీద్: మూడు విధాలు - (1) తౌ'హీద్ అర్-రుబూబియ్యహ్: ఏకైక ప్రభువు అల్లాహ్ (సు.తా.) అని విశ్వసించటం. సర్వాన్ని సృష్టించినవాడు, దాని అధిపతి, సర్వ వ్యవహారాలను నడిపించేవాడు మరియు పోషకుడు కేవలం ఆ ఏకైక ప్రభువు అయిన అల్లాహుతా'ఆలా మాత్రమే అని, విశ్వసించడం. కాని బహుదైవారాధకులు (ముష్రికులు) దీనిని నమ్మి కూడా ఆయనకు సాటి కల్పిస్తున్నారు. ఎంత తప్పుడు మార్గంలో పడి ఉన్నారు వారు! చూడండి, 10:31, 39:38, 23:84-89. (2) తౌ'హీద్ అల్-'ఉలూహియ్యహ్: ప్రతి విధమైన ఆరాధనకు అర్హుడు కేవలం అల్లాహ్ (సు.తా.) మాత్రమే. ఆరాధన అంటే అల్లాహుతా'ఆలా ప్రీతి లేక భయం కొరకు చేసే ప్రతి కార్యం. కావున, నమా'జ్, ఉపవాసం, 'జకాత్ మొదలైనవి, ఆ గొప్ప శక్తి (అల్లాహుతా'ఆలా) ప్రీతి కొరకే చేయటం. ఆరాధనలన్నింటికీ అర్హుడు, కేవలం అల్లాహ్ (సు.తా.) అని విశ్వసించటం. (3) తౌహీద్ అల్-అస్మా'వస్సిఫాత్: అల్లాహుతా'ఆలా పేర్లు మరియు గుణవిశేషాలను ఏ విధమైన మార్పు చేయకుండా విశ్వసించడం. అల్లాహుతా'ఆలా తప్ప ఇతరులను ఈ గుణవిశేషాలతో సంబోధించరాదు. అల్లాహ్ (సు.తా.) మరియు ఆయన ప్రవక్త ('స'అస) వివరించిన పేర్లు మరియు గుణవిశేషాలతో తప్ప ఇతర పేర్లతో ఆయనను సంబోధించరాదు.","lang":"te","version":{"key":"telugu_muhammad","direction":"ltr","language_iso_code":"te","version":"1.0.6","last_update":1708432120,"title":"Telugu translation - Abder-Rahim ibn Muhammad","description":"Translation of the Quran meanings into Telugu by Maulana Abder-Rahim ibn Muhammad."},"meta":{"transliteration":"iyyāka naʿbudu wa-iyyāka nastaʿīnu ","translations":["You Alone","we worship","and You Alone","we ask for help","(5)"],"transliterationArr":["iyyāka","naʿbudu","wa-iyyāka","nastaʿīnu",null],"verseTiming":[[1,0,990],[2,990,1760],[3,1760,2880],[4,2880,6635]]}}