{"name":"21:30","price":"ఏమి? ఈ సత్యతిరస్కారులకు తెలియదా (చూడలేదా)? వాస్తవానికి భూమ్యాకాశాలు (ఒకే ఒక్క భౌతికాంశంగా) కలుసుకొని ఉండేవని, అయితే మేమే వాటిని పగుల గొట్టి వేరు చేశామని?[1] మరియు మేమే ప్రతి ప్రాణిని నీటి నుండి పుట్టించాము.[2] ఇకనైన వారు విశ్వసించరా?","arabic":"أَوَلَمۡ يَرَ ٱلَّذِينَ كَفَرُوٓاْ أَنَّ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ كَانَتَا رَتۡقٗا فَفَتَقۡنَٰهُمَاۖ وَجَعَلۡنَا مِنَ ٱلۡمَآءِ كُلَّ شَيۡءٍ حَيٍّۚ أَفَلَا يُؤۡمِنُونَ","category":["21 (Al-Anbiya)","Al-Anbiya","Surah Al-Anbiya","Chapter Al-Anbiya","Anbiya","Surah Anbiya","Chapter Anbiya","Al Anbiya","Surah Al Anbiya","Chapter Al Anbiya","Surah 21","Chapter 21","The Prophets","الأنبيَاء"],"ayahNumber":2513,"juzNumber":17,"footnotes":"[1] ఇదే సైంటిస్టులు పలికే Big Bang Theory. ఈ ఆయత్ అవతరింపజేయబడినప్పుడు అరేబియా వాసులకు ఏ విధమైన సైన్సు జ్ఞానం లేదు. ఈ Big Band Theory ఇప్పుడిప్పుడే ఆవిష్కరించబడింది. ఈ ఖుర్ఆన్ ను దైవప్రవక్త ('స'అస) వ్రాయలేదు, ఎందుకంటే అతను నిరక్షరాస్యుడని మక్కా ప్రజలందరికీ తెలుసు. ఆ కాలపు విద్వాంసులకు కూడా ఇలాంటి సైన్సు విషయాల జ్ఞానం ఉండేది కాదు. దీనితో ఈ ఖుర్ఆన్ దివ్యాష్కృతి అని నిరూపించబడుతోంది. దాదాపు వేయి కంటే ఎక్కువ ఆయతులలో ఈ విధమైన సైన్సు విషయాలు పేర్కొనబడ్డాయి. వాటిలో కొన్ని ఇప్పుడిప్పుడే పరిశోధించబడి నిరూపించబడ్డాయి. వాటిలో ఒక ఒక్క ఆవిష్కారం కూడా ఖుర్ఆన్ లో పేర్కొనబడ్డ విషయం తప్పని నిరూపించలేదు. ఇంకా ఎన్నో నిరూపించబడనున్నాయి. ఈ కాలపు Modern Astrophysicists లందరి అభిప్రాయం ఏమిటంటే: ఈ విశ్వమంతా ఒకే ఒక మూల ద్రవ్యం హైడ్రోజన్ పరమాణువు నుండి సృష్టించబడింది. తరువాత ఆ హైడ్రోజన్ పరమాణువులు గరుత్వాకర్షణ శక్తి వల్ల కలుపబడి అనేక పదార్థాల సముదాయం ఏర్పడి, తరువాత అది పగల గొట్టబడటం వల్ల Galaxies, Nedulae and Solar Systems, అంటే నక్షత్ర సముదాయం ఏర్పడింది. ఇదంతా జరగటానికి ఎంతో శక్తి (Energy) కావాలి. కాబట్టి, ఇదంతా చేసే శక్తి గలవాడు, సర్వసృష్టికి ఆధార భూతుడైన అల్లాహ్ (సు.తా.) మాత్రమే. ఇంకా చూడండి 51:47. [2] ఈ విషయం కూడా ఇప్పటి సైంటిస్టులందరూ అంగీకరిస్తారు. అంటే ప్రతి జీవి నీటి నుండి పుట్టించబడిందని. జీవకణం (Cell) లోని అత్యధిక భాగం Protoplasm అందులో కూడా అత్యధిక భాగం (దాదాపు 72%) నీరే.","lang":"te","version":{"key":"telugu_muhammad","direction":"ltr","language_iso_code":"te","version":"1.0.6","last_update":1708432120,"title":"Telugu translation - Abder-Rahim ibn Muhammad","description":"Translation of the Quran meanings into Telugu by Maulana Abder-Rahim ibn Muhammad."},"meta":{"transliteration":"awalam yara alladhīna kafarū anna al-samāwāti wal-arḍa kānatā ratqan fafataqnāhumā wajaʿalnā mina al-māi kulla shayin ḥayyin afalā yu'minūna ","translations":["Do not","see","those who","disbelieved","that","the heavens","and the earth","were","a joined entity","then We parted them","and We made","from","[the] water","every","living thing","living thing","Then will not","they believe","(30)"],"transliterationArr":["awalam","yara","alladhīna","kafarū","anna","al-samāwāti","wal-arḍa","kānatā","ratqan","fafataqnāhumā","wajaʿalnā","mina","al-māi","kulla","shayin","ḥayyin","afalā","yu'minūna",null],"verseTiming":[[1,0,900],[2,900,1250],[3,1250,2230],[4,2230,4380],[5,4380,5310],[6,5310,6870],[7,6870,7870],[8,7870,8760],[9,8760,9970],[10,9970,12130],[11,12130,14050],[12,14050,14350],[13,14350,17110],[14,17110,17660],[15,17660,18510],[16,18510,19320],[17,19320,20110],[18,20110,22725]]}}