{"name":"24:4","price":"మరియు ఎవరైనా శీలవతులైన స్త్రీలపై అపనింద మోపిన తరువాత నలుగురు సాక్షులను తీసుకొని రాలేరో, వారికి ఎనభై కొరడా దెబ్బలు కొట్టండి మరియు వారి సాక్ష్యాన్ని ఎన్నటికీ స్వీకరించకండి. అలాంటి వారు పరమ దుష్టులు (ఫాసిఖూన్).[1]","arabic":"وَٱلَّذِينَ يَرۡمُونَ ٱلۡمُحۡصَنَٰتِ ثُمَّ لَمۡ يَأۡتُواْ بِأَرۡبَعَةِ شُهَدَآءَ فَٱجۡلِدُوهُمۡ ثَمَٰنِينَ جَلۡدَةٗ وَلَا تَقۡبَلُواْ لَهُمۡ شَهَٰدَةً أَبَدٗاۚ وَأُوْلَٰٓئِكَ هُمُ ٱلۡفَٰسِقُونَ","category":["24 (An-Nur)","An-Nur","Surah An-Nur","Chapter An-Nur","Nur","Surah Nur","Chapter Nur","An Nur","Surah An Nur","Chapter An Nur","Surah 24","Chapter 24","The Light","النُّور"],"ayahNumber":2795,"juzNumber":18,"footnotes":"[1] ఇక్కడ వ్యభిచార నిర్ధారణకు నలుగురు సాక్షులను - ఎవరైతే లైంగిక క్రియ జరుగు తున్నప్పుడు కళ్ళారా చూశారో - తేవాలి! అని స్పష్టంగా పేర్కొనబడింది. వృత్తాంతానుమేయ ప్రమాణం సరిపోదు. అంటే అక్కడ దొరికిన ఇతర ప్రమాణాలను బట్టి లైంగిక క్రియ జరిగి ఉండవచ్చు అని, అంచనా వేయడం సరిపోదు. నలుగురు సాక్ష్యులు లైంగిక క్రియ జరుగుతూ ఉండగా కళ్ళారా చూశాము, అని సాక్ష్యమిస్తే ఈ శిక్ష విధించాలి, లేకుంటే అపనింద మోపిన వానికి 80 కొరడా దెబ్బలు కొట్టాలి మరియు వాని సాక్ష్యం ఎన్నటికీ స్వీకరించరాదు. అల్లాహ్ (సు.తా.) దృష్టిలో అసత్య సాక్ష్యమిచ్చిన వాడు పరమదుష్టుడు. మరొక విశేషమేమిటంటే, అప్పులలో, హత్యలలో మరియు ఇతర విషయాలలో ఇద్దరు సాక్షులు చాలు. కానీ, శిక్ష గంభీరమైనది, కాబట్టి వ్యభిచార విషయంలో లైంగిక క్రియ జరిగేటప్పుడు,కళ్ళారా చూసినామని అల్లాహ్ పేరట ప్రమాణం చేసి, నలుగురు సాక్ష్యమిస్తేనే శిక్ష విధించాలి. చూడండి, 24:2.","lang":"te","version":{"key":"telugu_muhammad","direction":"ltr","language_iso_code":"te","version":"1.0.6","last_update":1708432120,"title":"Telugu translation - Abder-Rahim ibn Muhammad","description":"Translation of the Quran meanings into Telugu by Maulana Abder-Rahim ibn Muhammad."},"meta":{"transliteration":"wa-alladhīna yarmūna al-muḥ'ṣanāti thumma lam yatū bi-arbaʿati shuhadāa fa-ij'lidūhum thamānīna jaldatan walā taqbalū lahum shahādatan abadan wa-ulāika humu al-fāsiqūna ","translations":["And those who","accuse","the chaste women","then","not","they bring","four","witnesses","then flog them","(with) eighty","lashe(s)","and (do) not","accept","their","testimony","ever","And those","they","(are) the defiantly disobedient","(4)"],"transliterationArr":["wa-alladhīna","yarmūna","al-muḥ'ṣanāti","thumma","lam","yatū","bi-arbaʿati","shuhadāa","fa-ij'lidūhum","thamānīna","jaldatan","walā","taqbalū","lahum","shahādatan","abadan","wa-ulāika","humu","al-fāsiqūna",null],"verseTiming":[[1,0,1430],[2,1430,2520],[3,2520,4210],[4,4210,5470],[5,5470,5970],[6,5970,6910],[7,6910,8230],[8,8230,10720],[9,10720,13000],[10,13000,14570],[11,14570,15930],[12,15930,16930],[13,16930,18110],[14,18110,18620],[15,18620,19760],[16,19760,20430],[17,20430,21870],[18,21870,23590],[19,23590,26530],[20,26530,26930],[21,26930,31375]]}}