{"name":"28:53","price":"మరియు వారికి ఇది వినిపించబడి నప్పుడు, వారు ఇలా అంటారు: \"మేము దీనిని విశ్వసించాము, నిశ్చయంగా ఇది మా ప్రభువు తరఫు నుండి వచ్చిన సత్యం. నిశ్చయంగా, మేము మొదటి నుండియో అల్లాహ్ కు విధేయులమై (ముస్లింలమై) ఉన్నాము.\"[1]","arabic":"وَإِذَا يُتۡلَىٰ عَلَيۡهِمۡ قَالُوٓاْ ءَامَنَّا بِهِۦٓ إِنَّهُ ٱلۡحَقُّ مِن رَّبِّنَآ إِنَّا كُنَّا مِن قَبۡلِهِۦ مُسۡلِمِينَ","category":["28 (Al-Qasas)","Al-Qasas","Surah Al-Qasas","Chapter Al-Qasas","Qasas","Surah Qasas","Chapter Qasas","Al Qasas","Surah Al Qasas","Chapter Al Qasas","Surah 28","Chapter 28","The Stories","القَصَص"],"ayahNumber":3305,"juzNumber":20,"footnotes":"[1] ఈ విషయం ఖుర్ఆన్ లో ఎన్నోసార్లు వచ్చింది. దైవప్రవక్తలందరూ ప్రచారం చేసిన ధర్మం ఇస్లాం మాత్రమే. అంటే ఏకైక ఆరాధ్యుడు అల్లాహ్ (సు.తా.) కు తప్ప ఇతరులకు దాస్యం, ఆరాధన చేయరాదని. ప్రతికాలపు వారు తమతమ భాషలలో దానికి వివిధ పేర్లు ఇచ్చారు. అంటే క్రైస్తవధర్మం, యూదధర్మం, మొదలైనవి. కాని వాస్తవానికి ప్రవక్తలందరి ధర్మం ఇస్లాం మాత్రమే. అంటే అల్లాహ్ (సు.తా.) కు విధేయులై కేవలం ఆయనకే దాస్యం, ఆరాధన చేయటం. కాని ఆ ప్రాచీన దివ్యగ్రంథాలు ఆయా ప్రవక్తల ప్రచారానికి ఎన్నో వందల సంవత్సరాల తరువాత లిఖిత రూపంలోకి వచ్చాయి. దాని వల్ల వాటిని లిఖించిన వారు, తమ ప్రవక్తుల వినిపించిన దివ్యసందేశాలను వాటి అసలు అవతరించిన రూపంలో వ్రాయలేక పోయారు. తరువాత తరాల ధర్మవేత్తలు మొదటి వారు వ్రాసిన వాటితో ఏకీభవించక వాటిలో మార్పులు చేస్తూ పోయారు. ఉదాహరణకు: ఈ రోజు ప్రపంచంలో అన్నింటికంటే ఎక్కువ ప్రామాణికమైనదిగా పరిగణించబడే బైబిల్ - ఏదైతే తౌరాత్, 'జబూర్ మరియు ఇంజీల్ గ్రంథా(Old and New Testaments)ల సముదాయమో - అందులో కూడా ఎన్నోసార్లు మార్పులు చేయబడ్డాయి. చివరి మార్పులు గలది, ఈనాటి (Revised) Authorized K.J.V. అందుకే అసలు ఆ ప్రవక్తలు ప్రచారం చేసింది, ఏకైక ఆరాధ్యుడైన అల్లాహ్ (సు.తా.) ఆరాధన. అయినా ఈనాడు వాటిలో మానవులు మార్పులు చేయడం వల్ల, ఆ గ్రంథాలను అనుసరిస్తున్నారు ఏకైక ఆరాధ్యుడైన అల్లాహ్ (సు.తా.) ఆరాధనను వదలి, బహుదైవారాధన, ప్రవక్తల విగ్రహాల ఆరాధన చేస్తున్నారు. కాని ఇస్లాం స్వీకరించిన యూదులు మరియు క్రైస్తవులు సత్యాన్ని తెలుసుకొని: 'మేము మొదటి నుండియే ముస్లింలముగా ఉన్నాము' అని అన్నారు. ఏకైక ఆరాధ్యుడైన అల్లాహ్ (సు.తా.) ఆరాధనయే సత్యధర్మమని, ఇస్లాం ధర్మాన్ని స్వీకరించారు.","lang":"te","version":{"key":"telugu_muhammad","direction":"ltr","language_iso_code":"te","version":"1.0.6","last_update":1708432120,"title":"Telugu translation - Abder-Rahim ibn Muhammad","description":"Translation of the Quran meanings into Telugu by Maulana Abder-Rahim ibn Muhammad."},"meta":{"transliteration":"wa-idhā yut'lā ʿalayhim qālū āmannā bihi innahu al-ḥaqu min rabbinā innā kunnā min qablihi mus'limīna ","translations":["And when","it is recited","to them","they say","We believe","in it","Indeed, it","(is) the truth","from","our Lord","Indeed, we","[we] were","before it","before it","Muslims","(53)"],"transliterationArr":["wa-idhā","yut'lā","ʿalayhim","qālū","āmannā","bihi","innahu","al-ḥaqu","min","rabbinā","innā","kunnā","min","qablihi","mus'limīna",null],"verseTiming":[[1,0,840],[2,840,1660],[3,1660,2720],[4,2720,4810],[5,4810,6770],[6,6770,8530],[7,8530,10030],[8,10030,10890],[9,10890,11060],[10,11060,13550],[11,13550,14939],[12,14939,16529],[13,16529,17929],[14,17929,18939],[15,18939,22124]]}}