{"name":"3:121","price":"మరియు (ఓ ప్రవక్తా! ఆ దినాన్ని జ్ఞాపకం చేసుకో) నీవు వేకుజామున నీ ఇంటి నుండి బయలుదేరి (ఉహుద్ క్షేత్రంలో) విశ్వాసులను వారి వారి యుద్ధ స్థానాలలో నియమించటానికి వెళ్ళావు. మరియు అల్లాహ్ సర్వం వినేవాడు, సర్వజ్ఞుడు[1].","arabic":"وَإِذۡ غَدَوۡتَ مِنۡ أَهۡلِكَ تُبَوِّئُ ٱلۡمُؤۡمِنِينَ مَقَٰعِدَ لِلۡقِتَالِۗ وَٱللَّهُ سَمِيعٌ عَلِيمٌ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":414,"juzNumber":4,"footnotes":"[1] ఈ ఆయత్ ఉ'హుద్ యుద్ధం గురించి తెలియజేస్తుందని ధర్మవేత్తల అభిప్రాయం. అది 3వ హిజ్రీ, షవ్వాల్ నెలలో జరిగింది. 2వ హిజ్రీ రమ'దాన్ నెలలో జరిగిన బద్ర్ యుద్ధంలో మక్కా ముష్రికుల సంఖ్య దాదాపు 1000 ఉండెను. వారి వద్ద మంచి యుద్ధ సామగ్రి ఉండెను. ముస్లింలు కేవలం 313 మంది మాత్రమే ఉన్నప్పటికీ, వారి వద్ద సరియైన యుద్ధ సామగ్రి లేకపోయినపప్టికీ అల్లాహుతా'ఆలా సహాయంతో వారు ముష్రికులను ఓడించి వారిలో 70 మందిని సంహరించి, 70 మందిని బందీలుగా చేసుకుంటారు. దాని ప్రతీకారం తీర్చుకునేందుకు మక్కా ఖురైషీయులు 3వ హిజ్రీ షవ్వాల్ నెలలో దాదాపు 3000 మంది యుద్ధవీరులతో మదీనాకు 3 మైళ్ళ దూరంలో ఉన్న ఉ'హుద్ పర్వతం వద్దకు చేరుకుంటారు. దైవప్రవక్త ('స'అస) ఇది తెలుసుకొని తమ సహాబీలతో సంప్రదిస్తారు. దైవప్రవక్త ('స'అస) ఉదేదేశం, మరికొందరు నాయకుల ఉద్దేశం, మదీనా నగరం లోపలనే ఉండి యుద్ధం చేయాలని. కపటవిశ్వాసుల నాయకుడు, 'అబ్దుల్లాహ్ బిన్ - ఉబై కూడా అదే కోరుతాడు. కాని అనేక మంది ముస్లింలు మదీనా నుండి బయటికి పోయి పోరాడాలని కోరుతారు. దైవప్రవక్త ('స'అస) వారి కోరికపై యుద్ధసామగ్రి ధరించి తన ఇంటి నుండి బయటికి వస్తారు. ఈ విధంగా దాదాపు 1000 మంది ముస్లింలతో యుద్ధానికి సిద్ధమై ఉ'హుద్ వైపునకు పోతూ ఉండగా, కపట విశ్వాసుల నాయకుడు 'అబ్దుల్లాహ్ బిన్ ఉబై - తన మాటను గౌరవించలేదనే సాకుతో - తన 300 మంది అనుచరులతో యుద్ధంలో పాల్గొనకుండా, వెనుదిరిగి పోతాడు. 700 మంది విశ్వాసులు మాత్రమే దైవప్రవక్త ('స'అస) తో పాటు ఉ'హుద్ కు చేరుతారు. అక్కడ 50 మంది బాణాలను బాగా ప్రయోగించగలిగే, విలుకాండ్రను ఒక చిన్న కొండమీద ఉంచి మీరు ఎట్టి పరిస్థితిలోను మీ చోటు విడిచి యుద్ధమైదానంలోకి రావద్దని ఆజ్ఞాపిస్తారు. యుద్ధం ప్రారంభమై ముస్లింలు విజయం పొందుతారు. ముష్రికులు పారిపోసాగుతారు. అది చూసి ఆ విలుకాండ్రు విజయ ధనం దోచుకోవటానికి తమ స్థానాలను విడచి కొండ దిగి వస్తారు. అది చూసి (అప్పుడు ముష్రిక్ గా ఉన్న) 'ఖాలిద్ బిన్ వలీద్ ఒక బృందాన్ని తీసుకొని వెనుక నుండి ముస్లింలపై దాడి చేస్తాడు. ఆకస్మాత్తుగా సంభవించిన ఈ పరిణామంతో ముస్లింలు కలవరపడతారు, ఎంతో మంది తమ ప్రాణాలను కోల్పోతారు. మరియు దైవప్రవక్త ('స'అస) కూడా గాయపడి, క్రింద పడిపోతారు. దానితో ఆయన మరణించారని తలచి ముస్లింలు అటూ ఇటూ పారిపోసాగుతారు. కాని 'ఉమర్ మరియు తల్హా (ర'ది.'అన్హుమ్ లు) ఇక దైవప్రవక్తయే లేకుంటే మనము బ్రతికి ప్రయోజనమేమిటని ప్రేరేపించటం వల్ల ముస్లింలు తిరిగి ఐకమత్యంతో పోరాడుతారు. దానితో ఖురైషీలు వెనుదిరిగి పారిపోతారు.","lang":"te","version":{"key":"telugu_muhammad","direction":"ltr","language_iso_code":"te","version":"1.0.6","last_update":1708432120,"title":"Telugu translation - Abder-Rahim ibn Muhammad","description":"Translation of the Quran meanings into Telugu by Maulana Abder-Rahim ibn Muhammad."},"meta":{"transliteration":"wa-idh ghadawta min ahlika tubawwi-u al-mu'minīna maqāʿida lil'qitāli wal-lahu samīʿun ʿalīmun ","translations":["And when","you left early morning","from","your household","to post","the believers","(to take) positions","for the battle","And Allah","(is) All-Hearing","All-Knowing","(121)"],"transliterationArr":["wa-idh","ghadawta","min","ahlika","tubawwi-u","al-mu'minīna","maqāʿida","lil'qitāli","wal-lahu","samīʿun","ʿalīmun",null],"verseTiming":[[1,0,720],[2,720,1640],[3,1640,2010],[4,2010,2860],[5,2860,3890],[6,3890,5420],[7,5420,6630],[8,6630,9040],[9,9040,10360],[10,10360,11500],[11,11500,13745]]}}