{"name":"3:3","price":"ఆయన, సత్యమైన ఈ దివ్యగ్రంథాన్ని (ఓ ముహమ్మద్!) నీపై అవతరింపజేశాడు. ఇది పూర్వం అవతరింపజేయబడిన గ్రంథాలలో నుండి (మిగిలి వున్న సత్యాన్ని) ధృవపరుస్తోంది[1]. మరియు ఆయనే తౌరాత్ ను మరియు ఇంజీలును[2] అవతరింపజేశాడు.","arabic":"نَزَّلَ عَلَيۡكَ ٱلۡكِتَٰبَ بِٱلۡحَقِّ مُصَدِّقٗا لِّمَا بَيۡنَ يَدَيۡهِ وَأَنزَلَ ٱلتَّوۡرَىٰةَ وَٱلۡإِنجِيلَ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":296,"juzNumber":3,"footnotes":"[1] చూడండి, 5:46, 48, 61:6. [2] ఇక్కడ (ఖుర్ఆన్ లో) పేర్కొనబడిన ఇంజీల్ మరియు తౌరాత్ గ్రంథాలు అంటే 'ఈసా ('అ.స.) మరియు మూసా ('అ.స.) లపై అవతరింపజేయబడిన దివ్యగ్రంథాలు అని అర్థం. ఆ అసలు దివ్యగ్రంథాలు ఇప్పుడు ప్రపంచంలో లేవు. ఇప్పుడు ప్రపంచంలో ఉన్న అత్యంత ప్రాచీన బైబిల్ గ్రంథాలు, గ్రీక్ భాషలో ఉన్న బ్రిటీష్ మ్యూజియంలోని Codex Sinaiticus, Codex Alexandrinus మరియు రోమ్ లోని వాటికాన్ లైబ్రరీలో ఉన్న Codex Vaticanus. ఇవి 'ఈసా ('అ.స.) పైకి సజీవులుగా ఎత్తుకోబడిన దాదాపు నాలుగు వందల సంవత్సరాల తరువాత, గ్రీక్ భాషలో వ్రాయబడ్డాయి. మూసా మరియు 'ఈసా ('అలైహిమ్. స.) లపై అవతరింపజేయబడిన తౌరాత్ మరియు ఇంజీల్ గ్రంథాల బాష గ్రీకు కాదు. వారి మతాచారులు / విద్వాంసులు, వాటిలో ఇంత వరకు ఎన్నో సార్లు, ఎన్నో మార్పులు చేస్తూ వచ్చారు. ఈ రోజు వాడుకలో ఉన్న బైబిల్ లలో, ఆ ప్రవక్తల కొన్ని ప్రవచనాలు మరియు అసలు దివ్య ఆవిష్కృతులైన కొన్ని అంసాలు - వారి మతాచారులు / విద్వాంసులు వ్రాసిన రూపంలో - ఉన్నాయి. కాబట్టి దివ్యఖుర్ఆన్ సూచించేది ఆ ప్రవక్తలపై అవతరింపజేయబడిన ప్రవచనాలను మాత్రమే కానీ ఈ రోజు వాడుకలో ఉన్న బైబిల్ (Revised) Authorized Kind James Version ను కాదు. చూడండి, 4:136, 5:47.","lang":"te","version":{"key":"telugu_muhammad","direction":"ltr","language_iso_code":"te","version":"1.0.6","last_update":1708432120,"title":"Telugu translation - Abder-Rahim ibn Muhammad","description":"Translation of the Quran meanings into Telugu by Maulana Abder-Rahim ibn Muhammad."},"meta":{"transliteration":"nazzala ʿalayka al-kitāba bil-ḥaqi muṣaddiqan limā bayna yadayhi wa-anzala al-tawrāta wal-injīla ","translations":["He revealed","to you","the Book","in [the] truth","confirming","that which","(was)","before it","and He revealed","the Taurat","and the Injeel","(3)"],"transliterationArr":["nazzala","ʿalayka","al-kitāba","bil-ḥaqi","muṣaddiqan","limā","bayna","yadayhi","wa-anzala","al-tawrāta","wal-injīla",null],"verseTiming":[[1,0,1140],[2,1140,1950],[3,1950,3030],[4,3030,3990],[5,3990,5100],[6,5100,5830],[7,5830,6400],[8,6400,7290],[9,7290,9020],[10,9020,10340],[11,10340,14405]]}}