{"name":"4:23","price":"మీకు ఈ స్త్రీలు నిషేధింపబడ్డారు[1]. మీ తల్లులు, మీ కురమార్తెలు, మీ సోదరీమణులు, మీ మేనత్తలు, మీ తల్లిసోదరీ మణులు (పినతల్లులు), మీ సోదరుల కుమార్తెలు, మీ సోదరీమణుల కుమార్తెలు, మీకు పాలిచ్చిన తల్లులు (దాదులు), మీతో పాటు పాలు త్రాగిన సోదరీమణులు, మీ భార్యల తల్లులు; మీ సంరక్షణలో ఉన్న మీ భార్యల కుమార్తెలు - ఏ భార్యలతోనైతే మీరు సంభోగించారో - కాని మీరు వారితో సంభోగించక ముందు (వారికి విడాకులిచ్చి వారి కూతుళ్ళను పెండ్లాడితే) తప్పులేదు; మీ వెన్ను నుండి పుట్టిన మీ కుమారుల భార్యలు మరియు ఏక కాలంలో అక్కా చెల్లెళ్ళను ఇద్దరినీ చేర్చటం (భార్యలుగా చేసుకోవటం నిషిద్ధం); కాని ఇంతకు పూర్వం జరిగిందేదో జరిగి పోయింది. నిశ్చయంగా, అల్లాహ్ క్షమాశీలుడు, అపార కరుణాప్రదాత.","arabic":"حُرِّمَتۡ عَلَيۡكُمۡ أُمَّهَٰتُكُمۡ وَبَنَاتُكُمۡ وَأَخَوَٰتُكُمۡ وَعَمَّٰتُكُمۡ وَخَٰلَٰتُكُمۡ وَبَنَاتُ ٱلۡأَخِ وَبَنَاتُ ٱلۡأُخۡتِ وَأُمَّهَٰتُكُمُ ٱلَّٰتِيٓ أَرۡضَعۡنَكُمۡ وَأَخَوَٰتُكُم مِّنَ ٱلرَّضَٰعَةِ وَأُمَّهَٰتُ نِسَآئِكُمۡ وَرَبَٰٓئِبُكُمُ ٱلَّٰتِي فِي حُجُورِكُم مِّن نِّسَآئِكُمُ ٱلَّٰتِي دَخَلۡتُم بِهِنَّ فَإِن لَّمۡ تَكُونُواْ دَخَلۡتُم بِهِنَّ فَلَا جُنَاحَ عَلَيۡكُمۡ وَحَلَٰٓئِلُ أَبۡنَآئِكُمُ ٱلَّذِينَ مِنۡ أَصۡلَٰبِكُمۡ وَأَن تَجۡمَعُواْ بَيۡنَ ٱلۡأُخۡتَيۡنِ إِلَّا مَا قَدۡ سَلَفَۗ إِنَّ ٱللَّهَ كَانَ غَفُورٗا رَّحِيمٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":516,"juzNumber":4,"footnotes":"[1] ఏ స్త్రీలతో వివాహం నిషిద్ధం ('హరామ్) ఉందో, వారి వివరాలు ఈ విధంగా ఉన్నాయి: అందులో ఏడుగురు రక్త సంబంధీకులు (నసబ్), ఏడుగురు పాలసంబంధీకులు (రదా'అ), మరియు నలుగురు వివాహ సంబంధీకులు. వీరే గాక, ఒక స్త్రీ మరియు ఆమె తండ్రి సోదరిని లేక ఆమె తల్లి సోదరిని ఒకేసారి నికాహ్ లో ఉంచుకోరాదు. 1) రక్త సంబంధీకులు - 7: తల్లులు, కుమార్తెలు, సోదరీమణులు, తండ్రి సోదరీమణులు, తల్లి సోదరీమణులు, సోదరుల కుమార్తెలు మరియు సోదరీమణుల కుమార్తెలు. 2) పాల సంబంధీకులు - 7: పాలు త్రాగిన తల్లులు, పాల కుమార్తెలు, తోటి పాలు త్రాగిన సోదరీమణులు, పాల తండ్రి సోదరీమణులు, పాల తల్లి సోదరీమణులు, పాల సోదరుల కుమార్తెలు, పాల సోదరీమణుల కుమార్తెలు. 3) వివాహ సంబంధీకులు - 4: భార్య తల్లి, సహవాసం చేసిన భార్య మునుపటి భర్తల కుమార్తెలు (రబాయిబ్), మునుపటి భర్తల కుమారుల భార్యలు మరియు ఇద్దరు సోదరీమణులను ఒకేసారి వివాహబంధంలో తీసుకోవటం. ఇంతేగాక తండ్రి భార్యలు. 'హదీస్' ప్రకారం భార్య వివాహబంధంలో ఉన్నంత వరకు ఆమె తండ్రి సోదరీమణులు, ఆమ తల్లి సోదరీమణులు. సోదరుల కుమార్తెలు మరియు సోదరీమణుల కుమార్తెలు. i) మొదటి విభాగపు వివరాలు / రక్త సంబంధీకుల నిషేధాలు: (1) తల్లులు అంటే: తల్లులే గాక తల్లుల తల్లులు (అమ్మమ్మలు), తల్లి నాయనమ్మలు మరియు తండ్రి తల్లులు, తాత తల్లులు, ముత్తాత తల్లులు మరియు వారి పూర్వీకులు. (2) కుమార్తెలు అంటే: కుమార్తెలే గాక, కుమారుల కుమార్తెలు, కుమార్తెల కుమార్తెలు మరియు వారి (కుమారుల కుమార్తెల) కుమార్తెల కుమార్తెలు మరియు వారి సంతానపు సంతానం కూడా. వ్యభిచారం ('జినా) వల్ల (వివాహబంధం లేకుండా) పుట్టిన ఆడపిల్ల \"కూతురు\" అని ఇమామ్ షాఫయి (ర'హ్మ.) తప్ప, ఇతర ముగ్గురు ఇమాములూ (ర.'అలైహిమ్) అంగీకరించారు కాబట్టి ఆమెతో వివాహం హరాం అన్నారు. \"అతనికి - ఆమె షర'ఈ కూతురు కాదు కాబట్టి ఆస్తికి వారసురాలు కాజాలదు,\" అని ఇమామ్ షాఫ'ఈ (ర'హ్మ.) అంటారు. (ఇబ్నె - కసీర్'). (3) సోదరీమణులు అంటే: 1. సొంత (ఒకే తండ్రి-తల్లి), 2. సవతి (ఒకే తండ్రి), 3 అర్థ (ఒకే తల్లి) నుండి గానీ కావచ్చు. (4) తండ్రి సోదరీమణులు: తండ్రి యొక్క స్త్రీ సంబంధీకులు అంటే, తండ్రి తండ్రి (తాత), మరియు తల్లి తండ్రు(తాత)ల యొక్క మూడు రకాల సోదరీమణులు కూడా అన్న మాట. మూడు రకాలు అంటే - సొంత (ఒకే తండ్రి-తల్లి), సవతి (ఒకే తండ్రి) లేక అర్థ (ఒకే తల్లి). (5) తల్లి సోదరీమణులు: తల్లి యొక్క స్త్రీ సంబంధీకులు అంటే ఆమె తల్లి తల్లి, ఆమె తండ్రి తల్లి మరియు వారి మూడు రకాల సోదరీమణులు అన్నమాట. (6) సోదరుల కుమార్తెలలో - కూడా మూడు రకాల సోదరుల కుమార్తెలున్నారు. (7) సోదరీమణుల కుమార్తెలలో - కూడా మూడు రకాల సోదరీమణుల కుమార్తెలున్నారు. ii) రెండవ విభాగపు వివరాలు / పాల సంబంధీకుల నిషేధాలు: *పాలతల్లి - అంటే రెండు సంవత్సరాల వయస్సు లోపల నీవు పాలు త్రాగిన స్త్రీ. * పాల సోదరి - అంటే ఆ స్త్రీ, ఎవరికైతే నీ స్వంత తల్లి, లేక పాల తల్లి, పాలు త్రాపిందో - పాలు త్రాపింది నీతో పాటు గానీ, మీకు ముందు గానీ, లేక తరువాత గానీ కావచ్చు! లేక ఏ స్త్రీ యొక్క స్వంత లేక పాల తల్లి నీకు పాలిచ్చిందో, అది ఒకే సమయంలో కానీ లేక వేరే సమయాలలో గానీ కావచ్చు! * పాలు త్రాగటం వలన కూడా రక్త సంబంధీకులలో ఏ ఏ సంబంధీకులు హరామ్ అవుతారో అలాంటి వారంతా హరాం. వివరాలు ఈ విధంగా ఉన్నాయి: తల్లి యొక్క సొంత మరియు పాలు త్రాగిన పిల్లలందరూ పాలు త్రాగిన వాడి యొక్క సోదరసోదరీలు. ఆమె భర్త వాడి తండ్రిలాంటి వాడు, ఆమె భర్త సోదరీమణులు, ఆమె చెల్లెళ్ళు, ఆమె భర్త సోదరులు మొదలైన వారందరితో వాడి సంబంధం - వివాహ విషయంలో - రక్త సంబంధీకులతో మాదిరిగానే పరిగణించాలి. *కానీ పాలు త్రాగిన శిశువు యొక్క రక్త సంబంధీకులైన సోదరసోదరీమణులు, పాలు త్రాపిన తల్లి రక్త సంబంధీకులకు - ఆ శిశువుకు పాలు త్రాపినందు వల్ల - హరాం కారు. iii) మూడవ విభాగపు వివరాలు (వివాహ సంబంధీకులు): భార్య తల్లి, భార్య అమ్మమ్మ, భార్య నాయనమ్మ, ఒక స్త్రీతో నికాహ్ చేసుకొని, సంభోగించకుండా విడాకులిచ్చినా కూడా ఆమె తల్లితో వివాహం నిషిద్ధం. కాని ఒక స్త్రీతో వావాహం చేసుకొని, ఆమెతో సంభోగం చేయక ముందే విడాకులిస్తే, ఆమె కుమార్తెతో నికాహ్ చేసుకోవడం ధర్మసమ్మతమే, (ఫత్హ' అల్ ఖదీర్). ఇంకా వివరాలకు చూడండి, ఫత్హ' అల్ ఖదీర్, లేదా షరీ'అత్ వేత్తలను సంప్రదించండి.","lang":"te","version":{"key":"telugu_muhammad","direction":"ltr","language_iso_code":"te","version":"1.0.6","last_update":1708432120,"title":"Telugu translation - Abder-Rahim ibn Muhammad","description":"Translation of the Quran meanings into Telugu by Maulana Abder-Rahim ibn Muhammad."},"meta":{"transliteration":"ḥurrimat ʿalaykum ummahātukum wabanātukum wa-akhawātukum waʿammātukum wakhālātukum wabanātu al-akhi wabanātu al-ukh'ti wa-ummahātukumu allātī arḍaʿnakum wa-akhawātukum mina al-raḍāʿati wa-ummahātu nisāikum warabāibukumu allātī fī ḥujūrikum min nisāikumu allātī dakhaltum bihinna fa-in lam takūnū dakhaltum bihinna falā junāḥa ʿalaykum waḥalāilu abnāikumu alladhīna min aṣlābikum wa-an tajmaʿū bayna al-ukh'tayni illā mā qad salafa inna al-laha kāna ghafūran raḥīman ","translations":["Forbidden","to you","(are) your mothers","and your daughters","and your sisters","and your father's sisters","and your mother's sisters","and daughters","(of) brothers","and daughters","(of) sisters","and (the) mothers","who","nursed you","and your sisters","from","the nursing","and mothers","(of) your wives","and your step daughters","who","(are) in","your guardianship","of","your women","whom","you had relations","with them","but if","not","you had","relations","with them","then (there is) no","sin","on you","And wives","(of) your sons","those who","(are) from","your loins","and that","you gather together","[between]","two sisters","except","what","has","passed before","Indeed","Allah","is","Oft-Forgiving","Most-Merciful","(23)"],"transliterationArr":["ḥurrimat","ʿalaykum","ummahātukum","wabanātukum","wa-akhawātukum","waʿammātukum","wakhālātukum","wabanātu","al-akhi","wabanātu","al-ukh'ti","wa-ummahātukumu","allātī","arḍaʿnakum","wa-akhawātukum","mina","al-raḍāʿati","wa-ummahātu","nisāikum","warabāibukumu","allātī","fī","ḥujūrikum","min","nisāikumu","allātī","dakhaltum","bihinna","fa-in","lam","takūnū","dakhaltum","bihinna","falā","junāḥa","ʿalaykum","waḥalāilu","abnāikumu","alladhīna","min","aṣlābikum","wa-an","tajmaʿū","bayna","al-ukh'tayni","illā","mā","qad","salafa","inna","al-laha","kāna","ghafūran","raḥīman",null],"verseTiming":[[1,0,940],[2,940,1900],[3,1900,3720],[4,3720,4980],[5,4980,6470],[6,6470,8300],[7,8300,9730],[8,9730,10720],[9,10720,11340],[10,11340,12240],[11,12240,13040],[12,13040,14940],[13,14940,16980],[14,16980,18360],[15,18360,19700],[16,19700,20640],[17,20640,22150],[18,22150,23700],[19,23700,24550],[20,24550,25790],[21,25790,27420],[22,27420,29800],[23,29800,32530],[24,32530,33480],[25,33480,33840],[26,33840,35420],[27,35420,38320],[28,38320,39320],[29,39320,39670],[30,39670,40840],[31,40840,41590],[32,41590,44640],[33,44640,45710],[34,45710,47070],[35,47070,48400],[36,48400,48980],[37,48980,49360],[38,49360,50380],[39,50380,52030],[40,52030,53350],[41,53350,54150],[42,54150,54750],[43,54750,55740],[44,55740,57290],[45,57290,58660],[46,58660,59260],[47,59260,60170],[48,60170,61210],[49,61210,63760],[50,63760,66400],[51,66400,67440],[52,67440,67940],[53,67940,69400],[54,69400,70440],[55,70440,71530],[56,71530,72140],[57,72140,73460],[58,73460,74300],[59,74300,74650],[60,74650,75100],[61,75100,75830],[62,75830,77270],[63,77270,78100],[64,78100,78860],[65,78860,79670],[66,79670,81355]]}}