{"name":"4:82","price":"ఏమీ? వారు ఖుర్ఆన్ ను గురించి ఆలోచించరా? ఒకవేళ ఇది అల్లాహ్ తరఫు నుండి గాక ఇతరుల తరఫు నుండి వచ్చి వుంటే, అందులో ఎన్నో పరస్పర విరుద్ధమైన విషయాలను చూసేవారు కదా! [1]","arabic":"أَفَلَا يَتَدَبَّرُونَ ٱلۡقُرۡءَانَۚ وَلَوۡ كَانَ مِنۡ عِندِ غَيۡرِ ٱللَّهِ لَوَجَدُواْ فِيهِ ٱخۡتِلَٰفٗا كَثِيرٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":575,"juzNumber":5,"footnotes":"[1] ఖుర్ఆన్ 23 సంవత్సరాలలో అవతరింపజేయబడింది. అయినా అందులో ఏ విధమైన పరస్పర విరుద్ధమైన విషయాలు లేవు. ఇదే దాని దివ్యావతరణకు సాక్ష్యం. ఇంకా ఇందులో చెప్పబడిన పూర్వకాల చరిత్రలు కేవలం అగోచర జ్ఞానసంపన్నుడు ('అల్లాముల్ 'గుయూబ్) అయిన అల్లాహ్ (సు.తా.) యే తెలుపగలడు. మరియు ఇందులో దాదాపు వేయి వైజ్ఞానశాస్త్రానికి (Science) చెందినవిషయాలు 1400 సంవత్సరాల ముందు చెప్పబడ్డాయి. వాటిలో కొన్ని ఇప్పుడిప్పుడే ఆవిష్కరించబడ్డాయి. ఉదాహరణకు : భూమ్యాకాశాల సృష్టి ఒక పెద్ద ప్రేలుడుతో సంభవించింది. ప్రతి జీవరాశి నీటితో సృష్టించబడింది, మానవుడు మట్టితో, అంటే మట్టిలో ఉన్న మూలపదార్థా(Elements)లతో సృష్టించబడినాడు, సూర్యచంద్రుల సంచారం, రాత్రింబవళ్ళ మార్పులు మొదలైనవి. ఇంకా ఎన్నో ఇంత వరకు ఆవిష్కరించబడలేదు. వీటన్నింటినీ గురించి ఆలోచిస్తే, తెలివిగలవారు, ఈ విషయాలు 1400 సంవత్సరాలకు పూర్వం మానవునికి తెలియవు, కాబట్టి ఇవి అగోచర జ్ఞానం గల ఏకైక ప్రభువు, సర్వశక్తిశాలి, సర్వసృష్టికి మూలాధారి, మాత్రమే తెలుపగలడని, తెలుసుకుంటారు. అంటే ఈ విషయాలన్నీ వ్రాయబడిన, ఈ ఖుర్ఆన్ మానవుని చేతిపని కాజాలదు, అది కేవలం దివ్య ఆవిష్కృతియే అని నమ్ముతారు.","lang":"te","version":{"key":"telugu_muhammad","direction":"ltr","language_iso_code":"te","version":"1.0.6","last_update":1708432120,"title":"Telugu translation - Abder-Rahim ibn Muhammad","description":"Translation of the Quran meanings into Telugu by Maulana Abder-Rahim ibn Muhammad."},"meta":{"transliteration":"afalā yatadabbarūna al-qur'āna walaw kāna min ʿindi ghayri al-lahi lawajadū fīhi ikh'tilāfan kathīran ","translations":["Then (do) not","they ponder","(on) the Quran","And if","it had (been)","(of)","from","other than","Allah","surely they (would have) found","in it","contradiction","much","(82)"],"transliterationArr":["afalā","yatadabbarūna","al-qur'āna","walaw","kāna","min","ʿindi","ghayri","al-lahi","lawajadū","fīhi","ikh'tilāfan","kathīran",null],"verseTiming":[[1,0,910],[2,910,2600],[3,2600,5690],[4,5690,6380],[5,6380,7000],[6,7000,7410],[7,7410,8760],[8,8760,9440],[9,9440,10290],[10,10290,11280],[11,11280,12210],[12,12210,13280],[13,13280,15435]]}}