{"name":"65:1","price":"ఓ ప్రవక్తా! మీరు స్త్రీలకు విడాకులు (తలాఖ్) ఇచ్చేటప్పుడు వారికి, వారి నిర్ణీత గడువు (ఇద్దత్) తో విడాకులివ్వండి. మరియు ఆ గడువును ఖచ్చితంగా లెక్కపెట్టండి[1]. మరియు మీ ప్రభువైన అల్లాహ్ పట్ల భయభక్తులు కలిగి ఉండండి. వారు బహిరంగంగా అశ్లీల చేష్టలకు పాల్పడితే తప్ప, మీరు వారిని వారి ఇండ్ల నుండి వెడల గొట్టకండి మరియు వారు కూడా స్వయంగా వెళ్ళి పోకూడదు[2]. మరియు ఇవి అల్లాహ్ నిర్ణయించిన హద్దులు. మరియు ఎవడైతే అల్లాహ్ (నిర్ణయించిన) హద్దులను అతిక్రమిస్తాడో వాస్తవానికి వాడు తనకు తానే అన్యాయం చేసుకున్నట్లు. నీకు తెలియదు, బహుశా! దాని తరువాత అల్లాహ్ ఏదైనా క్రొత్త మార్గం చూపించవచ్చు![3]","arabic":"يَٰٓأَيُّهَا ٱلنَّبِيُّ إِذَا طَلَّقۡتُمُ ٱلنِّسَآءَ فَطَلِّقُوهُنَّ لِعِدَّتِهِنَّ وَأَحۡصُواْ ٱلۡعِدَّةَۖ وَٱتَّقُواْ ٱللَّهَ رَبَّكُمۡۖ لَا تُخۡرِجُوهُنَّ مِنۢ بُيُوتِهِنَّ وَلَا يَخۡرُجۡنَ إِلَّآ أَن يَأۡتِينَ بِفَٰحِشَةٖ مُّبَيِّنَةٖۚ وَتِلۡكَ حُدُودُ ٱللَّهِۚ وَمَن يَتَعَدَّ حُدُودَ ٱللَّهِ فَقَدۡ ظَلَمَ نَفۡسَهُۥۚ لَا تَدۡرِي لَعَلَّ ٱللَّهَ يُحۡدِثُ بَعۡدَ ذَٰلِكَ أَمۡرٗا","category":["65 (At-Talaq)","At-Talaq","Surah At-Talaq","Chapter At-Talaq","Talaq","Surah Talaq","Chapter Talaq","At Talaq","Surah At Talaq","Chapter At Talaq","Surah 65","Chapter 65","The Divorce","الطلاق"],"ayahNumber":5218,"juzNumber":28,"footnotes":"[1] నిర్ణీతగడువుతో అంటే గడువు ప్రారంభం కాగల సమయంలో, నిర్ణీతగడువు లోపల ఆమెతో రాజీపడే అవకాశం ఉండేరీతిలో విడాకులివ్వాలి. ఇబ్నె ఉమర్ ('ర'ది.'అ) తన భార్యకు ఋతుస్రావంకాలం (బహిష్టు సమయం)లో విడాకులిస్తే, దైవప్రవక్త ('స'అస) క్రోధితులయ్యారు. స్త్రీలు పరిశుద్ధులుగా ఉన్నకాలంలో వారితో లైంగిక సంబంధం చేయక ముందు విడాకులివ్వాలి అని బోధించారు. ('స. బు'ఖారీ). ఇక్కడ పేర్కొన్న 'హదీస్' ఈ ఆయత్ వెలుగులో ఉంది. ఆ గడువును ఖచ్ఛితంగా లెక్కపెట్టాలి.\n [2] ఇద్దత్ కాలం పూర్తి అయ్యే వరకు స్త్రీలు తమ భర్త ఇంటిలోనే ఉండాలి. భర్త ఆమె అన్న వస్త్రాల ఖర్చులు భరించాలి.\n [3] చూఅంటే అల్లాహ్ (సు.తా.) వారి మధ్య మళ్ళీ ప్రేమ కలగించవచ్చు మరియు వారు తిరిగి తమ వివాహబంధాన్ని స్థిరపరచుకోవచ్చు! అందుకే ఒకసారి విడాకులివ్వడం ప్రోత్సహించబడింది. మరియు చాలా మంది వ్యాఖ్యాతల అభిప్రాయం ప్రకారం - ఈ ఆయత్ వెలుగులో - మూడు విడాకులు ఒకేసారి ఇవ్వడం నిషేధింపబడింది. ఎందుకంటే మొదటి మరియు రెండవ విడాకు తరువాత వివాహాన్ని తిరిగి స్థిరపరచుకోవచ్చు! (ఫ'త్హ్ అల్ ఖదీర్). ఒక స్త్రీకి అంతకు ముందు రెండువిడాకులివ్వబడి ఆ తరువాత మూడవవిడాకు ఇస్తే! అప్పుడు ఆమె తన భర్త ఇంట్లో ఉండజాలదు. మరియు అలాంటి పరిస్థితిలో, ఆమె మరొక పురుషుణ్ణి వివాహమాడకముందు తిరిగి తన మొదటి భర్తతో వివాహం కూడా చేసుకోజాలదు. ఇది ఫాతిమబిన్తెఖైస్ (ర.'అన్హా) కు జరిగిన విషయంతో స్పష్టమవుతుంది. ఆమె భర్త ఆమెకు మూడవసారి విడాకులిచ్చిన తరువాత ఆమె తన భర్త ఇంటి నుండి వెళ్ళిపోవటానికి నిరాకరించింది. అప్పుడావిషయం దైవప్రవక్త ('స'అస) దగ్గరికి వస్తే అతనామెను, తన భర్త ఇల్లు విడవమని ఆజ్ఞాపించారు, (అ'హ్మద్, నసాయీ').","lang":"te","version":{"key":"telugu_muhammad","direction":"ltr","language_iso_code":"te","version":"1.0.6","last_update":1708432120,"title":"Telugu translation - Abder-Rahim ibn Muhammad","description":"Translation of the Quran meanings into Telugu by Maulana Abder-Rahim ibn Muhammad."},"meta":{"transliteration":"yāayyuhā al-nabiyu idhā ṭallaqtumu al-nisāa faṭalliqūhunna liʿiddatihinna wa-aḥṣū al-ʿidata wa-ittaqū al-laha rabbakum lā tukh'rijūhunna min buyūtihinna walā yakhruj'na illā an yatīna bifāḥishatin mubayyinatin watil'ka ḥudūdu al-lahi waman yataʿadda ḥudūda al-lahi faqad ẓalama nafsahu lā tadrī laʿalla al-laha yuḥ'dithu baʿda dhālika amran ","translations":["O","Prophet","When","you divorce","[the] women","then divorce them","for their waiting period","and keep count","(of) the waiting period","and fear","Allah","your Lord","(Do) not","expel them","from","their houses","and not","they should leave","except","that","they commit","an immorality","clear","And these","(are the) limits","(of) Allah","And whoever","transgresses","(the) limits","(of) Allah","then certainly","he has wronged","himself","Not","you know","Perhaps","Allah","will bring about","after","that","a matter","(1)"],"transliterationArr":["yāayyuhā","al-nabiyu","idhā","ṭallaqtumu","al-nisāa","faṭalliqūhunna","liʿiddatihinna","wa-aḥṣū","al-ʿidata","wa-ittaqū","al-laha","rabbakum","lā","tukh'rijūhunna","min","buyūtihinna","walā","yakhruj'na","illā","an","yatīna","bifāḥishatin","mubayyinatin","watil'ka","ḥudūdu","al-lahi","waman","yataʿadda","ḥudūda","al-lahi","faqad","ẓalama","nafsahu","lā","tadrī","laʿalla","al-laha","yuḥ'dithu","baʿda","dhālika","amran",null],"verseTiming":[[1,0,2570],[2,2570,4150],[3,4150,4570],[4,4570,5810],[5,5810,8620],[6,8620,10840],[7,10840,13130],[8,13130,13890],[9,13890,15270],[10,15270,16040],[11,16040,16860],[12,16860,18170],[13,18170,18450],[14,18450,20670],[15,20670,21670],[16,21670,23660],[17,23660,24200],[18,24200,25110],[19,25110,25910],[20,25910,26560],[21,26560,27130],[22,27130,28030],[23,28030,29970],[24,29970,30380],[25,30380,31760],[26,31760,32970],[27,32970,35540],[28,35540,36280],[29,36280,37100],[30,37100,39930],[31,39930,40200],[32,40200,41820],[33,41820,42510],[34,42510,43350],[35,43350,43860],[36,43860,44530],[37,44530,45760],[38,45760,46100],[39,46100,46920],[40,46920,47550],[41,47550,48410],[42,48410,49190],[43,49190,49650],[44,49650,50540],[45,50540,51505]]}}