{"name":"12:77","price":"Suka ce: \"Idan ya yi sãta, to, lalle ne wani ɗan'uwansa yã taɓa yin sãta a gabãninsa.\" Sai Yũsufu ya bõye* ta a cikin ransa. Kuma bai bayyana ta ba a gare su, ya ce: \"Kũ ne mafi sharri ga wuri. Kuma Allah ne Mafi sani daga abin da kuke siffantãwa.\"","arabic":"۞ قَالُوٓاْ إِن يَسۡرِقۡ فَقَدۡ سَرَقَ أَخٞ لَّهُۥ مِن قَبۡلُۚ فَأَسَرَّهَا يُوسُفُ فِي نَفۡسِهِۦ وَلَمۡ يُبۡدِهَا لَهُمۡۚ قَالَ أَنتُمۡ شَرّٞ مَّكَانٗاۖ وَٱللَّهُ أَعۡلَمُ بِمَا تَصِفُونَ","category":["12 (Yusuf)","Yusuf","Surah Yusuf","Chapter Yusuf","Surah 12","Chapter 12","Joseph","يوسُف"],"ayahNumber":1673,"juzNumber":13,"footnotes":"* 'Yan'uwan Yũsfu sun faɗi cewa ɗan'uwan Binyaminu ya taɓa yin sãta, dõminsu nũna cewa a wajen ubansu tsarkakakku ne daga yin sãta. Shi kuma wanda ya yi sãtan ya gade ta ne daga wajen uwarsa, dõmin wani shaƙĩƙinsa(Yũsufu) ya taɓa yin sãta. To, sai Yũsufu ya ce a ransa: \"Kũ ne dai mafi sharrin mutãne, Allah ne Mafi sani daga abin da kuke siffintãwa.\" Asalin wannan magana wata goggonsa ce (Shi Yũsufu) ɗiyar Is'hãƙa, ta riƙe shi, yanã yaro, har a lõkacin da ubansa (Yãƙũbu) ya so ya karɓe shi daga gare ta, sai ta yi kaidin sanya kãyan sãta a cikin rigarsa (Yũsufu) dõmin ta hana uban ɗaukarsa. A wata ruwaya kuma an ce shi (Yũsufu) ya ɗauke wani mutum mutumi ne na zĩnãri (gunki) ya karairaya shi. Don haka 'yan'uwansa suke jingina sãta a gare shi.","lang":"ha","version":{"key":"hausa_gummi","direction":"ltr","language_iso_code":"ha","version":"1.2.1","last_update":1609966800,"title":"Hausa language - Abu Bakr Jomy","description":"Translation of the Quran meanings into Hausa by Abu Bakr Mahmoud Jomy. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qālū in yasriq faqad saraqa akhun lahu min qablu fa-asarrahā yūsufu fī nafsihi walam yub'dihā lahum qāla antum sharrun makānan wal-lahu aʿlamu bimā taṣifūna ","translations":["They said","If","he steals ","then verily","stole","a brother","of his","before","before","But Yusuf kept it secret","But Yusuf kept it secret","within","himself","and (did) not","reveal it","to them","He said","You","(are the) worse","(in) position","and Allah","knows best","of what","you describe","(77)"],"transliterationArr":["qālū","in","yasriq","faqad","saraqa","akhun","lahu","min","qablu","fa-asarrahā","yūsufu","fī","nafsihi","walam","yub'dihā","lahum","qāla","antum","sharrun","makānan","wal-lahu","aʿlamu","bimā","taṣifūna",null],"verseTiming":[[1,0,2300],[2,2300,3250],[3,3250,4050],[4,4050,4720],[5,4720,5460],[6,5460,5980],[7,5980,6740],[8,6740,8220],[9,8220,8540],[10,8540,10750],[11,10750,11680],[12,11680,12170],[13,12170,13270],[14,13270,13920],[15,13920,15010],[16,15010,16240],[17,16240,16930],[18,16930,18190],[19,18190,18920],[20,18920,21450],[21,21450,22460],[22,22460,23310],[23,23310,23970],[24,23970,26905]]}}