{"name":"16:56","price":"Kuma sunã sanya rabõ *ga abin da ba su sani ba daga abin da Muka azurtã su. Ranstuwa da Allah! Lalle ne zã a tambaye ku daga abin da kuka kasance kunã ƙirƙirãwa.","arabic":"وَيَجۡعَلُونَ لِمَا لَا يَعۡلَمُونَ نَصِيبٗا مِّمَّا رَزَقۡنَٰهُمۡۗ تَٱللَّهِ لَتُسۡـَٔلُنَّ عَمَّا كُنتُمۡ تَفۡتَرُونَ","category":["16 (An-Nahl)","An-Nahl","Surah An-Nahl","Chapter An-Nahl","Nahl","Surah Nahl","Chapter Nahl","An Nahl","Surah An Nahl","Chapter An Nahl","Surah 16","Chapter 16","The Bee","النَّحل"],"ayahNumber":1957,"juzNumber":14,"footnotes":"* Sunã sanyãwar rabõ daga dabbõbi da hatsi ga gumãka kõ aljannu, alhãli ba su san amfãnin da gumãkan kõ aljannun suke iya jãwo musu ba kõ suke tunkuɗewa daga gare su. Akwai daga cikin ni'imõmin Allah, Ya shiryar da mutãne ga gãne cewa waɗannan gumãka da aljannu kõ wani mahalũƙi bã ya iya cũta kõ jãwo wani amfãni fãce da iznin Allah. Sabõda haka bãbu wanda ya cancanci a bauta masa fãce Allah, Mai tumɓuke cũta kuma Mai jãwo amfãni. Watau wannan bãyar da ni'imar 'yancin ɗan Adam kãmilan, su duka bãyi ne, bãbu daraja ga kõwa sai da taƙawa.Sanin haka wata ni'ima ce daga Allah.","lang":"ha","version":{"key":"hausa_gummi","direction":"ltr","language_iso_code":"ha","version":"1.2.1","last_update":1609966800,"title":"Hausa language - Abu Bakr Jomy","description":"Translation of the Quran meanings into Hausa by Abu Bakr Mahmoud Jomy. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wayajʿalūna limā lā yaʿlamūna naṣīban mimmā razaqnāhum tal-lahi latus'alunna ʿammā kuntum taftarūna ","translations":["And they assign","to what","not","they know ","a portion","of what","We have provided them","By Allah","surely you will be asked","about what","you used (to)","invent","(56)"],"transliterationArr":["wayajʿalūna","limā","lā","yaʿlamūna","naṣīban","mimmā","razaqnāhum","tal-lahi","latus'alunna","ʿammā","kuntum","taftarūna",null],"verseTiming":[[1,0,1360],[2,1360,2090],[3,2090,2490],[4,2490,3760],[5,3760,4580],[6,4580,6620],[7,6620,8590],[8,8590,9630],[9,9630,11460],[10,11460,12790],[11,12790,14220],[12,14220,16715]]}}