{"name":"16:8","price":"Kuma da dawãki* da alfadarai da jãkuna, dõmin ku hau su, kuma da ƙawa. Kuma Yana halitta abin da ba ku sani ba.","arabic":"وَٱلۡخَيۡلَ وَٱلۡبِغَالَ وَٱلۡحَمِيرَ لِتَرۡكَبُوهَا وَزِينَةٗۚ وَيَخۡلُقُ مَا لَا تَعۡلَمُونَ","category":["16 (An-Nahl)","An-Nahl","Surah An-Nahl","Chapter An-Nahl","Nahl","Surah Nahl","Chapter Nahl","An Nahl","Surah An Nahl","Chapter An Nahl","Surah 16","Chapter 16","The Bee","النَّحل"],"ayahNumber":1909,"juzNumber":14,"footnotes":"* Haɗa dawãki da alfadarai zuwa ga jãkuna kuma aka ce dõmin \"hawansu da yin ƙawã\" yana nũna cewa ba a cin dawãki da alfadarai dõmin an san cewa an hana cin jãkuna a lõkacin yãƙin Khaibara, kuma ãyõyin da ke gaba da wannan ãya sun nũna anã cin dabbõbin ni'ima kuma anã hawansu, kuma cin nãma yã fi hawa zama ni'ima, sabõda haka, shĩ ne ya kamãta a ambata inda ya halatta. Wannan ne mazhabar Mãliki da Ahu Hanĩfa, kuma shĩ ne maganar Abdullah bn Abbãs Allah Ya yarda da su. Wasu sun ce ana cin dawãki da alfadarai dõmin cewa, \"Anã hawansu dõmin ƙawa,\" bã ya hana a yi wani abu da su, wato cin nãmansu, dõmin a cikin Bukhãri daMuslim an ruwaito halaccin cin dawãki. Wannan shĩ ne maganar Al-Hasan da Shuraih da 'Aɗa' a da Sa'ĩd bn Jubair. Kuma Shi ne mazhabar shãfi'i da Is'hãƙ. Sun yi hujja da halaccin nãman dawãki da abin da Asmã'u bint Abĩ Bakar Assiddiƙ ta ce, \"Mun sõke wata gõɗiya' muka ci a zamanin Manzon Allah,a Madina.\" Kuma a cikin Bukhãri da Muslim daga jãbir, Allah Ya yarda da shi, \"Mun ci dawãki da jãkunan jeji a Khaibara, kuma Annabi tsira da aminci sun tabbata a gare shi, ya hana jãkunan gida\" Acikin Abĩ Dãwud, \"Mun yanke dawãki da alfadarai da jakuna alhãli yunwa ta kãmã mu, amma sai Annabi ya hana mu cin jãkuna da alfadarai, bai hana mu cin dawãki ba\" Nĩ, a ganina, ra'ayin cin dawãki ya fi ƙarfi dõmin sũrar ta sauka a Makka, amma hadisin yankan gõɗiyar, a Madĩna aka yi shi. Saboda haka surar ba ta shãfe shi ba. Dũbi Radd Al-Azhãn.","lang":"ha","version":{"key":"hausa_gummi","direction":"ltr","language_iso_code":"ha","version":"1.2.1","last_update":1609966800,"title":"Hausa language - Abu Bakr Jomy","description":"Translation of the Quran meanings into Hausa by Abu Bakr Mahmoud Jomy. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wal-khayla wal-bighāla wal-ḥamīra litarkabūhā wazīnatan wayakhluqu mā lā taʿlamūna ","translations":["And horses","and mules","and donkeys","for you to ride them","and (as) adornment","And He creates","what","not","you know","(8)"],"transliterationArr":["wal-khayla","wal-bighāla","wal-ḥamīra","litarkabūhā","wazīnatan","wayakhluqu","mā","lā","taʿlamūna",null],"verseTiming":[[1,0,1360],[2,1360,2740],[3,2740,4180],[4,4180,6060],[5,6060,7640],[6,7640,8800],[7,8800,9360],[8,9360,9750],[9,9750,12675]]}}