{"name":"16:91","price":"Kuma ku cika da alkãwarin* Allah idan kun yi alkawari, kuma kada ku warware rantsuwõyinku a bãyan ƙarfafa su, alhãli kuma haƙĩƙa kun sanya Allah Mai lãmuncẽwa a kanku. Kuma lalle Allah ne Yake sanin abin da kuke aikatãwa.","arabic":"وَأَوۡفُواْ بِعَهۡدِ ٱللَّهِ إِذَا عَٰهَدتُّمۡ وَلَا تَنقُضُواْ ٱلۡأَيۡمَٰنَ بَعۡدَ تَوۡكِيدِهَا وَقَدۡ جَعَلۡتُمُ ٱللَّهَ عَلَيۡكُمۡ كَفِيلًاۚ إِنَّ ٱللَّهَ يَعۡلَمُ مَا تَفۡعَلُونَ","category":["16 (An-Nahl)","An-Nahl","Surah An-Nahl","Chapter An-Nahl","Nahl","Surah Nahl","Chapter Nahl","An Nahl","Surah An Nahl","Chapter An Nahl","Surah 16","Chapter 16","The Bee","النَّحل"],"ayahNumber":1992,"juzNumber":14,"footnotes":"* Wanda yake rantsuwar alkawari da wani, sa'an nan ya warware rantsuwar dõmin neman ya ƙulla wata rantsuwa da wani mutum sabõda wani amfãninsa kõ jama'arsa a cikin wata kabĩla wadda ta fi ta mutãnen farko ƙarfi to, siffarsa kamar mace ce mahaukaciya, mai yin zare, a bayan ta tukka shi, ya yi ƙarfi, sa'an nan ta warware shi. Sabõda haka idan ta so mayar da shi wani zare, to, bã zai yi kyau ba kamar zaren farko da ta yi kuma mutãne sun gãne haukarta, bã zã su yi wata ma'ãmala da ita ba. Wanda ya yi rantsuwa da Allah a kan abu, to, yã sanya Allah lãmuni ke nan. Bã ya halatta ga wanda ya shugabantar da Allah ga wani abu, sa'an nan ya kõma bãya ya ƙi cika wannan alkawarin dõmin bai kiyãye girman Allah ba, wanda ya sanya a tsakaninsa da abõkin ma'ãmalarsa. Tsaron alkawari ni'ima ne.","lang":"ha","version":{"key":"hausa_gummi","direction":"ltr","language_iso_code":"ha","version":"1.2.1","last_update":1609966800,"title":"Hausa language - Abu Bakr Jomy","description":"Translation of the Quran meanings into Hausa by Abu Bakr Mahmoud Jomy. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-awfū biʿahdi al-lahi idhā ʿāhadttum walā tanquḍū al-aymāna baʿda tawkīdihā waqad jaʿaltumu al-laha ʿalaykum kafīlan inna al-laha yaʿlamu mā tafʿalūna ","translations":["And fulfil","the covenant","(of) Allah","when","you have taken a covenant","and (do) not","break","oaths","after","their confirmation","while verily","you have made","Allah","over you","a surety","Indeed","Allah","knows","what","you do","(91)"],"transliterationArr":["wa-awfū","biʿahdi","al-lahi","idhā","ʿāhadttum","walā","tanquḍū","al-aymāna","baʿda","tawkīdihā","waqad","jaʿaltumu","al-laha","ʿalaykum","kafīlan","inna","al-laha","yaʿlamu","mā","tafʿalūna",null],"verseTiming":[[1,0,1070],[2,1070,1920],[3,1920,2770],[4,2770,3320],[5,3320,4580],[6,4580,5150],[7,5150,6530],[8,6530,7800],[9,7800,8380],[10,8380,9790],[11,9790,10450],[12,10450,11430],[13,11430,12200],[14,12200,13350],[15,13350,14840],[16,14840,15750],[17,15750,16660],[18,16660,17510],[19,17510,17950],[20,17950,20115]]}}