{"name":"18:60","price":"Kuma a lõkacin da Mũsã* ya ce wa yãronsa, \"Bã zan gushe ba sai na isa mahaɗar tẽku biyu, kõ in shũɗe da tafiya shekara da shẽkaru.\"","arabic":"وَإِذۡ قَالَ مُوسَىٰ لِفَتَىٰهُ لَآ أَبۡرَحُ حَتَّىٰٓ أَبۡلُغَ مَجۡمَعَ ٱلۡبَحۡرَيۡنِ أَوۡ أَمۡضِيَ حُقُبٗا","category":["18 (Al-Kahf)","Al-Kahf","Surah Al-Kahf","Chapter Al-Kahf","Kahf","Surah Kahf","Chapter Kahf","Al Kahf","Surah Al Kahf","Chapter Al Kahf","Surah 18","Chapter 18","The Cave","الكَهف"],"ayahNumber":2200,"juzNumber":15,"footnotes":"* Shĩ ne MũSã bn Imrãn Manzon Banĩ Isrã'ĩla. Sababin wannan ƙissa, an tambaye shi ne, \"Wãne ne ya fi ilmi a saninsa?\" Sai ya ce: \"Shĩ ne ya fi. Wannan jawãbi nãsa gaskiya ne, dõmin shĩ ne Manzon zãmaninsa, shĩ ne aka bai wa Attaura, kuma Allah Ya yi magana da shi, sai dai ya mance bai ce Allah Ya fi sani ba, dõmin haka aka ce masa ya tafi neman ilmi ga wani mutum a magamar teku biyu. Wannan bãwan Allah Haliru ne. Yãron Mũsã kuwa, shĩ ne Yũsha'u bn Nũn, Manzon Allah a bãyan Mũsã. Kĩfin kuma na guzurinsu ne wanda Allah Ya umurce shi ya ɗauka, sõyayye, kuma aka ce musu duka inda yai rai, to, a nan ne Bãwan Allah yake, mai shirin ƙãra wa Mũsã ilmi. Mayar da ilmi ga Allah, shĩ ne ladabin shari'a.","lang":"ha","version":{"key":"hausa_gummi","direction":"ltr","language_iso_code":"ha","version":"1.2.1","last_update":1609966800,"title":"Hausa language - Abu Bakr Jomy","description":"Translation of the Quran meanings into Hausa by Abu Bakr Mahmoud Jomy. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-idh qāla mūsā lifatāhu lā abraḥu ḥattā ablugha majmaʿa al-baḥrayni aw amḍiya ḥuquban ","translations":["And when","said","Musa","to his boy","Not","I will cease","until","I reach","the junction","(of) the two seas","or","I continue","(for) a long period","(60)"],"transliterationArr":["wa-idh","qāla","mūsā","lifatāhu","lā","abraḥu","ḥattā","ablugha","majmaʿa","al-baḥrayni","aw","amḍiya","ḥuquban",null],"verseTiming":[[1,0,720],[2,720,1475],[3,1475,2165],[4,2165,3429],[5,3429,3895],[6,3895,6197],[7,6197,8671],[8,8671,9584],[9,9584,10281],[10,10281,11485],[11,11485,12025],[12,12025,12843],[13,12843,13898]]}}