{"name":"21:79","price":"Sai Muka fahimtar da ita (mats'alar)* ga Sulaiman. Kuma dukansu Mun bã su hukunci da ilmi kuma Muka hõre duwatsu tãre da Dãwũda, sunã tasbĩhi, da tsuntsãye. Kuma Mun kasance Mãsu aikatãwa.","arabic":"فَفَهَّمۡنَٰهَا سُلَيۡمَٰنَۚ وَكُلًّا ءَاتَيۡنَا حُكۡمٗا وَعِلۡمٗاۚ وَسَخَّرۡنَا مَعَ دَاوُۥدَ ٱلۡجِبَالَ يُسَبِّحۡنَ وَٱلطَّيۡرَۚ وَكُنَّا فَٰعِلِينَ","category":["21 (Al-Anbiya)","Al-Anbiya","Surah Al-Anbiya","Chapter Al-Anbiya","Anbiya","Surah Anbiya","Chapter Anbiya","Al Anbiya","Surah Al Anbiya","Chapter Al Anbiya","Surah 21","Chapter 21","The Prophets","الأنبيَاء"],"ayahNumber":2562,"juzNumber":17,"footnotes":"* Asalin mats'alar, tumãkin wani mutum suka yi kĩwon ɓarna a gõnar wani a cikin dare alhãli kuwa anã kallafa wa mai dabbõbi ya kange dabbõbinsa da dare kamar yadda ake kallafa wa mai shũka da tsare shũkarsa a cikin yini. Sai Dãwũdu ya yi hukunci da cewa mai shũkar ya mallaki tumakin, shi kuma mai tumãki ya mallaki shũkar ɓãtacciya. Sai Sulaimãn ya gyãra hukuncin da cħwa mai gõna ya riƙi tumãkin ya rãyu a kansu har a lõkacin da mai dabbõbin ya gyãra masa gonarsa har ta Koma yadda take a farKon lõkacin,sa'an nan ya mayar da tumãkin ya karɓi gõnarsa. A cikin ƙissar akwai nũnin cewa Annabãwa bã su saunar faɗin gaskiya, sabõda wani mutum duk yadda yake, kuma anã warware hukunci idan kuskure ya auku a ciki, kuma Annabãwa sunã yin kuskure ga abin da bai shãfi wahayiba. Kuma kõmãwa ga askiya idan tã bayyana wajibi ne.","lang":"ha","version":{"key":"hausa_gummi","direction":"ltr","language_iso_code":"ha","version":"1.2.1","last_update":1609966800,"title":"Hausa language - Abu Bakr Jomy","description":"Translation of the Quran meanings into Hausa by Abu Bakr Mahmoud Jomy. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"fafahhamnāhā sulaymāna wakullan ātaynā ḥuk'man waʿil'man wasakharnā maʿa dāwūda al-jibāla yusabbiḥ'na wal-ṭayra wakunnā fāʿilīna ","translations":["And We gave understanding of it","(to) Sulaiman","and (to) each","We gave","judgment","and knowledge","And We subjected","with","Dawud","the mountains","(to) glorify Our praises","and the birds","And We were","the Doers","(79)"],"transliterationArr":["fafahhamnāhā","sulaymāna","wakullan","ātaynā","ḥuk'man","waʿil'man","wasakharnā","maʿa","dāwūda","al-jibāla","yusabbiḥ'na","wal-ṭayra","wakunnā","fāʿilīna",null],"verseTiming":[[1,0,1790],[2,1790,4720],[3,4720,5680],[4,5680,6770],[5,6770,8560],[6,8560,10000],[7,10000,11370],[8,11370,11800],[9,11800,12770],[10,12770,13850],[11,13850,15060],[12,15060,16120],[13,16120,17800],[14,17800,20165]]}}