{"name":"24:11","price":"Lalle ne waɗanda* suka zo da ƙiren ƙarya waɗansu jama'a ne daga gare ku, kada ku yi zatonsa sharri ne a gare ku. Ã'a, alhẽri ne gare ku. Kõwane mutum daga gare su na da sakamakon abin da ya sanã'anta na zunubi, kuma wanda ya jiɓinci girmansa, daga gare su, yanã da azãba mai girma.","arabic":"إِنَّ ٱلَّذِينَ جَآءُو بِٱلۡإِفۡكِ عُصۡبَةٞ مِّنكُمۡۚ لَا تَحۡسَبُوهُ شَرّٗا لَّكُمۖ بَلۡ هُوَ خَيۡرٞ لَّكُمۡۚ لِكُلِّ ٱمۡرِيٕٖ مِّنۡهُم مَّا ٱكۡتَسَبَ مِنَ ٱلۡإِثۡمِۚ وَٱلَّذِي تَوَلَّىٰ كِبۡرَهُۥ مِنۡهُمۡ لَهُۥ عَذَابٌ عَظِيمٞ","category":["24 (An-Nur)","An-Nur","Surah An-Nur","Chapter An-Nur","Nur","Surah Nur","Chapter Nur","An Nur","Surah An Nur","Chapter An Nur","Surah 24","Chapter 24","The Light","النُّور"],"ayahNumber":2802,"juzNumber":18,"footnotes":"* Farko Hadĩsil Ifk ne wanda waɗansu suka jefi Ã'isha, Ummul Mũminĩna da zina a cikinsa Allah Ya barrantar da ita. Bai zama sharri ba ga Musulmi, sai dai ya zama alheri dõmin ya zama sanadi ga sanin hukunce-hukunce mãsu yawa, na zaman jama'a da kuma darajar mutãnen da abin ya shãfa. Yadda ƙissar take shi ne yadda Ã'ishatu, Uwar Mũminai ta faɗa, ta ce: \"Na kasance tãre da Annabi tsĩra da amincin Allah su tabbata a gare shi, a cikin wani yãƙi, a bãyan an saukar da Hijãbi, watau kulle. Sai ya ƙãre daga yãƙin ya kõma, ya yi kusa da Madĩna, sai ya yi umurni da tãshi ga tafiya a wani dare, sai ni kuma na tafi na ƙãre sha'anĩna, na fuskanta zuwa ga wurin rãƙumãta, sai na ga abin wuyana ya yanke, saina kõma, na neme shi, kuma su mãsu kula da ni suka ɗauki darbũka suka aza a kan rãkuma sunã zaton inã ciki alhãli mãtã sun kasance sauƙãƙa dõmin ba su cin kõme sai kaɗan na abinci.\" Na sãmi abin wuyãna na kõmo a bãyan sun tafi. Sai na zaunaa masaukĩna wanda na kasance a ciki. Kuma na yi zaton mutãnen zã su rasa ni su kõmo zuwa gare ni. Sai na ji barci na yi barcin. Shi kuma Safwãnu ya yi rurumi daga bãyan ãyarin yãƙi, ya fita da sauran dare sai ya wãyi gari a inda nake. Sai ya ga duhun mutum mai barci, sai ya gãne ni a lõkacin da ya gan ni, dãmã ya kasance yanã ganĩ na a gabãnin kulle, sai na farka da jin sautinsa na istirjã'i. \"A lõkacin da ya gãne ni, sai na rufe fuskãta da mayãfina. Wallãhi bai yi mini magana ba da kalma, ni kuma ban ji kõ kalma ba daga gare shi, sai dai istirjã'insa a lõkacin da ya gurfanar da rãƙumarsa, ya take ƙafarta ta gaba, ni kuma nã hau, ya shiga yanã jan rãƙumar da ni har muka isa ga uwar yãƙin, a bãyan sun sauka, a cikin zãfin rãna. Daga nan wanda ya halaka ya halaka, wanda ya jiɓinci girman abin, shi ne Abdullahi bn Ubayyi bn salũl. \"Buhãri da Muslimu sun ruwaito shi.","lang":"ha","version":{"key":"hausa_gummi","direction":"ltr","language_iso_code":"ha","version":"1.2.1","last_update":1609966800,"title":"Hausa language - Abu Bakr Jomy","description":"Translation of the Quran meanings into Hausa by Abu Bakr Mahmoud Jomy. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"inna alladhīna jāū bil-if'ki ʿuṣ'batun minkum lā taḥsabūhu sharran lakum bal huwa khayrun lakum likulli im'ri-in min'hum mā ik'tasaba mina al-ith'mi wa-alladhī tawallā kib'rahu min'hum lahu ʿadhābun ʿaẓīmun ","translations":["Indeed","those who","brought","the lie","(are) a group","among you","(Do) not","think it","bad","for you","nay","it","(is) good","for you","For every","person","among them","(is) what","he earned","of","the sin","and the one who","took upon himself a greater share of it","took upon himself a greater share of it","among them ","for him","(is) a punishment","great","(11)"],"transliterationArr":["inna","alladhīna","jāū","bil-if'ki","ʿuṣ'batun","minkum","lā","taḥsabūhu","sharran","lakum","bal","huwa","khayrun","lakum","likulli","im'ri-in","min'hum","mā","ik'tasaba","mina","al-ith'mi","wa-alladhī","tawallā","kib'rahu","min'hum","lahu","ʿadhābun","ʿaẓīmun",null],"verseTiming":[[1,0,1480],[2,1480,2480],[3,2480,4850],[4,4850,5810],[5,5810,6620],[6,6620,8730],[7,8730,9110],[8,9110,10340],[9,10340,11000],[10,11000,12270],[11,12270,12670],[12,12670,13100],[13,13100,13800],[14,13800,15160],[15,15160,15900],[16,15900,16600],[17,16600,18090],[18,18090,19010],[19,19010,19880],[20,19880,20190],[21,20190,20920],[22,20920,22490],[23,22490,23490],[24,23490,24540],[25,24540,25420],[26,25420,25980],[27,25980,26920],[28,26920,29455]]}}