{"name":"27:48","price":"Kuma waɗansu jama'a tara* sun kasance a cikin birnin, sunã yin ɓarna, kuma bã su kyautatãwa. Suka ce: \"Ku yi rantsuwa da Allah, lalle zã mu kwãnan masa,** shi da mutãnensa sa'an nan mu ce wa waliyyinsa. 'Ba mu halarci halakar mutãnensa ba kuma mũ, haƙĩ ƙa, mãsu gaskiya ne'.\"","arabic":"وَكَانَ فِي ٱلۡمَدِينَةِ تِسۡعَةُ رَهۡطٖ يُفۡسِدُونَ فِي ٱلۡأَرۡضِ وَلَا يُصۡلِحُونَ","category":["27 (An-Naml)","An-Naml","Surah An-Naml","Chapter An-Naml","Naml","Surah Naml","Chapter Naml","An Naml","Surah An Naml","Chapter An Naml","Surah 27","Chapter 27","The Ant","النَّمْل"],"ayahNumber":3207,"juzNumber":19,"footnotes":"* Yawan mãsu ɓarnã bã ya hana gaskiya bayyana. Kuma mai mãkirci dõmin ya halakar da mai gargaɗin addinin Allah, yanã yi wa kansa sanadin halaka kawai ne. Waɗannan mutãne tara sun yi niyyar kashe Sãlihu ne, bã da sanin danginsa ba, a wurin dayake kwãna yanã salla a masallacinsa, a bãyan gari. A can Allah ya halakar da su. Wannan shĩ ne sakamakon mãkircin da suka ƙulla. ** Zã mu kwãnan masa, ai zãmu kwãna da niyyar kashe shi a cikin dare, a ɓõye.","lang":"ha","version":{"key":"hausa_gummi","direction":"ltr","language_iso_code":"ha","version":"1.2.1","last_update":1609966800,"title":"Hausa language - Abu Bakr Jomy","description":"Translation of the Quran meanings into Hausa by Abu Bakr Mahmoud Jomy. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wakāna fī al-madīnati tis'ʿatu rahṭin yuf'sidūna fī al-arḍi walā yuṣ'liḥūna ","translations":["And were","in","the city","nine","family heads","they were spreading corruption","in","the land","and not","reforming","(48)"],"transliterationArr":["wakāna","fī","al-madīnati","tis'ʿatu","rahṭin","yuf'sidūna","fī","al-arḍi","walā","yuṣ'liḥūna",null],"verseTiming":[[1,0,890],[2,890,1060],[3,1060,2350],[4,2350,3190],[5,3190,4470],[6,4470,5600],[7,5600,5830],[8,5830,6680],[9,6680,7180],[10,7180,10545]]}}