{"name":"2:151","price":"Kamar* yadda Muka aika Manzo a cikinku, daga gare ku, yana karanta ãyõyinMu a gare ku kuma yana tsarkake ku, kuma yana sanar da ku Littãfi da hikima, kuma yana sanar da ku abin da ba ku kasance kuna sani ba.","arabic":"كَمَآ أَرۡسَلۡنَا فِيكُمۡ رَسُولٗا مِّنكُمۡ يَتۡلُواْ عَلَيۡكُمۡ ءَايَٰتِنَا وَيُزَكِّيكُمۡ وَيُعَلِّمُكُمُ ٱلۡكِتَٰبَ وَٱلۡحِكۡمَةَ وَيُعَلِّمُكُم مَّا لَمۡ تَكُونُواْ تَعۡلَمُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":158,"juzNumber":2,"footnotes":"* Jũyar da alƙibla da yankewa daga dukkan kãfirai da hani daga tsõronsu kuma Allah Ya farkar da Musulmi ga ni'imõmin da Ya yi musu game da aiko Annabi daga gare su, zuwa gare su, a cikinsu, dõmin ya tsarkake su, bayyane da ɓõye, daga dukan ƙurar kãfirci. Wannan ya nũna cewa sai an yi rarrashin mutãne wajen kira zuwa ga addini da kõwace hanya mai yiwuwa. Bãyan haka a yanke wa wanda ya ƙi bin gaskiya bayyane kuma kada a ji tsõronsa. Kuma aka umurce su da fuskanta zuwa ga Allah kawai da tunãwa gare Shi da gõdiya, da nisantar kafirci.","lang":"ha","version":{"key":"hausa_gummi","direction":"ltr","language_iso_code":"ha","version":"1.2.1","last_update":1609966800,"title":"Hausa language - Abu Bakr Jomy","description":"Translation of the Quran meanings into Hausa by Abu Bakr Mahmoud Jomy. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"kamā arsalnā fīkum rasūlan minkum yatlū ʿalaykum āyātinā wayuzakkīkum wayuʿallimukumu al-kitāba wal-ḥik'mata wayuʿallimukum mā lam takūnū taʿlamūna ","translations":["As","We sent","among you","a Messenger","from you","(who) recites","to you","Our verses","and purifies you","and teaches you","the Book","and the wisdom","and teaches you","what","not","you were","knowing","(151)"],"transliterationArr":["kamā","arsalnā","fīkum","rasūlan","minkum","yatlū","ʿalaykum","āyātinā","wayuzakkīkum","wayuʿallimukumu","al-kitāba","wal-ḥik'mata","wayuʿallimukum","mā","lam","takūnū","taʿlamūna",null],"verseTiming":[[1,0,2300],[2,2300,3450],[3,3450,4260],[4,4260,5110],[5,5110,7300],[6,7300,8060],[7,8060,9070],[8,9070,10490],[9,10490,12440],[10,12440,13970],[11,13970,15520],[12,15520,16540],[13,16540,17630],[14,17630,19100],[15,19100,20180],[16,20180,20490],[17,20490,21480],[18,21480,24065]]}}