{"name":"2:72","price":"Kuma a lõkacin da kuka yi kisan kai, kuka dinga tunkuɗa wa jũna laifĩ a cikinsa,* kuma Allah Mai fitar da abin da kuka kasance kuna ɓõyẽwa ne.","arabic":"وَإِذۡ قَتَلۡتُمۡ نَفۡسٗا فَٱدَّٰرَٰءۡتُمۡ فِيهَاۖ وَٱللَّهُ مُخۡرِجٞ مَّا كُنتُمۡ تَكۡتُمُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":79,"juzNumber":1,"footnotes":"* Asalin ƙissar, wani mutum ne mai arziƙi da yawa daga cikin Banĩ Isra'ĩla amma bã shida magaji sai ɗan ɗan'uwan sa. Saboda yayi gãdo, sai ya kashe shi da dare, ya kuma ɗauke shi ya ajiye shi a bakin ƙofar wani mutum, a cikin su. Da safiyã ta wãye, sai suka tãshi dõmin su yi faɗa a tsakãnin dangin wanda aka kashe da dangin wanda aka same shi a ƙofarsu, sa'an nan suka haɗa ra'ayi ga su kai ƙãra ga Manzon Allah, Mũsã. Suka isa gareshi, suka ba shi lãbãrin. Sai yace musu: \"Lalle ne, Allah Yã ce: \"Ku yanka wata sãniya.\" Da sun yanke kõwace irin sãniya da buƙãtarsu ta biya musu, amma sai suka yi ta yin tambayoyi ana bã su amsa, kuma yanã ƙãra yi musu wuyã, har suka kai ga a sifantã musu sãniyar yãro mai ɗã'a ga uwarsa wadda aka ce: bã zã a sayar musu da ita ba sai da zĩnãriya cike da fãtarta ko dai dai da nauyinta sau gõma. Bayan sun saye ta suka yanka ta sai Mũsã ya ce musu, su dõki wanda aka kashen nan da wani juzu'i nata. Suka dõke shi da ƙashin ta kõ harshenta, sai ya tãshi ya ce: \"Wane ɗan ɗan'uwãna, ya kasheni.\" Sai suka kãma wanda ya yi kisar suka kashe shi. Tartĩbin Alƙur'ãni ya yi ishara da mas'alar tsaurin kan Banĩ Isra'ila da hikimar bin umurnin Allah, da ĩkon tãyar da matattu da gaskiyar Wahayin Annabawa, da asiran da Allah ke sanyãwa a cikin wasu abũbuwa dõmin su zama sanadi ga aukuwar wasu, da yadda yake azurta mãsu yi masa ɗã'a, da sauran su duk a cikin ƙissa guda, ba da ya ambaci tsarin asalinta ba. Tsarki ya tabbata ga Allah.","lang":"ha","version":{"key":"hausa_gummi","direction":"ltr","language_iso_code":"ha","version":"1.2.1","last_update":1609966800,"title":"Hausa language - Abu Bakr Jomy","description":"Translation of the Quran meanings into Hausa by Abu Bakr Mahmoud Jomy. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-idh qataltum nafsan fa-iddāratum fīhā wal-lahu mukh'rijun mā kuntum taktumūna ","translations":["And when","you killed","a man","then you disputed","concerning it","but Allah","(is) the One Who brought forth","what","you were","concealing","(72)"],"transliterationArr":["wa-idh","qataltum","nafsan","fa-iddāratum","fīhā","wal-lahu","mukh'rijun","mā","kuntum","taktumūna",null],"verseTiming":[[1,0,690],[2,690,1700],[3,1700,3030],[4,3030,4650],[5,4650,5430],[6,5430,6440],[7,6440,7240],[8,7240,8240],[9,8240,9840],[10,9840,12935]]}}