{"name":"3:121","price":"Kuma a lõkacin* da ka yi sauko daga iyãlanka kana zaunar da mũminai a wurãren zamadõmin yãƙi, kuma Allah Mai ji ne, Masani.","arabic":"وَإِذۡ غَدَوۡتَ مِنۡ أَهۡلِكَ تُبَوِّئُ ٱلۡمُؤۡمِنِينَ مَقَٰعِدَ لِلۡقِتَالِۗ وَٱللَّهُ سَمِيعٌ عَلِيمٌ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":414,"juzNumber":4,"footnotes":"* Misãli ne ga cewa idan kun yi ĩmãni, kuma kun yi taƙawa, to, ƙullinsu bã ya cũtar da ku da kõme, dõmin abin da ya auku a Yãƙin Uhdu ya isa misãli ga cewa, sai kun karkace daga hanya sa'an nan wani abu zai sãme ku. Asalin maganar shĩ ne, Annabi yã fita Uhdu da mutum ɗari tara da hamsin kuma kãfirai sunã dubũ uku. Annabi ya sauka a Uhdu rãnar Asabat, bakwai ga Shawwal, shekara ta uku ga Hijira, ya sanya bayansa wajen dũtsen Uhdu, ya gyãra safũfuwan mayãƙa, kuma ya zaunar da wata runduna ta maharba a gefen dũtsen da shugabancin Abdullahi ɗan Jubair. Sa'an nan ya ce musu: \"Ku kãre mu da harbi, kada su zo mana daga bãya, kada ku ɗaga daga nan, mun rinjãya kõ an rinjãye mu.\" Sai suka sãɓãwa umurnin, don haka masĩfar Uhdu ta auku.","lang":"ha","version":{"key":"hausa_gummi","direction":"ltr","language_iso_code":"ha","version":"1.2.1","last_update":1609966800,"title":"Hausa language - Abu Bakr Jomy","description":"Translation of the Quran meanings into Hausa by Abu Bakr Mahmoud Jomy. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-idh ghadawta min ahlika tubawwi-u al-mu'minīna maqāʿida lil'qitāli wal-lahu samīʿun ʿalīmun ","translations":["And when","you left early morning","from","your household","to post","the believers","(to take) positions","for the battle","And Allah","(is) All-Hearing","All-Knowing","(121)"],"transliterationArr":["wa-idh","ghadawta","min","ahlika","tubawwi-u","al-mu'minīna","maqāʿida","lil'qitāli","wal-lahu","samīʿun","ʿalīmun",null],"verseTiming":[[1,0,720],[2,720,1640],[3,1640,2010],[4,2010,2860],[5,2860,3890],[6,3890,5420],[7,5420,6630],[8,6630,9040],[9,9040,10360],[10,10360,11500],[11,11500,13745]]}}