{"name":"3:172","price":"Waɗanda suka karɓa* kira zuwa ga Allah da ManzonSa, daga bãyan mĩki ya sãme su. Akwai wata lãda mai girma ga waɗanda suka kyautata** yi daga gare su, kuma suka yi taƙawa.","arabic":"ٱلَّذِينَ ٱسۡتَجَابُواْ لِلَّهِ وَٱلرَّسُولِ مِنۢ بَعۡدِ مَآ أَصَابَهُمُ ٱلۡقَرۡحُۚ لِلَّذِينَ أَحۡسَنُواْ مِنۡهُمۡ وَٱتَّقَوۡاْ أَجۡرٌ عَظِيمٌ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":465,"juzNumber":4,"footnotes":"* Bayan kõmawar Musulmi daga Uhdu da miyãkun da suka sãme su, sai Annabi ya umurce su da fita a bãyan kãfirai, dõmin kada su yi tunãnin kõmãwa. Sai suka fita bãyansu, aka dãce kuwa Abu Sufyãna ya umurci mutãnensa da kõmawa Madĩna dõmin su tumɓuke Musulmi. An yi Uhdu ta farko ran Asabat, sa'an nan suka fita a bãyansu a rãnar Lahadi, suka riske su a Hamra'al Asad. Sai aka yi tawãfuƙi (yarjejeniya) tsakanin Annabi da Abu Sufyãna a kan a bar yãƙi a lõkacin, sai shekara mai zuwa, a haɗu a Badar. Allah Ya yabi Musulmi, da suka karɓa wannan kira, a cikin miyãkũ. Haka duka mai karɓawa irinsu, yã shiga a cikin irin wannan yabo har ya zuwa tãshin Ƙiyãma. ** Kyautata yi shi ne tsarkake aiki dõmin Allah watau ihsani kõ ihlasi.","lang":"ha","version":{"key":"hausa_gummi","direction":"ltr","language_iso_code":"ha","version":"1.2.1","last_update":1609966800,"title":"Hausa language - Abu Bakr Jomy","description":"Translation of the Quran meanings into Hausa by Abu Bakr Mahmoud Jomy. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"alladhīna is'tajābū lillahi wal-rasūli min baʿdi mā aṣābahumu al-qarḥu lilladhīna aḥsanū min'hum wa-ittaqaw ajrun ʿaẓīmun ","translations":["Those who","responded","to Allah","and the Messenger","from","after","what","befell them ","the injury ","for those who","did good","among them","and feared Allah","(is) a reward ","great","(172)"],"transliterationArr":["alladhīna","is'tajābū","lillahi","wal-rasūli","min","baʿdi","mā","aṣābahumu","al-qarḥu","lilladhīna","aḥsanū","min'hum","wa-ittaqaw","ajrun","ʿaẓīmun",null],"verseTiming":[[1,0,1320],[2,1320,2780],[3,2780,3860],[4,3860,5270],[5,5270,6490],[6,6490,7220],[7,7220,8700],[8,8700,10050],[9,10050,10740],[10,10740,12680],[11,12680,13770],[12,13770,14750],[13,14750,15800],[14,15800,16630],[15,16630,19455]]}}