{"name":"48:2","price":"Dõmin Allah Ya shãfe abin da ya gabãta na laifinka* da abin da ya jinkirta, kuma Ya cika ni'imar Sa a kanka, kuma Ya shiryar da kai ga hanya madaidaiciya.","arabic":"لِّيَغۡفِرَ لَكَ ٱللَّهُ مَا تَقَدَّمَ مِن ذَنۢبِكَ وَمَا تَأَخَّرَ وَيُتِمَّ نِعۡمَتَهُۥ عَلَيۡكَ وَيَهۡدِيَكَ صِرَٰطٗا مُّسۡتَقِيمٗا","category":["48 (Al-Fath)","Al-Fath","Surah Al-Fath","Chapter Al-Fath","Fath","Surah Fath","Chapter Fath","Al Fath","Surah Al Fath","Chapter Al Fath","Surah 48","Chapter 48","The Victory","الفتح"],"ayahNumber":4585,"juzNumber":26,"footnotes":"* Laifin Annabi wanda Allah Ya gãfarta, shĩ ne a lõkacin da ya fãra kiran mutãne zuwa ga bauta wa Allah, Shĩ kaɗai, mãsu bauta wa waɗansu abũbuwa sun ga laifinsa a wannan, sun yi ƙiyayya da shi sabõda haka, har suka yi yãƙi da shi, dõmin tsare ibãdarsu, da al'adunsu, har a lõkacin da Allah Ya bã shi rinjãye bayyananne a kansu, suka gãne amfãnin abin da yake kiran su zuwa gare shi na alheri, suka yãfe laifin da suke zato kuma suka so shi son da bã ya ƙãrewa har Tãshin Ƙiyãma. Wannan ni'imar Allah ce babba ga Annabinsa, tsĩra da amincin Allah su tabbata a gare shi. Hanya madaidaiciya, ita ce sharĩ'ar da Allah Ya bã shi, wadda ke jan jama'arsa a kan alheri har ya zuwa Tãshin ƙiyãma, kuma su tãshi a cikin alheri mafi girma, matuƙar dai sun bĩ ta, sun yi aiki da ita gwargwadon yadda ya nũna musu ita.","lang":"ha","version":{"key":"hausa_gummi","direction":"ltr","language_iso_code":"ha","version":"1.2.1","last_update":1609966800,"title":"Hausa language - Abu Bakr Jomy","description":"Translation of the Quran meanings into Hausa by Abu Bakr Mahmoud Jomy. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"liyaghfira laka al-lahu mā taqaddama min dhanbika wamā ta-akhara wayutimma niʿ'matahu ʿalayka wayahdiyaka ṣirāṭan mus'taqīman ","translations":["That may forgive","for you","Allah","what","preceded","of","your sins","and what","will follow","and complete","His favor","upon you","and guide you","(to) a Path","Straight","(2)"],"transliterationArr":["liyaghfira","laka","al-lahu","mā","taqaddama","min","dhanbika","wamā","ta-akhara","wayutimma","niʿ'matahu","ʿalayka","wayahdiyaka","ṣirāṭan","mus'taqīman",null],"verseTiming":[[1,0,1120],[2,1120,1460],[3,1460,2300],[4,2300,2630],[5,2630,3680],[6,3680,4110],[7,4110,4960],[8,4960,6340],[9,6340,6860],[10,6860,8000],[11,8000,9600],[12,9600,10850],[13,10850,11750],[14,11750,12910],[15,12910,13820],[16,13820,16705]]}}