{"name":"10:12","price":"اور جب انسان کو کوئی تکلیف پہنچتی ہے تو ہم کو پکارتا ہے لیٹے بھی، بیٹھے بھی، کھڑے بھی۔ پھر جب ہم اس کی تکلیف اس سے ہٹا دیتے ہیں تو وه ایسا ہوجاتا ہے کہ گویا اس نے اپنی تکلیف کے لیے جو اسے پہنچی تھی کبھی ہمیں پکارا ہی نہ تھا(1) ، ان حد سے گزرنے والوں کے اعمال کو ان کے لیے اسی طرح خوشنما بنادیا گیا ہے۔(2)","arabic":"وَإِذَا مَسَّ ٱلۡإِنسَٰنَ ٱلضُّرُّ دَعَانَا لِجَنۢبِهِۦٓ أَوۡ قَاعِدًا أَوۡ قَآئِمٗا فَلَمَّا كَشَفۡنَا عَنۡهُ ضُرَّهُۥ مَرَّ كَأَن لَّمۡ يَدۡعُنَآ إِلَىٰ ضُرّٖ مَّسَّهُۥۚ كَذَٰلِكَ زُيِّنَ لِلۡمُسۡرِفِينَ مَا كَانُواْ يَعۡمَلُونَ","category":["10 (Yunus)","Yunus","Surah Yunus","Chapter Yunus","Surah 10","Chapter 10","Jonah","يونُس"],"ayahNumber":1376,"juzNumber":11,"footnotes":"(1) یہ انسان کی اس حالت کا تذکرہ ہے جو انسانوں کی اکثریت کا شیوہ ہے۔ بلکہ بہت سے اللہ کے ماننے والے بھی اس کوتاہی کا عام ارتکاب کرتے ہیں کہ مصیبت کے وقت تو خوب اللہ اللہ ہو رہا ہے، دعائیں کی جا رہی ہیں توبہ استغفار کا اہتمام کیا جا رہا ہے۔ لیکن جب اللہ تعالٰی مصیبت کا وہ کڑا وقت نکال دیتا ہے تو پھر بارگاہ الٰہی میں دعا و گڑگڑانے سے غافل ہو جاتے ہیں اور اللہ نے ان کی دعائیں قبول کرکے جس امتحان اور مصیبت سے نجات دی، اس پر اللہ کا شکر ادا کرنے کی بھی توفیق انہیں نصیب نہیں ہوتی۔\n(2) یہ تزئین عمل، بطور آزمائش اور مہلت اللہ تعالٰی کی طرف سے بھی ہوسکتی ہے، وسوسوں کے ذریعے سے شیطان کی طرف سے بھی ہوسکتی ہے اور انسان اس نفس کی طرف سے بھی ہوسکتی ہے، جو انسان کی برائی پر امادہ کرتا ہے،﴿إِنَّ ٱلنَّفۡسَ لَأَمَّارَةُۢ بِٱلسُّوٓءِ﴾ (يوسف: 53). تاہم اس کا شکار ہوتے وہی لوگ ہیں جو حد سے گزر جانے والے ہیں۔ یہاں معنی یہ ہوئے کہ ان کے لیے دعا سے اعراض، شکر الہی سے غفلت اور شہوات و خواہشات کے ساتھ اشتغال کو مزین کردیا گیا ہے۔ (فتح القدیر)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-idhā massa al-insāna al-ḍuru daʿānā lijanbihi aw qāʿidan aw qāiman falammā kashafnā ʿanhu ḍurrahu marra ka-an lam yadʿunā ilā ḍurrin massahu kadhālika zuyyina lil'mus'rifīna mā kānū yaʿmalūna ","translations":["And when","touches","the man","the affliction","he calls Us","(lying) on his side","or","sitting","or","standing","But when","We remove","from him","his affliction","he passes on","as if he","(had) not","called Us","for","(the) affliction","(that) touched him","Thus","(it) is made fair seeming","to the extravagant","what","they used (to)","do","(12)"],"transliterationArr":["wa-idhā","massa","al-insāna","al-ḍuru","daʿānā","lijanbihi","aw","qāʿidan","aw","qāiman","falammā","kashafnā","ʿanhu","ḍurrahu","marra","ka-an","lam","yadʿunā","ilā","ḍurrin","massahu","kadhālika","zuyyina","lil'mus'rifīna","mā","kānū","yaʿmalūna",null],"verseTiming":[[1,0,980],[2,980,1570],[3,1570,3710],[4,3710,4690],[5,4690,5800],[6,5800,9200],[7,9200,9640],[8,9640,10780],[9,10780,11210],[10,11210,14709],[11,14709,16469],[12,16469,17669],[13,17669,18359],[14,18359,19509],[15,19509,20239],[16,20239,20799],[17,20799,21369],[18,21369,23869],[19,23869,24479],[20,24479,25239],[21,25239,27389],[22,27389,28979],[23,28979,29839],[24,29839,31559],[25,31559,31839],[26,31839,33039],[27,33039,36674]]}}