{"name":"10:19","price":"اور تمام لوگ ایک ہی امت کے تھے پھر انہوں نے اختلاف پیداکرلیا(1) اور اگر ایک بات نہ ہوتی جو آپ کے رب کی طرف سے پہلے ٹھہر چکی ہے تو جس چیز میں یہ لوگ اختلاف کررہے ہیں ان کا قطعی فیصلہ ہوچکا ہوتا .(2)","arabic":"وَمَا كَانَ ٱلنَّاسُ إِلَّآ أُمَّةٗ وَٰحِدَةٗ فَٱخۡتَلَفُواْۚ وَلَوۡلَا كَلِمَةٞ سَبَقَتۡ مِن رَّبِّكَ لَقُضِيَ بَيۡنَهُمۡ فِيمَا فِيهِ يَخۡتَلِفُونَ","category":["10 (Yunus)","Yunus","Surah Yunus","Chapter Yunus","Surah 10","Chapter 10","Jonah","يونُس"],"ayahNumber":1383,"juzNumber":11,"footnotes":"(1) یعنی یہ شرک، لوگوں کی اپنی ایجاد ہے ورنہ پہلے پہل اس کا کوئی وجود نہ تھا۔ تمام لوگ ایک ہی دین اور ایک ہی طریقہ پر تھے اور وہ اسلام ہے جس میں توحید کی بنیادی حیثیت حاصل ہے۔ حضرت نوح (عليه السلام) تک لوگ اسی توحید پر قائم رہے پھر ان میں اختلاف ہوگیا اور کچھ لوگوں نے اللہ کے ساتھ دوسروں کو بھی معبود، حاجت روا اور مشکل کشا سمجھنا شروع کر دیا۔\n(2) یعنی اگر اللہ کا فیصلہ نہ ہوتا کہ، تمام حجت سے پہلے کسی کو عذاب نہیں دیتا، اس طرح اس نے مخلوق کے لئے ایک وقت کا تعین نہ کیا ہوتا تو یقینا وہ ان کے مابین اختلافات کا فیصلہ اور مومنوں کو سعادت مند اور کافروں کو عذاب میں مبتلا کر چکا ہوتا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wamā kāna al-nāsu illā ummatan wāḥidatan fa-ikh'talafū walawlā kalimatun sabaqat min rabbika laquḍiya baynahum fīmā fīhi yakhtalifūna ","translations":["And not","was","the mankind","but","a community","one","then they differed","And had (it) not been","a word","(that) preceded","from","your Lord","surely, it (would) have been judged","between them","concerning what","[therein]","they differ","(19)"],"transliterationArr":["wamā","kāna","al-nāsu","illā","ummatan","wāḥidatan","fa-ikh'talafū","walawlā","kalimatun","sabaqat","min","rabbika","laquḍiya","baynahum","fīmā","fīhi","yakhtalifūna",null],"verseTiming":[[1,0,700],[2,700,1390],[3,1390,3300],[4,3300,5400],[5,5400,8080],[6,8080,10240],[7,10240,11840],[8,11840,13530],[9,13530,15110],[10,15110,16380],[11,16380,16580],[12,16580,17740],[13,17740,18600],[14,18600,19720],[15,19720,20620],[16,20620,21420],[17,21420,25185]]}}