{"name":"10:108","price":"آپ کہہ دیجئے کہ اے لوگو! تمہارے پاس حق تمہارے رب کی طرف سے پہنچ چکا ہے(1) ، اس لیے جو شخص راه راست پر آجائے سو وه اپنے واسطے راه راست پر آئے گا (2)اور جو شخص بے راه رہے گا تو اس کا بے راه ہونا اسی پر پڑے گا(3) اور میں تم پر مسلط نہیں کیا گیا.(4)","arabic":"قُلۡ يَٰٓأَيُّهَا ٱلنَّاسُ قَدۡ جَآءَكُمُ ٱلۡحَقُّ مِن رَّبِّكُمۡۖ فَمَنِ ٱهۡتَدَىٰ فَإِنَّمَا يَهۡتَدِي لِنَفۡسِهِۦۖ وَمَن ضَلَّ فَإِنَّمَا يَضِلُّ عَلَيۡهَاۖ وَمَآ أَنَا۠ عَلَيۡكُم بِوَكِيلٖ","category":["10 (Yunus)","Yunus","Surah Yunus","Chapter Yunus","Surah 10","Chapter 10","Jonah","يونُس"],"ayahNumber":1472,"juzNumber":11,"footnotes":"(1) حق سے مراد قرآن اور دین اسلام ہے، جس میں توحید الٰہی اور رسالت محمدیہ پر ایمان نہایت ضروری ہے۔\n(2) یعنی اس کا فائدہ اسی کو ہوگا کہ قیامت والے دن اللہ کے عذاب سے بچ جائے گا۔\n(3) یعنی اس کا نقصان اور وبال اسی پر پڑے گا کہ قیامت کو جہنم کی آگ میں جلے گا۔ گویا کوئی ہدایت کا راستہ اپنائے گا تو، تو اس سے کوئی اللہ کی طاقت میں اضافہ نہیں ہو جائے گا اور اگر کوئی کفر اور ضلالت کو اختیار کرے گا تو اس سے اللہ کی حکومت و طاقت میں کوئی فرق واقع نہیں ہو جائے گا۔ گویا ایمان و ہدایت کی ترغیب اور کفر و ضلالت سے بچنے کی تاکید و ترتیب، دونوں سے مقصد انسانوں ہی کی بھلائی اور خیر خواہی ہے۔ اللہ کی اپنی کوئی غرض نہیں۔\n(4) یعنی یہ ذمہ داری مجھے نہیں سونپی گئی ہے کہ میں ہر صورت میں تمہیں مسلمان بنا کر چھوڑوں بلکہ میں تو صرف بشیر اور نذیر اور مبلغ اور داعی ہوں۔ میرا کام صرف اہل ایمان کو خوشخبری دینا، نافرمانوں کو اللہ کے عذاب اور اس کے مواخذے سے ڈرانا اور اللہ کے پیغام کی دعوت وتبلیغ ہے۔ کوئی اس دعوت کو مان کر ایمان لاتا ہے تو ٹھیک ہے، کوئی نہیں مانتا تو میں اس بات کا مکلف نہیں ہوں کہ اس سے زبردستی منوا کر چھوڑوں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qul yāayyuhā al-nāsu qad jāakumu al-ḥaqu min rabbikum famani ih'tadā fa-innamā yahtadī linafsihi waman ḍalla fa-innamā yaḍillu ʿalayhā wamā anā ʿalaykum biwakīlin ","translations":["Say","O mankind","O mankind","Verily","has come to you","the truth","from","your Lord","So whoever","(is) guided","then only","(he is) guided","for his soul","and whoever","goes astray","then only","he strays","against it","And I am not","And I am not","over you","a guardian","(108)"],"transliterationArr":["qul","yāayyuhā","al-nāsu","qad","jāakumu","al-ḥaqu","min","rabbikum","famani","ih'tadā","fa-innamā","yahtadī","linafsihi","waman","ḍalla","fa-innamā","yaḍillu","ʿalayhā","wamā","anā","ʿalaykum","biwakīlin",null],"verseTiming":[[1,0,370],[2,370,3200],[3,3200,4720],[4,4720,5190],[5,5190,7610],[6,7610,8600],[7,8600,8730],[8,8730,10630],[9,10630,11220],[10,11220,12120],[11,12120,14240],[12,14240,15420],[13,15420,16490],[14,16490,18560],[15,18560,19320],[16,19320,21290],[17,21290,22230],[18,22230,23470],[19,23470,25930],[20,25930,26420],[21,26420,28290],[22,28290,29200],[23,29200,31845]]}}