{"name":"10:20","price":"اور یہ لوگ یوں کہتے ہیں کہ ان پر ان کے رب کی جانب سے کوئی نشانی کیوں نہیں نازل ہوتی(1) ؟ سو آپ فرما دیجئے کہ غیب کی خبر صرف اللہ کو ہے (2)سو تم بھی منتظر رہو میں بھی تمہارے ساتھ منتظر ہوں .","arabic":"وَيَقُولُونَ لَوۡلَآ أُنزِلَ عَلَيۡهِ ءَايَةٞ مِّن رَّبِّهِۦۖ فَقُلۡ إِنَّمَا ٱلۡغَيۡبُ لِلَّهِ فَٱنتَظِرُوٓاْ إِنِّي مَعَكُم مِّنَ ٱلۡمُنتَظِرِينَ","category":["10 (Yunus)","Yunus","Surah Yunus","Chapter Yunus","Surah 10","Chapter 10","Jonah","يونُس"],"ayahNumber":1384,"juzNumber":11,"footnotes":"(1) اس سے مراد کوئی بڑا اور واضح معجزہ، جیسے قوم ثمود کے لئے اونٹنی کا ظہور ہوا ان کے لئے صفا پہاڑی سونے کا یا مکے کے پہاڑوں کو ختم کرکے ان کی جگہ نہریں اور باغات بنانے کا یا اور اس قسم کا کوئی معجزہ صادر کرکے دکھلایا جائے۔\n(2) یعنی اگر اللہ چاہے تو ان کی خواہشات کے مطابق وہ معجزے تو ظاہر کرکے دکھا سکتا ہے۔ لیکن اس کے بعد بھی اگر وہ ایمان نہ لائے تو پھر اللہ کا قانون یہ ہے کہ ایسی قوم کو فوراً وہ ہلاک کر دیتا ہے۔ اس لئے اس بات کا علم صرف اسی کو ہے کہ کسی قوم کے لئے اس کی خواہشات کے مطابق معجزے ظاہر کر دیتا اس کے حق میں بہتر ہے یا نہیں؟ اور اس طرح اس بات کا علم بھی صرف اسی کو ہے کہ ان کے مطلوبہ معجزے اگر ان کو دکھائے گئے تو انہیں، کتنی مہلت دی جائے گی، اسی لئے آگے فرمایا، \" تم بھی انتظار کرو میں بھی تمہارے ساتھ انتظار کرنے والوں میں سے ہوں\"۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wayaqūlūna lawlā unzila ʿalayhi āyatun min rabbihi faqul innamā al-ghaybu lillahi fa-intaẓirū innī maʿakum mina al-muntaẓirīna ","translations":["And they say","Why not","is sent down","to him","a Sign","from","his Lord","So say","Only","the unseen","(is) for Allah","so wait","indeed, I am","with you","among","the ones who wait","(20)"],"transliterationArr":["wayaqūlūna","lawlā","unzila","ʿalayhi","āyatun","min","rabbihi","faqul","innamā","al-ghaybu","lillahi","fa-intaẓirū","innī","maʿakum","mina","al-muntaẓirīna",null],"verseTiming":[[1,0,1560],[2,1560,4190],[3,4190,5920],[4,5920,6940],[5,6940,7890],[6,7890,8840],[7,8840,10560],[8,10560,11230],[9,11230,12660],[10,12660,13520],[11,13520,14660],[12,14660,18010],[13,18010,19510],[14,19510,20420],[15,20420,21580],[16,21580,26415]]}}