{"name":"10:2","price":"کیا ان لوگوں کو اس بات سے تعجب(1) ہوا کہ ہم نے ان میں سے ایک شخص کے پاس وحی بھیج دی کہ سب آدمیوں کو ڈرائیے اور جو ایمان لے آئے ان کو یہ خوشخبری سنائیے کہ ان کے رب کے پاس ان کو پورا اجر ومرتبہ(2) ملے گا۔ کافروں نے کہا کہ یہ شخص تو بلاشبہ صریح جادوگر ہے۔(3)","arabic":"أَكَانَ لِلنَّاسِ عَجَبًا أَنۡ أَوۡحَيۡنَآ إِلَىٰ رَجُلٖ مِّنۡهُمۡ أَنۡ أَنذِرِ ٱلنَّاسَ وَبَشِّرِ ٱلَّذِينَ ءَامَنُوٓاْ أَنَّ لَهُمۡ قَدَمَ صِدۡقٍ عِندَ رَبِّهِمۡۗ قَالَ ٱلۡكَٰفِرُونَ إِنَّ هَٰذَا لَسَٰحِرٞ مُّبِينٌ","category":["10 (Yunus)","Yunus","Surah Yunus","Chapter Yunus","Surah 10","Chapter 10","Jonah","يونُس"],"ayahNumber":1366,"juzNumber":11,"footnotes":"(1) استفہام انکار تعجب کے لئے ہے، جس میں توبیخ کا پہلو بھی شامل ہے یعنی اس بات پر تعجب نہیں ہونا چاہیے کہ اللہ تعالٰی نے انسانوں میں سے ہی ایک آدمی کو وحی و رسالت کے لئے چن لیا، کیونکہ ان کے ہم جنس ہونے کی وجہ سے وہ صحیح معنوں میں انسان کی رہنمائی کر سکتا ہے۔ اگر وہ کسی اور جنس سے ہوتا تو فرشتہ یا جن ہوتا اور وہ دونوں ہی صورتوں میں رسالت کا اصل مقصد فوت ہو جاتا، اس لئے کہ انسان اس سے مانوس ہونے کی بجائے وحشت محسوس کرتا دوسرے، ان کے لئے اس کو دیکھنا بھی ممکن نہ ہوتا اور اگر ہم کسی جن یا فرشتے کا انسانی قالب میں بھیجتے تو پھر وہی اعتراض آتا کہ یہ تو ہماری طرح کا ہی انسان ہے۔ اس لئے ان کے اس تعجب میں کوئی معقولیت نہیں ہے۔\n(2) «قَدَمَ صِدْقٍ» کا مطلب، بلند مرتبہ، اجر حسن اور وہ اعمال صالحہ ہیں جو ایک مومن آگے بھیجتا ہے۔\n(3) کافروں کو جب انکار کے لئے بات نہیں سوجھتی تو یہ کہہ کر چھٹکارہ حاصل کر لیتے ہیں کہ یہ تو جادوگر ہے۔ نعوذ باللہ۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"akāna lilnnāsi ʿajaban an awḥaynā ilā rajulin min'hum an andhiri al-nāsa wabashiri alladhīna āmanū anna lahum qadama ṣid'qin ʿinda rabbihim qāla al-kāfirūna inna hādhā lasāḥirun mubīnun ","translations":["Is it","for the mankind","a wonder","that","We revealed","to","a man","from (among) them","that","Warn","the mankind","and give glad tidings","(to) those who","believe","that","for them","(will be) a respectable position","(will be) a respectable position","near","their Lord","Said","the disbelievers","Indeed","this","(is) surely a magician","obvious","(2)"],"transliterationArr":["akāna","lilnnāsi","ʿajaban","an","awḥaynā","ilā","rajulin","min'hum","an","andhiri","al-nāsa","wabashiri","alladhīna","āmanū","anna","lahum","qadama","ṣid'qin","ʿinda","rabbihim","qāla","al-kāfirūna","inna","hādhā","lasāḥirun","mubīnun",null],"verseTiming":[[1,0,990],[2,990,2990],[3,2990,3920],[4,3920,4330],[5,4330,5920],[6,5920,7730],[7,7730,8430],[8,8430,10370],[9,10370,10520],[10,10520,12430],[11,12430,14270],[12,14270,15370],[13,15370,16410],[14,16410,17850],[15,17850,19120],[16,19120,20730],[17,20730,22760],[18,22760,23930],[19,23930,25000],[20,25000,27470],[21,27470,28870],[22,28870,29470],[23,29470,30100],[24,30100,30980],[25,30980,32340],[26,32340,34110],[27,34110,34730],[28,34730,36410],[29,36410,38000],[30,38000,39030],[31,39030,40230],[32,40230,44695]]}}