{"name":"10:22","price":"وه اللہ ایسا ہے کہ تم کو خشکی اور دریا میں چلاتا ہے(1) ، یہاں تک کہ جب تم کشتی میں ہوتے ہو اور وه کشتیاں لوگوں کو موافق ہوا کے ذریعہ سے لے کر چلتی ہیں اور وه لوگ ان سے خوش ہوتے ہیں ان پر ایک جھونکا سخت ہوا کا آتا ہے اور ہر طرف سے ان پر موجیں اٹھتی چلی آتی ہیں اور وه سمجھتے ہیں کہ (برے) آ گھرے(2)، (اس وقت) سب خالص اعتقاد کرکے اللہ ہی کو پکارتے ہیں (3)کہ اگر تو ہم کو اس سے بچالے تو ہم ضرور شکر گزار بن جائیں گے.","arabic":"هُوَ ٱلَّذِي يُسَيِّرُكُمۡ فِي ٱلۡبَرِّ وَٱلۡبَحۡرِۖ حَتَّىٰٓ إِذَا كُنتُمۡ فِي ٱلۡفُلۡكِ وَجَرَيۡنَ بِهِم بِرِيحٖ طَيِّبَةٖ وَفَرِحُواْ بِهَا جَآءَتۡهَا رِيحٌ عَاصِفٞ وَجَآءَهُمُ ٱلۡمَوۡجُ مِن كُلِّ مَكَانٖ وَظَنُّوٓاْ أَنَّهُمۡ أُحِيطَ بِهِمۡ دَعَوُاْ ٱللَّهَ مُخۡلِصِينَ لَهُ ٱلدِّينَ لَئِنۡ أَنجَيۡتَنَا مِنۡ هَٰذِهِۦ لَنَكُونَنَّ مِنَ ٱلشَّٰكِرِينَ","category":["10 (Yunus)","Yunus","Surah Yunus","Chapter Yunus","Surah 10","Chapter 10","Jonah","يونُس"],"ayahNumber":1386,"juzNumber":11,"footnotes":"(1) يُسَيِّرُكُمْ وہ تمہیں چلاتا یا چلنے پھرنے اور سیر کرنے کی توفیق دیتا ہے \" خشکی میں \" یعنی اس نے تمہیں قدم عطا کئے جن سے تم چلتے ہو، سواریاں مہیا کیں، جن پر سوار ہو کر دور دراز کے سفر کرتے ہو \" اور سمندر میں \" یعنی اللہ نے تمہیں کشتیاں اور جہاز بنانے کی عقل اور سمجھ دی، تم نے وہ بنائیں اور ان کے ذریعے سے سمندر کا سفر کرتے ہو۔\n(2) أُحِيطَ بِهِمْ کا مطلب ہے، جس طرح دشمن کسی قوم یا شہر کا احاطہ یعنی محاصرہ کر لیتا ہے اور وہ دشمن کے رحم و کرم پر ہوتے ہیں، اسی طرح وہ جب سخت ہواؤں کے تھپیڑوں اور تلاطم خیز موجوں میں گھر جاتے ہیں اور موت ان کو سامنے نظر آتی ہے۔\n(3) یعنی پھر وہ دعا میں غیر اللہ کی ملاوٹ نہیں کرتے جس طرح عام حالات میں کرتے ہیں۔ عام حالات میں تو کہتے ہیں کہ یہ بزرگ بھی اللہ کے بندے ہیں، انہیں بھی اللہ نے اختیارات سے نواز رکھا ہے اور انہی کے ذریعے سے ہم اللہ کا قرب تلاش کرتے ہیں۔ لیکن جب اس طرح شدائد میں گھر جاتے ہیں تو یہ سارے شیطانی فلسفے بھول جاتے ہیں اور صرف اللہ یاد رہ جاتا ہے اور پھر صرف اسی کو پکارتے ہیں۔ اس سے ایک بات تو یہ معلوم ہوئی کہ انسان کی فطرت میں اللہ واحد کی طرف رجوع کا جذبہ ودیعت کیا گیا ہے۔ انسان ماحول سے متاثر ہو کر اس جذبے یا فطرت کو دبا دیتا ہے لیکن مصیبت میں یہ جذبہ ابھر آتا ہے اور یہ فطرت عود کر آتی ہے۔ جس سے معلوم ہوا کہ توحید، فطرت انسانی کی آواز اور اصل چیز ہے، جس سے انسان کو انحراف نہیں کرنا چاہیے۔ کیونکہ اس سے انحراف فطرت سے انحراف جو سراسر گمراہی ہے، دوسری بات یہ معلوم ہوئی کہ مشرکین، جب اس طرح مصائب میں گھر جاتے تو وہ اپنے خود ساختہ معبودوں کے بجائے، صرف ایک اللہ کو پکارتے تھے چنانچہ حضرت عکرمہ بن ابی جہل (رضي الله عنه) کے بارے میں آتا ہے کہ جب مکہ فتح کیا تو یہ وہاں سے فرار ہوگئے۔ باہر کسی جگہ جانے کے لیے کشتی میں سوار ہوئے، تو کشتی طوفانی ہواؤں کی زد میں آگئی۔ جس پر ملاح نے کشتی میں سوار لوگوں سے کہا کہ آج اللہ واحد سے دعا کرو، تمہیں اس طوفان سے اس کے سوا کوئی نجات دینے والا نہیں ہے۔ حضرت عکرمہ (رضي الله عنه) کہتے ہیں، میں نے سوچا اگر سمندر میں نجات دینے والا صرف ایک اللہ ہے تو خشکی میں بھی یقینا نجات دینے والا وہی ہے۔ اور یہی بات محمد کہتے ہیں۔ چنانچہ انہوں فیصلہ کر لیا اگر یہاں سے میں زندہ بچ کر نکل گیا تو مکہ واپس جا کر اسلام قبول کرلوں گا۔ چنانچہ یہ نبی (صلى الله عليه وسلم) کی خدمت میں حاضر ہوئے اور مسلمان ہوگئے۔ (رضي الله عنه) (سنن نسائي، أبو داود- نمبر 2683۔ وذكر الألباني في الصحيحة نمبر1723) لیکن افسوس! امت محمدیہ کے عوام اس طرح شرک میں پھنسے ہوئے ہیں کہ شدائد و آلام میں بھی وہ اللہ کی طرف رجوع کرنے کے بجائے فوت شدہ بزرگوں کو ہی مشکل کشا سمجھتے اور انہی کو مدد کے لیے پکارتے ہیں۔ فَإِنَّا للهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ آہ! فَلْيَبْكِ عَلَى الإسْلامِ مَنْ كَانَ بَاكِيًا","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"huwa alladhī yusayyirukum fī al-bari wal-baḥri ḥattā idhā kuntum fī al-ful'ki wajarayna bihim birīḥin ṭayyibatin wafariḥū bihā jāathā rīḥun ʿāṣifun wajāahumu al-mawju min kulli makānin waẓannū annahum uḥīṭa bihim daʿawū al-laha mukh'liṣīna lahu al-dīna la-in anjaytanā min hādhihi lanakūnanna mina al-shākirīna ","translations":["He","(is) the One Who","enables you to travel","in","the land","and the sea","until","when","you are","in","the ships","and they sail","with them","with a wind","good","and they rejoice","therein","comes to it","a wind","stormy","and comes to them","the waves","from","every","place","and they assume","that they","are surrounded","with them","They call","Allah","sincerely","to Him","(in) the religion","(saying), \"If","You save us","from","this","surely we will be","among","the thankful","(22)"],"transliterationArr":["huwa","alladhī","yusayyirukum","fī","al-bari","wal-baḥri","ḥattā","idhā","kuntum","fī","al-ful'ki","wajarayna","bihim","birīḥin","ṭayyibatin","wafariḥū","bihā","jāathā","rīḥun","ʿāṣifun","wajāahumu","al-mawju","min","kulli","makānin","waẓannū","annahum","uḥīṭa","bihim","daʿawū","al-laha","mukh'liṣīna","lahu","al-dīna","la-in","anjaytanā","min","hādhihi","lanakūnanna","mina","al-shākirīna",null],"verseTiming":[[1,0,420],[2,420,1420],[3,1420,2980],[4,2980,3250],[5,3250,4120],[6,4120,5060],[7,5060,6370],[8,6370,8549],[9,8549,10139],[10,10139,10409],[11,10409,11289],[12,11289,12389],[13,12389,13749],[14,13749,14759],[15,14759,16289],[16,16289,18129],[17,18129,20279],[18,20279,21299],[19,21299,22019],[20,22019,24949],[21,24949,25669],[22,25669,26909],[23,26909,31139],[24,31139,31979],[25,31979,33889],[26,33889,36919],[27,36919,37879],[28,37879,38839],[29,38839,39479],[30,39479,40629],[31,40629,43359],[32,43359,44699],[33,44699,47649],[34,47649,49549],[35,49549,50519],[36,50519,51169],[37,51169,51739],[38,51739,52759],[39,52759,54019],[40,54019,54509],[41,54509,58419],[42,58419,59179],[43,59179,60139],[44,60139,61539],[45,61539,61899],[46,61899,62909],[47,62909,63569],[48,63569,66219],[49,66219,66659],[50,66659,67809],[51,67809,70179],[52,70179,70529],[53,70529,74344]]}}