{"name":"10:29","price":"سو ہمارے تمہارے درمیان اللہ کافی ہے گواه کے طور پر، کہ ہم کو تمہاری عبادت کی خبر بھی نہ تھی.(1)","arabic":"فَكَفَىٰ بِٱللَّهِ شَهِيدَۢا بَيۡنَنَا وَبَيۡنَكُمۡ إِن كُنَّا عَنۡ عِبَادَتِكُمۡ لَغَٰفِلِينَ","category":["10 (Yunus)","Yunus","Surah Yunus","Chapter Yunus","Surah 10","Chapter 10","Jonah","يونُس"],"ayahNumber":1393,"juzNumber":11,"footnotes":"(1) یہ انکار کی وجہ ہے کہ ہمیں تو کچھ پتہ ہی نہیں، تم کیا کچھ کرتے تھے اور ہم جھوٹ بول رہے ہوں تو ہمارے درمیان اللہ تعالٰی گواہ ہے اور وہ کافی ہے، اس کی گواہی کے بعد کسی اور ثبوت کی ضرورت ہی نہیں رہ جاتی، یہ آیت اس بات پر نص صریح ہے کہ مشرکین جن کو مدد کے لئے پکارتے تھے،وہ محض پتھر کی مورتیاں نہیں تھیں (جس طرح کہ آج کل کے قبر پرست اپنی قبر پرستی کو جائز ثابت کرنے کے لئے کہتے ہیں کہ اس قسم کی آیات تو بتوں کے لئے ہیں) بلکہ وہ عقل و شعور رکھنے والے افراد ہی ہوتے تھے جن کے مرنے کے بعد لوگ ان کے مجسمے اور بت بنا کر پوجنا شروع کر دیتے تھے۔ جس طرح کہ حضرت نوح (عليه السلام) کی قوم کے طرز عمل سے ثابت ہے جس کی تصریح صحیح بخاری میں موجود ہے۔ دوسرا یہ بھی معلوم ہوا کہ مرنے کے بعد، انسان کتنا بھی نیک ہو، حتیٰ کہ نبی و رسول ہو۔ اسے دنیا کے حالات کا علم نہیں ہوتا، اس کے ماننے والے اور عقیدت مند اسے مدد کے لئے پکارتے ہیں اس کے نام کی نذر نیاز دیتے ہیں، اس کی قبر پر میلے ٹھیلے کا انتظام کرتے ہیں، لیکن وہ بےخبر ہوتا ہے اور ان تمام چیزوں کا انکار ایسے لوگ قیامت والے دن کریں گے۔ یہی بات سورۃ احقاف آیت 5-6 میں بھی بیان کی گئی ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"fakafā bil-lahi shahīdan baynanā wabaynakum in kunnā ʿan ʿibādatikum laghāfilīna ","translations":["So sufficient","(is) Allah","(as) a witness","between us","and between you","that","we were","of","your worship","certainly unaware","(29)"],"transliterationArr":["fakafā","bil-lahi","shahīdan","baynanā","wabaynakum","in","kunnā","ʿan","ʿibādatikum","laghāfilīna",null],"verseTiming":[[1,0,1030],[2,1030,2170],[3,2170,4260],[4,4260,5410],[5,5410,6820],[6,6820,8110],[7,8110,9930],[8,9930,10370],[9,10370,12010],[10,12010,16015]]}}