{"name":"10:28","price":"اور وه دن بھی قابل ذکر ہے جس روز ہم ان سب کو جمع کریں(1) گے پھر مشرکین سے کہیں گے کہ تم اور تمہارے شریک اپنی جگہ ٹھہرو(2) پھر ہم ان کے آپس میں پھوٹ ڈال دیں گے (3)اور ان کے وه شرکا کہیں گے کہ تم ہماری عبادت نہیں کرتے تھے.","arabic":"وَيَوۡمَ نَحۡشُرُهُمۡ جَمِيعٗا ثُمَّ نَقُولُ لِلَّذِينَ أَشۡرَكُواْ مَكَانَكُمۡ أَنتُمۡ وَشُرَكَآؤُكُمۡۚ فَزَيَّلۡنَا بَيۡنَهُمۡۖ وَقَالَ شُرَكَآؤُهُم مَّا كُنتُمۡ إِيَّانَا تَعۡبُدُونَ","category":["10 (Yunus)","Yunus","Surah Yunus","Chapter Yunus","Surah 10","Chapter 10","Jonah","يونُس"],"ayahNumber":1392,"juzNumber":11,"footnotes":"(1) جَمِيعًا سے مراد، ازل سے ابد تک کے تمام اہل زمین انسان اور جنات ہیں، سب کو اللہ تعالٰی جمع فرمائے گا جس طرح کہ دوسرے مقام پر فرمایا «وَحَشَرْنَاهُمْ فَلَمْ نُغَادِرْ مِنْهُمْ أَحَدًا» (الکہف:47) ”ہم ان سب کو اکھٹا کریں گے، کسی ایک کو بھی نہ چھوڑیں گے“۔\n(2) ان کے مقابلے میں اہل ایمان کو دوسری طرف کر دیا جائے گا یعنی اہل ایمان اور اہل کفر و شرک کو الگ الگ ایک دوسرے سے ممتاز کر دیا جائے گا جیسے فرمایا «وَامْتَازُوا الْيَوْمَ اَيُّهَا الْمُجْرِمُوْنَ» (یس:59) «يَوْمَئِذٍ يَصَّدَّعُونَ» (الروم:43) «اس دن لوگ گروہوں میں بٹ جائیں گے ' یعنی دو گروہوں میں۔ أَيْ: يَصِيرُونَ صِدْعَيْنِ (ابن کثیر)\n(3) یعنی دنیا میں ان کے درمیان آپس میں جو خصوصی تعلق تھا وہ ختم کر دیا جائے گا اور ایک دوسرے کے دشمن بن جائیں گے اور ان کے معبود اس بات کا ہی انکار کریں گے کہ یہ لوگ ان کی عبادت کرتے تھے، ان کو مدد کے لئے پکارتے تھے، ان کے نام کی نذر نیاز دیتے تھے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wayawma naḥshuruhum jamīʿan thumma naqūlu lilladhīna ashrakū makānakum antum washurakāukum fazayyalnā baynahum waqāla shurakāuhum mā kuntum iyyānā taʿbudūna ","translations":["And (the) Day","We will gather them","all together","then","We will say","to those who","associate partners (with Allah)","(Remain in) your place","you","and your partners","Then We will separate","[between] them","and (will) say","their partners","Not","you used (to)","worship us","worship us","(28)"],"transliterationArr":["wayawma","naḥshuruhum","jamīʿan","thumma","naqūlu","lilladhīna","ashrakū","makānakum","antum","washurakāukum","fazayyalnā","baynahum","waqāla","shurakāuhum","mā","kuntum","iyyānā","taʿbudūna",null],"verseTiming":[[1,0,930],[2,930,2220],[3,2220,4160],[4,4160,5780],[5,5780,6710],[6,6710,8000],[7,8000,9140],[8,9140,10570],[9,10570,12270],[10,12270,16600],[11,16600,18150],[12,18150,19770],[13,19770,20600],[14,20600,23780],[15,23780,25090],[16,25090,26840],[17,26840,28170],[18,28170,31845]]}}