{"name":"10:38","price":"کیا یہ لوگ یوں کہتے ہیں کہ آپ نے اس کو گھڑ لیا ہے؟ آپ کہہ دیجئے کہ تو پھر تم اس کے مثل ایک ہی سورت لاؤ اور جن جن غیراللہ کو بلا سکو، بلالو اگر تم سچے ہو.(1)","arabic":"أَمۡ يَقُولُونَ ٱفۡتَرَىٰهُۖ قُلۡ فَأۡتُواْ بِسُورَةٖ مِّثۡلِهِۦ وَٱدۡعُواْ مَنِ ٱسۡتَطَعۡتُم مِّن دُونِ ٱللَّهِ إِن كُنتُمۡ صَٰدِقِينَ","category":["10 (Yunus)","Yunus","Surah Yunus","Chapter Yunus","Surah 10","Chapter 10","Jonah","يونُس"],"ayahNumber":1402,"juzNumber":11,"footnotes":"(1) ان تمام حقائق اور دلائل کے بعد بھی، اگر تمہارا دعوٰی یہ ہے کہ یہ قرآن محمد(صلى الله عليه وسلم) کا گھڑا ہوا ہے تو بھی تمہاری طرح ایک انسان ہے، تمہاری زبان بھی اسی طرح عربی ہے وہ تو ایک ہے، تم اگر اپنے دعوے میں سچے ہو تو تم دنیا بھر کے ادیبوں، فصحاوبلغا کو اور اہل علم و اہل قلم کو جمع کرلو اور اس قرآن کی ایک چھوٹی سے چھوٹی سورت کے مثل بنا کر پیش کردو۔ قرآن مجید کا یہ چلینج آج تک باقی ہے، اس کا جواب نہیں ملا۔ جس کے صاف معنی یہ ہیں کہ یہ قرآن۔ کسی انسانی کاوش کا نتیجہ نہیں، بلکہ فی الواقع کلام الٰہی ہے اور حضرت محمد (صلى الله عليه وسلم)پر اترا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"am yaqūlūna if'tarāhu qul fatū bisūratin mith'lihi wa-id'ʿū mani is'taṭaʿtum min dūni al-lahi in kuntum ṣādiqīna ","translations":["Or","(do) they say","He has invented it","Say","Then bring","a Surah","like it","and call","whoever","you can","besides Allah","besides Allah","besides Allah","if","you are","truthful","(38)"],"transliterationArr":["am","yaqūlūna","if'tarāhu","qul","fatū","bisūratin","mith'lihi","wa-id'ʿū","mani","is'taṭaʿtum","min","dūni","al-lahi","in","kuntum","ṣādiqīna",null],"verseTiming":[[1,0,360],[2,360,1730],[3,1730,4750],[4,4750,5620],[5,5620,6460],[6,6460,7840],[7,7840,9450],[8,9450,10280],[9,10280,10750],[10,10750,12040],[11,12040,13470],[12,13470,14330],[13,14330,15300],[14,15300,16550],[15,16550,18010],[16,18010,21255]]}}