{"name":"10:49","price":"آپ فرما دیجئے کہ میں اپنی ذات کے لیے تو کسی نفع کا اور کسی ضرر کا اختیار رکھتا ہی نہیں مگر جتنا اللہ کو منظور ہو۔ ہر امت کے لیے ایک معین وقت ہے جب ان کا وه معین وقت آپہنچتا ہے تو ایک گھڑی نہ پیچھے ہٹ سکتے ہیں اور نہ آگے سرک سکتے ہیں.(1)","arabic":"قُل لَّآ أَمۡلِكُ لِنَفۡسِي ضَرّٗا وَلَا نَفۡعًا إِلَّا مَا شَآءَ ٱللَّهُۗ لِكُلِّ أُمَّةٍ أَجَلٌۚ إِذَا جَآءَ أَجَلُهُمۡ فَلَا يَسۡتَـٔۡخِرُونَ سَاعَةٗ وَلَا يَسۡتَقۡدِمُونَ","category":["10 (Yunus)","Yunus","Surah Yunus","Chapter Yunus","Surah 10","Chapter 10","Jonah","يونُس"],"ayahNumber":1413,"juzNumber":11,"footnotes":"(1) یہ مشرکین کے عذاب الٰہی مانگنے پر کہا جا رہا ہے کہ میں تو اپنے نفس کے لئے بھی نفع نقصان کا اختیار نہیں رکھتا۔ چہ جائیکہ کہ میں کسی دوسرے کو نقصان یا نفع پہنچا سکوں، ہاں سارا اختیار اللہ کے ہاتھ میں ہے اور وہ اپنی مشیت کے مطابق ہی کسی کو نفع یا نقصان پہنچانے کا فیصلہ کرتا ہے۔ علاوہ ازیں اللہ نے ہر امت کے لئے ایک وقت مقرر کیا ہوا ہے، اس وقت تک مہلت دیتا ہے۔ لیکن جب وہ وقت آجاتا ہے تو پھر وہ ایک گھڑی پیچھے ہو سکتے ہیں نہ آگے سرک سکتے ہیں۔\nتنبیہ: یہاں یہ بات نہایت اہم ہے کہ جب افضل الخلائق سید الرسل حضرت محمد (صلى الله عليه وسلم) تک کسی کو نفع نقصان پہنچانے پر قادر نہیں، تو آپ کے بعد انسانوں میں اور کون سی ہستی ایسی ہوسکتی ہے جو کسی کی حاجت برآری اور مشکل کشائی پر قادر ہو؟ اسی طرح خود اللہ کے پیغمبر سے مدد مانگنا، ان سے فریاد کرنا ”یا رسول اللہ مدد“ اور ”أغثني يا رسول الله“ وغیرہ الفاظ سے استغاثہ واستعانت کرنا، کسی طرح بھی جائز نہیں ہے کیونکہ یہ قرآن کی اس آیت اور اس قسم کی دیگر واضح تعلیمات کے خلاف ہے بلکہ یہ شرک کے ذیل میں آتا ہے۔ فَنَعُوذُ بِاللهِ مِنْ هَذَا","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qul lā amliku linafsī ḍarran walā nafʿan illā mā shāa al-lahu likulli ummatin ajalun idhā jāa ajaluhum falā yastakhirūna sāʿatan walā yastaqdimūna ","translations":["Say","Not","I have power","for myself","(for) any harm","and not","(for) any profit","except","what","Allah wills","Allah wills","For every","nation","(is) a term","When","comes","their term","then not","they remain behind","an hour","and not","they can precede (it)","(49)"],"transliterationArr":["qul","lā","amliku","linafsī","ḍarran","walā","nafʿan","illā","mā","shāa","al-lahu","likulli","ummatin","ajalun","idhā","jāa","ajaluhum","falā","yastakhirūna","sāʿatan","walā","yastaqdimūna",null],"verseTiming":[[1,0,350],[2,350,2750],[3,2750,3660],[4,3660,4690],[5,4690,5430],[6,5430,6950],[7,6950,7850],[8,7850,8740],[9,8740,9110],[10,9110,11510],[11,11510,14990],[12,14990,15850],[13,15850,17830],[14,17830,18570],[15,18570,19690],[16,19690,22360],[17,22360,23350],[18,23350,24080],[19,24080,25740],[20,25740,26820],[21,26820,28530],[22,28530,32655]]}}