{"name":"10:47","price":"اور ہر امت کے لیے ایک رسول ہے، سو جب ان کا وه رسول آچکتا ہے ان کا فیصلہ انصاف کے ساتھ کیا جاتا ہے(1) ، اور ان پر ﻇلم نہیں کیا جاتا.","arabic":"وَلِكُلِّ أُمَّةٖ رَّسُولٞۖ فَإِذَا جَآءَ رَسُولُهُمۡ قُضِيَ بَيۡنَهُم بِٱلۡقِسۡطِ وَهُمۡ لَا يُظۡلَمُونَ","category":["10 (Yunus)","Yunus","Surah Yunus","Chapter Yunus","Surah 10","Chapter 10","Jonah","يونُس"],"ayahNumber":1411,"juzNumber":11,"footnotes":"(1) اس کا ایک مطلب تو یہ ہے کہ ہر امت میں ہم رسول بھیجتے رہے۔ اور جب رسول اپنا فریضہ تبلیغ ادا کرچکتا تو پھر ان کے درمیان انصاف کے ساتھ فیصلہ کر دیتے۔ یعنی پیغمبر اور اس پر ایمان لانے والوں کو بچا لیتے اور دوسروں کو ہلاک کر دیتے۔ کیونکہ «وَمَا كُنَّا مُعَذِّبِينَ حَتَّى نَبْعَثَ رَسُولا» ( بني إسرائيل:15) «اور ہماری عادت نہیں کہ رسول بھیجنے سے پہلے ہی عذاب دینے لگیں»۔ اور اس فیصلے میں ان پر کوئی ظلم نہیں ہوتا تھا۔ کیونکہ ظلم تو تب ہوتا جب بغیر گناہ کے ان پر عذاب بھیج دیا جاتا یا بغیر حجت تمام کیے، ان کا مواخذہ کرلیا جاتا۔ (فتح القدیر) اور دوسرا مفہوم اس کا یہ بیان کیا گیا ہے کہ اس کا تعلق قیامت سے ہے یعنی قیامت والے دن ہر امت جب اللہ کی بارگاہ میں پیش ہوگی، تو اس امت میں بھیجا گیا رسول بھی ساتھ ہوگا۔ سب کے اعمال نامے بھی ہوں گے اور فرشتے بھی بطور گواہ پیش ہوں گے۔ اور یوں ہر امت اور اس کے رسول کے درمیان انصاف کے ساتھ فیصلہ کیا جائے گا۔ اور حدیث میں آتا ہے کہ امت محمدیہ کا فیصلہ سب سے پہلے کیا جائے گا۔ جیسا کہ فرمایا ”ہم اگرچہ سب کے بعد آنے والے ہیں لیکن قیامت کو سب سے آگے ہوں گے“ اور تمام مخلوقات سے پہلے ہمارا فیصلہ کیا جائے گا۔ (صحيح مسلم- كتاب الجمعة، باب هداية هذه الأمة ليوم الجمعة ) ۔ (تفسیر ابن کثیر)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walikulli ummatin rasūlun fa-idhā jāa rasūluhum quḍiya baynahum bil-qis'ṭi wahum lā yuẓ'lamūna ","translations":["And for every","nation","(is) a Messenger","So when","comes","their Messenger","it will be judged","between them","in justice","and they","(will) not","be wronged","(47)"],"transliterationArr":["walikulli","ummatin","rasūlun","fa-idhā","jāa","rasūluhum","quḍiya","baynahum","bil-qis'ṭi","wahum","lā","yuẓ'lamūna",null],"verseTiming":[[1,0,1170],[2,1170,2810],[3,2810,6139],[4,6139,7509],[5,7509,9669],[6,9669,10959],[7,10959,11599],[8,11599,13279],[9,13279,14479],[10,14479,15069],[11,15069,15529],[12,15529,19034]]}}