{"name":"10:46","price":"اور جس کا ان سے ہم وعده کر رہے ہیں اس میں سے کچھ تھوڑا سا اگر ہم آپ کو دکھلا دیں یا (ان کے ﻇہور سے پہلے) ہم آپ کو وفات دے دیں، سو ہمارے پاس تو ان کو آنا ہی ہے۔ پھر اللہ ان کے سب افعال پر گواه ہے.(1)","arabic":"وَإِمَّا نُرِيَنَّكَ بَعۡضَ ٱلَّذِي نَعِدُهُمۡ أَوۡ نَتَوَفَّيَنَّكَ فَإِلَيۡنَا مَرۡجِعُهُمۡ ثُمَّ ٱللَّهُ شَهِيدٌ عَلَىٰ مَا يَفۡعَلُونَ","category":["10 (Yunus)","Yunus","Surah Yunus","Chapter Yunus","Surah 10","Chapter 10","Jonah","يونُس"],"ayahNumber":1410,"juzNumber":11,"footnotes":"(1) اس آیت میں اللہ تعالٰی فرما رہا ہے ہم ان کفار کے بارے میں جو وعدہ کر رہے ہیں اگر انہوں نے کفر و شرک پر اصرار جاری رکھا تو ان پر بھی عذاب الٰہی آسکتا ہے، جس طرح پچھلی قوموں پر آیا، ان میں سے بعض اگر ہم آپ کی زندگی میں بھیج دیں تو یہ بھی ممکن ہے، جس سے آپ کی آنکھیں ٹھنڈی ہونگی۔ لیکن اگر آپ اس سے پہلے ہی دنیا سے اٹھا لئے گئے، تب بھی کوئی بات نہیں، ان کافروں کو بالآخر ہمارے پاس ہی آنا ہے۔ ان کے سارے اعمال و احوال کی ہمیں اطلاع ہے، وہاں یہ ہمارے عذاب سے کس طرح بچ سکیں گے، قیامت کے وقوع کا مقصد ہی یہ ہے کہ وہاں اطاعت گزاروں کو ان کی اطاعت کا صلہ اور نافرمانوں کو ان کی نافرمانی کی سزا دی جائے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-immā nuriyannaka baʿḍa alladhī naʿiduhum aw natawaffayannaka fa-ilaynā marjiʿuhum thumma al-lahu shahīdun ʿalā mā yafʿalūna ","translations":["And whether","We show you","some","(of) that which","We promised them","or","We cause you to die","then to Us","(is) their return","then","Allah","(is) a Witness","over","what","they do","(46)"],"transliterationArr":["wa-immā","nuriyannaka","baʿḍa","alladhī","naʿiduhum","aw","natawaffayannaka","fa-ilaynā","marjiʿuhum","thumma","al-lahu","shahīdun","ʿalā","mā","yafʿalūna",null],"verseTiming":[[1,0,2100],[2,2100,4260],[3,4260,4850],[4,4850,5780],[5,5780,6860],[6,6860,7300],[7,7300,9880],[8,9880,11210],[9,11210,13090],[10,13090,14330],[11,14330,15670],[12,15670,16830],[13,16830,17820],[14,17820,18740],[15,18740,19640],[16,19640,20140],[17,20140,23495]]}}