{"name":"10:5","price":"وه اللہ تعالیٰ ایسا ہے جس نے آفتاب کو چمکتا ہوا بنایا اور چاند کو نورانی بنایا(1) اور اس کے لیے منزلیں مقرر کیں تاکہ تم برسوں کی گنتی اور حساب معلوم کرلیا کرو(2)۔ اللہ تعالیٰ نے یہ چیزیں بے فائده نہیں پیدا کیں۔ وه یہ دﻻئل ان کو صاف صاف بتلا رہا ہے جو دانش رکھتے ہیں۔","arabic":"هُوَ ٱلَّذِي جَعَلَ ٱلشَّمۡسَ ضِيَآءٗ وَٱلۡقَمَرَ نُورٗا وَقَدَّرَهُۥ مَنَازِلَ لِتَعۡلَمُواْ عَدَدَ ٱلسِّنِينَ وَٱلۡحِسَابَۚ مَا خَلَقَ ٱللَّهُ ذَٰلِكَ إِلَّا بِٱلۡحَقِّۚ يُفَصِّلُ ٱلۡأٓيَٰتِ لِقَوۡمٖ يَعۡلَمُونَ","category":["10 (Yunus)","Yunus","Surah Yunus","Chapter Yunus","Surah 10","Chapter 10","Jonah","يونُس"],"ayahNumber":1369,"juzNumber":11,"footnotes":"(1) ضیاء ضوء کے ہم معنی ہے۔ مضاف یہاں محذوف ہے ذات ضیاء والقمر ذا نور، سورج کو چمکنے والا اور چاند کو نور والا بنایا۔ یا پھر انہیں مبالغے پر محمول کیا جائے گویا کہ یہ بذات خود ضیا اور نور ہیں۔ آسمان و زمین کی تخلیق اور ان کی تدبیر کے ذکر کے بعد بطور مثال کچھ اور چیزوں کا ذکر کیا جا رہا ہے جن کا تعلق تدبیر کائنات سے ہے جس میں سورج اور چاند کو بنیادی اہمیت حاصل ہے۔ سورج کی حرارت اور تپش اور اس کی روشنی، کس قدر ناگزیر ہے اس سے ہر با شعور آدمی واقف ہے۔ اسی طرح چاند کی نورانیت کا جو لطف اور اس کے فوائد ہیں، وہ بھی محتاج بیان نہیں۔ حکماء کا خیال ہے کہ سورج کی روشنی بالذات ہے اور چاند کی نورانیت ہے جو سورج کی روشنی سے مستفاد ہے (فتح القدیر) واللہ اعلم بالصواب۔\n(2) یعنی ہم نے چاند کی چال کی منزلیں مقرر کردی ہیں ان منزلوں سے مراد مسافت ہے جو وہ ایک رات اور ایک دن میں اپنی مخصوص حرکت یا چال کے ساتھ طے کرتا ہے یہ 28 منزلیں ہیں۔ ہر رات کو ایک منزل پر پہنچتا ہے جس میں کبھی خطا نہیں ہوتی۔ پہلی منزل میں وہ چھوٹا اور باریک نظر آتا ہے، پھر بتدریج بڑا ہوتا جاتا ہے حتٰی کے چودھویں شب یا چودھویں منزل پر وہ مکمل (بدر کامل) ہو جاتا ہے اس کے بعد پھر وہ سکڑنا اور باریک ہونا شروع ہو جاتا ہے حتٰی کے آخر میں ایک یا دو راتیں چھپا رہتا ہے۔ اور پھر ہلال بن کر طلوع ہو جاتا ہے۔ اس کا فائدہ یہ بیان کیا گیا ہے کہ تم برسوں کی گنتی اور حساب معلوم کر سکو۔ یعنی چاند کی ان منازل اور رفتار سے ہی مہینے اور سال بنتے ہیں۔ جن سے تمہیں ہرچیز کا حساب کرنے میں آسانی رہتی ہے۔ یعنی سال 12 مہینے کا، مہینہ 29،30 دن کا ایک دن 24 گھنٹے یعنی رات اور دن کا۔ جو ایام استوا میں 12، 12 گھنٹے اور سردی گرمی میں کم و بیش ہوتے ہیں، علاوہ ازیں دینوی منافع اور کاروبار ہی ان منازل قمر سے وابستہ نہیں۔ دینی منافع بھی حاصل ہوتے ہیں۔ اس طلوع بلال سے حج، صیام رمضان، اشہر حرم اور دیگر عبادات کی تعین ہوتی ہے جن کا اہتمام ایک مومن کرتا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"huwa alladhī jaʿala al-shamsa ḍiyāan wal-qamara nūran waqaddarahu manāzila litaʿlamū ʿadada al-sinīna wal-ḥisāba mā khalaqa al-lahu dhālika illā bil-ḥaqi yufaṣṣilu al-āyāti liqawmin yaʿlamūna ","translations":["He","(is) the One Who","made","the sun","a shining light","and the moon","a reflected light","and determined for it","phases","that you may know","(the) number","(of) the years","and the count (of time)","Not","created","Allah","that","except","in truth","He explains","the Signs","for a people","(who) know","(5)"],"transliterationArr":["huwa","alladhī","jaʿala","al-shamsa","ḍiyāan","wal-qamara","nūran","waqaddarahu","manāzila","litaʿlamū","ʿadada","al-sinīna","wal-ḥisāba","mā","khalaqa","al-lahu","dhālika","illā","bil-ḥaqi","yufaṣṣilu","al-āyāti","liqawmin","yaʿlamūna",null],"verseTiming":[[1,0,500],[2,500,1470],[3,1470,2110],[4,2110,3090],[5,3090,6410],[6,6410,7530],[7,7530,9050],[8,9050,10510],[9,10510,11640],[10,11640,13070],[11,13070,14890],[12,14890,15500],[13,15500,16710],[14,16710,20700],[15,20700,21120],[16,21120,21870],[17,21870,22750],[18,22750,23700],[19,23700,24610],[20,24610,26320],[21,26320,27360],[22,27360,28800],[23,28800,30790],[24,30790,33995]]}}