{"name":"10:57","price":"اے لوگو! تمہارے پاس تمہارے رب کی طرف سے ایک ایسی چیز آئی ہے جو نصیحت ہے (1) اور دلوں میں جو روگ ہیں ان کے لیے شفا ہے (2)اور رہنمائی کرنے والی ہے اور رحمت ہے ایمان والوں کے لیے.(3)","arabic":"يَٰٓأَيُّهَا ٱلنَّاسُ قَدۡ جَآءَتۡكُم مَّوۡعِظَةٞ مِّن رَّبِّكُمۡ وَشِفَآءٞ لِّمَا فِي ٱلصُّدُورِ وَهُدٗى وَرَحۡمَةٞ لِّلۡمُؤۡمِنِينَ","category":["10 (Yunus)","Yunus","Surah Yunus","Chapter Yunus","Surah 10","Chapter 10","Jonah","يونُس"],"ayahNumber":1421,"juzNumber":11,"footnotes":"(1) یعنی جو قرآن کو دل کی توجہ سے پڑھے اور اس کے معنی و مطالب پر غور کرے، اس کے لئے قرآن نصیحت ہے قرآن کریم ترغیب و ترہیب دونوں طریقوں سے واعظ و نصیحت کرتا ہے اور ان کے نتائج سے آگاہ کرتا ہے جن سے اللہ تعالٰی کی نافرمانی کی صورت میں دو چار ہونا پڑے گا اور ان کاموں سے روکتا ہے جن سے انسان کی اخروی زندگی برباد ہوسکتی ہے۔\n(2) یعنی دلوں میں توحید و رسالت اور عقائد حقہ کے بارے میں جو شکوک و شبہات پیدا ہوتے ہیں ان کا ازالہ اور کفر و نفاق کی جو گندگی و پلیدی ہوتی ہے اسے صاف کرتا ہے۔\n(3) یہ قرآن مومنوں کے لئے ہدایت اور رحمت کا ذریعہ ہے ویسے تو یہ قرآن سارے جہان والوں کے لئے ہدایت و رحمت کا ذریعہ ہے لیکن چونکہ اس سے فیض یاب صرف اہل ایمان ہی ہوتے ہیں، اس لئے یہاں صرف انہی کے لئے اسے ہدایت و رحمت قرار دیا گیا ہے۔ اس مضمون کو قرآن کریم میں سورہ بنی اسرائیل آیت ۸۲ اور سورہ الم سجدہ آیت 44میں بھی بیان کیا گیا ہے (نیز هُدًى لِلْمُتَّقِينَ کا حاشیہ ملاحظہ فرمائیں)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāayyuhā al-nāsu qad jāatkum mawʿiẓatun min rabbikum washifāon limā fī al-ṣudūri wahudan waraḥmatun lil'mu'minīna ","translations":["O mankind","O mankind","Verily","has come to you","an instruction","from","your Lord","and a healing","for what","(is) in","your breasts","and guidance","and mercy","for the believers","(57)"],"transliterationArr":["yāayyuhā","al-nāsu","qad","jāatkum","mawʿiẓatun","min","rabbikum","washifāon","limā","fī","al-ṣudūri","wahudan","waraḥmatun","lil'mu'minīna",null],"verseTiming":[[1,0,3150],[2,3150,4900],[3,4900,5340],[4,5340,8320],[5,8320,10210],[6,10210,11170],[7,11170,12640],[8,12640,15390],[9,15390,16280],[10,16280,16490],[11,16490,17650],[12,17650,19390],[13,19390,20970],[14,20970,22100],[15,22100,26625]]}}