{"name":"10:69","price":"آپ کہہ دیجئے کہ جو لوگ اللہ پر جھوٹ افترا کرتے ہیں(1) ، وه کامیاب نہ ہوں گے.(2)","arabic":"قُلۡ إِنَّ ٱلَّذِينَ يَفۡتَرُونَ عَلَى ٱللَّهِ ٱلۡكَذِبَ لَا يُفۡلِحُونَ","category":["10 (Yunus)","Yunus","Surah Yunus","Chapter Yunus","Surah 10","Chapter 10","Jonah","يونُس"],"ayahNumber":1433,"juzNumber":11,"footnotes":"(1) افترا کے معنی جھوٹی بات کہنے کے ہیں۔ اس کے بعد مزید \"جھوٹ \" کا اضافہ تاکید کے لئے۔\n(2) اس سے واضح ہے کہ کامیابی سے مراد آخرت کی کامیابی یعنی اللہ کے غضب اور اس کے عذاب سے بچ جانا محض دنیا کی عارضی خوش حالی، کامیابی نہیں۔ جیسا کہ بہت سے لوگ کافروں کی عارضی خوشحالی سے مغالطے کا اور شکوک و شبہات کا شکار ہو جاتے ہیں۔ اسی لیے اگلی آیت میں فرمایا: ”یہ دنیا میں تھوڑا سا عیش کرلیں پھر ہمارے ہی پاس ان کو آنا ہے“ یعنی یہ دنیا کا عیش، آخرت کے مقابلے میں نہایت قلیل اور تھوڑا سا ہے جو شمار میں نہیں۔ اس کے بعد انہیں عذاب شدید سے دوچار ہونا پڑے گا۔ اس لیے اس بات کو اچھی طرح سمجھ لینا چاہیے کہ کافروں، مشرکوں اور اللہ کے نافرمانوں کی دنیاوی خوشحالی اور مادی ترقیاں، یہ اس بات کی دلیل نہیں ہیں کہ یہ قومیں کامیاب ہیں اور اللہ تعالٰی ان سے خوش ہے۔ یہ مادی کامیابیاں ان کی جہد مسلسل کا ثمرہ ہیں جو اسباب ظاہر کے مطابق ہر اس قوم کو حاصل ہوسکتی ہیں۔ جو اسباب کو بروئے کار لاتے ہوئے ان کی طرح محنت کرے گی، چاہے وہ مومن ہو یا کافر۔ علاوہ ازیں یہ عارضی کامیابیاں اللہ کے قانون مہلت کا نتیجہ بھی ہوسکتی ہیں۔ جس کی وضاحت اس سے قبل بعض جگہ ہم پہے بھی کر چکے ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qul inna alladhīna yaftarūna ʿalā al-lahi al-kadhiba lā yuf'liḥūna ","translations":["Say","Indeed","those who","invent","against","Allah","the lie","they will not succeed","they will not succeed","(69)"],"transliterationArr":["qul","inna","alladhīna","yaftarūna","ʿalā","al-lahi","al-kadhiba","lā","yuf'liḥūna",null],"verseTiming":[[1,0,430],[2,430,2100],[3,2100,3280],[4,3280,4530],[5,4530,5030],[6,5030,5940],[7,5940,6890],[8,6890,7330],[9,7330,11095]]}}