{"name":"10:62","price":"یاد رکھو اللہ کے دوستوں(1) پر نہ کوئی اندیشہ ہے اور نہ وه غمگین ہوتے ہیں.(2)","arabic":"أَلَآ إِنَّ أَوۡلِيَآءَ ٱللَّهِ لَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ","category":["10 (Yunus)","Yunus","Surah Yunus","Chapter Yunus","Surah 10","Chapter 10","Jonah","يونُس"],"ayahNumber":1426,"juzNumber":11,"footnotes":"(1) نافرمانوں کے بعد اللہ تعالٰی اپنے فرماں برداروں کا ذکر فرما رہا ہے اور وہ ہیں اولیاء اللہ۔ اولیاء ولی کی جمع ہے، جس کے معنی لغت میں قریب کے ہیں۔ اس اعتبار سے اولیاء اللہ کے معنی ہوں گے، وہ سچے اور مخلص مومن جنہوں نے اللہ کی اطاعت اور معاصی سے اجتناب کر کے اللہ کا قرب حاصل کر لیا۔ اسی لیے اگلی آیت میں خود اللہ تعالٰی نے بھی ان کی تعریف ان الفاظ سے بیان فرمائی، جو ایمان لائے اور جنہوں نے تقوی اختیار کیا۔ اور ایمان وتقوی ہی اللہ کے قرب کی بنیاد اور اہم ترین ذریعہ ہے، اس لغت سے ہر متقی مومن اللہ کا ولی ہے۔ لوگ ولایت کے لیے اظہار کرامت کو ضروری سمجھتے ہیں۔ اور پھر وہ اپنے بنائے ہوئے ولیوں کے لیے جھوٹی سچی کرامتیں مشہور کرتے ہیں۔ یہ خیال بالکل غلط ہے۔ کرامت کا ولایت سے چولی دامن کا ساتھ ہے نہ اس کے لیے شرط۔ یہ ایک الگ چیز ہے کہ اگر کسی سے کرامت ظاہر ہو جائے تو اللہ کی مشیت ہے، اس میں اس بزرگ کی مشیت شامل نہیں ہے۔ لیکن کسی متقی مومن اور متبع سنت سے کرامت کا ظہور ہو یا نہ ہو، اس کی ولایت میں کوئی شک نہیں۔\n(2) خوف کا تعلق مستقبل سے ہے اور غم (حزن) کا ماضی سے، مطلب یہ ہے کہ چونکہ انہوں نے زندگی خدا خوفی کے ساتھ گزاری ہوتی ہے۔ اس لیے قیامت کی ہولناکیوں کا اتنا خوف ان پر نہیں ہوگا، جس طرح دوسروں کو ہوگا۔ بلکہ وہ اپنے ایمان وتقوی کی وجہ سے اللہ کی رحمت وفضل خاص کے امیدوار اور اس کے ساتھ حسن ظن رکھنے والے ہوں گے۔ اسی طرح دنیا میں وہ جو کچھ چھوڑ گئے ہوں گے یا دنیا کی لذتیں انہیں حاصل نہ ہوسکی ہوں گی، ان پر انہیں کوئی حزن وملال نہیں ہوگا۔ ایک دوسرا مطلب یہ بھی ہے کہ دنیا میں جو مطلوبہ چیزیں انہیں نہ ملیں، اس پر وہ غم وحزن کا مظاہرہ نہیں کرتے، کیونکہ وہ جانتے ہیں کہ یہ سب اللہ کی قضا وتقدیر ہے۔ جس سے ان ان کے دلوں میں کوئی کدورت پیدا نہیں ہوتی، بلکہ ان کے دل قضائے الہی پر مسرور و مطمئن رہتے ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"alā inna awliyāa al-lahi lā khawfun ʿalayhim walā hum yaḥzanūna ","translations":["No doubt","Indeed","(the) friends","(of) Allah","(there will be) no","fear","upon then","and not","they","will grieve","(62)"],"transliterationArr":["alā","inna","awliyāa","al-lahi","lā","khawfun","ʿalayhim","walā","hum","yaḥzanūna",null],"verseTiming":[[1,0,2439],[2,2439,3919],[3,3919,6789],[4,6789,7899],[5,7899,8279],[6,8279,9179],[7,9179,10379],[8,10379,11059],[9,11059,11479],[10,11479,14944]]}}