{"name":"10:73","price":"سو وه لوگ ان کو جھٹلاتے رہے(1) پس ہم نے ان کو اور جو ان کے ساتھ کشتی میں تھے ان کو نجات دی اور ان کو جانشین بنایا (2)اور جنہوں نے ہماری آیتوں کو جھٹلایا تھا ان کو غرق کردیا۔ سو دیکھنا چاہئے کیسا انجام ہوا ان لوگوں کا جو ڈرائے جاچکے تھے.","arabic":"فَكَذَّبُوهُ فَنَجَّيۡنَٰهُ وَمَن مَّعَهُۥ فِي ٱلۡفُلۡكِ وَجَعَلۡنَٰهُمۡ خَلَٰٓئِفَ وَأَغۡرَقۡنَا ٱلَّذِينَ كَذَّبُواْ بِـَٔايَٰتِنَاۖ فَٱنظُرۡ كَيۡفَ كَانَ عَٰقِبَةُ ٱلۡمُنذَرِينَ","category":["10 (Yunus)","Yunus","Surah Yunus","Chapter Yunus","Surah 10","Chapter 10","Jonah","يونُس"],"ayahNumber":1437,"juzNumber":11,"footnotes":"(1) یعنی قوم نوح (عليه السلام) نے تمام تر وعظ و نصیحت کے باوجود جھٹلانے کا راستہ نہیں چھوڑا چنانچہ اللہ تعالٰی نے حضرت نوح (عليه السلام) اور ان پر ایمان لانے والوں کو ایک کشتی میں بٹھا کر بچا لیا اور باقی سب کو حتٰی کہ حضرت نوح (عليه السلام) کے ایک بیٹے کو بھی غرق کر دیا۔\n(2) یعنی زمین میں ان سے بچنے والوں کو ان سے پہلے کے لوگوں کا جانشین بنایا۔ پھر انسانوں کی آئندہ نسل انہی لوگوں بالخصوص حضرت نوح (عليه السلام) کے تین بیٹوں سے چلی، اسی لئے حضرت نوح (عليه السلام) آدم ثانی کہا جاتا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"fakadhabūhu fanajjaynāhu waman maʿahu fī al-ful'ki wajaʿalnāhum khalāifa wa-aghraqnā alladhīna kadhabū biāyātinā fa-unẓur kayfa kāna ʿāqibatu al-mundharīna ","translations":["But they denied him","so We saved him","and (those) who","(were) with him","in","the ship","and We made them","successors","and We drowned","those who","denied","Our Signs","Then see","how","was","(the) end","(of) those who were warned","(73)"],"transliterationArr":["fakadhabūhu","fanajjaynāhu","waman","maʿahu","fī","al-ful'ki","wajaʿalnāhum","khalāifa","wa-aghraqnā","alladhīna","kadhabū","biāyātinā","fa-unẓur","kayfa","kāna","ʿāqibatu","al-mundharīna",null],"verseTiming":[[1,0,1480],[2,1480,3260],[3,3260,3630],[4,3630,5080],[5,5080,5340],[6,5340,6280],[7,6280,7860],[8,7860,10430],[9,10430,11600],[10,11600,12670],[11,12670,13710],[12,13710,15659],[13,15659,18079],[14,18079,18629],[15,18629,19239],[16,19239,20389],[17,20389,24964]]}}