{"name":"10:89","price":"حق تعالیٰ نے فرمایا کہ تم دونوں کی دعا قبول کرلی گئی، سو تم ﺛابت قدم رہو(1) اور ان لوگوں کی راه نہ چلنا جن کو علم نہیں.(2)","arabic":"قَالَ قَدۡ أُجِيبَت دَّعۡوَتُكُمَا فَٱسۡتَقِيمَا وَلَا تَتَّبِعَآنِّ سَبِيلَ ٱلَّذِينَ لَا يَعۡلَمُونَ","category":["10 (Yunus)","Yunus","Surah Yunus","Chapter Yunus","Surah 10","Chapter 10","Jonah","يونُس"],"ayahNumber":1453,"juzNumber":11,"footnotes":"(1) اس کا ایک مطلب تو یہ ہے کہ اپنی بد دعا پر قائم رہنا، چاہے اس کے ظہور میں تاخیر ہو جائے۔ کیونکہ تمہاری دعا تو یقینا قبول کر لی گئی لیکن ہم اسے عملی جامہ کب پہنائیں گے؟ یہ خالص ہماری مشیت و حکمت پر موقوف ہے۔ چنانچہ بعض مفسرین نے بیان کیا کہ اس بد دعا کے چالیس سال بعد فرعون اور اس کی قوم ہلاک کی گئی اور بد دعا کے مطابق فرعون جب ڈوبنے لگا تو اس وقت اس نے ایمان لانے کا اعلان کیا، جس کا اسے کوئی فائدہ نہ ہوا۔ دوسرا مطلب یہ کہ تم اپنی تبلیغ و دعوت۔ بنی اسرائیل کی ہدایت و راہنمائی اور اس کو فرعون کی غلامی سے نجات دلانے کی جد و جہد جاری رکھو۔\n(2) یعنی جو لوگ اللہ کی سنت، اس کے قانون، اور اس کی مصلحتوں اور حکمتوں کو نہیں جانتے، تم ان کی طرح مت ہونا بلکہ اب انتظار اور صبر کرو، اللہ تعالٰی اپنی حکمت و مصلحت کے مطابق جلد یا بہ دیر اپنا وعدہ ضرور پورا فرمائے گا۔ کیونکہ وہ وعدہ خلافی نہیں کرتا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qāla qad ujībat daʿwatukumā fa-is'taqīmā walā tattabiʿānni sabīla alladhīna lā yaʿlamūna ","translations":["He said","Verily","has been answered","(the) invocation of both of you","So you two (keep to the) straight way","And (do) not","follow","(the) way","(of) those who","(do) not","know","(89)"],"transliterationArr":["qāla","qad","ujībat","daʿwatukumā","fa-is'taqīmā","walā","tattabiʿānni","sabīla","alladhīna","lā","yaʿlamūna",null],"verseTiming":[[1,0,710],[2,710,1060],[3,1060,2070],[4,2070,3810],[5,3810,5320],[6,5320,5960],[7,5960,11419],[8,11419,12329],[9,12329,13739],[10,13739,14159],[11,14159,18564]]}}