{"name":"10:83","price":"پس موسیٰ (علیہ السلام) پر ان کی قوم میں سے صرف قدرے قلیل آدمی ایمان ﻻئے (1) وه بھی فرعون سے اور اپنے حکام سے ڈرتے ڈرتے کہ کہیں ان کو تکلیف پہنچائے (2)اور واقع میں فرعون اس ملک میں زور رکھتا تھا، اور یہ بھی بات تھی کہ وه حد سے باہر ہو جاتا تھا.(3)","arabic":"فَمَآ ءَامَنَ لِمُوسَىٰٓ إِلَّا ذُرِّيَّةٞ مِّن قَوۡمِهِۦ عَلَىٰ خَوۡفٖ مِّن فِرۡعَوۡنَ وَمَلَإِيْهِمۡ أَن يَفۡتِنَهُمۡۚ وَإِنَّ فِرۡعَوۡنَ لَعَالٖ فِي ٱلۡأَرۡضِ وَإِنَّهُۥ لَمِنَ ٱلۡمُسۡرِفِينَ","category":["10 (Yunus)","Yunus","Surah Yunus","Chapter Yunus","Surah 10","Chapter 10","Jonah","يونُس"],"ayahNumber":1447,"juzNumber":11,"footnotes":"(1) قَوْمِهِ کے ”ہ“ ضمیر کے مرجع میں مفسرین کا اختلاف ہے، بعض نے اس کا مرجع حضرت موسیٰ (عليه السلام) کو قرار دیا ہے۔ کیونکہ آیت میں ضمیر سے پہلے انہی کا ذکر ہے یعنی فرعون کی قوم میں سے تھوڑے سے لوگ ایمان لائے، ان کی دلیل یہ ہے کہ بنی اسرائیل کے لوگ تو ایک رسول اور نجات دہندہ کے انتظار میں تھے جو حضرت موسیٰ (عليه السلام) کی صورت میں انہیں مل گئے اور اس اعتبار سے سارے بنی اسرائیل (سوائے قارون کے) ان پر ایمان رکھتے تھے۔ اس لئے صحیح بات یہی ہے کہ «ذُرِّيَّةٌ مِنْ قَوْمِهِ» سے مراد، فرعون کی قوم سے تھوڑے سے لوگ ہیں، جو حضرت موسیٰ (عليه السلام) پر ایمان لائے۔ انہیں میں سے اس کی بیوی (حضرت آسیہ) بھی ہیں۔\n(2) قرآن کریم کی یہ صراحت بھی اس بات پر دلالت کرتی ہے کہ یہ ایمان لانے والے تھوڑے سے لوگ فرعون کی قوم میں سے تھے، کیونکہ انہی کو فرعون اس کے درباریوں اور حکام سے تکلیف پہنچانے کا ڈر تھا۔ بنی اسرئیل، ویسے تو فرعون کی غلامی و محکومی کی ذلت ایک عرصے سے برداشت کر رہے تھے۔ لیکن موسیٰ (عليه السلام) پر ایمان لانے سے اس کا کوئی تعلق نہیں تھا، نہ انہیں اس وجہ سے مزید تکالیف کا اندیشہ تھا۔\n(3) اور ایمان لانے والے اس کے اسی ظلم و ستم کی عادت سے خوف زدہ تھے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"famā āmana limūsā illā dhurriyyatun min qawmihi ʿalā khawfin min fir'ʿawna wamala-ihim an yaftinahum wa-inna fir'ʿawna laʿālin fī al-arḍi wa-innahu lamina al-mus'rifīna ","translations":["But none","believed","Musa","except","(the) offspring","among","his people","for","fear","of","Firaun","and their chiefs","lest","they persecute them","And indeed","Firaun","(was) a tyrant","in","the earth","and indeed, he","(was) of","the ones who commit excesses","(83)"],"transliterationArr":["famā","āmana","limūsā","illā","dhurriyyatun","min","qawmihi","ʿalā","khawfin","min","fir'ʿawna","wamala-ihim","an","yaftinahum","wa-inna","fir'ʿawna","laʿālin","fī","al-arḍi","wa-innahu","lamina","al-mus'rifīna",null],"verseTiming":[[1,0,2200],[2,2200,3450],[3,3450,6000],[4,6000,7280],[5,7280,9030],[6,9030,10670],[7,10670,11720],[8,11720,12410],[9,12410,13200],[10,13200,14230],[11,14230,16350],[12,16350,17600],[13,17600,17850],[14,17850,20440],[15,20440,22610],[16,22610,23830],[17,23830,24710],[18,24710,26050],[19,26050,26970],[20,26970,28850],[21,28850,29450],[22,29450,33355]]}}