{"name":"10:88","price":"اور موسیٰ (علیہ السلام) نے عرض کیا اے ہمارے رب! تو نے فرعون کو اور اس کے سرداروں کو سامان زینت اور طرح طرح کے مال دنیاوی زندگی میں دیئے۔ اے ہمارے رب! (اسی واسطے دیئے ہیں کہ) وه تیری راه سے گمراه کریں۔ اے ہمارے رب! ان کے مالوں کو نیست ونابود کر دے اور ان کے دلوں کو سخت کردے (1) سو یہ ایمان نہ ﻻنے پائیں یہاں تک کہ دردناک عذاب کو دیکھ لیں.(2)","arabic":"وَقَالَ مُوسَىٰ رَبَّنَآ إِنَّكَ ءَاتَيۡتَ فِرۡعَوۡنَ وَمَلَأَهُۥ زِينَةٗ وَأَمۡوَٰلٗا فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَا رَبَّنَا لِيُضِلُّواْ عَن سَبِيلِكَۖ رَبَّنَا ٱطۡمِسۡ عَلَىٰٓ أَمۡوَٰلِهِمۡ وَٱشۡدُدۡ عَلَىٰ قُلُوبِهِمۡ فَلَا يُؤۡمِنُواْ حَتَّىٰ يَرَوُاْ ٱلۡعَذَابَ ٱلۡأَلِيمَ","category":["10 (Yunus)","Yunus","Surah Yunus","Chapter Yunus","Surah 10","Chapter 10","Jonah","يونُس"],"ayahNumber":1452,"juzNumber":11,"footnotes":"(1) جب موسیٰ (عليه السلام) نے دیکھا کہ فرعون اور اس کی قوم پر وعظ نصیحت کا بھی کوئی اثر نہیں ہوا اور اس طرح معجزات دیکھ کر بھی ان کے اندر کوئی تبدیلی نہیں آئی۔ تو پھر ان کے حق میں بد دعا فرمائی۔ جسے اللہ نے یہاں نقل فرمایا ہے۔\n(2) یعنی اگر یہ ایمان لائیں بھی تو عذاب دیکھنے کے بعد لائیں، جو ان کے لئے نفع بخش نہیں ہوگا۔ یہاں ذہن میں یہ اشکال نہیں آنا چاہیے کہ پیغمبر تو ہدایت کی دعا کرتے ہیں نہ کہ ہلاکت کی بد دعا۔ اس لئے کہ دعوت و تبلیغ اور ہر طرح سے اتمام حجت کے بعد، جب یہ واضح ہو جائے کہ اب ایمان لانے کی کوئی امید باقی نہیں رہی، تو پھر آخری چارہ کار یہی رہ جاتا ہے کہ اس قوم کے معاملے کو اللہ کے سپرد کر دیا جائے، یہ گو اللہ کی مشیت ہی ہوتی ہے جو بے اختیار پیغمبر کی زبان پر جاری ہو جاتی ہے جس طرح حضرت نوح (عليه السلام) نے بھی ساڑھے نو سو سال تبلیغ کرنے کے بعد بالآخر اپنی قوم کے بارے بد دعا فرمائی۔«رَبِّ لا تَذَرْ عَلَى الأَرْضِ مِنَ الْكَافِرِينَ دَيَّارًا» ”اے رب زمین پر ایک کافر کو بھی بسا نہ رہنے دے“۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waqāla mūsā rabbanā innaka ātayta fir'ʿawna wamala-ahu zīnatan wa-amwālan fī al-ḥayati al-dun'yā rabbanā liyuḍillū ʿan sabīlika rabbanā iṭ'mis ʿalā amwālihim wa-ush'dud ʿalā qulūbihim falā yu'minū ḥattā yarawū al-ʿadhāba al-alīma ","translations":["And Musa said","And Musa said","Our Lord","Indeed, You","have given","Firaun","and his chiefs","splendor","and wealth","in","the life","(of) the world","Our Lord","That they may lead astray","from","Your way","Our Lord","Destroy","[on]","their wealth","and harden","[on]","their hearts","so (that) not","they believe","until","they see","the punishment ","the painful","(88)"],"transliterationArr":["waqāla","mūsā","rabbanā","innaka","ātayta","fir'ʿawna","wamala-ahu","zīnatan","wa-amwālan","fī","al-ḥayati","al-dun'yā","rabbanā","liyuḍillū","ʿan","sabīlika","rabbanā","iṭ'mis","ʿalā","amwālihim","wa-ush'dud","ʿalā","qulūbihim","falā","yu'minū","ḥattā","yarawū","al-ʿadhāba","al-alīma",null],"verseTiming":[[1,0,930],[2,930,1740],[3,1740,4228],[4,4228,5829],[5,5829,6910],[6,6910,8000],[7,8000,9200],[8,9200,10750],[9,10750,12420],[10,12420,13290],[11,13290,14300],[12,14300,15310],[13,15310,16520],[14,16520,17760],[15,17760,18630],[16,18630,20630],[17,20630,21430],[18,21430,22170],[19,22170,24030],[20,24030,25580],[21,25580,26270],[22,26270,26940],[23,26940,28280],[24,28280,28960],[25,28960,29970],[26,29970,30920],[27,30920,31540],[28,31540,32620],[29,32620,36345]]}}