{"name":"10:84","price":"اور موسیٰ (علیہ السلام) نے فرمایا کہ اے میری قوم! اگر تم اللہ پر ایمان رکھتے ہو تو اسی پر توکل کرو اگر تم مسلمان ہو.","arabic":"وَقَالَ مُوسَىٰ يَٰقَوۡمِ إِن كُنتُمۡ ءَامَنتُم بِٱللَّهِ فَعَلَيۡهِ تَوَكَّلُوٓاْ إِن كُنتُم مُّسۡلِمِينَ","category":["10 (Yunus)","Yunus","Surah Yunus","Chapter Yunus","Surah 10","Chapter 10","Jonah","يونُس"],"ayahNumber":1448,"juzNumber":11,"footnotes":"(1) بنی اسرائیل، فرعون کی طرف سے جس ذلت اور رسوائی کا شکار تھے، حضرت موسیٰ (عليه السلام) کے آنے کے بعد بھی اس میں کمی نہیں آئی، اس لئے وہ سخت پریشان تھے، بلکہ حضرت موسیٰ (عليه السلام) سے انہوں نے یہ تک کہہ دیا، اے موسٰی، جس طرح تیرے آنے سے پہلے ہم فرعون اور اس کی قوم کی طرف سے تکلیفوں میں مبتلا تھے، تیرے آنے کے بعد بھی ہمارا یہی حال ہے۔ جس پر حضرت موسیٰ (عليه السلام) نے انہیں کہا تھا کہ امید ہے کہ میرا رب جلدی تمہارے دشمن کو ہلاک کر دے گا۔ لیکن اس کے لئے ضروری ہے کہ تم صرف ایک اللہ سے مدد چاہو اور صبر کا دامن ہاتھ سے نہ چھوڑو (ملاحظہ ہو سورۃ الاعراف آیات 128-129) یہاں بھی حضرت موسیٰ (عليه السلام) نے انہیں تلقین کی کہ اگر تم اللہ کے سچے فرمانبردار ہو تو اسی پر توکل کرو۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waqāla mūsā yāqawmi in kuntum āmantum bil-lahi faʿalayhi tawakkalū in kuntum mus'limīna ","translations":["And Musa said","And Musa said","O my people","If","you have","believed","in Allah","then on Him","put your trust","if","you are","Muslims","(84)"],"transliterationArr":["waqāla","mūsā","yāqawmi","in","kuntum","āmantum","bil-lahi","faʿalayhi","tawakkalū","in","kuntum","mus'limīna",null],"verseTiming":[[1,0,960],[2,960,1840],[3,1840,2910],[4,2910,3970],[5,3970,5560],[6,5560,7900],[7,7900,9380],[8,9380,10520],[9,10520,11980],[10,11980,13630],[11,13630,16609],[12,16609,17699],[13,17699,19359],[14,19359,23614]]}}