{"name":"114:6","price":"(خواه) وه جن میں سے ہو یا انسان میں سے.(1)","arabic":"مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ","category":["114 (An-Nas)","An-Nas","Surah An-Nas","Chapter An-Nas","Nas","Surah Nas","Chapter Nas","An Nas","Surah An Nas","Chapter An Nas","Surah 114","Chapter 114","Mankind","الناس"],"ayahNumber":6236,"juzNumber":30,"footnotes":"(1) یہ وسوسہ ڈالنے والوں کی دو قسمیں ہیں۔ شیاطین الجن کو تو اللہ تعالیٰ نے انسانوں کو گمراہ کرنے کی قدرت دی ہے۔ علاوہ ازیں ہر انسان کے ساتھ ایک شیطان اس کا ساتھی ہوتا ہے جو اس کو گمراہ کرتا رہتا ہے۔ چنانچہ حدیث میں آتا ہے کہ جب نبی (صلى الله عليه وسلم) نے یہ بات فرمائی تو صحابہ (رضي الله عنهم) نے پوچھا کہ یا رسول اللہ ! کیا وہ آپ کے ساتھ بھی ہے؟ آپ (صلى الله عليه وسلم) نے فرمایا، ہاں ! میرے ساتھ بھی ہے، لیکن اللہ نے اس پر میری مدد فرمائی ہے، اور وہ میرا مطیع ہو گیا ہے۔ مجھے خیر کے علاوہ کسی بات کا حکم نہیں دیتا۔ ( صحيح مسلم، كتاب صفة القيامة، باب تحريش الشيطان وبعثه سراياه لفتنة الناس) اسی طرح حدیث میں آتا ہے کہ نبی (صلى الله عليه وسلم) اعتکاف فرما تھے کہ آپ (صلى الله عليه وسلم) کی زوجہ مطہرہ حضرت صفیہ (رضی الله عنها) آپ (صلى الله عليه وسلم) سے ملنےکے لئے آئیں۔ رات کا وقت تھا، آپ (صلى الله عليه وسلم) انہیں چھوڑنے کےلئے ان کے ساتھ گئے۔ راستے میں دو انصاری صحابی وہاں سے گزرے، تو آپ (صلى الله عليه وسلم) نے انہیں بلاکر فرمایا کہ یہ میری اہلیہ، صفیہ بنت حیی، ہیں۔ انہوں نے عرض کیا، یارسول اللہ (صلى الله عليه وسلم) آپ کی بابت ہمیں کیا بدگمانی ہو سکتی تھی؟ آپ (صلى الله عليه وسلم) نے فرمایا یہ تو ٹھیک ہے، لیکن شیطان انسان کی رگوں میں خون کی طرح دوڑتا ہے۔ مجھے خطرہ محسوس ہوا کہ کہیں وہ تمہارے دلوں میں کچھ شبہ نہ ڈال دے۔ ( صحيح بخاري، كتاب الأحكام، والشهادة، تكون عند الحاكم في ولاية القضاء) ۔\nدوسرے شیطان، انسانوں میں سےہوتے ہیں جو ناصح، مشفق کے روپ میں انسانوں کو گمراہی کی ترغیب دیتے ہیں۔ بعض کہتے ہیں کہ شیطان جن کو گمراہ کرتا ہے یہ ان کی دو قسمیں ہیں، یعنی شیطان انسانوں کو بھی گمراہ کرتا ہے اور جنات کو بھی۔ صرف انسانون کا ذکر تغلیب کے طور پر ہے، ورنہ جنات بھی شیطان کے وسوسوں سے گمراہ ہونے والوں میں شامل ہیں اور بعض کہتے ہیں کہ جنوں پر بھی قرآن میں رجال کا لفظ بولا گیا ہے۔ (سورۃ الجن: 6) اس لئے وہ بھی ناس کا مصداق ہیں ۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"mina al-jinati wal-nāsi ","translations":["From","the jinn","and men","(6)"],"transliterationArr":["mina","al-jinati","wal-nāsi",null],"verseTiming":[[1,0,380],[2,380,2610],[3,2610,8185]]}}