{"name":"11:107","price":"وه وہیں ہمیشہ رہنے والے ہیں جب تک آسمان وزمین برقرار رہیں(1) ۔ سوائے اس وقت کے جو تمہارا رب چاہے(2)۔ یقیناً تیرا رب جو کچھ چاہے کر گزرتا ہے.","arabic":"خَٰلِدِينَ فِيهَا مَا دَامَتِ ٱلسَّمَٰوَٰتُ وَٱلۡأَرۡضُ إِلَّا مَا شَآءَ رَبُّكَۚ إِنَّ رَبَّكَ فَعَّالٞ لِّمَا يُرِيدُ","category":["11 (Hud)","Hud","Surah Hud","Chapter Hud","Surah 11","Chapter 11","Hud","هود"],"ayahNumber":1580,"juzNumber":12,"footnotes":"(1) ان الفاظ سے بعض لوگوں کو یہ مغالطہ لگا ہے کہ کافروں کے لئے جہنم کا عذاب دائمی نہیں ہے بلکہ موقت ہے یعنی اس وقت تک رہے گا جب تک آسمان و زمین رہیں گے۔ لیکن یہ بات صحیح نہیں۔ کیونکہ یہاں «مَا دَ امَتِ السِّمٰوٰ تُ وَالْاَرْضُ» اہل عرب کے روز مرہ کی گفتگو اور محاورے کے مطابق نازل ہوا ہے۔ عربوں کی عادت تھی کہ جب کسی چیز کا دوام ثابت کرنا مقصود ہوتا تو وہ کہتے تھےکہ هَذَا دَائِمٌ دَوَامَ السَّمَوَاتِ وَالأَرْضِ (یہ چیز اسی طرح ہمیشہ رہے گی۔ جس طرح آسمان و زمین کا دوام ہے) اسی محاورے کو قرآن کریم میں استعمال کیا گیا ہے، جس کا مطلب یہ ہے کہ اہل کفر و شرک جہنم میں ہمیشہ رہیں گے۔ جس کو قرآن نے متعدد جگہ «خَالِدِينَ فِيهَا أَبَدًا» کے الفاظ سے ذکر کیا ہے۔ ایک دوسرا مفہوم اس کا یہ بھی بیان کی گیا ہے کہ آسمان و زمین سے مراد جنس ہے۔ یعنی دنیا کے آسمان و زمین اور ہیں جو فنا ہو جائیں گے لیکن آخرت کے آسمان و زمین ان کے علاوہ اور ہوں گے، جیسا کہ قران کریم میں اس کی صراحت ہے، «يَوْمَ تُبَدَّلُ الْاَرْضُ غَيْرَ الْاَرْضِ وَالسَّمٰوٰتُ وَبَرَزُوْا لِلّٰهِ الْوَاحِدِ الْقَهَّارِ» (سورۃ ابراہیم:48)، ”اس دن یہ زمین دوسری زمین سے بدل دی جائے گی اور آسمان بھی بدل دئیے جائیں گے“۔ اور آخرت کے یہ آسمان وزمین، جنت اور دوزخ کی طرح ہمیشہ رہیں گے۔ اس آیت میں یہی آسمان وزمین مراد ہے نہ کہ دنیا کے آسمان وزمین جو فنا ہو جائیں گے۔ (ابن کثیر) ان دونوں مفہوموں میں سے کوئی بھی مفہوم مراد لے لیا جائے، آیت کا مفہوم واضح ہو جاتا ہے اور وہ اشکال پیدا نہیں ہوتا جو مذکور ہوا۔ امام شوکانی نے اس کے اور بھی کئی مفہوم بیان کیے ہیں جنہیں اہل علم ملاحظہ فرما سکتے ہیں۔ (فتح القدیر)\n(2) اس استثناء کے بھی کئی مفہوم بیان کئے گئے ہیں۔ ان میں سب سے زیادہ صحیح مفہوم یہی ہے کہ یہ استثناء ان گناہ گاروں کے لئے ہے جو اہل توحید و اہل ایمان ہوں گے۔ اس اعتبار سے اس سے ما قبل آیت میں شَقِی کا لفظ عام یعنی کافر اور عاصی دونوں کو شامل ہوگا اور «إِلا مَا شَاءَ رَبُّكَ» سے عاصی مومنوں کا استثناء ہو جائے گا اور مَا شَآءِ میں مَا، مَنْ کے معنی میں ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"khālidīna fīhā mā dāmati al-samāwātu wal-arḍu illā mā shāa rabbuka inna rabbaka faʿʿālun limā yurīdu ","translations":["(Will be) abiding","therein","as long as remain","as long as remain","the heavens","and the earth","except","what your Lord wills","what your Lord wills","what your Lord wills","Indeed","your Lord","(is) All-Accomplisher","of what","He intends","(107)"],"transliterationArr":["khālidīna","fīhā","mā","dāmati","al-samāwātu","wal-arḍu","illā","mā","shāa","rabbuka","inna","rabbaka","faʿʿālun","limā","yurīdu",null],"verseTiming":[[1,0,1300],[2,1300,2270],[3,2270,2700],[4,2700,3560],[5,3560,5260],[6,5260,6260],[7,6260,7120],[8,7120,7480],[9,7480,10130],[10,10130,10970],[11,10970,12580],[12,12580,13440],[13,13440,14530],[14,14530,15410],[15,15410,18065]]}}