{"name":"11:119","price":"بجز ان کے جن پر آپ کا رب رحم فرمائے، انہیں تو اسی لئے پیدا کیا ہے(1) ، اور آپ کے رب کی یہ بات پوری ہے کہ میں جہنم کو جنوں اور انسانوں سب سے پر کروں گا.(2)","arabic":"إِلَّا مَن رَّحِمَ رَبُّكَۚ وَلِذَٰلِكَ خَلَقَهُمۡۗ وَتَمَّتۡ كَلِمَةُ رَبِّكَ لَأَمۡلَأَنَّ جَهَنَّمَ مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ أَجۡمَعِينَ","category":["11 (Hud)","Hud","Surah Hud","Chapter Hud","Surah 11","Chapter 11","Hud","هود"],"ayahNumber":1592,"juzNumber":12,"footnotes":"(1) ”اسی لئے“ کا مطلب بعض نے اختلاف اور بعض نے رحمت لیا ہے۔ دونوں صورتوں میں مفہوم یہ ہوگا کہ ہم نے انسانوں کو آزمائش کے لئے پیدا کیا ہے۔ جو دین حق سے اختلاف کا راستہ اختیار کرے گا، وہ آزمائش میں ناکام اور جو اسے اپنا لے گا، وہ کامیاب اور رحمت الٰہی کا مستحق ہوگا۔\n(2) یعنی اللہ کی تقدیر اور قضاء میں یہ بات ثبت ہے کہ کچھ لوگ ایسے ہونگے جو جنت کے اور کچھ ایسے ہونگے جو جہنم کے مستحق ہوں گے اور جنت و جہنم کو انسانوں اور جنوں سے بھر دیا جائے گا۔ جیسا کہ حدیث میں ہے، نبی نے فرمایا: جنت اور دوزخ آپس میں جھگڑ پڑیں، جنت نے کہا، کیا بات ہے کہ میرے اندر وہی لوگ آئیں گے جو کمزور اور معاشرے کے گرے پڑے لوگ ہوں گے؟ جہنم نے کہا میرے اندر تو بڑے بڑے جبار اور متکبر قسم کے لوگ ہوں گے\" اللہ تعالٰی نے، جنت سے فرمایا تو میری رحمت کی مظہر ہے، تیرے ذریعے سے میں جس پر چاہوں اپنا رحم کروں۔ اور جہنم سے اللہ تعالٰی نے فرمایا تو میرے عذاب کی مظہر ہے تیرے ذریعے سے میں جس کو چاہوں سزا دوں۔ اللہ تعالٰی جنت اور دوزخ دونوں کو بھر دے گا۔ جنت میں ہمیشہ اس کا فضل ہوگا، حتٰی کہ اللہ تعالٰی ایسی مخلوق پیدا فرمائے گا جو جنت کے باقی ماندہ رقبے میں رہے گی اور جہنم، جہنمیوں کی کثرت کے باوجود «هَلْ مِنْ مَزِيدٍ» نعرہ بلند کرے گی، یہاں تک کہ اللہ تعالٰی اس میں اپنا قدم رکھے گا جس پر جہنم پکار اٹھے گی قط قط وعزتک، بس، بس، تیری عزت و جلال کی قسم \"۔ (صحيح بخاري، كتاب التوحيد، باب ما جاء في قوله تعالى إن رحمة الله قريب من المحسنين ، وتفسير سورة ق - مسلم كتاب الجنة باب النار يدخلها الجبارون والجنة يدخلها الضعفاء)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"illā man raḥima rabbuka walidhālika khalaqahum watammat kalimatu rabbika la-amla-anna jahannama mina al-jinati wal-nāsi ajmaʿīna ","translations":["Except","(on) whom","your Lord has bestowed Mercy","your Lord has bestowed Mercy","and for that","He created them","And will be fulfilled","(the) Word of your Lord","(the) Word of your Lord","Surely I will fill","Hell","with","the Jinn","and the men","all together","(119)"],"transliterationArr":["illā","man","raḥima","rabbuka","walidhālika","khalaqahum","watammat","kalimatu","rabbika","la-amla-anna","jahannama","mina","al-jinati","wal-nāsi","ajmaʿīna",null],"verseTiming":[[1,0,880],[2,880,1040],[3,1040,1910],[4,1910,3070],[5,3070,4280],[6,4280,5790],[7,5790,7510],[8,7510,8290],[9,8290,9120],[10,9120,11060],[11,11060,12620],[12,12620,12920],[13,12920,14640],[14,14640,16440],[15,16440,19305]]}}