{"name":"11:10","price":"اور اگر ہم اسے کوئی نعمت چکھائیں اس سختی کے بعد جو اسے پہنچ چکی تھی تو وه کہنے لگتا ہے کہ بس برائیاں مجھ سے جاتی رہیں(1) ، یقیناً وه بڑا ہی اترانے واﻻ شیخی خور ہے.(2)","arabic":"وَلَئِنۡ أَذَقۡنَٰهُ نَعۡمَآءَ بَعۡدَ ضَرَّآءَ مَسَّتۡهُ لَيَقُولَنَّ ذَهَبَ ٱلسَّيِّـَٔاتُ عَنِّيٓۚ إِنَّهُۥ لَفَرِحٞ فَخُورٌ","category":["11 (Hud)","Hud","Surah Hud","Chapter Hud","Surah 11","Chapter 11","Hud","هود"],"ayahNumber":1483,"juzNumber":12,"footnotes":"(1) یعنی سمجھتا ہے کہ سختیوں کا دور گزر گیا، اب اسے کوئی تکلیف نہیں آئے گی۔ أُمَّةٌ کے مختلف مفہوم: آیت نمبر ۸ میں أُمَّةٌ کا لفظ آیا ہے۔ یہ قرآن مجید میں مختلف مقامات پر مختلف مفہوم میں استعمال ہوا ہے۔ یہ ام سے مشتق ہے، جس کے معنی قصد کے ہیں۔ یہاں اس کے معنی اس وقت اور مدت کے ہیں جو نزول عذاب کے لیے مقصود ہے۔ (فتح القدیر) سورہ یوسف کی آیت 45«وَادَّكَرَ بَعْدَ أُمَّةٍ» میں یہی مفہوم ہے اس کے علاوہ جن معنوں میں اس کا استعمال ہوا ہے، ان میں ایک امام وپیشوا ہے۔ جیسے «إِنَّ إِبْرَاهِيمَ كَانَ أُمَّةً» ( النحل:120) ملت اور دین ہے، جیسے «إِنَّا وَجَدْنَا آبَاءَنَا عَلَى أُمَّةٍ» ( الزخرف:23) جماعت اور طائفہ ہے۔ جیسے «وَلَمَّا وَرَدَ مَاءَ مَدْيَنَ وَجَدَ عَلَيْهِ أُمَّةً مِنَ النَّاسِ» ( القصص:23)، «وَمِنْ قَوْمِ مُوسَى أُمَّةٌ» (الأعراف:159) وغیرھا۔ وہ مخصوص گروہ یا قوم ہے جس کی طرف کوئی رسول مبعوث ہو۔«وَلِكُلِّ أُمَّةٍ رَسُولٌ» (يونس:47) اس کو امت دعوت بھی کہتے ہیں اور اسی طرح پیغمبر پر ایمان لانے والوں کو بھی امت یا امت اتباع یا امت اجابت کہا جاتا ہے۔ (ابن کثیر)\n(2) یعنی جو کچھ اس کے پاس ہے، اس پر اتراتا اور دوسروں پر فخر و غرور کا اظہار کرتا ہے۔ تاہم ان صفات مذمومہ سے اہل ایمان اور صاحب اعمال صالحہ مستشنٰی ہیں جیسا کہ اگلی آیت سے واضح ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wala-in adhaqnāhu naʿmāa baʿda ḍarrāa massathu layaqūlanna dhahaba al-sayiātu ʿannī innahu lafariḥun fakhūrun ","translations":["But if","We give him a taste","(of) favor","after","hardship","(has) touched him","surely, he will say","Have gone","the evils","from me","Indeed, he","(is) exultant","(and) boastful","(10)"],"transliterationArr":["wala-in","adhaqnāhu","naʿmāa","baʿda","ḍarrāa","massathu","layaqūlanna","dhahaba","al-sayiātu","ʿannī","innahu","lafariḥun","fakhūrun",null],"verseTiming":[[1,0,920],[2,920,2210],[3,2210,5280],[4,5280,5880],[5,5880,8440],[6,8440,9520],[7,9520,11640],[8,11640,12140],[9,12140,13730],[10,13730,15350],[11,15350,17730],[12,17730,19530],[13,19530,23045]]}}