{"name":"11:17","price":"کیا وه شخص جو اپنے رب کے پاس کی دلیل پر ہو اور اس کے ساتھ اللہ کی طرف کا گواه ہو اور اس سے پہلے موسیٰ کی کتاب (گواه ہو) جو پیشوا اور رحمت ہے (اوروں کے برابر ہو سکتا ہے؟)(1) یہی لوگ ہیں جو اس پر ایمان رکھتے ہیں(2)، اور تمام فرقوں میں سے جو بھی اس کا منکر ہو اس کے آخری وعدے کی جگہ جہنم ہے(3)، پس تو اس میں کسی قسم کے شبہ میں نہ ره، یقیناً یہ تیرے رب کی جانب سے سراسر برحق ہے، لیکن اکثر لوگ ایمان ﻻنے والے نہیں ہوتے.(4)","arabic":"أَفَمَن كَانَ عَلَىٰ بَيِّنَةٖ مِّن رَّبِّهِۦ وَيَتۡلُوهُ شَاهِدٞ مِّنۡهُ وَمِن قَبۡلِهِۦ كِتَٰبُ مُوسَىٰٓ إِمَامٗا وَرَحۡمَةًۚ أُوْلَٰٓئِكَ يُؤۡمِنُونَ بِهِۦۚ وَمَن يَكۡفُرۡ بِهِۦ مِنَ ٱلۡأَحۡزَابِ فَٱلنَّارُ مَوۡعِدُهُۥۚ فَلَا تَكُ فِي مِرۡيَةٖ مِّنۡهُۚ إِنَّهُ ٱلۡحَقُّ مِن رَّبِّكَ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يُؤۡمِنُونَ","category":["11 (Hud)","Hud","Surah Hud","Chapter Hud","Surah 11","Chapter 11","Hud","هود"],"ayahNumber":1490,"juzNumber":12,"footnotes":"(1) منکرین اور کافرین کے مقابلے میں اہل فطرت اور اہل ایمان کا تذکرہ کیا جا رہا ہے ”اپنے رب کی طرف سے دلیل“ سے مراد وہ فطرت ہے جس پر اللہ تعالٰی نے انسانوں کو پیدا فرمایا اور وہ اللہ واحد کا اعتراف اور اسی کی عبادت جس طرح کہ نبی(صلى الله عليه وسلم) کا فرمان ہے کہ ”ہر بچہ فطرت پر پیدا ہوتا ہے، پس اس کے بعد اس کے ماں باپ اسے یہودی، نصرانی یا مجوسی بنا دیتے ہیں“(صحيح بخاري- كتاب الجنائز ومسلم- كتاب القدر) یتلوہ کے معنی ہیں اس کے پیچھے یعنی اس کے ساتھ اللہ کی طرف سے ایک گواہ بھی ہو گواہ سے مراد قرآن ، یا محمد (صلى الله عليه وسلم) ہیں ، جو اس فطرت صحیحہ کی طرف دعوت دیتے اور اس کی نشاندہی کرتے ہیں اور اس سے پہلے حضرت موسیٰ (عليه السلام) کی کتاب تورات بھی جو پیشوا بھی ہے اور رحمت کا سبب بھی یعنی کتاب موسیٰ (عليه السلام) بھی قرآن پر ایمان لانے کی طرف رہنمائی کرنے والی ہے۔ مطلب یہ ہے کہ ایک وہ شخص ہے جو منکر اور کافر ہے اور اس کے مقابلے میں ایک دوسرا شخص ہے جو اللہ تعالٰی کی طرف سے دلیل پر قائم ہے، اس پر ایک گواہ (قرآن، یا پیغمبر اسلام صلى الله عليه وسلم) بھی ہے، اسی طرح اس سے قبل نازل ہونے والی کتاب تورات، میں بھی اس کے لئے پیشوائی کا اہتمام کیا گیا ہے۔ اور وہ ایمان لے آتا ہے کیا یہ دونوں شخص برابر ہو سکتے ہیں۔ کیونکہ ایک مومن ہے اور دوسرا کافر۔ ہر طرح کے دلائل سے لیس ہے اور دوسرا بالکل خالی ہے۔\n(2) یعنی جن کے اندر مذکورہ اوصاف پائے جائیں گے وہ قرآن کریم اور نبی پر ایمان لائیں گے۔\n(3) تمام فرقوں سے مراد روئے زمین پر پائے جانے والے مذاہب ہیں، یہودی، عیسائی، زرتشی، بدھ مت، مجوسی اور مشرکین و کفار وغیرہ، جو بھی حضرت محمد رسول اللہ (صلى الله عليه وسلم) پر ایمان نہیں لائے گا، اس کا ٹھکانا جہنم ہے یہ وہی مضمون ہے جسے اس حدیث میں بیان کیا گیا ہے”قسم ہے اس ذات کی جس کے ہاتھ میں میری جان ہے، اس امت کے جس یہودی، یا عیسائی نے بھی میری نبوت کی بابت سنا اور پھر مجھ پر ایمان نہیں لایا وہ جہنم میں جائے گا“(صحيح مسلم، كتاب الإيمان، باب وجوب الإيمان برسالة نبينا صلى الله عليه وسلم إلى جميع الناس) یہ مضمون اس سے پہلے سورہ بقرہ آیت 62 اور سورہ نساء آیت ۱۵۰-۱۵۲ میں بھی گزر چکا ہے۔\n(4) یہ وہی مضمون ہے جو قرآن مجید کے مختلف مقامات پر بیان کیا گیا «وَمَآ اَكْثَرُ النَّاسِ وَلَوْ حَرَصْتَ بِمُؤْمِنِيْنَ» (سورۃ یوسف:103) ”تیری خواہش کے باوجود اکثر لوگ ایمان نہیں لائیں گے“، «وَلَقَدْ صَدَّقَ عَلَيْهِمْ إِبْلِيسُ ظَنَّهُ فَاتَّبَعُوهُ إِلا فَرِيقًا مِنَ الْمُؤْمِنِينَ» ( سورة سبأ:20) ”ابلیس نے اپنا گمان سچا کر دکھایا، مومنوں کے ایک گروہ کے سوا، سب اس کے پیروکار بن گئے“۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"afaman kāna ʿalā bayyinatin min rabbihi wayatlūhu shāhidun min'hu wamin qablihi kitābu mūsā imāman waraḥmatan ulāika yu'minūna bihi waman yakfur bihi mina al-aḥzābi fal-nāru mawʿiduhu falā taku fī mir'yatin min'hu innahu al-ḥaqu min rabbika walākinna akthara al-nāsi lā yu'minūna ","translations":["Then is he who","is","on","a clear proof","from","his Lord","and recites it","a witness","from Him","and before it","and before it","(was) a Book","(of) Musa","(as) a guide","and (as) mercy","Those","believe","in it","But whoever","disbelieves","in it","among","the sects","then the Fire","(will be) his promised (meeting) place","So (do) not","be","in","doubt","about it","Indeed, it","(is) the truth","from","your Lord","but","most","(of) the people","(do) not","believe","(17)"],"transliterationArr":["afaman","kāna","ʿalā","bayyinatin","min","rabbihi","wayatlūhu","shāhidun","min'hu","wamin","qablihi","kitābu","mūsā","imāman","waraḥmatan","ulāika","yu'minūna","bihi","waman","yakfur","bihi","mina","al-aḥzābi","fal-nāru","mawʿiduhu","falā","taku","fī","mir'yatin","min'hu","innahu","al-ḥaqu","min","rabbika","walākinna","akthara","al-nāsi","lā","yu'minūna",null],"verseTiming":[[1,0,880],[2,880,1680],[3,1680,2320],[4,2320,3040],[5,3040,4230],[6,4230,5350],[7,5350,6710],[8,6710,7980],[9,7980,9030],[10,9030,10780],[11,10780,11850],[12,11850,12880],[13,12880,13800],[14,13800,16230],[15,16230,18520],[16,18520,20030],[17,20030,22680],[18,22680,24010],[19,24010,25020],[20,25020,25560],[21,25560,26260],[22,26260,27010],[23,27010,27710],[24,27710,28060],[25,28060,29400],[26,29400,31480],[27,31480,33200],[28,33200,33770],[29,33770,34250],[30,34250,34680],[31,34680,35700],[32,35700,37540],[33,37540,39630],[34,39630,40550],[35,40550,40690],[36,40690,41830],[37,41830,43650],[38,43650,44480],[39,44480,46180],[40,46180,46590],[41,46590,49865]]}}