{"name":"11:11","price":"سوائے ان کے جو صبر کرتے ہیں اور نیک کاموں میں لگے رہتے ہیں۔ انہی لوگوں کے لئے بخشش بھی ہے اور بہت بڑا نیک(1) بدلہ بھی.","arabic":"إِلَّا ٱلَّذِينَ صَبَرُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ أُوْلَٰٓئِكَ لَهُم مَّغۡفِرَةٞ وَأَجۡرٞ كَبِيرٞ","category":["11 (Hud)","Hud","Surah Hud","Chapter Hud","Surah 11","Chapter 11","Hud","هود"],"ayahNumber":1484,"juzNumber":12,"footnotes":"(1) یعنی اہل ایمان، راحت و فراغت ہو یا تنگی اور مصیبت، دونوں حالتوں میں اللہ کے احکام کے مطابق طرز عمل اختیار کرتے ہیں جیسا کہ حدیث میں آتا ہے نبی (صلى الله عليه وسلم) نے قسم کھا کر فرمایا ”قسم ہے اس ذات کی جس کے ہاتھ میں میری جان ہے، اللہ تعالٰی مومن کے لئے جو بھی فیصلہ فرماتا ہے، اس میں اس کے لئے بہتری کا پہلو ہوتا ہے۔ اگر اس کو کئی راحت پہنچتی ہے تو اس پر اللہ کا شکر کرتا ہے اور اگر کوئی تکلیف پہنچتی ہے تو صبر کرتا ہے، یہ بھی اس کے لئے بہتر (یعنی اجر و ثواب کا باعث) ہے۔ یہ امتیاز ایک مومن کے سوا کسی کو حاصل نہیں“۔ (صحيح مسلم، كتاب الزهد، باب المؤمن أمره كله خير) اور ایک اور حدیث میں فرمایا کہ ”مومن کو جو بھی فکر و غم اور تکلیف پہنچتی ہے حتی کہ اسے کانٹا چبھتا ہے تو اللہ تعالٰی اس کی وجہ سے اس کی غلطیاں معاف فرما دیتا ہے“۔(ﻣﺴﻨﺪ ﺍﺣﻤﺪ ﺟﻠﺪ ٣ ،ﺹ٤) سورہ معاج کی آیات ۱۹-۲۲ میں بھی یہ مضمون بیان کیا گیا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"illā alladhīna ṣabarū waʿamilū al-ṣāliḥāti ulāika lahum maghfiratun wa-ajrun kabīrun ","translations":["Except","those who","(are) patient","and do","the good deeds","those","for them","(will be) forgiveness","and a reward","great","(11)"],"transliterationArr":["illā","alladhīna","ṣabarū","waʿamilū","al-ṣāliḥāti","ulāika","lahum","maghfiratun","wa-ajrun","kabīrun",null],"verseTiming":[[1,0,620],[2,620,1660],[3,1660,2600],[4,2600,3340],[5,3340,4900],[6,4900,7370],[7,7370,7840],[8,7840,10340],[9,10340,12030],[10,12030,15005]]}}