{"name":"11:114","price":"دن کے دونوں سروں میں نماز برپا رکھ اور رات کی کئی ساعتوں میں بھی(1) ، یقیناً نیکیاں برائیوں کو دور کر دیتی ہیں(2)۔ یہ نصیحت ہے نصیحت پکڑنے والوں کے لئے.","arabic":"وَأَقِمِ ٱلصَّلَوٰةَ طَرَفَيِ ٱلنَّهَارِ وَزُلَفٗا مِّنَ ٱلَّيۡلِۚ إِنَّ ٱلۡحَسَنَٰتِ يُذۡهِبۡنَ ٱلسَّيِّـَٔاتِۚ ذَٰلِكَ ذِكۡرَىٰ لِلذَّٰكِرِينَ","category":["11 (Hud)","Hud","Surah Hud","Chapter Hud","Surah 11","Chapter 11","Hud","هود"],"ayahNumber":1587,"juzNumber":12,"footnotes":"(1) ”دونوں سروں“ سے مراد بعض نے صبح اور مغرب، اور بعض نے عشاء اور مغرب دونوں کا وقت مراد لیا ہے۔ امام ابن کثیر فرماتے ہیں کہ ممکن ہے کہ یہ آیت معراج سے قبل نازل ہوئی ہو، جس میں پانچ نمازیں فرض کی گئیں۔ کیونکہ اس سے قبل صرف دو ہی نما زیں ضروری تھیں، ایک طلوع شمس سے قبل اور ایک غروب سے قبل اور رات کے پچھلے پہر میں نماز تہجد۔ پھر نماز تہجد امت سے معاف کر دی گئی، پھر اس کا وجوب بقول بعض آپ (صلى الله عليه وسلم)سے بھی ساقط کر دیا گیا۔ (ابن کثیر) وَاللهُ أَعْلَمُ۔\n(2) جس طرح کہ احادیث میں بھی اسے صراحت کے ساتھ بیان فرمایا گیا ہے۔ مثلا پانچ نمازیں، جمعہ دوسرے جمعہ تک اور رمضان دوسرے رمضان تک، ان کے مابین ہونے والے گناہوں کو دور کرنے والے ہیں، بشرطیکہ کبیرہ گناہوں سے اجتناب کیا جائے، ( صحيح مسلم- كتاب الطهارة- باب الصلوات الخمس والجمعة إلى الجمعة ..... ) ایک اور حدیث میں رسول اللہ (صلى الله عليه وسلم) نے فرمایا ”بتلاؤ! اگر تم میں سے کسی کے دروازے پر بڑی نہر ہو، وہ روزانہ اس میں پانچ مرتبہ نہاتا ہو، کیا اس کے بعد اس کے جسم پر میل کچیل باقی رہے گا؟ صحابہ نے عرض کیا ' نہیں' آپ نے فرمایا ' اسی طرح پانچ نمازیں ہیں، ان کے ذریعے سے اللہ تعالٰی گناہوں اور خطاؤں کو مٹا دیتا ہے“۔ ( بخاري- كتاب المواقيت، باب الصلوات الخمس كفارة، ومسلم كتاب المساجد، باب المشي إلى الصلاة تمحى بها الخطايا وترفع به الدرجات )","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-aqimi al-ṣalata ṭarafayi al-nahāri wazulafan mina al-layli inna al-ḥasanāti yudh'hib'na al-sayiāti dhālika dhik'rā lildhākirīna ","translations":["And establish","the prayer","(at the) two ends","(of) the day","and (at) the approach","of","the night","Indeed","the good deeds","remove","the evil deeds","That","(is) a reminder","for those who remember","(114)"],"transliterationArr":["wa-aqimi","al-ṣalata","ṭarafayi","al-nahāri","wazulafan","mina","al-layli","inna","al-ḥasanāti","yudh'hib'na","al-sayiāti","dhālika","dhik'rā","lildhākirīna",null],"verseTiming":[[1,0,870],[2,870,1940],[3,1940,2600],[4,2600,4460],[5,4460,5360],[6,5360,6690],[7,6690,7280],[8,7280,9220],[9,9220,10710],[10,10710,12090],[11,12090,13130],[12,13130,16780],[13,16780,17640],[14,17640,18490],[15,18490,21975]]}}