{"name":"11:20","price":"نہ یہ لوگ دنیا میں اللہ کو ہرا سکے اور نہ ان کا کوئی حمایتی اللہ کے سوا ہوا، ان کے لئے عذاب دگنا کیا جائے گا نہ یہ سننے کی طاقت رکھتے تھے اور نہ یہ دیکھتے ہی تھے.(1)","arabic":"أُوْلَٰٓئِكَ لَمۡ يَكُونُواْ مُعۡجِزِينَ فِي ٱلۡأَرۡضِ وَمَا كَانَ لَهُم مِّن دُونِ ٱللَّهِ مِنۡ أَوۡلِيَآءَۘ يُضَٰعَفُ لَهُمُ ٱلۡعَذَابُۚ مَا كَانُواْ يَسۡتَطِيعُونَ ٱلسَّمۡعَ وَمَا كَانُواْ يُبۡصِرُونَ","category":["11 (Hud)","Hud","Surah Hud","Chapter Hud","Surah 11","Chapter 11","Hud","هود"],"ayahNumber":1493,"juzNumber":12,"footnotes":"(1) یعنی ان کا حق سے اعراض اور بغض اس انتہا تک پہنچا ہوا تھا کہ یہ اسے سننے اور دیکھنے کی طاقت ہی نہیں رکھتے تھے یا یہ مطلب ہے کہ اللہ نے ان کو کان اور آنکھیں تو دی تھیں لیکن انہوں نے ان سے کوئی بات نہ سنی اور نہ دیکھی۔ گویا: «فَمَآ اَغْنٰى عَنْهُمْ سَمْعُهُمْ وَلَآ اَبْصَارُهُمْ وَلَآ اَفْــِٕدَتُهُمْ مِّنْ شَيْءٍ» (الاحقاف:26) ”نہ ان کے کانوں نے انہیں کوئی فائدہ پہنچایا، نہ ان کی آنکھوں اور دلوں نے“، کیونکہ وہ حق سننے سے بہرے اور حق دیکھنے سے اندھے بنے رہے، جس طرح کہ وہ جہنم میں داخل ہوتے ہوئے کہیں گے، «لَوْ كُنَّا نَسْمَعُ اَوْ نَعْقِلُ مَا كُنَّا فِيْٓ اَصْحٰبِ السَّعِيْرِ» (الملک:10) ”اگر ہم سنتے اور عقل سے کام لیتے تو آج جنہم میں نہ جاتے“۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"ulāika lam yakūnū muʿ'jizīna fī al-arḍi wamā kāna lahum min dūni al-lahi min awliyāa yuḍāʿafu lahumu al-ʿadhābu mā kānū yastaṭīʿūna al-samʿa wamā kānū yub'ṣirūna ","translations":["Those","not","will be","(able to) escape","in","the earth","and not","is","for them","besides","besides","Allah","any","protectors","And will be doubled","for them","the punishment","Not","they were","able","(to) hear","and not","they used (to)","see","(20)"],"transliterationArr":["ulāika","lam","yakūnū","muʿ'jizīna","fī","al-arḍi","wamā","kāna","lahum","min","dūni","al-lahi","min","awliyāa","yuḍāʿafu","lahumu","al-ʿadhābu","mā","kānū","yastaṭīʿūna","al-samʿa","wamā","kānū","yub'ṣirūna",null],"verseTiming":[[1,0,2920],[2,2920,3250],[3,3250,4340],[4,4340,5670],[5,5670,5920],[6,5920,6770],[7,6770,7360],[8,7360,8150],[9,8150,8750],[10,8750,9660],[11,9660,11030],[12,11030,11880],[13,11880,12280],[14,12280,16380],[15,16380,17420],[16,17420,18080],[17,18080,20850],[18,20850,21580],[19,21580,22490],[20,22490,24150],[21,24150,25140],[22,25140,25720],[23,25720,26660],[24,26660,30505]]}}