{"name":"11:24","price":"ان دونوں فرقوں کی مثال اندھے، بہرے اور دیکھنے، سننے والے جیسی ہے۔ کیا یہ دونوں مثال میں برابر ہیں؟ کیا پھر بھی تم نصیحت حاصل نہیں کرتے؟","arabic":"۞ مَثَلُ ٱلۡفَرِيقَيۡنِ كَٱلۡأَعۡمَىٰ وَٱلۡأَصَمِّ وَٱلۡبَصِيرِ وَٱلسَّمِيعِۚ هَلۡ يَسۡتَوِيَانِ مَثَلًاۚ أَفَلَا تَذَكَّرُونَ","category":["11 (Hud)","Hud","Surah Hud","Chapter Hud","Surah 11","Chapter 11","Hud","هود"],"ayahNumber":1497,"juzNumber":12,"footnotes":"(1) پچھلی آیات میں مومنین اور کافرین اور سعادت مندوں اور بدبختوں، دونوں کا تذکرہ فرمایا۔ اب اس میں دونوں کی مثال بیان فرما کر دونوں کی حقیقت کو مزید واضح کیا جا رہا ہے۔ فرمایا، ایک کی مثال اندھے اور بہرے کی طرح ہے اور دوسرے کی دیکھنے اور سننے والے کی طرح۔ کافر دنیا میں حق کا روئے زیبا دیکھنے سے محروم اور آخرت میں نجات کے راستہ سے بےبہرہ، اسی طرح حق کے دلائل سننے سے بےبہرہ ہوتا ہے، اسی لئے ایسی باتوں سے محروم رہتا ہے جو اس کے لئے مفید ہوں۔ اس کے برعکس مومن سمجھ دار، حق کو دیکھنے والا اور حق اور باطل کے درمیان تمیز کرنے والا ہوتا ہے۔ چنانچہ وہ حق اور خیر کی پیروی کتا ہے، دلائل کو سنتا اور ان کے ذریعے سے شبہات کا ازالہ کرتا اور باطل سے اجتناب کرتا ہے، کیا یہ دونوں برابر ہو سکتے ہیں؟ استفہام نفی کے لیے ہے۔ یعنی دونوں برابر نہیں ہو سکتے۔ جیسے دوسرے مقام پر فرمایا۔«لا يَسْتَوِي أَصْحَابُ النَّارِ وَأَصْحَابُ الْجَنَّةِ أَصْحَابُ الْجَنَّةِ هُمُ الْفَائِزُونَ» (الحشر:20) ”جنتی دوزخی برابر نہیں ہو سکتے جنتی تو کامیاب ہونے والے ہیں“، ایک اور مقام پر اسے اس طرح بیان فرمایا ”اندھا اور دیکھنے والا برابر نہیں۔ اندھیرے اور روشنی، سایہ اور دھوپ برابر نہیں، زندے اور مردے برابر نہیں“۔ (سورہ فاطر:۱۹-۲۰)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"mathalu al-farīqayni kal-aʿmā wal-aṣami wal-baṣīri wal-samīʿi hal yastawiyāni mathalan afalā tadhakkarūna ","translations":["(The) example","(of) the two parties","(is) like the blind","and the deaf","and the seer","and the hearer","Are","they equal","(in) comparison","Then, will not","you take heed","(24)"],"transliterationArr":["mathalu","al-farīqayni","kal-aʿmā","wal-aṣami","wal-baṣīri","wal-samīʿi","hal","yastawiyāni","mathalan","afalā","tadhakkarūna",null],"verseTiming":[[1,0,680],[2,680,2280],[3,2280,3490],[4,3490,5410],[5,5410,6660],[6,6660,10160],[7,10160,10500],[8,10500,12040],[9,12040,13100],[10,13100,14400],[11,14400,18695]]}}