{"name":"11:27","price":"اس کی قوم کے کافروں کے سرداروں نے جواب دیا کہ ہم تو تجھے اپنے جیسا انسان ہی دیکھتے ہیں(1) اور تیرے تابعداروں کو بھی ہم دیکھتے ہیں کہ یہ لوگ واضح طور پر سوائے نیچ(2) لوگوں کے(3) اور کوئی نہیں جو بے سوچے سمجھے (تمہاری پیروی کر رہے ہیں)، ہم تو تمہاری کسی قسم کی برتری اپنے اوپر نہیں دیکھ رہے، بلکہ ہم تو تمہیں جھوٹا سمجھ رہے ہیں۔","arabic":"فَقَالَ ٱلۡمَلَأُ ٱلَّذِينَ كَفَرُواْ مِن قَوۡمِهِۦ مَا نَرَىٰكَ إِلَّا بَشَرٗا مِّثۡلَنَا وَمَا نَرَىٰكَ ٱتَّبَعَكَ إِلَّا ٱلَّذِينَ هُمۡ أَرَاذِلُنَا بَادِيَ ٱلرَّأۡيِ وَمَا نَرَىٰ لَكُمۡ عَلَيۡنَا مِن فَضۡلِۭ بَلۡ نَظُنُّكُمۡ كَٰذِبِينَ","category":["11 (Hud)","Hud","Surah Hud","Chapter Hud","Surah 11","Chapter 11","Hud","هود"],"ayahNumber":1500,"juzNumber":12,"footnotes":"(1) یہ وہی شبہ ہے، جس کی پہلے کئی جگہ وضاحت کی جا چکی ہے کہ کافروں کے نزدیک بشریت کے ساتھ نبوت و رسالت کا اجتماع بڑا عجیب تھا، جس طرح آج کے اہل بدعت کو بھی عجیب لگتا ہے اور وہ بشریت رسول (صلى الله عليه وسلم) کا انکار کرتے ہیں۔\n(2) حق کی تاریخ میں یہ بات بھی ہر دور میں سامنے آتی رہی ہے کہ ابتداء میں اس کو اپنانے والے ہمیشہ وہ لوگ ہوتے ہیں جنہیں معاشرے میں بےنوا کم تر سمجھا جاتا تھا اور صاحب حیثیت اور خوش حال طبقہ اس سے محروم رہتا۔ حتی کہ پیغمبروں کے پیروکاروں کی علامت بن گئی۔ چنانچہ شاہ روم ہرقل نے حضرت ابو سفیان (رضي الله عنه) سے نبی (صلى الله عليه وسلم) کی بابت پوچھا تو اس میں ان سے ایک بات یہ بھی پوچھی کہ ”اس کے پیروکار معاشرے کے معزز سمجھے جانے والے لوگ ہیں یا کمزور لوگ“ حضرت ابو سفیان (رضي الله عنه) نے جواب میں کہا ”کمزور لوگ“ جس پر ہرقل نے کہا ”رسولوں کے پیروکار یہی لوگ ہوتے ہیں“۔ (صحیح بخاری حدیث نمبر 7) قرآن کریم میں بھی وضاحت کی گئی ہے کہ خوش حال طبقہ ہی سب سے پہلے پیغمبروں کی تکذیب کرتا رہا ہے۔ (سورہ زخرف: ۲۳) اور یہ اہل ایمان کی دنیاوی حیثیت تھی اور جس کے اعتبار سے اہل کفر انہیں حقیر اور کم تر سمجھتے تھے، ورنہ حقیقت تو یہ ہے کہ حق کے پیروکار معزز اور اشراف ہیں چاہے وہ مال و دولت کے اعتبار سے فروتر ہی ہوں اور حق کا انکار کرنے والے حقیر اور بےحیثیت ہیں چاہے وہ دنیوں اعتبار سے مال دار ہی ہوں۔\n(3) اہل ایمان چونکہ، اللہ اور رسول کے احکام کے مقابلے میں اپنی عقل و دانش اور رائے کا استعمال نہیں کرتے، اس لئے اہل باطل یہ سمجھتے ہیں کہ یہ بےسوچ سمجھ والے ہیں کہ اللہ کا رسول انہیں جس طرف موڑ دیتا ہے، یہ مڑ جاتے ہیں جس چیز سے روک دیتا ہے، رک جاتے ہیں۔ یہ بھی اہل ایمان کی ایک بڑی بلکہ ایمان کا لازمی تقاضا ہے۔ لیکن اہل کفر و باطل کے نزدیک یہ خوبی بھی ”عیب“ ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"faqāla al-mala-u alladhīna kafarū min qawmihi mā narāka illā basharan mith'lanā wamā narāka ittabaʿaka illā alladhīna hum arādhilunā bādiya al-rayi wamā narā lakum ʿalaynā min faḍlin bal naẓunnukum kādhibīna ","translations":["So said","the chiefs","(of) those who","disbelieved","from","his people","Not","we see you","but","a man","like us","and not","we see you","followed [you]","except","those who","[they]","(are) the lowest of us","immature in opinion","immature in opinion","And not","we see","in you","over us","any","merit","nay","we think you","(are) liars","(27)"],"transliterationArr":["faqāla","al-mala-u","alladhīna","kafarū","min","qawmihi","mā","narāka","illā","basharan","mith'lanā","wamā","narāka","ittabaʿaka","illā","alladhīna","hum","arādhilunā","bādiya","al-rayi","wamā","narā","lakum","ʿalaynā","min","faḍlin","bal","naẓunnukum","kādhibīna",null],"verseTiming":[[1,0,870],[2,870,1660],[3,1660,2710],[4,2710,3520],[5,3520,4510],[6,4510,5600],[7,5600,6030],[8,6030,6850],[9,6850,7660],[10,7660,8320],[11,8320,10040],[12,10040,10660],[13,10660,11520],[14,11520,12540],[15,12540,13130],[16,13130,14230],[17,14230,14630],[18,14630,16080],[19,16080,16890],[20,16890,17760],[21,17760,18400],[22,18400,19060],[23,19060,19630],[24,19630,20740],[25,20740,21740],[26,21740,22250],[27,22250,23590],[28,23590,24180],[29,24180,24770],[30,24770,25850],[31,25850,27120],[32,27120,28810],[33,28810,29250],[34,29250,31250],[35,31250,34365]]}}