{"name":"11:37","price":"اورایک کشتی ہماری آنکھوں کے سامنے اور ہماری وحی سے تیار کر(1) اور ﻇالموں کے بارے میں ہم سے کوئی بات چیت نہ کر وه پانی میں ڈبو دیئے جانے والے ہیں۔(2)","arabic":"وَٱصۡنَعِ ٱلۡفُلۡكَ بِأَعۡيُنِنَا وَوَحۡيِنَا وَلَا تُخَٰطِبۡنِي فِي ٱلَّذِينَ ظَلَمُوٓاْ إِنَّهُم مُّغۡرَقُونَ","category":["11 (Hud)","Hud","Surah Hud","Chapter Hud","Surah 11","Chapter 11","Hud","هود"],"ayahNumber":1510,"juzNumber":12,"footnotes":"(1) ”یعنی ہماری آنکھوں کے سامنے“ اور ”ہماری دیکھ بھال میں“ اس آیت میں اللہ رب العزت کے لئے صفت 'عین' کا اثبات ہے جس پر ایمان رکھنا ضروری ہے اور 'ہماری وحی سے' کا مطلب، اس کے طول و عرض وغیرہ کی جو کیفیات ہم نے بتلائی ہیں، اس طرح اسے بنا۔ اس مقام پر بعض مفسرین نے کشتی کے طول و عرض، اس کی منزلوں اور کس قسم کی لکڑی اور دیگر سامان اس میں استعمال کیا گیا، اس کی تفصیل بیان کی ہے، جو ظاہر بات ہے کہ کسی مستند ماخذ پر مبنی نہیں ہے۔ اس کی پوری تفصیل کا صحیح علم صرف اللہ ہی کو ہے۔\n(2) بعض نے اس سے مراد حضرت نوح (عليه السلام) کے بیٹے اور اہلیہ کو لیا ہے جو مومن نہیں تھے اور غرق ہونے والوں میں سے تھے۔ بعض نے اس سے غرق ہونے والی پوری قوم مراد لی ہے اور مطلب یہ ہے کہ ان کے لئے کوئی مہلت طلب مت کرنا کیونکہ اب ان کے ہلاک ہونے کا وقت آ گیا ہے یا یہ مطلب ہے کہ ان کی ہلاکت کے لئے جلدی نہ کریں، وقت مقرر میں یہ سب غرق ہو جائیں گے۔ (فتح القدیر)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-iṣ'naʿi al-ful'ka bi-aʿyuninā wawaḥyinā walā tukhāṭib'nī fī alladhīna ẓalamū innahum mugh'raqūna ","translations":["And construct","the ship","under Our Eyes","and Our inspiration","and (do) not","address Me","concerning","those who","wronged","indeed, they (are)","the ones (to be) drowned","(37)"],"transliterationArr":["wa-iṣ'naʿi","al-ful'ka","bi-aʿyuninā","wawaḥyinā","walā","tukhāṭib'nī","fī","alladhīna","ẓalamū","innahum","mugh'raqūna",null],"verseTiming":[[1,0,900],[2,900,1700],[3,1700,3170],[4,3170,4410],[5,4410,4970],[6,4970,6490],[7,6490,6710],[8,6710,7730],[9,7730,8780],[10,8780,11350],[11,11350,15545]]}}