{"name":"11:34","price":"تمہیں میری خیر خواہی کچھ بھی نفع نہیں دے سکتی، گو میں کتنی ہی تمہاری خیر خواہی کیوں نہ چاہوں، بشرطیکہ اللہ کا اراده تمہیں گمراه کرنے کا ہو(1) ، وہی تم سب کا پروردگار ہے(2) اور اسی کی طرف لوٹائے جاؤ گے۔","arabic":"وَلَا يَنفَعُكُمۡ نُصۡحِيٓ إِنۡ أَرَدتُّ أَنۡ أَنصَحَ لَكُمۡ إِن كَانَ ٱللَّهُ يُرِيدُ أَن يُغۡوِيَكُمۡۚ هُوَ رَبُّكُمۡ وَإِلَيۡهِ تُرۡجَعُونَ","category":["11 (Hud)","Hud","Surah Hud","Chapter Hud","Surah 11","Chapter 11","Hud","هود"],"ayahNumber":1507,"juzNumber":12,"footnotes":"(1) إِغْوَاءٌ بمعنی اضلال (گمراہ کرنا ہے)۔ یعنی تمہارا کفر وجحود اگر اس مقام پر پہنچ چکا ہے، جہاں سے کسی انسان کو پلٹ کر آنا اور ہدایت کو اپنا لینا ناممکن ہے، تو اسی کیفیت کو اللہ تعالٰی کی طرف سے مہر لگا دینا کہا جاتا ہے، جس کے بعد ہدایت کی کوئی امید باقی نہیں رہ جاتی۔ مطلب یہ ہے کہ اگر تم بھی اسی خطرناک موڑ تک پہنچ چکے ہو تو پھر میں تمہاری خیر خواہی بھی کرنی چاہوں یعنی ہدایت پر لانے کی اور زیادہ کوشش کروں، تو یہ کوشش اور خیر خواہی تمہارے لئے مفید نہیں، کیونکہ تم گمراہی کے آخری مقام پر پہنچ چکے ہو۔\n(2) ہدایت اور گمراہی بھی اسی کے ہاتھ میں ہے اور اسی کی طرف تم سب کو لوٹ کر جانا ہے، جہاں وہ تمہیں تمہارے عملوں کی جزا دے گا۔ نیکوں کو انکے نیک عمل کی جزا اور بروں کو ان کی برائی کی سزا دے گا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walā yanfaʿukum nuṣ'ḥī in aradttu an anṣaḥa lakum in kāna al-lahu yurīdu an yugh'wiyakum huwa rabbukum wa-ilayhi tur'jaʿūna ","translations":["And (will) not","benefit you","my advice","(even) if","I wish","to","[I] advise","[to] you","if","it was Allah's","it was Allah's","will","to","let you go astray","He (is)","your Lord","and to Him","you will be returned","(34)"],"transliterationArr":["walā","yanfaʿukum","nuṣ'ḥī","in","aradttu","an","anṣaḥa","lakum","in","kāna","al-lahu","yurīdu","an","yugh'wiyakum","huwa","rabbukum","wa-ilayhi","tur'jaʿūna",null],"verseTiming":[[1,0,790],[2,790,2860],[3,2860,5460],[4,5460,5840],[5,5840,6680],[6,6680,7040],[7,7040,8820],[8,8820,9420],[9,9420,10470],[10,10470,11070],[11,11070,12010],[12,12010,12870],[13,12870,13100],[14,13100,15760],[15,15760,16180],[16,16180,17320],[17,17320,18360],[18,18360,21735]]}}