{"name":"11:40","price":"یہاں تک کہ جب ہمارا حکم آپہنچا اور تنور ابلنے لگا(1) ہم نے کہا کہ اس کشتی میں ہر قسم کے (جانداروں میں سے) جوڑے (یعنی) دو (جانور، ایک نر اور ایک ماده) سوار کرا لے(2) اور اپنے گھر کے لوگوں کو بھی، سوائے ان کے جن پر پہلے سے بات پڑ چکی ہے(3) اور سب ایمان والوں کو بھی(4)، اس کے ساتھ ایمان ﻻنے والے بہت ہی کم تھے۔(5)","arabic":"حَتَّىٰٓ إِذَا جَآءَ أَمۡرُنَا وَفَارَ ٱلتَّنُّورُ قُلۡنَا ٱحۡمِلۡ فِيهَا مِن كُلّٖ زَوۡجَيۡنِ ٱثۡنَيۡنِ وَأَهۡلَكَ إِلَّا مَن سَبَقَ عَلَيۡهِ ٱلۡقَوۡلُ وَمَنۡ ءَامَنَۚ وَمَآ ءَامَنَ مَعَهُۥٓ إِلَّا قَلِيلٞ","category":["11 (Hud)","Hud","Surah Hud","Chapter Hud","Surah 11","Chapter 11","Hud","هود"],"ayahNumber":1513,"juzNumber":12,"footnotes":"(1) اس سے بعض نے روٹی پکانے والے تنور، بعض نے مخصوص جگہیں مثلا عین الوردہ اور بعض نے سطح زمین مراد لی ہے۔ حافظ ابن کثیر نے اسی آخری مفہوم کو ترجیح دی ہے یعنی ساری زمین ہی چشموں کی طرح ابل پڑی، اوپر سے آسمان کی بارش نے رہی سہی کسر پوری کر دی۔\n(2) اس سے مراد مذکر اور مؤنث یعنی نر مادہ ہے اس طرح ہر ذی روح مخلوق کا جوڑا کشتی میں رکھ لیا گیا اور بعض کہتے ہیں کہ نباتات بھی رکھے گئے تھے۔ وللہ اعلم۔\n(3) یعنی جن کا غرق ہونا تقدیر الٰہی میں ثبت ہے اس سے مراد عام کفار ہیں، یا یہ استشناء ”أَهْلَكَ“ سے ہے یعنی اپنے گھر والوں کو بھی کشتی میں سوار کرا لے، سوائے ان کے جن پر اللہ کی بات سبقت کر گئی ہے یعنی ایک بیٹا (کنعان یا۔ یام) اور حضرت نوح (عليه السلام) کی اہلیہ (وَاعِلَة) یہ دونوں کافر تھے، ان کو کشتی میں بیٹھنے والوں سے مستشنٰی کر دیا گیا۔\n(4) یعنی سب اہل ایمان کو کشتی میں سوار کرا لے۔\n(5) بعض نے ان کی کل تعداد (مرد اور عورت ملا کر) ٨٠ اور بعض نے اس سے بھی کم بتلائی ہے۔ ان میں حضرت نوح (عليه السلام) کے تین بیٹے، جو ایمان والوں میں شامل تھے، سام، حام، یافت اور ان کی بیویاں اور چوتھی بیوی، یام کی تھی، جو کافر تھا، لیکن اس کی بیوی مسلمان ہونے کی وجہ سے کشتی میں سوار تھی۔ (ابن کثیر)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"ḥattā idhā jāa amrunā wafāra al-tanūru qul'nā iḥ'mil fīhā min kullin zawjayni ith'nayni wa-ahlaka illā man sabaqa ʿalayhi al-qawlu waman āmana wamā āmana maʿahu illā qalīlun ","translations":["Till","when","came","Our command","and overflowed","the oven","We said","Load","in it","of","every kind","a pair","two","and your family","except","who","has preceded","against him","the word","and whoever","believed","And not","believed","with him","except","a few","(40)"],"transliterationArr":["ḥattā","idhā","jāa","amrunā","wafāra","al-tanūru","qul'nā","iḥ'mil","fīhā","min","kullin","zawjayni","ith'nayni","wa-ahlaka","illā","man","sabaqa","ʿalayhi","al-qawlu","waman","āmana","wamā","āmana","maʿahu","illā","qalīlun",null],"verseTiming":[[1,0,2400],[2,2400,3030],[3,3030,5180],[4,5180,6170],[5,6170,7010],[6,7010,9080],[7,9080,9610],[8,9610,10280],[9,10280,11210],[10,11210,12460],[11,12460,14140],[12,14140,15260],[13,15260,18490],[14,18490,19290],[15,19290,19920],[16,19920,20820],[17,20820,21770],[18,21770,23300],[19,23300,24420],[20,24420,25290],[21,25290,26410],[22,26410,27220],[23,27220,28180],[24,28180,28910],[25,28910,29750],[26,29750,30640],[27,30640,31180],[28,31180,31950],[29,31950,34830],[30,34830,35720],[31,35720,38200],[32,38200,39000],[33,39000,40140],[34,40140,41925]]}}