{"name":"11:41","price":"نوح ﴿علیہ السلام﴾ نے کہا، اس کشتی میں بیٹھ جاؤ اللہ ہی کے نام سے اس کا چلنا اور ٹھہرنا ہے(1) ، یقیناً میرا رب بڑی بخشش اور بڑے رحم واﻻ ہے۔","arabic":"۞ وَقَالَ ٱرۡكَبُواْ فِيهَا بِسۡمِ ٱللَّهِ مَجۡر۪ىٰهَا وَمُرۡسَىٰهَآۚ إِنَّ رَبِّي لَغَفُورٞ رَّحِيمٞ","category":["11 (Hud)","Hud","Surah Hud","Chapter Hud","Surah 11","Chapter 11","Hud","هود"],"ayahNumber":1514,"juzNumber":12,"footnotes":"(1) یعنی اللہ ہی کے نام سے اس کا پانی کی سطح پر چلنا اور اسی کے نام پر اس کا ٹھہرنا ہے۔ اس سے ایک مقصد اہل ایمان کو تسلی اور حوصلہ دینا بھی تھا کہ بلا خوف و خطر کشتی میں سوار ہو جاؤ، اللہ تعالٰی ہی اس کشتی کا محافظ اور نگران ہے اسی کے حکم سے چلے گی اور اسی کے حکم سے ٹھہرے گی۔ جس طرح اللہ تعالٰی نے دوسرے مقام پر فرمایا کہ 'اے نوح! جب تو اور تیرے ساتھی کشتی میں آرام سے بیٹھ جائیں تو کہو «الْحَمْدُ لِلَّهِ الَّذِي نَجَّانَا مِنَ الْقَوْمِ الظَّالِمِينَ، وَقُلْ رَبِّ أَنْزِلْنِي مُنْزَلا مُبَارَكًا وَأَنْتَ خَيْرُ الْمُنْزِلِينَ» (المومنون: 28،29) ”سب تعریف اللہ ہی کے لئے ہے، جس نے ہمیں ظالم لوگوں سے نجات عطا فرمائی اور کہہ کہ اے میرے رب! مجھے بابرکت اتارنا اتار اور تو ہی بہتر اتارنے والا ہے“۔\nبعض علماء نے کشتی یا سواری پر بیٹھتے وقت «بِسْمِ اللَّهِ مَجْرَاهَا وَمُرْسَاهَا» کا پڑھنا مستحب قرار دیا ہے، مگر حدیث سے «سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ، وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ» (الزخرف: 13) پڑھنا ثابت ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waqāla ir'kabū fīhā bis'mi al-lahi majrahā wamur'sāhā inna rabbī laghafūrun raḥīmun ","translations":["And he said","Embark","in it","in the name","of Allah","(is) its course","and its anchorage","Indeed","my Lord","(is) certainly Oft-Forgiving","Most Merciful","(41)"],"transliterationArr":["waqāla","ir'kabū","fīhā","bis'mi","al-lahi","majrahā","wamur'sāhā","inna","rabbī","laghafūrun","raḥīmun",null],"verseTiming":[[1,0,920],[2,920,1780],[3,1780,2650],[4,2650,3320],[5,3320,4150],[6,4150,5460],[7,5460,7190],[8,7190,9110],[9,9110,9990],[10,9990,11030],[11,11030,14565]]}}