{"name":"11:46","price":"اللہ تعالیٰ نے فرمایا اے نوح یقیناً وه تیرے گھرانے سے نہیں ہے(1) ، اس کے کام بالکل ہی ناشائستہ ہیں(2) تجھے ہرگز وه چیز نہ مانگنی چاہئے جس کا تجھے مطلقاً علم نہ ہو(3) میں تجھے نصیحت کرتا ہوں کہ تو جاہلوں میں سے اپنا شمار کرانے سے باز رہے۔(4)","arabic":"قَالَ يَٰنُوحُ إِنَّهُۥ لَيۡسَ مِنۡ أَهۡلِكَۖ إِنَّهُۥ عَمَلٌ غَيۡرُ صَٰلِحٖۖ فَلَا تَسۡـَٔلۡنِ مَا لَيۡسَ لَكَ بِهِۦ عِلۡمٌۖ إِنِّيٓ أَعِظُكَ أَن تَكُونَ مِنَ ٱلۡجَٰهِلِينَ","category":["11 (Hud)","Hud","Surah Hud","Chapter Hud","Surah 11","Chapter 11","Hud","هود"],"ayahNumber":1519,"juzNumber":12,"footnotes":"(1) حضرت نوح (عليه السلام) نے قرابت نسبی کا لحاظ کرتے ہوئے اسے اپنا بیٹا قرار دیا۔ لیکن اللہ تعالٰی نے ایمان کی بنیاد پر قرابت دین کے اعتبار سے اس بات کی نفی فرمائی کہ وہ تیرے گھرانے سے ہے۔ اس لئے کہ ایک نبی کا اصل گھرانہ تو وہی ہے جو اس پر ایمان لائے، چاہے وہ کوئی بھی ہو۔ اور اگر کوئی ایمان نہ لائے تو چاہے وہ نبی کا باپ ہو، بیٹا ہو یا بیوی، وہ نبی کے گھرانے کا فرد نہیں۔\n(2) یہ اللہ تعالٰی نے اس کی علت بیان فرما دی۔ اس سے معلوم ہوا کہ جس کے پاس ایمان اور عمل صالح نہیں ہوگا، اسے اللہ کے عذاب سے اللہ کا پیغمبر بھی بچانے پر قادر نہیں۔ آج کل لوگ پیروں، فقیروں اور سجادہ نشینوں سے وابستگی کو ہی نجات کے لیے کافی سمجھتے ہیں اور عمل صالح کی ضرورت ہی نہیں سمجھتے حالانکہ جب عمل صالح کے بغیر نبی سے نسبی قرابت بھی کام نہیں آتی، تو یہ وابستگیاں کیا کام آ سکتی ہیں۔\n(3) اس سے معلوم ہوا کہ نبی عالم الغیب نہیں ہوتا، اس کو اتنا ہی علم ہوتا ہے جتنا وحی کے ذریعے سے اللہ تعالٰی اسے عطا فرما دیتا ہے۔ اگر حضرت نوح (عليه السلام) کو پہلے سے علم ہوتا کہ ان کی درخواست قبول نہیں ہوگی تو یقینا وہ اس سے پرہیز فرماتے۔\n(4) یہ اللہ تعالٰی کی طرف سے حضرت نوح (عليه السلام) کو نصیحت ہے، جس کا مقصد ان کو اس مقام بلند پر فائز کرنا ہے جو علمائے عالمین کے لئے اللہ کی بارگاہ میں ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qāla yānūḥu innahu laysa min ahlika innahu ʿamalun ghayru ṣāliḥin falā tasalni mā laysa laka bihi ʿil'mun innī aʿiẓuka an takūna mina al-jāhilīna ","translations":["He said","O Nuh","Indeed, he","(is) not","of","your family","indeed, [he]","(his) deed","(is) other than","righteous","so (do) not","ask Me","(about) what","not","you have","of it","any knowledge","Indeed, I","admonish you","lest","you be","among","the ignorant","(46)"],"transliterationArr":["qāla","yānūḥu","innahu","laysa","min","ahlika","innahu","ʿamalun","ghayru","ṣāliḥin","falā","tasalni","mā","laysa","laka","bihi","ʿil'mun","innī","aʿiẓuka","an","takūna","mina","al-jāhilīna",null],"verseTiming":[[1,0,690],[2,690,1770],[3,1770,3700],[4,3700,4410],[5,4410,4830],[6,4830,6550],[7,6550,8300],[8,8300,9100],[9,9100,9730],[10,9730,11250],[11,11250,11930],[12,11930,13050],[13,13050,13450],[14,13450,14120],[15,14120,14500],[16,14500,15150],[17,15150,16220],[18,16220,19170],[19,19170,20090],[20,20090,20950],[21,20950,21850],[22,21850,22250],[23,22250,25455]]}}