{"name":"11:48","price":"فرما دیا گیا کہ اے نوح! ہماری جانب سے سلامتی اور ان برکتوں کے ساتھ اتر(1) ، جو تجھ پر ہیں اور تیرے ساتھ کی بہت سی جماعتوں پر(2) اور بہت سی وه امتیں ہوں گی جنہیں ہم فائده تو ضرور پہنچائیں گے لیکن پھر انہیں ہماری طرف سے دردناک عذاب پہنچے گا۔(3)","arabic":"قِيلَ يَٰنُوحُ ٱهۡبِطۡ بِسَلَٰمٖ مِّنَّا وَبَرَكَٰتٍ عَلَيۡكَ وَعَلَىٰٓ أُمَمٖ مِّمَّن مَّعَكَۚ وَأُمَمٞ سَنُمَتِّعُهُمۡ ثُمَّ يَمَسُّهُم مِّنَّا عَذَابٌ أَلِيمٞ","category":["11 (Hud)","Hud","Surah Hud","Chapter Hud","Surah 11","Chapter 11","Hud","هود"],"ayahNumber":1521,"juzNumber":12,"footnotes":"(1) یہ اترنا کشتی سے یا اس پہاڑ سے ہے جس پر کشتی جا کر ٹھہر گئی تھی۔\n(2) اس سے مراد یا تو وہ گروہ ہیں جو حضرت نوح (عليه السلام) کے ساتھ کشتی میں سوار تھے، یا آئندہ ہونے والے وہ گروہ ہیں جو ان کی نسل سے ہونے والے تھے، اگلے فقرے کے پیش نظر یہی دوسرا مفہوم زیادہ صحیح ہے۔\n(3) یہ وہ گروہ ہیں جو کشتی میں بچ جانے والوں کی نسل سے قیامت تک ہوں گے۔ مطلب یہ ہے کہ ان کافروں کو دنیا کی چند روزہ زندگی گزارنے کے لئے ہم دنیا کا سازو سامان ضرور دیں گے لیکن بالآخر عذاب الیم سے دو چار ہوں گے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qīla yānūḥu ih'biṭ bisalāmin minnā wabarakātin ʿalayka waʿalā umamin mimman maʿaka wa-umamun sanumattiʿuhum thumma yamassuhum minnā ʿadhābun alīmun ","translations":["It was said","O Nuh","Go down","with peace","from Us","and blessings","on you","and on","the nations","from those","with you","But (to other) nations","We will grant enjoyment","then","will touch them","from Us","a punishment","painful","(48)"],"transliterationArr":["qīla","yānūḥu","ih'biṭ","bisalāmin","minnā","wabarakātin","ʿalayka","waʿalā","umamin","mimman","maʿaka","wa-umamun","sanumattiʿuhum","thumma","yamassuhum","minnā","ʿadhābun","alīmun",null],"verseTiming":[[1,0,810],[2,810,1860],[3,1860,2510],[4,2510,3670],[5,3670,5840],[6,5840,7230],[7,7230,8210],[8,8210,10440],[9,10440,11160],[10,11160,13730],[11,13730,15340],[12,15340,17689],[13,17689,19389],[14,19389,20829],[15,20829,22239],[16,22239,24619],[17,24619,25769],[18,25769,28834]]}}