{"name":"11:49","price":"یہ خبریں غیب کی خبروں میں سے ہیں جن کی وحی ہم آپ کی طرف کرتے ہیں انہیں اس سے پہلے آپ جانتے تھے اور نہ آپ کی قوم(1) ، اس لئے آپ صبر کرتے رہیئے (یقین مانیئے) کہ انجام کار پرہیزگاروں کے لئے ہی ہے۔(2)","arabic":"تِلۡكَ مِنۡ أَنۢبَآءِ ٱلۡغَيۡبِ نُوحِيهَآ إِلَيۡكَۖ مَا كُنتَ تَعۡلَمُهَآ أَنتَ وَلَا قَوۡمُكَ مِن قَبۡلِ هَٰذَاۖ فَٱصۡبِرۡۖ إِنَّ ٱلۡعَٰقِبَةَ لِلۡمُتَّقِينَ","category":["11 (Hud)","Hud","Surah Hud","Chapter Hud","Surah 11","Chapter 11","Hud","هود"],"ayahNumber":1522,"juzNumber":12,"footnotes":"(1) یہ نبی سے خطاب ہے اور آپ سے علم غیب کی نفی کی جا رہی ہے کہ یہ غیب کی خبریں ہیں جن سے ہم آپ کو خبردار کر رہے ہیں ورنہ آپ اور آپ کی قوم ان سے لا علم تھی۔\n(2) یعنی آپکی قوم آپ کی جو تکذیب کر رہی ہے اور آپ کو ایذائیں پہنچا رہی ہے، اس پر صبر سے کام لیجئے اس لئے کہ آپ کے مددگار ہیں اور حسن انجام آپ کے اور آپ کے پیرو کاروں کے لئے ہی ہے، جو تقویٰ کی صفت سے متصف ہیں۔ عاقبت، دنیا و آخرت کے اچھے انجام کو کہتے ہیں۔ اس میں متقین کی بڑی بشارت ہے کہ ابتدا میں چاہے انہیں کتنا بھی مشکلات سے دوچار ہونا پڑے، تاہم بالآخر اللہ کی مدد و نصرت اور حسن انجام کے وہی مستحق ہیں جس طرح دوسرے مقام پر فرمایا «اِنَّا لَنَنْصُرُ رُسُلَنَا وَالَّذِيْنَ اٰمَنُوْا فِي الْحَيٰوةِ الدُّنْيَا وَيَوْمَ يَقُوْمُ الْاَشْهَادُ» (المومن: 51) ”ہم اپنے رسولوں کی اور ایمان والو کی مدد، دنیا میں بھی کریں گے اور اس دن بھی جب گواہی دینے والے کھڑے ہوں گے“۔ « وَلَقَدْ سَبَقَتْ كَلِمَتُنَا لِعِبَادِنَا الْمُرْسَلِينَ، إِنَّهُمْ لَهُمُ الْمَنْصُورُونَ، وَإِنَّ جُنْدَنَا لَهُمُ الْغَالِبُونَ» (الصافات :171 تا 172) ”اور البتہ وعدہ پہلے ہی اپنے رسولوں کے لیے صادر ہو چکا ہے کہ وہ مظفر منصور ہوں گے اور ہمارا ہی لشکر غالب اور برتر رہے گا“۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"til'ka min anbāi al-ghaybi nūḥīhā ilayka mā kunta taʿlamuhā anta walā qawmuka min qabli hādhā fa-iṣ'bir inna al-ʿāqibata lil'muttaqīna ","translations":["This","(is) from","the news","(of) the unseen","(which) We reveal","to you","Not","you were","knowing it","you","and not","your people","from","before","this","So be patient","indeed","the end","(is) for the God fearing","(49)"],"transliterationArr":["til'ka","min","anbāi","al-ghaybi","nūḥīhā","ilayka","mā","kunta","taʿlamuhā","anta","walā","qawmuka","min","qabli","hādhā","fa-iṣ'bir","inna","al-ʿāqibata","lil'muttaqīna",null],"verseTiming":[[1,0,740],[2,740,1110],[3,1110,4790],[4,4790,5550],[5,5550,8430],[6,8430,11330],[7,11330,11780],[8,11780,13410],[9,13410,16490],[10,16490,17820],[11,17820,18430],[12,18430,19380],[13,19380,20450],[14,20450,21090],[15,21090,21910],[16,21910,22810],[17,22810,24850],[18,24850,26340],[19,26340,31375]]}}