{"name":"11:52","price":"اے میری قوم کے لوگو! تم اپنے پالنے والے سے اپنی تقصیروں کی معافی طلب کرو اور اس کی جناب میں توبہ کرو، تاکہ وه برسنے والے بادل تم پر بھیج دے اور تمہاری طاقت پر اور طاقت قوت بڑھا دے(1) اور تم جرم کرتے ہوئے روگردانی نہ کرو۔(2)","arabic":"وَيَٰقَوۡمِ ٱسۡتَغۡفِرُواْ رَبَّكُمۡ ثُمَّ تُوبُوٓاْ إِلَيۡهِ يُرۡسِلِ ٱلسَّمَآءَ عَلَيۡكُم مِّدۡرَارٗا وَيَزِدۡكُمۡ قُوَّةً إِلَىٰ قُوَّتِكُمۡ وَلَا تَتَوَلَّوۡاْ مُجۡرِمِينَ","category":["11 (Hud)","Hud","Surah Hud","Chapter Hud","Surah 11","Chapter 11","Hud","هود"],"ayahNumber":1525,"juzNumber":12,"footnotes":"(1) حضرت ہود (عليه السلام) نے توبہ و استغفار کی تلقین اپنی امت یعنی اپنی قوم کو کی اور اس کے دو فوائد بیان فرمائے جو توبہ اور استغفار کرنے والی قوم کو حاصل ہوتے ہیں۔ جس طرح قرآن کریم اور بھی بعض مقامات پر یہ فوائد بیان کئے گئے ہیں (ملاحظہ سورۂ نوح: 11) اور نبی (صلى الله عليه وسلم) کا بھی فرمان ہے «مَنْ لَزِمَ الاسْتِغْفَارَ جَعَلَ اللهُ لَهُ مِنْ كُلِّ هَمٍّ فَرَجًا، وَمِنْ كُلِّ ضِيقٍ مَخْرَجًا وَرَزَقَهُ مِنْ حَيْثُ لا يَحْتَسِبُ» (أبو داود، كتاب الوتر، باب في الاستغفار، ﻧﻤﺒﺮ ١٥١٨، وابن ماجه ۔ ﻧﻤﺒﺮ ٣٨١٩)۔”جو پابندی سے استغفار کرتا ہے، اللہ تعالٰی اس کے لئے ہر فکر سے کشادگی، اور ہر تنگی سے راستہ بنا دیتا ہے اور اس کو ایسی جگہ سے روزی دیتا ہے جو اس کے وہم و گمان میں بھی نہیں ہوتی“۔\n(2) یعنی میں تمہیں جو دعوت دے رہا ہوں، اس سے اعراض اور اپنے کفر پر اصرار مت کرو۔ ایسا کرو گے تو اللہ کی بارگاہ میں مجرم اور گناہ گار بن کر پیش ہو گے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wayāqawmi is'taghfirū rabbakum thumma tūbū ilayhi yur'sili al-samāa ʿalaykum mid'rāran wayazid'kum quwwatan ilā quwwatikum walā tatawallaw muj'rimīna ","translations":["And O my people","Ask forgiveness","(of) your Lord","then","turn in repentance","to Him","He will send","(from) the sky (rain)","upon you","(in) abundance","and increase you","(in) strength","(added) to","your strength","And (do) not","turn away","(as) criminals","(52)"],"transliterationArr":["wayāqawmi","is'taghfirū","rabbakum","thumma","tūbū","ilayhi","yur'sili","al-samāa","ʿalaykum","mid'rāran","wayazid'kum","quwwatan","ilā","quwwatikum","walā","tatawallaw","muj'rimīna",null],"verseTiming":[[1,0,1320],[2,1320,2620],[3,2620,3620],[4,3620,5050],[5,5050,7520],[6,7520,8510],[7,8510,9270],[8,9270,11790],[9,11790,12620],[10,12620,15640],[11,15640,16430],[12,16430,18910],[13,18910,19820],[14,19820,22480],[15,22480,23650],[16,23650,24710],[17,24710,25290],[18,25290,26750],[19,26750,27270],[20,27270,28570],[21,28570,31365]]}}