{"name":"11:54","price":"بلکہ ہم تو یہی کہتے ہیں کہ تو ہمارے کسی معبود کے برے جھپٹے میں آگیا ہے(1) ۔ اس نے جواب دیا کہ میں اللہ کو گواه کرتا ہوں اور تم بھی گواه رہو کہ میں تو اللہ کے سوا ان سب سے بیزار ہوں، جنہیں تم شریک بنا رہے ہو۔(2)","arabic":"إِن نَّقُولُ إِلَّا ٱعۡتَرَىٰكَ بَعۡضُ ءَالِهَتِنَا بِسُوٓءٖۗ قَالَ إِنِّيٓ أُشۡهِدُ ٱللَّهَ وَٱشۡهَدُوٓاْ أَنِّي بَرِيٓءٞ مِّمَّا تُشۡرِكُونَ","category":["11 (Hud)","Hud","Surah Hud","Chapter Hud","Surah 11","Chapter 11","Hud","هود"],"ayahNumber":1527,"juzNumber":12,"footnotes":"(1) یعنی تو جو ہمارے معبودوں کی توہین اور گستاخی کرتا ہے کہ یہ کچھ نہیں کر سکتے، معلوم ہوتا ہے کہ ہمارے معبودوں نے تیری اس گستاخی پر تجھے کچھ کہہ دیا ہے اور تیرا دماغ ماؤف ہو گیا ہے۔ جیسے آج کل کے نام نہاد مسلمان بھی اس قسم کے توہمات کا شکار ہیں جب انہیں کہا جاتا ہے کہ یہ فوت شدہ اشخاص اور بزرگ کچھ نہیں کر سکتے، تو کہتے ہیں کہ ان کی شان میں گستاخی ہے اور خطرہ ہے کہ اس طرح کی گستاخی کرنے والوں کا وہ بیڑا غرق کر دیں۔ نَعُوذُ بِاللهِ مِنْ هَذِهِ الْخُرَافَاتِ وَالأكَاذِيبِ۔\n(2) یعنی ان تمام بتوں اور معبودوں سے بیزار ہوں اور تمہارا یہ عقیدہ کہ انہوں نے مجھے کچھ کر دیا ہے، بالکل غلط ہے، ان کے اندر یہ قدرت ہی نہیں کہ کسی کا ما فوق الاسباب طریقے سے نفع یا نقصان پہنچا سکیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"in naqūlu illā iʿ'tarāka baʿḍu ālihatinā bisūin qāla innī ush'hidu al-laha wa-ish'hadū annī barīon mimmā tush'rikūna ","translations":["Not","we say","except (that)","have seized you","some","(of) our gods","with evil","He said","Indeed, I","[I] call Allah to witness","[I] call Allah to witness","and (you) bear witness","that I am","innocent","of what","you associate","(54)"],"transliterationArr":["in","naqūlu","illā","iʿ'tarāka","baʿḍu","ālihatinā","bisūin","qāla","innī","ush'hidu","al-laha","wa-ish'hadū","annī","barīon","mimmā","tush'rikūna",null],"verseTiming":[[1,0,280],[2,280,1990],[3,1990,2570],[4,2570,3750],[5,3750,4290],[6,4290,5880],[7,5880,9100],[8,9100,10410],[9,10410,13620],[10,13620,14490],[11,14490,15430],[12,15430,17990],[13,17990,19470],[14,19470,21920],[15,21920,24620],[16,24620,27615]]}}