{"name":"11:5","price":"یاد رکھو وه لوگ اپنے سینوں کو دہرا کیے دیتے ہیں تاکہ اپنی باتیں (اللہ) سے چھپا سکیں(1) ۔ یاد رکھو کہ وه لوگ جس وقت اپنے کپڑے لپیٹتے ہیں وه اس وقت بھی سب جانتا ہے جو کچھ چھپاتے ہیں اور جو کچھ وه ﻇاہر کرتے ہیں۔ بالیقین وه دلوں کے اندر کی باتیں جانتا ہے.","arabic":"أَلَآ إِنَّهُمۡ يَثۡنُونَ صُدُورَهُمۡ لِيَسۡتَخۡفُواْ مِنۡهُۚ أَلَا حِينَ يَسۡتَغۡشُونَ ثِيَابَهُمۡ يَعۡلَمُ مَا يُسِرُّونَ وَمَا يُعۡلِنُونَۚ إِنَّهُۥ عَلِيمُۢ بِذَاتِ ٱلصُّدُورِ","category":["11 (Hud)","Hud","Surah Hud","Chapter Hud","Surah 11","Chapter 11","Hud","هود"],"ayahNumber":1478,"juzNumber":11,"footnotes":"(1) اس کی شان نزول میں مفسرین کا اختلاف ہے، اس لئے اس کے مفہوم میں بھی اختلاف ہے۔ تاہم صحیح بخاری (تفسیر سورت ہود) میں بیان کردہ شان نزول سے معلوم ہوتا ہے کہ یہ ان مسلمانوں کے بارے میں نازل ہوئی ہے جو غلبہ حیا کی وجہ سے قضائے حاجت اور بیوی سے ہم بستری کے وقت برہنہ ہونا پسند نہیں کرتے تھے کہ اللہ ہمیں دیکھ رہا ہے، اس لئے ایسے موقع پر وہ شرم گاہ کو چھپانے کے لئے اپنے سینوں کو دوہرا کر لیتے تھے۔ اللہ نے فرمایا کہ رات کے اندھیرے میں جب وہ بستروں میں اپنے آپ کو کپڑوں میں ڈھانپ لیتے تھے، تو اس وقت بھی وہ ان کو دیکھتا اور ان کی چھپی اور اعلانیہ باتوں کو جانتا ہے۔ مطلب یہ کہ شرم و حیا کا جذبہ اپنی جگہ بہت اچھا ہے لیکن اس میں اتنا غلو اور افراط بھی صحیح نہیں، اس لئے کہ جس ذات کی خاطر وہ ایسا کرتے ہیں اس سے تو پھر بھی وہ نہیں چھپ سکتے، تو پھر اس طرح کے تکلف کا کیا فائدہ؟۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"alā innahum yathnūna ṣudūrahum liyastakhfū min'hu alā ḥīna yastaghshūna thiyābahum yaʿlamu mā yusirrūna wamā yuʿ'linūna innahu ʿalīmun bidhāti al-ṣudūri ","translations":["No doubt","They","fold up","their breasts","that they may hide","from Him","Surely","when","they cover (themselves)","(with) their garments","He knows","what","they conceal","and what","they reveal","Indeed, He","(is) All-Knower","of what","(is in) the breasts","(5)"],"transliterationArr":["alā","innahum","yathnūna","ṣudūrahum","liyastakhfū","min'hu","alā","ḥīna","yastaghshūna","thiyābahum","yaʿlamu","mā","yusirrūna","wamā","yuʿ'linūna","innahu","ʿalīmun","bidhāti","al-ṣudūri",null],"verseTiming":[[1,0,2190],[2,2190,3990],[3,3990,5060],[4,5060,6380],[5,6380,7910],[6,7910,8400],[7,8400,9740],[8,9740,10460],[9,10460,12030],[10,12030,13360],[11,13360,14270],[12,14270,14700],[13,14700,16120],[14,16120,16780],[15,16780,20580],[16,20580,22580],[17,22580,24610],[18,24610,25430],[19,25430,28825]]}}