{"name":"11:59","price":"یہ تھی قوم عاد، جنہوں نے اپنے رب کی آیتوں کا انکار کیا اور اس کے رسولوں کی(1) نافرمانی کی اور ہر ایک سرکش نافرمان کے حکم کی تابعداری کی.(2)","arabic":"وَتِلۡكَ عَادٞۖ جَحَدُواْ بِـَٔايَٰتِ رَبِّهِمۡ وَعَصَوۡاْ رُسُلَهُۥ وَٱتَّبَعُوٓاْ أَمۡرَ كُلِّ جَبَّارٍ عَنِيدٖ","category":["11 (Hud)","Hud","Surah Hud","Chapter Hud","Surah 11","Chapter 11","Hud","هود"],"ayahNumber":1532,"juzNumber":12,"footnotes":"(1) عاد کی طرف صرف ایک نبی حضرت ہود (عليه السلام) ہی بھیجے گئے تھے، یہاں اللہ تعالٰی نے فرمایا کہ انہوں نے اللہ کے رسولوں کی نافرمانی کی۔ اس سے یا تو یہ واضح کرنا مقصود ہے کہ ایک رسول کی تکذیب، یہ گویا تمام رسولوں کی تکذیب ہے۔ کیونکہ تمام رسولوں پر ایمان رکھنا ضروری ہے۔ یا مطلب یہ ہے کہ یہ قوم اپنے کفر اور انکار میں اتنی آگے بڑھ چکی تھی کہ حضرت ہود (عليه السلام) کے بعد اگر ہم اس قوم میں متعدد رسول بھی بھیجتے، تو یہ قوم ان سب کی تکذیب ہی کرتی۔ اور اس سے قطعاً یہ امید نہ تھی کہ وہ کسی بھی رسول پر ایمان لے آتی۔ یا ہو سکتا ہے کہ اور بھی انبیاء بھیجے گئے ہوں اور اس قوم نے ہر ایک کی تکذیب کی۔\n(2) یعنی اللہ کے پیغمبروں کی تکذیب کی لیکن جو لوگ اللہ کے حکموں سے سرکشی کرنے والے اور نافرمان تھے، ان کی اس قوم نے پیروی کی۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"watil'ka ʿādun jaḥadū biāyāti rabbihim waʿaṣaw rusulahu wa-ittabaʿū amra kulli jabbārin ʿanīdin ","translations":["And this","(was) Aad","they rejected","(the) Signs","(of) their Lord","and disobeyed","His Messengers","and followed","(the) command","(of) every","tyrant","obstinate","(59)"],"transliterationArr":["watil'ka","ʿādun","jaḥadū","biāyāti","rabbihim","waʿaṣaw","rusulahu","wa-ittabaʿū","amra","kulli","jabbārin","ʿanīdin",null],"verseTiming":[[1,0,920],[2,920,3999],[3,3999,4839],[4,4839,6189],[5,6189,7239],[6,7239,8179],[7,8179,9329],[8,9329,12159],[9,12159,12849],[10,12849,13449],[11,13449,14689],[12,14689,18224]]}}