{"name":"11:69","price":"اور ہمارے بھیجے ہوئے پیغامبر ابراہیم کے پاس خوشخبری لے کر پہنچے(1) اور سلام کہا(2)، انہوں نے بھی جواب سلام دیا(3) اور بغیر کسی تاخیر کے گائے کا بھنا ہوا بچھڑا لے آئے.(4)","arabic":"وَلَقَدۡ جَآءَتۡ رُسُلُنَآ إِبۡرَٰهِيمَ بِٱلۡبُشۡرَىٰ قَالُواْ سَلَٰمٗاۖ قَالَ سَلَٰمٞۖ فَمَا لَبِثَ أَن جَآءَ بِعِجۡلٍ حَنِيذٖ","category":["11 (Hud)","Hud","Surah Hud","Chapter Hud","Surah 11","Chapter 11","Hud","هود"],"ayahNumber":1542,"juzNumber":12,"footnotes":"(1) یہ دراصل حضرت لوط (عليه السلام) اور ان کی قوم کے قصے کا ایک حصہ ہے۔ حضرت لوط علیہ السلام، حضرت ابراہیم (عليه السلام) کے چچا زاد بھائی تھے۔ حضرت لوط (عليه السلام) کی بستی بحرہ، میت کے جنوب مشرق میں تھی، جبکہ حضرت ابراہیم (عليه السلام) فلسطین میں مقیم تھے۔ جب حضرت لوط (عليه السلام) کی قوم کو ہلاک کرنے کا فیصلہ کر لیا گیا۔ تو ان کی طرف سے فرشتے بھیجے گئے۔ یہ فرشتے قوم لوط (عليه السلام) کی طرف جاتے ہوئے راستے میں حضرت ابراہیم (عليه السلام) کے پاس ٹھہرے اور انہیں بیٹے کی بشارت دی۔\n(2) یعنی سَلَّمْنَا عَلَيْكَ سَلامًا ”ہم آپ کو سلام عرض کرتے ہیں“۔\n(3) جس طرح پہلا سلام ایک فعل مقدر کے ساتھ منصوب تھا۔ اس طرح یہ سالم مبتدا یا خبر ہونے کی بنا پر مرفوع ہے عبادت ہوگی: أَمْرُكُمْ سَلامٌ یا عَلَيْكُمْ سَلامٌ۔\n(4) حضرت ابرا ہیم (عليه السلام) بڑے مہمان نواز تھے وہ یہ نہیں سمجھ پائے کہ یہ فرشتے ہیں جو انسانی صورت میں آئے ہیں اور کھانے پینے سے معزور ہیں، بلکہ انہوں نے انہیں مہمان سمجھا اور فورا مہمانوں کی خاطر تواضع کے لئے بھنا ہوا بچھڑا لا کر ان کی خدمت میں پیش کر دیا۔ نیز اس سے یہ بھی معلوم ہوا کہ مہمان سے پوچھنے کی ضرورت نہیں بلکہ جو موجود ہو حاضر خدمت کر دیا جائے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walaqad jāat rusulunā ib'rāhīma bil-bush'rā qālū salāman qāla salāmun famā labitha an jāa biʿij'lin ḥanīdhin ","translations":["And certainly","came","Our messengers","(to) Ibrahim","with glad tidings","they said","Peace","He said","Peace","and not he delayed","and not he delayed","to","bring","a calf","roasted","(69)"],"transliterationArr":["walaqad","jāat","rusulunā","ib'rāhīma","bil-bush'rā","qālū","salāman","qāla","salāmun","famā","labitha","an","jāa","biʿij'lin","ḥanīdhin",null],"verseTiming":[[1,0,840],[2,840,2880],[3,2880,5230],[4,5230,6610],[5,6610,7880],[6,7880,8710],[7,8710,10790],[8,10790,11410],[9,11410,14310],[10,14310,15000],[11,15000,15660],[12,15660,16710],[13,16710,18970],[14,18970,20010],[15,20010,23225]]}}