{"name":"11:6","price":"زمین پر چلنے پھرنے والے جتنے جاندار ہیں سب کی روزیاں اللہ تعالیٰ پر ہیں(1) وہی ان کے رہنے سہنے کی جگہ کو جانتا ہےاور ان کے سونپے جانے(2) کی جگہ کو بھی، سب کچھ واضح کتاب میں موجود ہے.","arabic":"۞ وَمَا مِن دَآبَّةٖ فِي ٱلۡأَرۡضِ إِلَّا عَلَى ٱللَّهِ رِزۡقُهَا وَيَعۡلَمُ مُسۡتَقَرَّهَا وَمُسۡتَوۡدَعَهَاۚ كُلّٞ فِي كِتَٰبٖ مُّبِينٖ","category":["11 (Hud)","Hud","Surah Hud","Chapter Hud","Surah 11","Chapter 11","Hud","هود"],"ayahNumber":1479,"juzNumber":12,"footnotes":"(1) یعنی وہ کفیل اور ذمے دار ہے۔ زمین پر چلنے والی ہر مخلوق، انسان ہو یا جن، چرند ہو یا پرند، چھوٹی ہو یا بڑی، بحری ہو یا بری۔ ہر ایک کو اس کی ضروریات کے مطابق وہ خوراک مہیا کرتا ہے۔\n(2) مستقر اور مستودع کی تعریف میں اختلاف ہے بعض کے نزدیک منتہائے سیر (یعنی زمین میں چل پھر کر جہاں رک جائے) مستقر ہے اور جس کو ٹھکانا بنائے وہ مستودع ہے۔ بعض کے نزدیک رحم مادر مستقر اور باپ کی صلب مستودع ہے اور بعض کے نزدیک زندگی میں انسان یا حیوان جہاں رہائش پذیر ہو وہ اس کا مستقر ہے اور جہاں مرنے کے بعد دفن ہو وہ مستودع ہے (تفسیر ابن کثیر) امام شوکانی کہتے ہیں مستقر سے مراد رحم مادر اور مستودع سے وہ حصہ زمین ہے جس میں دفن ہو اور امام حاکم کی ایک روایت کی بنیاد پر اسی کو ترجیح دی ہے بہرحال جو بھی مطلب لیا جائے آیت کا مفہوم واضح ہے کہ چونکہ اللہ تعالٰی کو ہر ایک کے مستقر ومستودع کا علم ہے اس لیے وہ ہر ایک کو روزی پہنچانے پر قادر ہے اور ذمے دار ہے اور وہ اپنی ذمے داری پوری کرتا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wamā min dābbatin fī al-arḍi illā ʿalā al-lahi riz'quhā wayaʿlamu mus'taqarrahā wamus'tawdaʿahā kullun fī kitābin mubīnin ","translations":["And not","any","moving creature","in","the earth","but","on","Allah","(is) its provision","And He knows","its dwelling place","and its place of storage","All","(is) in","a Record","clear","(6)"],"transliterationArr":["wamā","min","dābbatin","fī","al-arḍi","illā","ʿalā","al-lahi","riz'quhā","wayaʿlamu","mus'taqarrahā","wamus'tawdaʿahā","kullun","fī","kitābin","mubīnin",null],"verseTiming":[[1,0,710],[2,710,2230],[3,2230,6600],[4,6600,7360],[5,7360,8280],[6,8280,9080],[7,9080,9530],[8,9530,10460],[9,10460,11560],[10,11560,12720],[11,12720,14480],[12,14480,16700],[13,16700,18920],[14,18920,19340],[15,19340,20360],[16,20360,24415]]}}