{"name":"11:61","price":"اور قوم ﺛمود کی طرف ان کے بھائی صالح کو بھیجا(1) ، اس نے کہا کہ اے میری قوم تم اللہ کی عبادت کرو اس کے سوا تمہارا کوئی معبود نہیں(2)، اسی نے تمہیں زمین سے پیدا کیا ہے(3) اور اسی نے اس زمین میں تمہیں بسایا ہے(4)، پس تم اس سے معافی طلب کرو اور اس کی طرف رجوع کرو۔ بیشک میرا رب قریب اور دعاؤں کا قبول کرنے واﻻ ہے.","arabic":"۞ وَإِلَىٰ ثَمُودَ أَخَاهُمۡ صَٰلِحٗاۚ قَالَ يَٰقَوۡمِ ٱعۡبُدُواْ ٱللَّهَ مَا لَكُم مِّنۡ إِلَٰهٍ غَيۡرُهُۥۖ هُوَ أَنشَأَكُم مِّنَ ٱلۡأَرۡضِ وَٱسۡتَعۡمَرَكُمۡ فِيهَا فَٱسۡتَغۡفِرُوهُ ثُمَّ تُوبُوٓاْ إِلَيۡهِۚ إِنَّ رَبِّي قَرِيبٞ مُّجِيبٞ","category":["11 (Hud)","Hud","Surah Hud","Chapter Hud","Surah 11","Chapter 11","Hud","هود"],"ayahNumber":1534,"juzNumber":12,"footnotes":"(1) وَ اِلَیٰ ثَمُوْدَ عطف ہے ما قبل پر۔ یعنی وَ اَرْسَلنَا اِلَیٰ ثُمُوْدَ ہم نے ثمود کی طرف بھیجا۔ یہ قوم تبوک اور مدینہ کے درمیان مدائن (حجر) میں رہائش پذیر تھی اور یہ قوم عاد کے بعد ہوئی۔ حضرت صالح (عليه السلام) کو یہاں بھی ثمود کا بھائی کہا۔ جس سے مراد انہی کے خاندان اور قبیلے کا ایک فرد ہے۔\n(2) حضرت صالح (عليه السلام) نے بھی سب سے پہلے اپنی قوم کو توحید کی دعوت دی، جس طرح کہ انبیاء کا طریق رہا ہے۔\n(3) یعنی ابتدا میں تمہیں زمین سے پیدا کیا اس طرح کہ تمہارے باپ آدم (عليه السلام) کی تخلیق مٹی سے ہوئی اور تمام انسان صلب آدم (عليه السلام) سے پیدا ہوئے یوں گویا تمام انسانوں کی پیدائش زمین سے ہوئی۔ یا یہ مطلب ہے کہ تم جو کچھ کھاتے ہو، سب زمین ہی سے پیدا ہوتا ہے اور اسی خوراک سے وہ نطفہ بنتا ہے۔ جو رحم مادر میں جا کر وجود انسانی کا باعث ہوتا ہے۔\n(4) یعنی تمہارے اندر زمین کو بسانے اور آباد کرنے کی استعداد اور صلاحیت پیدا کی، جس سے تم رہائش کے لئے مکان تعمیر کرتے، خوراک کے لئے کاشت کاری کرتے اور دیگر ضروریات زندگی مہیا کرنے کے لئے صنعت و حرفت سے کام لیتے ہو۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-ilā thamūda akhāhum ṣāliḥan qāla yāqawmi uʿ'budū al-laha mā lakum min ilāhin ghayruhu huwa ansha-akum mina al-arḍi wa-is'taʿmarakum fīhā fa-is'taghfirūhu thumma tūbū ilayhi inna rabbī qarībun mujībun ","translations":["And to","Thamud","(We sent) their brother","Salih","He said","O my people","Worship","Allah","not","you have","any","god","other than Him","He","produced you","from","the earth","and settled you","in it","So ask forgiveness of Him","then","turn in repentance","to Him","Indeed","my Lord","(is) near","All-Responsive","(61)"],"transliterationArr":["wa-ilā","thamūda","akhāhum","ṣāliḥan","qāla","yāqawmi","uʿ'budū","al-laha","mā","lakum","min","ilāhin","ghayruhu","huwa","ansha-akum","mina","al-arḍi","wa-is'taʿmarakum","fīhā","fa-is'taghfirūhu","thumma","tūbū","ilayhi","inna","rabbī","qarībun","mujībun",null],"verseTiming":[[1,0,830],[2,830,1770],[3,1770,2830],[4,2830,4030],[5,4030,5240],[6,5240,6300],[7,6300,6990],[8,6990,7850],[9,7850,8290],[10,8290,8840],[11,8840,10290],[12,10290,11250],[13,11250,12700],[14,12700,13050],[15,13050,15560],[16,15560,16490],[17,16490,17420],[18,17420,19170],[19,19170,19990],[20,19990,21700],[21,21700,23170],[22,23170,25660],[23,25660,28410],[24,28410,29640],[25,29640,30370],[26,30370,31360],[27,31360,35605]]}}