{"name":"11:85","price":"اے میری قوم! ناپ تول انصاف کے ساتھ پوری پوری کرو لوگوں کو ان کی چیزیں کم نہ دو(1) اور زمین میں فساد اور خرابی نہ مچاؤ.(2)","arabic":"وَيَٰقَوۡمِ أَوۡفُواْ ٱلۡمِكۡيَالَ وَٱلۡمِيزَانَ بِٱلۡقِسۡطِۖ وَلَا تَبۡخَسُواْ ٱلنَّاسَ أَشۡيَآءَهُمۡ وَلَا تَعۡثَوۡاْ فِي ٱلۡأَرۡضِ مُفۡسِدِينَ","category":["11 (Hud)","Hud","Surah Hud","Chapter Hud","Surah 11","Chapter 11","Hud","هود"],"ayahNumber":1558,"juzNumber":12,"footnotes":"(1) انبیاء علیہم السلام کی دعوت دو اہم بنیادوں پر مشتمل ہوتی ہے (1)۔ حقوق اللہ کی ادائیگی (2)، حقوق العباد کی ادائیگی۔ اول الذکر کی طرف لفظ «اعْبُدُوا اللَّهَ» اور آخر الذکر کی جانب «وَلَا تَنْقُصُوا الْمِكْيَالَ وَالْمِيْزَانَ» (ھود:84) سے اشارہ کیا گیا اور اب تاکید کے طور پر انہیں انصاف کے ساتھ پورا پورا ناپ تول کا حکم دیا جا رہا ہے اور لوگوں کو چیزیں کم کر کے دینے سے منع کیا جا رہا ہے کیونکہ اللہ تعالٰی کے ہاں یہ بھی ایک بہت بڑا جرم ہے۔ اللہ تعالٰی نے ایک پوری سورت میں اس جرم کی شناعت و قباحت اور اس کی اخروی سزا بیان فرمائی ہے۔«وَيْلٌ لِلْمُطَفِّفِينَ ، الَّذِينَ إِذَا اكْتَالُوا عَلَى النَّاسِ يَسْتَوْفُونَ (1) وَإِذَا كَالُوهُمْ أَوْ وَزَنُوهُمْ يُخْسِرُونَ» ( سورة المطففين: 1۔3) ”مطففین کے لیے ہلاکت ہے۔ یہ وہ لوگ ہیں کہ جب لوگوں سے ناپ کر لیتے ہیں تو پورا لیتے ہیں اور جب دوسروں کو ناپ کر یا تول کر دیتے ہیں، تو کم کر کے دیتے ہیں“۔\n(2) اللہ کی نافرمانی سے، بالخصوص جن کا تعلق حقوق العباد سے ہو، جیسے یہاں ناپ تول کی کمی بیشی میں ہے، زمین میں یقیناً فساد اور بگاڑ پیدا ہوتا ہے جس سے انہیں منع کیا گیا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wayāqawmi awfū al-mik'yāla wal-mīzāna bil-qis'ṭi walā tabkhasū al-nāsa ashyāahum walā taʿthaw fī al-arḍi muf'sidīna ","translations":["And O my people","Give full","measure","and weight","in justice","and (do) not","deprive","the people","(of) their things","and (do) not","act wickedly","in","the earth","spreading corruption","(85)"],"transliterationArr":["wayāqawmi","awfū","al-mik'yāla","wal-mīzāna","bil-qis'ṭi","walā","tabkhasū","al-nāsa","ashyāahum","walā","taʿthaw","fī","al-arḍi","muf'sidīna",null],"verseTiming":[[1,0,1350],[2,1350,1920],[3,1920,3260],[4,3260,4700],[5,4700,5700],[6,5700,6740],[7,6740,7640],[8,7640,9170],[9,9170,12300],[10,12300,12870],[11,12870,13710],[12,13710,13980],[13,13980,14820],[14,14820,17835]]}}