{"name":"11:80","price":"لوط ﴿علیہ السلام﴾ نے کہا کاش کہ مجھ میں تم سے مقابلہ کرنے کی قوت ہوتی یا میں کسی زبردست کا آسرا پکڑ پاتا.(1)","arabic":"قَالَ لَوۡ أَنَّ لِي بِكُمۡ قُوَّةً أَوۡ ءَاوِيٓ إِلَىٰ رُكۡنٖ شَدِيدٖ","category":["11 (Hud)","Hud","Surah Hud","Chapter Hud","Surah 11","Chapter 11","Hud","هود"],"ayahNumber":1553,"juzNumber":12,"footnotes":"(1) قوت سے اپنے دست بازو اور اپنے وسائل کی قوت یا اولاد کی قوت مراد ہے اور رکن شدید (مضبوط آسرا) سے خاندان، قبیلہ یا اسی قسم کا کوئی مضبوط سہارامراد ہے۔ یعنی نہایت بےبسی کے عالم میں آرزو کر رہے ہیں کہ کاش! میرے اپنے پاس کوئی قوت ہوتی یا کسی خاندان اور قبیلے کی پناہ اور مدد مجھے حاصل ہوتی تو آج مجھے مہمانوں کی وجہ سے یہ ذلت و رسوائی نہ ہوتی، میں ان بد قماشوں سے نمٹ لیتا اور مہمانوں کی حفاظت کر لیتا۔ حضرت لوط (عليه السلام) کی یہ آرزو اللہ تعالٰی پر توکل کے منافی نہیں ہے۔ بلکہ ظاہری اسباب کے مطابق ہے۔ اور توکل علی اللہ کا صحیح مفہوم و مطلب بھی یہی ہے۔ کہ پہلے تمام ظاہر اسباب و وسائل بروئے کار لائے جائیں اور پھر اللہ پر توکل کیا جائے۔ یہ توکل کا نہایت غلط مفہوم ہے کہ ہاتھ پیر توڑ کر بیٹھ جاؤ اور کہو کہ ہمارا بھروسہ اللہ پر ہے۔ اس لیے حضرت لوط (عليه السلام) نے جو کچھ کہا، ظاہر اسباب کے اعتبار سے بالکل بجا کہا۔ جس سے یہ بات معلوم ہوئی کہ اللہ کا پیغمبر جس طرح عالم الغیب نہیں ہوتا اسی طرح مختار کل بھی نہیں ہوتا، (جیسا کہ آج کل لوگوں نے یہ عقیدہ گھڑ لیا ہے) اگر نبی دنیا میں اختیارات سے بہرہ ور ہوتے تو یقییناً حضرت لوط (عليه السلام) اپنی بےبسی کا اور اس آرزو کا اظہار نہ کرتے جو انہوں نے مذکورہ الفاظ میں کیا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qāla law anna lī bikum quwwatan aw āwī ilā ruk'nin shadīdin ","translations":["He said","If","that","I had","over you","power","or","I could take refuge","in","a support","strong","(80)"],"transliterationArr":["qāla","law","anna","lī","bikum","quwwatan","aw","āwī","ilā","ruk'nin","shadīdin",null],"verseTiming":[[1,0,740],[2,740,1090],[3,1090,2360],[4,2360,2820],[5,2820,3500],[6,3500,4550],[7,4550,4970],[8,4970,7340],[9,7340,7890],[10,7890,8880],[11,8880,12905]]}}