{"name":"11:84","price":"اور ہم نے مدین والوں(1) کی طرف ان کے بھائی شعیب کو بھیجا، اس نے کہا اے میری قوم! اللہ کی عبادت کرو اس کے سوا تمہارا کوئی معبود نہیں اور تم ناپ تول میں بھی کمی نہ کرو(2) میں تو تمہیں آسوده حال دیکھ رہا ہوں(3) اور مجھے تم پر گھیرنے والے دن کے عذاب کا خوف (بھی) ہے.(4)","arabic":"۞ وَإِلَىٰ مَدۡيَنَ أَخَاهُمۡ شُعَيۡبٗاۚ قَالَ يَٰقَوۡمِ ٱعۡبُدُواْ ٱللَّهَ مَا لَكُم مِّنۡ إِلَٰهٍ غَيۡرُهُۥۖ وَلَا تَنقُصُواْ ٱلۡمِكۡيَالَ وَٱلۡمِيزَانَۖ إِنِّيٓ أَرَىٰكُم بِخَيۡرٖ وَإِنِّيٓ أَخَافُ عَلَيۡكُمۡ عَذَابَ يَوۡمٖ مُّحِيطٖ","category":["11 (Hud)","Hud","Surah Hud","Chapter Hud","Surah 11","Chapter 11","Hud","هود"],"ayahNumber":1557,"juzNumber":12,"footnotes":"(1) مدین کی تحقیق کے لئے دیکھئے سورۃ الاعراف، آیت 85 کا حاشیہ۔\n(2) توحید کی دعوت دینے کے بعد اس قوم میں جو نمایاں اخلاقی خرابی۔ ناپ تول میں کمی کی تھی اس سے انہیں منع فرمایا۔ ان کا معمول بن چکا تھا جب ان کے پاس فروخت کندہ (بائع) اپنی چیز لے کر آتا تو اس سے ناپ اور تول میں زائد چیز لیتے اور جب خریدار (مشتری) کو کوئی چیز فروخت کرتے تو ناپ میں بھی کمی کر کے دیتے اور تول میں ڈنڈی مار لیتے۔\n(3) یہ اس منع کرنے کی علت ہے کہ جب اللہ تعالٰی تم پر اپنا فضل کر رہا ہے اور اس نے تمہیں آسودگی اور مال و دولت سے نوازا ہے تو پھر تم یہ قبیح حرکت کیوں کرتے ہو۔\n(4) یہ دوسری علت ہے کہ اگر تم اپنی اس حرکت سے باز نہ آئے تو پھر اندیشہ ہے کہ قیامت والے دن کے عذاب سے تم نہ بچ سکو۔ گھیرنے والے دن سے مراد قیامت کا دن ہے کہا اس دن کوئی گناہ گار مواخذہ الہی سے بچ سکے گا نہ بھاگ کر کہیں چھپ سکے گا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-ilā madyana akhāhum shuʿayban qāla yāqawmi uʿ'budū al-laha mā lakum min ilāhin ghayruhu walā tanquṣū al-mik'yāla wal-mīzāna innī arākum bikhayrin wa-innī akhāfu ʿalaykum ʿadhāba yawmin muḥīṭin ","translations":["And to","Madyan","their brother","Shuaib","He said","O my people","Worship","Allah","not","(is) for you","any","god","other than Him","And (do) not","decrease","(from) the measure","and the scale","Indeed, I","see you","in prosperity","but indeed, I","fear","for you","punishment","(of) a Day","all-encompassing","(84)"],"transliterationArr":["wa-ilā","madyana","akhāhum","shuʿayban","qāla","yāqawmi","uʿ'budū","al-laha","mā","lakum","min","ilāhin","ghayruhu","walā","tanquṣū","al-mik'yāla","wal-mīzāna","innī","arākum","bikhayrin","wa-innī","akhāfu","ʿalaykum","ʿadhāba","yawmin","muḥīṭin",null],"verseTiming":[[1,0,910],[2,910,1690],[3,1690,2820],[4,2820,4120],[5,4120,5240],[6,5240,6260],[7,6260,6950],[8,6950,7820],[9,7820,8220],[10,8220,8990],[11,8990,10210],[12,10210,11200],[13,11200,12620],[14,12620,13190],[15,13190,14720],[16,14720,16060],[17,16060,19329],[18,19329,22919],[19,22919,24549],[20,24549,25469],[21,25469,29849],[22,29849,30619],[23,30619,31759],[24,31759,32649],[25,32649,33309],[26,33309,36353]]}}