{"name":"11:91","price":"انہوں نے کہا اے شعیب! تیری اکثر باتیں تو ہماری سمجھ میں ہی نہیں آتیں(1) اور ہم تو تجھے اپنے اندر بہت کمزور پاتے ہیں(2)، اگر تیرے قبیلے کا خیال نہ ہوتا تو ہم تو تجھے سنگسار کر دیتے(3)، اور ہم تجھے کوئی حیثیت والی ہستی نہیں گنتے.(4)","arabic":"قَالُواْ يَٰشُعَيۡبُ مَا نَفۡقَهُ كَثِيرٗا مِّمَّا تَقُولُ وَإِنَّا لَنَرَىٰكَ فِينَا ضَعِيفٗاۖ وَلَوۡلَا رَهۡطُكَ لَرَجَمۡنَٰكَۖ وَمَآ أَنتَ عَلَيۡنَا بِعَزِيزٖ","category":["11 (Hud)","Hud","Surah Hud","Chapter Hud","Surah 11","Chapter 11","Hud","هود"],"ayahNumber":1564,"juzNumber":12,"footnotes":"(1) یہ یا تو انہوں نے بطور مذاق تحقیر کہا درانحالیکہ ان کی باتیں ان کے لئے ناقابل فہم نہیں تھیں۔ اس صورت میں یہاں فہم کی نفی مجازا ہوگی۔ یا ان کا مقصد ان باتوں کے سمجھنے سے معذوری کا اظہار ہے جن کا تعلق غیب سے ہے۔ مثلا بعث بعدالموت، حشر نشر، جنت و دوزخ وغیرہ اس لحاظ سے، فہم کی فنی حقیقتا ہوگی۔\n(2) یہ کمزوری جسمانی لحاظ سے تھی، جیسا کہ بعض کا خیال ہے کہ حضرت شعیب (عليه السلام) کی بینائی کمزور تھی یا وہ نحیف و لاغر جسم کے تھے یا اس اعتبار سے انہیں کمزور کہا کہ وہ خود بھی مخالفین سے تنہا مقابلہ کرنے کی سکت نہیں رکھتے تھے۔\n(3) حضرت شعیب (عليه السلام) کا قبیلہ کہا جاتا ہے کہ ان کا مددگار نہیں تھا، لیکن وہ قبیلہ چونکہ کفر و شرک میں اپنی ہی قوم کے ساتھ تھا، اس لئے اپنے ہم مذہب ہونے کی وجہ سے اس قبیلے کا لحاظ، بہرحال حضرت شعیب (عليه السلام) کے ساتھ سخت رویہ اختیار کرنے اور انہیں نقصان پہنچانے میں مانع تھا۔\n(4) لیکن چونکہ تیرے قبیلے کی حیثیت بہرحال ہمارےدلوں میں موجود ہے، اس لئے ہم درگزر سے کام لے رہے ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qālū yāshuʿaybu mā nafqahu kathīran mimmā taqūlu wa-innā lanarāka fīnā ḍaʿīfan walawlā rahṭuka larajamnāka wamā anta ʿalaynā biʿazīzin ","translations":["They said","O Shuaib","Not","we understand","much","of what","you say","and indeed, we","surely [we] see you","among us","weak","And if not","for your family","surely we would have stoned you","and you are not","and you are not","against us","mighty","(91)"],"transliterationArr":["qālū","yāshuʿaybu","mā","nafqahu","kathīran","mimmā","taqūlu","wa-innā","lanarāka","fīnā","ḍaʿīfan","walawlā","rahṭuka","larajamnāka","wamā","anta","ʿalaynā","biʿazīzin",null],"verseTiming":[[1,0,860],[2,860,1970],[3,1970,2650],[4,2650,3480],[5,3480,4350],[6,4350,6410],[7,6410,7310],[8,7310,8950],[9,8950,9980],[10,9980,10770],[11,10770,12720],[12,12720,13750],[13,13750,14560],[14,14560,16090],[15,16090,18220],[16,18220,19410],[17,19410,20390],[18,20390,23555]]}}