{"name":"12:19","price":"اور ایک قافلہ آیا اور انہوں نے اپنے پانی ﻻنے والے کو بھیجا اس نے اپنا ڈول لٹکا دیا، کہنے لگا واه واه خوشی کی بات ہے یہ تو ایک لڑکا ہے(1) ، انہوں نے اسے مال تجارت قرار دے کر چھپا دیا (2)اور اللہ تعالیٰ اس سے باخبر تھا جو وه کر رہے (3)تھے.","arabic":"وَجَآءَتۡ سَيَّارَةٞ فَأَرۡسَلُواْ وَارِدَهُمۡ فَأَدۡلَىٰ دَلۡوَهُۥۖ قَالَ يَٰبُشۡرَىٰ هَٰذَا غُلَٰمٞۚ وَأَسَرُّوهُ بِضَٰعَةٗۚ وَٱللَّهُ عَلِيمُۢ بِمَا يَعۡمَلُونَ","category":["12 (Yusuf)","Yusuf","Surah Yusuf","Chapter Yusuf","Surah 12","Chapter 12","Joseph","يوسُف"],"ayahNumber":1615,"juzNumber":12,"footnotes":"(1) وارد اس شخص کو کہتے ہیں جو قافلے کے لئے پانی وغیرہ انتظام کرنے کی غرض سے قافلے کے آگے آگے چلتا ہے تاکہ مناسب جگہ دیکھ کر قافلے کو ٹھیرایا جا سکے یہ وراد (جب کنویں پر آیا اور اپنا ڈول نیچے لٹکایا تو حضرت یوسف (عليه السلام) نے اس کی رسی پکڑ لی، وارد نے ایک خوش شکل بچہ دیکھا تو اسے اوپر کھنچ لیا اور بڑا خوش ہوا۔\n(2) بِضَاعَةً سامان تجارت کو کہتے ہیں أَسَرُّوهُ کا فاعل کون ہے؟ یعنی یوسف کو سامان تجارت سمجھ کر چھپانے والا کون ہے؟ اس میں اختلاف ہے۔ حافظ ابن کثیر نے برادران یوسف (عليه السلام) کو فاعل قرار دیا ہے مطلب یہ ہے کہ جب ڈول کے ساتھ یوسف (عليه السلام) بھی کنویں سے باہر نکل آئے تو وہاں یہ بھائی بھی موجود تھے، تاہم انہوں نے اصل حقیقت کو چھپائے رکھا، یہ نہیں کہا کہ یہ ہمارا بھائی ہے اور حضرت یوسف (عليه السلام) نے بھی قتل کے اندیشے سے اپنا بھائی ہونا ظاہر نہیں کیا بلکہ بھائیوں نے انہیں فروختنی قرار دیا تو خاموش رہے اور اپنا فروخت ہونا پسند کر لایا۔ چنانچہ اس وارد نے اہل قافلہ کو یہ خوشخبری سنائی کہ ایک بچہ فروخت ہو رہا ہے۔ مگر یہ بات سیاق سے میل کھاتی نظر نہیں آتی۔ ان کے برخلاف امام شوکانی نے أَسَرُّوهُ کا فاعل وارد اور اس کے ساتھیوں کو قرار دیا ہے کہ انہوں نے یہ ظاہر نہیں کیا کہ یہ بچہ کنویں سے نکلا ہے کیونکہ اس طرح تمام اہل قافلہ اس سامان تجارت میں شریک ہو جاتے بلکہ اہل قافلہ کو انہوں نے جا کر یہ بتلایا کہ کنویں کے مالکوں نے یہ بچہ ان کے سپرد کیا ہے تاکہ اسے وہ مصر جا کر بیچ دیں۔ مگر اقرب ترین بات یہ ہے کہ اہل قافلہ نے بچے کو سامان تجارت قرار دے کر چھپا لیا کہ کہیں اس کے عزیز واقارب اس کی تلاش میں نہ آ پہنچیں۔ اور یوں لینے کے دینے پڑ جائیں کیونکہ بچہ ہونا اور کنویں میں پایا جانا اس بات کی علامت ہے کہ وہ کہیں قریب ہی کا رہنے والا ہے اور کھیلتے کودتے آ گرا ہے۔\n(3) یعنی یوسف (عليه السلام) کے ساتھ یہ جو کچھ ہو رہا تھا، اللہ کو اس کا علم تھا۔ لیکن اللہ نے یہ سب کچھ اس لیے ہونے دیا کہ تقدیر الہی بروئے کار آئے۔ علاوہ ازیں اس میں رسول اللہ (صلى الله عليه وسلم) کے لیے اشارہ ہے یعنی اللہ تعالٰی اپنے پیغمبر کو بتلا رہا ہے کہ آپ کی قوم کے لوگ یقیناً ایذا پہنچا رہے ہیں اور میں انہیں اس سے روکنے پر قادر بھی ہوں۔ لیکن میں اسی طرح انہیں مہلت دے رہا ہوں جس طرح برادران یوسف (عليه السلام) کو مہت دی تھی۔ اور پھر بالآخر میں نے یوسف (عليه السلام) کو مصر کے تخت پر جا بٹھایا اور اس کے بھائیوں کو عاجز ولاچار کر کے اس کے دربار میں کھڑا کر دیا اے پیغمبر ایک وقت آئے گا کہ آپ بھی اسی طرح سرخرو ہوں گے اور سرداران قریش آپ کے اشارہ ابرو اور جنبش لب کے منتظر ہوں گے۔ چنانچہ فتح مکہ کے موقع پر یہ وقت جلد ہی آ پہنچا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wajāat sayyāratun fa-arsalū wāridahum fa-adlā dalwahu qāla yābush'rā hādhā ghulāmun wa-asarrūhu biḍāʿatan wal-lahu ʿalīmun bimā yaʿmalūna ","translations":["And there came","a caravan","and they sent","their water drawer","then he let down","his bucket","He said","O good news","This","(is) a boy","And they hid him","(as) a merchandise","And Allah","(is) All-Knower","of what","they do","(19)"],"transliterationArr":["wajāat","sayyāratun","fa-arsalū","wāridahum","fa-adlā","dalwahu","qāla","yābush'rā","hādhā","ghulāmun","wa-asarrūhu","biḍāʿatan","wal-lahu","ʿalīmun","bimā","yaʿmalūna",null],"verseTiming":[[1,0,2750],[2,2750,4280],[3,4280,6280],[4,6280,7540],[5,7540,8670],[6,8670,10110],[7,10110,10780],[8,10780,12130],[9,12130,13010],[10,13010,15609],[11,15609,17509],[12,17509,19049],[13,19049,20169],[14,20169,22069],[15,22069,22509],[16,22509,25804]]}}