{"name":"12:18","price":"اور یوسف کے کرتے کو جھوٹ موٹ کے خون سے خون آلود بھی کر ﻻئے تھے، باپ نے کہا یوں نہیں، بلکہ تم نے اپنے دل ہی سے ایک بات بنا لی ہے۔ پس صبر ہی بہتر ہے(1) ، اور تمہاری بنائی ہوئی باتوں پر اللہ ہی سے مدد کی طلب ہے.(2)","arabic":"وَجَآءُو عَلَىٰ قَمِيصِهِۦ بِدَمٖ كَذِبٖۚ قَالَ بَلۡ سَوَّلَتۡ لَكُمۡ أَنفُسُكُمۡ أَمۡرٗاۖ فَصَبۡرٞ جَمِيلٞۖ وَٱللَّهُ ٱلۡمُسۡتَعَانُ عَلَىٰ مَا تَصِفُونَ","category":["12 (Yusuf)","Yusuf","Surah Yusuf","Chapter Yusuf","Surah 12","Chapter 12","Joseph","يوسُف"],"ayahNumber":1614,"juzNumber":12,"footnotes":"(1) کہتے ہیں کہ ایک بکری کا بچہ ذبح کر کے یوسف (عليه السلام) کی قمیص خون میں لت پت کر لی اور یہ بھول گئے کہ بھیڑیا اگر یوسف (عليه السلام) کو کھاتا تو قمیص کو بھی پھٹنا تھا، قمیص ثابت کی ثابت ہی تھی جس کو دیکھ کر، علاوہ ازیں حضرت یوسف (عليه السلام) کے خواب اور فراست نبوت سے اندازہ لگا کر حضرت یعقوب (عليه السلام) نے فرمایا کہ یہ واقعہ اس طرح پیش نہیں آیا جو تم بیان کر رہے ہو، بلکہ تم نے اپنے دلوں سے ہی یہ بات بنا لی ہے، تاہم چونکہ، جو ہونا تھا، ہوچکا تھا، حضرت یعقوب اس کی تفصیل سے بےخبر تھے، اس لئے سوائے صبر کے کوئی چارہ اور اللہ کی مدد کے علاوہ کوئی سہارا نہ تھا۔\n(2) منافقین نے جب حضرت عائشہ (رضي الله عنه) ا پر تہمت لگائی تو انہوں نے بھی نبی (صلى الله عليه وسلم) کے افہام وارشاد کے جواب میں فرمایا تھا۔ وَاللهِ لا أَجِدُ لِي وَلا لَكُمْ مَثَلا إِلا أَبَا يُوسُفَ «فَصَبْرٌ جَمِيلٌ وَاللَّهُ الْمُسْتَعَانُ عَلَى مَا تَصِفُونَ» (صحيح بخاري ، تفسير سورة يوسف) ”اللہ کی قسم میں اپنے اور آپ لوگوں کے لیے وہی مثال پاتی ہوں جس سے یوسف (عليه السلام) کے باپ یعقوب (عليه السلام) کو سابقہ پیش آیا تھا اور انہوں نے فَصَبْرٌ جَمِيلٌ کہہ کر صبر کا راستہ اختیار کیا تھا“، یعنی میرے لیے بھی سوائے صبر کے کوئی چارہ نہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wajāū ʿalā qamīṣihi bidamin kadhibin qāla bal sawwalat lakum anfusukum amran faṣabrun jamīlun wal-lahu al-mus'taʿānu ʿalā mā taṣifūna ","translations":["And they brought","upon","his shirt","with false blood","with false blood","He said","Nay","has enticed you","has enticed you","your souls","(to) a matter","so patience","(is) beautiful","And Allah","(is) the One sought for help","against","what","you describe","(18)"],"transliterationArr":["wajāū","ʿalā","qamīṣihi","bidamin","kadhibin","qāla","bal","sawwalat","lakum","anfusukum","amran","faṣabrun","jamīlun","wal-lahu","al-mus'taʿānu","ʿalā","mā","taṣifūna",null],"verseTiming":[[1,0,3050],[2,3050,3680],[3,3680,5180],[4,5180,7140],[5,7140,8480],[6,8480,9160],[7,9160,9560],[8,9560,10790],[9,10790,11460],[10,11460,13530],[11,13530,15000],[12,15000,16350],[13,16350,18830],[14,18830,19930],[15,19930,21550],[16,21550,22220],[17,22220,22640],[18,22640,25785]]}}