{"name":"12:10","price":"ان میں سے ایک نے کہا یوسف کو قتل تو نہ کرو بلکہ اسے کسی اندھے کنوئیں (کی تہ) میں ڈال آؤ کہ(1) اسے کوئی (آتا جاتا) قافلہ اٹھا لے جائے اگر تمہیں کرنا ہی ہے تو یوں کرو.(2)","arabic":"قَالَ قَآئِلٞ مِّنۡهُمۡ لَا تَقۡتُلُواْ يُوسُفَ وَأَلۡقُوهُ فِي غَيَٰبَتِ ٱلۡجُبِّ يَلۡتَقِطۡهُ بَعۡضُ ٱلسَّيَّارَةِ إِن كُنتُمۡ فَٰعِلِينَ","category":["12 (Yusuf)","Yusuf","Surah Yusuf","Chapter Yusuf","Surah 12","Chapter 12","Joseph","يوسُف"],"ayahNumber":1606,"juzNumber":12,"footnotes":"(1) جُبٌّ کنویں کو اور غَيَابَةٌ اس کی تہ اور گہرائی کو کہتے ہیں، کنواں ویسے بھی گہرا ہی ہوتا ہے اور اس میں گری ہوئی چیز کسی کو نظر نہیں آتی۔ جب اس کے ساتھ کنویں کی گہرائی کا بھی ذکر کیا تو گویا مبالغے کا اظہار کیا۔\n(2) یعنی آنے جانے والے نو وارد مسافر، جب پانی کی تلاش میں کنوئیں پر آئیں گے تو ممکن ہے کسی کے علم میں آ جائے کہ کنوئیں میں کوئی انسان گرا ہوا ہے اور وہ اسے نکال کر اپنے ساتھ لے جائیں۔ یہ تجویز ایک بھائی نے ازراہ شفقت پیش کی تھی۔ قتل کے مقابلے میں یہ تجویز واقعتا ہمدردی کے جذبات ہی کی حامل ہے۔ بھائیوں کی آتش حسد اتنی بھڑکی ہوئی تھی کہ یہ تجویز بھی اس نے ڈرتے ڈرتے ہی پیش کی کہ اگر تمہیں کچھ کرنا ہی ہے تو یہ کام اس طرح کر لو۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qāla qāilun min'hum lā taqtulū yūsufa wa-alqūhu fī ghayābati al-jubi yaltaqiṭ'hu baʿḍu al-sayārati in kuntum fāʿilīna ","translations":["Said","a speaker","among them","(Do) not","kill","Yusuf","but throw him","in","the bottom","(of) the well","will pick him","some","[the] caravan","if","you are","doing","(10)"],"transliterationArr":["qāla","qāilun","min'hum","lā","taqtulū","yūsufa","wa-alqūhu","fī","ghayābati","al-jubi","yaltaqiṭ'hu","baʿḍu","al-sayārati","in","kuntum","fāʿilīna",null],"verseTiming":[[1,0,710],[2,710,3600],[3,3600,5500],[4,5500,5930],[5,5930,7090],[6,7090,8120],[7,8120,9470],[8,9470,9930],[9,9930,11140],[10,11140,12030],[11,12030,13460],[12,13460,14120],[13,14120,15800],[14,15800,17040],[15,17040,18790],[16,18790,22145]]}}