{"name":"12:102","price":"یہ غیب کی خبروں میں سے ہے جس کی ہم آپ کی طرف وحی کر رہے ہیں۔ آپ ان کے پاس نہ تھے جب کہ انہوں نے اپنی بات ٹھان لی تھی اور وه فریب کرنے لگے تھے.(1)","arabic":"ذَٰلِكَ مِنۡ أَنۢبَآءِ ٱلۡغَيۡبِ نُوحِيهِ إِلَيۡكَۖ وَمَا كُنتَ لَدَيۡهِمۡ إِذۡ أَجۡمَعُوٓاْ أَمۡرَهُمۡ وَهُمۡ يَمۡكُرُونَ","category":["12 (Yusuf)","Yusuf","Surah Yusuf","Chapter Yusuf","Surah 12","Chapter 12","Joseph","يوسُف"],"ayahNumber":1698,"juzNumber":13,"footnotes":"(1) یعنی یوسف (عليه السلام) کے ساتھ، جب کہ انہیں کنوئیں میں پھینک آئے یا مراد حضرت یعقوب (عليه السلام) ہیں یعنی ان کو یہ کہہ کر کہ یوسف کو بھیڑیا کھا گیا ہے اور یہ اس کی قمیص ہے، جو خون میں لت پت ہے ان کے ساتھ فریب کیا۔ اللہ تعالٰی نے اس مقام پر بھی اس بات کی نفی فرمائی ہے کہ نبی کریم (صلى الله عليه وسلم) کو غیب کا علم تھا لیکن یہ نفی مطلق علم کی نہیں ہے کیونکہ اللہ نے وحی کے ذریعے سے آپ کو آگاہ فرمایا دیا۔ یہ نفی مشاہد کی ہے کہ اس وقت آپ وہاں موجود نہیں تھے۔ اسی طرح ایسے لوگوں سے بھی آپ کا رابطہ و تعلق نہیں رہا ہے جن سے آپ نے سنا ہو۔ یہ صرف اللہ تعالٰی ہی ہے جس نے آپ کو اس واقعہ کی خبر دی ہے جو اس بات کی دلیل ہے کہ آپ اللہ کے سچے نبی ہیں اور اللہ تعالٰی کی طرف سے آپ کو وحی نازل ہوتی ہے۔ اللہ تعالٰی نے اور بھی کئی مقامات پر اسی طرح غیب اور مشاہدے کی نفی فرمائی ہے۔ (مثلاً ملاحظہ ہو سورہ آل عمران:7، 44، القصص:46-45، سورۂ ص:70۔69)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"dhālika min anbāi al-ghaybi nūḥīhi ilayka wamā kunta ladayhim idh ajmaʿū amrahum wahum yamkurūna ","translations":["That","(is) from","the news","(of) the unseen","which We reveal","to you","And not","you were","with them","when","they put together","their plan","while they","(were) plotting","(102)"],"transliterationArr":["dhālika","min","anbāi","al-ghaybi","nūḥīhi","ilayka","wamā","kunta","ladayhim","idh","ajmaʿū","amrahum","wahum","yamkurūna",null],"verseTiming":[[1,0,1040],[2,1040,1470],[3,1470,4810],[4,4810,5690],[5,5690,6790],[6,6790,8730],[7,8730,9870],[8,9870,11570],[9,11570,12600],[10,12600,13010],[11,13010,15400],[12,15400,16440],[13,16440,17110],[14,17110,20375]]}}