{"name":"12:31","price":"اس نے جب ان کی اس پر فریب غیبت کا حال سنا تو انہیں بلوا بھیجا(1) اور ان کے لئے ایک مجلس مرتب کی(2) اور ان میں سے ہر ایک کو چھری دی۔ اور کہا اے یوسف! ان کے سامنے چلے آؤ(3)، ان عورتوں نے جب اسے دیکھا تو بہت بڑا جانا اور اپنے ہاتھ کاٹ لئے(4)، اور زبان سے نکل گیا کہ حاشاللہ! یہ انسان تو ہرگز نہیں، یہ تو یقیناً کوئی بہت ہی بزرگ فرشتہ ہے.(5)","arabic":"فَلَمَّا سَمِعَتۡ بِمَكۡرِهِنَّ أَرۡسَلَتۡ إِلَيۡهِنَّ وَأَعۡتَدَتۡ لَهُنَّ مُتَّكَـٔٗا وَءَاتَتۡ كُلَّ وَٰحِدَةٖ مِّنۡهُنَّ سِكِّينٗا وَقَالَتِ ٱخۡرُجۡ عَلَيۡهِنَّۖ فَلَمَّا رَأَيۡنَهُۥٓ أَكۡبَرۡنَهُۥ وَقَطَّعۡنَ أَيۡدِيَهُنَّ وَقُلۡنَ حَٰشَ لِلَّهِ مَا هَٰذَا بَشَرًا إِنۡ هَٰذَآ إِلَّا مَلَكٞ كَرِيمٞ","category":["12 (Yusuf)","Yusuf","Surah Yusuf","Chapter Yusuf","Surah 12","Chapter 12","Joseph","يوسُف"],"ayahNumber":1627,"juzNumber":12,"footnotes":"(1) زنان مصر کی غائبانہ باتوں اور طعن و ملامت کو مکر سے تعبیر کیا گیا، جس کی وجہ سے بعض مفسرین نے یہ بیان کیا ہے کہ ان عورتوں کو بھی یوسف کے بےمثال حسن و جمال کی اطلاعات پہنچ چکی تھیں۔ چنانچہ وہ اس پیکر حسن کو دیکھنا چاہتی تھیں چنانچہ وہ اپنے اس مکر خفیہ تدبیر میں کامیاب ہوگئیں اور امرأۃ العزیز نے یہ بتلانے کے لیے کہ میں جس پر فریفتہ ہوئی ہوں، محض ایک غلام یا عام آدمی نہیں ہے بلکہ ظاہر و باطن کے ایسے حسن سے آراستہ ہے کہ اسے دیکھ کر نقد دل و جان ہار جانا کوئی انہونی بات نہیں، لہذا ان عورتوں کی ضیافت کا اہتمام کیا اور انہیں دعوت طعام دی۔\n(2) یعنی ایسی نشست گاہیں بنائیں جن میں تکئے لگے ہوئے تھے، جیسا کہ آج کل بھی عربوں میں ایسی فرشی نشست گاہیں عام ہیں۔ حتی کہ ہوٹلوں اور ریستورانوں میں بھی ان کا اہتمام ہے۔\n(3) یعنی حضرت یوسف (عليه السلام) کو پہلے چھپائے رکھا، جب سب عورتوں نے ہاتھوں میں چھریاں پکڑ لیں تو امراۃ العزیز (زلیخا) نے حضرت یوسف (عليه السلام) کو مجلس میں حاضر ہونے کا حکم دیا۔\n(4) یعنی حسن یوسف (عليه السلام) کی جلوہ آرائی دیکھ کر ایک تو ان کے عظمت و جلال شان کا اعتراف کیا اور دوسرے، ان پر بےخودی کی ایسی کیفیت طاری ہوئی کہ چھریاں اپنے ہاتھوں پر چلا لیں۔ جس سے ان کے ہاتھ زخمی اور خون آلودہ ہوگئے۔ حدیث میں آتا ہے کہ حضرت یوسف (عليه السلام) کو نصف حسن دیا گیا ہے (صحيح مسلم، كتاب الإيمان، باب الإسراء)\n(5) اس کے یہ معنی نہیں ہیں کہ فرشتے شکل وصورت میں انسان سے بہتر یا افضل ہیں۔ کیونکہ فرشتوں کو تو انسانوں نے دیکھا ہی نہیں ہے۔ علاوہ ازیں انسان کے بارے میں تو اللہ تعالٰی نے خود قرآن کریم میں صراحت کی ہے کہ ہم نے اسے احسن تقویم بہترین انداز میں پیدا کیا ہے۔ ان عورتوں نے بشریت کی نفی محض اس لیے کی کہ انہوں نے حسن وجمال کا ایک ایسا پیکر دیکھا تھا جو انسانی شکل میں کبھی ان کی نظروں سے نہیں گزرا تھا اور انہوں نے فرشتہ اس لیے قرار دیا کہ عام انسان یہی سمجھتا ہے فرشتے ذات وصفات کے لحاظ سے ایسی شکل رکھتے ہیں جو انسانی شکل سے بالاتر ہے۔ اس سے یہ معلوم ہوا کہ انبیاء کی غیر معمولی خصوصیات و امتیازات کی بناء پر انہیں انسانیت سے نکال کر نورانی مخلوق قرار دینا، ہر دور کے ایسے لوگوں کا شیوہ رہا ہے جو نبوت اور اس کے مقام سے ناآشنا ہوتے ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"falammā samiʿat bimakrihinna arsalat ilayhinna wa-aʿtadat lahunna muttaka-an waātat kulla wāḥidatin min'hunna sikkīnan waqālati ukh'ruj ʿalayhinna falammā ra-aynahu akbarnahu waqaṭṭaʿna aydiyahunna waqul'na ḥāsha lillahi mā hādhā basharan in hādhā illā malakun karīmun ","translations":["So when","she heard","of their scheming","she sent","for them","and she prepared","for them","a banquet","and she gave","each","one","of them","a knife","and she said","Come out","before them","Then when","they saw him","they greatly admired him","and cut","their hands","they said","Forbid","Allah","not","(is) this","a man","not","(is) this","but","an angel","noble","(31)"],"transliterationArr":["falammā","samiʿat","bimakrihinna","arsalat","ilayhinna","wa-aʿtadat","lahunna","muttaka-an","waātat","kulla","wāḥidatin","min'hunna","sikkīnan","waqālati","ukh'ruj","ʿalayhinna","falammā","ra-aynahu","akbarnahu","waqaṭṭaʿna","aydiyahunna","waqul'na","ḥāsha","lillahi","mā","hādhā","basharan","in","hādhā","illā","malakun","karīmun",null],"verseTiming":[[1,0,1690],[2,1690,2570],[3,2570,4690],[4,4690,5690],[5,5690,7430],[6,7430,8650],[7,8650,9980],[8,9980,11950],[9,11950,13000],[10,13000,13600],[11,13600,14630],[12,14630,17210],[13,17210,19190],[14,19190,20220],[15,20220,20850],[16,20850,22710],[17,22710,24940],[18,24940,27490],[19,27490,28990],[20,28990,30180],[21,30180,32240],[22,32240,33040],[23,33040,33730],[24,33730,34830],[25,34830,35290],[26,35290,36160],[27,36160,36980],[28,36980,37420],[29,37420,39820],[30,39820,40690],[31,40690,42570],[32,42570,45175]]}}