{"name":"12:3","price":"ہم آپ کے سامنے بہترین بیان(1) پیش کرتے ہیں اس وجہ سے کہ ہم نے آپ کی جانب یہ قرآن وحی کے ذریعے نازل کیا اور یقیناً آپ اس سے پہلے بے خبروں میں سے تھے.(2)","arabic":"نَحۡنُ نَقُصُّ عَلَيۡكَ أَحۡسَنَ ٱلۡقَصَصِ بِمَآ أَوۡحَيۡنَآ إِلَيۡكَ هَٰذَا ٱلۡقُرۡءَانَ وَإِن كُنتَ مِن قَبۡلِهِۦ لَمِنَ ٱلۡغَٰفِلِينَ","category":["12 (Yusuf)","Yusuf","Surah Yusuf","Chapter Yusuf","Surah 12","Chapter 12","Joseph","يوسُف"],"ayahNumber":1599,"juzNumber":12,"footnotes":"(1) قصص، یہ مصدر ہے، اس کے معنی ہیں کسی چیز کے پیچھے لگنا، مطلب دلچسپ واقعہ ہے قصہ، محض کہانی یا طبع زاد افسانے کو نہیں کہا جاتا بلکہ ماضی میں گزر جانے والے واقعے کے بیان کو قصہ کہا جاتا ہے۔ یہ گویا ماضی کا واقعی اور حقیقی بیان ہے اور اس واقع میں حسد و عناد کا انجام، تائید الٰہی کی کرشمہ سازیاں، نفس امارہ کی شورشیں اور سرکشیوں کا نتیجہ اور دیگر انسانی عوارض و حوارث کا نہایت دلچسپ بیان اور عبرت انگیز پہلو ہیں، اس لئے اس قرآن نے احسن القصص(بہترین بیان) سے تعبیر کیا ہے۔\n(2) قرآن کریم کے ان الفاظ سے بھی واضح ہے نبی کریم عالم الغیب نہیں تھے، ورنہ اللہ تعالٰی آپ کو بےخبر قرار نہ دیتا، دوسری بات یہ معلوم ہوئی کہ آپ(صلى الله عليه وسلم) اللہ کے سچے نبی ہیں کیونکہ آپ پر وحی کے ذریعے سے ہی سچا واقعہ بیان کیا گیا ہے۔ آپ نہ کسی کے شاگرد تھے، کہ کسی استاد سے سیکھ کر بیان فرما دیتے، نہ کسی اور سے ہی ایسا تعلق تھا کہ جس سے سن کر تاریخ کا یہ واقعہ اپنے اہم جزئیات کے ساتھ آپ نشر کر دیتے۔ یہ یقیناً اللہ تعالٰی ہی نے وحی کے ذریعے سے آپ پر نازل فرمایا ہے جیسا کہ اس مقام پر صراحت کی گئی ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"naḥnu naquṣṣu ʿalayka aḥsana al-qaṣaṣi bimā awḥaynā ilayka hādhā al-qur'āna wa-in kunta min qablihi lamina al-ghāfilīna ","translations":["We","relate","to you","the best","of the narrations","in what","We have revealed","to you","(of) this","the Quran","although","you were","before it","before it","surely among","the unaware","(3)"],"transliterationArr":["naḥnu","naquṣṣu","ʿalayka","aḥsana","al-qaṣaṣi","bimā","awḥaynā","ilayka","hādhā","al-qur'āna","wa-in","kunta","min","qablihi","lamina","al-ghāfilīna",null],"verseTiming":[[1,0,750],[2,750,1660],[3,1660,2550],[4,2550,3360],[5,3360,4370],[6,4370,6320],[7,6320,9030],[8,9030,9930],[9,9930,10540],[10,10540,11990],[11,11990,13210],[12,13210,14620],[13,14620,15950],[14,15950,17040],[15,17040,17570],[16,17570,21235]]}}