{"name":"12:4","price":"جب کہ یوسف (1) نے اپنے باپ سے ذکر کیا کہ ابا جان میں نے گیاره ستاروں کو اور سورج چاند کو(2) دیکھا کہ وه سب مجھے سجده کر رہے ہیں.","arabic":"إِذۡ قَالَ يُوسُفُ لِأَبِيهِ يَٰٓأَبَتِ إِنِّي رَأَيۡتُ أَحَدَ عَشَرَ كَوۡكَبٗا وَٱلشَّمۡسَ وَٱلۡقَمَرَ رَأَيۡتُهُمۡ لِي سَٰجِدِينَ","category":["12 (Yusuf)","Yusuf","Surah Yusuf","Chapter Yusuf","Surah 12","Chapter 12","Joseph","يوسُف"],"ayahNumber":1600,"juzNumber":12,"footnotes":"(1) یعنی اے محمد! (صلى الله عليه وسلم) اپنی قوم کے سامنے یوسف (عليه السلام) کا قصہ بیان کرو، جب اس نے اپنے باپ کو کہا باپ حضرت یعقوب (عليه السلام) تھے، جیسا کہ دوسرے مقام پر صراحت ہے اور حدیث میں بھی یہ نسب بیان کیا گیا ہے۔ ”الْكَرِيمُ ابْنُ الْكَرِيمِ ابْنِ الْكَرِيمِ يُوسُفُ بْنُ يَعْقُوبَ بْنِ إِسْحَاقَ بْنِ إِبْرَاهِيمَ“ (مسند أحمد - جلد 2ص96)۔ (2) بعض مفسرین نے کہا ہے کہ گیارہ ستاروں سے مراد حضرت یوسف (عليه السلام) کے بھائی ہیں جو گیارہ تھے چاند سورج سے مراد ماں اور باپ ہیں اور خواب کی تعبیر چالیس یا اسی سال کے بعد اس وقت سامنے آئی جب یہ سارے بھائی اپنے والدین سمیت مصر گئے اور وہاں حضرت یوسف (عليه السلام) کے سامنے سجدہ ریز ہوگئے، جیسا کہ یہ تفصیل سورت کے آخر میں آئے گی۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"idh qāla yūsufu li-abīhi yāabati innī ra-aytu aḥada ʿashara kawkaban wal-shamsa wal-qamara ra-aytuhum lī sājidīna ","translations":["When","said","Yusuf","to his father","O my father","Indeed, I","I saw","eleven","eleven","stars","and the sun","and the moon","I saw them","to me","prostrating","(4)"],"transliterationArr":["idh","qāla","yūsufu","li-abīhi","yāabati","innī","ra-aytu","aḥada","ʿashara","kawkaban","wal-shamsa","wal-qamara","ra-aytuhum","lī","sājidīna",null],"verseTiming":[[1,0,490],[2,490,1220],[3,1220,2070],[4,2070,3300],[5,3300,5860],[6,5860,7400],[7,7400,8350],[8,8350,8980],[9,8980,9700],[10,9700,11580],[11,11580,12620],[12,12620,13820],[13,13820,15150],[14,15150,15600],[15,15600,18965]]}}