{"name":"12:40","price":"اس کے سوا تم جن کی پوجا پاٹ کر رہے ہو وه سب نام ہی نام ہیں جو تم نے اور تمہارے باپ دادوں نے خود ہی گھڑ لئے ہیں۔ اللہ تعالیٰ نے ان کی کوئی دلیل نازل نہیں فرمائی(1) ، فرمانروائی صرف اللہ تعالیٰ ہی کی ہے، اس کا فرمان ہے کہ تم سب سوائے اس کے کسی اور کی عبادت نہ کرو، یہی دین درست (2)ہے لیکن اکثر لوگ نہیں جانتے.(3)","arabic":"مَا تَعۡبُدُونَ مِن دُونِهِۦٓ إِلَّآ أَسۡمَآءٗ سَمَّيۡتُمُوهَآ أَنتُمۡ وَءَابَآؤُكُم مَّآ أَنزَلَ ٱللَّهُ بِهَا مِن سُلۡطَٰنٍۚ إِنِ ٱلۡحُكۡمُ إِلَّا لِلَّهِ أَمَرَ أَلَّا تَعۡبُدُوٓاْ إِلَّآ إِيَّاهُۚ ذَٰلِكَ ٱلدِّينُ ٱلۡقَيِّمُ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يَعۡلَمُونَ","category":["12 (Yusuf)","Yusuf","Surah Yusuf","Chapter Yusuf","Surah 12","Chapter 12","Joseph","يوسُف"],"ayahNumber":1636,"juzNumber":12,"footnotes":"(1) اس کا ایک مطلب یہ ہے کہ ان کا نام معبود تم نے خود ہی رکھ لیا ہے، دراں حالیکہ وہ معبود ہیں نہ ان کی بابت کوئی دلیل اللہ نے اتاری ہے۔ دوسرا مطلب یہ ہے کہ ان معبودوں کے جو مختلف نام تم نے تجویز کر رکھے ہیں۔ مثلا خواجہ غریب نواز، گنج بخش کرنی والا، کرماں والا وغیرہ یہ سب تمہارے خود ساختہ ہیں۔ ان کی کوئی دلیل اللہ نے نہیں اتاری۔\n(2) یہی دین، جس کی طرف میں تمہیں بلا رہا ہوں، جس میں صرف ایک اللہ کی عبادت ہے، درست اور رقیم ہے جس کا حکم اللہ نے دیا ہے۔\n(3) جس کی وجہ سے اکثر لوگ شرک کا ارتکاب کرتے ہیں «وَمَاوَمَا يُؤْمِنُ اَكْثَرُهُمْ بِاللّٰهِ اِلَّا وَهُمْ مُّشْرِكُوْنَ» (سورۂ یوسف:106) ”ان میں سے اکثر لوگ باوجود اللہ پر ایمان رکھنے کے بھی مشرک ہی ہیں“ اور فرمایا «وَمَآ اَكْثَرُ النَّاسِ وَلَوْ حَرَصْتَ بِمُؤْمِنِيْنَ» (سورۂ یوسف:103) ”اے پیغمبر تیری خواہش کے باوجود اکثر لوگ اللہ پر ایمان لانے والے نہیں ہیں“۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"mā taʿbudūna min dūnihi illā asmāan sammaytumūhā antum waābāukum mā anzala al-lahu bihā min sul'ṭānin ini al-ḥuk'mu illā lillahi amara allā taʿbudū illā iyyāhu dhālika al-dīnu al-qayimu walākinna akthara al-nāsi lā yaʿlamūna ","translations":["Not","you worship","besides Him","besides Him","but","names","which you have named them","you","and your forefathers","not","(has) sent down","Allah","for it","any","authority","Not","(is) the command","but","for Allah","He has commanded","that not","you worship","but","Him Alone","That","(is) the religion","the right","but","most","[the] men","(do) not","know","(40)"],"transliterationArr":["mā","taʿbudūna","min","dūnihi","illā","asmāan","sammaytumūhā","antum","waābāukum","mā","anzala","al-lahu","bihā","min","sul'ṭānin","ini","al-ḥuk'mu","illā","lillahi","amara","allā","taʿbudū","illā","iyyāhu","dhālika","al-dīnu","al-qayimu","walākinna","akthara","al-nāsi","lā","yaʿlamūna",null],"verseTiming":[[1,0,510],[2,510,1950],[3,1950,3150],[4,3150,5750],[5,5750,8320],[6,8320,12350],[7,12350,15230],[8,15230,20410],[9,20410,22030],[10,22030,25330],[11,25330,27960],[12,27960,29310],[13,29310,30280],[14,30280,30930],[15,30930,32230],[16,32230,34570],[17,34570,35670],[18,35670,36620],[19,36620,37530],[20,37530,40700],[21,40700,41310],[22,41310,42100],[23,42100,44660],[24,44660,45710],[25,45710,47710],[26,47710,50070],[27,50070,51620],[28,51620,52440],[29,52440,53670],[30,53670,55470],[31,55470,56290],[32,56290,58020],[33,58020,58420],[34,58420,62035]]}}