{"name":"12:55","price":"(یوسف نے) کہا آپ مجھے ملک کے خزانوں پر مقرر کر دیجئے(1) ، میں حفاﻇت کرنے واﻻ اور باخبر ہوں.(2)","arabic":"قَالَ ٱجۡعَلۡنِي عَلَىٰ خَزَآئِنِ ٱلۡأَرۡضِۖ إِنِّي حَفِيظٌ عَلِيمٞ","category":["12 (Yusuf)","Yusuf","Surah Yusuf","Chapter Yusuf","Surah 12","Chapter 12","Joseph","يوسُف"],"ayahNumber":1651,"juzNumber":13,"footnotes":"(1) خزائن خزانۃ کی جمع ہے خزانہ ایسی جگہ کو کہتے ہیں جس میں چیزیں محفوظ کی جاتی ہیں زمین کے خزانوں سے مراد وہ گودام ہیں جہاں غلہ جمع کیا جاتا ہے۔ اس کا انتظام ہاتھ میں لینے کی خواہش اس لئے ظاہر کی کہ مستقبل قریب میں (خواب کی تعبیر کی رو سے) جو قحط سالی کے ایام آنے والے ہیں، اس سے نمٹنے کے لئے مناسب انتطامات کئے جاسکیں اور غلے کی معقول مقدار بچا کر رکھی جاسکے، عام حالات میں اگرچہ عہدہ و منصب کی طلب جائز نہیں ہے، لیکن حضرت یوسف (عليه السلام) کے اس اقدام سے یہ معلوم ہوتا ہے کہ خاص حالات میں اگر کوئی شخص یہ سمجھتا ہے کہ قوم اور ملک کو جو خطرات درپیش ہیں اور ان سے نمٹنے کی اچھی صلاحیت میرے اندر موجود ہیں جو دوسروں میں نہیں ہیں، تو وہ اپنی اہلیت کے مطابق اس مخصوص عہدے اور منصب کی طلب کر سکتا ہے علاوہ ازیں حضرت یوسف (عليه السلام) نے تو سرے سے عہدا و منصب طلب ہی نہیں کیا، البتہ جب بادشاہ مصر نے انہیں پیشکش کی تو پھر ایسے عہدے کی خواہش کی جس میں انہوں نے ملک اور قوم کی خدمت کا پہلو نمایاں دیکھا۔\n(2) حَفِیْظ میں اس کی اس طرح حفاظت کروں گا کہ اسے کسی بھی غیر ضروری مصرف میں خرچ نہیں کروں گا عَلِیْم اس کو جمع کرنے اور خرچ کرنے اور اس کے رکھنے اور نکالنے کا بخوبی علم رکھتا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qāla ij'ʿalnī ʿalā khazāini al-arḍi innī ḥafīẓun ʿalīmun ","translations":["He said","Appoint me","over","(the) treasuries","(of) the land","Indeed, I","(will be) a guardian","knowing","(55)"],"transliterationArr":["qāla","ij'ʿalnī","ʿalā","khazāini","al-arḍi","innī","ḥafīẓun","ʿalīmun",null],"verseTiming":[[1,0,650],[2,650,1760],[3,1760,2350],[4,2350,4759],[5,4759,5609],[6,5609,6829],[7,6829,7889],[8,7889,10584]]}}