{"name":"12:5","price":"یعقوب علیہ السلام نے کہا پیارے بچے! اپنے اس خواب کا ذکر اپنے بھائیوں سے نہ کرنا۔ ایسا نہ ہو کہ وه تیرے ساتھ کوئی فریب کاری کریں(1) ، شیطان تو انسان کا کھلا دشمن ہے.(2)","arabic":"قَالَ يَٰبُنَيَّ لَا تَقۡصُصۡ رُءۡيَاكَ عَلَىٰٓ إِخۡوَتِكَ فَيَكِيدُواْ لَكَ كَيۡدًاۖ إِنَّ ٱلشَّيۡطَٰنَ لِلۡإِنسَٰنِ عَدُوّٞ مُّبِينٞ","category":["12 (Yusuf)","Yusuf","Surah Yusuf","Chapter Yusuf","Surah 12","Chapter 12","Joseph","يوسُف"],"ayahNumber":1601,"juzNumber":12,"footnotes":"(1) حضرت یعقوب (عليه السلام) نے خواب سے اندازہ لگا لیا کہ ان کا یہ بیٹا عظمت شان کا حامل ہوگا، اس لئے انہیں اندیشہ ہوا کہ یہ خواب سن کر اس کے دوسرے بھائی بھی اس کی عظمت کا اندازہ کر کے کہیں اسے نقصان نہ پہنچائیں، بنا بریں انہوں نے یہ خواب بیان کرنے سے منع فرمایا۔\n(2) یہ بھائیوں کے مکروفریب کی وجہ بیان فرما دی کہ شیطان چونکہ انسان کا ازلی دشمن ہے اس لئے وہ انسانوں کو بہکانے، گمراہ کرنے اور انہیں حسد و بغض میں مبتلا کرنے میں ہر وقت کوشاں اور تاک میں رہتا ہے۔ چنانچہ یہ شیطان کے لئے بڑا اچھا موقع تھا کہ وہ حضرت یوسف (عليه السلام) کے خلاف بھائیوں کے دلوں میں حسد اور بغض کی آگ بھڑکا دے۔ جیسا کہ فی الواقع بعد میں اس نے ایسا ہی کیا اور حضرت یعقوب (عليه السلام) کا اندیشہ درست ثابت ہوا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qāla yābunayya lā taqṣuṣ ru'yāka ʿalā ikh'watika fayakīdū laka kaydan inna al-shayṭāna lil'insāni ʿaduwwun mubīnun ","translations":["He said","O my son","(Do) not","relate","your vision","to","your brothers","lest they plan","against you","a plot","Indeed","the Shaitaan","(is) to man","an enemy","open","(5)"],"transliterationArr":["qāla","yābunayya","lā","taqṣuṣ","ru'yāka","ʿalā","ikh'watika","fayakīdū","laka","kaydan","inna","al-shayṭāna","lil'insāni","ʿaduwwun","mubīnun",null],"verseTiming":[[1,0,740],[2,740,2180],[3,2180,2540],[4,2540,3550],[5,3550,4630],[6,4630,6550],[7,6550,7650],[8,7650,9070],[9,9070,9490],[10,9490,11130],[11,11130,12500],[12,12500,13940],[13,13940,16460],[14,16460,17430],[15,17430,21835]]}}