{"name":"12:52","price":"(یوسف علیہ السلام نے کہا) یہ اس واسطے کہ (عزیز) جان لے کہ میں نے اس کی پیٹھ پیچھے اس کی خیانت نہیں کی(1) اور یہ بھی کہ اللہ دغابازوں کے ہتھکنڈے چلنے نہیں دیتا.(2)","arabic":"ذَٰلِكَ لِيَعۡلَمَ أَنِّي لَمۡ أَخُنۡهُ بِٱلۡغَيۡبِ وَأَنَّ ٱللَّهَ لَا يَهۡدِي كَيۡدَ ٱلۡخَآئِنِينَ","category":["12 (Yusuf)","Yusuf","Surah Yusuf","Chapter Yusuf","Surah 12","Chapter 12","Joseph","يوسُف"],"ayahNumber":1648,"juzNumber":12,"footnotes":"(1) جب جیل میں حضرت یوسف (عليه السلام) کو ساری تفصیل بتلائی گئی تو اسے سن کر یوسف (عليه السلام) نے کہا اور بعض کہتے ہیں کہ بادشاہ کے پاس جا کر انہوں نے یہ کہا اور بعض مفسرین کے نزدیک زلیخا کا قول ہے اور مطلب یہ ہے کہ یوسف (عليه السلام) کی غیر موجودگی میں بھی اس غلط طور پر خیانت کا ارتکاب نہیں کرتی بلکہ امانت کے تقاضوں کو سامنے رکھتے ہوئے اپنی غلطی کا اعتراف کرتی ہوں۔ یا یہ مطلب ہے کہ میں نے اپنے خاوند کی خیانت نہیں کی اور کسی بڑے گناہ میں واقعہ نہیں ہوئی۔ امام ابن کثیر نے اسی قول کو ترجیح دی ہے۔\n(2) کہ وہ اپنے مکر وفریب میں ہمیشہ کامیاب ہی رہیں، بلکہ ان کا اثر محدود اور عارضی ہوتا ہے۔ بالآخر جیت حق اور اہل حق ہی کی ہوتی ہے، گو عارضی طور پر اہل حق کو آزمائشوں سے گزرنا پڑے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"dhālika liyaʿlama annī lam akhun'hu bil-ghaybi wa-anna al-laha lā yahdī kayda al-khāinīna ","translations":["That","he may know","that I","not","[I] betray him","in secret","and that","Allah","(does) not","guide","(the) plan","(of) the betrayers","(52)"],"transliterationArr":["dhālika","liyaʿlama","annī","lam","akhun'hu","bil-ghaybi","wa-anna","al-laha","lā","yahdī","kayda","al-khāinīna",null],"verseTiming":[[1,0,980],[2,980,2080],[3,2080,3470],[4,3470,3850],[5,3850,4830],[6,4830,5880],[7,5880,7210],[8,7210,8100],[9,8100,8640],[10,8640,9540],[11,9540,10190],[12,10190,15195]]}}