{"name":"12:50","price":"اور بادشاه نے کہا یوسف کو میرے پاس لاؤ(1) ، جب قاصد یوسف کے پاس پہنچا تو انہوں نے کہا، اپنے بادشاه کے پاس واپس جا اور اس سے پوچھ کہ ان عورتوں کا حقیقی واقعہ کیا ہے جنہوں نے اپنے ہاتھ کاٹ لئے(2)، تھے؟ ان کے حیلے کو (صحیح طور پر) جاننے واﻻ میرا پروردگار ہی ہے.","arabic":"وَقَالَ ٱلۡمَلِكُ ٱئۡتُونِي بِهِۦۖ فَلَمَّا جَآءَهُ ٱلرَّسُولُ قَالَ ٱرۡجِعۡ إِلَىٰ رَبِّكَ فَسۡـَٔلۡهُ مَا بَالُ ٱلنِّسۡوَةِ ٱلَّٰتِي قَطَّعۡنَ أَيۡدِيَهُنَّۚ إِنَّ رَبِّي بِكَيۡدِهِنَّ عَلِيمٞ","category":["12 (Yusuf)","Yusuf","Surah Yusuf","Chapter Yusuf","Surah 12","Chapter 12","Joseph","يوسُف"],"ayahNumber":1646,"juzNumber":12,"footnotes":"(1) مطلب یہ ہے کہ جب وہ شخص تعبیر دریافت کر کے بادشاہ کے پاس گیا اور اسے تعبیر بتائی تو وہ اس تعبیر سے اور حضرت یوسف (عليه السلام) کی بتلائی ہوئی تدبیر سے بڑا متاثر ہوا اور اس نے اندازہ لگا لیا کہ یہ شخص، جسے ایک عرصے سے حوالہ زنداں کیا ہوا ہے، غیر معمولی علم و فضل اور اعلٰی صلاحیتوں کا حامل ہے۔ چنانچہ بادشاہ نے انہیں دربار میں پیش کرنے کا حکم دیا۔\n(2) حضرت یوسف (عليه السلام) نے جب دیکھا کہ بادشاہ اب مائل بہ کرم ہے، تو انہوں نے اس طرح محض عنایت خسوانہ سے جیل سے نکلنے کو پسند نہیں فرمایا، بلکہ اپنے کردار کی رفعت اور پاک دامنی کے اثبات کو ترجیح دی تاکہ دنیا کے سامنے آپ کا کردار اور اس کی بلندی واضح ہو جائے۔ کیونکہ داعی الی اللہ کے لئے یہ عفت و پاک بازی اور رفعت کردار بہت ضروری ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waqāla al-maliku i'tūnī bihi falammā jāahu al-rasūlu qāla ir'jiʿ ilā rabbika fasalhu mā bālu al-nis'wati allātī qaṭṭaʿna aydiyahunna inna rabbī bikaydihinna ʿalīmun ","translations":["And said","the king","Bring him to me","Bring him to me","But when","came to him","the messenger","he said","Return","to","your lord","and ask him","what","(is the) case","(of) the women","who","cut","their hands","Indeed","my Lord","of their plot","(is) All-Knower","(50)"],"transliterationArr":["waqāla","al-maliku","i'tūnī","bihi","falammā","jāahu","al-rasūlu","qāla","ir'jiʿ","ilā","rabbika","fasalhu","mā","bālu","al-nis'wati","allātī","qaṭṭaʿna","aydiyahunna","inna","rabbī","bikaydihinna","ʿalīmun",null],"verseTiming":[[1,0,780],[2,780,1710],[3,1710,2870],[4,2870,3720],[5,3720,5340],[6,5340,7600],[7,7600,8690],[8,8690,9310],[9,9310,9790],[10,9790,10570],[11,10570,11450],[12,11450,12620],[13,12620,12990],[14,12990,13630],[15,13630,15160],[16,15160,16210],[17,16210,17250],[18,17250,19549],[19,19549,21309],[20,21309,22119],[21,22119,24419],[22,24419,27584]]}}