{"name":"12:53","price":"میں اپنے نفس کی پاکیزگی بیان نہیں کرتا(1) ۔ بیشک نفس تو برائی پر ابھارنے واﻻ ہی ہے(2)، مگر یہ کہ میرا پروردگار ہی اپنا رحم کرے(3)، یقیناً میرا پالنے واﻻ بڑی بخشش کرنے واﻻ اور بہت مہربانی فرمانے واﻻ ہے.","arabic":"۞ وَمَآ أُبَرِّئُ نَفۡسِيٓۚ إِنَّ ٱلنَّفۡسَ لَأَمَّارَةُۢ بِٱلسُّوٓءِ إِلَّا مَا رَحِمَ رَبِّيٓۚ إِنَّ رَبِّي غَفُورٞ رَّحِيمٞ","category":["12 (Yusuf)","Yusuf","Surah Yusuf","Chapter Yusuf","Surah 12","Chapter 12","Joseph","يوسُف"],"ayahNumber":1649,"juzNumber":13,"footnotes":"(1) اسے اگر حضرت یوسف (عليه السلام) کا تسلیم کیا جائے تو بطور کسر نفسی کے ہے، ورنہ صاف ظاہر ہے کہ ان کی پاک دامنی ہر طرح سے ثابت ہو چکی تھی۔ اور اگر یہ عزیز مصر کا قول ہے (جیسا کہ امام ابن کثیر کا خیال ہے) تو یہ حقیقت پر مبنی ہے کیونکہ اپنے گناہ کا اور یوسف (عليه السلام) کو بہلانے اور پھسلانے کا اعتراف کر لیا۔\n(2) یہ اس نے اپنی غلطی کی یا اس کی علت بیان کی کہ انسان کا نفس ہی ایسا ہے کہ برائی پر ابھارتا ہے اور اس پر آمادہ کرتا ہے۔\n(3) یعنی نفس کی شرارتوں سے وہی بچتا ہے جس پر اللہ تعالٰی کی رحمت ہو، جیسا کہ حضرت یوسف (عليه السلام) کو اللہ تعالٰی نے بچا لیا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wamā ubarri-u nafsī inna al-nafsa la-ammāratun bil-sūi illā mā raḥima rabbī inna rabbī ghafūrun raḥīmun ","translations":["And not","I absolve","myself","Indeed","the soul","(is) a certain enjoiner","of evil","unless","[that]","bestows Mercy","my Lord","Indeed","my Lord","(is) Oft-Forgiving","Most Merciful","(53)"],"transliterationArr":["wamā","ubarri-u","nafsī","inna","al-nafsa","la-ammāratun","bil-sūi","illā","mā","raḥima","rabbī","inna","rabbī","ghafūrun","raḥīmun",null],"verseTiming":[[1,0,2420],[2,2420,3440],[3,3440,4590],[4,4590,6110],[5,6110,7700],[6,7700,10879],[7,10879,13499],[8,13499,14329],[9,14329,14729],[10,14729,15489],[11,15489,17019],[12,17019,18539],[13,18539,19519],[14,19519,20539],[15,20539,24914]]}}