{"name":"12:67","price":"اور (یعقوب علیہ السلام) نے کہا اے میرے بچو! تم سب ایک دروازے سے نہ جانا بلکہ کئی جدا جدا دروازوں میں سے داخل ہونا(1) ۔ میں اللہ کی طرف سے آنے والی کسی چیز کو تم سے ٹال نہیں سکتا۔ حکم صرف اللہ ہی کا چلتا ہے(2)۔ میرا کامل بھروسہ اسی پر ہے اور ہر ایک بھروسہ کرنے والے کو اسی پر بھروسہ کرنا چاہئے.","arabic":"وَقَالَ يَٰبَنِيَّ لَا تَدۡخُلُواْ مِنۢ بَابٖ وَٰحِدٖ وَٱدۡخُلُواْ مِنۡ أَبۡوَٰبٖ مُّتَفَرِّقَةٖۖ وَمَآ أُغۡنِي عَنكُم مِّنَ ٱللَّهِ مِن شَيۡءٍۖ إِنِ ٱلۡحُكۡمُ إِلَّا لِلَّهِۖ عَلَيۡهِ تَوَكَّلۡتُۖ وَعَلَيۡهِ فَلۡيَتَوَكَّلِ ٱلۡمُتَوَكِّلُونَ","category":["12 (Yusuf)","Yusuf","Surah Yusuf","Chapter Yusuf","Surah 12","Chapter 12","Joseph","يوسُف"],"ayahNumber":1663,"juzNumber":13,"footnotes":"(1) جب بنیامین سمیت، گیارہ بھائی مصر جانے لگے، تو یہ ہدایت دی، کیونکہ ایک ہی باپ کے گیارہ بیٹے، جو قد و قامت اور شکل و صورت میں بھی ممتاز ہوں، جب اکٹھے ایک ہی جگہ یا ایک ساتھ کہیں سے گزریں گے تو عموماً انہیں لوگ تعجب یا حسد کی نظر سے دیکھتے ہیں اور یہی چیز نظر لگنے کا باعث بنتی ہے۔ چنانچہ انہیں نظر بد سے بچانے کے لئے بطور تدبیر یہ حکم دیا ”نظر لگ جانا حق ہے“ جیسا کہ نبی کریم (صلى الله عليه وسلم) سے بھی صحیح احادیث سے ثابت ہے مثلاً «الْعَيْنُ حَقٌّ»، ”نظر کا لگ جانا حق ہے“۔ ( صحيح بخاري، كتاب الطب، باب العين حق- وصحيح مسلم ، كتاب السلام، باب الطب والمرض والرقى ) اور آپ (صلى الله عليه وسلم) نے نظر بد سے بچنے کے لیے دعائیہ کلمات بھی اپنی امت کو بتالئے ہیں مثلا فرمایا کہ جب تمہیں کوئی چیز اچھی لگے تو بَارَكَ الله ُکہو۔ ( موطأ إمام مالك، باب الوضوء من العين- تعليقات مشكاة ألباني - نمبر1286) جس کی نظر لگے اس کو کہا جائے کہ غسل کرے اور اس کے غسل کا یہ پانی اس شخص کے سر اور جسم پر ڈالا جائے جس کو نظر لگی ہو (حوالہ مذکورہ) اسی طرح «مَا شَاءَ اللَّهُ لا قُوَّةَ إِلا بِاللَّهِ» پڑھنا قرآن سے ثابت ہے (سورہ کہف:39) «قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ» اور «قُلْ أَعُوذُ بِرَبِّ النَّاسِ» نظر کے لیے بطور دم پڑھنا چاہیے۔ ( جامع ترمذي أبواب الطب، باب ما جاء في الرقية بالمعوذتين)\n(2) یعنی یہ تاکید بطور ظاہری اسباب، احتیاط اور تدبیر کے ہے جسے اختیار کرنے کا انسانوں کو حکم دیا گیا ہے، تاہم اس سے اللہ تعالٰی کی تقدیر و قضا میں تبدیلی نہیں آسکتی۔ ہوگا وہی، جو اس کی قضا کے مطابق اس کا حکم ہوگا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waqāla yābaniyya lā tadkhulū min bābin wāḥidin wa-ud'khulū min abwābin mutafarriqatin wamā ugh'nī ʿankum mina al-lahi min shayin ini al-ḥuk'mu illā lillahi ʿalayhi tawakkaltu waʿalayhi falyatawakkali al-mutawakilūna ","translations":["And he said","O my sons","(Do) not","enter","from","one gate","one gate","but enter","from","gates","different","And not","I can avail","you","against","Allah","any","thing","Not","(is) the decision","except","with Allah","upon Him","I put my trust","and upon Him","let put (their) trust","the ones who put trust","(67)"],"transliterationArr":["waqāla","yābaniyya","lā","tadkhulū","min","bābin","wāḥidin","wa-ud'khulū","min","abwābin","mutafarriqatin","wamā","ugh'nī","ʿankum","mina","al-lahi","min","shayin","ini","al-ḥuk'mu","illā","lillahi","ʿalayhi","tawakkaltu","waʿalayhi","falyatawakkali","al-mutawakilūna",null],"verseTiming":[[1,0,970],[2,970,2340],[3,2340,2670],[4,2670,3770],[5,3770,4710],[6,4710,6300],[7,6300,8120],[8,8120,9110],[9,9110,9600],[10,9600,10700],[11,10700,13320],[12,13320,15500],[13,15500,16350],[14,16350,17740],[15,17740,18920],[16,18920,19860],[17,19860,20960],[18,20960,23830],[19,23830,24190],[20,24190,25020],[21,25020,25910],[22,25910,29440],[23,29440,30370],[24,30370,31700],[25,31700,32720],[26,32720,34400],[27,34400,38395]]}}