{"name":"12:78","price":"انہوں نے کہا کہ اے عزیز مصر(1) ! اس کے والد بہت بڑی عمر کے بالکل بوڑھے شخص ہیں۔ آپ اس کے بدلے ہم میں سے کسی کو لے لیجئے۔ ہم دیکھتے ہیں کہ آپ بڑے نیک نفس ہیں.(2)","arabic":"قَالُواْ يَٰٓأَيُّهَا ٱلۡعَزِيزُ إِنَّ لَهُۥٓ أَبٗا شَيۡخٗا كَبِيرٗا فَخُذۡ أَحَدَنَا مَكَانَهُۥٓۖ إِنَّا نَرَىٰكَ مِنَ ٱلۡمُحۡسِنِينَ","category":["12 (Yusuf)","Yusuf","Surah Yusuf","Chapter Yusuf","Surah 12","Chapter 12","Joseph","يوسُف"],"ayahNumber":1674,"juzNumber":13,"footnotes":"(1) حضرت یوسف کو عزیز مصر اس لئے کہا کہ اس وقت اصل اختیارات حضرت یوسف (عليه السلام) کے ہی پاس تھے، بادشاہ صرف برائے نام فرمانروائے مصر تھا۔\n(2) باپ تو یقینا بوڑھے ہی تھے، لیکن یہاں ان کا اصل مقصد بنیامین کو چھڑانا تھا۔ ان کے ذہن میں وہی یوسف (عليه السلام) والی بات تھی کہ کہیں ہمیں پھر دوبارہ بنیامین کے بغیر باپ کے پاس جانا پڑے اور باپ ہم سے کہیں کہ تم نے میرے بنیامین کو بھی یوسف (عليه السلام) کی طرح کہیں گم کر دیا۔ اس لئے یوسف (عليه السلام) کے احسانات کے حوالے سے یہ بات کی کہ شاید وہ یہ احسان بھی کر دیں کہ بنیامین کو چھوڑ دیں اور اس کی جگہ کسی اور بھائی کو رکھ لیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qālū yāayyuhā al-ʿazīzu inna lahu aban shaykhan kabīran fakhudh aḥadanā makānahu innā narāka mina al-muḥ'sinīna ","translations":["They said","O","Aziz","Indeed","he has","a father","old","[great]","so take","one of us","(in) his place","Indeed, we","[we] see you","of","the good-doers","(78)"],"transliterationArr":["qālū","yāayyuhā","al-ʿazīzu","inna","lahu","aban","shaykhan","kabīran","fakhudh","aḥadanā","makānahu","innā","narāka","mina","al-muḥ'sinīna",null],"verseTiming":[[1,0,850],[2,850,4090],[3,4090,5220],[4,5220,6740],[5,6740,8710],[6,8710,10120],[7,10120,11830],[8,11830,13640],[9,13640,14330],[10,14330,15500],[11,15500,17100],[12,17100,18690],[13,18690,19570],[14,19570,19940],[15,19940,23265]]}}