{"name":"12:81","price":"تم سب والد صاحب کی خدمت میں واپس جاؤ اور کہو کہ اباجی! آپ کے صاحبزادے نے چوری کی اور ہم نے وہی گواہی دی تھی جو ہم جانتے تھے(1) ۔ ہم کچھ غیب کی حفاﻇت کرنے والے نہ تھے.(2)","arabic":"ٱرۡجِعُوٓاْ إِلَىٰٓ أَبِيكُمۡ فَقُولُواْ يَٰٓأَبَانَآ إِنَّ ٱبۡنَكَ سَرَقَ وَمَا شَهِدۡنَآ إِلَّا بِمَا عَلِمۡنَا وَمَا كُنَّا لِلۡغَيۡبِ حَٰفِظِينَ","category":["12 (Yusuf)","Yusuf","Surah Yusuf","Chapter Yusuf","Surah 12","Chapter 12","Joseph","يوسُف"],"ayahNumber":1677,"juzNumber":13,"footnotes":"(1) یعنی ہم نے جو عہد کیا تھا کہ ہم بنیامین کو باحفاظت واپس لے آئیں گے، تو یہ ہم نے اپنے علم کے مطابق عہد کیا تھا، بعد میں جو واقعہ پیش آگیا اور جس کی وجہ سے بنیامین کو ہمیں چھوڑنا پڑا، یہ تو ہمارے وہم و گمان میں بھی نہ تھا۔ دوسرا مطلب یہ ہے ہم نے چوری کی جو سزا بیان کی تھی چور کو ہی چوری کے بدلے میں رکھ لیا جائے، تو یہ سزا ہم نے اپنے علم کے مطابق ہی تجویز کی تھی۔ اس میں کسی قسم کی بدنیتی شامل نہیں تھی۔ لیکن یہ اتفاق کی بات تھی کہ جب سامان کی تلاشی لی گئی تو مسروقہ کٹورا بنیامین کے سامان سے نکل آیا۔\n(2) یعنی مستقبل میں پیش آنے والے واقعات سے ہم بےخبر تھے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"ir'jiʿū ilā abīkum faqūlū yāabānā inna ib'naka saraqa wamā shahid'nā illā bimā ʿalim'nā wamā kunnā lil'ghaybi ḥāfiẓīna ","translations":["Return","to","your father","and say","'O our father","Indeed","your son","has stolen","and not","we testify","except","of what","we knew","And not","we were","of the unseen","guardians","(81)"],"transliterationArr":["ir'jiʿū","ilā","abīkum","faqūlū","yāabānā","inna","ib'naka","saraqa","wamā","shahid'nā","illā","bimā","ʿalim'nā","wamā","kunnā","lil'ghaybi","ḥāfiẓīna",null],"verseTiming":[[1,0,2359],[2,2359,4489],[3,4489,5539],[4,5539,6669],[5,6669,11219],[6,11219,12349],[7,12349,13029],[8,13029,13839],[9,13839,14349],[10,14349,16969],[11,16969,17849],[12,17849,18509],[13,18509,19669],[14,19669,20279],[15,20279,22109],[16,22109,23239],[17,23239,26434]]}}