{"name":"12:83","price":"(یعقوب علیہ السلام نے) کہا یہ تو نہیں، بلکہ تم نے اپنی طرف سے بات بنالی(1) ، پس اب صبر ہی بہتر ہے۔ قریب ہے کہ اللہ تعالیٰ ان سب کو میرے پاس ہی پہنچا دے(2)۔ وه ہی علم وحکمت واﻻ ہے.","arabic":"قَالَ بَلۡ سَوَّلَتۡ لَكُمۡ أَنفُسُكُمۡ أَمۡرٗاۖ فَصَبۡرٞ جَمِيلٌۖ عَسَى ٱللَّهُ أَن يَأۡتِيَنِي بِهِمۡ جَمِيعًاۚ إِنَّهُۥ هُوَ ٱلۡعَلِيمُ ٱلۡحَكِيمُ","category":["12 (Yusuf)","Yusuf","Surah Yusuf","Chapter Yusuf","Surah 12","Chapter 12","Joseph","يوسُف"],"ayahNumber":1679,"juzNumber":13,"footnotes":"(1) حضرت یعقوب (عليه السلام) چونکہ حقیقت حال سے بےخبر تھے اور اللہ تعالٰی نے وحی کے ذریعے سے انہیں حقیقت واقعہ سے آگاہ نہیں فرمایا۔ اس لئے وہ یہی سمجھے کہ میرے ان بیٹوں نے اپنی طرف سے بات بنا لی ہے۔ بنیامین کے ساتھ انہوں نے کیا معاملہ کیا؟ اس کا یقینی علم تو حضرت یعقوب (عليه السلام) کے پاس نہیں تھا، تاہم یوسف (عليه السلام) کے واقعے پر قیاس کرتے ہوئے ان کی طرف سے حضرت یعقوب (عليه السلام) کے دل میں بجا طور پر شکوک شبہات تھے۔\n(2) اب پھر سوائے صبر کے کوئی چارہ نہیں تھا، تاہم صبر کے ساتھ امید کا دامن بھی نہیں چھوڑا ۔ جمیعاً سے مراد یوسف علیہ السلام، بنیامین اور وہ بڑا بیٹا ہے جو مارے شرم کے وہیں مصر میں رک گیا تھا کہ یا تو والد صاحب مجھے اسی طرح آنے کی اجازت دے دیں یا پھر میں کسی طریقے سے بنیامین کو ساتھ لے کر آؤں گا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qāla bal sawwalat lakum anfusukum amran faṣabrun jamīlun ʿasā al-lahu an yatiyanī bihim jamīʿan innahu huwa al-ʿalīmu al-ḥakīmu ","translations":["He said","Nay","have enticed","you","your souls","something","so patience","(is) beautiful","Perhaps","Allah","will bring them to me","will bring them to me","will bring them to me","all","Indeed, He","He","(is) the All-Knower","All-Wise","(83)"],"transliterationArr":["qāla","bal","sawwalat","lakum","anfusukum","amran","faṣabrun","jamīlun","ʿasā","al-lahu","an","yatiyanī","bihim","jamīʿan","innahu","huwa","al-ʿalīmu","al-ḥakīmu",null],"verseTiming":[[1,0,700],[2,700,1120],[3,1120,2310],[4,2310,2990],[5,2990,5230],[6,5230,6660],[7,6660,7560],[8,7560,8410],[9,8410,8730],[10,8730,10980],[11,10980,11130],[12,11130,11910],[13,11910,12820],[14,12820,13350],[15,13350,15190],[16,15190,15840],[17,15840,17080],[18,17080,19200],[19,19200,19600],[20,19600,20680],[21,20680,23615]]}}