{"name":"13:17","price":"اسی نے آسمان سے پانی برسایا پھر اپنی اپنی وسعت کے مطابق نالے بہہ نکلے(1) ۔ پھر پانی کے ریلے نے اوپر چڑھے جھاگ کو اٹھا لیا(2)، اور اس چیز میں بھی جس کو آگ میں ڈال کر تپاتے ہیں زیور یا ساز وسامان کے لئے اسی طرح کے جھاگ ہیں(3)، اسی طرح اللہ تعالیٰ حق وباطل کی مثال بیان فرماتا ہے(4)، اب جھاگ تو ناکاره ہو کر چلا جاتا ہے(5) لیکن جو لوگوں کو نفع دینے والی چیز ہے وه زمین میں ٹھہری رہتی ہے(6)، اللہ تعالیٰ اسی طرح مثالیں بیان فرماتا ہے.(7)","arabic":"أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗ فَسَالَتۡ أَوۡدِيَةُۢ بِقَدَرِهَا فَٱحۡتَمَلَ ٱلسَّيۡلُ زَبَدٗا رَّابِيٗاۖ وَمِمَّا يُوقِدُونَ عَلَيۡهِ فِي ٱلنَّارِ ٱبۡتِغَآءَ حِلۡيَةٍ أَوۡ مَتَٰعٖ زَبَدٞ مِّثۡلُهُۥۚ كَذَٰلِكَ يَضۡرِبُ ٱللَّهُ ٱلۡحَقَّ وَٱلۡبَٰطِلَۚ فَأَمَّا ٱلزَّبَدُ فَيَذۡهَبُ جُفَآءٗۖ وَأَمَّا مَا يَنفَعُ ٱلنَّاسَ فَيَمۡكُثُ فِي ٱلۡأَرۡضِۚ كَذَٰلِكَ يَضۡرِبُ ٱللَّهُ ٱلۡأَمۡثَالَ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd","Chapter Ar-Ra'd","Ra'd","Surah Ra'd","Chapter Ra'd","Ar Ra'd","Surah Ar Ra'd","Chapter Ar Ra'd","Surah 13","Chapter 13","The Thunder","الرَّعد"],"ayahNumber":1724,"juzNumber":13,"footnotes":"(1) بِقَدَرِهَا (وسعت کے مطابق) کا مطلب ہے نالے یعنی وادی (دو پہاڑوں کے درمیان کی جگہ) تنگ ہو تو کم پانی کشادہ ہو تو زیادہ پانی اٹھاتی ہے یعنی نزول قرآن کو جو ہدایت اور بیان کا جاع ہے بارش کے نزول سے تشبیہ دی ہے اس لیے کہ قرآن کا نفع بھی بارش کے نفع کی طرح عام ہے اور وادیوں کو تشبیہ دی ہے دلوں کے ساتھ اس لیے کہ وادیوں نالوں میں پانی جا کر ٹھہرتا ہے جس طرح قرآن قرآن کا اور ایمان مومنوں کے دلوں میں قرار پکڑتا ہے۔\n(2) اس جھاگ سے جب پانی اوپر آجاتا ہے اور جو ناکارہ ہو ختم ہو جاتا ہے اور ہوائیں جسے اڑا لے جاتی ہیں کفر مراد ہے، جو جھاگ ہی کی طرح اڑ جانے والا اور ختم ہو جانے والا ہے۔\n(3) یہ دوسری شکل ہے کہ تانبے پیتل، سیسے یا سونے چاندی کو زیور یا سامان وغیرہ بنانے کے لئے آگ میں تپایا جاتا ہے تو اس پر بھی جھاگ کی شکل میں اوپر آجاتا ہے۔ پھر یہ جھاگ دیکھتے دیکھتے ختم ہو جاتا ہے اور دھات اصلی شکل میں باقی رہ جاتی ہے۔\n(4) یعنی جب حق اور باطل کا آپس میں اجتماع اور ٹکراؤ ہوتا ہے تو باطل کو اسی طرح اثبات اور دوام نہیں ہوتا، جس طرح سیلابی ریلے کا جھاگ پانی کے ساتھ، دھاتوں کا جھاگ، جن کو آگ میں تپایا جاتا ہے دھاتوں کے ساتھ باقی نہیں رہتا بلکہ مضمحل اور ختم ہو جاتا ہے۔\n(5) یعنی اس سے کوئی نفع نہیں ہوتا، کیونکہ جھاگ پانی یا دھات کے باقی رہتا ہی نہیں بلکہ آہستہ آہستہ بیٹھ جاتا ہے یا ہوائیں اسے اڑا لے جاتی ہیں۔ باطل کی مثال بھی جھاگ ہی کی طرح ہے۔\n(6) یعنی پانی اور سونا، چاندی، تانبا، پیتل وغیرۃ یہ چیزیں باقی رہتی ہیں جن سے لوگ فائدہ اٹھاتے اور فیض یاب ہوتے ہیں، اسی طرح حق باقی رہتا ہے جس کے وجود کو بھی زوال نہیں اور جس کا نفع بھی دائمی ہے۔\n(7) یعنی بات کو سمجھانے اور ذہن نشین کرانے کے لئے مثالیں بیان فرماتا ہے، جیسے یہیں دو مثالیں بیان فرمائیں اور اسی طرح سورہ بقرہ کے آغاز میں منافقین کے لئے مثالیں بیان فرمائیں۔ اسی طرح سورہ نور، آیات 39،40 میں کافروں کے لئے دو مثالیں بیان فرمائیں۔ اور احادیث میں بھی نبی (صلى الله عليه وسلم) نے مثالوں کے ذریعے سے لوگوں کو بہت سی باتیں سمجھائیں۔ (تفصیل کے لیے دیکھئے تفسیر ابن کثیر)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"anzala mina al-samāi māan fasālat awdiyatun biqadarihā fa-iḥ'tamala al-saylu zabadan rābiyan wamimmā yūqidūna ʿalayhi fī al-nāri ib'tighāa ḥil'yatin aw matāʿin zabadun mith'luhu kadhālika yaḍribu al-lahu al-ḥaqa wal-bāṭila fa-ammā al-zabadu fayadhhabu jufāan wa-ammā mā yanfaʿu al-nāsa fayamkuthu fī al-arḍi kadhālika yaḍribu al-lahu al-amthāla ","translations":["He sends down","from","the sky","water","and flows","the valleys","according to their measure","and carries","the torrent","a foam","rising","And from what","they heat","[on] it","in","the fire","in order to make","ornaments","or","utensils","a foam","like it","Thus","sets forth","Allah","the truth","and the falsehood","Then as for","the foam","it passes away","(as) scum","and as for","what","benefits","the mankind","remains","in","the earth","Thus","Allah sets forth","Allah sets forth","the examples","(17)"],"transliterationArr":["anzala","mina","al-samāi","māan","fasālat","awdiyatun","biqadarihā","fa-iḥ'tamala","al-saylu","zabadan","rābiyan","wamimmā","yūqidūna","ʿalayhi","fī","al-nāri","ib'tighāa","ḥil'yatin","aw","matāʿin","zabadun","mith'luhu","kadhālika","yaḍribu","al-lahu","al-ḥaqa","wal-bāṭila","fa-ammā","al-zabadu","fayadhhabu","jufāan","wa-ammā","mā","yanfaʿu","al-nāsa","fayamkuthu","fī","al-arḍi","kadhālika","yaḍribu","al-lahu","al-amthāla",null],"verseTiming":[[1,0,1770],[2,1770,2100],[3,2100,4760],[4,4760,7380],[5,7380,8510],[6,8510,10170],[7,10170,11440],[8,11440,12420],[9,12420,13370],[10,13370,13980],[11,13980,15970],[12,15970,17480],[13,17480,18730],[14,18730,19710],[15,19710,19960],[16,19960,21320],[17,21320,23580],[18,23580,24690],[19,24690,25020],[20,25020,26560],[21,26560,27190],[22,27190,28690],[23,28690,30250],[24,30250,31110],[25,31110,32000],[26,32000,32930],[27,32930,34210],[28,34210,36000],[29,36000,36930],[30,36930,38100],[31,38100,41460],[32,41460,42980],[33,42980,43470],[34,43470,44930],[35,44930,46370],[36,46370,47550],[37,47550,47810],[38,47810,48630],[39,48630,50040],[40,50040,50880],[41,50880,51820],[42,51820,55415]]}}