{"name":"13:15","price":"اللہ ہی کے لئے زمین اور آسمانوں کی سب مخلوق خوشی اور ناخوشی سے سجده کرتی ہے اور ان کے سائے بھی صبح وشام.(1)","arabic":"وَلِلَّهِۤ يَسۡجُدُۤ مَن فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ طَوۡعٗا وَكَرۡهٗا وَظِلَٰلُهُم بِٱلۡغُدُوِّ وَٱلۡأٓصَالِ۩","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd","Chapter Ar-Ra'd","Ra'd","Surah Ra'd","Chapter Ra'd","Ar Ra'd","Surah Ar Ra'd","Chapter Ar Ra'd","Surah 13","Chapter 13","The Thunder","الرَّعد"],"ayahNumber":1722,"juzNumber":13,"footnotes":"(1) اس میں اللہ تعالٰی کی عظمت و قدرت کا بیان ہے کہ ہرچیز پر اس کا غلبہ ہے اور ہرچیز اس کے ما تحت اور اس کے سامنے سجدہ ریز ہے، چاہے مومنوں کی طرح خوشی سے کریں یا مشرکوں کی طرح ناخوشی سے۔ اور ان کے سائے بھی صبح و شام سجدہ کرتے ہیں۔ جیسے دوسرے مقام پر فرمایا۔ «اَوَلَمْ يَرَوْا اِلٰى مَا خَلَقَ اللّٰهُ مِنْ شَيْءٍ يَّتَفَيَّؤُا ظِلٰلُهٗ عَنِ الْيَمِيْنِ وَالشَّمَاۗىِٕلِ سُجَّدًا لِّلّٰهِ وَهُمْ دٰخِرُوْنَ» (النحل:48) ”کیا انہوں نے نہیں دیکھا کہ اللہ نے جو چیز بھی پیدا کی ہے ان کے سائے داہنے اور بائیں سے اللہ کو سجدہ کرتے ہوئے ڈھلتے ہیں اور وہ عاجزی کرتے ہیں“۔ اس سجدے کی کیفیت کیا ہے؟ یہ اللہ تعالٰی بہتر جانتا ہے یا دوسرا مفہوم اس کا یہ ہے کہ کافر سمیت تمام مخلوق اللہ کے حکم کے تابع ہے کسی میں اسی سے سرتابی کی مجال نہیں اللہ تعالٰی کسی کو صحت دے بیمار کرے غنی کر دے یا فقیر بنا دے زندگی دے یا موت سے ہمکنار کرے ان تکوینی احکام میں کسی کافر کو بھی مجال انکار نہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walillahi yasjudu man fī al-samāwāti wal-arḍi ṭawʿan wakarhan waẓilāluhum bil-ghuduwi wal-āṣāli ","translations":["And to Allah","prostrates","whoever","(is) in","the heavens","and the earth","willingly","or unwillingly","and (so do) their shadows","in the mornings","and in the afternoons","(15)"],"transliterationArr":["walillahi","yasjudu","man","fī","al-samāwāti","wal-arḍi","ṭawʿan","wakarhan","waẓilāluhum","bil-ghuduwi","wal-āṣāli",""],"verseTiming":[[1,0,1580],[2,1580,2470],[3,2470,3480],[4,3480,3730],[5,3730,5440],[6,5440,6580],[7,6580,7940],[8,7940,9510],[9,9510,11510],[10,11510,13710],[11,13710,17205]]}}