{"name":"13:22","price":"اور وه اپنے رب کی رضا مندی کی طلب کے لئے صبر کرتے ہیں(1) ، اور نمازوں کو برابر قائم رکھتے ہیں (2)اور جو کچھ ہم نے انہیں دے رکھا ہے اسے چھپے کھلے خرچ کرتے ہیں(3) اور برائی کو بھی بھلائی سے ٹالتے ہیں، ان ہی کے لئے عاقبت کا گھر ہے.(4)","arabic":"وَٱلَّذِينَ صَبَرُواْ ٱبۡتِغَآءَ وَجۡهِ رَبِّهِمۡ وَأَقَامُواْ ٱلصَّلَوٰةَ وَأَنفَقُواْ مِمَّا رَزَقۡنَٰهُمۡ سِرّٗا وَعَلَانِيَةٗ وَيَدۡرَءُونَ بِٱلۡحَسَنَةِ ٱلسَّيِّئَةَ أُوْلَٰٓئِكَ لَهُمۡ عُقۡبَى ٱلدَّارِ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd","Chapter Ar-Ra'd","Ra'd","Surah Ra'd","Chapter Ra'd","Ar Ra'd","Surah Ar Ra'd","Chapter Ar Ra'd","Surah 13","Chapter 13","The Thunder","الرَّعد"],"ayahNumber":1729,"juzNumber":13,"footnotes":"(1) اللہ کی نافرمانی اور گناہوں سے بچتے ہیں۔ یہ صبر کی ایک قسم ہے۔ تکلیفوں اور آزمائشوں پر صبر کرتے ہیں، یہ دوسری قسم ہے۔ اہل دانش دونوں قسم کا صبر کرتے ہیں۔\n(2) ان کی حدود و مواقیت، خشوع و خضوع اور اعتدال ارکان کے ساتھ۔ نہ کہ اپنے من مانے طریقے سے۔\n(3) یعنی جہاں جہاں اور جب بھی، خرچ کرنے کی ضرورت پیش آتی ہے، اپنوں اور بیگانوں میں اور خفیہ اور اعلانیہ خرچ کرتے ہیں۔\n(4) یعنی ان کے ساتھ کوئی برائی سے پیش آتا ہے تو وہ اس کا جواب اچھائی سے دیتے ہیں، یا عفو و درگزر اور صبر جمیل سے کام لیتے ہیں۔ جس طرح دوسرے مقام پر اللہ تعالٰی نے فرمایا :«اِدْفَعْ بِالَّتِيْ هِىَ اَحْسَنُ فَاِذَا الَّذِيْ بَيْنَكَ وَبَيْنَهٗ عَدَاوَةٌ كَاَنَّهٗ وَلِيٌّ حَمِيْمٌ» (حم السجدۃ:34) ”برائی کا جواب ایسے طریقے سے دو جو اچھا ہو (اگر تم ایسا کرو گے) تو وہ شخص جو تمہارا دشمن ہے، ایسا ہو جائے گا گویا وہ تمہارا گہرا دوست ہے“۔\n(5) یعنی جو اعلٰی اخلاق کے حامل اور مزکورہ خوبیوں سے متصف ہوں گے، ان کے لئے عاقبت کا گھر ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-alladhīna ṣabarū ib'tighāa wajhi rabbihim wa-aqāmū al-ṣalata wa-anfaqū mimmā razaqnāhum sirran waʿalāniyatan wayadraūna bil-ḥasanati al-sayi-ata ulāika lahum ʿuq'bā al-dāri ","translations":["And those who","(are) patient","seeking","(the) Face","(of) their Lord","and establish","the prayer","and spend","from what","We have provided them","secretly","and publicly","and they repel","with the good","the evil ","those","for them","(is) the final attainment","(of) the Home ","(22)"],"transliterationArr":["wa-alladhīna","ṣabarū","ib'tighāa","wajhi","rabbihim","wa-aqāmū","al-ṣalata","wa-anfaqū","mimmā","razaqnāhum","sirran","waʿalāniyatan","wayadraūna","bil-ḥasanati","al-sayi-ata","ulāika","lahum","ʿuq'bā","al-dāri",null],"verseTiming":[[1,0,1400],[2,1400,2140],[3,2140,4610],[4,4610,5180],[5,5180,6400],[6,6400,7480],[7,7480,8710],[8,8710,10990],[9,10990,13490],[10,13490,14950],[11,14950,16510],[12,16510,17360],[13,17360,19810],[14,19810,22070],[15,22070,23450],[16,23450,24850],[17,24850,27000],[18,27000,27670],[19,27670,28370],[20,28370,31195]]}}