{"name":"13:23","price":"ہمیشہ رہنے کے باغات(1) جہاں یہ خود جائیں گے اور ان کے باپ دادوں اور بیویوں اور اوﻻدوں میں سے بھی جو نیکو کار ہوں گے(2)، ان کے پاس فرشتے ہر ہر دروازے سے آئیں گے.","arabic":"جَنَّٰتُ عَدۡنٖ يَدۡخُلُونَهَا وَمَن صَلَحَ مِنۡ ءَابَآئِهِمۡ وَأَزۡوَٰجِهِمۡ وَذُرِّيَّٰتِهِمۡۖ وَٱلۡمَلَٰٓئِكَةُ يَدۡخُلُونَ عَلَيۡهِم مِّن كُلِّ بَابٖ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd","Chapter Ar-Ra'd","Ra'd","Surah Ra'd","Chapter Ra'd","Ar Ra'd","Surah Ar Ra'd","Chapter Ar Ra'd","Surah 13","Chapter 13","The Thunder","الرَّعد"],"ayahNumber":1730,"juzNumber":13,"footnotes":"(1) عدن کے معنی ہیں اقامت۔ یعنی ہمیشہ رہنے والے باغات۔\n(2) یعنی اس طرح نیک قرابت داروں کو آپس میں جمع کر دے گا تاکہ ایک دوسرے کو دیکھ کر ان کی آنکھیں ٹھنڈی ہوں حتٰی کہ ادنٰی درجے کے جنتی کو اعلٰی درجہ عطا فرما دے گا تاکہ وہ اپنے قرابت دار کے ساتھ جمع ہو جائے۔ فرمایا :\n«وَالَّذِينَ آمَنُوا وَاتَّبَعَتْهُمْ ذُرِّيَّتُهُمْ بِإِيمَانٍ أَلْحَقْنَا بِهِمْ ذُرِّيَّتَهُمْ وَمَا أَلَتْنَاهُمْ مِنْ عَمَلِهِمْ مِنْ شَيْءٍ» (الطور:21) ”اور وہ لوگ جو ایمان لائے اور ان کی اولاد نے ایمان کے ساتھ ان کی پیروی کی تو ہم ملا دیں گے ان کے ساتھ ان کی اولاد کو اور ان کے عملوں سے ہم کچھ گھٹائیں گے نہیں“۔ اس سے جہاں یہ معلوم ہوا کہ نیک رشتے داروں کو اللہ تعالٰی جنت میں جمع فرما دے گا، وہیں یہ بھی معلوم ہوا کہ اگر کسی کے پاس ایمان اور عمل صالح کی پونجی نہیں ہوگی، تو وہ جنت میں نہیں جائے گا، چاہے اس کے دوسرے نہایت قریبی رشتے دار جنت میں چلے گئے ہوں۔ کیونکہ جنت میں داخلہ حسب نسب کی بنیاد پر نہیں، ایمان و عمل کی بنیاد پر ہوگا۔«مَنْ بَطَّأَ بِهِ عَمَلُهُ لَمْ يُسْرِعْ بِهِ نَسَبُهُ»، (صحيح مسلم، كتاب الذكر والدعاء، باب فضل الاجتماع على تلاوة القرآن)۔ جسے اس کا عمل پیچھے چھوڑ گیا اس کا نسب اسے آگے نہیں بڑھائے گا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"jannātu ʿadnin yadkhulūnahā waman ṣalaḥa min ābāihim wa-azwājihim wadhurriyyātihim wal-malāikatu yadkhulūna ʿalayhim min kulli bābin ","translations":["Gardens","of Eden","they will enter them","and whoever","(were) righteous","among","their fathers","and their spouses","and their offsprings","And the Angels","will enter","upon them","from","every","gate","(23)"],"transliterationArr":["jannātu","ʿadnin","yadkhulūnahā","waman","ṣalaḥa","min","ābāihim","wa-azwājihim","wadhurriyyātihim","wal-malāikatu","yadkhulūna","ʿalayhim","min","kulli","bābin",null],"verseTiming":[[1,0,1880],[2,1880,3510],[3,3510,5370],[4,5370,6690],[5,6690,7510],[6,7510,7960],[7,7960,10750],[8,10750,12660],[9,12660,15120],[10,15120,18610],[11,18610,19980],[12,19980,20980],[13,20980,22050],[14,22050,23110],[15,23110,23760],[16,23760,26085]]}}