{"name":"13:2","price":"اللہ وه ہے جس نے آسمانوں کو بغیر ستونوں کے بلند کر رکھا ہے کہ تم اسے دیکھ رہے ہو۔ پھر وه عرش پر قرار پکڑے ہوئے ہے(1) ، اسی نے سورج اور چاند کو ماتحتی میں لگا رکھا ہے۔ ہر ایک میعاد معین پر گشت کر رہا ہے(2)، وہی کام کی تدبیر کرتا ہے وه اپنے نشانات کھول کھول کر بیان کر رہا ہے کہ تم اپنے رب کی ملاقات کا یقین کر لو.","arabic":"ٱللَّهُ ٱلَّذِي رَفَعَ ٱلسَّمَٰوَٰتِ بِغَيۡرِ عَمَدٖ تَرَوۡنَهَاۖ ثُمَّ ٱسۡتَوَىٰ عَلَى ٱلۡعَرۡشِۖ وَسَخَّرَ ٱلشَّمۡسَ وَٱلۡقَمَرَۖ كُلّٞ يَجۡرِي لِأَجَلٖ مُّسَمّٗىۚ يُدَبِّرُ ٱلۡأَمۡرَ يُفَصِّلُ ٱلۡأٓيَٰتِ لَعَلَّكُم بِلِقَآءِ رَبِّكُمۡ تُوقِنُونَ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd","Chapter Ar-Ra'd","Ra'd","Surah Ra'd","Chapter Ra'd","Ar Ra'd","Surah Ar Ra'd","Chapter Ar Ra'd","Surah 13","Chapter 13","The Thunder","الرَّعد"],"ayahNumber":1709,"juzNumber":13,"footnotes":"(1) ”اسْتَوَىٰ عَلَى الْعَرْشِ“ کا مفہوم اس سے قبل بیان ہو چکا ہے کہ اس سے مراد اللہ تعالٰی کا عرش پر قرار پکڑنا ہے۔ محدثین کا یہی مسلک ہے وہ اس کی تاویل نہیں کرتے، جیسے بعض دوسرے گروہ اس میں اور دیگر صفات الٰہی میں تاویل کرتے ہیں۔ تاہم محدثین کہتے ہیں کہ اس کی کیفیت نہ بیان کی جاسکتی ہے اور نہ اسے کسی چیز سے تشبیہ دی جاسکتی ہے۔ «لَيْسَ كَمِثْلِهِ شَيْءٌ وَهُوَ السَّمِيعُ الْبَصِيرُ»(الشورى: 11)\n(2) اس کے ایک معنی یہ ہیں کہ یہ ایک وقت مقرر تک یعنی قیامت تک اللہ کے حکم سے چلتے رہیں گے جیسا کہ فرمایا «وَالشَّمْسُ تَجْرِي لِمُسْتَقَرٍّ لَهَا ذَلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ» (يٰس: 38)۔ ”اور سورج اپنے ٹھہرنے کے وقت تک چل رہا ہے“۔ دوسرے معنی یہ ہیں کہ چاند اور سورج دونوں اپنی اپنی منزلوں پر رواں دواں رہتے ہیں سورج اپنا دورہ ایک سال میں اور چاند ایک ماہ میں مکمل کر لیتا ہے جس طرح فرمایا «وَالْقَمَرَ قَدَّرْنَاهُ مَنَازِلَ» (يٰس: 39)۔ ”ہم نے چاند کی منزلیں مقرر کر دی ہیں“ سات بڑے بڑے سیارے ہیں جن میں سے دو چاند اور سورج ہیں یہاں صرف ان دو کا ذکر کیا ہے کیونکہ یہی دو سب سے زیادہ بڑے اور اہم ہیں جب یہ دونوں بھی اللہ کے حکم کے تابع ہیں تو دوسرے سیارے تو بطریق اولی اس کے تابع ہونگے اور جب یہ اللہ کے حکم کے تابع ہیں تو یہ معبود نہیں ہو سکتے معبود تو وہی ہے جس نے ان کو مسخر کیا ہوا ہے اس لیے فرمایا «لَا تَسْجُدُوْا لِلشَّمْسِ وَلَا لِلْقَمَرِ وَاسْجُدُوْا لِلّٰهِ الَّذِيْ خَلَقَهُنَّ اِنْ كُنْتُمْ اِيَّاهُ تَعْبُدُوْنَ» (فصلت: 37) ”سورج اور چاند کو سجدہ نہ کرو اس اللہ کو سجدہ کرو جس نے انہیں پیدا کیا اگر تم صرف اس کی عبادت کرنا چاہتے ہو“۔ «وَالشَّمْسَ وَالْقَمَرَ وَالنُّجُومَ مُسَخَّرَاتٍ بِأَمْرِهِ» (الأعراف: 54) ”سورج چاند اور تارے سب اس کے حکم کے تابع ہیں“۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"al-lahu alladhī rafaʿa al-samāwāti bighayri ʿamadin tarawnahā thumma is'tawā ʿalā al-ʿarshi wasakhara al-shamsa wal-qamara kullun yajrī li-ajalin musamman yudabbiru al-amra yufaṣṣilu al-āyāti laʿallakum biliqāi rabbikum tūqinūna ","translations":["Allah","(is) the One Who","raised","the heavens","without","pillars","that you see","then","He established","on","the Throne","and subjected","the sun","and the moon","each","running","for a term","appointed","He arranges","the matter","He details","the Signs","so that you may","in the meeting","(with) your Lord","believe with certainty","(2)"],"transliterationArr":["al-lahu","alladhī","rafaʿa","al-samāwāti","bighayri","ʿamadin","tarawnahā","thumma","is'tawā","ʿalā","al-ʿarshi","wasakhara","al-shamsa","wal-qamara","kullun","yajrī","li-ajalin","musamman","yudabbiru","al-amra","yufaṣṣilu","al-āyāti","laʿallakum","biliqāi","rabbikum","tūqinūna",null],"verseTiming":[[1,0,1270],[2,1270,2190],[3,2190,2950],[4,2950,4680],[5,4680,5550],[6,5550,7180],[7,7180,8750],[8,8750,10380],[9,10380,11490],[10,11490,11940],[11,11940,12810],[12,12810,14210],[13,14210,15260],[14,15260,16470],[15,16470,17150],[16,17150,18750],[17,18750,19740],[18,19740,23130],[19,23130,24200],[20,24200,25160],[21,25160,26330],[22,26330,27830],[23,27830,29790],[24,29790,32310],[25,32310,33540],[26,33540,36365]]}}