{"name":"13:37","price":"اسی طرح ہم نے اس قرآن کو عربی زبان کا فرمان اتارا ہے(1) ۔ اگر آپ نے ان کی خواہشوں(2) کی پیروی کر لی اس کے بعد کہ آپ کے پاس علم آچکا ہے(3) تو اللہ (کے عذابوں) سے آپ کو کوئی حمایتی ملے گا اور نہ بچانے واﻻ.(4)","arabic":"وَكَذَٰلِكَ أَنزَلۡنَٰهُ حُكۡمًا عَرَبِيّٗاۚ وَلَئِنِ ٱتَّبَعۡتَ أَهۡوَآءَهُم بَعۡدَ مَا جَآءَكَ مِنَ ٱلۡعِلۡمِ مَا لَكَ مِنَ ٱللَّهِ مِن وَلِيّٖ وَلَا وَاقٖ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd","Chapter Ar-Ra'd","Ra'd","Surah Ra'd","Chapter Ra'd","Ar Ra'd","Surah Ar Ra'd","Chapter Ar Ra'd","Surah 13","Chapter 13","The Thunder","الرَّعد"],"ayahNumber":1744,"juzNumber":13,"footnotes":"(1) یعنی جس طرح آپ سے پہلے رسولوں پر کتابیں مقامی زبانوں میں نازل کیں، اسی طرح آپ پر قرآن ہم نے عربی زبان میں اتارا، اس لئے کہ آپ کے مخاطب اولین اہل عرب ہیں، جو صرف عربی زبان ہی جانتے ہیں۔ اگر قرآن کسی اور زبان میں نازل ہوتا تو ان کی سمجھ سے بالا ہوتا اور قبول ہدایت میں ان کے لئے عذر بن جاتا۔ ہم نے قرآن کو عربی میں اتار کر یہ عذر بھی دور کر دیا۔\n(2) اس سے مراد اہل کتاب کی بعض وہ خواہشیں ہیں جو وہ چاہتے تھے کہ پیغمبر آخر الزماں انہیں اختیار کریں۔ مثلاً بیت المقدس کو ہمیشہ کے لئے قبلہ بنائے رکھنا اور ان کے معتقدات کی مخالفت نہ کرنا وغیرہ۔\n(3) اس سے مراد علم ہے جو وحی کے ذریعے سے آپ کو عطا کیا گیا، جس میں اہل کتاب کے معتقدات کی حقیقت بھی آپ پر واضح کر دی گئی۔\n(4) یہ دراصل امت کے اہل علم کو تنبیہ ہے کہ وہ دنیا کے عارضی مفادات کی خاطر قرآن و حدیث کے واضح احکام کے مقابلے میں لوگوں کی خواہشات کے پیچھے نہ لگیں، اگر وہ ایسا کریں گے تو انہیں اللہ کے عذاب سے بچانے والا کوئی نہیں ہوگا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wakadhālika anzalnāhu ḥuk'man ʿarabiyyan wala-ini ittabaʿta ahwāahum baʿdamā jāaka mina al-ʿil'mi mā laka mina al-lahi min waliyyin walā wāqin ","translations":["And thus","We have revealed it","(to be) a judgment of authority","(in) Arabic","And if","you follow","their desires","after what","came to you","of","the knowledge","not","for you","against","Allah","any","protector","and not","defender","(37)"],"transliterationArr":["wakadhālika","anzalnāhu","ḥuk'man","ʿarabiyyan","wala-ini","ittabaʿta","ahwāahum","baʿdamā","jāaka","mina","al-ʿil'mi","mā","laka","mina","al-lahi","min","waliyyin","walā","wāqin",null],"verseTiming":[[1,0,1450],[2,1450,3920],[3,3920,4760],[4,4760,6600],[5,6600,7510],[6,7510,8640],[7,8640,11900],[8,11900,12940],[9,12940,15230],[10,15230,15590],[11,15590,16610],[12,16610,17110],[13,17110,17530],[14,17530,17880],[15,17880,18930],[16,18930,19260],[17,19260,21080],[18,21080,22270],[19,22270,24435]]}}