{"name":"13:38","price":"ہم آپ سے پہلے بھی بہت سے رسول بھیج چکے ہیں اور ہم نے ان سب کو بیوی بچوں واﻻ بنایا تھا(1) ، کسی رسول سے نہیں ہو سکتا کہ کوئی نشانی بغیر اللہ کی اجازت کے لے آئے(2)۔ ہر مقرره وعدے کی ایک لکھت ہے.(3)","arabic":"وَلَقَدۡ أَرۡسَلۡنَا رُسُلٗا مِّن قَبۡلِكَ وَجَعَلۡنَا لَهُمۡ أَزۡوَٰجٗا وَذُرِّيَّةٗۚ وَمَا كَانَ لِرَسُولٍ أَن يَأۡتِيَ بِـَٔايَةٍ إِلَّا بِإِذۡنِ ٱللَّهِۗ لِكُلِّ أَجَلٖ كِتَابٞ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd","Chapter Ar-Ra'd","Ra'd","Surah Ra'd","Chapter Ra'd","Ar Ra'd","Surah Ar Ra'd","Chapter Ar Ra'd","Surah 13","Chapter 13","The Thunder","الرَّعد"],"ayahNumber":1745,"juzNumber":13,"footnotes":"(1) یعنی آپ سمیت جتنے بھی رسول اور نبی آئے، سب بشر ہی تھے، جن کا اپنا خاندان اور قبیلہ تھا اور بیوی بچے تھے وہ فرشتے تھے نہ انسانی شکل میں کوئی نوری مخلوق بلکہ جنس بشر ہی میں سے تھے کیونکہ اگر وہ فرشتے ہوتے تو انسانوں کے لیے ان سے مانوس ہونا اور ان کے قریب ہونا ناممکن تھا جس سے ان کو بھیجنے کا اصل مقصد ہی فوت ہو جاتا اور اگر وہ فرشتے بشری جامے میں آتے تو دنیا میں نہ ان کا خاندان اور قبیلہ ہوتا اور نہ ان کے بیوی بچے ہوتے جس سے یہ معلوم ہوا کہ تمام انبیاء بحثییت جنس کے بشر ہی تھے بشری شکل میں فرشتے یا کوئی نوری مخلوق نہیں تھے مزکورہ آیت میں ازواجا سے رہبانیت کی تردید اور ذریۃ سے خاندانی منصوبہ بندی کی تردید بھی ہوتی ہے کیونکہ ذریۃ جمع ہے کم از کم تین ہوں گے۔\n(2) یعنی معجزات کا صدور، رسولوں کے اختیار میں نہیں کہ جب ان سے مطالبہ کیا جائے تو وہ صادر کر کے دکھا دیں بلکہ یہ اللہ کے اختیار میں ہے وہ اپنی حکمت و مشیت کے مطابق فیصلہ کرتا ہے کہ معجزے کی ضرورت ہے یا نہیں؟ اگر ہے تو کس طرح اور کب دکھایا جائے۔\n(3) یعنی اللہ نے جس چیز کا وعدہ کیا، اس کا ایک وقت مقرر ہے، اس وقت موعود پر یہ واقع ہو کر رہے گا اس لئے کہ اللہ کا وعدہ خلاف نہیں ہوتا۔اور بعض کہتے ہیں کہ کلام میں تقدیم و تاخیر ہے۔ اصل عبارت ہر وہ امر، جسے اللہ نے لکھ رکھا ہے، اس کا ایک وقت مقرر ہے، یعنی معاملہ، کفار کے ارادے اور منشاء پر نہیں بلکہ صرف اور صرف اللہ کی مشیت پر موقوف ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walaqad arsalnā rusulan min qablika wajaʿalnā lahum azwājan wadhurriyyatan wamā kāna lirasūlin an yatiya biāyatin illā bi-idh'ni al-lahi likulli ajalin kitābun ","translations":["And certainly","We sent","Messengers","from","before you","and We made","for them","wives","and offspring","And not","was","for a Messenger","that","he comes","with a sign","except","by the leave","(of) Allah","For everything","(is) a time","prescribed","(38)"],"transliterationArr":["walaqad","arsalnā","rusulan","min","qablika","wajaʿalnā","lahum","azwājan","wadhurriyyatan","wamā","kāna","lirasūlin","an","yatiya","biāyatin","illā","bi-idh'ni","al-lahi","likulli","ajalin","kitābun",null],"verseTiming":[[1,0,920],[2,920,2090],[3,2090,3060],[4,3060,4380],[5,4380,5840],[6,5840,6970],[7,6970,7720],[8,7720,9470],[9,9470,12010],[10,12010,12660],[11,12660,13300],[12,13300,14680],[13,14680,14880],[14,14880,16650],[15,16650,17990],[16,17990,19070],[17,19070,19990],[18,19990,22490],[19,22490,23260],[20,23260,24120],[21,24120,27545]]}}