{"name":"13:39","price":"اللہ جو چاہے مٹا دے اور جو چاہے ﺛابت رکھے، لوح محفوظ اسی کے پاس ہے.(1)","arabic":"يَمۡحُواْ ٱللَّهُ مَا يَشَآءُ وَيُثۡبِتُۖ وَعِندَهُۥٓ أُمُّ ٱلۡكِتَٰبِ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd","Chapter Ar-Ra'd","Ra'd","Surah Ra'd","Chapter Ra'd","Ar Ra'd","Surah Ar Ra'd","Chapter Ar Ra'd","Surah 13","Chapter 13","The Thunder","الرَّعد"],"ayahNumber":1746,"juzNumber":13,"footnotes":"(1) اس کے ایک معنی تو یہ ہیں وہ جس حکم کو چاہے منسوخ کردے اور جسے چاہے باقی رکھے۔ دوسرے معنی یہ ہیں اس نے جو تقدیر لکھ رکھی ہے، اس میں محو و اثبات کرتا رہتا ہے، اس کے پاس لوح محفوط ہے۔ اس کی تائید بعض احادیث و آثار سے ہوتی ہے۔ مثلاً ایک حدیث میں آتا ہے کہ ”آدمی گناہوں کی وجہ سے رزق سے محروم کر دیا جاتا ہے، دعا سے تقدیر بدل جاتی ہے اور صلہ رحمی سے عمر میں اضافہ ہوتا ہے“ (مسند احمد جلد۔5 ص۔277) بعض صحابہ سے یہ دعا منقول ہے «اللَّهُمَّ إِنْ كُنْتَ كَتَبْتَنَا أَشْقِيَاءَ فَامْحُنَا وَاكْتُبْنَا سُعَدَاءَ، وَإِنْ كُنْتَ كَتَبْتَنَا سُعَدَاءَ فَأَثْبِتْنَا، فَإِنَّكَ تَمْحُو مَا تَشَاءُ وَتُثْبِتُ وَعِنْدَكَ أُمُّ الْكِتَابِ» حضرت عمر (رضي الله عنه) سے منقول ہے کہ وہ دوران طواف روتے ہوئے یہ دعا پڑھتے ـ«اللَّهُمَّ إِنْ كُنْتَ كَتَبْتَ عَلَيّ شِقْوَةً أَوْ ذَنْبًا فَامْحُهُ، فَإِنَّكَ تَمْحُو مَا تَشَاءُ وَتُثْبِتُ وَعِنْدَكَ أُمُّ الْكِتَابِ فَاجْعَلْهُ سَعَادَةً وَمَغْفِرَةً»۔( ابن کثیر)۔ ”اے اللہ اگر تو نے مجھ پر بدبختی اور گناہ لکھا ہے تو اسے مٹا دے، اس لئے کہ تو جو چاہے مٹائے اور جو چاہے باقی رکھے، تیرے پاس ہی لوح محفوظ ہے، پس تو بدبختی کو سعادت اور مغفرت سے بدل دے“۔ اس مفہوم پر یہ اعتراض ہو سکتا ہے کہ حدیث میں تو آتا ہے «جَفَّ الْقَلَمُ بِمَا هُوَ كَائِنٌ»۔ (صحیح بخاری نمبر 5076)۔ ”جو کچھ ہونے والا ہے قلم اسے لکھ کر خشک ہو چکا ہے“ اس کا جواب یہ دیا گیا کہ یہ محو واثبات بھی منجملہ قضاء وتقدیر ہی کے ہے۔( فتح القدیر)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yamḥū al-lahu mā yashāu wayuth'bitu waʿindahu ummu al-kitābi ","translations":["(Is) eliminated","(by) Allah","what","He wills","and confirms","and with Him","(is) the Mother (of) the Book","(is) the Mother (of) the Book","(39)"],"transliterationArr":["yamḥū","al-lahu","mā","yashāu","wayuth'bitu","waʿindahu","ummu","al-kitābi",null],"verseTiming":[[1,0,690],[2,690,1620],[3,1620,2050],[4,2050,4400],[5,4400,5490],[6,5490,9180],[7,9180,10590],[8,10590,13015]]}}