{"name":"13:33","price":"آیا وه اللہ جو نگہبانی کرنے واﻻ ہے ہر شخص کی، اس کے کئے ہوئے اعمال پر(1) ، ان لوگوں نے اللہ کے شریک ٹھہرائے ہیں کہہ دیجئے ذرا ان کے نام تو لو(2)، کیا تم اللہ کو وه باتیں بتاتے ہو جو وه زمین میں جانتا ہی نہیں، یا صرف اوپری اوپری باتیں بتا رہے(3) ہو، بات اصل یہ ہے کہ کفر کرنے والوں کے لئے ان کے مکر سجا دیئے گئے ہیں(4)، اور وه صحیح راه سے روک دیئے گئے ہیں، اور جس کو اللہ گمراه کر دے اس کو راه دکھانے واﻻ کوئی نہیں.(5)","arabic":"أَفَمَنۡ هُوَ قَآئِمٌ عَلَىٰ كُلِّ نَفۡسِۭ بِمَا كَسَبَتۡۗ وَجَعَلُواْ لِلَّهِ شُرَكَآءَ قُلۡ سَمُّوهُمۡۚ أَمۡ تُنَبِّـُٔونَهُۥ بِمَا لَا يَعۡلَمُ فِي ٱلۡأَرۡضِ أَم بِظَٰهِرٖ مِّنَ ٱلۡقَوۡلِۗ بَلۡ زُيِّنَ لِلَّذِينَ كَفَرُواْ مَكۡرُهُمۡ وَصُدُّواْ عَنِ ٱلسَّبِيلِۗ وَمَن يُضۡلِلِ ٱللَّهُ فَمَا لَهُۥ مِنۡ هَادٖ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd","Chapter Ar-Ra'd","Ra'd","Surah Ra'd","Chapter Ra'd","Ar Ra'd","Surah Ar Ra'd","Chapter Ar Ra'd","Surah 13","Chapter 13","The Thunder","الرَّعد"],"ayahNumber":1740,"juzNumber":13,"footnotes":"(1) یہاں اس کا جواب محذوف ہے یعنی کیا رب العزت اور وہ معبودان باطل برابر ہو سکتے ہیں جن کی یہ عبادت کرتے ہیں، جو کسی کو نفع پہنچانے پرقادر ہیں نہ نقصان پہنچانے پر، نہ وہ دیکھتے ہیں اور نہ عقل وشعور سے بہرہ ور ہیں۔\n(2) یعنی ہمیں بھی تو بتاؤ تاکہ انہیں پہچان سکیں اس لئے کہ ان کی کوئی حقیقت ہی نہیں ہے۔ اس لئے آگے فرمایا، کیا تم اللہ کو وہ باتیں بتاتے ہو جو وہ زمین میں جانتا ہی نہیں، یعنی ان کا وجود ہی نہیں۔ اس لئے کہ اگر زمین میں ان کا وجود ہوتا تو اللہ تعالٰی کے علم میں ضرور ہوتا، اس پر تو کوئی چیز مخفی نہیں ہے۔\n(3) یہاں ظاہر ظن کے معنی میں ہے یعنی یا یہ صرف ان کی ظنی باتیں ہیں، مطلب یہ ہے کہ تم ان بتوں کی عبادت اس گمان پر کرتے ہو کہ یہ نفع نقصان پہنچا سکتے ہیں اور تم ان کے نام بھی معبود رکھے ہوئے ہیں، حالانکہ، \"یہ تمہارے اور تمہارے باپوں کے رکھے ہوئے نام ہیں، جن کی کوئی دلیل اللہ نے نہیں اتاری۔ یہ صرف گمان اور خواہش نفس کی پیروی کرتے ہیں\"۔ (النجم۔23)\n(4) مکر سے مراد، ان کے وہ غلط عقائد و اعمال ہیں جن میں شیطان نے ان کو پھنسا رکھا ہے، شیطان نے گمراہیوں پر بھی حسین غلاف چڑھا رکھے ہیں۔\n(5) جس طرح دوسرے مقام پر فرمایا، «وَمَنْ يُرِدِ اللَّهُ فِتْنَتَهُ فَلَنْ تَمْلِكَ لَهُ مِنَ اللَّهِ شَيْئًا»(المائدہ:41)۔ ”جس کو اللہ گمراہ کرنے کا ارادہ کر لے تو اللہ اس کے لئے کچھ اختیار نہیں رکھتا“، اور فرمایا۔ «اِنْ تَحْرِصْ عَلٰي هُدٰىهُمْ فَاِنَّ اللّٰهَ لَا يَهْدِيْ مَنْ يُّضِلُّ وَمَا لَهُمْ مِّنْ نّٰصِرِيْنَ» ( النحل:37)۔ ”اگر تم ان کی ہدایت کی خواہش رکھتے ہو تو (یاد رکھو) اللہ تعالٰی اسے ہدایت نہیں دیتا جسے وہ گمراہ کرتا ہے اور ان کا کوئی مددگار نہیں ہوگا“۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"afaman huwa qāimun ʿalā kulli nafsin bimā kasabat wajaʿalū lillahi shurakāa qul sammūhum am tunabbiūnahu bimā lā yaʿlamu fī al-arḍi am biẓāhirin mina al-qawli bal zuyyina lilladhīna kafarū makruhum waṣuddū ʿani al-sabīli waman yuḍ'lili al-lahu famā lahu min hādin ","translations":["Is then He Who","(He)","(is) a Maintainer","of","every","soul","for what","it has earned","Yet they ascribe","to Allah","partners","Say","Name them","Or","(do) you inform Him","of what","not","He knows","in","the earth","or","of the apparent","of","the words","Nay","(is) made fair-seeming","to those who","disbelieve","their plotting","and they are hindered","from","the Path","And whoever","(by) Allah","Allah lets go astray","then not","for him","any","guide","(33)"],"transliterationArr":["afaman","huwa","qāimun","ʿalā","kulli","nafsin","bimā","kasabat","wajaʿalū","lillahi","shurakāa","qul","sammūhum","am","tunabbiūnahu","bimā","lā","yaʿlamu","fī","al-arḍi","am","biẓāhirin","mina","al-qawli","bal","zuyyina","lilladhīna","kafarū","makruhum","waṣuddū","ʿani","al-sabīli","waman","yuḍ'lili","al-lahu","famā","lahu","min","hādin",null],"verseTiming":[[1,0,930],[2,930,1470],[3,1470,4289],[4,4289,5049],[5,5049,5869],[6,5869,7259],[7,7259,7999],[8,7999,9369],[9,9369,10589],[10,10589,11709],[11,11709,13849],[12,13849,14259],[13,14259,16789],[14,16789,17169],[15,17169,19429],[16,19429,20159],[17,20159,20649],[18,20649,21579],[19,21579,21839],[20,21839,22749],[21,22749,22979],[22,22979,24689],[23,24689,25939],[24,25939,27929],[25,27929,28909],[26,28909,29819],[27,29819,31169],[28,31169,32139],[29,32139,33339],[30,33339,34489],[31,34489,34889],[32,34889,37609],[33,37609,38079],[34,38079,38939],[35,38939,39879],[36,39879,40699],[37,40699,41399],[38,41399,42059],[39,42059,42619],[40,42619,44874]]}}