{"name":"13:43","price":"یہ کافر کہتے ہیں کہ آپ اللہ کے رسول نہیں۔ آپ جواب دیجئے کہ مجھ میں اور تم میں اللہ گواہی دینے واﻻ کافی ہے(1) اور وه جس کے پاس کتاب کا علم ہے.(2)","arabic":"وَيَقُولُ ٱلَّذِينَ كَفَرُواْ لَسۡتَ مُرۡسَلٗاۚ قُلۡ كَفَىٰ بِٱللَّهِ شَهِيدَۢا بَيۡنِي وَبَيۡنَكُمۡ وَمَنۡ عِندَهُۥ عِلۡمُ ٱلۡكِتَٰبِ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd","Chapter Ar-Ra'd","Ra'd","Surah Ra'd","Chapter Ra'd","Ar Ra'd","Surah Ar Ra'd","Chapter Ar Ra'd","Surah 13","Chapter 13","The Thunder","الرَّعد"],"ayahNumber":1750,"juzNumber":13,"footnotes":"(1) پس وہ جانتا ہے کہ میں اس کا سچا رسول اور اس کے پیغام کا داعی ہوں اور تم جھوٹے ہو۔\n(2) کتاب سے مراد جنس کتاب ہے اور مراد تورات اور انجیل کا علم ہے۔ یعنی اہل کتاب میں سے وہ لوگ جو مسلمان ہوگئے ہیں، جیسے عبد اللہ بن اسلام، سلمان فارسی اور تمیم داری وغیرہم (رضي الله عنه) م یعنی یہ بھی جانتے ہیں کہ میں اللہ کا رسول ہوں۔ عرب کے مشرکین اہم معاملات میں اہل کتاب کی طرف رجوع کرتے اور ان سے پوچھتے تھے، اللہ تعالٰی نے ان کی رہنمائی فرمائی کہ اہل کتاب جانتے ہیں، ان سے تم پوچھ لو۔ بعض کہتے ہیں کہ کتاب سے مراد قرآن ہے اور حاملین علم کتاب، مسلمان ہیں۔ اور بعض نے کتاب سے مراد لوح محفوظ لی ہے۔ یعنی جس کے پاس لوح محفوظ کا علم ہے یعنی اللہ تبارک و تعالیٰ، مگر پہلا مفہوم زیادہ درست ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wayaqūlu alladhīna kafarū lasta mur'salan qul kafā bil-lahi shahīdan baynī wabaynakum waman ʿindahu ʿil'mu al-kitābi ","translations":["And say","those who","disbelieve","You are not","a Messenger","Say","Sufficient","(is) Allah","(as) a Witness","between me","and between you","and whoever","[he] has","knowledge","(of) the Book","(43)"],"transliterationArr":["wayaqūlu","alladhīna","kafarū","lasta","mur'salan","qul","kafā","bil-lahi","shahīdan","baynī","wabaynakum","waman","ʿindahu","ʿil'mu","al-kitābi",null],"verseTiming":[[1,0,1250],[2,1250,2330],[3,2330,3370],[4,3370,4070],[5,4070,5330],[6,5330,5420],[7,5420,6110],[8,6110,6880],[9,6880,8040],[10,8040,9150],[11,9150,10630],[12,10630,12020],[13,12020,12860],[14,12860,14860],[15,14860,15700],[16,15700,19285]]}}