{"name":"13:6","price":"اور جو تجھ سے (سزا کی طلبی میں) جلد کر رہے ہیں راحت سے پہلے ہی، یقیناً ان سے پہلے سزائیں (بطور مثال) گزر چکی ہیں(1) ، اور بیشک تیرا رب البتہ بخشنے واﻻ ہے لوگوں کے بے جا ﻇلم پر بھی(2)۔ اور یہ بھی یقینی بات ہے کہ تیرا رب بڑی سخت سزا دینے واﻻ بھی ہے.(3)","arabic":"وَيَسۡتَعۡجِلُونَكَ بِٱلسَّيِّئَةِ قَبۡلَ ٱلۡحَسَنَةِ وَقَدۡ خَلَتۡ مِن قَبۡلِهِمُ ٱلۡمَثُلَٰتُۗ وَإِنَّ رَبَّكَ لَذُو مَغۡفِرَةٖ لِّلنَّاسِ عَلَىٰ ظُلۡمِهِمۡۖ وَإِنَّ رَبَّكَ لَشَدِيدُ ٱلۡعِقَابِ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd","Chapter Ar-Ra'd","Ra'd","Surah Ra'd","Chapter Ra'd","Ar Ra'd","Surah Ar Ra'd","Chapter Ar Ra'd","Surah 13","Chapter 13","The Thunder","الرَّعد"],"ayahNumber":1713,"juzNumber":13,"footnotes":"(1) یعنی عذاب الٰہی سے قوموں اور بستیوں کی تباہی کی کئی مثالیں پہلے گزر چکی ہیں، اس کے باوجود یہ عذاب جلدی مانگتے ہیں؟ یہ کفار کے جواب میں کہا گیا جو کہتے تھے کہ اے پیغمبر! اگر تو سچا ہے تو عذاب ہم پر لے آ۔ جس سے تو ہمیں ڈراتا رہتا ہے۔\n(2) یعنی لوگوں کے ظلم و معصیت کے باوجود وہ عذاب میں جلدی نہیں کرتا بلکہ مہلت دیتا ہے اور بعض دفعہ تو اتنی تاخیر کرتا ہے کہ معاملہ قیامت پر چھوڑ دیتا ہے، یہ اس کے حلم و کرم اور عفو و درگزر کا نتیجہ ہے ورنہ وہ فوراً مواخذہ کرنے اور عذاب دینے پر آجائے تو روئے زمین پر کوئی انسان ہی باقی نہ رہے۔ «وَلَوْ يُؤَاخِذُ اللّٰهُ النَّاسَ بِمَا كَسَبُوْا مَا تَرَكَ عَلٰي ظَهْرِهَا مِنْ دَاۗبَّةٍ» (فاطر:45) ”اور اگر اللہ تعالٰی لوگوں پر ان کے اعمال کے سبب پکڑ دھکڑ فرمانے لگتا تو روئے زمین پر ایک تنفس کو نہ چھوڑتا“۔\n(3) یہ اللہ کی دوسری صفت کا بیان ہے تاکہ انسان صرف ایک ہی پہلو پر نظر نہ رکھے اس کے دوسرے پہلو کو بھی دیکھتا رہے کیونکہ ایک ہی رخ اور ایک ہی پہلو کو مسلسل دیکھنے رہنے سے بہت سی چیزیں اوجھل رہ جاتی ہیں اسی لیے قرآن کریم میں جہاں اللہ کی صفت رحیمی وغفوری کا بیان ہوتا ہے تو اس کے ساتھ ہی اس کی دوسری صفت قہاری و جباری کا بیان بھی ملتا ہے جیسا کہ یہاں بھی ہے تاکہ رجاء امید اور خوف دونوں پہلو سامنے رہیں کیونکہ اگر امید ہی امید سامنے رہے تو انسان معصیت الہی پر دلیر ہو جاتا ہے اور اگر خوف ہی خوف ہر وقت دل ودماغ پر مسلط رہے تو اللہ کی رحمت سے مایوسی ہو جاتی ہے اور دونوں ہی باتیں غلط اور انسان کے لیے تباہ کن ہیں اسی لیے کہا جاتا ہے«الإِيمَانُ بَيْنَ الْخَوْفِ وَالرَّجَاءِ» ”ایمان خوف اور امید کے درمیان ہے“ یعنی دونوں باتوں کے درمیان اعتدال وتوازن کا نام ایمان ہے انسان اللہ کے عذاب کے خوف سے بےپروا ہو اور نہ اس کی رحمت سے مایوس۔ اس مضمون کے ملاحظہ کے لیے دیکھئے (سورۃ الانعام:47، سورۃ الاعراف:167، سورۃ الحجر:49، 50)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wayastaʿjilūnaka bil-sayi-ati qabla al-ḥasanati waqad khalat min qablihimu al-mathulātu wa-inna rabbaka ladhū maghfiratin lilnnāsi ʿalā ẓul'mihim wa-inna rabbaka lashadīdu al-ʿiqābi ","translations":["And they ask you to hasten","the evil","before","the good","and verily","has occurred","from","before them","[the] similar punishments","And indeed","your Lord","(is) full","(of) forgiveness","for mankind","for","their wrongdoing","and indeed","your Lord","(is) severe","(in) the penalty","(6)"],"transliterationArr":["wayastaʿjilūnaka","bil-sayi-ati","qabla","al-ḥasanati","waqad","khalat","min","qablihimu","al-mathulātu","wa-inna","rabbaka","ladhū","maghfiratin","lilnnāsi","ʿalā","ẓul'mihim","wa-inna","rabbaka","lashadīdu","al-ʿiqābi",null],"verseTiming":[[1,0,2440],[2,2440,4160],[3,4160,4780],[4,4780,5970],[5,5970,6540],[6,6540,7350],[7,7350,8410],[8,8410,9480],[9,9480,13150],[10,13150,14550],[11,14550,15460],[12,15460,16150],[13,16150,17400],[14,17400,19530],[15,19530,20179],[16,20179,21729],[17,21729,22869],[18,22869,23789],[19,23789,24999],[20,24999,27404]]}}