{"name":"14:14","price":"اور ان کے بعد ہم خود تمہیں اس زمین میں بسائیں گے(1) ۔ یہ ہے ان کے لئے جو میرے سامنے کھڑے ہونے کا ڈر رکھیں اور میری وعید سے خوفزده رہیں.(2)","arabic":"وَلَنُسۡكِنَنَّكُمُ ٱلۡأَرۡضَ مِنۢ بَعۡدِهِمۡۚ ذَٰلِكَ لِمَنۡ خَافَ مَقَامِي وَخَافَ وَعِيدِ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim","Chapter Ibrahim","Surah 14","Chapter 14","Abraham","إبراهيم"],"ayahNumber":1764,"juzNumber":13,"footnotes":"(1) یہ مضمون بھی اللہ نے کئی مقامات پر بیان فرمایا ہے مثلاً، «وَلَقَدْ كَتَبْنَا فِي الزَّبُورِ مِنْ بَعْدِ الذِّكْرِ أَنَّ الأَرْضَ يَرِثُهَا عِبَادِيَ الصَّالِحُونَ» (الأنبياء:105) ۔ ”ہم نے لکھ دیا زبور میں، نصیحت کے پیچھے کہ آخر زمین کے وارث ہوں گے میرے نیک بندے“۔ (مزید دیکھئے سورۃ الاعراف: 128، 137) چنانچہ اس کے مطابق اللہ تعالٰی نے نبی کریم (صلى الله عليه وسلم) کی مدد فرمائی، آپ کو با دل نخواستہ مکے سے نکلنا پڑا لیکن چند سالوں بعد ہی آپ فاتحانہ مکے میں داخل ہوئے اور آپ کو نکلنے پر مجبور کرنے والے ظالم مشرکین سر جھکائے، کھڑے آپ کے اشارہ ابرو کے منتظر تھے لیکن آپ (صلى الله عليه وسلم)نے خلق عظیم کا مظاہرہ کرتے ہوئے «لَا تَثْرِيْبَ عَلَيْكُمُ» (یوسف:92) کہہ کر سب کو معاف فرما دیا۔ صَلَوَاتُ اللهِ وَسَلاَمُهُ عَلَيْهِ\n(2) جس طرح دوسرے مقام پر فرمایا۔«وَأَمَّا مَنْ خَافَ مَقَامَ رَبِّهِ وَنَهَى النَّفْسَ عَنِ الْهَوَى ، فَإِنَّ الْجَنَّةَ هِيَ الْمَأْوَى» ( النازعات: 40-41)۔ ”جو اپنے رب کے سامنے کھڑا ہونے سے ڈر گیا اور اپنے نفس کو خواہش سے روکے رکھا یقینا جنت اس کا ٹھکانہ ہے“۔ «وَلِمَنْ خَافَ مَقَامَ رَبِّهِ جَنَّتَانِ» (النازعات :46)۔ ”جو اپنے رب کے سامنے کھڑا ہونے سے ڈر گیا اس کے لیے دو جنتیں ہیں“۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walanus'kinannakumu al-arḍa min baʿdihim dhālika liman khāfa maqāmī wakhāfa waʿīdi ","translations":["And surely We will make you dwell","(in) the land","after them","after them","That","(is) for whoever","fears","standing before Me","and fears","My Threat","(14)"],"transliterationArr":["walanus'kinannakumu","al-arḍa","min","baʿdihim","dhālika","liman","khāfa","maqāmī","wakhāfa","waʿīdi",null],"verseTiming":[[1,0,2820],[2,2820,3760],[3,3760,4830],[4,4830,6360],[5,6360,7380],[6,7380,7880],[7,7880,8760],[8,8760,9970],[9,9970,10900],[10,10900,13215]]}}