{"name":"14:37","price":"اے ہمارے پروردگار! میں نے اپنی کچھ اوﻻد(1) اس بے کھیتی کی وادی میں تیرے حرمت والے گھر کے پاس بسائی ہے۔ اے ہمارے پروردگار! یہ اس لیے کہ وه نماز قائم رکھیں(2)، پس تو کچھ لوگوں(3) کے دلوں کو ان کی طرف مائل کردے۔ اور انہیں پھلوں کی روزیاں عنایت فرما(4) تاکہ یہ شکر گزاری کریں.","arabic":"رَّبَّنَآ إِنِّيٓ أَسۡكَنتُ مِن ذُرِّيَّتِي بِوَادٍ غَيۡرِ ذِي زَرۡعٍ عِندَ بَيۡتِكَ ٱلۡمُحَرَّمِ رَبَّنَا لِيُقِيمُواْ ٱلصَّلَوٰةَ فَٱجۡعَلۡ أَفۡـِٔدَةٗ مِّنَ ٱلنَّاسِ تَهۡوِيٓ إِلَيۡهِمۡ وَٱرۡزُقۡهُم مِّنَ ٱلثَّمَرَٰتِ لَعَلَّهُمۡ يَشۡكُرُونَ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim","Chapter Ibrahim","Surah 14","Chapter 14","Abraham","إبراهيم"],"ayahNumber":1787,"juzNumber":13,"footnotes":"(1) مِنْ ذُرِّیَّتِیْ میں مِن اولاد کے لئے ہے۔ یعنی بعض کہتے ہیں حضرت ابراہم (عليه السلام) کے آٹھ صلبی بیٹے تھے، جن میں سے صرف حضرت اسماعیل (عليه السلام) کو یہاں بسایا (فتح القدیر)\n(2) عبادت میں صرف نماز کا ذکر کیا، جس سے نماز کی اہمیت واضح ہے۔\n(3) یہاں بھی اولاد کے لئے ہے۔ کہ کچھ لوگ، مراد اس سے مسلمان ہیں۔ چنانچہ دیکھ لیجئے کہ کس طرح دنیا بھر کے مسلمان مکہ مکرمہ میں جمع ہوتے ہیں اور حج کے علاوہ بھی سارا سال یہ سلسلہ جاری رہتا ہے۔ اگر حضرت ابراہیم (عليه السلام) أَفْئِدَةَ النَّاس ِ (لوگوں کے دلوں) کہتے تو عیسائی، یہودی، مجوسی اور دیگر تمام لوگ مکہ پہنچتے۔ مِنَ النَّاسِ کے مِنْ نے اس دعا کو مسلمانوں تک محدود کر دیا (ابن کثیر)\n(4) اس دعا کی تاثیر بھی دیکھ لی جائے کہ مکہ جیسی بےآب و گیاہ سرزمین میں جہاں کوئی پھلدار درخت نہیں، دنیا بھر کے پھل اور میوے نہایت فراوانی کے ساتھ مہیا ہیں حج کے موقع پر بھی، جب لاکھوں افراد مزید وہاں پہنچ جاتے ہیں، پھلوں کی فراوانی میں کوئی کمی نہیں آتی، وَهَذَا مِنْ لُطْفِ اللهِ تَعَالَى وَكَرَمِهِ وَرَحْمَتِه وَبَرَكَتِهِ، اسْتِجَابَةً لِخَلِيلِهِ إِبْرَاهِيمَ - عَلَيْه السَّلام کہا جاتا ہے کہ یہ دعا خانہ کعبہ کی تعمیر کے بعد مانگی۔ جب کہ پہلی دعا اس وقت مانگی، جب اپنی اہلیہ اور شیر خوار بچے اسماعیل کو اللہ تعالٰی کے حکم پر وہاں چھوڑ کر چلے گئے (ابن کثیر)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"rabbanā innī askantu min dhurriyyatī biwādin ghayri dhī zarʿin ʿinda baytika al-muḥarami rabbanā liyuqīmū al-ṣalata fa-ij'ʿal afidatan mina al-nāsi tahwī ilayhim wa-ur'zuq'hum mina al-thamarāti laʿallahum yashkurūna ","translations":["Our Lord","Indeed, I","[I] have settled","(some) of","my offsprings","in a valley","not","with","cultivation","near","Your Sacred House","Your Sacred House","our Lord","That they may establish","the prayers","So make","hearts","of","the men","incline","towards them","and provide them","with","the fruits","so that they may","be grateful","(37)"],"transliterationArr":["rabbanā","innī","askantu","min","dhurriyyatī","biwādin","ghayri","dhī","zarʿin","ʿinda","baytika","al-muḥarami","rabbanā","liyuqīmū","al-ṣalata","fa-ij'ʿal","afidatan","mina","al-nāsi","tahwī","ilayhim","wa-ur'zuq'hum","mina","al-thamarāti","laʿallahum","yashkurūna",null],"verseTiming":[[1,0,2460],[2,2460,3675],[3,3675,5252],[4,5252,5660],[5,5660,7736],[6,7736,8954],[7,8954,9915],[8,9915,10413],[9,10413,10982],[10,10982,12028],[11,12028,12844],[12,12844,14317],[13,14317,16043],[14,16043,17026],[15,17026,18262],[16,18262,19144],[17,19144,20174],[18,20174,21502],[19,21502,22497],[20,22497,23871],[21,23871,26486],[22,26486,27429],[23,27429,29144],[24,29144,31216],[25,31216,32257],[26,32257,33172],[27,33172,34538],[28,34538,37159]]}}