{"name":"14:34","price":"اسی نے تمہیں تمہاری منہ مانگی کل چیزوں میں سے دے رکھا ہے(1) ۔ اگر تم اللہ کے احسان گننا چاہو تو انہیں پورے گن بھی نہیں سکتے(2)۔ یقیناً انسان بڑا ہی بے انصاف اور ناشکرا ہے.(3)","arabic":"وَءَاتَىٰكُم مِّن كُلِّ مَا سَأَلۡتُمُوهُۚ وَإِن تَعُدُّواْ نِعۡمَتَ ٱللَّهِ لَا تُحۡصُوهَآۗ إِنَّ ٱلۡإِنسَٰنَ لَظَلُومٞ كَفَّارٞ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim","Chapter Ibrahim","Surah 14","Chapter 14","Abraham","إبراهيم"],"ayahNumber":1784,"juzNumber":13,"footnotes":"(1) یعنی اس نے تمہاری ضرورت کی تمام چیزیں مہیا کیں جو تم اس سے طلب کرتے ہو، وہ بھی دیتا ہے اور جسے نہیں مانگتے، لیکن اسے پتہ ہے کہ وہ تمہاری ضرورت ہے، وہ بھی دے دیتا ہے۔ غرض تمہیں زندگی گزارنے کی تمام سہولتیں فراہم کرتا ہے۔\n(2) یعنی اللہ کی نعمتیں ان گنت ہیں انہیں کوئی شمار میں نہیں لا سکتا۔ چہ‌جائیکہ کوئی ان نعمتوں کے شکر کا حق ادا کرسکے۔ ایک اثر میں حضرت داؤد (عليه السلام) کا قول نقل کیا گیا ہے۔ انہوں نے کہا ' اے رب! میں تیرا شکر کس طرح ادا کروں؟ جب کہ شکر بجائے خود تیری طرف سے مجھ پر ایک نعمت ہے ' اللہ تعالٰی نے فرمایا ' اے داؤد اب تو نے میرا شکر ادا کر دیا جب کہ تو نے اعتراف کر لیا کہ یا اللہ میں تیری نعمتوں کا شکر ادا کرنے سے قاصر ہوں ' (تفسیر ابن کثیر)\n(3) اللہ کی نعمتوں پر شکر ادا کرنے سے غفلت کی وجہ سے انسان اپنے نفس کے ساتھ ظلم اور بے انصافی کرتا ہے۔ بالخصوص کافر، جو بالکل ہی اللہ سے غافل ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waātākum min kulli mā sa-altumūhu wa-in taʿuddū niʿ'mata al-lahi lā tuḥ'ṣūhā inna al-insāna laẓalūmun kaffārun ","translations":["And He gave you","of","all","what","you asked of Him","And if","you count","(the) Favor of Allah","(the) Favor of Allah","not","you will (be able to) count them","Indeed","the mankind","(is) surely unjust","(and) ungrateful","(34)"],"transliterationArr":["waātākum","min","kulli","mā","sa-altumūhu","wa-in","taʿuddū","niʿ'mata","al-lahi","lā","tuḥ'ṣūhā","inna","al-insāna","laẓalūmun","kaffārun",null],"verseTiming":[[1,0,570],[2,570,1544],[3,1544,2173],[4,2173,2533],[5,2533,6365],[6,6365,7562],[7,7562,8847],[8,8847,9654],[9,9654,10481],[10,10481,11080],[11,11080,12863],[12,12863,14202],[13,14202,16498],[14,16498,17479],[15,17479,20237]]}}