{"name":"14:35","price":"(ابراہیم کی یہ دعا بھی یاد کرو) جب انہوں نے کہا کہ اے میرے پروردگار! اس شہر کو امن واﻻ بنادے(1) ، اور مجھے اور میری اوﻻد کو بت پرستی سے پناه دے.","arabic":"وَإِذۡ قَالَ إِبۡرَٰهِيمُ رَبِّ ٱجۡعَلۡ هَٰذَا ٱلۡبَلَدَ ءَامِنٗا وَٱجۡنُبۡنِي وَبَنِيَّ أَن نَّعۡبُدَ ٱلۡأَصۡنَامَ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim","Chapter Ibrahim","Surah 14","Chapter 14","Abraham","إبراهيم"],"ayahNumber":1785,"juzNumber":13,"footnotes":"(1) ”اس شہر“ سے مراد مکہ ہے۔ دیگر دعاؤں سے قبل یہ دعا کی کہ اسے امن والا بنا دے، اس لئے کہ امن ہوگا تو لوگ دوسری نعمتوں سے بھی صحیح معنوں میں فائدہ اٹھا سکیں گے، ورنہ امن و سکون کے بغیر تمام آسائشوں اور سہولتوں کے باوجود، خوف اور دہشت کے سائے انسان کو مضطرب اور پریشان رکھتے ہیں۔ جیسے آجکل کے عام معاشروں کا حال ہے۔ سوائے سعودی عرب کے۔ وہاں اس دعا کی برکت سے اور اسلامی حدود کے نفاذ سے آج بھی ایک مثالی امن قائم ہے۔ صَانَهَا اللهُ عَنِ الشُّرُورِ وَالْفِتَنِ۔ یہاں انعامات الہیہ کے ضمن میں اسے بیان فرما کر اشارہ کر دیا کہ قریش جہاں اللہ کے دیگر انعامات سے غافل ہیں اس خصوصی انعام سے بھی غافل ہیں کہ اس نے انہیں مکہ جیسے امن والے شہر کا باشندہ بنایا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-idh qāla ib'rāhīmu rabbi ij'ʿal hādhā al-balada āminan wa-uj'nub'nī wabaniyya an naʿbuda al-aṣnāma ","translations":["And when","said","Ibrahim","My Lord","Make","this","city","safe","and keep me away","and my sons","that","we worship","the idols","(35)"],"transliterationArr":["wa-idh","qāla","ib'rāhīmu","rabbi","ij'ʿal","hādhā","al-balada","āminan","wa-uj'nub'nī","wabaniyya","an","naʿbuda","al-aṣnāma",null],"verseTiming":[[1,0,-477],[2,-477,-270],[3,-270,1079],[4,1079,1794],[5,1794,2378],[6,2378,2935],[7,2935,4284],[8,4284,5320],[9,5320,7426],[10,7426,8503],[11,8503,9894],[12,9894,10577],[13,10577,12929]]}}