{"name":"14:46","price":"یہ اپنی اپنی چالیں چل رہے ہیں اور اللہ کو ان کی تمام چالوں کا علم ہے(1) اور ان کی چالیں ایسی نہ تھیں کہ ان سے پہاڑ اپنی جگہ سے ٹل جائیں.(2)","arabic":"وَقَدۡ مَكَرُواْ مَكۡرَهُمۡ وَعِندَ ٱللَّهِ مَكۡرُهُمۡ وَإِن كَانَ مَكۡرُهُمۡ لِتَزُولَ مِنۡهُ ٱلۡجِبَالُ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim","Chapter Ibrahim","Surah 14","Chapter 14","Abraham","إبراهيم"],"ayahNumber":1796,"juzNumber":13,"footnotes":"(1) یہ جملہ حالیہ ہے کہ ہم نے ان کے ساتھ جو کیا وہ کیا، درآنحالیکہ انہوں نے باطل کے اثبات اور حق کے رد کرنے کے لئے مقدور بھر حیلے اور مکر کیے اور اللہ کو ان تمام چالوں کا علم ہے یعنی اس کے پاس درج ہے جس کی وہ ان کو سزا دے گا۔\n(2) کیونکہ اگر پہاڑ ٹل گئے ہوتے تو اپنی جگہ برقرار نہ ہوتے، جب کہ سب پہاڑ اپنی اپنی جگہ ثابت اور برقرار ہیں۔ یہ ان نافیہ کی صورت میں ہے دوسرے معین ان مخففۃ من المثقلۃ کے لیے گئے ہیں یعنی یقینا ان کے مکر تو اتنے بڑے تھے کہ پہاڑ بھی اپنی جگہ سے ٹل جاتے یہ تو اللہ تعالٰی ہی ہے جس نے ان کے مکروں کو کامیاب نہیں ہوتے دیا جیسے مشریکن کے شرک کے بارے میں اللہ تعالٰی نے فرمایا۔ «تَكَادُ السَّمَاوَاتُ يَتَفَطَّرْنَ مِنْهُ وَتَنْشَقُّ الأَرْضُ وَتَخِرُّ الْجِبَالُ هَدًّا (1) أَنْ دَعَوْا لِلرَّحْمَنِ وَلَدًا» (سورة مريم: 90-91)۔ ”قریب ہے کہ آسمان پھٹ پڑیں اور زمین شق ہو جائے اور پہاڑ ریزہ ریزہ ہو جائیں اس بات پر کہ انہوں نے کہا اللہ رحمٰن کی اولاد ہے“۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waqad makarū makrahum waʿinda al-lahi makruhum wa-in kāna makruhum litazūla min'hu al-jibālu ","translations":["And indeed","they planned","their plan","but with","Allah","(was) their plan","even if","was","their plan","that should be moved","by it","the mountains","(46)"],"transliterationArr":["waqad","makarū","makrahum","waʿinda","al-lahi","makruhum","wa-in","kāna","makruhum","litazūla","min'hu","al-jibālu",null],"verseTiming":[[1,0,1282],[2,1282,2287],[3,2287,3102],[4,3102,4376],[5,4376,5212],[6,5212,7046],[7,7046,8378],[8,8378,9381],[9,9381,10489],[10,10489,11756],[11,11756,12843],[12,12843,13849],[13,13849,15078],[14,15078,15641],[15,15641,18935]]}}