{"name":"14:48","price":"جس دن زمین اس زمین کے سوا اور ہی بدل دی جائے گی اور آسمان بھی(1) ، اور سب کے سب اللہ واحد غلبے والے کے روبرو ہوں گے.","arabic":"يَوۡمَ تُبَدَّلُ ٱلۡأَرۡضُ غَيۡرَ ٱلۡأَرۡضِ وَٱلسَّمَٰوَٰتُۖ وَبَرَزُواْ لِلَّهِ ٱلۡوَٰحِدِ ٱلۡقَهَّارِ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim","Chapter Ibrahim","Surah 14","Chapter 14","Abraham","إبراهيم"],"ayahNumber":1798,"juzNumber":13,"footnotes":"(1) امام شوکانی فرماتے ہیں کہ آیت میں دونوں احتمال ہیں کہ یہ تبدیلی صفات کے لحاظ سے ہو یا ذات کے لحاظ سے۔ یعنی یہ آسمان و زمین اپنے صفات کے اعتبار سے بدل جائیں گے یا ویسے ہی ذاتی طور پر یہ تبدیلی آئے گی، نہ زمین رہے گی اور نہ یہ آسمان۔ زمین بھی کوئی اور ہوگی اور آسمان بھی کوئی اور۔ حدیث میں آتا ہے، رسول اللہ (صلى الله عليه وسلم) نے فرمایا :«يُحْشَرُ النَّاسُ يَوْمَ الْقِيَامَةِ عَلَى أَرْضٍ بَيْضَاءَ عَفْرَاءَ، كَقُرْصَةِ النَّقِيِّ لَيْس فِيهَا عَلَمٌ لأحَدٍ»۔ (صحيح مسلم، صفة القيامة، باب في البعث والنشور) « قیامت والے دن لوگ سفید بھوری زمین پر اکھٹے ہونگے جو میدہ کی روٹی کی طرح ہوگی۔ اس میں کسی کا کوئی جھنڈا (یا علامتی نشان) نہیں ہوگا»۔ حضرت عائشہ رضی اللہ نے پوچھا کہ جب یہ آسمان و زمین بدل دئیے جائیں گے تو پھر لوگ اس دن کہاں ہونگے؟ نبی (صلى الله عليه وسلم) نے فرمایا ”صراط پر“ یعنی پل صراط پر (حوالہ مذکور) ایک یہودی کے پوچھنے پر آپ نے فرمایا کہ ”لوگ اس دن پل کے قریب اندھیرے میں ہونگے“۔ (صحيح مسلم، كتاب الحيض، باب بيان صفة مني الرجل)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yawma tubaddalu al-arḍu ghayra al-arḍi wal-samāwātu wabarazū lillahi al-wāḥidi al-qahāri ","translations":["(On the) Day","will be changed","the earth","(to) other (than)","the earth","and the heavens","and they will come forth","before Allah","the One","the Irresistible","(48)"],"transliterationArr":["yawma","tubaddalu","al-arḍu","ghayra","al-arḍi","wal-samāwātu","wabarazū","lillahi","al-wāḥidi","al-qahāri",null],"verseTiming":[[1,0,1495],[2,1495,2031],[3,2031,2971],[4,2971,3629],[5,3629,4604],[6,4604,8396],[7,8396,9608],[8,9608,10664],[9,10664,11713],[10,11713,15336]]}}