{"name":"14:5","price":"(یاد رکھو جب کہ) ہم نے موسیٰ کو اپنی نشانیاں دے کر بھیجا کہ تو اپنی قوم کو اندھیروں سے روشنی میں نکال(1) اور انہیں اللہ کے احسانات یاد دﻻ(2)۔ اس میں نشانیاں ہیں ہر ایک صبر شکر کرنے والے کے لئے.(3)","arabic":"وَلَقَدۡ أَرۡسَلۡنَا مُوسَىٰ بِـَٔايَٰتِنَآ أَنۡ أَخۡرِجۡ قَوۡمَكَ مِنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِ وَذَكِّرۡهُم بِأَيَّىٰمِ ٱللَّهِۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّكُلِّ صَبَّارٖ شَكُورٖ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim","Chapter Ibrahim","Surah 14","Chapter 14","Abraham","إبراهيم"],"ayahNumber":1755,"juzNumber":13,"footnotes":"(1) یعنی جس طرح اے محمد (صلى الله عليه وسلم) ہم نے آپ کو اپنی قوم کی طرف بھیجا اور کتاب نازل کی تاکہ آپ اپنی قوم کو کفر اور شرک کی تاریکیوں سے نکال کر ایمان کی روشنی کی طرف لائیں۔ اسی طرح ہم نے موسیٰ (عليه السلام) کو معجزات و دلائل دے کر ان کی قوم کی طرف بھیجا۔ تاکہ وہ انہیں کفر کی تاریکیوں سے نکال کر ایمان کی روشنی عطا کریں۔ آیات سے مراد وہ معجزات ہیں جو موسیٰ (عليه السلام) کو عطا کئے گئے تھے، یا وہ نو معجزات ہیں جن کا ذکر سورہ بنی اسرائیل میں کیا گیا ہے۔\n(2) اَ یَّامَ اللّٰہِ سے مراد اللہ کے وہ احسنات ہیں جو بنی اسرائیل پر کئے گئے جن کی تفصیل پہلے کئی مرتبہ گزر چکی ہے۔ یا ایام وقائع کے معنی میں ہے، یعنی وہ واقعات ان کو یاد دلا جن سے وہ گزر چکے ہیں جن میں ان پر اللہ تعالٰی کے خصوصی انعامات ہوئے۔ جن میں سے بعض کا تذکرہ یہاں بھی آرہا ہے۔\n(3) صبر اور شکر یہ دو بڑی خوبیاں ہیں اور ایمان کا مدار ان پر ہے، اس لئے یہاں صرف ان دو کا تذکرہ کیا گیا ہے دونوں مبالغے کے صیغے ہیں۔ صبار، بہت صبر کرنے والا، شکور، بہت شکر کرنے والا اور صبر کو شکر پر مقدم کیا ہے اس لئے کہ شکر، صبر ہی کا نتیجہ ہے۔ حدیث میں ہے رسول اللہ (صلى الله عليه وسلم) نے فرمایا \"مومن کا معاملہ بھی عجیب ہے۔ اللہ تعالٰی اس کے لئے جس امر کا بھی فیصلہ کرے، وہ اس کے حق میں بہتر ہوتا ہے، اگر اسے تکلیف پہنچے اور وہ صبر کرے تو یہ بھی اس کے حق میں بہتر ہے اور اگر اسے کوئی خوشی پہنچے، وہ اس پر اللہ کا شکر ادا کرے تو یہ بھی اس کے حق میں بہتر ہے \"۔(صحيح مسلم، كتاب الزهد، باب المؤمن أمره كله خير)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walaqad arsalnā mūsā biāyātinā an akhrij qawmaka mina al-ẓulumāti ilā al-nūri wadhakkir'hum bi-ayyāmi al-lahi inna fī dhālika laāyātin likulli ṣabbārin shakūrin ","translations":["And verily","We sent","Musa","with Our Signs","that","Bring out","your people","from","the darkness[es]","to","the light","And remind them","of the days","(of) Allah","Indeed","in","that","surely (are) the signs","for everyone","patient","and thankful","(5)"],"transliterationArr":["walaqad","arsalnā","mūsā","biāyātinā","an","akhrij","qawmaka","mina","al-ẓulumāti","ilā","al-nūri","wadhakkir'hum","bi-ayyāmi","al-lahi","inna","fī","dhālika","laāyātin","likulli","ṣabbārin","shakūrin",null],"verseTiming":[[1,0,790],[2,790,2090],[3,2090,2920],[4,2920,4400],[5,4400,6160],[6,6160,6920],[7,6920,7800],[8,7800,8170],[9,8170,9500],[10,9500,9850],[11,9850,11170],[12,11170,13070],[13,13070,14920],[14,14920,16290],[15,16290,18510],[16,18510,19500],[17,19500,19990],[18,19990,20900],[19,20900,22300],[20,22300,23230],[21,23230,24630],[22,24630,27645]]}}