{"name":"14:7","price":"اور جب تمہارے پروردگار نے تمہیں آگاه (1) کر دیا کہ اگر تم شکر گزاری کرو گے تو بیشک میں تمہیں زیاده(2) دوں گا اور اگر تم ناشکری کرو گے تو یقیناً میرا عذاب بہت سخت ہے.(3)","arabic":"وَإِذۡ تَأَذَّنَ رَبُّكُمۡ لَئِن شَكَرۡتُمۡ لَأَزِيدَنَّكُمۡۖ وَلَئِن كَفَرۡتُمۡ إِنَّ عَذَابِي لَشَدِيدٞ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim","Chapter Ibrahim","Surah 14","Chapter 14","Abraham","إبراهيم"],"ayahNumber":1757,"juzNumber":13,"footnotes":"(1) تَأَذَّنَ کے معنی أَعْلَمَكُمْ بِوَعْدِهِ لَكُمْ، اس نے تمہیں اپنے وعدے سے تمہیں آگاہ اور خبردار کر دیا ہے۔ اور یہ احتمال بھی ہے کہ یہ قسم کے معنی میں ہو یعنی جب تمہارے رب نے اپنی عزت و جلال اور کبریائی کی قسم کھا کر کہا (ابن کثیر)\n(2) نعمت پر شکر کرنے پر مزید انعامات سے نوازوں گا۔\n(3) اس کا مطلب یہ ہوا کہ کفران نعمت (ناشکری) اللہ کو ناپسند ہے، جس پر اس نے سخت عذاب کی وعید بیان فرمائی ہے، اس لئے نبی (صلى الله عليه وسلم) نے بھی فرمایا کہ عورتوں کی اکثریت اپنے خاوندوں کی ناشکری کرنے کی وجہ سے جہنم میں جائے گی (صحيح مسلم، العيدين أوائل كتاب الصلاة)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-idh ta-adhana rabbukum la-in shakartum la-azīdannakum wala-in kafartum inna ʿadhābī lashadīdun ","translations":["And when","proclaimed","your Lord","If","you are thankful","surely I will increase you","but if","you are ungrateful","indeed","My punishment","(is) surely severe","(7)"],"transliterationArr":["wa-idh","ta-adhana","rabbukum","la-in","shakartum","la-azīdannakum","wala-in","kafartum","inna","ʿadhābī","lashadīdun",null],"verseTiming":[[1,0,690],[2,690,1720],[3,1720,2830],[4,2830,3700],[5,3700,5160],[6,5160,8200],[7,8200,9090],[8,9090,10790],[9,10790,11840],[10,11840,13050],[11,13050,15515]]}}