{"name":"14:8","price":"موسیٰ (علیہ السلام) نے کہا کہ اگر تم سب اور روئے زمین کے تمام انسان اللہ کی ناشکری کریں تو بھی اللہ بے نیاز اور تعریفوں(1) واﻻ ہے.","arabic":"وَقَالَ مُوسَىٰٓ إِن تَكۡفُرُوٓاْ أَنتُمۡ وَمَن فِي ٱلۡأَرۡضِ جَمِيعٗا فَإِنَّ ٱللَّهَ لَغَنِيٌّ حَمِيدٌ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim","Chapter Ibrahim","Surah 14","Chapter 14","Abraham","إبراهيم"],"ayahNumber":1758,"juzNumber":13,"footnotes":"(1) مطلب یہ ہے کہ انسان اللہ کی شکر گزاری کرے گا تو اس میں اسی کا فائدہ ہے۔ ناشکری کرے گا تو اللہ کا اس میں کیا نقصان ہے؟ وہ تو بےنیاز ہے سارا جہان ناشکرگزار ہو جائے تو اس کا کیا بگڑے گا جس طرح حدیث قدسی میں آتا ہے اللہ تعالٰی فرماتا ہے:۔ «يَا عِبَادِي لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ، وَإِنْسَكُمْ وَجِنَّكُمْ، كَانُوا عَلَى أَتْقَى قَلْبِ رَجُلٍ مِنْكُمْ ، مَا زَادَ ذَلِكَ فِي مُلْكِي شَيْئًا، يَا عِبَادِي لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ، وَإِنْسَكُمْ وَجِنَّكُمْ، كَانُوا عَلَى أَفْجَرِ قَلْبِ رَجُلٍ وَاحِدٍ , مَا نَقَصَ ذَلِكَ فِي مُلْكِي شَيْئًا ، يَا عِبَادِي لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ، وَإِنْسَكُمْ وَجِنَّكُمْ، ، قَامُوا فِي صَعِيدٍ وَاحِدٍ فَسَأَلُونِي فَأَعْطَيْتُ كُلَّ إِنْسَانٍ مَسْأَلَتَهُ مَا نَقَصَ ذَلِكَ مِنْ مُلْكِي شَيْئًا إِلا كَمَا يُنْقِصُ الْمِخْيَطُ إِذَا أُدْخِلَ فِي الْبَحْرِ»۔(صحيح مسلم كتاب البر ، باب تحريم الظلم) ”اے میرے بندو! اگر تمہارے اوّل اور آخر اور اسی طرح تمام انسان اور جن، اس ایک آدمی کے دل کی طرح ہوجائیں، جو تم میں سب سے زیادہ متقی اور پرہزگار ہو، (یعنی کوئی بھی نافرمان نہ رہے) تو اس سے میری حکومت اور بادشاہی میں اضافہ نہیں ہوگا اے میرے بندو! اگر تمہارے اول و آخر اور تمام انسان اور جن ایک آدمی کے دل کی طرح ہوجائیں، جو تم میں سب سے بڑا نافرمان اور فاجر ہو تو اس سے میری حکومت اور بادشاہی میں کوئی کمی واقع نہیں ہوگی۔ اے میرے بندو! اگر تمہارے اول اور آخر اور انسان و جن، سب ایک میدان میں جمع ہوجائیں اور مجھ سے سوال کریں، پس میں ہر انسان کو اس کے سوال کے مطابق عطا کر دوں تو اس سے میرے خزانے اور بادشاہی میں اتنی ہی کمی ہوگی جتنی سوئی کے سمندر میں ڈبو کر نکالنے سے سمندر کے پانی میں ہوتی ہے“۔ فَسُبْحَانَهُ وَتعَالَى الْغَنِيُّ الْحَمِيدُ۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waqāla mūsā in takfurū antum waman fī al-arḍi jamīʿan fa-inna al-laha laghaniyyun ḥamīdun ","translations":["And said","Musa","If","you disbelieve","you","and whoever","(is) in","the earth","all","then indeed","Allah","certainly (is) Free of need","Praiseworthy","(8)"],"transliterationArr":["waqāla","mūsā","in","takfurū","antum","waman","fī","al-arḍi","jamīʿan","fa-inna","al-laha","laghaniyyun","ḥamīdun",null],"verseTiming":[[1,0,1040],[2,1040,2870],[3,2870,4070],[4,4070,6130],[5,6130,7820],[6,7820,8900],[7,8900,9120],[8,9120,9970],[9,9970,11420],[10,11420,12620],[11,12620,13640],[12,13640,14880],[13,14880,17505]]}}