{"name":"15:18","price":"ہاں مگر جو چوری چھپے سننے کی کوشش کرے اس کے پیچھے دہکتا ہوا (کھلا شعلہ) لگتا ہے.(1)","arabic":"إِلَّا مَنِ ٱسۡتَرَقَ ٱلسَّمۡعَ فَأَتۡبَعَهُۥ شِهَابٞ مُّبِينٞ","category":["15 (Al-Hijr)","Al-Hijr","Surah Al-Hijr","Chapter Al-Hijr","Hijr","Surah Hijr","Chapter Hijr","Al Hijr","Surah Al Hijr","Chapter Al Hijr","Surah 15","Chapter 15","The Rock","الحِجر"],"ayahNumber":1820,"juzNumber":14,"footnotes":"(1) اس کا مطلب یہ ہے کہ شیاطین آسمانوں پر باتیں سننے کے لئے جاتے ہیں، جن پر شہاب ثاقب ٹوٹ کر گرتے ہیں، جن سے کچھ تو جل مر جاتے ہیں اور کچھ بچ جاتے ہیں اور بعض سن آتے ہیں۔ حدیث میں اس کی تفسیر اس طرح آتی ہے۔ نبی (صلى الله عليه وسلم) فرماتے ہیں ”جب اللہ تعالٰی آسمان پر کوئی فیصلہ فرماتا ہے، تو فرشتے اسے سن کر اپنے پر یا بازو پھڑ پھڑاتے ہیں (عجز و مسکنت کے اظہار کے طور پر) گویا وہ کسی چٹان پر زنجیر کی آواز ہے۔ پھر جب فرشتوں کے دلوں سے اللہ کا خوف دور ہو جاتا ہے تو وہ ایک دوسرے سے پوچھتے ہیں، تمہارے رب نے کیا کہا؟ وہ کہتے ہیں، اس نے جو کہا حق کہا اور اور وہ بلند اور بڑا ہے (اس کے بعد اللہ کا وہ فیصلہ اوپر سے نیچے تک یکے بعد دیگرے سنایا جاتا ہے) اس موقع پر شیطان چوری چھپے بات سنتے ہیں۔ اور یہ چوری چھپے بات سننے والے شیطان، تھوڑے تھوڑے فاصلے سے ایک دوسرے کے اوپر ہوتے ہیں اور ایک آدھا حکم سن کر اپنے دوست نجومی یا کاہن کے کان میں پھونک دیتے ہیں، اور اس کے ساتھ سو جھوٹ ملا کر لوگوں کو بیان کرتا ہے (ملخصاً۔ صحیح بخاری تفسیر سورۂ حجر)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"illā mani is'taraqa al-samʿa fa-atbaʿahu shihābun mubīnun ","translations":["Except","(one) who","steals","the hearing","then follows him","a burning flame","clear","(18)"],"transliterationArr":["illā","mani","is'taraqa","al-samʿa","fa-atbaʿahu","shihābun","mubīnun",null],"verseTiming":[[1,0,870],[2,870,1240],[3,1240,2070],[4,2070,2950],[5,2950,4250],[6,4250,5470],[7,5470,8325]]}}