{"name":"16:115","price":"تم پر صرف مردار اور خون اور سور کا گوشت اور جس چیز پر اللہ کے سوا دوسرے کا نام پکارا جائے حرام ہیں(1) ، پھر اگر کوئی شخص بے بس کر دیا جائے نہ وه خواہشمند ہو اور نہ حد سے گزرنے واﻻ ہو تو یقیناً اللہ بخشنے واﻻ رحم کرنے واﻻ ہے.","arabic":"إِنَّمَا حَرَّمَ عَلَيۡكُمُ ٱلۡمَيۡتَةَ وَٱلدَّمَ وَلَحۡمَ ٱلۡخِنزِيرِ وَمَآ أُهِلَّ لِغَيۡرِ ٱللَّهِ بِهِۦۖ فَمَنِ ٱضۡطُرَّ غَيۡرَ بَاغٖ وَلَا عَادٖ فَإِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ","category":["16 (An-Nahl)","An-Nahl","Surah An-Nahl","Chapter An-Nahl","Nahl","Surah Nahl","Chapter Nahl","An Nahl","Surah An Nahl","Chapter An Nahl","Surah 16","Chapter 16","The Bee","النَّحل"],"ayahNumber":2016,"juzNumber":14,"footnotes":"(1) اس کا مطلب یہ ہوا کہ حلال وطیب چیزوں سے تجاوز کر کے حرام اور خبیث چیزوں کا استعمال اور اللہ کو چھوڑ کر کسی اور کی عبادت کرنا، یہ اللہ کی نعمتوں کی ناشکری ہے۔\n(2) یہ آیت اس سے قبل تین مرتبہ پہلے بھی گزر چکی ہے۔ (البقرۃ:173)۔ (المائدہ:3)۔ (الانعام:145) میں۔ یہ چوتھا مقام ہے۔ جہاں اللہ نے اسے پھر بیان فرمایا ہے۔ اس میں لفظ إِنَّمَا حصر کے لئے ہے۔ لیکن یہ حصر حقیقی نہیں بلکہ اضافی ہے۔ یعنی مخاطبین کے عقیدے اور خیال کو سامنے رکھتے ہوئے فرمایا گیا ہے۔ ورنہ دوسرے جانور اور درندے وغیرہ بھی حرام ہیں، البتہ ان آیات سے یہ واضح ہے کہ ان میں جن چار محرکات کا ذکر ہے، اللہ تعالٰی ان سے مسلمانوں کو نہایت تاکید کے ساتھ بچانا چاہتا ہے۔ اس کی ضروری تشریح گزشتہ مقامات پر کی جا چکی ہے، تاہم اس میں وَمَا أُهِلَّ لِغَيْرِ اللَّهِ بِهِ (جس چیز پر اللہ کے سوا دوسرے کا نام پکارا جائے) جو چوتھی قسم ہے۔ اس کے مفہوم میں تاویلات رکیکہ اور توجیہات بعیدہ سے کام لے کر کر شرک کے لئے چور دروازہ تلاش کیا جاتا ہے۔ اس لیے اس کی مزید وضاحت پیش خدمت ہے۔ جو جانور غیر اللہ کے لیے نامزد کر دیا جائے اس کی مختلف صورتیں ہیں۔ ایک صورت یہ ہے کہ غیر اللہ کے تقرب اور اس کی خوشنودی کے لیے اسے ذبح کیا جائے اور ذبح کرتے وقت نام بھی اسی بت یا بزرگ کا لیا جائے بزعم خویش جس کو راضی کرنا مقصود ہے دوسری صورت یہ ہے کہ مقصود تو غیر اللہ کا تقرب ہی ہو۔ لیکن ذبح اللہ کے نام پر ہی کیا جائے جس طرح کہ قبر پرستوں میں یہ سلسلہ عام ہے۔ وہ جانوروں کو بزرگوں کیلیے نامزد تو کرتے ہیں مثلا یہ بکرا فلاں پیر کا ہے یہ گائے فلاں پیر کی ہے، یہ جانور گیارہویں کے لیے یعنی شیخ عبدالقادر جیلانی کے لیے ہے، وغیرہ وغیرہ۔ اور ان کو وہ بسم اللہ پڑھ کر ہی ذبح کرتے ہیں۔ اس لیے وہ کہتے ہیں کہ پہلی صورت تو یقیناً حرام ہے لیکن یہ دوسری صورت حرام نہیں بلکہ جائز ہے کیونکہ یہ غیر اللہ کے نام پر ذبح نہیں کیا گیا ہے اور یوں شرک کا راستہ کھول دیا گیا ہے۔ حالانکہ فقہاء نے اس دوسری صورت کو بھی حرام قرار دیا ہے۔ اس لیے کہ یہ بھی وَمَا أُهِلَّ لِغَيْرِ اللَّهِ بِهِ میں داخل ہے چنانچہ حاشیہ بیضاوی میں ہے ”ہر وہ جانور جس پر غیر اللہ کا نام پکارا جائے حرام ہے اگرچہ ذبح کے وقت اس پر اللہ ہی کا نام لیا جائے، اس لیے کہ علماء کا اتفاق ہے کہ کوئی مسلمان اگر غیر اللہ کا تقرب حاصل کرنے کی غرض سے جانور ذبح کرے گا تو وہ مرتد ہو جائے گا اور اس کا ذبیح مرتد کا ذبیحہ ہوگا“ اور فقہ حنفی کی مشہور کتاب درمختار میں ہے کہ ”کسی حاکم اور کسی طرح کسی بڑے کی آمد پر(حسن خلق یا شرع ضیافت کی نیت سے نہیں بلکہ اس کی رضامندی اور اس کی تعظیم کے طور پر) جانور ذبح کیا جائے تو وہ حرام ہوگا اس لیے کہ وہ وَمَا أُهِلَّ لِغَيْرِ اللَّهِ بِهِ میں داخل ہے اگرچہ اس پر اللہ ہی کا نام لیا گیا ہو اور علامہ شامی نے اس کی تائید کی ہے“۔(کتاب الذبائح طبع قدیم 1277ھ ص277۔ فتاویٰ شامی ج 5 ، ص 203، مطبع میمنیہ، مصر) البتہ بعض فقہاء اس دوسری صورت کو وَمَا أُهِلَّ لِغَيْرِ اللَّهِ بِهِ کا مدلول اور اس میں داخل نہیں سمجھتے اور اشتراک علت (تقرب لغیر اللہ) کی وجہ سے اسے حرام سمجھتے ہیں۔ گویا حرمت میں کوئی اختلاف نہیں صرف استدلال و احتجاج کے طریقے میں اختلاف ہے۔ علاوہ ازیں یہ دوسری صورت ”وَمَا ذُبِحَ عَلَى ٱلنُّصُبِ“ (جو بتوں کے پاس یا تھانوں پر ذبح کیے جائیں) بھی داخل ہے، جسے سورۃ المائدہ میں محرمات میں ذکر کیا گیا ہے اور احادیث سے بھی معلوم ہوتا ہے کہ آستانوں درباروں اور تھانوں پر ذبح کیے گئے جانور بھی حرام ہیں اس لیے کہ وہاں ذبح کرنے کا یا وہاں لے جا کر تقسیم کرنے کا مقصد تَقَرُّبٌ لِغَيْرِ اللهِ ہی ہوتا ہے۔ ایک حدیث میں ہے ایک شخص نے آ کر رسول اللہ (صلى الله عليه وسلم) سے کہا کہ میں نے نذر مانی ہے کہ میں بوانہ جگہ میں اونٹ ذبح کروں گا۔ آپ (صلى الله عليه وسلم) نے پوچھا کہ کیا وہاں زمانہ جاہلیت کے بتوں میں سے کوئی بت تھا جس کی پرستش کی جاتی تھی؟ لوگوں نے بتلایا نہیں پھر آپ (صلى الله عليه وسلم) نے پوچھا کہ وہاں ان کی عیدوں میں سے کوئی عید تو نہیں منائی جاتی تھی؟ لوگوں نے اس کی بھی نفی کی، تو آپ (صلى الله عليه وسلم) نے سائل کو نذر پوری کرنے کا حکم دیا۔( ابو داود، كتاب الإيمان والنذور باب ما يؤمر به من وفاء النذر) اس سے معلوم ہوا کہ بتوں کے ہٹائے جانے کے بعد بھی غیر آباد آستانوں پر جا کر جانور ذبح کرنا جائز نہیں ہے۔ چہ جائیکہ ان آستانوں اور درباروں پر جا کر ذبح کیے جائیں جو پرستش اور نذر ونیاز کے لیے مرجع عوام ہیں۔ أَعَاذَنَا اللهُ مِنْهُ","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"innamā ḥarrama ʿalaykumu al-maytata wal-dama walaḥma al-khinzīri wamā uhilla lighayri al-lahi bihi famani uḍ'ṭurra ghayra bāghin walā ʿādin fa-inna al-laha ghafūrun raḥīmun ","translations":["Only","He has forbidden","to you","the dead animal","and the blood","and the flesh","(of) the swine","and what","has been dedicated","to other (than)","Allah","[with it]","But (if) one","(is) forced ","without (being)","disobedient","and not","a transgressor ","then indeed","Allah","(is) Oft-Forgiving","Most Merciful","(115)"],"transliterationArr":["innamā","ḥarrama","ʿalaykumu","al-maytata","wal-dama","walaḥma","al-khinzīri","wamā","uhilla","lighayri","al-lahi","bihi","famani","uḍ'ṭurra","ghayra","bāghin","walā","ʿādin","fa-inna","al-laha","ghafūrun","raḥīmun",null],"verseTiming":[[1,0,2020],[2,2020,2910],[3,2910,3970],[4,3970,5160],[5,5160,5970],[6,5970,6770],[7,6770,8980],[8,8980,10720],[9,10720,11470],[10,11470,12420],[11,12420,13320],[12,13320,14280],[13,14280,14850],[14,14850,15810],[15,15810,16490],[16,16490,18050],[17,18050,18640],[18,18640,19790],[19,19790,21490],[20,21490,22490],[21,22490,23330],[22,23330,25765]]}}