{"name":"16:15","price":"اور اس نے زمین میں پہاڑ گاڑ دیے ہیں تاکہ تمہیں لے کر ہلے نہ(1) ، اور نہریں اور راہیں بنا دیں تاکہ تم منزل مقصود کو پہنچو.(1)","arabic":"وَأَلۡقَىٰ فِي ٱلۡأَرۡضِ رَوَٰسِيَ أَن تَمِيدَ بِكُمۡ وَأَنۡهَٰرٗا وَسُبُلٗا لَّعَلَّكُمۡ تَهۡتَدُونَ","category":["16 (An-Nahl)","An-Nahl","Surah An-Nahl","Chapter An-Nahl","Nahl","Surah Nahl","Chapter Nahl","An Nahl","Surah An Nahl","Chapter An Nahl","Surah 16","Chapter 16","The Bee","النَّحل"],"ayahNumber":1916,"juzNumber":14,"footnotes":"(1) یہ پہاڑوں کا فائدہ بیان کیا جا رہا ہے اور اللہ کا ایک احسان عظیم بھی ہے، کیونکہ اگر زمین ہلتی رہتی تو اس میں سکونت ممکن ہی نہ رہتی۔ اس کا اندازہ ان زلزلوں سے کیا جا سکتا ہے جو چند سکینڈوں اور لمحوں کے لئے آتے ہیں، لیکن کس طرح بڑی بڑی مضبوط عمارتوں کو پیوند زمین اور شہروں کو کھنڈرات میں تبدیل کر دیتے ہیں۔\n(2) نہروں کا سلسلہ بھی عجیب ہے، کہاں سے وہ شروع ہوتی ہیں اور کہاں کہاں، دائیں بائیں، شمال، جنوب، مشرق و مغرب ہر جہت کو سیراب کرتی ہیں۔ اس طرح راستے بنائے، جن کے ذریعے تم منزل مقصود پر پہنچتے ہو۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-alqā fī al-arḍi rawāsiya an tamīda bikum wa-anhāran wasubulan laʿallakum tahtadūna ","translations":["And He has cast","in","the earth","firm mountains","lest","it should shake","with you","and rivers","and roads","so that you may","be guided","(15)"],"transliterationArr":["wa-alqā","fī","al-arḍi","rawāsiya","an","tamīda","bikum","wa-anhāran","wasubulan","laʿallakum","tahtadūna",null],"verseTiming":[[1,0,1200],[2,1200,1400],[3,1400,2340],[4,2340,3470],[5,3470,4680],[6,4680,5700],[7,5700,6510],[8,6510,8160],[9,8160,9260],[10,9260,10900],[11,10900,13825]]}}