{"name":"16:102","price":"کہہ دیجئے کہ اسے آپ کے رب کی طرف سے جبرائیل حق کے ساتھ لے کر آئے ہیں(1) تاکہ ایمان والوں کو اللہ تعالیٰ استقامت عطا فرمائے(2) اور مسلمانوں کی رہنمائی اور بشارت ہو جائے.(3)","arabic":"قُلۡ نَزَّلَهُۥ رُوحُ ٱلۡقُدُسِ مِن رَّبِّكَ بِٱلۡحَقِّ لِيُثَبِّتَ ٱلَّذِينَ ءَامَنُواْ وَهُدٗى وَبُشۡرَىٰ لِلۡمُسۡلِمِينَ","category":["16 (An-Nahl)","An-Nahl","Surah An-Nahl","Chapter An-Nahl","Nahl","Surah Nahl","Chapter Nahl","An Nahl","Surah An Nahl","Chapter An Nahl","Surah 16","Chapter 16","The Bee","النَّحل"],"ayahNumber":2003,"juzNumber":14,"footnotes":"(1) یعنی یہ قرآن محمد کا اپنا گھڑا ہوا نہیں بلکہ اسے حضرت جبرائیل (عليه السلام) جیسے پاکیزہ ہستی نے سچائی کے ساتھ رب کی طرف سے اتارا ہے۔ جیسے دوسرے مقام پر ہے،« نَزَلَ بِهِ الرُّوحُ الأَمِينُ، عَلَى قَلْبِكَ» (الشعراء :193 ،194) ”اسے الروح الامین (جبرائیل علیہ السلام) نے تیرے دل پر اتارا ہے“۔\n(2) اس لئے کہ وہ کہتے ہیں کہ منسوخ کرنے والا اور منسوخ دونوں رب کی طرف سے ہیں۔ علاوہ ازیں منسوخی کی مصلحتیں بھی جب ان کے سامنے آتی ہیں تو ان کے اندر مزید ثبات قدمی اور ایمان میں رسوخ پیدا ہوتا ہے۔\n(3) اور یہ قرآن مسلمانوں کے لئے ہدایت اور بشارت کا ذریعہ ہے، کیونکہ قرآن بھی بارش کی طرح ہے، جس سے بعض زمینیں خوب شاداب ہوتی ہیں اور بعض میں کانٹے دار جھاڑیوں کے سوا کچھ نہیں اگتا۔ مومن کا دل صاف اور شفاف ہے جو قرآن کی برکت سے اور ایمان کے نور سے منور ہو جاتا ہے اور کافر کا دل زمین شور کی طرح ہے جو کفر و ضلالت کی تاریکیوں سے بھرا ہوا ہے، جہاں قرآن کی ضیا پاشیاں بھی بے اثر رہتی ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qul nazzalahu rūḥu al-qudusi min rabbika bil-ḥaqi liyuthabbita alladhīna āmanū wahudan wabush'rā lil'mus'limīna ","translations":["Say","Has brought it down","the Holy Spirit","the Holy Spirit","from","your Lord","in truth","to make firm","those who","believe","and (as) a guidance","and glad tidings","to the Muslims","(102)"],"transliterationArr":["qul","nazzalahu","rūḥu","al-qudusi","min","rabbika","bil-ḥaqi","liyuthabbita","alladhīna","āmanū","wahudan","wabush'rā","lil'mus'limīna",null],"verseTiming":[[1,0,440],[2,440,1760],[3,1760,2330],[4,2330,3220],[5,3220,3400],[6,3400,4420],[7,4420,5480],[8,5480,6660],[9,6660,7710],[10,7710,8910],[11,8910,10640],[12,10640,11630],[13,11630,12860],[14,12860,14380],[15,14380,15360],[16,15360,18475]]}}