{"name":"16:124","price":"ہفتے کے دن کی عظمت تو صرف ان لوگوں کے ذمے ہی ضروری کی گئی تھی جنہوں نے اس میں اختلاف کیا تھا(1) ، بات یہ ہے کہ آپ کا پروردگار خود ہی ان میں ان کے اختلاف کا فیصلہ قیامت کے دن کرے گا.","arabic":"إِنَّمَا جُعِلَ ٱلسَّبۡتُ عَلَى ٱلَّذِينَ ٱخۡتَلَفُواْ فِيهِۚ وَإِنَّ رَبَّكَ لَيَحۡكُمُ بَيۡنَهُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ فِيمَا كَانُواْ فِيهِ يَخۡتَلِفُونَ","category":["16 (An-Nahl)","An-Nahl","Surah An-Nahl","Chapter An-Nahl","Nahl","Surah Nahl","Chapter Nahl","An Nahl","Surah An Nahl","Chapter An Nahl","Surah 16","Chapter 16","The Bee","النَّحل"],"ayahNumber":2025,"juzNumber":14,"footnotes":"(1) اس اختلاف کی نوعیت کیا ہے؟ اس کی تفصیل میں اختلاف ہے۔ بعض کہتے ہیں حضرت موسیٰ (عليه السلام) نے ان کے لئے جمعہ کا دن مقرر فرمایا تھا، لیکن بنو اسرائیل نے اختلاف کیا اور ہفتے کا دن تعظیم وعبادت کے لئے پسند کیا۔ اللہ تعالٰی نے فرمایا، موسیٰ! انہوں نے جو دن پسند کیا ہے، وہی دن ان کے لئے رہنے دو، بعض کہتے ہیں اللہ تعالٰی نے انہیں حکم دیا تھا تعظیم کے لئے ہفتے میں کوئی ایک دن متعین کر لو۔ جس کے تعین میں ان کے درمیان اختلاف ہوا۔ پس یہود نے اپنے اجتہاد کی بنیاد پر ہفتے کا دن اور نصاریٰ نے اتوار کا دن مقرر کرلیا۔ اور جمعہ کے دن کو اللہ تعالیٰ نے مسلمانون کے لئے مخصوص کردیا۔ اور بعض کہتے ہیں کہ نصاریٰ نے اتوار کا دن یہودیوں کی مخالفت کے جذبے سے اپنے لئے مقرر کیا تھا، اسی طرح عبادت کے لئے انہوں نے اپنے کو یہودیوں سے الگ رکھنے کے لئے صخرۂ بیت المقدس کی شرقی جانب کو بطور قبلہ اختیار کیا۔ جمعہ کا دن اللہ کی طرف سے مسلمانوں کے لئے مقرر کئے جانے کا ذکر حدیث میں موجود ہے۔ (ملاحظہ ہو۔ صحيح بخاري ، كتاب الجمعة ، باب هداية هذه الأمة ليوم الجمعة - ومسلم كتاب وباب مذكور)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"innamā juʿila al-sabtu ʿalā alladhīna ikh'talafū fīhi wa-inna rabbaka layaḥkumu baynahum yawma al-qiyāmati fīmā kānū fīhi yakhtalifūna ","translations":["Only","was appointed","the Sabbath","for","those who","differed","in it","And indeed","your Lord","will surely judge","between them","(on) the Day","(of) the Resurrection","in what","they used (to)","[in it]","differ","(124)"],"transliterationArr":["innamā","juʿila","al-sabtu","ʿalā","alladhīna","ikh'talafū","fīhi","wa-inna","rabbaka","layaḥkumu","baynahum","yawma","al-qiyāmati","fīmā","kānū","fīhi","yakhtalifūna",null],"verseTiming":[[1,0,1890],[2,1890,2450],[3,2450,3400],[4,3400,3800],[5,3800,4820],[6,4820,5960],[7,5960,8430],[8,8430,9830],[9,9830,10730],[10,10730,11810],[11,11810,12820],[12,12820,13360],[13,13360,14770],[14,14770,15550],[15,15550,16460],[16,16460,17220],[17,17220,20145]]}}