{"name":"16:22","price":"تم سب کا معبود صرف اللہ تعالیٰ اکیلا ہے اور آخرت پر ایمان نہ رکھنے والوں کے دل منکر ہیں اور وه خود تکبر سے بھرے ہوئے ہیں.(1)","arabic":"إِلَٰهُكُمۡ إِلَٰهٞ وَٰحِدٞۚ فَٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱلۡأٓخِرَةِ قُلُوبُهُم مُّنكِرَةٞ وَهُم مُّسۡتَكۡبِرُونَ","category":["16 (An-Nahl)","An-Nahl","Surah An-Nahl","Chapter An-Nahl","Nahl","Surah Nahl","Chapter Nahl","An Nahl","Surah An Nahl","Chapter An Nahl","Surah 16","Chapter 16","The Bee","النَّحل"],"ayahNumber":1923,"juzNumber":14,"footnotes":"(1) یعنی ایک الٰہ کا ماننا منکرین اور مشرکین کے لئے بہت مشکل ہے۔ وہ کہتے ہیں «أَجَعَلَ الآلِهَةَ إِلَهًا وَاحِدًا إِنَّ هَذَا لَشَيْءٌ عُجَابٌ» (ص:5) ”اس نے تمام معبودوں کو ایک ہی معبود کر دیا یہ تو بڑی ہی عجیب بات ہے“، دوسرے مقام پر فرمایا «وَإِذَا ذُكِرَ اللَّهُ وَحْدَهُ اشْمَأَزَّتْ قُلُوبُ الَّذِينَ لا يُؤْمِنُونَ بِالآخِرَةِ وَإِذَا ذُكِرَ الَّذِينَ مِنْ دُونِهِ إِذَا هُمْ يَسْتَبْشِرُونَ» ( الزمر:45) ”جب ایک اللہ کا ذکر کیا جاتا ہے تو منکرین آخرت کے دل تنگ ہو جاتے ہیں اور جب اللہ کے سوا دوسرے معبودوں کا ذکر آ جاتا ہے تو خوش ہوتے ہیں“۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"ilāhukum ilāhun wāḥidun fa-alladhīna lā yu'minūna bil-ākhirati qulūbuhum munkiratun wahum mus'takbirūna ","translations":["Your god","(is) God","One","But those who","(do) not","believe","in the Hereafter","their hearts","refuse","and they","(are) arrogant","(22)"],"transliterationArr":["ilāhukum","ilāhun","wāḥidun","fa-alladhīna","lā","yu'minūna","bil-ākhirati","qulūbuhum","munkiratun","wahum","mus'takbirūna",null],"verseTiming":[[1,0,1420],[2,1420,3080],[3,3080,3860],[4,3860,5620],[5,5620,6210],[6,6210,7510],[7,7510,9190],[8,9190,10480],[9,10480,13850],[10,13850,14260],[11,14260,18305]]}}