{"name":"16:32","price":"وه جن کی جانیں فرشتے اس حال میں قبض کرتے ہیں کہ وه پاک صاف ہوں کہتے ہیں کہ تمہارے لیے سلامتی ہی سلامتی ہے(1) ، جاؤ جنت میں اپنے ان اعمال کے بدلے جو تم کرتے تھے.(2)","arabic":"ٱلَّذِينَ تَتَوَفَّىٰهُمُ ٱلۡمَلَٰٓئِكَةُ طَيِّبِينَ يَقُولُونَ سَلَٰمٌ عَلَيۡكُمُ ٱدۡخُلُواْ ٱلۡجَنَّةَ بِمَا كُنتُمۡ تَعۡمَلُونَ","category":["16 (An-Nahl)","An-Nahl","Surah An-Nahl","Chapter An-Nahl","Nahl","Surah Nahl","Chapter Nahl","An Nahl","Surah An Nahl","Chapter An Nahl","Surah 16","Chapter 16","The Bee","النَّحل"],"ayahNumber":1933,"juzNumber":14,"footnotes":"(1) ان آیات میں ظالم مشرکوں کے مقابلے میں اہل ایمان و تقویٰ کا کردار اور ان کا حسن انجام بیان فرمایا ہے۔ جَعَلَنَا اللهُ ِمْنهُمْ آمِينَ يَا رَبَّ العَالَمِينَ\n(2) سورہ اعراف کی آیت 43 کے تحت یہ حدیث گزر چکی ہے کہ کوئی شخص بھی محض اپنے عمل سے جنت میں نہیں جائے گا، جب تک اللہ کی رحمت نہیں ہوگی۔ لیکن یہاں فرمایا جا رہا ہے کہ تم اپنے عملوں کے بدلے جنت میں داخل ہو جاؤ، تو ان میں دراصل کوئی منافات نہیں۔ کیونکہ اللہ کی رحمت کے حصول کے لئے اعمال صالحہ ضروری ہیں، اس کے بغیر آخرت میں اللہ کی رحمت مل ہی نہیں سکتی۔ اس لئے حدیث مذکورہ کا مفہوم بھی اپنی جگہ صحیح ہے اور عمل کی اہمیت بھی اپنی جگہ برقرار ہے۔ اس لیے ایک اور حدیث میں فرمایا گیا ہے: «إِنَّ اللهَ لا يَنْظُرُ إِلَى صُوَرِكُمْ وَأَمْوَالِكُمْ وَلَكِنْ يَنْظُرُ إِلَى قُلُوبِكُمْ وَأَعْمَالِكُمْ» (صحيح مسلم، كتاب البر، باب تحريم ظلم المسلم)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"alladhīna tatawaffāhumu al-malāikatu ṭayyibīna yaqūlūna salāmun ʿalaykumu ud'khulū al-janata bimā kuntum taʿmalūna ","translations":["Those whom","take them in death","the Angels","(when they are) pure","saying","Peace","(be) upon you","Enter","Paradise","for what","you used (to)","do","(32)"],"transliterationArr":["alladhīna","tatawaffāhumu","al-malāikatu","ṭayyibīna","yaqūlūna","salāmun","ʿalaykumu","ud'khulū","al-janata","bimā","kuntum","taʿmalūna",null],"verseTiming":[[1,0,1310],[2,1310,3230],[3,3230,6270],[4,6270,7570],[5,7570,9120],[6,9120,10200],[7,10200,11500],[8,11500,12140],[9,12140,13630],[10,13630,14270],[11,14270,15900],[12,15900,18725]]}}