{"name":"16:41","price":"جن لوگوں نے ﻇلم برداشت کرنے کے بعد اللہ کی راه میں ترک وطن کیا ہے(1) ہم انہیں بہتر سے بہتر ٹھکانا دنیا میں عطا فرمائیں گے(2) اور آخرت کا ﺛواب تو بہت ہی بڑا ہے(3)، کاش کہ لوگ اس سے واقف ہوتے.","arabic":"وَٱلَّذِينَ هَاجَرُواْ فِي ٱللَّهِ مِنۢ بَعۡدِ مَا ظُلِمُواْ لَنُبَوِّئَنَّهُمۡ فِي ٱلدُّنۡيَا حَسَنَةٗۖ وَلَأَجۡرُ ٱلۡأٓخِرَةِ أَكۡبَرُۚ لَوۡ كَانُواْ يَعۡلَمُونَ","category":["16 (An-Nahl)","An-Nahl","Surah An-Nahl","Chapter An-Nahl","Nahl","Surah Nahl","Chapter Nahl","An Nahl","Surah An Nahl","Chapter An Nahl","Surah 16","Chapter 16","The Bee","النَّحل"],"ayahNumber":1942,"juzNumber":14,"footnotes":"(1) ہجرت کا مطلب ہے اللہ کے دین کے لئے اللہ کی رضا کی خاطر اپنا وطن، اپنے رشتہ دار اور دوست احباب چھوڑ کر ایسے علاقے میں چلے جانا جہاں آسانی سے اللہ کے دین پر عمل ہو سکے۔ اس آیت میں ان ہی مہاجرین کی فضیلت بیان فرمائی گئی ہے، یہ آیت عام ہے جو تمام مہاجرین کو شامل ہے اور یہ بھی احتمال ہے کہ یہ ان مہاجرین کے بارے میں نازل ہوئی جو اپنی قوم کی ایذاؤں سے تنگ آ کر حبشہ ہجرت کر گئے تھے۔ ان کی تعداد عورتوں سمیت ایک سو یا اس سے زیادہ تھی، جن میں حضرت عثمان غنی (رضي الله عنه) اور ان کی زوجہ، دختر رسول (صلى الله عليه وسلم) حضرت رقیہ (رضی الله عنها) بھی تھیں۔\n(2) اس سے رزق طیب اور بعض نے مدینہ مراد لیا ہے، جو مسلمانوں کا مرکز بنا، امام ابن کثیر فرماتے ہیں کہ دونوں قولوں میں منافات نہیں ہے۔ اس لئے کہ جن لوگوں نے اپنے کاروبار اور گھر بار چھوڑ کر ہجرت کی تھی، اللہ تعالٰی نے دنیا میں ہی انہیں نعم البدل عطا فرما دیا۔ رزق طیب بھی دیا اور پورے عرب پر انہیں اقتدار و تمکن عطا فرمایا۔\n(3) حضرت عمر (رضي الله عنه) نے جب مہاجرین و انصار کے وظیفے مقرر کئے تو ہر مہاجر کو وظیفہ دیتے ہوئے فرمایا۔ «هَذَا مَا وَعَدَكَ اللهُ فِي الدُّنْيَا» ”یہ وہ ہے جس کا اللہ نے دنیا میں وعدہ کیا ہے“۔ « وَمَا ادَّخَرَ لَكَ فِي الآخِرَةِ أَفْضَلُ» ”اور آخرت میں تیرے لیے جو ذخیرہ ہے وہ اس سے کہییں بہتر ہے“۔ (ابن کثیر)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-alladhīna hājarū fī al-lahi min baʿdi mā ẓulimū lanubawwi-annahum fī al-dun'yā ḥasanatan wala-ajru al-ākhirati akbaru law kānū yaʿlamūna ","translations":["And those who","emigrated","in (the way)","(of) Allah","after","after","[what]","they were wronged","surely We will give them position","in","the world","good","but surely the reward","(of) the Hereafter","(is) greater","if","they","know","(41)"],"transliterationArr":["wa-alladhīna","hājarū","fī","al-lahi","min","baʿdi","mā","ẓulimū","lanubawwi-annahum","fī","al-dun'yā","ḥasanatan","wala-ajru","al-ākhirati","akbaru","law","kānū","yaʿlamūna",null],"verseTiming":[[1,0,1290],[2,1290,2470],[3,2470,2760],[4,2760,3640],[5,3640,4590],[6,4590,5290],[7,5290,5510],[8,5510,6520],[9,6520,8960],[10,8960,9240],[11,9240,10190],[12,10190,11640],[13,11640,12660],[14,12660,14030],[15,14030,14730],[16,14730,15670],[17,15670,16570],[18,16570,19125]]}}