{"name":"16:62","price":"اور وه اپنے لیے جو ناپسند رکھتے ہیں اللہ کے لیے ﺛابت کرتے ہیں(1) اور ان کی زبانیں جھوٹی باتیں بیان کرتی ہیں کہ ان کے لیے خوبی ہے(2)۔ نہیں نہیں، دراصل ان کے لیے آگ ہے اور یہ دوزخیوں کے پیش رو ہیں.(3)","arabic":"وَيَجۡعَلُونَ لِلَّهِ مَا يَكۡرَهُونَۚ وَتَصِفُ أَلۡسِنَتُهُمُ ٱلۡكَذِبَ أَنَّ لَهُمُ ٱلۡحُسۡنَىٰۚ لَا جَرَمَ أَنَّ لَهُمُ ٱلنَّارَ وَأَنَّهُم مُّفۡرَطُونَ","category":["16 (An-Nahl)","An-Nahl","Surah An-Nahl","Chapter An-Nahl","Nahl","Surah Nahl","Chapter Nahl","An Nahl","Surah An Nahl","Chapter An Nahl","Surah 16","Chapter 16","The Bee","النَّحل"],"ayahNumber":1963,"juzNumber":14,"footnotes":"(1) یعنی بیٹیاں، یہ تکرار تاکید کے لئے ہے۔\n(2) یہ ان کی دوسری خرابی کا بیان ہے کہ وہ اللہ کے ساتھ نا انصافی کا معاملہ کرتے ہیں ان کی زبانیں یہ جھوٹ بولتی ہیں کہ ان کا انجام اچھا ہے، ان کے لئے بھلائیاں ہیں اور دنیا کی طرح ان کی آخرت بھی اچھی ہوگی۔\n(3) یعنی یقیناً ان کا انجام ”اچھا“ ہے اور وہ ہے جہنم کی آگ، جس میں وہ دوزخیوں کے پیش رو یعنی پہلے جانے والے ہوں گے۔ فَرَط کے یہی معنی حدیث سے بھی ثابت ہیں۔ نبی (صلى الله عليه وسلم) نے فرمایا «اَ نَا فَرَطُکُمْ عَلَی الْحَوْضِ» (صحيح بخاري، نمبر 6584 ومسلم، نمبر1793) ”میں حوض کوثر پر تمہارا پیش رو ہوں گا“ ایک دوسرے معنی مُفرَطُوْنَ کے یہ کئے گئے ہیں کہ انہیں جہنم میں ڈال کر فراموش کر دیا جائے گا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wayajʿalūna lillahi mā yakrahūna wataṣifu alsinatuhumu al-kadhiba anna lahumu al-ḥus'nā lā jarama anna lahumu al-nāra wa-annahum muf'raṭūna ","translations":["And they assign","to Allah","what","they dislike","and assert","their tongues","the lie","that","for them","(is) the best","No","doubt","that","for them","(is) the Fire","and that they","(will) be abandoned","(62)"],"transliterationArr":["wayajʿalūna","lillahi","mā","yakrahūna","wataṣifu","alsinatuhumu","al-kadhiba","anna","lahumu","al-ḥus'nā","lā","jarama","anna","lahumu","al-nāra","wa-annahum","muf'raṭūna",null],"verseTiming":[[1,0,1480],[2,1480,2540],[3,2540,2940],[4,2940,4250],[5,4250,5070],[6,5070,6530],[7,6530,7440],[8,7440,8320],[9,8320,8970],[10,8970,10180],[11,10180,10980],[12,10980,11560],[13,11560,12690],[14,12690,13330],[15,13330,14840],[16,14840,16280],[17,16280,17725]]}}