{"name":"16:69","price":"اور ہر طرح کے میوے کھا اور اپنے رب کی آسان راہوں میں چلتی پھرتی ره، ان کے پیٹ سے رنگ برنگ کا مشروب نکلتا ہے(1) ، جس کے رنگ مختلف ہیں اور جس میں لوگوں کے لیے شفا(2) ہے غوروفکر کرنے والوں کے لیے اس میں بھی بہت بڑی نشانی ہے.","arabic":"ثُمَّ كُلِي مِن كُلِّ ٱلثَّمَرَٰتِ فَٱسۡلُكِي سُبُلَ رَبِّكِ ذُلُلٗاۚ يَخۡرُجُ مِنۢ بُطُونِهَا شَرَابٞ مُّخۡتَلِفٌ أَلۡوَٰنُهُۥ فِيهِ شِفَآءٞ لِّلنَّاسِۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّقَوۡمٖ يَتَفَكَّرُونَ","category":["16 (An-Nahl)","An-Nahl","Surah An-Nahl","Chapter An-Nahl","Nahl","Surah Nahl","Chapter Nahl","An Nahl","Surah An Nahl","Chapter An Nahl","Surah 16","Chapter 16","The Bee","النَّحل"],"ayahNumber":1970,"juzNumber":14,"footnotes":"(1) شہد کی مکھی پہلے پہاڑوں میں، درختوں میں، انسانی عمارتوں کی بلندیوں پر اپنا مسدس خانہ اور چھتہ اس طرح بناتی ہے کہ درمیان میں کوئی شگاف نہیں رہتا۔ پھر وہ باغوں، جنگلوں، وادیوں اور پہاڑوں میں گھومتی پھرتی ہے اور ہر قسم کے پھلوں کا جوس اپنے پیٹ میں جمع کرتی ہے اور پھر انہیں راہوں سے، جہاں جہاں سے وہ گزرتی ہے، واپس لوٹتی ہے اور اپنے چھتے میں آ کر بیٹھ جاتی ہے، جہاں اس کے منہ یا دبر سے وہ شہد نکلتا ہے جسے قرآن نے ”شَرَابٌ“ سے تعبیر کیا ہے۔ یعنی مشروب روح افزا۔\n(2) کوئی سرخ، کوئی سفید، کوئی نیلا اور کوئی زرد رنگ کا، جس قسم کے پھلوں اور کھیتوں سے وہ خوراک حاصل کرتی ہے، اسی حساب سے اس کا رنگ اور ذائقہ بھی مختلف ہوتا ہے۔\n(3) شِفَاء میں تنکیر تعظیم کے لئے ہے۔ یعنی بہت سے امراض کے لئے شہد میں شفا ہے۔ یہ نہیں کہ مطلقًا ہر بیماری کا علاج ہے۔ علمائے طب نے تشریح کی ہے کہ شہد یقیناً ایک شفا بخش قدرتی مشروب ہے۔ لیکن مخصوص بیماریوں کے لئے نہ کہ ہر بیماری کے لئے۔ حدیث میں آتا ہے کہ نبی (صلى الله عليه وسلم) کو حلوا (میٹھی چیز) اور شہد پسند تھا۔ (صحيح بخاري، كتاب الأشربة، باب شراب الحلواء والعسل)، ایک دوسری روایت میں ہے کہ آپ صلی اللہ علیہ وسلم نے فرمایا ”تین چیزوں میں شفا ہے، فصد کھلوانے (پچھنے لگانے) میں, شہد کے پینے میں, اور آگ سے داغنے میں۔ لیکن میں اپنی امت کو داغ لگوانے سے منع کرتا ہوں“۔ (بخاري، باب الدواء بالعسل ) حدیث میں ایک واقعہ بھی آتا ہے کہ اسہال (دست) کے مرض میں آپ (صلى الله عليه وسلم) نے شہد پلانے کا مشورہ دیا، جس سے دستوں میں اضافہ ہوگیا، آکر بتلایا گیا، تو دوبارہ آپ (صلى الله عليه وسلم) نے شہد پلانے کا مشورہ دیا، جس سے مزید فضلات خارج ہوئے اور گھر والے سمجھے کہ شاید مرض میں اضافہ ہوگیا ہے پھر نبی (صلى الله عليه وسلم) کے پاس آئے آپ (صلى الله عليه وسلم) نے تیسری مرتبہ فرمایا ”اللہ سچا ہے اور تیرے بھائی کا پیٹ جھوٹا ہے“، جا اور اسے شہد پلا چنانچہ تیسری مرتبہ میں اسے شفائے کاملہ حاصل ہو گئی۔ (بخاري، باب دواء المبطون ومسلم، كتاب السلام، باب التداوي بسقي العسل)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"thumma kulī min kulli al-thamarāti fa-us'lukī subula rabbiki dhululan yakhruju min buṭūnihā sharābun mukh'talifun alwānuhu fīhi shifāon lilnnāsi inna fī dhālika laāyatan liqawmin yatafakkarūna ","translations":["Then","eat","from","all","the fruits","and follow","(the) ways","(of) your Lord","made smooth","Comes forth","from","their bellies","a drink","(of) varying","colors","in it","(is) a healing","for the mankind","Indeed","in","that","(is) surely a Sign","for a people","who reflect","(69)"],"transliterationArr":["thumma","kulī","min","kulli","al-thamarāti","fa-us'lukī","subula","rabbiki","dhululan","yakhruju","min","buṭūnihā","sharābun","mukh'talifun","alwānuhu","fīhi","shifāon","lilnnāsi","inna","fī","dhālika","laāyatan","liqawmin","yatafakkarūna",null],"verseTiming":[[1,0,1320],[2,1320,1900],[3,1900,2960],[4,2960,3470],[5,3470,5030],[6,5030,6200],[7,6200,6990],[8,6990,7890],[9,7890,8820],[10,8820,10260],[11,10260,11100],[12,11100,12540],[13,12540,13650],[14,13650,15700],[15,15700,17290],[16,17290,18030],[17,18030,20340],[18,20340,24120],[19,24120,25120],[20,25120,25670],[21,25670,26650],[22,26650,27830],[23,27830,29890],[24,29890,32915]]}}