{"name":"16:60","price":"آخرت پر ایمان نہ رکھنے والوں کی ہی بری مثال ہے(1) ، اللہ کے لیے تو بہت ہی بلند صفت ہے، وه بڑا ہی غالب اور باحکمت ہے.(2)","arabic":"لِلَّذِينَ لَا يُؤۡمِنُونَ بِٱلۡأٓخِرَةِ مَثَلُ ٱلسَّوۡءِۖ وَلِلَّهِ ٱلۡمَثَلُ ٱلۡأَعۡلَىٰۚ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","category":["16 (An-Nahl)","An-Nahl","Surah An-Nahl","Chapter An-Nahl","Nahl","Surah Nahl","Chapter Nahl","An Nahl","Surah An Nahl","Chapter An Nahl","Surah 16","Chapter 16","The Bee","النَّحل"],"ayahNumber":1961,"juzNumber":14,"footnotes":"(1) یعنی کافروں کے برے اعمال بیان کئے گئے ہیں انہیں کے لئے بری مثال یا صفت ہے یعنی جہل اور کفر کی صفت۔ یا یہ مطلب ہے کہ اللہ کی جو بیوی اور اولاد یہ ٹھہراتے ہیں، یہ بری مثال ہے جو یہ منکرین آخرت اللہ کے لئے بیان کرتے ہیں۔\n(2) یعنی اس کی ہر صفت، مخلوق کے مقابلے میں اعلٰی و برتر ہے، مثلاً اس کا علم و سیع ہے، اس کی قدرت لا متناہی ہے، اس کی جود و عطا بے نظیر ہے۔ و علی ہذا القیاس یا یہ مطلب ہے کہ وہ قادر ہے، خالق ہے۔ رازق ہے اور سمیع و بصیر ہے وغیرہ (فتح القدیر) یا بری مثال کا مطلب نقص کوتاہی ہے اور مثل اعلی کا مطلب کمال مطلق ہر لحاظ سے اللہ کے لیے ہے۔ (ابن کثیر)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"lilladhīna lā yu'minūna bil-ākhirati mathalu al-sawi walillahi al-mathalu al-aʿlā wahuwa al-ʿazīzu al-ḥakīmu ","translations":["For those who","(do) not","believe","in the Hereafter","(is) a similitude","(of) the evil","and for Allah","(is) the similitude","the Highest","And He","(is) the All-Mighty","All-Wise","(60)"],"transliterationArr":["lilladhīna","lā","yu'minūna","bil-ākhirati","mathalu","al-sawi","walillahi","al-mathalu","al-aʿlā","wahuwa","al-ʿazīzu","al-ḥakīmu",null],"verseTiming":[[1,0,1380],[2,1380,1750],[3,1750,3080],[4,3080,4490],[5,4490,5020],[6,5020,6090],[7,6090,7390],[8,7390,8210],[9,8210,9360],[10,9360,10390],[11,10390,11530],[12,11530,14005]]}}