{"name":"16:78","price":"اللہ تعالیٰ نے تمہیں تمہاری ماؤں کے پیٹوں سے نکالا ہے کہ اس وقت تم کچھ بھی نہیں جانتے تھے(1) ، اسی نے تمہارے کان اور آنکھیں اور دل بنائے(2) کہ تم شکر گزاری کرو.(3)","arabic":"وَٱللَّهُ أَخۡرَجَكُم مِّنۢ بُطُونِ أُمَّهَٰتِكُمۡ لَا تَعۡلَمُونَ شَيۡـٔٗا وَجَعَلَ لَكُمُ ٱلسَّمۡعَ وَٱلۡأَبۡصَٰرَ وَٱلۡأَفۡـِٔدَةَ لَعَلَّكُمۡ تَشۡكُرُونَ","category":["16 (An-Nahl)","An-Nahl","Surah An-Nahl","Chapter An-Nahl","Nahl","Surah Nahl","Chapter Nahl","An Nahl","Surah An Nahl","Chapter An Nahl","Surah 16","Chapter 16","The Bee","النَّحل"],"ayahNumber":1979,"juzNumber":14,"footnotes":"(1) ”شَیْئًا“ نکرہ ہے، تم کچھ نہیں جانتے تھے، نہ نیکی و بد بختی کو، نہ فائدے اور نقصان کو۔\n(2) تاکہ کانوں کے ذریعے تم آوازیں سنو، آنکھوں کے ذریعے سے چیزوں کو دیکھو اور دل، یعنی عقل (کیونکہ عقل کا مرکز دل ہے) دی، جس سے چیزوں کے درمیان تمیز کر سکو اور نفع نقصان پہچان سکو، جوں جوں انسان بڑا ہوتا ہے، اس کی عقل و حواس میں بھی اضافہ ہوتا جاتا ہے، حتیٰ کہ جب انسان شعور اور بلوغت کی عمر کو پہنچتا ہے تو اس کی یہ صلاحیتیں بھی قوی ہو جاتی ہیں، حتیٰ کہ پھر کمال کو پہنچ جاتی ہیں۔ (3) ﯾﻌﻨﯽ ﯾﮧ ﺻﻼﺣﯿﺘﯿﮟ ﺍﻭﺭ ﻗﻮﺗﯿﮟ اللہ تعالی ﻧﮯ ﺍﺱ ﻟﯿﮯ ﻋﻄﺎ ﻛﯽ ﮨﯿﮟ ﻛﮧ ﺍﻧﺴﺎﻥ ﺍﻥ ﺍﻋﻀﺎ ﻭﺟﻮﺍﺭﺡ ﻛﻮ ﺍﺱ ﻃﺮﺡ ﺍﺳﺘﻌﻤﺎﻝ ﻛﺮﮮ ﺟﺲ ﺳﮯ اللہ تعالی ﺭﺍﺿﯽ ﮨﻮ ﺟﺎﺋﮯ ۔ ﺍﻥ ﺳﮯ اللہﹴ ﻛﯽ ﻋﺒﺎﺩﺕ ﻭﺍﻃﺎﻋﺖ ﻛﺮﮮ ۔ ﯾﮩﯽ اللہ ﻛﯽ ﺍﻥ ﻧﻌﻤﺘﻮﮞ کا ﻋﻤﻠﯽ ﺷﻜﺮ ﮨﮯ ۔ ﺣﺪﯾﺚ ﻣﯿﮟ ﺁﺗﺎ ﮨﮯ کہ (اللہ تعالی فرماتا ہے): ”ﻣﯿﺮﺍ ﺑﻨﺪﮦ ﺟﻦ ﭼﯿﺰﻭﮞ ﻛﮯ ﺫﺭﯾﻌﮯ ﺳﮯ ﻣﯿﺮﺍ ﻗﺮﺏ ﺣﺎﺻﻞ ﻛﺮﺗﺎ ﮨﮯ ﺍﻥ ﻣﯿﮟ ﺳﺐ ﺳﮯ ﻣﺤﺒﻮﺏ ﻭﮦ ﭼﯿﺰﯾﮟ ﮨﯿﮟ ﺟﻮ ﻣﯿﮟ ﻧﮯ ﺍﺱ ﭘﺮ ﻓﺮﺽ ﻛﯽ ﮨﯿﮟ۔ ﻋﻼﻭﮦ ﺍﺯﯾﮟ ﻧﻮﺍﻓﻞ ﻛﮯ ﺫﺭﯾﻌﮯ ﺳﮯ ﺑﮭﯽ ﻭﮦ ﻣﯿﺮﺍ ﺯﯾﺎﺩﮦ ﻗﺮﺏ ﺣﺎﺻﻞ ﻛﺮﻧﮯ ﻛﯽ ﺳﻌﯽ ﻛﺮﺗﺎ ﮨﮯ, حتی ﻛﮧ ﻣﯿﮟ ﺍﺱ ﺳﮯ ﻣﺤﺒﺖ ﻛﺮﻧﮯ ﻟﮓ ﺟﺎﺗﺎ ﮨﻮﮞ۔ ﺍﻭﺭ ﺟﺐ ﻣﯿﮟ ﺍﺱ ﺳﮯ ﻣﺤﺒﺖ ﻛﺮﻧﮯ ﻟﮓ ﺟﺎﺗﺎ ﮨﻮﮞ, ﺗﻮ ﻣﯿﮟ ﺍﺱ کا کان ﮨﻮ ﺟﺎﺗﺎ ﮨﻮﮞ ﺟﺲ ﺳﮯ ﻭﮦ ﺳﻨﺘﺎ ﮨﮯ, آنکھ ﮨﻮ ﺟﺎﺗﺎ ﮨﻮﮞ ﺟﺲ ﺳﮯ ﻭﮦ ﺩﯾﻜﮭﺘﺎ ﮨﮯ, ہاتھ ﮨﻮ ﺟﺎﺗﺎ ﮨﻮﮞ ﺟﺲ ﺳﮯ ﻭﮦ ﭘﻜﮍﺗﺎ ﮨﮯ, پاؤں ﮨﻮ ﺟﺎﺗﺎ ﮨﻮﮞ ﺟﺲ ﺳﮯ ﻭﮦ ﭼﻠﺘﺎ ﮨﮯ, ﺍﻭﺭ ﺍﮔﺮ ﻭﮦ مجھ ﺳﮯ ﺳﻮﺍﻝ ﻛﺮﺗﺎ ﮨﮯ ﺗﻮ ﻣﯿﮟ ﺍﺳﮯ ﺩﯾﺘﺎ ﮨﻮﮞ ﺍﻭﺭ مجھ ﺳﮯ ﻛﺴﯽ ﭼﯿﺰ ﺳﮯ ﭘﻨﺎﮦ ﻃﻠﺐ ﻛﺮﺗﺎ ﮨﮯ ﺗﻮ ﻣﯿﮟ ﺍﺳﮯ ﭘﻨﺎﮦ ﺩﯾﺘﺎ ﮨﻮﮞ“۔ (ﺻﺤﯿﺢ ﺑﺨﺎﺭﯼ, ﻛﺘﺎﺏ ﺍﻟﺮﻗﺎﻕ, ﺑﺎﺏ ﺍﻟﺘﻮﺍﺿﻊ) ﺍﺱ ﺣﺪﯾﺚ کا ﺑﻌﺾ ﻟﻮﮒ ﻏﻠﻂ ﻣﻔﮩﻮﻡ ﻟﮯ ﻛﺮ اولیاء اللہ ﻛﻮ ﺧﺪﺍﺋﯽ ﺍﺧﺘﯿﺎﺭﺍﺕ کا ﺣﺎﻣﻞ ﺑﺎﻭﺭ ﻛﺮﺍﺗﮯ ﮨﯿﮟ۔ ﺣﺎﻻﻧﻜﮧ ﺣﺪﯾث کا ﻭﺍﺿﺢ ﻣﻄﻠﺐ ﯾﮧ ﮨﮯ ﻛﮧ ﺟﺐ ﺑﻨﺪﮦ ﺍﭘﻨﯽ ﺍﻃﺎﻋﺖ ﻭﻋﺒﺎﺩﺕ اللہ ﻛﮯ ﻟﯿﮯ ﺧﺎﻟﺺ ﻛﺮ ﻟﯿﺘﺎ ﮨﮯ ﺗﻮ ﺍﺱ کا ہر کام ﺻﺮﻑ اللہ کی ﺭﺿﺎ ﻛﮯ ﻟﯿﮯ ﮨﻮﺗﺎ ﮨﮯ, ﺍﭘﻨﮯ کانوں ﺳﮯ ﻭﮨﯽ ﺑﺎﺕ ﺳﻨﺘﺎ ﺍﻭﺭ ﺍﭘﻨﯽ ﺁﻧﻜﮭﻮﮞ ﺳﮯ ﻭﮨﯽ ﭼﯿﺰ ﺩﯾﻜﮭﺘﺎ ﮨﮯ ﺟﺲ ﻛﯽ اللہ ﻧﮯ ﺍﺟﺎﺯﺕ ﺩﯼ ﮨﮯ, ﺟﺲ ﭼﯿﺰ ﻛﻮ ہاتھ ﺳﮯ ﭘﻜﮍﺗﺎ ﮨﮯ ﯾﺎ ﭘﯿﺮﻭﮞ ﺳﮯ ﭼﻞ ﻛﺮ ﺍﺱ ﻛﯽ ﻃﺮﻑ ﺟﺎﺗﺎ ﮨﮯ ﺗﻮ ﻭﮦ ﻭﮨﯽ ﭼﯿﺰ ﮨﻮﺗﯽ ﮨﮯ ﺟﺲ ﻛﻮ ﺷﺮﯾﻌﺖ ﻧﮯ ﺭﻭﺍ ﺭﻛﮭﺎ ﮨﮯ۔ ﻭﮦ ﺍﻥ ﻛﻮ اللہ ﻛﯽ ﻧﺎﻓﺮﻣﺎﻧﯽ ﻣﯿﮟ ﺍﺳﺘﻌﻤﺎﻝ ﻧﮩﯿﮟ ﻛﺮﺗﺎ ﺑﻠﻜﮧ ﺻﺮﻑ ﺍﻃﺎﻋﺖ ﻣﯿﮟ ﺍﺳﺘﻌﻤﺎﻝ ﻛﺮﺗﺎ ﮨﮯ۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wal-lahu akhrajakum min buṭūni ummahātikum lā taʿlamūna shayan wajaʿala lakumu al-samʿa wal-abṣāra wal-afidata laʿallakum tashkurūna ","translations":["And Allah","brought you forth","from","the wombs","(of) your mothers","not","knowing","anything","and made","for you","the hearing","and the sight","and the hearts","so that you may","give thanks","(78)"],"transliterationArr":["wal-lahu","akhrajakum","min","buṭūni","ummahātikum","lā","taʿlamūna","shayan","wajaʿala","lakumu","al-samʿa","wal-abṣāra","wal-afidata","laʿallakum","tashkurūna",null],"verseTiming":[[1,0,1250],[2,1250,2710],[3,2710,4190],[4,4190,5200],[5,5200,7660],[6,7660,8080],[7,8080,9520],[8,9520,10450],[9,10450,12000],[10,12000,13110],[11,13110,14080],[12,14080,14730],[13,14730,15750],[14,15750,17410],[15,17410,19030],[16,19030,20440],[17,20440,23485]]}}