{"name":"16:74","price":"پس اللہ تعالیٰ کے لیے مثالیں مت بناؤ(1) اللہ تعالیٰ خوب جانتا ہے اور تم نہیں جانتے.","arabic":"فَلَا تَضۡرِبُواْ لِلَّهِ ٱلۡأَمۡثَالَۚ إِنَّ ٱللَّهَ يَعۡلَمُ وَأَنتُمۡ لَا تَعۡلَمُونَ","category":["16 (An-Nahl)","An-Nahl","Surah An-Nahl","Chapter An-Nahl","Nahl","Surah Nahl","Chapter Nahl","An Nahl","Surah An Nahl","Chapter An Nahl","Surah 16","Chapter 16","The Bee","النَّحل"],"ayahNumber":1975,"juzNumber":14,"footnotes":"(1) یعنی اللہ کو چھوڑ کر عبادت بھی ایسے لوگوں کی کرتے ہیں جن کے پاس کسی چیز کا اختیار نہیں۔\n(2) جس طرح مشرکین مثالیں دیتے ہیں کہ بادشاہ سے ملنا ہو یا اس سے کوئی کام ہو تو کوئی براہ راست بادشاہ سے نہیں مل سکتا ہے۔ پہلے اسے بادشاہ کے مقربین سے رابطہ کرنا پڑتا ہے تب کہیں جا کر بادشاہ تک اس کی رسائی ہوتی ہے اسی طرح اللہ کی ذات بھی بہت اعلی اور اونچی ہے۔ اس تک پہنچنے کے لیے ہم ان معبودوں کو ذریعہ بناتے ہیں یا بزرگوں کا وسیلہ پکڑتے ہیں۔ اللہ تعالٰی نے فرمایا: تم اللہ کو اپنے پر قیاس مت کرو نہ اس قسم کی مثالیں دو۔ اس لیے کہ وہ تو واحد ہے، اس کی کوئی مثال ہی نہیں ہے۔ پھر بادشاہ نہ تو عالم الغیب ہے، نہ حاضر و ناظر نہ سمیع وبصیر۔ کہ وہ بغیر کسی ذریعے کے رعایا کے حالات وضروریات سے آگاہ ہو جائے جب کہ اللہ تعالٰی تو ظاہر وباطن اور حاضر غائب ہرچیز کا علم رکھتا ہے، رات کی تاریکیوں میں ہونے والے کاموں کو بھی دیکھتا ہے اور ہر ایک کی فریاد سننے پر بھی قادر ہے۔ بھلا ایک انسانی بادشاہ اور حاکم کا اللہ تعالٰی کے ساتھ کیا مقابلہ اور موازنہ؟","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"falā taḍribū lillahi al-amthāla inna al-laha yaʿlamu wa-antum lā taʿlamūna ","translations":["So (do) not","put forth","for Allah","the similitude","Indeed","Allah","knows","and you","(do) not","know","(74)"],"transliterationArr":["falā","taḍribū","lillahi","al-amthāla","inna","al-laha","yaʿlamu","wa-antum","lā","taʿlamūna",null],"verseTiming":[[1,0,740],[2,740,1950],[3,1950,3250],[4,3250,6430],[5,6430,7660],[6,7660,8700],[7,8700,9630],[8,9630,11760],[9,11760,12180],[10,12180,14985]]}}