{"name":"16:8","price":"گھوڑوں کو، خچروں کو، گدھوں کو اس نے پیدا کیا کہ تم ان کی سواری لو اور وه باعﺚ زینت بھی ہیں(1) ۔ اور بھی وه ایسی بہت چیزیں پیدا کرتا ہے جن کا تمہیں علم بھی نہیں.(1)","arabic":"وَٱلۡخَيۡلَ وَٱلۡبِغَالَ وَٱلۡحَمِيرَ لِتَرۡكَبُوهَا وَزِينَةٗۚ وَيَخۡلُقُ مَا لَا تَعۡلَمُونَ","category":["16 (An-Nahl)","An-Nahl","Surah An-Nahl","Chapter An-Nahl","Nahl","Surah Nahl","Chapter Nahl","An Nahl","Surah An Nahl","Chapter An Nahl","Surah 16","Chapter 16","The Bee","النَّحل"],"ayahNumber":1909,"juzNumber":14,"footnotes":"(1) یعنی ان کی پیدائش کا اصل مقصد اور فائدہ تو ان پر سواری کرنا ہے تاہم زینت کا بھی باعث ہیں، گھوڑے خچر، اور گدھوں کے الگ ذکر کرنے سے بعض فقہاء نے استدلال کیا ہے کہ گھوڑا بھی اسی طرح حرام ہے جس طرح گدھا اور خچر۔ علاوہ ازیں کھانے والے چوپاؤں کا پہلے ذکر آ چکا ہے۔ اس لئے اس آیت میں جن تین جانوروں کا ذکر ہے، یہ صرف رکوب (سواری) کے لئے ہے۔ لیکن یہ استدلال اس لئے صحیح نہیں کہ صحیح احادیث سے گھوڑے کی حلت ثابت ہے۔ حضرت جابر (رضي الله عنه) روایت کرتے ہیں کہ نبی (صلى الله عليه وسلم) نے گھوڑوں کا گوشت کھانے کی اجازت دی ہے۔ ”أَذِنَ فِي لُحُومِ الْخَيْلِ“ (صحيح بخاري، كتاب الذبائح، باب لحوم الخيل، ومسلم كتاب الصيد، باب في أكل لحوم الخيل) علاوہ ازیں صحابہ کرام (رضي الله عنهم) نے نبی (صلى الله عليه وسلم) کی موجودگی میں خیبر اور مدینہ میں گھوڑا ذبح کرکے اس کا گوشت پکایا اور کھایا۔ آپ (صلى الله عليه وسلم) نے منع نہیں فرمایا (ملاحظہ ہو صحيح مسلم، باب مذكور ومسند أحمد، ج 3 ص 356، أبو داود كتاب الأطعمة، باب في أكل لحوم الخيل) اسی لئے جمہور علماء اور سلف و خلف کی اکثریت گھوڑے کی حلت کی قائل ہے۔ (تفسیر ابن کثیر)۔ یہاں گھوڑے کا ذکر محض سواری کے ضمن میں اس لئے کیا گیا ہے کہ اس کا غلب ترین استعمال اسی مقصد کے لئے ہے، وہ ساری دنیا میں ہمیشہ اتنا گراں اور قیمتی ہوا کرتا ہے کہ خوراک کے طور پر اس کا استعمال بہت ہی نادر ہے۔ بھیڑ بکری کی طرح اس کو خوراک کے لئے ذبح نہیں کیا جاتا۔ لیکن اس کے یہ معنی نہیں کہ اس کو بلا دلیل حرام ٹھہرادیا جائے۔ (2) زمین کے زیریں حصے میں، اسی طرح سمندر میں، اور بے آب وگیاہ صحراؤں اور جنگلوں میں اللہ تعالٰی مخلوق پیدا فرماتا رہتا ہے جن کا علم اللہ کے سوا کسی کو نہیں اور اسی میں انسان کی بنائی ہوئی وہ چیزیں بھی آ جاتی ہیں جو اللہ کے دیئے ہوئے دماغ اور صلاحیتوں کو بروئے کار لاتے ہوئے اسی کی پیدا کردہ چیزوں کو مختلف انداز میں جوڑ کر تیار کرتا ہے، مثلاً بس، کار، ریل گاڑی، جہاز اور ہوائی جہاز اور اس طرح کی بیشمار چیزیں اور جو مستقبل میں متوقع ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wal-khayla wal-bighāla wal-ḥamīra litarkabūhā wazīnatan wayakhluqu mā lā taʿlamūna ","translations":["And horses","and mules","and donkeys","for you to ride them","and (as) adornment","And He creates","what","not","you know","(8)"],"transliterationArr":["wal-khayla","wal-bighāla","wal-ḥamīra","litarkabūhā","wazīnatan","wayakhluqu","mā","lā","taʿlamūna",null],"verseTiming":[[1,0,1360],[2,1360,2740],[3,2740,4180],[4,4180,6060],[5,6060,7640],[6,7640,8800],[7,8800,9360],[8,9360,9750],[9,9750,12675]]}}