{"name":"16:86","price":"اور جب مشرکین اپنے شریکوں کو دیکھ لیں گے تو کہیں گے اے ہمارے پروردگار! یہی ہمارے وه شریک ہیں جنہیں ہم تجھے چھوڑ کر پکارا کرتے تھے، پس وه انہیں جواب دیں گے کہ تم بالکل ہی جھوٹے ہو.(1)","arabic":"وَإِذَا رَءَا ٱلَّذِينَ أَشۡرَكُواْ شُرَكَآءَهُمۡ قَالُواْ رَبَّنَا هَٰٓؤُلَآءِ شُرَكَآؤُنَا ٱلَّذِينَ كُنَّا نَدۡعُواْ مِن دُونِكَۖ فَأَلۡقَوۡاْ إِلَيۡهِمُ ٱلۡقَوۡلَ إِنَّكُمۡ لَكَٰذِبُونَ","category":["16 (An-Nahl)","An-Nahl","Surah An-Nahl","Chapter An-Nahl","Nahl","Surah Nahl","Chapter Nahl","An Nahl","Surah An Nahl","Chapter An Nahl","Surah 16","Chapter 16","The Bee","النَّحل"],"ayahNumber":1987,"juzNumber":14,"footnotes":"(1) معبودان باطلہ کی پوجا کرنے والے اپنے اس دعوے میں جھوٹے تو نہیں ہوں گے۔ لیکن وہ شرکا جن کو یہ اللہ کا شریک گردانتے تھے، کہیں گے یہ جھوٹے ہیں۔ یہ یا تو شرکت کی نفی ہے ہمیں اللہ کا شریک ٹھہرانے میں یہ جھوٹے ہیں، بھلا اللہ کا شریک کوئی ہو سکتا ہے؟ یا اسلئے جھوٹا قرار دیں گے کہ وہ ان کی عبادت سے بالکل بےخبر تھے، جس طرح قرآن کریم نے متعدد جگہ اس بات کو بیان فرمایا ہے۔ فَكَفَى بِاللَّهِ شَهِيدًا بَيْنَنَا وَبَيْنَكُمْ إِنْ كُنَّا عَنْ عِبَادَتِكُمْ لَغَافِلِينَ (سورة يونس:٢٩) ”ہمارے اور تمہارے درمیان اللہ بطور گواہ کافی ہے کہ ہم اس بات سے بےخبر تھے کہ تم ہماری عبادت کرتے تھے“۔ (مزید دیکھیے سورۃ الاحقاف 6-5، سورۃ مریم:82-81، سورۃ العنکبوت:25، سورۃ الکہف:52)۔ وَغَيْرهَا مِنَ الآيَاتِ) ایک یہ مطلب بھی ہو سکتا ہے کہ ہم نے تمہیں اپنی عبادت کرنے کے لیے کبھی نہیں کہا تھا اس لیے تم ہی جھوٹے ہو۔ یہ شرکا اگر حجر وشجر ہوں گے تو اللہ تعالٰی انہیں قوت گویائی عطا فرمائے گا۔ جنات وشیاطین ہوں گے تو کوئی اشکال ہی نہیں ہے اور اگر اللہ کے نیک بندے ہوں گے جس طرح کہ متعدد صلحاء واتقیاء اور اولیاء اللہ کو لوگ مدد کے لیے پکارتے ہیں ان کے نام کی نذر نیاز دیتے ہیں اور ان کی قبروں پر جا کر ان کی اسی طرح تعظیم کرتے ہیں جس طرح کسی معبود کی خوف ورجا کے جذبات کے ساتھ کی جاتی ہے۔ تو اللہ تعالٰی ان کو میدان محشر میں ہی بری فرما دے گا اور ان کی عبادت کرنے والوں کو جہنم میں ڈال دیا جائے گا۔ جیسا کہ حضرت عیسیٰ (عليه السلام) سے اللہ تعالٰی کا سوال اور ان کا جواب سورہ مائدہ کے آخر میں مذکور ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-idhā raā alladhīna ashrakū shurakāahum qālū rabbanā hāulāi shurakāunā alladhīna kunnā nadʿū min dūnika fa-alqaw ilayhimu al-qawla innakum lakādhibūna ","translations":["And when","(will) see","those who","associated partners with Allah","their partners","They will say","Our Lord","these","(are) our partners","those whom","we used to","invoke","besides You","besides You","But they (will) throw back","at them","(their) word","Indeed, you","(are) surely liars","(86)"],"transliterationArr":["wa-idhā","raā","alladhīna","ashrakū","shurakāahum","qālū","rabbanā","hāulāi","shurakāunā","alladhīna","kunnā","nadʿū","min","dūnika","fa-alqaw","ilayhimu","al-qawla","innakum","lakādhibūna",null],"verseTiming":[[1,0,1050],[2,1050,1450],[3,1450,2680],[4,2680,3810],[5,3810,6970],[6,6970,8050],[7,8050,9230],[8,9230,13119],[9,13119,15889],[10,15889,17029],[11,17029,18619],[12,18619,19539],[13,19539,19929],[14,19929,21319],[15,21319,23109],[16,23109,24379],[17,24379,25149],[18,25149,26989],[19,26989,30044]]}}