{"name":"17:110","price":"کہہ دیجئیے کہ اللہ کو اللہ کہہ کر پکارو یا رحمٰن کہہ کر، جس نام سے بھی پکارو تمام اچھے نام اسی کے ہیں(1) ۔ نہ تو تو اپنی نماز بہت بلند آواز سے پڑھ اور نہ بالکل پوشیده بلکہ اس کے درمیان کا راستہ تلاش کرلے.(2)","arabic":"قُلِ ٱدۡعُواْ ٱللَّهَ أَوِ ٱدۡعُواْ ٱلرَّحۡمَٰنَۖ أَيّٗا مَّا تَدۡعُواْ فَلَهُ ٱلۡأَسۡمَآءُ ٱلۡحُسۡنَىٰۚ وَلَا تَجۡهَرۡ بِصَلَاتِكَ وَلَا تُخَافِتۡ بِهَا وَٱبۡتَغِ بَيۡنَ ذَٰلِكَ سَبِيلٗا","category":["17 (Al-Isra)","Al-Isra","Surah Al-Isra","Chapter Al-Isra","Isra","Surah Isra","Chapter Isra","Al Isra","Surah Al Isra","Chapter Al Isra","Surah 17","Chapter 17","The Night Journey","الإسرَاء"],"ayahNumber":2139,"juzNumber":15,"footnotes":"(1) جس طرح کہ پہلے گزر چکا ہے کہ مشرکین مکہ کے لئے اللہ کا صفتی نام ”رحمٰن“ یا ”رحیم“ نامانوس تھا اور بعض آثار میں آتا ہے کہ بعض مشرکین نے نبی (صلى الله عليه وسلم) کی زبان مبارک سے یا رحمٰن و رحیم کے الفاظ سنے تو کہا کہ ہمیں تو یہ کہتا ہے کہ صرف ایک اللہ کو پکارو اور خود دو معبودوں کو پکار رہا ہے۔ جس پر یہ آیت نازل ہوئی (ابن کثیر)\n(2) اس کی شان نزول میں حضرت ابن عباس (رضي الله عنه) بیان فرماتے ہیں کہ مکے میں رسول اللہ (صلى الله عليه وسلم) چھپ کر رہتے تھے، جب اپنے ساتھیوں کو نماز پڑھاتے تو آواز قدرے بلند فرما لیتے، مشرکین قرآن سن کر قرآن کو اور اللہ کو گالی گلوچ کرتے، اللہ تعالٰی نے فرمایا، اپنی آواز کو اتنا اونچا نہ کرو کہ مشرکین سن کر قرآن کو برا بھلا کہیں اور نہ آواز اتنی پست کرو کہ صحابہ (رضي الله عنهم) بھی نہ سن سکیں( البخاري- التوحيد، باب قول الله تعالى أنزله بعلمه والملائكة يشهدون- ومسلم، الصلاة، باب التوسط في القراءة )، خود نبی (صلى الله عليه وسلم) کا واقعہ ہے کہ ایک رات نبی (صلى الله عليه وسلم) کا گزر حضرت ابو بکر صدیق (رضي الله عنه) کی طرف سے ہوا تو وہ پست آواز سے نماز پڑھ رہے ہیں، پھر حضرت عمر (رضي الله عنه) کو بھی دیکھنے کا اتفاق ہوا تو وہ اونچی آواز سے نماز پڑھ رہے تھے۔ آپ (صلى الله عليه وسلم) نے دونوں سے پوچھا تو حضرت ابو بکر صدیق (رضي الله عنه)نے فرمایا میں جس سے مصروف مناجات تھا، وہ میری آواز سن رہا تھا، حضرت عمر (رضي الله عنه) نے جواب دیا کہ میرا مقصد سوتوں کو جگانا اور شیطان کو بھگانا تھا۔ آپ نے صدیق اکبر (رضي الله عنه) سے فرمایا ”اپنی آواز قدرے بلند کرو“ اور حضرت عمر (رضي الله عنه) سے کہا ”اپنی آواز کچھ پست رکھو“ ( مشكاة باب صلاة الليل، بحواله أبو داود ترمذي )۔ حضرت عائشہ (رضی الله عنها) فرماتی ہیں کہ یہ آیت دعا کے بارے میں نازل ہوئی ہے۔ (بخاری و مسلم، بحوالہ فتح القدیر)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"quli id'ʿū al-laha awi id'ʿū al-raḥmāna ayyan mā tadʿū falahu al-asmāu al-ḥus'nā walā tajhar biṣalātika walā tukhāfit bihā wa-ib'taghi bayna dhālika sabīlan ","translations":["Say","Invoke","Allah","or","invoke","the Most Gracious","By whatever (name)","By whatever (name)","you invoke","to Him (belongs)","the Most Beautiful Names","the Most Beautiful Names","And (do) not","be loud","in your prayers","and not","be silent","therein","but seek","between","that","a way","(110)"],"transliterationArr":["quli","id'ʿū","al-laha","awi","id'ʿū","al-raḥmāna","ayyan","mā","tadʿū","falahu","al-asmāu","al-ḥus'nā","walā","tajhar","biṣalātika","walā","tukhāfit","bihā","wa-ib'taghi","bayna","dhālika","sabīlan",null],"verseTiming":[[1,0,420],[2,420,750],[3,750,1690],[4,1690,2120],[5,2120,2540],[6,2540,5620],[7,5620,6290],[8,6290,7300],[9,7300,8150],[10,8150,8810],[11,8810,11400],[12,11400,12560],[13,12560,13460],[14,13460,14380],[15,14380,15680],[16,15680,16310],[17,16310,17390],[18,17390,18020],[19,18020,18910],[20,18910,19520],[21,19520,20380],[22,20380,21925]]}}