{"name":"17:1","price":"پاک ہے(1) وه اللہ تعالیٰ جو اپنے بندے(2) کو رات ہی رات میں مسجد حرام سے مسجد اقصیٰ(3) تک لے گیا جس کے آس پاس ہم نے برکت دے(4) رکھی ہے، اس لئے کہ ہم اسے اپنی قدرت کے بعض نمونے دکھائیں(5)، یقیناً اللہ تعالیٰ ہی خوب سننے دیکھنے واﻻ ہے.","arabic":"سُبۡحَٰنَ ٱلَّذِيٓ أَسۡرَىٰ بِعَبۡدِهِۦ لَيۡلٗا مِّنَ ٱلۡمَسۡجِدِ ٱلۡحَرَامِ إِلَى ٱلۡمَسۡجِدِ ٱلۡأَقۡصَا ٱلَّذِي بَٰرَكۡنَا حَوۡلَهُۥ لِنُرِيَهُۥ مِنۡ ءَايَٰتِنَآۚ إِنَّهُۥ هُوَ ٱلسَّمِيعُ ٱلۡبَصِيرُ","category":["17 (Al-Isra)","Al-Isra","Surah Al-Isra","Chapter Al-Isra","Isra","Surah Isra","Chapter Isra","Al Isra","Surah Al Isra","Chapter Al Isra","Surah 17","Chapter 17","The Night Journey","الإسرَاء"],"ayahNumber":2030,"juzNumber":15,"footnotes":"(1) سُبْحَانَ, سَبَحَ يَسْبَحُ کا مصدر ہے۔ معنی ہیں أُنَزِّهُ اللهَ تَنْزِيهًا یعنی میں اللہ کی ہر نقص سے تنزیہ اور براءت کرتا ہوں۔ عام طور پر اس کا استعمال ایسے موقع پر ہوتا ہے جب کسی عظیم الشان واقعے کا ذکر ہو۔ مطلب یہ ہوتا ہے کہ لوگوں کے نزدیک ظاہری اسباب کے اعتبار سے یہ واقعہ کتنا محال ہو، اللہ کے لئے مشکل نہیں، اس لئے کہ وہ اسباب کا پابند نہیں، وہ لفظ كُنْ سے پلک جھپکنے میں جو چاہے کر سکتا ہے۔ اسباب تو انسانوں کے لئے ہیں۔ اللہ تعالٰی ان پابندیوں اور کوتاہیوں سے پاک ہے۔\n(2) إِسْرَاءٌ کے معنی ہوتے ہیں، رات کو لے جانا۔ آگے لَيْلا اس لیے ذکر کیا گیا تاکہ رات کی قلت واضح ہو جائے۔ یعنی رات ایک حصے یا تھوڑے سے حصے میں۔ یعنی چالیس راتوں کا دور دراز کا سفر، پوری رات میں بھی نہیں بلکہ رات کے ایک قلیل حصے میں طے ہوا۔\n(3) أَقْصَى ٰ دور کو کہتے ہیں بیت المقدس، جو القدس یا ایلیاء (قدیم نام) شہر میں اور فلسطین میں واقع ہے، مکے سے القدس تک مسافت ”40“ دن کی ہے، اس اعتبار سے مسجد حرام کے مقابلے میں بیت المقدس کو مسجد اقصٰی (دور کی مسجد) کہا گیا ہے۔\n(4) یہ علاقہ قدرتی نہروں اور پھلوں کی کثرت اور انبیاء کا مسکن و مدفن ہونے کے لحاظ سے ممتاز ہے، اس لئے اسے بابرکت قرار دیا گیا ہے۔\n(5) یہ اس سیر کا مقصد ہے تاکہ ہم اپنے بندے کو عجائبات اور آیات کبریٰ دکھائیں۔ جن میں سے ایک آیت اور معجزہ یہ سفر بھی ہے کہ اتنا لمبا سفر رات کے ایک قلیل حصے میں ہو گیا نبی کریم (صلى الله عليه وسلم) کو جو معراج ہوئی یعنی آسمانوں پر لے جایا گیا، وہاں مختلف آسمانوں پر انبیاء (عليهم السلام) سے ملاقاتیں ہوئیں اور سدرۃ المنتہٰی پر، جو عرش سے نیچے ساتویں آسمان پر ہے، اللہ تعالٰی نے وحی کے ذریعے سے نماز اور دیگر بعض چیزیں عطا کیں۔ جس کی تفصیلات صحیح احادیث میں بیان ہوئی ہیں اور صحابہ و تابعین سے لے کر آج تک امت کے اکثر علماء فقہاء اس بات کے قائل چلے آرہے ہیں کہ یہ معراج بِجَسَدِهِ الْعُنْصُرِيِّ‌ حالت بیداری میں ہوئی ہے۔ یہ خواب یا روحانی سیر اور مشاہدہ نہیں ہے، بلکہ عینی مشاہدہ ہے جو اللہ نے اپنی قدرت کاملہ سے اپنے پیغمبر کو کرایا ہے۔ اس معراج کے دو حصے ہیں۔ پہلا حصہ اسراء کہلاتا ہے، جس کا ذکر یہاں کیا گیا ہے اور جو مسجد حرام سے مسجد اقصیٰ تک کے سفر کا نام ہے، یہاں پہنچنے کے بعد نبی (صلى الله عليه وسلم) نے تمام انبیاء کی امامت فرمائی۔ بیت المقدس سے پھر آپ کو آسمانوں پر لے جایا گیا، یہ سفر کا دوسرا حصہ ہے جسے معراج کہا جاتا ہے۔ اس کا تذکرہ سورہ نجم میں کیا گیا ہے اور باقی تفصیلات احادیث میں بیان کی گئی ہیں۔ عام طور پر اس پورے سفر کو ”معراج“ سے ہی تعبیر کیا جاتا ہے۔ معراج سیڑھی کو کہتے ہیں یہ نبی (صلى الله عليه وسلم) کی زبان مبارک سے نکلے ہوئے الفاظ عُرِجَ بِي إِلَى السَّمَاءِ (مجھے آسمان پر لے جایا یا چڑھایا گیا) سے ماخوذ ہے۔ کیونکہ اس سفر کا یہ دوسرا حصہ پہلے سے بھی زیادہ اہم اور عظیم الشان ہے، اس لئے معراج کا لفظ ہی زیادہ مشہور ہو گیا۔ اس کی تاریخ میں اختلاف ہے۔ تاہم اس میں اتفاق ہے کہ یہ ہجرت سے قبل کا واقعہ ہے۔ بعض کہتے ہیں ایک سال قبل اور بعض کہتے ہیں کئی سال قبل یہ واقعہ پیش آیا۔ اسی طرح مہینے اور اس کی تاریخ میں اختلاف ہے۔ کوئی ربیع الاول کی 17 یا 27، کوئی رجب کی 27 اور بعض کوئی اور مہینہ اس کی تاریخ بتلاتے ہیں۔ (فتح القدیر)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"sub'ḥāna alladhī asrā biʿabdihi laylan mina al-masjidi al-ḥarāmi ilā al-masjidi al-aqṣā alladhī bāraknā ḥawlahu linuriyahu min āyātinā innahu huwa al-samīʿu al-baṣīru ","translations":["Exalted","(is) the One Who","took","His servant","(by) night","from","Al-Masjid Al-Haraam","Al-Masjid Al-Haraam","to","Al-Masjid Al-Aqsa","Al-Masjid Al-Aqsa","which","We blessed","its surroundings","that We may show him","of","Our Signs","Indeed He","He","(is) the All-Hearer","the All-Seer","(1)"],"transliterationArr":["sub'ḥāna","alladhī","asrā","biʿabdihi","laylan","mina","al-masjidi","al-ḥarāmi","ilā","al-masjidi","al-aqṣā","alladhī","bāraknā","ḥawlahu","linuriyahu","min","āyātinā","innahu","huwa","al-samīʿu","al-baṣīru",null],"verseTiming":[[1,0,1080],[2,1080,3130],[3,3130,3940],[4,3940,5260],[5,5260,5860],[6,5860,6890],[7,6890,7990],[8,7990,9050],[9,9050,9380],[10,9380,10450],[11,10450,11260],[12,11260,12080],[13,12080,13330],[14,13330,14450],[15,14450,15660],[16,15660,16070],[17,16070,17570],[18,17570,20100],[19,20100,20510],[20,20510,21630],[21,21630,24165]]}}