{"name":"17:12","price":"ہم نے رات اور دن کو اپنی قدرت کی نشانیاں بنائی ہیں، رات کی نشانی کو تو ہم نے بےنور کردیا ہے اور دن کی نشانی کو روشن بنایا ہے تاکہ تم اپنے رب کا فضل تلاش کر سکو اور اس لئے بھی کہ برسوں کا شمار اور حساب معلوم کرسکو(1) اور ہر ہر چیز کو ہم نے خوب تفصیل سے بیان فرما دیا ہے.(2)","arabic":"وَجَعَلۡنَا ٱلَّيۡلَ وَٱلنَّهَارَ ءَايَتَيۡنِۖ فَمَحَوۡنَآ ءَايَةَ ٱلَّيۡلِ وَجَعَلۡنَآ ءَايَةَ ٱلنَّهَارِ مُبۡصِرَةٗ لِّتَبۡتَغُواْ فَضۡلٗا مِّن رَّبِّكُمۡ وَلِتَعۡلَمُواْ عَدَدَ ٱلسِّنِينَ وَٱلۡحِسَابَۚ وَكُلَّ شَيۡءٖ فَصَّلۡنَٰهُ تَفۡصِيلٗا","category":["17 (Al-Isra)","Al-Isra","Surah Al-Isra","Chapter Al-Isra","Isra","Surah Isra","Chapter Isra","Al Isra","Surah Al Isra","Chapter Al Isra","Surah 17","Chapter 17","The Night Journey","الإسرَاء"],"ayahNumber":2041,"juzNumber":15,"footnotes":"(1) یعنی رات کو بے نور یعنی تاریک کر دیا تاکہ تم آرام کر سکو اور تمہاری دن بھر کی تھکاوٹ دور ہو جائے اور دن کو روشن بنایا تاکہ کسب معاش کے ذریعے سے تم رب کا فضل تلاش کرو۔ علاوہ ازیں رات اور دن کا دوسرا فائدہ یہ ہے کہ اس طرح ہفتوں، مہینوں اور برسوں کا شمار اور حساب تم کر سکو، اس حساب کے بھی بیشمار فوائد ہیں۔ اگر رات کے بعد دن اور دن کے بعد رات نہ آتی بلکہ ہمیشہ رات ہی رات یا دن ہی دن رہتا تو تمہیں آرام اور سکون کا یا کاروبار کرنے کا موقع نہ ملتا اور اسی طرح مہینوں اور سالوں کا حساب بھی ممکن نہ رہتا۔\n(2) یعنی انسان کے لئے دین اور دنیا کی ضروری باتیں سب کھول کر ہم نے بیان کر دی ہیں تاکہ ان سے انسان فائدہ اٹھائیں، اپنی دنیا سنواریں اور آخرت کی بھی فکر اور اس کے لئے تیاری کریں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wajaʿalnā al-layla wal-nahāra āyatayni famaḥawnā āyata al-layli wajaʿalnā āyata al-nahāri mub'ṣiratan litabtaghū faḍlan min rabbikum walitaʿlamū ʿadada al-sinīna wal-ḥisāba wakulla shayin faṣṣalnāhu tafṣīlan ","translations":["And We have made","the night","and the day","(as) two signs","Then We erased","(the) sign","(of) the night","and We made","(the) sign","(of) the day","visible","that you may seek","bounty","from","your Lord","and that you may know","(the) number","(of) the years","and the account","And every","thing ","We have explained it","(in) detail","(12)"],"transliterationArr":["wajaʿalnā","al-layla","wal-nahāra","āyatayni","famaḥawnā","āyata","al-layli","wajaʿalnā","āyata","al-nahāri","mub'ṣiratan","litabtaghū","faḍlan","min","rabbikum","walitaʿlamū","ʿadada","al-sinīna","wal-ḥisāba","wakulla","shayin","faṣṣalnāhu","tafṣīlan",null],"verseTiming":[[1,0,1090],[2,1090,1990],[3,1990,3640],[4,3640,5970],[5,5970,8460],[6,8460,9240],[7,9240,10080],[8,10080,12860],[9,12860,13720],[10,13720,15200],[11,15200,16370],[12,16370,17860],[13,17860,19900],[14,19900,20550],[15,20550,21660],[16,21660,22990],[17,22990,24440],[18,24440,24980],[19,24980,26140],[20,26140,27220],[21,27220,29200],[22,29200,29940],[23,29940,31020],[24,31020,32900],[25,32900,34645]]}}