{"name":"17:13","price":"ہم نے ہر انسان کی برائی بھلائی کو اس کے گلے لگا دیا ہے(1) اور بروز قیامت ہم اس کے سامنے اس کا نامہٴ اعمال نکالیں گے جسے وه اپنے اوپر کھلا ہوا پالے گا.","arabic":"وَكُلَّ إِنسَٰنٍ أَلۡزَمۡنَٰهُ طَٰٓئِرَهُۥ فِي عُنُقِهِۦۖ وَنُخۡرِجُ لَهُۥ يَوۡمَ ٱلۡقِيَٰمَةِ كِتَٰبٗا يَلۡقَىٰهُ مَنشُورًا","category":["17 (Al-Isra)","Al-Isra","Surah Al-Isra","Chapter Al-Isra","Isra","Surah Isra","Chapter Isra","Al Isra","Surah Al Isra","Chapter Al Isra","Surah 17","Chapter 17","The Night Journey","الإسرَاء"],"ayahNumber":2042,"juzNumber":15,"footnotes":"(1) طَائِرٌ کے معنی پرندے کے ہیں اور عُنُقٌ کے معنی گردن کے۔ امام ابن کثیر نے طائر سے مراد انسان کے عمل کے لئے ہیں۔ فِي عُنُقِهِ کا مطلب ہے اس کے اچھے یا برے عمل، جس پر اس کو اچھی یا بری جزا دی جائے گی، گلے کے ہار کی طرح اس کے ساتھ ہوں گے۔ یعنی اس کا ہر عمل لکھا جا رہا ہے، اللہ کے ہاں اس کا پورا ریکارڈ محفوظ ہو گا۔ قیامت والے دن اس کے مطابق اس کا فیصلہ کیا جائے گا۔ اور امام شوکانی نے طائر سے مراد انسان کی قسمت لی ہے، جو اللہ تعالٰی نے اپنے علم کے مطابق پہلے سے لکھ دی ہے، جسے سعادت مند اور اللہ کا مطیع ہونا تھا وہ اللہ کو معلوم تھا اور جسے نافرمان ہونا تھا، وہ بھی اس کے علم میں تھا، یہی قسمت (سعادت مندی یا بد بختی) ہر انسان کے ساتھ گلے کے ہار کی طرح چمٹی ہوئی ہو گی۔ اسی کے مطابق اس کے عمل ہوں گے اور قیامت والے دن اسی کے مطابق فیصلے ہوں گے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wakulla insānin alzamnāhu ṭāirahu fī ʿunuqihi wanukh'riju lahu yawma al-qiyāmati kitāban yalqāhu manshūran ","translations":["And (for) every","man","We have fastened to him","his fate","in","his neck","and We will bring forth","for him","(on the) Day","(of) the Resurrection","a record","which he will find","wide open","(13)"],"transliterationArr":["wakulla","insānin","alzamnāhu","ṭāirahu","fī","ʿunuqihi","wanukh'riju","lahu","yawma","al-qiyāmati","kitāban","yalqāhu","manshūran",null],"verseTiming":[[1,0,810],[2,810,2960],[3,2960,4450],[4,4450,7549],[5,7549,7979],[6,7979,9269],[7,9269,10259],[8,10259,10869],[9,10869,11519],[10,11519,12829],[11,12829,14009],[12,14009,15559],[13,15559,17934]]}}