{"name":"17:15","price":"جو راه راست حاصل کرلے وه خود اپنے ہی بھلے کے لئے راه یافتہ ہوتا ہے اور جو بھٹک جائے اس کا بوجھ اسی کے اوپر ہے، کوئی بوجھ واﻻ کسی اور کا بوجھ اپنے اوپر نہ ﻻدے گا اور ہماری سنت نہیں کہ رسول بھیجنے سے پہلے ہی عذاب کرنے لگیں.(1)","arabic":"مَّنِ ٱهۡتَدَىٰ فَإِنَّمَا يَهۡتَدِي لِنَفۡسِهِۦۖ وَمَن ضَلَّ فَإِنَّمَا يَضِلُّ عَلَيۡهَاۚ وَلَا تَزِرُ وَازِرَةٞ وِزۡرَ أُخۡرَىٰۗ وَمَا كُنَّا مُعَذِّبِينَ حَتَّىٰ نَبۡعَثَ رَسُولٗا","category":["17 (Al-Isra)","Al-Isra","Surah Al-Isra","Chapter Al-Isra","Isra","Surah Isra","Chapter Isra","Al Isra","Surah Al Isra","Chapter Al Isra","Surah 17","Chapter 17","The Night Journey","الإسرَاء"],"ayahNumber":2044,"juzNumber":15,"footnotes":"(1) البتہ جو ضال (گمراہ) مُضل (گمراہ کرنے والے) بھی ہوں گے، انہیں اپنی گمراہی کے بوجھ کے ساتھ، ان کے گناہوں کا بار بھی (بغیر ان کے گناہوں میں کمی کیے) اٹھانا پڑے گا جو ان کی کوششوں سے گمراہ ہوئے ہوں گے، جیسا کہ قرآن کے دوسرے مقامات اور احادیث میں واضح ہے۔ یہ دراصل ان کے اپنے ہی گناہوں کا بھار ہوگا جو دوسروں کو گمراہ کر کے انہوں نے کمایا ہوگا۔\n(2) بعض مفسرین نے اس سے صرف دنیوی عذاب مراد لیا ہے۔ یعنی آخرت کے عذاب سے مستثنٰی نہیں ہوں گے، لیکن قرآن کریم کے دوسرے مقامات سے واضح ہے کہ اللہ تعالٰی لوگوں سے پوچھے گا کہ تمہارے پاس میرے رسول نہیں آئے تھے؟ جس پر اثبات میں جواب دیں گے، جس سے معلوم ہوتا ہے کہ ارسال رسل اور انزال کتب کے بغیر وہ کسی کو عذاب نہیں دے گا۔ تاہم اس کا فیصلہ کہ کس قوم یا فرد تک اس کا پیغام نہیں پہنچا، قیامت والے دن وہ خود ہی فرمائے گا، وہاں یقینا کسی کے ساتھ ظلم نہیں ہو گا۔ اسی طرح بہرا پاگل فاترالعقل اور زمانہ فترت یعنی دو نبیوں کے درمیانی زمانے میں فوت ہونے والے لوگوں کا مسئلہ ہے ان کی بابت بعض روایات میں آتا ہے کہ قیامت والے دن اللہ تعالٰی ان کی طرف فرشتے بھیجے گا اور وہ انہیں کہیں گے کہ جہنم میں داخل ہو جاؤ اگر وہ اللہ کے اس حکم کو مان کر جہنم میں داخل ہو جائیں گے تو جہنم ان کے لیے گل وگلزار بن جائے گی بصورت دیگر انہیں گھسیٹ کر جہنم میں پھینک دیا جائے گا۔ (مسند أحمد، ج 4، ص 24، وابن حبان، ج 9، ص 226۔ علامہ البانی نے صحيح الجامع الصغير (نمبر 881) میں اسے ذکر کیا ہے) چھوٹے بچوں کی بابت اختلاف ہے مسلمانوں کے بچے تو جنت میں ہی جائیں گے البتہ کفار و مشرکین کے بچوں میں اختلاف ہے کوئی توقف کا کوئی جنت میں جانے کا اور کوئی جہنم میں جانے کا قائل ہے، امام ابن کثیر نے کہا ہے کہ میدان محشر میں ان کا امتحان لیا جائے گا جو اللہ کے حکم کی اطاعت اختیار کرے گا وہ جنت میں اور جو نافرمانی کرے گا جہنم میں جائے گا امام ابن کثیر نے اسی قول کو ترجیح دی ہے اور کہا ہے کہ اس سے متضاد روایات میں تطبیق بھی ہو جاتی ہے۔ تفصیل کے لیے (تفسیر ابن کثیر ملاحظہ کیجئے)۔ مگر صحیح بخاری کی روایت سے معلوم ہوتا ہے کہ مشرکین کے بچے بھی جنت میں جائیں گے۔ دیکھئے صحیح بخاری (3: 251، 12: 348) مع الفتح","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"mani ih'tadā fa-innamā yahtadī linafsihi waman ḍalla fa-innamā yaḍillu ʿalayhā walā taziru wāziratun wiz'ra ukh'rā wamā kunnā muʿadhibīna ḥattā nabʿatha rasūlan ","translations":["Whoever","(is) guided","then only","he is guided","for his soul","And whoever","goes astray","then only","he goes astray","against it","And not","will bear","a bearer of burden","burden","(of) another","And not","We","are to punish","until","We have sent","a Messenger","(15)"],"transliterationArr":["mani","ih'tadā","fa-innamā","yahtadī","linafsihi","waman","ḍalla","fa-innamā","yaḍillu","ʿalayhā","walā","taziru","wāziratun","wiz'ra","ukh'rā","wamā","kunnā","muʿadhibīna","ḥattā","nabʿatha","rasūlan",null],"verseTiming":[[1,0,470],[2,470,1320],[3,1320,3130],[4,3130,4240],[5,4240,5600],[6,5600,7100],[7,7100,7870],[8,7870,9670],[9,9670,10630],[10,10630,11830],[11,11830,12820],[12,12820,13510],[13,13510,15520],[14,15520,16230],[15,16230,17480],[16,17480,18060],[17,18060,19670],[18,19670,21060],[19,21060,22030],[20,22030,22900],[21,22900,24645]]}}