{"name":"17:101","price":"ہم نے موسیٰ کو نو معجزے(1) بالکل صاف صاف عطا فرمائے، تو خود ہی بنی اسرائیل سے پوچھ لے کہ جب وه ان کے پاس پہنچے تو فرعون بوﻻ کہ اے موسیٰ میرے خیال میں تو تجھ پر جادو کردیا گیا ہے.","arabic":"وَلَقَدۡ ءَاتَيۡنَا مُوسَىٰ تِسۡعَ ءَايَٰتِۭ بَيِّنَٰتٖۖ فَسۡـَٔلۡ بَنِيٓ إِسۡرَٰٓءِيلَ إِذۡ جَآءَهُمۡ فَقَالَ لَهُۥ فِرۡعَوۡنُ إِنِّي لَأَظُنُّكَ يَٰمُوسَىٰ مَسۡحُورٗا","category":["17 (Al-Isra)","Al-Isra","Surah Al-Isra","Chapter Al-Isra","Isra","Surah Isra","Chapter Isra","Al Isra","Surah Al Isra","Chapter Al Isra","Surah 17","Chapter 17","The Night Journey","الإسرَاء"],"ayahNumber":2130,"juzNumber":15,"footnotes":"(1) وہ نو معجزے ہیں۔ ہاتھ، لاٹھی، قحط سالی، نقص ثمرات، طوفان، جراد (ٹڈی دل) قُمّل (کھٹمل، جوئیں) ضفادع (مینڈک) اور خون، امام حسن بصری کہتے ہیں، کہ قحط سالی اور نقص ثمرات ایک ہی چیز ہے اور نواں معجزہ لاٹھی کا جادو گروں کی شعبدہ بازی کو نگل جانا ہے۔ حضرت موسیٰ (عليه السلام) کو ان کے علاوہ بھی معجزات دیئے گئے تھے مثلًا لاٹھی کا پتھر پر مارنا، جس سے بارہ چشمے ظاہر ہوگئے تھے، بادلوں کا سایہ کرنا، من و سلوی وغیرہ۔ لیکن یہاں آیات تسعہ سے صرف وہی نو معجزات مراد ہیں، جن کا مشاہدہ فرعون اور اس کی قوم نے کیا۔ اسی لیے حضرت ابن عباس (رضي الله عنه) نے انْفِلاقُ بَحْرٍ (سمندر کا پھٹ کر راستہ بن جانے) کو بھی ان نو معجزات میں شمار کیا ہے اور قحط سالی اور نقص ثمرات کو ایک معجزہ شمار کیا ہے، ترمذی کی ایک روایت میں آیات تسعہ کی تفصیل اس سے مختلف بیان کی گئی ہے لیکن سنداً وہ روایت ضعیف ہے اس لیے آیات تسعہ سے مراد یہی مذکورہ معجزات ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walaqad ātaynā mūsā tis'ʿa āyātin bayyinātin fasal banī is'rāīla idh jāahum faqāla lahu fir'ʿawnu innī la-aẓunnuka yāmūsā masḥūran ","translations":["And certainly","We had given","Musa","nine","Signs","clear","so ask","(the) Children of Israel","(the) Children of Israel","when","he came to them","then said","to him","Firaun","Indeed, I","[I] think you ","O Musa","(you are) bewitched","(101)"],"transliterationArr":["walaqad","ātaynā","mūsā","tis'ʿa","āyātin","bayyinātin","fasal","banī","is'rāīla","idh","jāahum","faqāla","lahu","fir'ʿawnu","innī","la-aẓunnuka","yāmūsā","masḥūran",null],"verseTiming":[[1,0,750],[2,750,2000],[3,2000,2770],[4,2770,3450],[5,3450,5340],[6,5340,8490],[7,8490,9210],[8,9210,10820],[9,10820,13480],[10,13480,13850],[11,13850,16290],[12,16290,17090],[13,17090,17610],[14,17610,20000],[15,20000,20890],[16,20890,21420],[17,21420,22510],[18,22510,23460],[19,23460,25570],[20,25570,26840],[21,26840,28685]]}}