{"name":"17:100","price":"کہہ دیجیئے کہ اگر بالفرض تم میرے رب کی رحمتوں کے خزانوں کے مالک بن جاتے تو تم اس وقت بھی اس کے خرچ ہوجانے(1) کے خوف سے اس کو روکے رکھتے اور انسان ہے ہی تنگ دل.","arabic":"قُل لَّوۡ أَنتُمۡ تَمۡلِكُونَ خَزَآئِنَ رَحۡمَةِ رَبِّيٓ إِذٗا لَّأَمۡسَكۡتُمۡ خَشۡيَةَ ٱلۡإِنفَاقِۚ وَكَانَ ٱلۡإِنسَٰنُ قَتُورٗا","category":["17 (Al-Isra)","Al-Isra","Surah Al-Isra","Chapter Al-Isra","Isra","Surah Isra","Chapter Isra","Al Isra","Surah Al Isra","Chapter Al Isra","Surah 17","Chapter 17","The Night Journey","الإسرَاء"],"ayahNumber":2129,"juzNumber":15,"footnotes":"(1) خَشْيَةَ الإنْفَاقِ کا مطلب ہے۔ خَشْيَةَ أَنْ يُنْفِقُوا فَيَفْتَقِرُوا۔ اس خوف سے کہ خرچ کر کے ختم کر ڈالیں گے، اس کے بعد فقیر ہو جائیں گے۔ حالانکہ یہ خزانہ الٰہی جو ختم ہونے والا نہیں لیکن چونکہ انسان تنگ دل واقع ہوا ہے، اس لئے بخل سے کام لیتا ہے۔ دوسرے مقام پر اللہ تعالٰی نے فرمایا «اَمْ لَهُمْ نَصِيْبٌ مِّنَ الْمُلْكِ فَاِذًا لَّا يُؤْتُوْنَ النَّاسَ نَقِيْرًا» (النساء:53)۔ یعنی ان کو اگر اللہ کی بادشاہی میں سے کچھ حصہ مل جائے تو یہ لوگوں کو کچھ نہ دیں۔ نقیر کھجور کی گٹھلی میں جو گڑھا ہوتا ہے اس کو کہتے ہیں یعنی تل برابر بھی کسی کو نہ دیں یہ تو اللہ کی مہربانی اور اس کا فضل وکرم ہے کہ اس نے اپنے خزانوں کے منہ لوگوں کے لیے کھولے ہوئے ہیں جس طرح حدیث میں ہے اللہ کے ہاتھ بھرے ہوئے ہیں وہ رات دن خرچ کرتا ہے لیکن اس میں کوئی کمی نہیں آتی ذرا دیکھو تو سہی جب سے آسمان و زمین اس نے پیدا کیے ہیں کس قدر خرچ کیا ہوگا لیکن اس کے ہاتھ میں جو کچھ ہے اس میں کمی نہیں۔ ”وہ بھرے کے بھرے ہیں“۔ ( البخاري- كتاب التوحيد، باب وكان عرشه على الماء- مسلم، كتاب الزكاة، باب الحث على النفقة وتبشير المنفق بالخلف )۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qul law antum tamlikūna khazāina raḥmati rabbī idhan la-amsaktum khashyata al-infāqi wakāna al-insānu qatūran ","translations":["Say","If","you","possess","the treasures","(of) the Mercy","(of) my Lord","then","surely you would withhold","(out of) fear","(of) spending","And is","man","stingy","(100)"],"transliterationArr":["qul","law","antum","tamlikūna","khazāina","raḥmati","rabbī","idhan","la-amsaktum","khashyata","al-infāqi","wakāna","al-insānu","qatūran",null],"verseTiming":[[1,0,270],[2,270,830],[3,830,2460],[4,2460,3670],[5,3670,6360],[6,6360,7230],[7,7230,8030],[8,8030,9950],[9,9950,11490],[10,11490,12340],[11,12340,16539],[12,16539,17439],[13,17439,19949],[14,19949,22284]]}}