{"name":"17:29","price":"اپنا ہاتھ اپنی گردن سے بندھا ہوا نہ رکھ اور نہ اسے بالکل ہی کھول دے کہ پھر ملامت کیا ہوا درمانده بیٹھ جائے.(1)","arabic":"وَلَا تَجۡعَلۡ يَدَكَ مَغۡلُولَةً إِلَىٰ عُنُقِكَ وَلَا تَبۡسُطۡهَا كُلَّ ٱلۡبَسۡطِ فَتَقۡعُدَ مَلُومٗا مَّحۡسُورًا","category":["17 (Al-Isra)","Al-Isra","Surah Al-Isra","Chapter Al-Isra","Isra","Surah Isra","Chapter Isra","Al Isra","Surah Al Isra","Chapter Al Isra","Surah 17","Chapter 17","The Night Journey","الإسرَاء"],"ayahNumber":2058,"juzNumber":15,"footnotes":"(1) گزشتہ آیت میں انکار کرنے کا ادب بیان فرمایا اب انفاق کا ادب بیان کیا جا رہا ہے اور وہ یہ ہے کہ انسان بخل کرے کہ اپنی اور اپنے اہل و عیال کی ضروریات پر بھی خرچ نہ کرے اور نہ فضول خرچی ہی کرے کہ اپنی وسعت اور گنجائش دیکھے بغیر ہی بےدریغ خرچ کرتا رہے۔ بخل کا نتیجہ یہ ہوگا کہ انسان، قابل ملامت و ندمت قرار پائے گا اور فضول خرچی کے نتیجے میں محسور (تھکا ہارا اور پچھتانے والا) محسور اس جانور کو کہتے ہیں جو چل چل کر تھک چکا اور چلنے سے عاجز ہو چکا ہو۔ فضول خرچی کرنے والا بھی بالآخر خالی ہاتھ ہو کر بیٹھ جاتا ہے۔ اپنے ہاتھ کو اپنی گردن سے بندھا ہوا نہ رکھ، یہ کنایہ ہے بخل سے اور ”نہ اسے بالکل ہی کھول دے“ یہ کنایہ ہے فضول خرچی سے۔ مَلُومًا مَّحْسُورًا لَفُّ نَشْرٍ مُرَتَّبٌ ہے، یعنی ملوم بخل کا اور محسور فضول خرچی کا نتیجہ ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walā tajʿal yadaka maghlūlatan ilā ʿunuqika walā tabsuṭ'hā kulla al-basṭi fataqʿuda malūman maḥsūran ","translations":["And (do) not","make","your hand","chained","to","your neck","and not","extend it","(to its) utmost","reach","so that you sit","blameworthy","insolvent","(29)"],"transliterationArr":["walā","tajʿal","yadaka","maghlūlatan","ilā","ʿunuqika","walā","tabsuṭ'hā","kulla","al-basṭi","fataqʿuda","malūman","maḥsūran",null],"verseTiming":[[1,0,730],[2,730,1600],[3,1600,2230],[4,2230,3680],[5,3680,4280],[6,4280,5250],[7,5250,5770],[8,5770,7140],[9,7140,7670],[10,7670,8600],[11,8600,9600],[12,9600,10440],[13,10440,12925]]}}