{"name":"17:23","price":"اور تیرا پروردگار صاف صاف حکم دے چکا ہے کہ تم اس کے سوا کسی اور کی عبادت نہ کرنا اور ماں باپ کے ساتھ احسان کرنا۔ اگر تیری موجودگی میں ان میں سے ایک یا یہ دونوں بڑھاپے کو پہنچ جائیں تو ان کے آگے اف تک نہ کہنا، نہ انہیں ڈانٹ ڈپٹ کرنا بلکہ ان کے ساتھ ادب و احترام سے بات چیت کرنا.(1) s","arabic":"۞ وَقَضَىٰ رَبُّكَ أَلَّا تَعۡبُدُوٓاْ إِلَّآ إِيَّاهُ وَبِٱلۡوَٰلِدَيۡنِ إِحۡسَٰنًاۚ إِمَّا يَبۡلُغَنَّ عِندَكَ ٱلۡكِبَرَ أَحَدُهُمَآ أَوۡ كِلَاهُمَا فَلَا تَقُل لَّهُمَآ أُفّٖ وَلَا تَنۡهَرۡهُمَا وَقُل لَّهُمَا قَوۡلٗا كَرِيمٗا","category":["17 (Al-Isra)","Al-Isra","Surah Al-Isra","Chapter Al-Isra","Isra","Surah Isra","Chapter Isra","Al Isra","Surah Al Isra","Chapter Al Isra","Surah 17","Chapter 17","The Night Journey","الإسرَاء"],"ayahNumber":2052,"juzNumber":15,"footnotes":"(1) اس آیت میں اللہ تبارک و تعالٰی نے اپنی عبادت کے بعد دوسرے نمبر پر والدین کے ساتھ حسن سلوک کا حکم دیا ہے، جس سے والدین کی اطاعت، ان کی خدمت اور ان کے ادب و احترام کی اہمیت واضح ہے۔ گویا ربوبیت الٰہی کے تقاضوں کے ساتھ اطاعت والدین کے تقاضوں کی ادائیگی بھی ضروری ہے۔ احادیث میں بھی اس کی اہمیت اور تاکید کو خوب واضح کر دیا گیا ہے، پھر بڑھاپے میں بطور خاص ان کے سامنے ”ہوں“ تک کہنے اور ان کو ڈانٹنے ڈپٹنے سے منع کیا ہے، کیونکہ بڑھاپے میں والدین تو کمزور، بے بس اور لا چار ہوجاتے ہیں، جب کہ اولاد جوان اور وسائل معاش پر قابض و متصرف ہوتی ہے۔ علاوہ ازیں جوانی کے دیوانے جذبات اور بڑھاپے کے سرد و گرم چشیدہ تجربات میں تصادم ہوتا ہے۔ ان حالات میں والدین کے ادب و احترام کے تقاضوں کو ملحوظ رکھنا بہت ہی مشکل مرحلہ ہوتا ہے۔ تاہم اللہ کے ہاں سرخ رو وہی ہوگا جو ان تقاضوں کو ملحوظ رکھے گا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waqaḍā rabbuka allā taʿbudū illā iyyāhu wabil-wālidayni iḥ'sānan immā yablughanna ʿindaka al-kibara aḥaduhumā aw kilāhumā falā taqul lahumā uffin walā tanharhumā waqul lahumā qawlan karīman ","translations":["And has decreed","your Lord","that (do) not","worship","except","Him Alone","and to the parents","(be) good","Whether","reach","with you","the old age","one of them","or","both of them","then (do) not","say","to both of them","a word of disrespect","and (do) not","repel them","but speak","to them","a word","noble","(23)"],"transliterationArr":["waqaḍā","rabbuka","allā","taʿbudū","illā","iyyāhu","wabil-wālidayni","iḥ'sānan","immā","yablughanna","ʿindaka","al-kibara","aḥaduhumā","aw","kilāhumā","falā","taqul","lahumā","uffin","walā","tanharhumā","waqul","lahumā","qawlan","karīman",null],"verseTiming":[[1,0,840],[2,840,1610],[3,1610,2420],[4,2420,4310],[5,4310,6879],[6,6879,7979],[7,7979,9729],[8,9729,11639],[9,11639,12929],[10,12929,14939],[11,14939,16549],[12,16549,17399],[13,17399,20159],[14,20159,20519],[15,20519,21749],[16,21749,22419],[17,22419,23079],[18,23079,25829],[19,25829,26409],[20,26409,27709],[21,27709,28289],[22,28289,30629],[23,30629,31999],[24,31999,32529],[25,32529,34109],[26,34109,34619],[27,34619,35499],[28,35499,37129],[29,37129,39064]]}}