{"name":"17:27","price":"بیجا خرچ کرنے والے شیطانوں کے بھائی ہیں۔ اور شیطان اپنے پروردگار کا بڑا ہی ناشکرا ہے.(1)","arabic":"إِنَّ ٱلۡمُبَذِّرِينَ كَانُوٓاْ إِخۡوَٰنَ ٱلشَّيَٰطِينِۖ وَكَانَ ٱلشَّيۡطَٰنُ لِرَبِّهِۦ كَفُورٗا","category":["17 (Al-Isra)","Al-Isra","Surah Al-Isra","Chapter Al-Isra","Isra","Surah Isra","Chapter Isra","Al Isra","Surah Al Isra","Chapter Al Isra","Surah 17","Chapter 17","The Night Journey","الإسرَاء"],"ayahNumber":2056,"juzNumber":15,"footnotes":"(1) تَبْذِيرٌ کی اصل بذر (بیج) ہے، جس طرح زمین میں بیج ڈالتے ہوئے یہ نہیں دیکھا جاتا کہ یہ صحیح جگہ پر پڑ رہا ہے یا اس سے ادھر اُدھر، بلکہ کسان بیج ڈالے چلا جاتا ہے۔ تَبْذِيرٌ (فضول خرچی) بھی یہی ہے کہ انسان اپنا مال بیج کی طرح اڑاتا پھرے اور خرچ کرنے میں حد شرع سے تجاوز کرے اور بعض کہتے ہیں کہ تبذیر کے معنی ناجائز امور میں خرچ کرنا ہیں چاہے تھوڑا ہی ہو۔ ہمارے خیال میں دونوں ہی صورتیں تبذیر میں آجاتی ہیں۔ اور یہ اتنا برا عمل ہے کی اس کے مرتکب کو شیطان سے مماثلت تامہ ہے اور شیطان کی مماثلت سے بچنا، چاہے وہ کسی ایک ہی خصلت میں ہو، انسان کے لئے واجب ہے، پھر شیطان کو كَفُورٌ (بہت ناشکرا) کہہ کر مزید بچنے کی تاکید کر دی ہے اگر شیطان کی مشابہت اختیار کرو گے تو تم بھی اس کی طرح كَفُورٌ قرار دئیے جاؤ گے۔ (فتح القدیر)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"inna al-mubadhirīna kānū ikh'wāna al-shayāṭīni wakāna al-shayṭānu lirabbihi kafūran ","translations":["Indeed","the spendthrifts","are","brothers","(of) the devils","And is","the Shaitaan","to his Lord","ungrateful","(27)"],"transliterationArr":["inna","al-mubadhirīna","kānū","ikh'wāna","al-shayāṭīni","wakāna","al-shayṭānu","lirabbihi","kafūran",null],"verseTiming":[[1,0,1360],[2,1360,3060],[3,3060,5070],[4,5070,5990],[5,5990,7540],[6,7540,8320],[7,8320,9660],[8,9660,10830],[9,10830,12625]]}}