{"name":"17:34","price":"اور یتیم کے مال کے قریب بھی نہ جاؤ بجز اس طریقہ کے جو بہت ہی بہتر ہو، یہاں تک کہ وه اپنی بلوغت کو پہنچ جائے(1) اور وعدے پورے کرو کیونکہ قول وقرار کی باز پرس ہونے والی ہے.(1)","arabic":"وَلَا تَقۡرَبُواْ مَالَ ٱلۡيَتِيمِ إِلَّا بِٱلَّتِي هِيَ أَحۡسَنُ حَتَّىٰ يَبۡلُغَ أَشُدَّهُۥۚ وَأَوۡفُواْ بِٱلۡعَهۡدِۖ إِنَّ ٱلۡعَهۡدَ كَانَ مَسۡـُٔولٗا","category":["17 (Al-Isra)","Al-Isra","Surah Al-Isra","Chapter Al-Isra","Isra","Surah Isra","Chapter Isra","Al Isra","Surah Al Isra","Chapter Al Isra","Surah 17","Chapter 17","The Night Journey","الإسرَاء"],"ayahNumber":2063,"juzNumber":15,"footnotes":"(1) کسی کی جان کو ناجائز طریقے سے ضائع کرنے کی ممانعت کے بعد، اتلاف مال (مال کے ضائع کرنے) سے روکا جا رہا ہے اور اس میں یتیم کا مال سب سے زیادہ اہم ہے، اس لئے فرمایا کہ یتیم کے بالغ ہونے تک اس کے مال کو ایسے طریقے سے استعمال کرو، جس میں اس کا فائدہ ہو۔ یہ نہ ہو کہ سوچے سمجھے بغیر ایسے کاروبار میں لگا دو کہ وہ ضائع یا خسارے سے دو چار ہو جائے۔ یا عمرِ شعور سے پہلے تم اسے اڑا ڈالو۔\n(2) عہد سے وہ میثاق بھی مراد ہے جو اللہ اور اس کے بندے کے درمیان ہے اور وہ بھی جو انسان آپس میں ایک دوسرے سے کرتے ہیں۔ دونوں قسم کے عہدوں کا پورا کرنا ضروری ہے اور نقص عہد کی صورت میں باز پرس ہوگی۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walā taqrabū māla al-yatīmi illā bi-allatī hiya aḥsanu ḥattā yablugha ashuddahu wa-awfū bil-ʿahdi inna al-ʿahda kāna masūlan ","translations":["And (do) not","come near","(the) wealth","(of) the orphan","except","with what","[it] is","best","until","he reaches","his maturity","And fulfil","the covenant","Indeed","the covenant","will be","questioned","(34)"],"transliterationArr":["walā","taqrabū","māla","al-yatīmi","illā","bi-allatī","hiya","aḥsanu","ḥattā","yablugha","ashuddahu","wa-awfū","bil-ʿahdi","inna","al-ʿahda","kāna","masūlan",null],"verseTiming":[[1,0,610],[2,610,1690],[3,1690,2240],[4,2240,3270],[5,3270,4230],[6,4230,5270],[7,5270,5720],[8,5720,6570],[9,6570,7440],[10,7440,8310],[11,8310,9780],[12,9780,10850],[13,10850,11980],[14,11980,13080],[15,13080,14080],[16,14080,14710],[17,14710,16515]]}}