{"name":"17:52","price":"جس دن وه تمہیں(1) بلائے گا تم اس کی تعریف کرتے ہوئے تعمیل ارشاد کرو گے اور گمان کرو گے کہ تمہارا رہنا بہت ہی تھوڑا ہے.(2)","arabic":"يَوۡمَ يَدۡعُوكُمۡ فَتَسۡتَجِيبُونَ بِحَمۡدِهِۦ وَتَظُنُّونَ إِن لَّبِثۡتُمۡ إِلَّا قَلِيلٗا","category":["17 (Al-Isra)","Al-Isra","Surah Al-Isra","Chapter Al-Isra","Isra","Surah Isra","Chapter Isra","Al Isra","Surah Al Isra","Chapter Al Isra","Surah 17","Chapter 17","The Night Journey","الإسرَاء"],"ayahNumber":2081,"juzNumber":15,"footnotes":"(1) ”بلائے گا“ کا مطلب ہے قبروں سے زندہ کر کے اپنی بارگاہ میں حاضر کرے گا، تم اس کی حمد کرتے ہوئے تعمیل ارشاد کرو گے یا اسے پہچانتے ہوئے اس کے پاس حاضر ہو جاؤ گے۔\n(2) وہاں یہ دنیا کی زندگی بالکل تھوڑی معلوم ہوگی۔ «كَأَنَّهُمْ يَوْمَ يَرَوْنَهَا لَمْ يَلْبَثُوا إِلا عَشِيَّةً أَوْ ضُحَاهَا»۔ (النازعات:46) ۔ ”جب قیامت کو دیکھ لیں گے، تو دنیا کی زندگی انہیں ایسے لگے گی گویا اس میں ایک شام یا ایک صبح رہے ہیں“، اسی مضمون کو دیگر مقامات میں بھی بیان کیا گیا ہے۔ مثلاً سورۂ طہٰ102، 104۔ الروم 55۔ المؤمنون 112، 114۔ بعض کہتے ہیں کہ پہلا نفخہ ہوگا تو سب مردے قبروں میں زندہ ہو جائیں گے۔ پھر دوسرے نفخے پر میدان محشر میں حساب کتاب کے لئے اکٹھے ہونگے۔ دونوں نفخوں کے درمیان چالیس سال کا فاصلہ ہوگا اور اس فاصلے میں انہیں کوئی عذاب نہیں دیا جائے گا، وہ سو جائیں گے۔ دوسرے صور پر اٹھیں گے تو کہیں گے ”افسوس، ہمیں ہماری خواب گاہوں سے کس نے اٹھایاہے؟“ (سورۂ یس:52) (فتح القدیر) پہلی بات زیادہ صحیح ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yawma yadʿūkum fatastajībūna biḥamdihi wataẓunnūna in labith'tum illā qalīlan ","translations":["(On) the Day","He will call you","and you will respond","with His Praise","and you will think","not","you had remained","except","a little (while)","(52)"],"transliterationArr":["yawma","yadʿūkum","fatastajībūna","biḥamdihi","wataẓunnūna","in","labith'tum","illā","qalīlan",null],"verseTiming":[[1,0,690],[2,690,2000],[3,2000,3800],[4,3800,5230],[5,5230,7280],[6,7280,7510],[7,7510,8740],[8,8740,9570],[9,9570,11225]]}}