{"name":"17:57","price":"جنہیں یہ لوگ پکارتے ہیں خود وه اپنے رب کے تقرب کی جستجو میں رہتے ہیں کہ ان میں سے کون زیاده نزدیک ہوجائے وه خود اس کی رحمت کی امید رکھتے اور اس کے عذاب سے خوفزده رہتے ہیں(1) ، (بات بھی یہی ہے) کہ تیرے رب کا عذاب ڈرنے کی چیز ہی ہے.","arabic":"أُوْلَٰٓئِكَ ٱلَّذِينَ يَدۡعُونَ يَبۡتَغُونَ إِلَىٰ رَبِّهِمُ ٱلۡوَسِيلَةَ أَيُّهُمۡ أَقۡرَبُ وَيَرۡجُونَ رَحۡمَتَهُۥ وَيَخَافُونَ عَذَابَهُۥٓۚ إِنَّ عَذَابَ رَبِّكَ كَانَ مَحۡذُورٗا","category":["17 (Al-Isra)","Al-Isra","Surah Al-Isra","Chapter Al-Isra","Isra","Surah Isra","Chapter Isra","Al Isra","Surah Al Isra","Chapter Al Isra","Surah 17","Chapter 17","The Night Journey","الإسرَاء"],"ayahNumber":2086,"juzNumber":15,"footnotes":"(1) مذکورہ آیت میں ”مِنْ دُونِ اللهِ“ سے مراد فرشتوں اور بزرگوں کی وہ تصویریں اور مجسمے ہیں جن کی عبادت کرتے تھے، یا حضرت عزیر و مسیح علہما السلام ہیں جنہیں یہودی اور عیسائی ابن اللہ کہتے ہیں اور انہیں الوہی صفات کا حامل مانتے تھے، یا وہ جنات ہیں جو مسلمان ہوگئے تھے اور مشرکین ان کی عبادت کرتے تھے۔ اس لئے کہ اس آیت میں بتلایا جا رہا ہے کہ یہ تو خود اپنے رب کا قرب تلاش کرنے کی جستجو میں رہتے اور اس کی رحمت کی امید رکھتے اور اس کے عذاب سے ڈرتے ہیں اور یہ صفت جمادات (پتھروں) میں نہیں ہو سکتی۔ اس آیت سے واضح ہو جاتا ہے کہ مِنْ دُونِ اللهِ (اللہ کے سوا جن کی عبات کی جاتی رہی ہے) وہ صرف پتھر کی مورتیاں ہی نہیں تھیں، بلکہ اللہ کے وہ بندے بھی تھے جن میں سے کچھ فرشتے، کچھ صالحین، کچھ انبیاء اور کچھ جنات تھے۔ اللہ تعالٰی نے سب کی بابت فرمایا کہ وہ کچھ نہیں کر سکتے، نہ کسی کی تکلیف دور کر سکتے ہیں نہ کسی کی حالت بدل سکتے ہیں ”اپنے رب کے تقرب کی جستجو میں رہتے ہیں“ کا مطلب اعمال صالحہ کے ذریعے سے اللہ کا قرب ڈھونڈتے ہیں۔ یہی الوسیلۃ ہے جسے قرآن نے بیان کیا ہے۔ وہ نہیں ہے جسے قبر پرست بیان کرتے ہیں کہ فوت شدہ اشخاص کے نام کی نذر نیاز دو، ان کی قبروں پر غلاف چڑھاؤ اور میلے ٹھیلے جماؤ اور ان سے استمداد و استغاثہ کرو ۔کیونکہ یہ وسیلہ نہیں یہ تو ان کی عبادت ہے جو شرک ہے۔ اللہ تعالٰی ہر مسلمان کو اس سے محفوظ رکھے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"ulāika alladhīna yadʿūna yabtaghūna ilā rabbihimu al-wasīlata ayyuhum aqrabu wayarjūna raḥmatahu wayakhāfūna ʿadhābahu inna ʿadhāba rabbika kāna maḥdhūran ","translations":["Those","whom","they call","seek","to","their Lord","the means of access","which of them","(is) nearest","and they hope","(for) His mercy","and fear","His punishment","Indeed","(the) punishment","(of) your Lord","is","(ever) feared","(57)"],"transliterationArr":["ulāika","alladhīna","yadʿūna","yabtaghūna","ilā","rabbihimu","al-wasīlata","ayyuhum","aqrabu","wayarjūna","raḥmatahu","wayakhāfūna","ʿadhābahu","inna","ʿadhāba","rabbika","kāna","maḥdhūran",null],"verseTiming":[[1,0,2840],[2,2840,3860],[3,3860,4940],[4,4940,6220],[5,6220,6920],[6,6920,7950],[7,7950,9380],[8,9380,10450],[9,10450,11300],[10,11300,14950],[11,14950,16120],[12,16120,17590],[13,17590,18980],[14,18980,20610],[15,20610,21870],[16,21870,22810],[17,22810,23640],[18,23640,24340],[19,24340,26075]]}}