{"name":"17:53","price":"اور میرے بندوں سے کہہ دیجیئے کہ وه بہت ہی اچھی بات منھ سے نکالا کریں(1) کیونکہ شیطان آپس میں فساد ڈلواتا ہے(2)۔ بےشک شیطان انسان کا کھلا دشمن ہے.","arabic":"وَقُل لِّعِبَادِي يَقُولُواْ ٱلَّتِي هِيَ أَحۡسَنُۚ إِنَّ ٱلشَّيۡطَٰنَ يَنزَغُ بَيۡنَهُمۡۚ إِنَّ ٱلشَّيۡطَٰنَ كَانَ لِلۡإِنسَٰنِ عَدُوّٗا مُّبِينٗا","category":["17 (Al-Isra)","Al-Isra","Surah Al-Isra","Chapter Al-Isra","Isra","Surah Isra","Chapter Isra","Al Isra","Surah Al Isra","Chapter Al Isra","Surah 17","Chapter 17","The Night Journey","الإسرَاء"],"ayahNumber":2082,"juzNumber":15,"footnotes":"(1) یعنی آپس میں گفتگو کرتے وقت زبان کو احتیاط سے استعمال کریں، اچھے کلمات بولیں، اسی طرح کفار و مشرکین اور اہل کتاب سے اگر مخاطبت کی ضرورت پیش آئے تو ان سے مشفقانہ اور نرم لہجے میں گفتگو کریں۔\n(2) زبان کی ذرا سی بے اعتدالی سے شیطان، جو تمہارا کھلا دشمن ہے، تمہارے درمیان آپس میں فساد ڈلوا سکتا ہے، یا کفار یا مشرکین کے دلوں میں تمہارے لئے زیادہ بغض و عناد پیدا کر سکتا ہے۔ حدیث میں ہے نبی (صلى الله عليه وسلم) نے فرمایا ”تم میں سے کوئی شخص اپنے بھائی کی طرف ہتھیار کے ساتھ اشارہ نہ کرے اس لیے کہ وہ نہیں جانتا کہ شیطان شاید اس کے ہاتھ سے وہ ہتھیار چلوا دے اور وہ اس مسلمان بھائی کو جا لگے جس سے اس کی موت واقع ہو جائے پس وہ جہنم کے گڑھے میں جا گرے“۔ ( صحيح بخاري كتاب الفتن، باب من حمل علينا السلاح فليس منا- صحيح مسلم، كتاب البر، باب النهي عن الإشارة بالسلاح )","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waqul liʿibādī yaqūlū allatī hiya aḥsanu inna al-shayṭāna yanzaghu baynahum inna al-shayṭāna kāna lil'insāni ʿaduwwan mubīnan ","translations":["And say","to My slaves","(to) say","that","which","(is) best","Indeed","the Shaitaan","sows discord","between them","Indeed","the Shaitaan","is","to the man","an enemy","clear","(53)"],"transliterationArr":["waqul","liʿibādī","yaqūlū","allatī","hiya","aḥsanu","inna","al-shayṭāna","yanzaghu","baynahum","inna","al-shayṭāna","kāna","lil'insāni","ʿaduwwan","mubīnan",null],"verseTiming":[[1,0,560],[2,560,1760],[3,1760,2830],[4,2830,3740],[5,3740,4150],[6,4150,5490],[7,5490,6490],[8,6490,7820],[9,7820,9380],[10,9380,10800],[11,10800,12040],[12,12040,13390],[13,13390,14030],[14,14030,16110],[15,16110,17100],[16,17100,19435]]}}