{"name":"17:60","price":"اور یاد کرو جب کہ ہم نے آپ سے فرما دیا کہ آپ کے رب نے لوگوں کو گھیر لیا(1) ہے۔ جو رویا (عینی رؤیت) ہم نے آپ کو دکھائی تھی وه لوگوں کے لئے صاف آزمائش ہی تھی اور اسی طرح وه درخت بھی جس سے قرآن میں اﻇہار نفرت کیا گیا ہے(2)۔ ہم انہیں ڈرا رہے ہیں لیکن یہ انہیں اور بڑی سرکشی میں بڑھا رہا ہے.(3)","arabic":"وَإِذۡ قُلۡنَا لَكَ إِنَّ رَبَّكَ أَحَاطَ بِٱلنَّاسِۚ وَمَا جَعَلۡنَا ٱلرُّءۡيَا ٱلَّتِيٓ أَرَيۡنَٰكَ إِلَّا فِتۡنَةٗ لِّلنَّاسِ وَٱلشَّجَرَةَ ٱلۡمَلۡعُونَةَ فِي ٱلۡقُرۡءَانِۚ وَنُخَوِّفُهُمۡ فَمَا يَزِيدُهُمۡ إِلَّا طُغۡيَٰنٗا كَبِيرٗا","category":["17 (Al-Isra)","Al-Isra","Surah Al-Isra","Chapter Al-Isra","Isra","Surah Isra","Chapter Isra","Al Isra","Surah Al Isra","Chapter Al Isra","Surah 17","Chapter 17","The Night Journey","الإسرَاء"],"ayahNumber":2089,"juzNumber":15,"footnotes":"(1) یعنی لوگ اللہ کے غلبہ و تصرف میں ہیں اور جو اللہ چاہے گا وہی ہوگا نہ کہ جو وہ چاہیں گے، یا مراد اہل مکہ ہیں کہ وہ اللہ کے زیر اقتدار ہیں، آپ بےخوفی سے تبلیغ رسالت کیجئے، وہ آپ کا کچھ نہیں بگاڑ سکیں گے، ہم ان سے آپ کی حفاظت فرمائیں گے۔ یا جنگ بدر اور فتح مکہ کے موقع پر جس طرح اللہ نے کفار مکہ کو عبرت ناک شکست سے دو چار کیا، اس کو واضح کیا جارہا ہے۔\n(2) صحابہ و تابعین(رضي الله عنهم) نے اس رویا کی تفسیر عینی رؤیت سے کی ہے اور مراد اس سے معراج کا واقعہ ہے، جو بہت سے کمزور لوگوں کے لئے فتنے کا باعث بن گیا اور وہ مرتد ہوگئے۔ اور درخت سے مراد زَقُّومٌ (تھوہر) کا درخت ہے، جس کا مشاہدہ نبی (صلى الله عليه وسلم) نے شب معراج، جہنم میں کیا۔ الْمَلْعُونَةَ سے مراد، کھانے والوں پر یعنی جہنمیوں پر لعنت۔ جیسے دوسرے مقام پر ہے کہ «إِنَّ شَجَرَتَ الزَّقُّومِ، طَعَامُ الأَثِيمِ» ( الدخان:44,43)۔ ”زقوم کا درخت، گناہ گاروں کا کھانا ہے“۔\n(3) یعنی کافروں کے دلوں میں جو خبث و عناد ہے، اس کی وجہ سے، نشانیاں دیکھ کر ایمان لانے کی بجائے، ان کی سرکشی و طغیانی میں اور اضافہ ہو جاتا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-idh qul'nā laka inna rabbaka aḥāṭa bil-nāsi wamā jaʿalnā al-ru'yā allatī araynāka illā fit'natan lilnnāsi wal-shajarata al-malʿūnata fī al-qur'āni wanukhawwifuhum famā yazīduhum illā ṭugh'yānan kabīran ","translations":["And when","We said","to you","Indeed","your Lord","has encompassed","the mankind","And not","We made","the vision","which","We showed you","except","(as) a trial","for mankind","and the tree","the accursed","in","the Quran","And We threaten them","but not","it increases them","except","(in) transgression","great","(60)"],"transliterationArr":["wa-idh","qul'nā","laka","inna","rabbaka","aḥāṭa","bil-nāsi","wamā","jaʿalnā","al-ru'yā","allatī","araynāka","illā","fit'natan","lilnnāsi","wal-shajarata","al-malʿūnata","fī","al-qur'āni","wanukhawwifuhum","famā","yazīduhum","illā","ṭugh'yānan","kabīran",null],"verseTiming":[[1,0,590],[2,590,1530],[3,1530,1900],[4,1900,2890],[5,2890,3720],[6,3720,4690],[7,4690,7760],[8,7760,8340],[9,8340,9240],[10,9240,10040],[11,10040,12100],[12,12100,13410],[13,13410,14190],[14,14190,15140],[15,15140,16940],[16,16940,18210],[17,18210,19720],[18,19720,19940],[19,19940,23160],[20,23160,24930],[21,24930,25580],[22,25580,27090],[23,27090,27900],[24,27900,29340],[25,29340,32125]]}}