{"name":"17:64","price":"ان میں سے تو جسے بھی اپنی آواز سے بہکا سکے بہکا(1) لے اور ان پر اپنے سوار اور پیادے چڑھا ﻻ(2) اور ان کے مال اور اوﻻد میں سے اپنا بھی ساجھا لگا(3) اور انہیں (جھوٹے) وعدے دے لے(4)۔ ان سے جتنے بھی وعدے شیطان کے ہوتے ہیں سب کے سب سراسر فریب ہیں.(5)","arabic":"وَٱسۡتَفۡزِزۡ مَنِ ٱسۡتَطَعۡتَ مِنۡهُم بِصَوۡتِكَ وَأَجۡلِبۡ عَلَيۡهِم بِخَيۡلِكَ وَرَجِلِكَ وَشَارِكۡهُمۡ فِي ٱلۡأَمۡوَٰلِ وَٱلۡأَوۡلَٰدِ وَعِدۡهُمۡۚ وَمَا يَعِدُهُمُ ٱلشَّيۡطَٰنُ إِلَّا غُرُورًا","category":["17 (Al-Isra)","Al-Isra","Surah Al-Isra","Chapter Al-Isra","Isra","Surah Isra","Chapter Isra","Al Isra","Surah Al Isra","Chapter Al Isra","Surah 17","Chapter 17","The Night Journey","الإسرَاء"],"ayahNumber":2093,"juzNumber":15,"footnotes":"(1) آواز سے مراد پر فریب دعوت یا گانے، موسیقی اور لہو و لعب کے دیگر آلات ہیں، جن کے ذریعے سے شیطان بکثرت لوگوں کو گمراہ کر رہا ہے۔\n(2) ان لشکروں سے مراد، انسانوں اور جنوں کے وہ سوار اور پیادے لشکر ہیں جو شیطان کے چیلے اور اس کے پیروکار ہیں اور شیطان ہی کی طرح انسانوں کو گمراہ کرتے ہیں، یا مراد ہے ہر ممکن ذرائع جو شیطان گمراہ کرنے کے لئے استعمال کرتا ہے۔\n(3) مال میں شیطان کی مشارکت کا مطلب حرام ذریعے سے مال کمانا اور حرام طریقے سے خرچ کرنا ہے اور اسی طرح مویشیوں کو بتوں کے ناموں پر وقف کر دینا مثلًا بحیرہ، سائبہ وغیرہ اور اولاد میں شرکت کا مطلب، زنا کاری، عبدالات، عبدالعزیٰ وغیرہ نام رکھنا، غیر اسلامی طریقے سے ان کی تربیت کرنا کہ برے اخلاق و کردار کے حامل ہوں، ان کو تنگ دستی کے خوف سے ہلاک یا زندہ درگور کر دینا، اولاد کو مجوسی، یہودی و نصرانی وغیرہ بنانا اور بغیر مسنون دعا پڑھے بیوی سے ہم بستری کرنا وغیرہ وغیرہ ہے۔ ان تمام صورتوں میں شیطان کی شرکت ہو جاتی ہے۔\n(4) کہ کوئی جنت و دوزخ نہیں ہے، یا مرنے کے بعد دوبارہ زندگی نہیں ہے وغیرہ۔\n(5) غُرُورٌ (فریب) کا مطلب ہوتا ہے غلط کام کو اس طرح مزین کرکے دکھانا کہ وہ اچھا اور درست لگے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-is'tafziz mani is'taṭaʿta min'hum biṣawtika wa-ajlib ʿalayhim bikhaylika warajilika washārik'hum fī al-amwāli wal-awlādi waʿid'hum wamā yaʿiduhumu al-shayṭānu illā ghurūran ","translations":["And incite","whoever","you can","among them","with your voice","and assault","[on] them","with your cavalry","and infantry","and be a partner","in","the wealth","and the children","and promise them","And not","promises them","the Shaitaan","except","delusion","(64)"],"transliterationArr":["wa-is'tafziz","mani","is'taṭaʿta","min'hum","biṣawtika","wa-ajlib","ʿalayhim","bikhaylika","warajilika","washārik'hum","fī","al-amwāli","wal-awlādi","waʿid'hum","wamā","yaʿiduhumu","al-shayṭānu","illā","ghurūran",null],"verseTiming":[[1,0,1340],[2,1340,1660],[3,1660,2840],[4,2840,4420],[5,4420,5530],[6,5530,6510],[7,6510,7810],[8,7810,9120],[9,9120,10120],[10,10120,12000],[11,12000,13390],[12,13390,13640],[13,13640,14850],[14,14850,16350],[15,16350,17670],[16,17670,18320],[17,18320,19410],[18,19410,20800],[19,20800,21600],[20,21600,23325]]}}