{"name":"17:79","price":"رات کے کچھ حصے میں تہجد کی نماز میں قرآن کی تلاوت کریں(1) یہ زیادتی آپ کے لئے ہے(2) عنقریب آپ کا رب آپ کو مقام محمود میں کھڑا کرے گا.(3)","arabic":"وَمِنَ ٱلَّيۡلِ فَتَهَجَّدۡ بِهِۦ نَافِلَةٗ لَّكَ عَسَىٰٓ أَن يَبۡعَثَكَ رَبُّكَ مَقَامٗا مَّحۡمُودٗا","category":["17 (Al-Isra)","Al-Isra","Surah Al-Isra","Chapter Al-Isra","Isra","Surah Isra","Chapter Isra","Al Isra","Surah Al Isra","Chapter Al Isra","Surah 17","Chapter 17","The Night Journey","الإسرَاء"],"ayahNumber":2108,"juzNumber":15,"footnotes":"(1) بعض کہتے ہیں ”تھجد“ اضداد میں سے ہے جس کے معنی سونے کے بھی ہیں اور نیند سے بیدار ہونے کے بھی۔ اور یہاں یہی دوسرے معنی ہیں کہ رات کو سو کر اٹھیں اور نوافل پڑھیں۔ بعض کہتے ہیں کہ ”ھجود“ کے اصل معنی تو رات کو سونے کے ہی ہیں، لیکن باب تفعّل میں جانے سے اس میں تجنّب کے معنی پیدا ہوگئے جیسے تأثم کے معنی ہیں اس نے گناہ سے اجتناب کیا، یا بچا، اس طرح تھجد کے معنی ہونگے، سونے سے بچنا جو رات کو سونے سے بچا اور قیام کیا۔ بہرحال تھجد کا مفہوم رات کے پچھلے پہر اٹھ کر نوافل پڑھنا۔ ساری رات قیام اللیل کرنا خلاف سنت ہے۔ نبی رات کے پہلے حصے میں سوتے اور پچھلے حصے میں اٹھ کر تہجد پڑھتے۔ یہی طریقہ سنت ہے۔\n(2) بعض نے اس کے معنی کئے ہیں یہ ایک زائد فرض ہے جو آپ کے لئے خاص ہے، اس طرح وہ کہتے ہیں کہ نبی (صلى الله عليه وسلم) پر تہجد بھی اسی طرح فرض تھی، جس طرح پانچ نمازیں فرض تھیں۔ البتہ امت کے لئے تہجد کی نماز فرض نہیں۔ بعض کہتے ہیں کہ تہجد آپ پر فرض تھی نہ آپ کی امت پر۔ یہ ایک زائد عبادت ہے جس کی فضیلت یقینا بہت ہے اور اس وقت اللہ اپنی عبادت سے بڑا خوش ہوتا ہے۔ تاہم یہ نماز فرض و واجب نہ نبی (صلى الله عليه وسلم) پر تھی اور نہ آپ (صلى الله عليه وسلم) کی امت پر ہی فرض ہے۔\n(3) یہ وہ مقام ہے جو قیامت والے دن اللہ تعالٰی نبی کو عطا فرمائے گا اور اس مقام پر ہی آپ صلی اللہ علیہ وسلم وہ شفاعت عظمٰی فرمائیں گے، جس کے بعد لوگوں کا حساب کتاب ہوگا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wamina al-layli fatahajjad bihi nāfilatan laka ʿasā an yabʿathaka rabbuka maqāman maḥmūdan ","translations":["And from","the night","arise from sleep for prayer","with it","(as) additional","for you","it may be","that","will raise you","your Lord","(to) a station","praiseworthy","(79)"],"transliterationArr":["wamina","al-layli","fatahajjad","bihi","nāfilatan","laka","ʿasā","an","yabʿathaka","rabbuka","maqāman","maḥmūdan",null],"verseTiming":[[1,0,660],[2,660,1630],[3,1630,2900],[4,2900,3520],[5,3520,4890],[6,4890,5300],[7,5300,5980],[8,5980,6720],[9,6720,9080],[10,9080,10000],[11,10000,10910],[12,10910,13385]]}}