{"name":"17:70","price":"یقیناً ہم نے اوﻻد آدم کو بڑی عزت دی(1) اور انہیں خشکی اور تری کی سواریاں(2) دیں اور انہیں پاکیزه چیزوں کی روزیاں(3) دیں اور اپنی بہت سی مخلوق پر انہیں فضیلت عطا فرمائی.(4)","arabic":"۞ وَلَقَدۡ كَرَّمۡنَا بَنِيٓ ءَادَمَ وَحَمَلۡنَٰهُمۡ فِي ٱلۡبَرِّ وَٱلۡبَحۡرِ وَرَزَقۡنَٰهُم مِّنَ ٱلطَّيِّبَٰتِ وَفَضَّلۡنَٰهُمۡ عَلَىٰ كَثِيرٖ مِّمَّنۡ خَلَقۡنَا تَفۡضِيلٗا","category":["17 (Al-Isra)","Al-Isra","Surah Al-Isra","Chapter Al-Isra","Isra","Surah Isra","Chapter Isra","Al Isra","Surah Al Isra","Chapter Al Isra","Surah 17","Chapter 17","The Night Journey","الإسرَاء"],"ayahNumber":2099,"juzNumber":15,"footnotes":"(1) یہ شرف اور فضل، بحیثیت انسان کے، ہر انسان کو حاصل ہے چاہے مومن ہو یا کافر۔ کیونکہ یہ شرف دوسری مخلوقات، حیوانات، جمادات و نباتات وغیرہ کے مقابلے میں ہے۔ اور یہ شرف متعدد اعتبار سے ہے جس طرح کی شکل و صورت، قد وقامت اور ہیئت اللہ تعالٰی نے انسان کو عطا کی ہے، وہ کسی دوسری مخلوق کو حاصل نہیں، جو عقل انسان کو دی گئی ہے، جس کے ذریعے سے اس نے اپنے آرام و راحت کے لئے بیشمار چیزیں ایجاد کیں۔ حیوانات وغیرہ اس سے محروم ہیں۔ علاوہ ازیں اسی عقل سے صحیح، مفید و مضر اور حسین قبیح کے درمیان تمیز کرنے پر قادر ہے۔ علاوہ ازیں کائنات کی تمام چیزوں کو اللہ تعالٰی نے انسان کی خدمت پر لگا رکھا ہے۔ چاند سورج، ہوا پانی اور دیگر بیشمار چیزیں ہیں جن سے انسان فیض یاب ہو رہا ہے۔\n(2) خشکی میں گھوڑوں، خچروں، گدھوں، اونٹوں اور اپنی تیار کردہ سواریوں (ریلیں، گاڑیاں، بسیں، ہوائی جہاز، سائیکل اور موٹر سائیکل وغیرہ) پر سوار ہوتا ہے اور اسی طرح سمندر میں کشتیاں اور جہاز ہیں جن پر وہ سوار ہوتا ہے اور سامان لاتا لے جاتا ہے۔\n(3) انسان کی خوراک کے لئے جو غلہ جات، میوے اور پھل ہیں سب اسی نے پیدا کئے اور ان میں جو جو لذتیں، ذائقے اور قوتیں رکھیں ہیں۔ انواع اقسام کے کھانے، یہ لذیذ و مرغوب پھل اور یہ قوت بخش اور مفرح مرکبات و مشروبات اور خمیرے اور معجونات، انسان کے علاوہ اور کس مخلوق کو حاصل ہیں؟۔\n(4) مذکورہ تفصیل سے انسان کی، بہت سی مخلوقات پر، فضیلت اور برتری واضح ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walaqad karramnā banī ādama waḥamalnāhum fī al-bari wal-baḥri warazaqnāhum mina al-ṭayibāti wafaḍḍalnāhum ʿalā kathīrin mimman khalaqnā tafḍīlan ","translations":["And certainly","We have honored","(the) children of Adam","(the) children of Adam","and We carried them","on","the land","and the sea","and We have provided them","of","the good things","and We preferred them","over","many","of those whom","We have created","(with) preference","(70)"],"transliterationArr":["walaqad","karramnā","banī","ādama","waḥamalnāhum","fī","al-bari","wal-baḥri","warazaqnāhum","mina","al-ṭayibāti","wafaḍḍalnāhum","ʿalā","kathīrin","mimman","khalaqnā","tafḍīlan",null],"verseTiming":[[1,0,830],[2,830,2030],[3,2030,3590],[4,3590,4380],[5,4380,6010],[6,6010,6250],[7,6250,7060],[8,7060,8120],[9,8120,9810],[10,9810,10880],[11,10880,12010],[12,12010,15520],[13,15520,16330],[14,16330,17890],[15,17890,19750],[16,19750,20340],[17,20340,21110],[18,21110,23210],[19,23210,24190],[20,24190,25945]]}}