{"name":"18:102","price":"کیا کافر یہ خیال کیے بیٹھے ہیں؟ کہ میرے سوا وه میرے بندوں کو اپنا حمایتی بنا لیں گے؟ (سنو) ہم نے تو ان کفار کی مہمانی کے لئے جہنم کو تیار کر رکھا ہے.(1)","arabic":"أَفَحَسِبَ ٱلَّذِينَ كَفَرُوٓاْ أَن يَتَّخِذُواْ عِبَادِي مِن دُونِيٓ أَوۡلِيَآءَۚ إِنَّآ أَعۡتَدۡنَا جَهَنَّمَ لِلۡكَٰفِرِينَ نُزُلٗا","category":["18 (Al-Kahf)","Al-Kahf","Surah Al-Kahf","Chapter Al-Kahf","Kahf","Surah Kahf","Chapter Kahf","Al Kahf","Surah Al Kahf","Chapter Al Kahf","Surah 18","Chapter 18","The Cave","الكَهف"],"ayahNumber":2242,"juzNumber":16,"footnotes":"(1) حَسِبَ، بمعنی ظَنَّ ہے اور عِبَادِيَ (میرے بندوں) سے مراد ملائکہ، مسیح (عليه السلام) اور دیگر صالحین ہیں، جن کو حاجت روا اور مشکل کشا سمجھا جاتا ہے، اسی طرح شیاطین و جنات ہیں جن کی عبادت کی جاتی ہے اور استفہام زجر وتوبیخ کے لیے ہے۔ یعنی غیر اللہ کے یہ پجاری کیا یہ سمجھتے ہیں کہ وہ مجھے چھوڑ کر اور میرے بندوں کی عبادت کر کے ان کی حمایت سے میرے عذاب سے بچ جائیں گے؟ یہ ناممکن ہے، ہم نے تو ان کافروں کے لئے جہنم تیار کر رکھی ہے جس میں جانے سے ان کو وہ بندے نہیں روک سکیں گے جن کی یہ عبادت کرتے اور ان کو اپنا حمایتی سمجھتے ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"afaḥasiba alladhīna kafarū an yattakhidhū ʿibādī min dūnī awliyāa innā aʿtadnā jahannama lil'kāfirīna nuzulan ","translations":["Do then think","those who","disbelieve","that","they (can) take","My servants","besides Me","besides Me","(as) protectors","Indeed, We ","We have prepared","Hell","for the disbelievers","(as) a lodging","(102)"],"transliterationArr":["afaḥasiba","alladhīna","kafarū","an","yattakhidhū","ʿibādī","min","dūnī","awliyāa","innā","aʿtadnā","jahannama","lil'kāfirīna","nuzulan",null],"verseTiming":[[1,0,1030],[2,1030,2180],[3,2180,4130],[4,4130,4660],[5,4660,6370],[6,6370,7450],[7,7450,8040],[8,8040,10950],[9,10950,13750],[10,13750,17190],[11,17190,19030],[12,19030,20720],[13,20720,22560],[14,22560,23905]]}}