{"name":"18:105","price":"یہی وه لوگ ہیں جنہوں نے اپنے پروردگار کی آیتوں اور اس کی ملاقات سے کفر کیا(1) ، اس لئے ان کے اعمال غارت ہوگئے پس قیامت کے دن ہم ان کا کوئی وزن قائم نہ کریں گے.(2)","arabic":"أُوْلَٰٓئِكَ ٱلَّذِينَ كَفَرُواْ بِـَٔايَٰتِ رَبِّهِمۡ وَلِقَآئِهِۦ فَحَبِطَتۡ أَعۡمَٰلُهُمۡ فَلَا نُقِيمُ لَهُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ وَزۡنٗا","category":["18 (Al-Kahf)","Al-Kahf","Surah Al-Kahf","Chapter Al-Kahf","Kahf","Surah Kahf","Chapter Kahf","Al Kahf","Surah Al Kahf","Chapter Al Kahf","Surah 18","Chapter 18","The Cave","الكَهف"],"ayahNumber":2245,"juzNumber":16,"footnotes":"(1) رب کی آیات سے مراد توحید کے وہ دلائل ہیں جو کائنات میں پھیلے ہوئے ہیں اور وہ آیات تشریعی ہیں اور جو اس نے اپنی کتابوں میں نازل کیں اور پیغمبروں نے تبلیغ وتوضیع کی۔ اور رب کی ملاقات سے کفر کا مطلب آخرت کی زندگی اور دوبارہ جی اٹھنے سے انکار ہے۔\n(2) یعنی ہمارے ہاں ان کی کوئی قدر وقیمت نہیں ہوگی یا یہ مطلب ہے کہ ہم ان کے لئے میزان کا اہتمام ہی نہیں کریں گے کہ جس میں ان کے اعمال تولے جائیں، اس لئے کہ اعمال تو موحدین کے تولے جائیں گے جن کے نامہ اعمال میں نیکیاں اور برائیاں دونوں ہونگی، جب کہ ان کے نامہ اعمال حسنات سے بالکل خالی ہوں گے جس طرح حدیث میں آتا ہے کہ ”قیامت والے دن موٹا تازہ آدمی آئے گا، اللہ کے ہاں اس کا اتنا وزن نہیں ہوگا جتنا مچھر کے پر کا ہوتا ہے“، پھر آپ (صلى الله عليه وسلم) نے اسی آیت کی تلاوت فرمائی۔ (صحیح بخاری۔ سورہ کہف)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"ulāika alladhīna kafarū biāyāti rabbihim waliqāihi faḥabiṭat aʿmāluhum falā nuqīmu lahum yawma al-qiyāmati waznan ","translations":["Those","(are) the ones who","disbelieve","in the Verses","(of) their Lord","and the meeting (with) Him","So (are) vain","their deeds","so not","We will assign","for them","(on) the Day","(of) the Resurrection","any weight","(105)"],"transliterationArr":["ulāika","alladhīna","kafarū","biāyāti","rabbihim","waliqāihi","faḥabiṭat","aʿmāluhum","falā","nuqīmu","lahum","yawma","al-qiyāmati","waznan",null],"verseTiming":[[1,0,2580],[2,2580,3660],[3,3660,4550],[4,4550,5840],[5,5840,7030],[6,7030,10020],[7,10020,11220],[8,11220,13100],[9,13100,14220],[10,14220,15770],[11,15770,16300],[12,16300,17170],[13,17170,17870],[14,17870,18510],[15,18510,19900],[16,19900,21025]]}}