{"name":"18:13","price":"ہم ان کا صحیح واقعہ تیرے سامنے بیان فرما رہے ہیں۔ یہ چند نوجوان(1) اپنے رب پر ایمان ﻻئے تھے اور ہم نے ان کی ہدایت میں ترقی دی تھی.","arabic":"نَّحۡنُ نَقُصُّ عَلَيۡكَ نَبَأَهُم بِٱلۡحَقِّۚ إِنَّهُمۡ فِتۡيَةٌ ءَامَنُواْ بِرَبِّهِمۡ وَزِدۡنَٰهُمۡ هُدٗى","category":["18 (Al-Kahf)","Al-Kahf","Surah Al-Kahf","Chapter Al-Kahf","Kahf","Surah Kahf","Chapter Kahf","Al Kahf","Surah Al Kahf","Chapter Al Kahf","Surah 18","Chapter 18","The Cave","الكَهف"],"ayahNumber":2153,"juzNumber":15,"footnotes":"(1) اب اجمال کے بعد تفصیل بیان کی جا رہی ہے۔ یہ نوجوان، بعض کہتے ہیں عیسائیت کے پیروکار تھے اور بعض کہتے ہیں ان کا زمانہ حضرت عیسیٰ (عليه السلام) سے پہلے کا ہے۔ حافظ ابن کثیر نے اسی قول کو ترجیح دی ہے۔ کہتے ہیں ایک بادشاہ تھا، دقیانوس، جو لوگوں کو بتوں کی عبادت کرنے اور ان کے نام کی نذر نیاز دینے کی ترغیب دیتا تھا۔ اللہ تعالٰی نے ان کے چند نوجوانوں کے دلوں میں یہ بات ڈال دی کہ عبادت کے لائق تو صرف ایک اللہ ہی ہے جو آسمان و زمین کا خالق اور کائنات کا رب ہے۔ فِتْیِۃ جمع قلت ہے جس سے معلوم ہوتا ہے ان کی تعداد 9 یا اس سے بھی کم تھی۔ یہ الگ ہو کر کسی ایک جگہ اللہ واحد کی عبادت کرتے، آہستہ آہستہ لوگوں میں ان کے عقیدہ کا چرچا ہوا، تو بادشاہ تک بات پہنچ گئی اور اس نے انہیں اپنے دربار میں طلب کر کے ان سے پوچھا، تو وہاں انہوں نے برملا اللہ کی توحید بیان کی بالآخر پھر بادشاہ اور اپنی مشرک قوم کے ڈر سے اپنے دین کو بچانے کے لئے آبادی سے دور ایک پہاڑ کے غار میں پناہ گزین ہوگئے، جہاں اللہ تعالٰی نے ان پر نیند مسلط کر دی اور وہ تین سو نو (309) سال وہاں سوئے رہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"naḥnu naquṣṣu ʿalayka naba-ahum bil-ḥaqi innahum fit'yatun āmanū birabbihim wazid'nāhum hudan ","translations":["We","narrate","to you","their story","in truth","Indeed, they (were)","youths","who believed","in their Lord","and We increased them","(in) guidance","(13)"],"transliterationArr":["naḥnu","naquṣṣu","ʿalayka","naba-ahum","bil-ḥaqi","innahum","fit'yatun","āmanū","birabbihim","wazid'nāhum","hudan",null],"verseTiming":[[1,0,1570],[2,1570,2400],[3,2400,4150],[4,4150,5520],[5,5520,7100],[6,7100,8170],[7,8170,9180],[8,9180,10470],[9,10470,11850],[10,11850,12655]]}}