{"name":"18:24","price":"مگر ساتھ ہی انشاءاللہ کہہ لینا(1) ۔ اور جب بھی بھولے، اپنے پروردگار کی یاد کر لیا کرنا(2) اور کہتے رہنا کہ مجھے پوری امید ہے کہ میرا رب مجھے اس سے بھی زیاده ہدایت کے قریب کی بات کی رہبری کرے.(3)","arabic":"إِلَّآ أَن يَشَآءَ ٱللَّهُۚ وَٱذۡكُر رَّبَّكَ إِذَا نَسِيتَ وَقُلۡ عَسَىٰٓ أَن يَهۡدِيَنِ رَبِّي لِأَقۡرَبَ مِنۡ هَٰذَا رَشَدٗا","category":["18 (Al-Kahf)","Al-Kahf","Surah Al-Kahf","Chapter Al-Kahf","Kahf","Surah Kahf","Chapter Kahf","Al Kahf","Surah Al Kahf","Chapter Al Kahf","Surah 18","Chapter 18","The Cave","الكَهف"],"ayahNumber":2164,"juzNumber":15,"footnotes":"(1) مفسرین کہتے ہیں کہ یہودیوں نے نبی سے تین باتیں پوچھی تھیں، روح کی حقیقت کیا ہے اور اصحاب کہف اور ذوالقرنین کون تھے؟ کہتے ہیں کہ یہی سوال اس سورت کے نزول کا سبب بنا نبی (صلى الله عليه وسلم) نے فرمایا میں تمہیں کل جواب دونگا، لیکن اس کے بعد 15 دن تک جبرائیل وحی لے کر نہیں آئے۔ پھر جب آئے تو اللہ تعالٰی نے ان شاء اللہ کہنے کا یہ حکم دیا۔ آیت میں ”غد“ سے مراد مستقبل ہے یعنی جب بھی مستقبل قریب یا بعید میں کوئی کام کرنے کا عزم کرو تو ان شاء اللہ ضرور کہا کرو۔ کیونکہ انسان کو تو پتہ نہیں کہ جس بات کا عزم کر رہا ہے، اس کی توفیق بھی اسے اللہ کی مشیت سے ملتی ہے یا نہیں۔\n(2) یعنی اگر کلام یا وعدہ کرتے وقت ان شاء اللہ کہنا بھول جاؤ، تو جس وقت یاد آجائے ان شاء اللہ کہہ لیا کرو، یا پھر رب کو یاد کرنے کا مطلب، اس کی تسبیح و تحمید اور اس سے استفغار ہے۔\n(3) یعنی میں جس کا عزم ظاہر کر رہا ہوں، ممکن ہے اللہ تعالٰی اس سے زیادہ بہتر اور مفید کام کی طرف میری رہنمائی فرما دے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"illā an yashāa al-lahu wa-udh'kur rabbaka idhā nasīta waqul ʿasā an yahdiyani rabbī li-aqraba min hādhā rashadan ","translations":["Except","If","Allah wills","Allah wills","And remember","your Lord","when","you forget","and say","Perhaps","[that]","will guide me","my Lord","to a nearer (way)","than","this","right way","(24)"],"transliterationArr":["illā","an","yashāa","al-lahu","wa-udh'kur","rabbaka","idhā","nasīta","waqul","ʿasā","an","yahdiyani","rabbī","li-aqraba","min","hādhā","rashadan",null],"verseTiming":[[1,0,2130],[2,2130,2370],[3,2370,5360],[4,5360,8160],[5,8160,8890],[6,8890,9880],[7,9880,10490],[8,10490,11390],[9,11390,11900],[10,11900,14010],[11,14010,14500],[12,14500,15940],[13,15940,16780],[14,16780,17920],[15,17920,18560],[16,18560,18960],[17,18960,20475]]}}