{"name":"18:22","price":"کچھ لوگ تو کہیں گے کہ اصحاب کہف تین تھے اور چوتھا ان کا کتا تھا(1) ۔ کچھ کہیں گے کہ پانچ تھے اور چھٹا ان کا کتا تھا، غیب کی باتوں میں اٹکل (کے تیر تکے) چلاتے ہیں(2)، کچھ کہیں گے کہ وه سات ہیں اور آٹھواں ان کا کتا(3) ہے۔ آپ کہہ دیجیئے کہ میرا پروردگار ان کی تعداد کو بخوبی جاننے واﻻ ہے، انہیں بہت ہی کم لوگ جانتے ہیں(4)۔ پس آپ ان کے مقدمے میں صرف سرسری گفتگو کریں(5) اور ان میں سے کسی سے ان کے بارے میں پوچھ گچھ بھی نہ کریں.(6)","arabic":"سَيَقُولُونَ ثَلَٰثَةٞ رَّابِعُهُمۡ كَلۡبُهُمۡ وَيَقُولُونَ خَمۡسَةٞ سَادِسُهُمۡ كَلۡبُهُمۡ رَجۡمَۢا بِٱلۡغَيۡبِۖ وَيَقُولُونَ سَبۡعَةٞ وَثَامِنُهُمۡ كَلۡبُهُمۡۚ قُل رَّبِّيٓ أَعۡلَمُ بِعِدَّتِهِم مَّا يَعۡلَمُهُمۡ إِلَّا قَلِيلٞۗ فَلَا تُمَارِ فِيهِمۡ إِلَّا مِرَآءٗ ظَٰهِرٗا وَلَا تَسۡتَفۡتِ فِيهِم مِّنۡهُمۡ أَحَدٗا","category":["18 (Al-Kahf)","Al-Kahf","Surah Al-Kahf","Chapter Al-Kahf","Kahf","Surah Kahf","Chapter Kahf","Al Kahf","Surah Al Kahf","Chapter Al Kahf","Surah 18","Chapter 18","The Cave","الكَهف"],"ayahNumber":2162,"juzNumber":15,"footnotes":"- یہ کہنے والے اور ان کی مختلف تعداد بتلانے والے عہد رسالت کے مؤمن اور کافر تھے، خصوصاً اہل کتاب جو کتب آسمانی سے آگاہی اور علم کا دعویٰ رکھتے تھے۔\n(2) یعنی علم ان میں سے کسی کے پاس نہیں، جس طرح بغیر دیکھے کوئی پتھر مارے، یہ بھی اس طرح اٹکل پچو باتیں کر رہے ہیں۔\n(3) اللہ تعالٰی نے صرف تین قول بیان فرمائے، پہلے وہ دو قولوں کو رَجْمَا بِالْغَیْبِ (ظن و تخمین) کہہ کر ان کو کمزور رائے قرار دیا اور اس تیسرے قول کا ذکر اس کے بعد کیا، جس سے اہل تفسیر نے استدلال کیا ہے کہ یہ انداز اس قول کی صحت کی دلیل ہے اور فی الواقع ان کی اتنی ہی تعداد تھی (ابن کثیر)\n(4) بعض صحابہ (رضي الله عنهم)سے مروی ہے کہ وہ کہتے تھے میں بھی ان کم لوگوں میں سے ہوں جو یہ جانتے ہیں کہ اصحاب کہف کی تعداد کتنی تھی؟ وہ صرف سات تھے جیسا کہ تیسرے قول میں بتلایا گیا ہے (ابن کثیر)\n(5) یعنی صرف ان ہی باتوں پر اکتفاء کریں جن کی اطلاع آپ کو وحی کے ذریعے سے کردی گئی ہے۔ یا تعین عدد میں بحث و تکرار نہ کریں، صرف یہ کہہ دیں کہ اس تعیین کی کوئی دلیل نہیں ہے۔\n(6) یعنی بحث کرنے والوں سے ان کی بابت کچھ نہ پوچھیں، اس لئے کہ جس سے پوچھا جائے، اس کو پوچھنے والے سے زیادہ علم ہونا چاہئے، جب کہ یہاں معاملہ اس کے برعکس ہے۔ آپ کے پاس تو پھر بھی یقینی علم کا ایک ذریعہ وحی، موجود ہے، جب کہ دوسروں کے پاس ذہنی تصور کے سوا کچھ بھی نہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"sayaqūlūna thalāthatun rābiʿuhum kalbuhum wayaqūlūna khamsatun sādisuhum kalbuhum rajman bil-ghaybi wayaqūlūna sabʿatun wathāminuhum kalbuhum qul rabbī aʿlamu biʿiddatihim mā yaʿlamuhum illā qalīlun falā tumāri fīhim illā mirāan ẓāhiran walā tastafti fīhim min'hum aḥadan ","translations":["They say","(they were) three","the forth of them","their dog","and they say","(they were) five","the sixth of them","their dog ","guessing","about the unseen","and they say","(they were) seven","and the eight of them","their dog","Say","My Lord","knows best","their number","None","knows them","except","a few","So (do) not","argue","about them","except","(with) an argument","obvious","and (do) not","inquire","about them","among them","(from) anyone","(22)"],"transliterationArr":["sayaqūlūna","thalāthatun","rābiʿuhum","kalbuhum","wayaqūlūna","khamsatun","sādisuhum","kalbuhum","rajman","bil-ghaybi","wayaqūlūna","sabʿatun","wathāminuhum","kalbuhum","qul","rabbī","aʿlamu","biʿiddatihim","mā","yaʿlamuhum","illā","qalīlun","falā","tumāri","fīhim","illā","mirāan","ẓāhiran","walā","tastafti","fīhim","min'hum","aḥadan",null],"verseTiming":[[1,0,1560],[2,1560,2750],[3,2750,4190],[4,4190,5340],[5,5340,6860],[6,6860,8150],[7,8150,9980],[8,9980,10990],[9,10990,12510],[10,12510,13300],[11,13300,14890],[12,14890,16610],[13,16610,18190],[14,18190,19640],[15,19640,21000],[16,21000,23460],[17,23460,24290],[18,24290,25610],[19,25610,26860],[20,26860,28100],[21,28100,28890],[22,28890,31750],[23,31750,32320],[24,32320,33160],[25,33160,33980],[26,33980,34730],[27,34730,36800],[28,36800,38810],[29,38810,39900],[30,39900,40950],[31,40950,41650],[32,41650,43120],[33,43120,44125]]}}