{"name":"18:27","price":"تیری جانب جو تیرے رب کی کتاب وحی کی گئی ہے اسے پڑھتا ره(1) ، اس کی باتوں کو کوئی بدلنے واﻻ نہیں تو اس کے سوا ہرگزکوئی پناه کی جگہ نہ پائے گا.(2)","arabic":"وَٱتۡلُ مَآ أُوحِيَ إِلَيۡكَ مِن كِتَابِ رَبِّكَۖ لَا مُبَدِّلَ لِكَلِمَٰتِهِۦ وَلَن تَجِدَ مِن دُونِهِۦ مُلۡتَحَدٗا","category":["18 (Al-Kahf)","Al-Kahf","Surah Al-Kahf","Chapter Al-Kahf","Kahf","Surah Kahf","Chapter Kahf","Al Kahf","Surah Al Kahf","Chapter Al Kahf","Surah 18","Chapter 18","The Cave","الكَهف"],"ayahNumber":2167,"juzNumber":15,"footnotes":"(1) ویسے تو یہ حکم عام ہے کہ جس چیز کی بھی وحی آپ کی طرف کی جائے، اس کی تلاوت فرمائیں اور لوگوں کو اس کی تعلیم دیں۔ لیکن اصحاب کہف کے قصے کے خاتمے پر اس حکم سے مراد یہ بھی ہو سکتا ہے کہ اصحاب کہف کے بارے میں لوگ جو چاہیں، کہتے پھریں۔ لیکن اللہ تعالٰی نے اس کے بارے میں اپنی کتاب میں جو کچھ اور جتنا کچھ بیان فرما دیا ہے، وہی صحیح ہے، وہی لوگوں کو پڑھ کر سنا دیجئے، اس سے زیادہ دیگر باتوں کی طرف دھیان نہ دیجئے۔\n(2) یعنی اگر اسے بیان کرنے سے گریز و انحراف کیا، یا اس کے کلمات میں تغیر و تبدیلی کی کوشش کی، تو اللہ سے آپ کو بچانے والا کوئی نہیں ہوگا۔ خطاب اگرچہ نبی (صلى الله عليه وسلم) سے ہے، لیکن اصل مخاطب امت ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-ut'lu mā ūḥiya ilayka min kitābi rabbika lā mubaddila likalimātihi walan tajida min dūnihi mul'taḥadan ","translations":["And recite","what","has been revealed","to you","of","the Book","(of) your Lord","None","can change","His Words","and never","you will find","besides Him","besides Him","a refuge","(27)"],"transliterationArr":["wa-ut'lu","mā","ūḥiya","ilayka","min","kitābi","rabbika","lā","mubaddila","likalimātihi","walan","tajida","min","dūnihi","mul'taḥadan",null],"verseTiming":[[1,0,720],[2,720,2430],[3,2430,3190],[4,3190,3980],[5,3980,4760],[6,4760,5620],[7,5620,6500],[8,6500,6920],[9,6920,7990],[10,7990,9720],[11,9720,11070],[12,11070,11740],[13,11740,12100],[14,12100,13570],[15,13570,15365]]}}