{"name":"18:37","price":"اس کے ساتھی نے اس سے باتیں کرتے ہوئے کہا کہ کیا تو اس (معبود) سے کفر کرتا ہے جس نے تجھے مٹی سے پیدا کیا۔ پھر نطفے سے پھر تجھے پورا آدمی بنا دیا.(1)","arabic":"قَالَ لَهُۥ صَاحِبُهُۥ وَهُوَ يُحَاوِرُهُۥٓ أَكَفَرۡتَ بِٱلَّذِي خَلَقَكَ مِن تُرَابٖ ثُمَّ مِن نُّطۡفَةٖ ثُمَّ سَوَّىٰكَ رَجُلٗا","category":["18 (Al-Kahf)","Al-Kahf","Surah Al-Kahf","Chapter Al-Kahf","Kahf","Surah Kahf","Chapter Kahf","Al Kahf","Surah Al Kahf","Chapter Al Kahf","Surah 18","Chapter 18","The Cave","الكَهف"],"ayahNumber":2177,"juzNumber":15,"footnotes":"(1) اس کی یہ باتیں سن کر اس کے مومن ساتھی نے اس کو وعظ وتبلیغ کے انداز میں سمجھایا کہ تو اپنے خالق کے ساتھ کفر کا ارتکاب کر رہا ہے جس نے تجھے مٹی اور قطرہ پانی سے پیدا کیا ابو البشر حضرت آدم (عليه السلام) چونکہ مٹی سے بنائے گئے تھے اس لیے انسانوں کی اصل مٹی ہی ہوئی، پھر قریبی سبب وہ نطفہ بنا جو باپ کی صلب سے نکل کر رحم مادر میں گیا وہاں نو مہینے اس کی پرورش کی پھر اسے پورا انسان بنا کر ماں کے پیٹ سے نکالا بعض کے نزدیک مٹی سے پیدا ہونے کا مطلب ہے کہ انسان جو خوراک کھاتا ہے وہ سب زمین سے یعنی مٹی سے ہی حاصل ہوتی ہے اسی خوراک سے وہ نطفہ بنتا ہے جو عورت کے رحم میں جا کر انسان کی پیدائش کا ذریعہ بنتا ہے یوں بھی ہر انسان کی اصل مٹی ہی قرار پاتی ہے ناشکرے انسان کو اس کی اصل یاد دلا کر اسے اس کے خالق اور رب کی طرف توجہ دلائی جا رہی ہے کہ تو اپنی حقیقت اور اصل پر غور کر اور پھر رب کے ان احسانات کو دیکھ کہ تجھے اس نے کیا کچھ بنا دیا اور اس عمل تخلیق میں کوئی اس کا شریک اور مددگار نہیں ہے یہ سب کچھ کرنے والا صرف اور صرف وہ اللہ تعالٰی ہی ہے جس کو ماننے کے لیے تو تیار نہیں ہے آہ، کس قدر یہ انسان ناشکرا ہے؟۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qāla lahu ṣāḥibuhu wahuwa yuḥāwiruhu akafarta bi-alladhī khalaqaka min turābin thumma min nuṭ'fatin thumma sawwāka rajulan ","translations":["Said","to him","his companion","while he","was talking to him","Do you disbelieve","in One Who","created you","from","dust","then","from","a minute quantity of semen","then","fashioned you","(into) a man","(37)"],"transliterationArr":["qāla","lahu","ṣāḥibuhu","wahuwa","yuḥāwiruhu","akafarta","bi-alladhī","khalaqaka","min","turābin","thumma","min","nuṭ'fatin","thumma","sawwāka","rajulan",null],"verseTiming":[[1,0,730],[2,730,1250],[3,1250,2750],[4,2750,3190],[5,3190,5590],[6,5590,6590],[7,6590,7630],[8,7630,8980],[9,8980,9980],[10,9980,10900],[11,10900,11850],[12,11850,12380],[13,12380,14330],[14,14330,15840],[15,15840,16060],[16,16060,17660],[17,17660,19330],[18,19330,20490],[19,20490,21405]]}}