{"name":"18:44","price":"یہیں سے (ﺛابت ہے) کہ اختیارات(1) اللہ برحق کے لئے ہیں وه ﺛواب دینے اور انجام کے اعتبار سے بہت(2) ہی بہتر ہے.","arabic":"هُنَالِكَ ٱلۡوَلَٰيَةُ لِلَّهِ ٱلۡحَقِّۚ هُوَ خَيۡرٞ ثَوَابٗا وَخَيۡرٌ عُقۡبٗا","category":["18 (Al-Kahf)","Al-Kahf","Surah Al-Kahf","Chapter Al-Kahf","Kahf","Surah Kahf","Chapter Kahf","Al Kahf","Surah Al Kahf","Chapter Al Kahf","Surah 18","Chapter 18","The Cave","الكَهف"],"ayahNumber":2184,"juzNumber":15,"footnotes":"(1) وَلايَةٌ ۔ کے معنی موالات اور نصرت کے ہیں یعنی اس مقام پر ہر مومن و کافر کو معلوم ہو جاتا ہے کہ اللہ کے سوا کوئی کسی کی مدد کرنے پر اور اس کے عذاب سے بچانے پر قادر نہیں ہے، یہی وجہ ہے کہ پھر اس موقع پر بڑے بڑے سرکش اور جبار بھی اظہار ایمان پر مجبور ہو جاتے ہیں، گو اس وقت کا ایمان نافع اور مقبول نہیں۔ جس طرح قرآن نے فرعون کی بابت نقل کیا ہے کہ جب وہ غرق ہونے لگا تو کہنے لگا۔ «آمَنْتُ أَنَّهُ لا إِلَهَ إِلا الَّذِي آمَنَتْ بِهِ بَنُو إِسْرَائِيلَ وَأَنَا مِنَ الْمُسْلِمِينَ» (سورۂ یونس:90)۔ ”میں اس اللہ پر ایمان لایا جس پر بنو اسرائیل ایمان رکھتے ہیں اور میں مسلمانوں میں سے ہوں“۔ دوسرے کفار کی بابت فرمایا گیا: ”جب انہوں نے ہمارا عذاب دیکھا تو کہا ہم اللہ واحد پر ایمان لائے اور جن کو ہم اللہ کا شریک ٹھہراتے تھے ان کا انکار کرتے ہیں“۔ (سورۃ المومن: 84) اگر ولایت واو کے کسرے کے ساتھ ہو تو پھر اس کے معنی حکم اور اختیارات کے ہیں جیسا کہ ترجمے میں یہی معنی اختیار کیے گئے ہیں۔ ابن کثیر۔\n(2) یعنی وہی اپنے دوستوں کو بہتر بدلہ دینے والا اور حسن عاقبت سے مشرف کرنے والا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"hunālika al-walāyatu lillahi al-ḥaqi huwa khayrun thawāban wakhayrun ʿuq'ban ","translations":["There","the protection","(is) from Allah","the True","He","(is the) best","(to) reward","and (the) best","(for) the final end","(44)"],"transliterationArr":["hunālika","al-walāyatu","lillahi","al-ḥaqi","huwa","khayrun","thawāban","wakhayrun","ʿuq'ban",null],"verseTiming":[[1,0,1160],[2,1160,2490],[3,2490,3550],[4,3550,4840],[5,4840,5150],[6,5150,6290],[7,6290,7790],[8,7790,9560],[9,9560,10945]]}}