{"name":"18:46","price":"مال واوﻻد تو دنیا کی ہی زینت ہے(1) ، اور (ہاں) البتہ باقی رہنے والی نیکیاں(2) تیرے رب کے نزدیک از روئے ﺛواب اور (آئنده کی) اچھی توقع کے بہت بہتر ہیں.","arabic":"ٱلۡمَالُ وَٱلۡبَنُونَ زِينَةُ ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۖ وَٱلۡبَٰقِيَٰتُ ٱلصَّٰلِحَٰتُ خَيۡرٌ عِندَ رَبِّكَ ثَوَابٗا وَخَيۡرٌ أَمَلٗا","category":["18 (Al-Kahf)","Al-Kahf","Surah Al-Kahf","Chapter Al-Kahf","Kahf","Surah Kahf","Chapter Kahf","Al Kahf","Surah Al Kahf","Chapter Al Kahf","Surah 18","Chapter 18","The Cave","الكَهف"],"ayahNumber":2186,"juzNumber":15,"footnotes":"(1) اس میں ان اہل ایمان دنیا کا رد ہے جو دنیا کے مال اسباب، قبیلہ اور خاندان اور آل اولاد پر فخر کرتے ہیں۔ اللہ تعالٰی نے فرمایا: یہ چیزیں تو دنیا فانی کی عارضی زینت ہیں۔ آخرت میں یہ چیزیں کچھ کام نہیں آئیں گی۔ اسی لئے اسے آگے فرمایا کہ آخرت میں کام آنے والے عمل وہ ہیں جو باقی رہنے والے ہیں۔\n(2) باقیات صالحات (باقی رہنے والی نییکیاں) کون سی یا کون کون سی ہیں؟ کسی نے نماز کو، کسی نے تحمید و تسبیح اور تکبیر و تہلیل کو اور کسی نے اعمال خیر کو مصداق قرار دیا۔ لیکن صحیح بات یہ ہے کہ یہ عام ہے اور تمام نیکیوں کو شامل ہے۔ تمام فرائض وواجبات اور سنن و نوافل سب باقیات صالحات ہیں بلکہ برے کاموں سے اجتناب بھی ایک عمل صالح ہے، جس پر عند اللہ اجر و ثواب کی امید ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"al-mālu wal-banūna zīnatu al-ḥayati al-dun'yā wal-bāqiyātu al-ṣāliḥātu khayrun ʿinda rabbika thawāban wakhayrun amalan ","translations":["The wealth","and children","(are) adornment","(of) the life","(of) the world","But the enduring","good deeds","(are) better","near","your Lord","(for) reward","and better","(for) hope","(46)"],"transliterationArr":["al-mālu","wal-banūna","zīnatu","al-ḥayati","al-dun'yā","wal-bāqiyātu","al-ṣāliḥātu","khayrun","ʿinda","rabbika","thawāban","wakhayrun","amalan",null],"verseTiming":[[1,0,1090],[2,1090,2310],[3,2310,3260],[4,3260,4410],[5,4410,5500],[6,5500,7760],[7,7760,9260],[8,9260,10090],[9,10090,11370],[10,11370,12220],[11,12220,14060],[12,14060,15020],[13,15020,16385]]}}