{"name":"18:50","price":"اور جب ہم نے فرشتوں کو حکم دیا کہ تم آدم کو سجده کرو تو ابلیس کے سوا سب نے سجده کیا، یہ جنوں میں سے تھا(1) ، اس نے اپنے پروردگار کی نافرمانی کی(2)، کیا پھر بھی تم اسے اور اس کی اوﻻد کو مجھے چھوڑ کر اپنا دوست بنا رہے ہو؟ حاﻻنکہ وه تم سب کا دشمن ہے(3)۔ ایسے ﻇالموں کا کیا ہی برا بدل ہے.(4)","arabic":"وَإِذۡ قُلۡنَا لِلۡمَلَٰٓئِكَةِ ٱسۡجُدُواْ لِأٓدَمَ فَسَجَدُوٓاْ إِلَّآ إِبۡلِيسَ كَانَ مِنَ ٱلۡجِنِّ فَفَسَقَ عَنۡ أَمۡرِ رَبِّهِۦٓۗ أَفَتَتَّخِذُونَهُۥ وَذُرِّيَّتَهُۥٓ أَوۡلِيَآءَ مِن دُونِي وَهُمۡ لَكُمۡ عَدُوُّۢۚ بِئۡسَ لِلظَّٰلِمِينَ بَدَلٗا","category":["18 (Al-Kahf)","Al-Kahf","Surah Al-Kahf","Chapter Al-Kahf","Kahf","Surah Kahf","Chapter Kahf","Al Kahf","Surah Al Kahf","Chapter Al Kahf","Surah 18","Chapter 18","The Cave","الكَهف"],"ayahNumber":2190,"juzNumber":15,"footnotes":"(1) قرآن کی اس صراحت نے واضح کر دیا کہ شیطان فرشتہ نہیں تھا، فرشتہ اگر ہوتا تو حکم الٰہی سے سرتابی کی اسے مجال ہی نہ ہوتی، کیونکہ فرشتوں کی صفت اللہ تعالٰی نے بیان فرمائی ہے «لَّا يَعْصُوْنَ اللّٰهَ مَآ اَمَرَهُمْ وَيَفْعَلُوْنَ مَا يُؤْمَرُوْنَ»(التحریم:6)۔ ”وہ اللہ کے حکم کی نافرمانی نہیں کرتے اور وہی کرتے ہیں جس کا انہیں حکم دیا جاتا ہے“۔ اس صورت میں یہ اشکال رہتا ہے اگر وہ فرشتہ نہیں تھا تو پھر اللہ کے حکم کا وہ مخاطب ہی نہیں تھا کیونکہ اس کے مخاطب تو فرشتے تھے انہیں کو سجدے کا حکم دیا گیا تھا صاحب روح المعانی نے کہا ہے کہ وہ فرشتہ یقینا نہیں تھا لیکن وہ فرشتوں کے ساتھ ہی رہتا تھا اور ان ہی میں شمار ہوتا تھا اس لیے وہ بھی ”اسْجُدُوا لِآدَمَ“ کے حکم کا مخاطب تھا اور سجدہ آدم کے حکم کے ساتھ اس کا خطاب کیا جانا قطعی ہے ارشاد باری ہے۔ «مَا مَنَعَكَ أَلا تَسْجُدَ إِذْ أَمَرْتُكَ»۔ ”جب میں نے تجھے حکم دے دیا تو پھر تو نے سجدہ کیوں نہ کیا“۔\n(2) فِسْق کے معنی ہوتے ہیں نکلنا، چوہا جب اپنے بل سے نکلتا ہے تو کہتے ہیں فَسَقَتِ الْفَأْرَةُ مِنْ جُحْرِهَا، شیطان بھی سجدہ تعظیم و تحیہ کا انکار کرکے رب کی اطاعت سے نکل گیا۔\n(3) یعنی کیا تمہارے لئے یہ صحیح ہے کہ تم ایسے شخص کو اور اسکی نسل کو دوست بناؤ جو تمہارے باپ آدم (عليه السلام) کا دشمن، تمہارا دشمن اور تمہارے رب کا دشمن ہے اور اللہ کو چھوڑ کر اس شیطان کی اطاعت کرو؟۔\n(4) ایک دوسرا ترجمہ اس کا یہ کیا گیا ہے ظالموں نے کیا ہی برا بدل اختیار کیا ہے یعنی اللہ کی اطاعت اور اسکی دوستی کو چھوڑ کر شیطان کی اطاعت اور اسکی دوستی جو اختیار کی ہے تو یہ بہت ہی برا بدل ہے جسے ان ظالموں نے اپنایا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-idh qul'nā lil'malāikati us'judū liādama fasajadū illā ib'līsa kāna mina al-jini fafasaqa ʿan amri rabbihi afatattakhidhūnahu wadhurriyyatahu awliyāa min dūnī wahum lakum ʿaduwwun bi'sa lilẓẓālimīna badalan ","translations":["And when","We said","to the Angels","Prostrate","to Adam","so they prostrated","except","Iblis","(He) was","of","the jinn","and he rebelled","against","the Command","(of) his Lord","Will you then take him","and his offspring","(as) protectors","other than Me","other than Me","while they","(are) to you","enemies","Wretched","for the wrongdoers","(is) the exchange","(50)"],"transliterationArr":["wa-idh","qul'nā","lil'malāikati","us'judū","liādama","fasajadū","illā","ib'līsa","kāna","mina","al-jini","fafasaqa","ʿan","amri","rabbihi","afatattakhidhūnahu","wadhurriyyatahu","awliyāa","min","dūnī","wahum","lakum","ʿaduwwun","bi'sa","lilẓẓālimīna","badalan",null],"verseTiming":[[1,0,610],[2,610,1460],[3,1460,4580],[4,4580,5410],[5,5410,6390],[6,6390,8389],[7,8389,10439],[8,10439,11499],[9,11499,12039],[10,12039,12439],[11,12439,13919],[12,13919,16559],[13,16559,17589],[14,17589,18169],[15,18169,18609],[16,18609,20179],[17,20179,21079],[18,21079,21359],[19,21359,22029],[20,22029,23319],[21,23319,25699],[22,25699,28909],[23,28909,31609],[24,31609,31939],[25,31939,33179],[26,33179,33899],[27,33899,34519],[28,34519,35099],[29,35099,36399],[30,36399,38089],[31,38089,39374]]}}