{"name":"18:59","price":"یہ ہیں وه بستیاں جنہیں ہم نے ان کے مظالم کی بنا پر غارت کردیا اور ان کی تباہی کی بھی ہم نے ایک میعاد مقرر کر رکھی تھی.(1)","arabic":"وَتِلۡكَ ٱلۡقُرَىٰٓ أَهۡلَكۡنَٰهُمۡ لَمَّا ظَلَمُواْ وَجَعَلۡنَا لِمَهۡلِكِهِم مَّوۡعِدٗا","category":["18 (Al-Kahf)","Al-Kahf","Surah Al-Kahf","Chapter Al-Kahf","Kahf","Surah Kahf","Chapter Kahf","Al Kahf","Surah Al Kahf","Chapter Al Kahf","Surah 18","Chapter 18","The Cave","الكَهف"],"ayahNumber":2199,"juzNumber":15,"footnotes":"(1) اس سے مراد، عاد، ثمود اور حضرت شعیب (عليه السلام) اور حضرت لوط (عليه السلام) وغیرہ کی قومیں جو اہل حجاز کے قریب اور ان کے راستوں میں ہی تھیں۔ انہیں بھی اگرچہ ان کے ظلم کے سبب ہی ہلاک کیا گیا لیکن ہلاکت سے پہلے انہیں پورا موقع دیا گیا اور جب یہ بات واضح ہوگئی کہ ان کا ظلم و طغیان اس حد کو پہنچ گیا ہے جہاں سے ہدایت کے راستے بالکل مسدود ہو جاتے ہیں اور ان سے خیر اور بھلائی کی امید باقی نہیں رہی، تو پھر ان کی مہلت عمل ختم اور تباہی کا وقت شروع ہوگیا۔ پھر انہیں حرف غلط کی طرح مٹا دیا گیا۔ یا اہل دنیا کے لئے عبرت کا نمونہ بنا دیا گیا۔ یہ دراصل اہل مکہ کو سمجھایا جا رہا ہے کہ تم ہمارے آخری پیغمبر اور اشرف الرسل حضرت محمد رسول اللہ (صلى الله عليه وسلم) کی تکذیب کر رہے ہو۔ تم یہ نہ سمجھنا کہ تمہیں مہلت مل رہی ہے تو اس کا مطلب یہ ہے کہ تمہیں کوئی پوچھنے والا نہیں بلکہ یہ مہلت تو سنت اللہ ہے، جو ایک وقت موعود تک ہر فرد گروہ اور قوم کو وہ عطا کرتا ہے جب یہ مدت ختم ہو جائے گی اور تم اپنے کفر و عناد سے باز نہیں آؤ گے تو پھر تمہارا حشر بھی اس سے مختلف نہیں ہوگا جو تم سے پہلی قوموں کا ہو چکا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"watil'ka al-qurā ahlaknāhum lammā ẓalamū wajaʿalnā limahlikihim mawʿidan ","translations":["And these","[the] towns","We destroyed them","when","they wronged","and We made","for their destruction","an appointed time","(59)"],"transliterationArr":["watil'ka","al-qurā","ahlaknāhum","lammā","ẓalamū","wajaʿalnā","limahlikihim","mawʿidan",null],"verseTiming":[[1,0,900],[2,900,3500],[3,3500,5110],[4,5110,6510],[5,6510,7510],[6,7510,8880],[7,8880,10540],[8,10540,12020],[9,12020,14775]]}}