{"name":"18:60","price":"جب کہ موسیٰ نے اپنے نوجوان(1) سے کہا کہ میں تو چلتا ہی رہوں گا یہاں تک کہ دو دریاؤں(2) کے سنگم پر پہنچوں، خواه مجھے سالہا سال چلنا پڑے.(3)","arabic":"وَإِذۡ قَالَ مُوسَىٰ لِفَتَىٰهُ لَآ أَبۡرَحُ حَتَّىٰٓ أَبۡلُغَ مَجۡمَعَ ٱلۡبَحۡرَيۡنِ أَوۡ أَمۡضِيَ حُقُبٗا","category":["18 (Al-Kahf)","Al-Kahf","Surah Al-Kahf","Chapter Al-Kahf","Kahf","Surah Kahf","Chapter Kahf","Al Kahf","Surah Al Kahf","Chapter Al Kahf","Surah 18","Chapter 18","The Cave","الكَهف"],"ayahNumber":2200,"juzNumber":15,"footnotes":"(1) نوجوان سے مراد حضرت یوشع بن نون (عليه السلام) ہیں جو موسیٰ (عليه السلام) کے وفات کے بعد ان کے جانشین بنے۔\n(2) اس مقام کی تعیین کسی یقینی ذریعہ سے نہیں ہو سکی تاہم قیاس کیا جاتا ہے کہ اس سے مراد صحرائے سینا کا وہ جنوبی راستہ ہے جہاں خلیج عقبہ اور خلیج سویز دونوں آکر ملتے ہیں اور بحر احمر میں ضم ہو جاتے ہیں۔ دوسرے مقامات جن کا ذکر مفسرین نے کیا ہے ان پر سرے سے مجمع البحرین کی تعبیر ہی صادق نہیں آتی۔\n(3) حقب، کے ایک معنی ۷۰یا ۸۰ سال اور دوسرے معنی غیر معین مدت کے ہیں یہاں یہی دوسرا معنی مراد ہے یعنی جب تک میں مجمع البحرین (جہاں دونوں سمندر ملتے ہیں) نہیں پہنچ جاؤں گا، چلتا رہوں گا اور سفر جاری رکھوں گا، چاہے کتنا بھی عرصہ لگ جائے۔ حضرت موسیٰ (عليه السلام) کو اس سفر کی ضرورت اس لئے پیش آئی کہ انہوں نے ایک موقع پر ایک سائل کے جواب میں یہ کہہ دیا کہ اس وقت مجھ سے بڑا عالم کوئی نہیں۔ اللہ تعالٰی کو ان کا یہ جملہ پسند نہیں آیا اور وحی کے ذریعہ سے انہیں مطلع کیا کہ ہمارا ایک بندہ (خضر) ہے جو تجھ سے بڑا عالم ہے۔ حضرت موسیٰ (عليه السلام) نے پوچھا کہ یا اللہ اس سے ملاقات کس طرح ہوسکتی ہے؟ اللہ تعالٰی نے فرمایا، جہاں دونوں سمندر ملتے ہیں، وہیں ہمارا وہ بندہ بھی ہوگا۔ نیز فرمایا کہ مچھلی ساتھ لے جاؤ، جہاں مچھلی تمہاری ٹوکری (زنبیل) سے نکل کر غائب ہو جائے تو سمجھ لینا کہ یہی مقام ہے (بخاری، سورہ کہف) چنانچہ اس کے حکم کے مطابق انہوں نے ایک مچھلی لی اور سفر شروع کر دیا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-idh qāla mūsā lifatāhu lā abraḥu ḥattā ablugha majmaʿa al-baḥrayni aw amḍiya ḥuquban ","translations":["And when","said","Musa","to his boy","Not","I will cease","until","I reach","the junction","(of) the two seas","or","I continue","(for) a long period","(60)"],"transliterationArr":["wa-idh","qāla","mūsā","lifatāhu","lā","abraḥu","ḥattā","ablugha","majmaʿa","al-baḥrayni","aw","amḍiya","ḥuquban",null],"verseTiming":[[1,0,720],[2,720,1475],[3,1475,2165],[4,2165,3429],[5,3429,3895],[6,3895,6197],[7,6197,8671],[8,8671,9584],[9,9584,10281],[10,10281,11485],[11,11485,12025],[12,12025,12843],[13,12843,13898]]}}