{"name":"18:65","price":"پس ہمارے بندوں میں سے ایک بندے(1) کو پایا، جسے ہم نے اپنے پاس کی خاص رحمت(2) عطا فرما رکھی تھی اور اسے اپنے پاس سے خاص(3) علم سکھا رکھا تھا.","arabic":"فَوَجَدَا عَبۡدٗا مِّنۡ عِبَادِنَآ ءَاتَيۡنَٰهُ رَحۡمَةٗ مِّنۡ عِندِنَا وَعَلَّمۡنَٰهُ مِن لَّدُنَّا عِلۡمٗا","category":["18 (Al-Kahf)","Al-Kahf","Surah Al-Kahf","Chapter Al-Kahf","Kahf","Surah Kahf","Chapter Kahf","Al Kahf","Surah Al Kahf","Chapter Al Kahf","Surah 18","Chapter 18","The Cave","الكَهف"],"ayahNumber":2205,"juzNumber":15,"footnotes":"(1) اس بندے سے مراد حضرت خضر ہیں، جیسا کہ صحیح احادیث میں وضاحت ہے۔ خضر کے معنی سرسبز اور شاداب کے ہیں، یہ ایک مرتبہ سفید زمین پر بیٹھے تو وہ حصہ زمین ان کے نیچے سے سرسبز ہو کر لہلہانے لگا، اسی وجہ سے ان کا نام خضر پڑ گیا (صحیح بخاری، تفسیر سورہ کہف)\n(2) رَحْمَۃ سے مراد مفسرین نے وہ خصوصی انعامات مراد لئے ہیں جو اللہ نے اپنے اس خاص بندے پر فرمائے اور اکثر مفسرین نے اس سے مراد نبوت لی ہے۔\n(3) اس سے علم نبوت کے علاوہ جس سے حضرت موسیٰ (عليه السلام) بھی بہرہ ور تھے، بعض تکوینی امور کا علم ہے جس اللہ تعالٰی نے صرف حضرت خضر کو نوازا تھا، حضرت موسیٰ (عليه السلام) کے پاس بھی وہ علم نہیں تھا۔ اس سے استدلال کرتے ہوئے بعض صوفیا دعویٰ کرتے ہیں کہ اللہ تعالٰی بعض لوگوں کو، جو نبی نہیں ہوتے، علم الہام سے نوازتا ہے، جو بغیر استاد کے محض فیض کے سر چشمہ کا نتیجہ ہوتا ہے اور یہ باطنی علم، شریعت کے ظاہری علم سے، جو قرآن و حدیث کی صورت میں موجود ہے، مختلف بلکہ بعض دفعہ اس کے مخالف اور معارض ہوتا ہے لیکن استدلال اس لئے صحیح نہیں کہ حضرت خضر کی بابت تو اللہ تعالٰی نے خود ان کے علم خاص دیئے جانے کی وضاحت کر دی ہے، جب کہ کسی اور کے لئے ایسی وضاحت کہیں نہیں اگر اس کو عام کر دیا جائے تو پھر ہر شعبدہ باز اس قسم کا دعویٰ کر سکتا ہے، چنانچہ اس طبقے میں یہ دعوے عام ہی ہیں۔ اس لئے ایسے دعوؤں کی کوئی حیثیت نہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"fawajadā ʿabdan min ʿibādinā ātaynāhu raḥmatan min ʿindinā waʿallamnāhu min ladunnā ʿil'man ","translations":["Then they found","a servant","from","Our servants","whom We had given","mercy","from","Us","and We had taught him","from","Us","a knowledge","(65)"],"transliterationArr":["fawajadā","ʿabdan","min","ʿibādinā","ātaynāhu","raḥmatan","min","ʿindinā","waʿallamnāhu","min","ladunnā","ʿil'man",null],"verseTiming":[[1,0,1120],[2,1120,1770],[3,1770,2830],[4,2830,5780],[5,5780,7450],[6,7450,8320],[7,8320,9410],[8,9410,11000],[9,11000,12840],[10,12840,13050],[11,13050,14920],[12,14920,16475]]}}