{"name":"18:78","price":"اس نے کہا بس یہ جدائی ہے میرے اور تیرے درمیان(1) ، اب میں تجھے ان باتوں کی اصلیت بھی بتا دوں گا جس پر تجھ سے صبر نہ ہو سکا.(2)","arabic":"قَالَ هَٰذَا فِرَاقُ بَيۡنِي وَبَيۡنِكَۚ سَأُنَبِّئُكَ بِتَأۡوِيلِ مَا لَمۡ تَسۡتَطِع عَّلَيۡهِ صَبۡرًا","category":["18 (Al-Kahf)","Al-Kahf","Surah Al-Kahf","Chapter Al-Kahf","Kahf","Surah Kahf","Chapter Kahf","Al Kahf","Surah Al Kahf","Chapter Al Kahf","Surah 18","Chapter 18","The Cave","الكَهف"],"ayahNumber":2218,"juzNumber":16,"footnotes":"(1) حضرت خضرنے کہا کہ موسیٰ (عليه السلام)، یہ تیسرا موقعہ ہے کہ تو صبر نہیں کر سکا اور اب خود تیرے کہنے کے مطابق میں تجھے ساتھ رکھنے سے معذور ہوں۔\n(2) لیکن جدائی سے قبل حضرت خضر نے تینوں واقعات کی حقیقت سے انہیں آگاہ اور باخبر کرنا ضروری خیال کیا تاکہ موسیٰ (عليه السلام) کسی مغالطے کا شکار نہ رہیں اور وہ یہ سمجھ لیں کہ علم نبوت اور ہے، جس سے انہیں نوازا گیا ہے اور بعض اہم امور کا علم اور ہے جو اللہ کی حکمت ومشیت کے تحت، حضرت خضر کو دیا گیا ہے اور اسی کے مطابق انہوں نے ایسے کام کیے جو علم شریعت کی رو سے جائز نہیں تھے اور اسی لئے حضرت موسیٰ (عليه السلام) بجا طور پر ان پر خاموش نہیں رہ سکے تھے۔ انہی اہم امور کی انجام دہی کی وجہ سے بعض اہل علم کی رائے ہے کہ حضرت خضر انسانوں میں سے نہیں تھے اور اسی لئے وہ ان کی نبوت ورسالت یا دلائل کے بیچ میں نہیں پڑتے کیونکہ یہ سارے مناصب تو انسانوں کے ساتھ ہی خاص ہیں۔ وہ کہتے ہیں کہ وہ فرشتہ تھے، لیکن اگر اللہ تعالٰی اپنے کسی نبی کو بعض اہم امور سے مطلع کر کے ان کے ذریعے سے کام کروا لے، تو اس میں بھی کوئی ناممکن بات نہیں ہے۔ جب وہ صاحب وحی خود اس امر کی وضاحت کر دے کہ میں نے یہ کام اللہ کے حکم سے ہی کئے ہیں تو گو بظاہر وہ خلاف شریعت ہی نظر آتے ہوں، لیکن جب ان کا تعلق ہی اہم امور سے ہے تو وہاں جواز اور عدم جواز کی حیثیت غیر ضروری ہے۔ جیسے تکوینی احکامات کے تھے کوئی بیمار ہوتا ہے، کوئی مرتا ہے، کسی کا کاروبار تباہ ہو جاتا ہے، قوموں پر عذاب آتا ہے، ان میں سے بعض کام بعض دفعہ بہ اذن الٰہی فرشتے ہی کرتے ہیں، تو جس طرح یہ امور آج تک کسی کو خلاف شریعت نظر نہیں آئے۔ اسی طرح حضرت خضر کے ذریعے سے و قوع پذیر ہونے والے واقعات کا تعلق بھی چوں کہ اہم امور سے ہے اس لئے انہیں شریعت کی ترازو میں تولنا ہی غیر صحیح ہے۔ البتہ اب وحی ونبوت کا سلسلہ ختم ہو جانے کے بعد کسی شخص کا اس قسم کا دعویٰ ہرگز صحیح اور قابل تسلیم نہیں ہوگا جیسا کہ حضرت خضر سے منقول ہے کیونکہ حضرت خضر کا معاملہ تو آیت قرآنی سے ثابت ہے، اس لئے مجال انکار نہیں۔ لیکن اب جو بھی اس قسم کا دعویٰ یا عمل کرے گا، اس کا انکار لازمی اور ضروری ہے کیونکہ اب وہ یقینی ذریعہ علم موجود نہیں ہے جس سے اس کے دعوے اور عمل کی حقیقت واضح ہو سکے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qāla hādhā firāqu baynī wabaynika sa-unabbi-uka bitawīli mā lam tastaṭiʿ ʿalayhi ṣabran ","translations":["He said","This","(is) parting","between me","and between you","I will inform you","of (the) interpretation","(of) what","not","you were able","on it","(to have) patience","(78)"],"transliterationArr":["qāla","hādhā","firāqu","baynī","wabaynika","sa-unabbi-uka","bitawīli","mā","lam","tastaṭiʿ","ʿalayhi","ṣabran",null],"verseTiming":[[1,0,740],[2,740,1520],[3,1520,2490],[4,2490,3290],[5,3290,4710],[6,4710,6200],[7,6200,7530],[8,7530,7960],[9,7960,8320],[10,8320,9420],[11,9420,10240],[12,10240,11675]]}}