{"name":"18:77","price":"پھر دونوں چلے ایک گاؤں والوں کے پاس آکر ان سے کھانا طلب کیا تو انہوں نے ان کی مہمانداری سے صاف انکار کر دیا(1) ، دونوں نے وہاں ایک دیوار پائی جو گراہی چاہتی تھی، اس نے اسے ٹھیک اور درست (2)کر دیا، موسیٰ (علیہ السلام) کہنے لگے اگر آپ چاہتے تو اس پر اجرت لے لیتے.(3)","arabic":"فَٱنطَلَقَا حَتَّىٰٓ إِذَآ أَتَيَآ أَهۡلَ قَرۡيَةٍ ٱسۡتَطۡعَمَآ أَهۡلَهَا فَأَبَوۡاْ أَن يُضَيِّفُوهُمَا فَوَجَدَا فِيهَا جِدَارٗا يُرِيدُ أَن يَنقَضَّ فَأَقَامَهُۥۖ قَالَ لَوۡ شِئۡتَ لَتَّخَذۡتَ عَلَيۡهِ أَجۡرٗا","category":["18 (Al-Kahf)","Al-Kahf","Surah Al-Kahf","Chapter Al-Kahf","Kahf","Surah Kahf","Chapter Kahf","Al Kahf","Surah Al Kahf","Chapter Al Kahf","Surah 18","Chapter 18","The Cave","الكَهف"],"ayahNumber":2217,"juzNumber":16,"footnotes":"(1) یعنی یہ بخیلوں کی بستی تھی کہ مہمانوں کی مہمان نوازی سے انکار کر دیا، دراں حالیکہ مسافروں کو کھانا کھلانا اور مہمان نوازی کرنا ہر شریعت کی اخلاقی تعلیمات کا اہم حصہ رہا ہے۔ نبی (صلى الله عليه وسلم) نے بھی مہمان نوازی اور اکرام ضیف کو ایمان کا تقاضا قرار دیا ہے۔ فرمایا :«مَنْ كَانَ يُؤْمِنُ بِاللهِ وَالْيَوْمِ الآخِرِ، فَلْيُكْرِمْ ضَيْفَهُ» (فيض القدير شرح الجامع الصغير: 5/209) ”جو اللہ اور یوم آخرت پر ایمان رکھتا ہے، اسے چاہیے کہ مہمان کی عزت وتکریم کرے“۔\n(2) حضرت خضر نے اس دیوار کو ہاتھ لگایا اور اللہ کے حکم سے معجزانہ طور پر سیدھی ہوگئی۔ جیسا کہ صحیح بخاری کی روایت سے واضح ہے۔\n(3) حضرت موسیٰ (عليه السلام)، جو اہل بستی کے رویے سے پہلے ہی کبیدہ خاطر تھے، حضرت خضر کے بلا معاوضہ احسان پر خاموش نہ رہ سکے اور بول پڑے کہ جب ان بستی والوں نے ہماری مسافرت، ضرورت مندی اور شرف وفضل کسی چیز کا بھی لحاظ نہیں کیا تو یہ لوگ کب اس لائق ہیں کہ ان کے ساتھ احسان کیا جائے؟","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"fa-inṭalaqā ḥattā idhā atayā ahla qaryatin is'taṭʿamā ahlahā fa-abaw an yuḍayyifūhumā fawajadā fīhā jidāran yurīdu an yanqaḍḍa fa-aqāmahu qāla law shi'ta lattakhadhta ʿalayhi ajran ","translations":["So they set out","until","when","they came","(to the) people","(of) a town","they asked for food","(from) its people","but they refused","to","offer them hospitality","Then they found","in it","a wall","(that) want(ed)","to","collapse","so he set it straight","He said","If","you wished","surely you (could) have taken","for it","a payment","(77)"],"transliterationArr":["fa-inṭalaqā","ḥattā","idhā","atayā","ahla","qaryatin","is'taṭʿamā","ahlahā","fa-abaw","an","yuḍayyifūhumā","fawajadā","fīhā","jidāran","yurīdu","an","yanqaḍḍa","fa-aqāmahu","qāla","law","shi'ta","lattakhadhta","ʿalayhi","ajran",null],"verseTiming":[[1,0,2260],[2,2260,4810],[3,4810,7060],[4,7060,9140],[5,9140,9810],[6,9810,10860],[7,10860,13380],[8,13380,14550],[9,14550,15290],[10,15290,18810],[11,18810,19860],[12,19860,20750],[13,20750,20980],[14,20980,23520],[15,23520,24680],[16,24680,25490],[17,25490,26570],[18,26570,28450],[19,28450,28760],[20,28760,31280],[21,31280,33120],[22,33120,33780],[23,33780,34110],[24,34110,34800],[25,34800,36130],[26,36130,37000],[27,37000,38485]]}}