{"name":"18:83","price":"آپ سے ذوالقرنین کا واقعہ یہ لوگ دریافت کر رہے ہیں(1) ، آپ کہہ دیجئے کہ میں ان کا تھوڑا سا حال تمہیں پڑھ کر سناتا ہوں.","arabic":"وَيَسۡـَٔلُونَكَ عَن ذِي ٱلۡقَرۡنَيۡنِۖ قُلۡ سَأَتۡلُواْ عَلَيۡكُم مِّنۡهُ ذِكۡرًا","category":["18 (Al-Kahf)","Al-Kahf","Surah Al-Kahf","Chapter Al-Kahf","Kahf","Surah Kahf","Chapter Kahf","Al Kahf","Surah Al Kahf","Chapter Al Kahf","Surah 18","Chapter 18","The Cave","الكَهف"],"ayahNumber":2223,"juzNumber":16,"footnotes":"(1) یہ مشرکین کے اس تیسرے سوال کا جواب ہے جو یہودیوں کے کہنے پر انہوں نے نبی (صلى الله عليه وسلم) سے کئے تھے، ذوالقرنین کے لفظی معنی دو سینگوں والے کے ہیں۔ یہ نام اس لئے پڑا کہ فی الواقع اس کے سر پر دو سینگ تھے یا اس لئے کہ اس نے مشرق ومغرب دنیا کے دونوں کناروں پر پہنچ کر سورج کی قرن یعنی شعاع کا مشاہدہ کیا، بعض کہتے ہیں کہ اس کے سر پر بالوں کی دو لٹیں تھیں، قرن بالوں کی لٹ کو بھی کہتے ہیں۔ یعنی دو لٹوں دو مینڈھیوں یا دو زلفوں والا۔ قدیم مفسرین نے بالعموم اس کا مصداق سکندر رومی کو قرار دیا ہے جس کی فتوحات کا دائرہ مشرق ومغرب تک پھیلا ہوا تھا۔ لیکن جدید مفسرین جدید تاریخی معلومات کی روشنی میں اس سے اتفاق نہیں کرتے بالخصوص مولانا ابوالکلام آزاد مرحوم نے اس پر جو داد تحقیق دی ہے اور اس شخص کی دریافت میں جو محنت و کاوش کی ہے، وہ نہایت قابل قدر ہے۔ ان کی تحقیق کا خلاصہ یہ ہے (1)۔ کہ اس ذوالقرنین کی بابت قرآن نے صراحت کی ہے کہ وہ ایسا حکمران تھا، جس کو اللہ نے اسباب و وسائل کی فراوانی سے نوازا تھا۔ (2)۔ وہ مشرقی اور مغربی ممالک کو فتح کرتا ہوا، ایک ایسے پہاڑی درے پر پہنچا جس کی دوسری طرف یاجوج اور ماجوج تھے۔ (3)۔ اس نے وہاں یاجوج ماجوج کا راستہ بند کرنے کے لئے ایک نہایت محکم بند تعمیر کیا۔ (4،5) وہ عادل، اللہ کو ماننے والا اور آخرت پر ایمان رکھنے والا تھا۔ (6)۔ وہ نفس پرست اور مال و دولت کا حریص نہیں تھا۔ مولانا مرحوم فرماتے ہیں کہ ان خصوصیات کا حامل صرف فارس کا وہ عظیم حکمران ہے جسے یونانی سائرس، عبرانی خورس، اور عرب کے خسرو کے نام سے پکارتے ہیں، اس کا دور حکمرانی 539 قبل مسیح ہے۔ نیز فرماتے ہیں1838ء میں سائرس کے ایک مجسّمے کا بھی انکشاف ہوا جس میں سائرس کا جسم، اس طرح دکھایا گیا ہے کہ اس کے دونوں طرف عقاب کی طرح پر نکلے ہوئے ہیں اور سر پر مینڈھے کی طرح دو سینگ ہیں۔ (تفصیل کے لئے ملاحظہ ہو تفسیر ”ترجمان القرآن“ ج1، ص-399- 430، طبع قدیم) واللہ اعلم بالصواب۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wayasalūnaka ʿan dhī al-qarnayni qul sa-atlū ʿalaykum min'hu dhik'ran ","translations":["And they ask you","about","Dhul-qarnain","Dhul-qarnain","Say","I will recite","to you","about him","a remembrance","(83)"],"transliterationArr":["wayasalūnaka","ʿan","dhī","al-qarnayni","qul","sa-atlū","ʿalaykum","min'hu","dhik'ran",null],"verseTiming":[[1,0,1770],[2,1770,2810],[3,2810,2960],[4,2960,4290],[5,4290,4700],[6,4700,5870],[7,5870,6800],[8,6800,8440],[9,8440,9795]]}}