{"name":"18:86","price":"یہاں تک کہ سورج ڈوبنے کی جگہ پہنچ گیا اور اسے ایک دلدل کےچشمے میں غروب ہوتا ہوا پایا(1) اور اس چشمے کے پاس ایک قوم کو بھی پایا، ہم نے فرما دیا(2) کہ اے ذوالقرنین! یا تو تو انہیں تکلیف پہنچائے یا ان کے بارے میں تو کوئی بہترین روش اختیار کرے.(3)","arabic":"حَتَّىٰٓ إِذَا بَلَغَ مَغۡرِبَ ٱلشَّمۡسِ وَجَدَهَا تَغۡرُبُ فِي عَيۡنٍ حَمِئَةٖ وَوَجَدَ عِندَهَا قَوۡمٗاۖ قُلۡنَا يَٰذَا ٱلۡقَرۡنَيۡنِ إِمَّآ أَن تُعَذِّبَ وَإِمَّآ أَن تَتَّخِذَ فِيهِمۡ حُسۡنٗا","category":["18 (Al-Kahf)","Al-Kahf","Surah Al-Kahf","Chapter Al-Kahf","Kahf","Surah Kahf","Chapter Kahf","Al Kahf","Surah Al Kahf","Chapter Al Kahf","Surah 18","Chapter 18","The Cave","الكَهف"],"ayahNumber":2226,"juzNumber":16,"footnotes":"(1) عَيْنٍ سے مراد چشمہ یا سمندر ہے حَمِئَةٍ، کیچڑ، دلدل، وَجَدَ (پایا) یعنی دکھایا محسوس کیا مطلب یہ ہے کہ ذوالقرنین جب مغربی جہت میں ملک پر ملک فتح کرتا ہوا، اس مقام پر پہنچ گیا جہاں آخری آبادی تھی وہاں گدلے پانی کا چشمہ یا سمندر تھا جو نیچے سے سیاہ معلوم ہوتا تھا اسے ایسا محسوس ہوا کہ گویا سورج اس چشمے میں ڈوب رہا ہے۔ ساحل سمندر سے دور سے، جس کے آگے حد نظر تک کچھ نہ ہو، غروب شمس کا نظارہ کرنے والوں کو ایسا محسوس ہوتا ہے کہ سورج سمندر میں یا زمین میں ڈوب رہا ہے حالانکہ وہ اپنے مقام آسمان پر ہی ہوتا ہے۔\n(2) قُلْنَا (ہم نے کہا) بذریعہ وحی، اسی سے بعض علماء نے نبوت پر ثبوت کیا ہے اور جو ان کی نبوت کے قائل نہیں ہیں، وہ کہتے ہیں کہ اس وقت کے پیغمبر کے ذریعے سے ہم نے اس سے کہا۔\n(3) یعنی ہم نے اس قوم پر غلبہ دے کر اختیار دے دیا کہ چاہے تو اسے قتل کرے اور قیدی بنا لے یا فدیہ لے کر بطور احسان چھوڑ دے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"ḥattā idhā balagha maghriba al-shamsi wajadahā taghrubu fī ʿaynin ḥami-atin wawajada ʿindahā qawman qul'nā yādhā al-qarnayni immā an tuʿadhiba wa-immā an tattakhidha fīhim ḥus'nan ","translations":["Until","when","he reached","(the) setting place","(of) the sun","he found it","setting","in","a spring","(of) dark mud","and he found","near it","a community","We said","O Dhul-qarnain","O Dhul-qarnain","Either","[that]","you punish","or","[that]","you take","[in] them","(with) goodness","(86)"],"transliterationArr":["ḥattā","idhā","balagha","maghriba","al-shamsi","wajadahā","taghrubu","fī","ʿaynin","ḥami-atin","wawajada","ʿindahā","qawman","qul'nā","yādhā","al-qarnayni","immā","an","tuʿadhiba","wa-immā","an","tattakhidha","fīhim","ḥus'nan",null],"verseTiming":[[1,0,2360],[2,2360,2980],[3,2980,3670],[4,3670,4360],[5,4360,5330],[6,5330,6320],[7,6320,7250],[8,7250,7700],[9,7700,8520],[10,8520,9750],[11,9750,11040],[12,11040,12910],[13,12910,14420],[14,14420,15260],[15,15260,15900],[16,15900,17260],[17,17260,20049],[18,20049,20939],[19,20939,22129],[20,22129,24969],[21,24969,25749],[22,25749,27029],[23,27029,27859],[24,27859,29054]]}}