{"name":"18:9","price":"کیا تو اپنے خیال میں غار اور کتبے والوں کو ہماری نشانیوں میں سے کوئی بہت عجیب نشانی سمجھ رہا ہے؟(1)","arabic":"أَمۡ حَسِبۡتَ أَنَّ أَصۡحَٰبَ ٱلۡكَهۡفِ وَٱلرَّقِيمِ كَانُواْ مِنۡ ءَايَٰتِنَا عَجَبًا","category":["18 (Al-Kahf)","Al-Kahf","Surah Al-Kahf","Chapter Al-Kahf","Kahf","Surah Kahf","Chapter Kahf","Al Kahf","Surah Al Kahf","Chapter Al Kahf","Surah 18","Chapter 18","The Cave","الكَهف"],"ayahNumber":2149,"juzNumber":15,"footnotes":"(1) یعنی یہ واحد بڑی اور عجیب نشانی نہیں ہے۔ بلکہ ہماری ہر نشانی ہی عجیب ہے۔ یہ آسمان و زمین کی پیدائش اور اس کا نظام، شمس و قمر اور کواکب کی تسخیر، رات اور دن کا آنا جانا اور دیگر بیشمار نشانیاں، کیا تعجب انگیز نہیں ہیں۔ کَھْف اس غار کو کہتے ہیں جو پہاڑ میں ہوتا ہےٍ، بعض کے نزدیک اس بستی کا نام ہے جہاں سے یہ نوجوان گئے تھے، بعض کہتے ہیں اس پہاڑ کا نام ہے جس میں غار واقع تھا بعض کہتے ہیں رَقِیْم بمعنی مَرْقُوْم ہے اور یہ ایک تختی ہے لوہے یا سیسے کی، جس میں اصحاب کہف کے نام لکھے ہوئے ہیں۔ اسے رقیم اس لئے کہا گیا ہے کہ اس پر نام تحریر ہیں۔ حالیہ تحقیق سے معلوم ہوا کہ پہلی بات زیادہ صحیح ہے۔ جس پہاڑ میں یہ غار واقع ہے اس کے قریب ہی ایک آبادی ہے جسے اب الرقیب کہا جاتا ہے جو مرور زمانہ کے سبب الرقیم کی بگڑی ہوئی شکل ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"am ḥasib'ta anna aṣḥāba al-kahfi wal-raqīmi kānū min āyātinā ʿajaban ","translations":["Or","have you thought","that","(the) companions","(of) the cave","and the inscription","were","among","Our Signs","a wonder","(9)"],"transliterationArr":["am","ḥasib'ta","anna","aṣḥāba","al-kahfi","wal-raqīmi","kānū","min","āyātinā","ʿajaban",null],"verseTiming":[[1,0,490],[2,490,1440],[3,1440,2310],[4,2310,3290],[5,3290,4260],[6,4260,5450],[7,5450,6240],[8,6240,6640],[9,6640,8050],[10,8050,9465]]}}