{"name":"18:98","price":"کہا یہ صرف میرے رب کی مہربانی ہے ہاں جب میرے رب کا وعده آئے گا تو اسے زمین بوس کر دے گا(1) ، بیشک میرے رب کا وعده سچا اور حق ہے.","arabic":"قَالَ هَٰذَا رَحۡمَةٞ مِّن رَّبِّيۖ فَإِذَا جَآءَ وَعۡدُ رَبِّي جَعَلَهُۥ دَكَّآءَۖ وَكَانَ وَعۡدُ رَبِّي حَقّٗا","category":["18 (Al-Kahf)","Al-Kahf","Surah Al-Kahf","Chapter Al-Kahf","Kahf","Surah Kahf","Chapter Kahf","Al Kahf","Surah Al Kahf","Chapter Al Kahf","Surah 18","Chapter 18","The Cave","الكَهف"],"ayahNumber":2238,"juzNumber":16,"footnotes":"(1) یعنی یہ دیوار اگرچہ بڑی مضبوط بنا دی گئی جس کے اوپر چڑھ کر اس میں سوراخ کر کے یاجوج ماجوج کا ادھر آنا ممکن نہیں ہے لیکن جب میرے رب کا وعدہ آ جائے گا، تو وہ اسے ریزہ ریزہ کر کے زمین کے برابر کر دے گا، اس وعدے سے مراد قیامت کے قریب یاجوج و ماجوج کا ظہور ہے جیسا کہ احادیث میں ہے۔ مثلًا ایک حدیث میں نبی (صلى الله عليه وسلم) نے اس دیوار کے تھوڑے سے سوراخ کو فتنے کے قریب ہونے سے تعبیر فرمایا (صحیح بخاری، نمبر 3346 و مسلم، نمبر2208) ایک اور حدیث میں آتا ہے کہ وہ ہر روز اس دیوار کو کھودتے ہیں اور پھر کل کے لئے چھوڑ دیتے ہیں، لیکن جب اللہ کی مشیت ان کے باہر نکلنے کی ہوگی تو پھر وہ کہیں گے کل ان شا اللہ اسکو کھو دیں گے اور پھر دوسرے دن وہ اس سے نکلنے میں کامیاب ہو جائیں گے۔ زمین میں فساد پھیلائیں گے حتٰی کے لوگ قلعہ بند ہو جائیں گے، یہ آسمانوں پر تیر پھینکیں گے جو خون آلودہ لوٹیں گے، بالآخر اللہ تعالٰی ان کی گدیوں پر ایسا کیڑا پیدا فرما دے گا جس سے ان کی ہلاکت واقع ہو جائے گی۔ (مسند أحمد 12/ 511، جامع ترمذي نمبر 3153، والأحاديث الصحيحة للألباني، نمبر1735) صحیح مسلم میں نواس بن سمعان (رضي الله عنه) کی روایت میں صراحت ہے کہ یاجوج و ماجوج کا ظہور حضرت عیسیٰ (عليه السلام) کے نزول کے بعد ان کی موجودگی میں ہوگا۔( كتاب الفتن وأشراط الساعة، باب ذكر الدجال) جس سے ان حضرات کی تردید ہو جاتی ہے، جو کہتے ہیں کہ تاتاریوں کا مسلمانوں پر حملہ، یا منگول ترک جن میں چنگیز بھی تھا یا روسی یا چینی قومیں یہی یاجوج و ماجوج ہیں، جن کا ظہور ہو چکا۔ یا مغربی قومیں ان کا مصداق ہیں کہ پوری دنیا میں ان کا غلبہ و تسلط ہے۔ یہ سب باتیں غلط ہیں کیونکہ ان کے غلبے سے سیاسی غلبہ مراد نہیں ہے بلکہ قتل وغارت گری اور شرو وفساد کا وہ عارضی غلبہ ہے جس کا مقابلہ کرنے کی طاقت مسلمانوں میں نہیں ہوگی، تاہم پھر وبائی مرض سے سب کے سب آن واحد میں لقمہ اجل بن جائیں گے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qāla hādhā raḥmatun min rabbī fa-idhā jāa waʿdu rabbī jaʿalahu dakkāa wakāna waʿdu rabbī ḥaqqan ","translations":["He said","This","(is) a mercy","from","my Lord","But when","comes","(the) Promise","(of) my Lord","He will make it","level","And is","(the) Promise","(of) my Lord","true","(98)"],"transliterationArr":["qāla","hādhā","raḥmatun","min","rabbī","fa-idhā","jāa","waʿdu","rabbī","jaʿalahu","dakkāa","wakāna","waʿdu","rabbī","ḥaqqan",null],"verseTiming":[[1,0,730],[2,730,1510],[3,1510,2510],[4,2510,3540],[5,3540,5070],[6,5070,5860],[7,5860,8150],[8,8150,8800],[9,8800,9600],[10,9600,10610],[11,10610,13920],[12,13920,14830],[13,14830,15430],[14,15430,16330],[15,16330,17575]]}}