{"name":"19:15","price":"اس پر سلام ہے جس دن وه پیدا ہوا اور جس دن وه مرے اور جس دن وه زنده کرکے اٹھایا جائے.(1)","arabic":"وَسَلَٰمٌ عَلَيۡهِ يَوۡمَ وُلِدَ وَيَوۡمَ يَمُوتُ وَيَوۡمَ يُبۡعَثُ حَيّٗا","category":["19 (Maryam)","Maryam","Surah Maryam","Chapter Maryam","Surah 19","Chapter 19","Mary","مَريَم"],"ayahNumber":2265,"juzNumber":16,"footnotes":"(1) تین مواقع انسان کے لئے سخت ودہشت ناک ہو تے ہیں، 1۔ جب انسان رحم مادر سے باہر آتا ہے، 2۔ جب موت کا شکنجہ اسے اپنی گرفت میں لیتا ہے،3۔ اور جب اسے قبر سے زندہ کر کے اٹھایا جائے گا تو وہ اپنے کو میدان محشر کی ہولناکیوں میں گھرا ہوا پائے گا۔ اللہ تعالٰی نے فرمایا کہ ان تینوں جگہوں میں اس کیلئے ہماری طرف سے سلامتی اور امان ہے۔ بعض اہل بدعت اس آیت سے یوم ولادت پر ”عید میلاد“ کا جواز ثابت کرتے ہیں لیکن کوئی ان سے پوچھے تو پھر یوم وفات پر ”عید وفات“ یا ”عید ممات“ بھی منانی ضروری ہوئی کیونکہ جس طرح یوم ولادت کے لیے سلام ہے یوم وفات کے لیے بھی سلام ہے اگر محض لفظ ”سلام“ سے عید میلاد کا اثبات ممکن ہے تو پر اسی لفظ سے عید وفات کا بھی اثبات ہوتا ہے لیکن یہاں وفات کی عید تو کجا، سرے سے وفات وممات ہی کا انکار ہے یعنی وفات نبوی (صلى الله عليه وسلم) کا انکار کر کے نص قرآنی کا تو انکار کرتے ہی ہیں خود اپنے استدلال کی رو سے بھی آیت کے ایک جز کو تو مانتے ہیں اور اسی آیت کے دوسرے جز سے ان ہی کے استدلال کی روشنی میں جو ثابت ہوتا ہے اس کا انکار ہے۔ «اَفَتُؤْمِنُوْنَ بِبَعْضِ الْكِتٰبِ وَتَكْفُرُوْنَ بِبَعْضٍ» ( البقرۃ:85) ”کیا بعض احکام پر ایمان رکھتے ہو اور بعض کے ساتھ کفر کرتے ہو؟“۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wasalāmun ʿalayhi yawma wulida wayawma yamūtu wayawma yub'ʿathu ḥayyan ","translations":["And peace be","upon him","(the) day","he was born","and (the) day","he dies","and (the) day","he will be raised","alive","(15)"],"transliterationArr":["wasalāmun","ʿalayhi","yawma","wulida","wayawma","yamūtu","wayawma","yub'ʿathu","ḥayyan",null],"verseTiming":[[1,0,1330],[2,1330,2280],[3,2280,2920],[4,2920,3590],[5,3590,4510],[6,4510,5510],[7,5510,6350],[8,6350,7370],[9,7370,9405]]}}