{"name":"19:17","price":"اور ان لوگوں کی طرف سے پرده کر لیا(1) ، پھر ہم نے اس کے پاس اپنی روح (جبرائیل علیہ السلام) کو بھیجا پس وه اس کے سامنے پورا آدمی بن کر ﻇاہر ہوا.(2)","arabic":"فَٱتَّخَذَتۡ مِن دُونِهِمۡ حِجَابٗا فَأَرۡسَلۡنَآ إِلَيۡهَا رُوحَنَا فَتَمَثَّلَ لَهَا بَشَرٗا سَوِيّٗا","category":["19 (Maryam)","Maryam","Surah Maryam","Chapter Maryam","Surah 19","Chapter 19","Mary","مَريَم"],"ayahNumber":2267,"juzNumber":16,"footnotes":"(1) یہ علیحدگی اور حجاب (پردہ) اللہ کی عبادت کی غرض سے تھا تاکہ انہیں کوئی نہ دیکھے اور یکسوئی حاصل رہے یا طہارت حیض کے لئے۔ اور مشرقی مکان سے مراد بیت المقدس کی مشرقی جانب ہے۔\n(2) رُوْح سے مراد حضرت جبرائیل (عليه السلام) ہیں، جنہیں کامل انسانی شکل میں حضرت مریم کی طرف بھیجا گیا، حضرت مریم نے جب دیکھا کہ ایک شخص بے دھڑک اندر آ گیا ہے تو ڈر گئیں کہ یہ بری نیت سے نہ آیا ہو۔ حضرت جبرائیل (عليه السلام) نے کہا میں وہ نہیں ہوں جو تو گمان کر رہی ہے بلکہ تیرے رب کا قاصد ہوں اور یہ خوشخبری دینے آیا ہوں کہ اللہ تعالٰی تجھے لڑکا عطا فرمائے گا، بعض قرائتوں میں لِیَھَبَ صیغہ غائب ہے۔ متکلم کا صیغہ (جو موجودہ قراءت میں ہے) اس لئے بولا کہ ظاہری اسباب کے لحاظ سے حضرت جبرائیل (عليه السلام) نے ان کے گریبان میں پھونک ماری تھی جس سے باذن اللہ ان کو حمل ٹھہر گیا تھا۔ اس لئے ہبہ کا تناسب اپنی طرف منسوب کر لیا۔ یا یہ بھی ہو سکتا ہے کہ اللہ تعالٰی ہی کا قول ہو اور یہاں حکایتًا نقل ہوا ہو۔ اس اعتبار سے تقدیر کلام یوں ہوگی۔ «أَرْسَلَنِي، يَقُولُ لَكِ أَرْسَلْتُ رَسُولِي إِلَيْكِ لأَهَبَ لَكِ» (أيسر التفاسير) ”یعنی اللہ نے مجھے تیرے لئے یہ پیغام دے کر بھیجا ہے کہ میں نے تیری طرف اپنا قاصد یہ بتلانے کے لئے بھیجا ہے کہ میں تجھے ایک پاکیزہ بچہ عطا کروں گا“ اس طرح حذف اور تقدیر کلام قرآن میں کئی جگہ ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"fa-ittakhadhat min dūnihim ḥijāban fa-arsalnā ilayhā rūḥanā fatamathala lahā basharan sawiyyan ","translations":["Then she took","from them","from them","a screen","Then We sent","to her","Our Spirit","then he assumed for her the likeness","then he assumed for her the likeness","(of) a man","well-proportioned","(17)"],"transliterationArr":["fa-ittakhadhat","min","dūnihim","ḥijāban","fa-arsalnā","ilayhā","rūḥanā","fatamathala","lahā","basharan","sawiyyan",null],"verseTiming":[[1,0,1310],[2,1310,1640],[3,1640,3370],[4,3370,4350],[5,4350,8270],[6,8270,9340],[7,9340,10610],[8,10610,13910],[9,13910,14980],[10,14980,15990],[11,15990,17490],[12,17490,18080],[13,18080,19380],[14,19380,20735]]}}