{"name":"19:37","price":"پھر یہ فرقے آپس میں اختلاف کرنے لگے(1) ، پس کافروں کے لئے ویل ہے ایک بڑے (سخت) دن کی حاضری سے.(2)","arabic":"فَٱخۡتَلَفَ ٱلۡأَحۡزَابُ مِنۢ بَيۡنِهِمۡۖ فَوَيۡلٞ لِّلَّذِينَ كَفَرُواْ مِن مَّشۡهَدِ يَوۡمٍ عَظِيمٍ","category":["19 (Maryam)","Maryam","Surah Maryam","Chapter Maryam","Surah 19","Chapter 19","Mary","مَريَم"],"ayahNumber":2287,"juzNumber":16,"footnotes":"(1) یہاں الاحزاب سے مراد کتاب کے فرقے اور خود عیسائیوں کے فرقے ہیں۔ جنہوں نے حضرت عیسیٰ (عليه السلام) کے بارے میں باہم اختلاف کیا۔ یہود نے کہا کہ وہ جادوگر اور(نعوذ باللہ) ولد الزنا یعنی یوسف نجار کے بیٹے ہیں۔ نصاریٰ کے نسطوریہ فرقے نے کہا کہ وہ ابن اللہ ہیں۔ ملکیہ یا سلطانیہ (کیتھولک) فرقے نے کہا وہ ثَالِثُ ثَلاثَةٍ (تین خداؤں میں سے تیسرے) ہیں اور تیسرے فرقے یعقوبیہ (آرتھوڈکس) نے کہا، وہ اللہ ہیں۔ پس یہودیوں نے تفریط اور تقصیر کی عیسائیوں نے افراط وغلو (الیسرا لتفاسیر، فتح القدیر)\n(2) ان کافروں کے لئے جنہوں نے عیسیٰ (عليه السلام) کے بارے میں اس طرح اختلاف اور افراط کا ارتکاب کیا، قیامت والے دن جب وہاں حاضر ہوں گے، ہلاکت ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"fa-ikh'talafa al-aḥzābu min baynihim fawaylun lilladhīna kafarū min mashhadi yawmin ʿaẓīmin ","translations":["But differed","the sects","from among them","from among them","so woe","to those who","disbelieve","from","(the) witnessing","(of) a Day","great","(37)"],"transliterationArr":["fa-ikh'talafa","al-aḥzābu","min","baynihim","fawaylun","lilladhīna","kafarū","min","mashhadi","yawmin","ʿaẓīmin",null],"verseTiming":[[1,0,1120],[2,1120,2560],[3,2560,3710],[4,3710,5010],[5,5010,5960],[6,5960,7500],[7,7500,8630],[8,8630,9070],[9,9070,9910],[10,9910,11440],[11,11440,12450],[12,12450,12800],[13,12800,14730],[14,14730,15520],[15,15520,17835]]}}