{"name":"19:39","price":"تو انہیں اس رنج وافسوس کے دن(1) کا ڈر سنا دے جبکہ کام انجام کو پہنچا دیا جائے گا(2)، اور یہ لوگ غفلت اور بے ایمانی میں ہی ره جائیں گے.","arabic":"وَأَنذِرۡهُمۡ يَوۡمَ ٱلۡحَسۡرَةِ إِذۡ قُضِيَ ٱلۡأَمۡرُ وَهُمۡ فِي غَفۡلَةٖ وَهُمۡ لَا يُؤۡمِنُونَ","category":["19 (Maryam)","Maryam","Surah Maryam","Chapter Maryam","Surah 19","Chapter 19","Mary","مَريَم"],"ayahNumber":2289,"juzNumber":16,"footnotes":"(1) روز قیامت کو یوم حسرت کہا، اس لئے کہ اس روز سب ہی حسرت کریں گے۔ بدکار حسرت کریں گے کہ کاش انہوں نے برائیاں نہ کی ہوتیں اور نیکوکار اس بات پر حسرت کریں گے کہ انہوں نے اور زیادہ نیکیاں کیوں نہیں کمائیں؟۔\n(2) یعنی حساب کتاب کر کے صحیفے لپیٹ دیئے جائیں گے اور جنتی جنت میں اور جہنمی جہنم میں چلے جائیں گے۔ حدیث میں آتا ہے کہ اس کے بعد موت کو ایک مینڈھے کی شکل میں لایا جائے گا اور جنت اور دوزخ کے درمیان کھڑا کر دیا جائے گا، جنتیوں اور دوزخیوں دونوں سے پوچھا جائے گا، اسے پہچانتے ہو، یہ کیا ہے؟ وہ کہیں گے، ہاں یہ موت ہے پھر ان کے سامنے اسے ذبح کر دیا جائے گا اور اعلان کر دیا جائے گا کہ اہل جنت! تمہارے لئے جنت کی زندگی ہمیشہ کے لئے ہے، اب موت نہیں آئے گی۔ دوزخیوں سے کہا جائے گا۔ اے دوزخیو! تمہارے لئے دوزخ کا عذاب دائمی ہے۔ اب موت نہیں آئے گی (صحيح بخاري- سورة مريم، ومسلم، كتاب الجنة، باب النار يدخلها الجبارون .....)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-andhir'hum yawma al-ḥasrati idh quḍiya al-amru wahum fī ghaflatin wahum lā yu'minūna ","translations":["And warn them","(of the) Day","(of) the Regret","when","has been decided","the matter","And they","(are) in","heedlessness","and they","(do) not","believe","(39)"],"transliterationArr":["wa-andhir'hum","yawma","al-ḥasrati","idh","quḍiya","al-amru","wahum","fī","ghaflatin","wahum","lā","yu'minūna",null],"verseTiming":[[1,0,2130],[2,2130,2800],[3,2800,4040],[4,4040,4490],[5,4490,5140],[6,5140,6160],[7,6160,6760],[8,6760,7250],[9,7250,8980],[10,8980,9800],[11,9800,10400],[12,10400,13595]]}}