{"name":"19:59","price":"پھر ان کے بعد ایسے ناخلف پیدا ہوئے کہ انہوں نے نماز ضائع کردی اور نفسانی خواہشوں کے پیچھے پڑ گئے، سو ان کا نقصان ان کے آگے آئے گا.(1)","arabic":"۞ فَخَلَفَ مِنۢ بَعۡدِهِمۡ خَلۡفٌ أَضَاعُواْ ٱلصَّلَوٰةَ وَٱتَّبَعُواْ ٱلشَّهَوَٰتِۖ فَسَوۡفَ يَلۡقَوۡنَ غَيًّا","category":["19 (Maryam)","Maryam","Surah Maryam","Chapter Maryam","Surah 19","Chapter 19","Mary","مَريَم"],"ayahNumber":2309,"juzNumber":16,"footnotes":"(1) انعام یافتہ بندگان الٰہی کا تذکرہ کرنے کے بعد ان لوگوں کا ذکر کیا جا رہا ہے، جو ان کے برعکس اللہ کے احکام سے غفلت واعراض کرنے والے ہیں۔ نماز ضائع کرنے سے مراد یا تو بالکل نماز کا ترک ہے جو کفر ہے یا ان کے اوقات کو ضائع کرنا ہے یعنی وقت پر نماز نہ پڑھنا، جب جی چاہا، نماز پڑھ لی، یا بلا عذر اکٹھی کر کے پڑھنا کبھی دو، کبھی چار، کبھی ایک اور کبھی پانچوں نمازیں۔ یہ بھی تمام صورتیں نماز ضائع کرنے کی ہیں جس کا مرتکب سخت گناہ گار اور آیت میں بیان کردہ وعید کا سزاوار ہو سکتا ہے۔ غَيًّا کے معنی ہلاکت، انجام بد کے ہیں یا جہنم کی ایک وادی کا نام ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"fakhalafa min baʿdihim khalfun aḍāʿū al-ṣalata wa-ittabaʿū al-shahawāti fasawfa yalqawna ghayyan ","translations":["Then succeeded","after them","after them","successors","who neglected","the prayer","and they followed","the lusts","so soon","they will meet","evil","(59)"],"transliterationArr":["fakhalafa","min","baʿdihim","khalfun","aḍāʿū","al-ṣalata","wa-ittabaʿū","al-shahawāti","fasawfa","yalqawna","ghayyan",null],"verseTiming":[[1,0,970],[2,970,1970],[3,1970,3050],[4,3050,3920],[5,3920,4870],[6,4870,6130],[7,6130,7130],[8,7130,8550],[9,8550,9540],[10,9540,10600],[11,10600,11985]]}}