{"name":"19:68","price":"تیرے پروردگار کی قسم! ہم انہیں اور شیطانوں کو جمع کر کے ضرور ضرور جہنم کے اردگرد گھٹنوں کے بل گرے ہوئے حاضر کر دیں گے.(1)","arabic":"فَوَرَبِّكَ لَنَحۡشُرَنَّهُمۡ وَٱلشَّيَٰطِينَ ثُمَّ لَنُحۡضِرَنَّهُمۡ حَوۡلَ جَهَنَّمَ جِثِيّٗا","category":["19 (Maryam)","Maryam","Surah Maryam","Chapter Maryam","Surah 19","Chapter 19","Mary","مَريَم"],"ayahNumber":2318,"juzNumber":16,"footnotes":"(1) جِثِيٌّ, جَاثٍ کی جمع ہے جَثَا يَجْثُو سے۔ جَاثٍ گھٹنوں کے بل گرنے والے کو کہتے ہیں۔ یہ حال ہے یعنی ہم دوبارہ انہیں کو نہیں بلکہ ان شیاطین کو بھی زندہ کر دیں گے جنہوں نے ان کو گمراہ کیا تھا یا جن کی وہ عبادت کرتے تھے پھر ان سب کو اس حال میں جہنم کے گرد جمع کر دیں گے کہ یہ محشر کی ہولناکیوں اور حساب کے خوف سے گھٹنوں کے بل بیٹھے ہونگے،حدیث قدسی میں ہے۔ اللہ تعالیٰ فرماتا ہے: ”ابن آدم میری تکذیب کرتا ہے۔ حالانکہ یہ اس کے لائق نہیں۔ ابن آدم مجھے ایذا پہنچاتا ہے حالانکہ اسے یہ زیب نہیں دیتا۔ اس کا میری تکذیب کرنا تو یہ ہے کہ وہ میری بابت یہ کہتا ہے کہ اللہ مجھے ہرگز اس طرح دوبارہ زندہ نہیں کرے گا جس طرح اس نے مجھے پہلی مرتبہ پیدا کیا حالانکہ میرے لئے پہلی مرتبہ پیدا کرنا دوسری مرتبہ پیدا کرنے سے زیادہ آسان نہیں ہے (یعنی مشکل اگر ہے تو پہلی مرتبہ پیدا کرنا نہ کہ دوسری مرتبہ) اور اس کا مجھے ایذا پہنچانا یہ ہے کہ وہ کہتا ہے میری اولاد ہے، حالانکہ میں ایک ہوں، بےنیاز ہوں نہ میں نے کسی کو جنا اور نہ خود جنا گیا ہوں میرا کوئی ہمسر نہیں ہے“۔ (صحیح بخاری۔ تفسیر سورہ اخلاص)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"fawarabbika lanaḥshurannahum wal-shayāṭīna thumma lanuḥ'ḍirannahum ḥawla jahannama jithiyyan ","translations":["So by your Lord","surely, We will gather them","and the devils","then","surely, We will bring them","around","Hell","bent (on) knees","(68)"],"transliterationArr":["fawarabbika","lanaḥshurannahum","wal-shayāṭīna","thumma","lanuḥ'ḍirannahum","ḥawla","jahannama","jithiyyan",null],"verseTiming":[[1,0,1430],[2,1430,4170],[3,4170,5940],[4,5940,7430],[5,7430,10460],[6,10460,11810],[7,11810,14540],[8,14540,15340],[9,15340,17110],[10,17110,18835]]}}