{"name":"19:72","price":"پھر ہم پرہیزگاروں کو تو بچالیں گے اور نافرمانوں کو اسی میں گھٹنوں کے بل گرا ہوا چھوڑ دیں گے.(1)","arabic":"ثُمَّ نُنَجِّي ٱلَّذِينَ ٱتَّقَواْ وَّنَذَرُ ٱلظَّٰلِمِينَ فِيهَا جِثِيّٗا","category":["19 (Maryam)","Maryam","Surah Maryam","Chapter Maryam","Surah 19","Chapter 19","Mary","مَريَم"],"ayahNumber":2322,"juzNumber":16,"footnotes":"(1) اس کی تفسیر صحیح حدیث میں اس طرح بیان کی گئی ہے کہ جہنم کے اوپر پل بنایا جائے گا جس میں ہر مومن وکافر کو گزرنا ہوگا۔ مومن تو اپنے اعمال کے مطابق جلد یا بدیر گزر جائیں گے، کچھ تو پلک جھپکنے میں، کچھ بجلی اور کچھ ہوا کی طرح، کچھ پرندوں کی طرح اور کچھ عمدہ گھوڑوں اور دیگر سواریوں کی طرح گزر جائیں گے یوں کچھ بالکل صحیح سالم، کچھ زخمی تاہم پل عبور کرلیں گے کچھ جہنم میں گر پڑیں گے جنہیں بعد میں شفاعت کے ذریعے سے نکال لیا جائے گا۔ لیکن کافر اس پل کو عبور کرنے میں کامیاب نہیں ہونگے اور سب جہنم میں گر پڑیں گے۔ اس کی تائید اس حدیث سے بھی ہوتی ہے جس میں آتا ہے کہ جس کے تین بچے بلوغت سے پہلے وفات پا گئے ہوں، اسے آگ نہیں چھوئے گی مگر صرف قسم حلال کرنے کے لئے۔ (البخاري- كتاب الجنائز، ومسلم كتاب البر) یہ قسم وہی ہے جسے اس آیت میں حَتْمًا مَقْضِيًّا (قطعی فیصل شدہ امر) کہا گیا ہے، یعنی اس کا ورود جہنم میں صرف پل پر گزرنے کی حد تک ہی ہوگا۔ (تفصیل کے لئے دیکھئے ابن کثیر وایسر التفاسیر)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"thumma nunajjī alladhīna ittaqaw wanadharu al-ẓālimīna fīhā jithiyyan ","translations":["Then","We will deliver","those who","feared (Allah)","and We will leave","the wrongdoers","therein","bent (on) knees","(72)"],"transliterationArr":["thumma","nunajjī","alladhīna","ittaqaw","wanadharu","al-ẓālimīna","fīhā","jithiyyan",null],"verseTiming":[[1,0,1170],[2,1170,2080],[3,2080,3140],[4,3140,4130],[5,4130,5010],[6,5010,6660],[7,6660,7660],[8,7660,8955]]}}