{"name":"19:80","price":"یہ جن چیزوں کو کہہ رہا ہے اسے ہم اس کے بعد لے لیں گے۔ اور یہ تو بالکل اکیلا ہی ہمارے سامنے حاضر ہوگا.(1)","arabic":"وَنَرِثُهُۥ مَا يَقُولُ وَيَأۡتِينَا فَرۡدٗا","category":["19 (Maryam)","Maryam","Surah Maryam","Chapter Maryam","Surah 19","Chapter 19","Mary","مَريَم"],"ayahNumber":2330,"juzNumber":16,"footnotes":"(1) ان آیات کی شان نزول میں بتلایا گیا ہے۔ کہ حضرت عمرو بن العاص رضی اللہ کے والد عاص بن وائل، جو اسلام کے شدید دشمنوں میں سے تھا۔ اس کے ذمے حضرت خباب بن ارت کا قرضہ تھا جو آہن گری کا کام کرتے تھے۔ حضرت خباب رضی اللہ عنہ نے اس سے اپنی رقم کا مطالبہ کیا تو اس نے کہا جب تک تو محمد (صلى الله عليه وسلم) کے ساتھ کفر نہیں کرے گا میں تجھے تیری رقم نہیں دونگا۔ انہوں نے کہا یہ کام تو، تو مر کر دوبارہ زندہ ہو جائے تب بھی نہیں کرونگا۔ اس نے کہا اچھا پھر ایسے ہی سہی، جب مجھے مرنے کے بعد دوبارہ اٹھایا جائے گا اور وہاں بھی مجھے مال واولاد سے نوازا جائے گا تو میں وہاں رقم ادا کر دونگا (صحيح بخاري، كتاب البيوع، باب ذكر القين والحداد، وتفسير سورة مريم- مسلم، صفة القيامة باب سؤال اليهود عن الروح)، اللہ تعالٰی نے فرمایا کہ یہ جو دعویٰ کر رہا ہے کیا اس کے پاس غیب کا علم ہے کہ وہاں بھی اس کے پاس مال اور اولاد ہوگی؟ یا اللہ سے اس کا کوئی عہد ہے؟ ایسا ہرگز نہیں ہے یہ صرف اللہ تعالٰی اور آیات الہٰی کا استہزا وتمسخر ہے یہ جس مال واولاد کی بات کر رہا ہے اس کے وارث تو ہم ہیں یعنی مرنے کے ساتھ ہی ان سے اس کا تعلق ختم ہو جائے گا اور ہماری بارگاہ میں یہ اکیلا آئے گا نہ مال ساتھ ہوگا نہ اولاد اور نہ کوئی جتھہ۔ البتہ عذاب ہوگا جو اس کے لیے اور ان جیسے دیگر لوگوں کے لیے ہم بڑھاتے رہیں گے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wanarithuhu mā yaqūlu wayatīnā fardan ","translations":["And We will inherit (from) him","what","he says","and he will come to Us","alone","(80)"],"transliterationArr":["wanarithuhu","mā","yaqūlu","wayatīnā","fardan",null],"verseTiming":[[1,0,1370],[2,1370,1810],[3,1810,2880],[4,2880,4380],[5,4380,5485]]}}