{"name":"1:2","price":"سب تعریف اللہ تعالیٰ کے لئے ہے(1) جو تمام جہانوں کا پالنے واﻻ ہے۔(2)","arabic":"ٱلۡحَمۡدُ لِلَّهِ رَبِّ ٱلۡعَٰلَمِينَ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah","Chapter Al-Fatihah","Fatihah","Surah Fatihah","Chapter Fatihah","Al Fatihah","Surah Al Fatihah","Chapter Al Fatihah","Surah 1","Chapter 1","The Opening","الفَاتِحَة"],"ayahNumber":2,"juzNumber":1,"footnotes":"(1) اَلْحَمْدُ میں ”ال“ استغراق یا اختصاص کے لئے ہے، یعنی تمام تعریفیں اللہ کے لئے ہیں، یا اس کے لئے خاص ہیں، کیوں کہ تعریف کا اصل مستحق اور سزاوار صرف اللہ تعالیٰ ہے۔ کسی کے اندر کوئی خوبی، حسن یا کمال ہے تو وہ بھی الله تعالیٰ کا پیدا کردہ ہے اس لئے حمد (تعریف) کا مستحق بھی وہی ہے۔ ”اللہ“ یہ اللہ کا ذاتی نام ہے، اس کا استعمال کسی اور کے لئے جائز نہیں۔ الْحَمْدُ للهِ یہ کلمہ شکر ہے جس کی بڑی فضیلت احادیث میں آئی ہے۔ ایک حدیث میں لا إِلَهَ إلا اللهُ أَفْضَلُ الذِّكْرِ اور الْحَمْدُ للهِ کو أَفْضَلُ الدُّعَاءِ کہا گیا ہے۔ (ترمذی، نسائی وغیرہ) صحیح مسلم اور نسائی کی روایت میں ہے «الْحَمْدُ للهِ تَمْلأُ الْمِيزَانَ» ”الْحَمْدُ للهِ میزان کو بھر دیتا ہے۔“ اسی لئے ایک اور حدیث میں آتا ہے کہ اللہ اس بات کو پسند فرماتا ہے کہ ہر کھانے اور پینے پر بندہ اللہ کی حمد کرے۔ (صحیح مسلم) ۔\n(2) رَبِّ، اللہ تعالیٰ کے اسمائے حسنیٰ میں سے ہے، جس کے معنی ہیں ہر چیز کو پیدا کرکے اس کی ضروریات مہیا کرنے اور اس کو تکمیل تک پہنچانے والا۔ اس کا استعمال بغیر اضافت کے کسی اور کے لئے جائز نہیں۔ عَالَمِينَ عَالَمٌ (جہان) کی جمع ہے۔ ویسے تو تمام خلائق کے مجموعے کو عالم کہا جاتا ہے، اسی لئے اس کی جمع نہیں لائی جاتی۔ لیکن یہاں اس کی ربوبیت کاملہ کے اظہار کے لئے عالم کی بھی جمع لائی گئی ہے، جس سے مراد مخلوقات کی الگ الگ جنسیں ہیں۔ مثلاً عالم جن، عالم انس، عالم ملائکہ اور عالم وحوش وطیور وغیرہ۔ ان تمام مخلوقات کی ضرورتیں ایک دوسرے سے قطعاً مختلف ہیں، لیکن رَبِّ الْعَالَمِينَ سب کی ضروریات، ان کے احوال وظروف اور طباع و اجسام کے مطابق مہیا فرماتا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"al-ḥamdu lillahi rabbi al-ʿālamīna ","translations":["All praises and thanks","(be) to Allah","the Lord","of the universe","(2)"],"transliterationArr":["al-ḥamdu","lillahi","rabbi","al-ʿālamīna",null],"verseTiming":[[1,0,1000],[2,1000,1860],[3,1860,2490],[4,2490,5525]]}}