{"name":"1:5","price":"ہم صرف تیری ہی عبادت کرتے ہیں اور صرف تجھ ہی سے مدد چاہتے ہیں۔(1)","arabic":"إِيَّاكَ نَعۡبُدُ وَإِيَّاكَ نَسۡتَعِينُ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah","Chapter Al-Fatihah","Fatihah","Surah Fatihah","Chapter Fatihah","Al Fatihah","Surah Al Fatihah","Chapter Al Fatihah","Surah 1","Chapter 1","The Opening","الفَاتِحَة"],"ayahNumber":5,"juzNumber":1,"footnotes":"(1) عبادت کے معنی ہیں کسی کی رضا کے لئے انتہائی تذلل وعاجزی اور کمال خشوع کا اظہار اور بقول ابن کثیر”شریعت میں کمال محبت، خضوع اور خوف کے مجموعے کا نام ہے“ یعنی جس ذات کے ساتھ محبت بھی ہو، اس کی مافوق الاسباب طاقت کے سامنے عاجزی وبے بسی کا اظہار بھی ہو اور اسباب ومافوق الاسباب ذرائع سے اس کی گرفت کا خوف بھی ہو۔ سیدھی عبارت ”نَعْبُدُكَ وَنَسْتَعِينُكَ“ ”ہم تیری عبادت کرتے اور تجھ سے مدد چاہتے ہیں“ ہوتی، لیکن اللہ تعالیٰ نے یہاں مفعول کو فعل پر مقدم کرکے «إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ»‌ فرمایا، جس سے مقصد اختصاص پیدا کرنا ہے، یعنی ”ہم تیری ہی عبادت کرتے اور تجھ ہی سے مدد چاہتے ہیں“ نہ عبادت اللہ کے سوا کسی اور کی جائز ہے اور نہ استعانت ہی کسی اور سے جائز ہے۔ ان الفاظ سے شرک کا سدباب کردیا گیا ہے، لیکن جن کے دلوں میں شرک کا روگ راہ پاگیا ہے، وہ مافوق الاسباب اور ماتحت الاسباب استعانت میں فرق کو نظرانداز کرکے عوام کو مغالطے میں ڈال دیتے ہیں اور کہتے ہیں کہ دیکھو ہم بیمار ہوجاتے ہیں تو ڈاکٹر سے مدد حاصل کرتے ہیں، بیوی سے مدد چاہتے ہیں، ڈرائیور اور دیگر انسانوں سے مدد کے طالب ہوتے ہیں۔ اس طرح وہ یہ باور کراتے ہیں کہ اللہ کے سوا اوروں سے مدد مانگنا بھی جائز ہے۔ حالانکہ اسباب کے ماتحت ایک دوسرے سے مدد چاہنا اور مدد کرنا یہ شرک نہیں ہے، یہ تو اللہ تعالیٰ کا بنایا ہوا نظام ہے، جس میں سارے کام ظاہری اسباب کے مطابق ہی ہوتے ہیں، حتیٰ کہ انبیا بھی انسانوں کی مدد حاصل کرتے ہیں۔ حضرت عیسیٰ عليه السلام نے فرمایا: «مَنْ أَنْصَارِي إِلَى اللَّهِ» (الصف: 14) ”اللہ کے دین کے لئے کون میرا مددگار ہے؟“۔ اللہ تعالیٰ نے اہل ایمان کو فرمایا:«وَتَعَاوَنُوا عَلَى الْبِرِّ وَالتَّقْوَى» (المائدة: 2) ”نیکی اور تقویٰ کے کاموں پر ایک دوسرے کی مدد کرو“، ظاہر بات ہے کہ یہ تعاون ممنوع ہے، نہ شرک، بلکہ مطلوب ومحمود ہے۔ اس کا اصطلاحی شرک سے کیا تعلق؟ شرک تو یہ ہے کہ ایسے شخص سے مدد طلب کی جائے جو ظاہری اسباب کے لحاظ سے مدد نہ کرسکتا ہو، جیسے کسی فوت شدہ شخص کو مدد کے لئے پکارنا ، اس کو مشکل کشا اور حاجت روا سمجھنا، اس کو نافع وضار باور کرنا اور دور ونزدیک سے ہر ایک کی فریاد سننے کی صلاحیت سے بہرہ ور تسلیم کرنا۔ اس کا نام ہے مافوق الاسباب طریقے سے مدد طلب کرنا، اور اسے خدائی صفات سے متصف ماننا۔ اسی کا نام شرک ہے، جو بدقسمتی سے محبت اولیاء کے نام پر مسلمان ملکوں میں عام ہے۔ أَعَاذَنَا اللهُ مِنْهُ۔\nتوحید کی تین قسمیں : اس موقع پر مناسب معلوم ہوتا ہے کہ توحید کی تین اہم قسمیں بھی مختصراً بیان کردی جائیں۔ یہ قسمیں ہیں۔ توحید ربوبیت، توحید الوہیت اور توحید صفات۔ 1۔ توحید ربوبیت کا مطلب ہے کہ اس کائنات کا خالق، مالک، رازق اور مدبر صرف اللہ تعالیٰ ہے۔ اس توحید کو ملاحدہ وزنادقہ کے علاوہ تمام لوگ مانتے ہیں، حتیٰ کہ مشرکین بھی اس کے قائل رہے ہیں اور ہیں، جیسا کہ قرآن کریم نے مشرکین مکہ کا اعتراف نقل کیا ہے۔ مثلاً فرمایا: ”اے پیغمبر (صلى الله عليه وسلم)! ان سے پوچھیں کہ تم کو آسمان وزمین میں رزق کون دیتا ہے، یا تمہارے کانوں اور آنکھوں کا مالک کون ہےاور بےجان سے جاندار اور جاندار سے بے جان کون پیدا کرتا ہے اور دنیا کے کاموں کا انتظام کون کرتا ہے؟ جھٹ کہہ دیں گے کہ اللہ (یعنی یہ سب کام کرنے والا اللہ ہے)۔“ (یونس: 31) دوسرے مقام پر فرمایا: ”اگر آپ (صلى الله عليه وسلم) ان سے پوچھیں کہ آسمان وزمین کا خالق کون ہے؟ تو یقیناً یہی کہیں گے کہ اللہ۔“ (الزمر: 38) ایک اور مقام پر فرمایا: ”اگر آپ (صلى الله عليه وسلم) ان سے پوچھیں کہ زمین اور زمین میں جو کچھ ہے، یہ سب کس کا مال ہے، ساتوں آسمان اور عرش عظیم کا مالک کون ہے؟ ہر چیز کی بادشاہی کس کے ہاتھ میں ہے؟ اور وہ سب کو پناہ دیتا ہے، اور اس کے مقابل کوئی پناہ دینے والا نہیں۔ ان سب کے جواب میں یہ یہی کہیں گے کہ اللہ (یعنی یہ سارے کام اللہ ہی کے ہیں)۔“ (المؤمنون: 84۔ 89) وَغَيْرهَا مِنَ الآيَاتِ۔ 2۔ توحید الوہیت کا مطلب ہے کہ عبادت کی تمام اقسام کا مستحق صرف اللہ تعالیٰ ہے اور عبادت ہر وہ کام ہے جو کسی مخصوص ہستی کی رضا کے لئے، یا اس کی ناراضی کے خوف سے کیا جائے، اس لئے نماز، روزہ، حج اور زکٰوہ صرف یہی عبادات نہیں ہیں بلکہ کسی مخصوص ہستی سے دعا والتجا کرنا، اس کے نام کی نذرونیاز دینا، اس کے سامنے دست بستہ کھڑا ہونا، اس کا طواف کرنا، اس سے طمع اور خوف رکھنا وغیرہ بھی عبادات ہیں۔ توحید الوہیت یہ ہے کہ یہ تمام کام صرف اللہ تعالیٰ ہی کے لئے کئے جائیں۔ قبرپرستی کے مرض میں مبتلا عوام وخواص اس توحید الوہیت میں شرک کا ارتکاب کرتے ہیں اور مذکورہ عبادات کی بہت سی قسمیں وہ قبروں میں مدفون افراد اور فوت شدہ بزرگوں کے لئے بھی کرتے ہیں جو سراسر شرک ہے۔ 3۔ توحید صفات کا مطلب ہے کہ اللہ تعالیٰ کی جو صفات قرآن وحدیث میں بیان ہوئی ہیں، ان کو بغیر کسی تاویل اور تحریف کے تسلیم کریں اور وہ صفات اس انداز میں کسی اور کے اندر نہ مانیں۔ مثلاً جس طرح اس کی صفت علم غیب ہے، یا دور اور نزدیک سے ہر ایک کی فریاد سننے پر وہ قادر ہے، کائنات میں ہر طرح کا تصرف کرنے کا اسے اختیار حاصل ہے، یہ یا اس قسم کی اور صفات الٰہیہ ان میں سے کوئی صفت بھی اللہ کے سوا کسی نبی، ولی یا کسی بھی شخص کے اندر تسلیم نہ کی جائیں۔ اگر تسلیم کی جائیں گی تو یہ شرک ہوگا۔ افسوس ہے کہ قبرپرستوں میں شرک کی یہ قسم بھی عام ہے اور انہوں نے اللہ کی مذکورہ صفات میں بہت سے بندوں کو بھی شریک کر رکھا ہے۔ أَعَاذَنَا اللهُ مِنْهُ۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"iyyāka naʿbudu wa-iyyāka nastaʿīnu ","translations":["You Alone","we worship","and You Alone","we ask for help","(5)"],"transliterationArr":["iyyāka","naʿbudu","wa-iyyāka","nastaʿīnu",null],"verseTiming":[[1,0,990],[2,990,1760],[3,1760,2880],[4,2880,6635]]}}