{"name":"20:122","price":"پھر اس کے رب نے نوازا، اس کی توبہ قبول کی اور اس کی رہنمائی کی.(1)","arabic":"ثُمَّ ٱجۡتَبَٰهُ رَبُّهُۥ فَتَابَ عَلَيۡهِ وَهَدَىٰ","category":["20 (Ta-Ha)","Ta-Ha","Surah Ta-Ha","Chapter Ta-Ha","Ha","Surah Ha","Chapter Ha","Ta Ha","Surah Ta Ha","Chapter Ta Ha","Surah 20","Chapter 20","Ta-Ha","طه"],"ayahNumber":2470,"juzNumber":16,"footnotes":"(1) اس سے بعض لوگ استدال کرتے ہوئے کہتے ہیں کہ حضرت آدم (عليه السلام) سے مذکورہ غلطیوں کا ہونا، نبوت سے قبل ہوا، اور نبوت سے اس کے بعد آپ کو نوازا گیا۔ لیکن ہم نے گزشتہ صفحے میں اس ”معصیت“ کی حقیقت بیان کی ہے، وہ عصمت کے منافی نہیں رہتی۔ کیونکہ ایسا سہو و نسیان، جس کا تعلق تبلیغ رسالت اور تشریع سے نہ ہو، بلکہ ذاتی افعال سے ہو اور اس میں بھی اس کا سبب ضعف ارادہ ہو تو یہ دراصل وہ معصیت ہی نہیں ہے، جس کی بناء پر انسان غضب الٰہی کا مستحق بنتا ہے۔ اس پر جو معصیت کا اطلاق کیا گیا ہے تو محض ان کی عظمت شان اور مقام بلند کی وجہ سے کہ بڑوں کی معمولی غلطی کو بھی بڑا سمجھ لیا جاتا ہے، اس لئے آیت کا مطلب یہ نہیں کہ ہم نے اس کے بعد اسے نبوت کے لئے چن لیا، بلکہ مطلب یہ ہے کہ ندامت اور توبہ کے بعد ہم نے اسے پھر اسی مقام پر فائز کر دیا، جو پہلے انہیں حاصل تھا۔ ان کو زمین پر اتار نے کا فیصلہ، ہماری مشیت اور حکمت و مصلحت پر مبنی تھا، اس سے یہ نہ سمجھ لیا جائے کہ یہ ہمارا غضب ہے جو آدم پر نازل ہوا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"thumma ij'tabāhu rabbuhu fatāba ʿalayhi wahadā ","translations":["Then","chose him","his Lord","and turned","to him","and guided (him)","(122)"],"transliterationArr":["thumma","ij'tabāhu","rabbuhu","fatāba","ʿalayhi","wahadā",null],"verseTiming":[[1,0,1160],[2,1160,2390],[3,2390,3320],[4,3320,4310],[5,4310,5240],[6,5240,6135]]}}