{"name":"20:129","price":"اگر تیرے رب کی بات پہلے ہی سے مقرر شده اور وقت معین کرده نہ ہوتا تو اسی وقت عذاب آچمٹتا.(1)","arabic":"وَلَوۡلَا كَلِمَةٞ سَبَقَتۡ مِن رَّبِّكَ لَكَانَ لِزَامٗا وَأَجَلٞ مُّسَمّٗى","category":["20 (Ta-Ha)","Ta-Ha","Surah Ta-Ha","Chapter Ta-Ha","Ha","Surah Ha","Chapter Ha","Ta Ha","Surah Ta Ha","Chapter Ta Ha","Surah 20","Chapter 20","Ta-Ha","طه"],"ayahNumber":2477,"juzNumber":16,"footnotes":"(1) یعنی یہ مکذبین اور مشرکین مکہ دیکھتے نہیں کہ ان سے پہلے کئی امتیں گزر چکی ہیں، جن کے جانشین ہیں اور ان کی رہائش گاہوں سے گزر کر آگے جاتے ہیں انہیں ہم اسکے جھٹلانے کی وجہ سے ہلاک کر چکے ہیں، جن کے عبرت ناک انجام میں اہل عقل و دانش کے لئے بڑی نشانیاں ہیں، لیکن اہل مکہ ان سے آنکھیں بند کئے ہوئے انہی کی روش اپنائے ہوئے ہیں۔ اگر اللہ تعالٰی نے پہلے سے یہ فیصلہ نہ کیا ہوتا کہ وہ تمام حجت کے بغیر اور اس مدت کے آنے سے پہلے جو وہ مہلت کے لئے کسی قوم کو عطا فرماتا ہے، کسی کو ہلاک نہیں کرتا۔ تو فورا انہیں عذاب الٰہی آ چمٹتا اور یہ ہلاکت سے دو چار ہو چکے ہوتے۔ مطلب یہ ہے کہ تکذیب رسالت کے باوجود اگر ان پر اب تک عذاب نہیں آیا تو یہ سمجھیں کہ آئندہ بھی نہیں آئے گا بلکہ ابھی ان کو اللہ کی طرف سے مہلت ملی ہوئی ہے، جیسا کہ وہ ہر قوم کو دیتا ہے۔ مہلت عمل ختم ہو جانے کے بعد ان کو عذاب الٰہی سے بچانے والا کوئی نہیں ہوگا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walawlā kalimatun sabaqat min rabbika lakāna lizāman wa-ajalun musamman ","translations":["And if not","(for) a Word","(that) preceded","from","your Lord","surely (would) have been","an obligation","and a term","determined","(129)"],"transliterationArr":["walawlā","kalimatun","sabaqat","min","rabbika","lakāna","lizāman","wa-ajalun","musamman",null],"verseTiming":[[1,0,970],[2,970,2500],[3,2500,3400],[4,3400,3580],[5,3580,4640],[6,4640,5430],[7,5430,7280],[8,7280,8000],[9,8000,10575]]}}