{"name":"20:131","price":"اور اپنی نگاہیں ہرگز ان چیزوں کی طرف نہ دوڑانا جو ہم نے ان میں سے مختلف لوگوں کو آرائش دنیا کی دے رکھی ہیں تاکہ انہیں اس میں آزما لیں(1) تیرے رب کا دیا ہوا ہی (بہت) بہتر اور باقی رہنے واﻻ ہے.(2)","arabic":"وَلَا تَمُدَّنَّ عَيۡنَيۡكَ إِلَىٰ مَا مَتَّعۡنَا بِهِۦٓ أَزۡوَٰجٗا مِّنۡهُمۡ زَهۡرَةَ ٱلۡحَيَوٰةِ ٱلدُّنۡيَا لِنَفۡتِنَهُمۡ فِيهِۚ وَرِزۡقُ رَبِّكَ خَيۡرٞ وَأَبۡقَىٰ","category":["20 (Ta-Ha)","Ta-Ha","Surah Ta-Ha","Chapter Ta-Ha","Ha","Surah Ha","Chapter Ha","Ta Ha","Surah Ta Ha","Chapter Ta Ha","Surah 20","Chapter 20","Ta-Ha","طه"],"ayahNumber":2479,"juzNumber":16,"footnotes":"(1) یہ وہی مضمون ہے جو اس سے قبل سورہ آل عمران: 196، 197، سورہ حجر: 87، 88 اور سورہ کہف: 7 وغیرہ میں بیان ہوا ہے۔\n(2) اس سے مراد آخرت کا اجر و ثواب ہے جو دنیا کے مال و اسباب سے بہتر بھی ہے اور اس کے مقابلے میں باقی رہنے والا بھی۔ حدیث میں آتا ہے کہ حضرت عمر، نبی (صلى الله عليه وسلم) کی خدمت میں حاضر ہوئے، دیکھا کہ آپ ایک کھردری چٹائی پر لیٹے ہوئے ہیں اور بے سرو سامانی کا یہ عالم ہے، کہ گھر میں چمڑے کی دو چیزوں کے علاوہ کچھ نہیں۔ حضرت عمر رضی اللہ کی آنکھوں میں بے اختیار آنسو آ گئے۔ نبی (صلى الله عليه وسلم) نے پوچھا، عمر کیا بات ہے، روتے کیوں ہو؟ عرض کیا یا رسول اللہ صلی اللہ علیہ وسلم قیصرو کسرٰی، کس طرح آرام و راحت کی زندگی گزار رہے ہیں اور آپ کا، باوجود اس بات کے کہ آپ افضل الخلق ہیں، یہ حال ہے، فرمایا، عمر کیا تم اب تک شک میں ہو۔ یہ وہ لوگ ہیں جن کو ان کے آرام کی چیزیں دنیا میں ہی دے دی گئی ہیں۔ یعنی آخرت میں ان کے لئے کچھ نہیں ہوگا (بخاري، سورة التحريم- مسلم- باب الإيلاء)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walā tamuddanna ʿaynayka ilā mā mattaʿnā bihi azwājan min'hum zahrata al-ḥayati al-dun'yā linaftinahum fīhi wariz'qu rabbika khayrun wa-abqā ","translations":["And (do) not","extend","your eyes","towards","what","We have given for enjoyment","[with it]","pairs","of them","(the) splendor","(of) the life","(of) the world","that We may test them","in it","And (the) provision","(of) your Lord","(is) better","and more lasting","(131)"],"transliterationArr":["walā","tamuddanna","ʿaynayka","ilā","mā","mattaʿnā","bihi","azwājan","min'hum","zahrata","al-ḥayati","al-dun'yā","linaftinahum","fīhi","wariz'qu","rabbika","khayrun","wa-abqā",null],"verseTiming":[[1,0,690],[2,690,2780],[3,2780,3890],[4,3890,4470],[5,4470,4940],[6,4940,6170],[7,6170,8490],[8,8490,9630],[9,9630,11310],[10,11310,12110],[11,12110,13210],[12,13210,14310],[13,14310,15770],[14,15770,16880],[15,16880,17780],[16,17780,19380],[17,19380,21360],[18,21360,22230],[19,22230,23010],[20,23010,24530],[21,24530,25695]]}}