{"name":"20:130","price":"پس ان کی باتوں پر صبر کر اور اپنے پروردگار کی تسبیح اور تعریف بیان کرتا ره، سورج نکلنے سے پہلے اور اس کے ڈوبنے سے پہلے، رات کے مختلف وقتوں میں بھی اور دن کے حصوں میں بھی تسبیح کرتا ره(1) ، بہت ممکن ہے کہ تو راضی ہو جائے.(2)","arabic":"فَٱصۡبِرۡ عَلَىٰ مَا يَقُولُونَ وَسَبِّحۡ بِحَمۡدِ رَبِّكَ قَبۡلَ طُلُوعِ ٱلشَّمۡسِ وَقَبۡلَ غُرُوبِهَاۖ وَمِنۡ ءَانَآيِٕ ٱلَّيۡلِ فَسَبِّحۡ وَأَطۡرَافَ ٱلنَّهَارِ لَعَلَّكَ تَرۡضَىٰ","category":["20 (Ta-Ha)","Ta-Ha","Surah Ta-Ha","Chapter Ta-Ha","Ha","Surah Ha","Chapter Ha","Ta Ha","Surah Ta Ha","Chapter Ta Ha","Surah 20","Chapter 20","Ta-Ha","طه"],"ayahNumber":2478,"juzNumber":16,"footnotes":"(1) بعض مفسرین کے نزدیک تسبیح سے مراد نماز ہے اور وہ اسے پانچ نمازوں سے مراد لیتے ہیں۔ طلوع شمس سے قبل فجر، ٖغروب سے قبل، عصر رات کی گھڑیوں سے مغرب و عشاء اور اطراف النھار سے ظہر کی نماز مراد ہے کیونکہ ظہر کا وقت، یہ نماز اول کا طرف آخر اور نہار آخر کا طرف اول ہے۔ اور بعض کے نزدیک ان اوقات میں ایسے ہی اللہ کی تسبیح و توحید ہے، جس میں نماز، تلاوت، ذکر اذکار، دعا مناجات اور نوافل سب داخل ہیں۔ مطلب یہ ہے کہ آپ ان مشرکین کی تکذیب سے بد دل نہ ہوں۔ اللہ کی تسبیح و تحمید کرتے رہیں۔ اللہ تعالٰی جب چاہے گا، ان کی گرفت فرما لے گا۔\n(2) یہ متعلق ہے فَسَبِّحْ سے یعنی ان اوقات میں تسبیح کریں، یہ امید رکھتے ہوئے کہ اللہ کے ہاں آپ کو وہ مقام و درجہ حاصل ہو جائے گا جس سے آپ کا نفس راضی ہو جائے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"fa-iṣ'bir ʿalā mā yaqūlūna wasabbiḥ biḥamdi rabbika qabla ṭulūʿi al-shamsi waqabla ghurūbihā wamin ānāi al-layli fasabbiḥ wa-aṭrāfa al-nahāri laʿallaka tarḍā ","translations":["So be patient","over","what","they say","and glorify","with praise","(of) your Lord","before","(the) rising","(of) the sun","and before","its setting","and from","(the) hours","(of) the night","and glorify","(at the) ends","(of) the day","so that you may","be satisfied","(130)"],"transliterationArr":["fa-iṣ'bir","ʿalā","mā","yaqūlūna","wasabbiḥ","biḥamdi","rabbika","qabla","ṭulūʿi","al-shamsi","waqabla","ghurūbihā","wamin","ānāi","al-layli","fasabbiḥ","wa-aṭrāfa","al-nahāri","laʿallaka","tarḍā",null],"verseTiming":[[1,0,780],[2,780,1460],[3,1460,1920],[4,1920,3230],[5,3230,4220],[6,4220,5020],[7,5020,5940],[8,5940,6560],[9,6560,7380],[10,7380,8200],[11,8200,9040],[12,9040,10360],[13,10360,11330],[14,11330,14050],[15,14050,14890],[16,14890,15920],[17,15920,17060],[18,17060,18630],[19,18630,19650],[20,19650,20945]]}}