{"name":"20:115","price":"ہم نے آدم کو پہلے ہی تاکیدی حکم دیا تھا لیکن وه بھول گیا اور ہم نے اس میں کوئی عزم نہیں پایا.(1)","arabic":"وَلَقَدۡ عَهِدۡنَآ إِلَىٰٓ ءَادَمَ مِن قَبۡلُ فَنَسِيَ وَلَمۡ نَجِدۡ لَهُۥ عَزۡمٗا","category":["20 (Ta-Ha)","Ta-Ha","Surah Ta-Ha","Chapter Ta-Ha","Ha","Surah Ha","Chapter Ha","Ta Ha","Surah Ta Ha","Chapter Ta Ha","Surah 20","Chapter 20","Ta-Ha","طه"],"ayahNumber":2463,"juzNumber":16,"footnotes":"(1) نسیان، (بھول جانا) ہر انسان کی سرشت میں داخل ہے اور ارادے کی کمزوری یعنی فقدان عزم۔ یہ بھی انسانی خصلت میں بالعموم پائی جاتی ہے۔ یہ دونوں کمزوریاں ہی شیطان کے وسوسوں میں پھنس جانے کا باعث بنتی ہیں۔ اگر ان کمزوریوں میں اللہ کے حکم سے بغاوت و سرکشی کا جذبہ اور اللہ کی نافرمانی کا عزم مصمم شامل نہ ہو، تو بھول اور ضعف ارادہ سے ہونے والی غلطی عصمت و کمال نبوت کے منافی نہیں، کیونکہ اس کے بعد انسان فوراً نادم ہو کر اللہ کی بارگاہ میں جھک جاتا اور توبہ و استفغار میں مصروف ہو جاتا ہے۔ (جیسا کہ حضرت آدم (عليه السلام) نے کیا) حضرت آدم (عليه السلام) کو اللہ نے سمجھایا تھا کہ شیطان تیرا اور تیری بیوی کا دشمن ہے، یہ تمہیں جنت سے نہ نکلوا دے گا۔ یہی وہ بات ہے جسے یہاں عہد سے تعبیر کیا گیا ہے۔ آدم (عليه السلام) اس عہد کو بھول گئے اور اللہ تعالٰی نے حضرت آدم (عليه السلام) کو ایک درخت کے قریب جانے یعنی اس سے کچھ کھانے سے منع فرمایا تھا۔ حضرت آدم (عليه السلام) کے دل میں یہ بات تھی کہ وہ اس درخت کے قریب نہیں جائیں گے۔ لیکن جب شیطان نے اللہ کی قسمیں کھا کر انہیں یہ باور کرایا کہ اس کا پھل تو یہ تاثیر رکھتا ہے کہ جو کھا لیتا ہے، اسے زندگی جاوداں اور دائمی بادشاہت مل جاتی ہے۔ تو ارادے پر قائم نہ رہ سکے اور اس فقدان عزم کی وجہ سے شیطانی وسوسے کا شکار ہوگئے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walaqad ʿahid'nā ilā ādama min qablu fanasiya walam najid lahu ʿazman ","translations":["And verily","We made a covenant","with","Adam","before","before","but he forgot","and not","We found","in him","determination","(115)"],"transliterationArr":["walaqad","ʿahid'nā","ilā","ādama","min","qablu","fanasiya","walam","najid","lahu","ʿazman",null],"verseTiming":[[1,0,790],[2,790,3240],[3,3240,5020],[4,5020,5830],[5,5830,6840],[6,6840,7400],[7,7400,8340],[8,8340,8810],[9,8810,9520],[10,9520,10080],[11,10080,11365]]}}