{"name":"20:40","price":"(یاد کر) جبکہ تیری بہن چل رہی تھی اور کہہ رہی تھی کہ اگر تم کہو تو میں اسے بتا دوں جو اس کی نگہبانی کرے(1) ، اس تدبیر سے ہم نے تجھے پھر تیری ماں کے پاس پہنچایا کہ اس کی آنکھیں ٹھنڈی رہیں اور وه غمگین نہ ہو۔ اور تو نے ایک شخص کو مار ڈاﻻ تھا(2) اس پر بھی ہم نے تجھے غم سے بچا لیا، غرض ہم نے تجھے اچھی طرح آزما لیا(3)۔ پھر تو کئی سال تک مدین کے لوگوں میں ٹھہرا رہا(4)، پھر تقدیر الٰہی کے مطابق اے(5) موسیٰ! تو آیا.","arabic":"إِذۡ تَمۡشِيٓ أُخۡتُكَ فَتَقُولُ هَلۡ أَدُلُّكُمۡ عَلَىٰ مَن يَكۡفُلُهُۥۖ فَرَجَعۡنَٰكَ إِلَىٰٓ أُمِّكَ كَيۡ تَقَرَّ عَيۡنُهَا وَلَا تَحۡزَنَۚ وَقَتَلۡتَ نَفۡسٗا فَنَجَّيۡنَٰكَ مِنَ ٱلۡغَمِّ وَفَتَنَّٰكَ فُتُونٗاۚ فَلَبِثۡتَ سِنِينَ فِيٓ أَهۡلِ مَدۡيَنَ ثُمَّ جِئۡتَ عَلَىٰ قَدَرٖ يَٰمُوسَىٰ","category":["20 (Ta-Ha)","Ta-Ha","Surah Ta-Ha","Chapter Ta-Ha","Ha","Surah Ha","Chapter Ha","Ta Ha","Surah Ta Ha","Chapter Ta Ha","Surah 20","Chapter 20","Ta-Ha","طه"],"ayahNumber":2388,"juzNumber":16,"footnotes":"(1) یہ اس وقت ہوا، جب ماں نے تابوت دریا میں پھینک دیا تو بیٹی سے کہا، ذرا دیکھتی رہو، یہ کہاں کنارے لگتا ہے اور اس کے ساتھ کیا معاملہ ہوتا ہے؟ جب اللہ کی مشیت سے موسیٰ (عليه السلام) فرعون کے محل میں پہنچ گئے، شیرخوارگی کا عالم تھا، چنانچہ دودھ پلانے والی عورتوں اور آیاؤں کو بلایا گیا لیکن موسیٰ (عليه السلام) کسی کا دودھ نہ پیتے موسیٰ (عليه السلام) کی بہن خاموشی سے سارا منظر دیکھ رہی تھی، بالآخر اس نے کہا میں تمہیں ایسی عورت بتاتی ہوں جو تمہاری یہ مشکل دور کر دے گی، انہوں نے کہا ٹھیک ہے، چنانچہ وہ اپنی ماں کو، جو موسیٰ (عليه السلام) کی بھی ماں تھی، بلا لائی، جب ماں نے بیٹے کو چھاتی سے لگایا تو موسیٰ (عليه السلام) نے اللہ کی تدبیر و مشیت سے غٹا غٹ دودھ پینا شروع کر دیا۔\n(2) یہ ایک دوسرے احسان کا ذکر ہے، جب موسیٰ (عليه السلام) سے غیر ارادی طور پر ایک فرعونی کو صرف گھونسہ مارنے سے مر گیا، جس کا ذکر سورہ قصص میں آئے گا۔\n(3) فُتُونٌ دخول اور خروج کی طرح مصدر ہے یعنی ابْتَلَيْنَاكَ ابْتِلاء ً یعنی ہم نے تجھے خوب آزمایا۔ یا یہ جمع ہے فتنہ کی جیسے حُجْرَةٌ کی حُجُورٌاور بَدْرٌ کی بُدُورٌکی جمع ہے یعنی ہم نے تجھے کئی مرتبہ یا بار بار آزمایا یا آزمائشوں سے نکالا مثلا جو سال بچوں کے قتل کا تھا تجھے پیدا کیا تیری ماں نے تجھے سمندر کی موجوں کے سپرد کر دیا تمام دایاؤں کا دودھ تجھ پر حرام کر دیا تو نے فرعون کی داڑھی پکڑ لی تھی جس پر اس نے تیرے قتل کا ارادہ کر لیا تھا تیرے ہاتھوں قبطی کا قتل ہوگیا وغیرہ ان تمام مواقع آزمائش میں ہم ہی تیری مدد اور چارہ سازی کرتے رہے۔\n(4) یعنی فرعونی کے غیر ارادی قتل کے بعد تو یہاں سے نکل کر مدین چلا گیا اور وہاں کئی سال رہا۔\n(5) یعنی ایسے وقت میں تو آیا جو وقت میں نے اپنے فیصلے اور تقدیر میں تجھ سے ہم کلامی اور نبوت کے لئے لکھا ہوا تھا۔ یا قَدَرٍ سے مراد، عمر ہے یعنی عمر کے اس مرحلے میں آیا جو نبوت کے لئے موزوں ہے۔ یعنی چالیس سال کی عمر میں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"idh tamshī ukh'tuka fataqūlu hal adullukum ʿalā man yakfuluhu farajaʿnāka ilā ummika kay taqarra ʿaynuhā walā taḥzana waqatalta nafsan fanajjaynāka mina al-ghami wafatannāka futūnan falabith'ta sinīna fī ahli madyana thumma ji'ta ʿalā qadarin yāmūsā ","translations":["When","was going","your sister","and she said","Shall","I show you","[to]","(one) who","will nurse and rear him","So We returned you","to","your mother","that","may be cooled","her eyes","and not","she grieves","And you killed","a man","but We saved you","from","the distress","and We tried you","(with) a trial","Then you remained","(some) years","with","(the) people","(of) Madyan","Then","you came","at","the decreed (time)","O Musa","(40)"],"transliterationArr":["idh","tamshī","ukh'tuka","fataqūlu","hal","adullukum","ʿalā","man","yakfuluhu","farajaʿnāka","ilā","ummika","kay","taqarra","ʿaynuhā","walā","taḥzana","waqatalta","nafsan","fanajjaynāka","mina","al-ghami","wafatannāka","futūnan","falabith'ta","sinīna","fī","ahli","madyana","thumma","ji'ta","ʿalā","qadarin","yāmūsā",null],"verseTiming":[[1,0,480],[2,480,2660],[3,2660,3480],[4,3480,4620],[5,4620,5040],[6,5040,6330],[7,6330,7080],[8,7080,7400],[9,7400,9110],[10,9110,11330],[11,11330,13150],[12,13150,14520],[13,14520,14700],[14,14700,15950],[15,15950,16940],[16,16940,17580],[17,17580,19010],[18,19010,20040],[19,20040,21600],[20,21600,23500],[21,23500,23860],[22,23860,25500],[23,25500,27760],[24,27760,29510],[25,29510,30530],[26,30530,31340],[27,31340,33000],[28,33000,33620],[29,33620,34460],[30,34460,35440],[31,35440,36100],[32,36100,36730],[33,36730,37660],[34,37660,39535]]}}