{"name":"20:68","price":"ہم نے فرمایا کچھ خوف نہ کر یقیناً تو ہی غالب اور برتر رہے گا.(1)","arabic":"قُلۡنَا لَا تَخَفۡ إِنَّكَ أَنتَ ٱلۡأَعۡلَىٰ","category":["20 (Ta-Ha)","Ta-Ha","Surah Ta-Ha","Chapter Ta-Ha","Ha","Surah Ha","Chapter Ha","Ta Ha","Surah Ta Ha","Chapter Ta Ha","Surah 20","Chapter 20","Ta-Ha","طه"],"ayahNumber":2416,"juzNumber":16,"footnotes":"(1) اس دہشت ناک منظر کو دیکھ کر اگر حضرت موسیٰ (عليه السلام) نے خوف محسوس کیا، تو یہ ایک طبعی چیز تھی، جو کمال نبوت کے منافی ہے نہ عصمت کے۔ کیونکہ نبی بھی بشر ہی ہوتا ہے اور بشریت کے طبعی تقاضوں سے نہ وہ بالا ہوتا ہے نہ ہو سکتا ہے، اس سے یہ بھی معلوم ہوا کہ جس طرح انبیاءکو دیگر انسانی عوارض لاحق ہوتے ہیں یا ہوسکتے ہیں، اسی طرح وہ جادو سے بھی متاثر ہوسکتے ہیں، جس طرح نبی (صلى الله عليه وسلم) پر بھی یہودیوں نے جادو کیا تھا، جس کے کچھ اثرات آپ محسوس کرتے تھے، اسے بھی منصب نبوت پر کوئی حرف نہیں آتا، کیوں کہ اس سے کار نبوت متاثر نہیں ہوتا، اللہ تعالیٰ نبی کی حفاظت فرماتا ہے اور جادو سے وحی یا فریضہ رسالت کی ادائیگی کو متاثر نہیں ہونے دیتا۔ اور ممکن ہے کہ یہ خوف اس لئے ہو کہ میری لاٹھی ڈالنے سے قبل ہی کہیں لوگ ان کرتبوں اور شعبدہ بازیوں سے متاثر نہ ہوجائیں، لیکن اغلب ہے کہ یہ خوف اس لئے ہوا کہ ان جادوگروں نے بھی جو کرتب دکھایا، وہ لاٹھیوں کے ذریعے سے ہی دکھایا، جب کہ موسیٰ (عليه السلام) کے پاس بھی لاٹھی ہی تھی جسے انہیں زمین پر پھینکنا تھا، موسیٰ (عليه السلام) کے دل میں یہ خیال آیا کہ دیکھنے والے اس سے شبہے اور مغالطے میں نہ پڑ جائیں اور وہ یہ نہ سمجھ لیں کہ دونوں نے ایک ہی قسم کا جادو پیش کیا، اس لئے یہ فیصلہ کیسے ہو کہ کون سا جادو ہے اور کون سے معجزہ؟ کون غالب ہے کون مغلوب؟ گویا جادو اور معجزے کا جو فرق واضح کرنا مقصود ہے، وہ مذکورہ مغالطے کی وجہ سے حاصل نہ ہوسکے گا، اس سے معلوم ہوا کہ انبیاء کو بسا اوقات یہ علم بھی نہیں ہوتا کہ ان کے ہاتھ پر کس نوعیت کا معجزہ ظہور پذیر ہونے والا ہے۔ خود معجزہ کو ظاہر کرنے پر قدرت تو دور کی بات ہے، یہ تو محض اللہ کا کام ہے کہ وہ انبیاء کے ہاتھ پر معجزات ظاہر فرمائے، بہرحال موسیٰ (عليه السلام) کے اندیشے اور خوف کو دور کرتے ہوئے اللہ تعالٰی نے فرمایا: موسیٰ! کسی بھی لحاظ سے ڈرنے کی ضرورت نہیں ہے، تو ہی غالب رہے گا، اس جملے سے طبعی خوف اور دیگر اندیشوں، سب کا ہی ازالہ فرما دیا۔ چنانچہ ایسا ہی ہوا، جیسا کہ اگلی آیات میں ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qul'nā lā takhaf innaka anta al-aʿlā ","translations":["We said","(Do) not","fear","Indeed, you","you","(will be) superior","(68)"],"transliterationArr":["qul'nā","lā","takhaf","innaka","anta","al-aʿlā",null],"verseTiming":[[1,0,940],[2,940,1410],[3,1410,2130],[4,2130,3770],[5,3770,4930],[6,4930,6245]]}}