{"name":"20:66","price":"جواب دیا کہ نہیں تم ہی پہلے ڈالو(1) ۔ اب تو موسیٰ (علیہ السلام) کو یہ خیال گزرنے لگا کہ ان کی رسیاں اور لکڑیاں ان کے جادو کے زور سے دوڑ بھاگ رہی ہیں.(2)","arabic":"قَالَ بَلۡ أَلۡقُواْۖ فَإِذَا حِبَالُهُمۡ وَعِصِيُّهُمۡ يُخَيَّلُ إِلَيۡهِ مِن سِحۡرِهِمۡ أَنَّهَا تَسۡعَىٰ","category":["20 (Ta-Ha)","Ta-Ha","Surah Ta-Ha","Chapter Ta-Ha","Ha","Surah Ha","Chapter Ha","Ta Ha","Surah Ta Ha","Chapter Ta Ha","Surah 20","Chapter 20","Ta-Ha","طه"],"ayahNumber":2414,"juzNumber":16,"footnotes":"(1) حضرت موسیٰ (عليه السلام) نے انہیں پہلے اپنا کرتب دکھانے کے لئے کہا، تاکہ ان پر یہ واضح ہو جائے کہ وہ جادو گروں کی اتنی بڑی تعداد سے، جو فرعون جمع کر کے لے آیا ہے، اسی طرح ان کے ساحرانہ کمال اور کرتبوں سے خوف زدہ نہیں ہیں۔ دوسرا ان کی ساحرانہ شعبدہ بازیاں، جب معجزہ الٰہی سے چشم زدن میں هَبَاءً مَنْثُورًا ہو جائیں گی، تو اس کا بہت اچھا اثر پڑے گا اور جادوگر یہ سوچنے پر مجبور ہو جائیں گے کہ یہ جادو نہیں ہے، واقعی اسے اللہ کی تائید حاصل ہے کہ آن واحد میں اس کی ایک لاٹھی ہمارے سارے کرتبوں کو نگل گئی۔\n(2) قرآن کے ان الفاظ سے معلوم ہوتا ہے کہ رسیاں اور لاٹھیاں حقیقتاً سانپ نہیں بنی تھیں، بلکہ جادو کے زور سے ایسا محسوس ہوتا تھا، جیسے مسمریزم کے ذریعے سے نظر بندی کر دی جاتی ہے۔ تاہم اس کا اثر یہ ضرور ہوتا ہے کہ عارضی اور وقتی طور پر دیکھنے والوں پر ایک دہشت طاری ہو جاتی ہے، گو شے کی حقیقت تبدیل نہ ہو۔ دوسری بات یہ معلوم ہوئی کہ جادو کتنا بھی اونچے درجے کا ہو، وہ شے کی حقیقت تبدیل نہیں کر سکتا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qāla bal alqū fa-idhā ḥibāluhum waʿiṣiyyuhum yukhayyalu ilayhi min siḥ'rihim annahā tasʿā ","translations":["He said","Nay","you throw","Then behold","Their ropes","and their staffs","seemed","to him","by","their magic","that they","(were) moving","(66)"],"transliterationArr":["qāla","bal","alqū","fa-idhā","ḥibāluhum","waʿiṣiyyuhum","yukhayyalu","ilayhi","min","siḥ'rihim","annahā","tasʿā",null],"verseTiming":[[1,0,650],[2,650,1030],[3,1030,2100],[4,2100,3270],[5,3270,4710],[6,4710,6230],[7,6230,7480],[8,7480,8360],[9,8360,8730],[10,8730,10220],[11,10220,11720],[12,11720,12715]]}}