{"name":"20:72","price":"انہوں نے جواب دیا کہ ناممکن ہے کہ ہم تجھے ترجیح دیں ان دلیلوں پر جو ہمارے سامنے آچکیں اور اس اللہ پر جس نے ہمیں پیدا کیا ہے(1) اب تو تو جو کچھ کرنے وﻻ ہے کر گزر، تو جو کچھ بھی حکم چلا سکتا ہے وه اسی دنیوی(2) زندگی میں ہی ہے.","arabic":"قَالُواْ لَن نُّؤۡثِرَكَ عَلَىٰ مَا جَآءَنَا مِنَ ٱلۡبَيِّنَٰتِ وَٱلَّذِي فَطَرَنَاۖ فَٱقۡضِ مَآ أَنتَ قَاضٍۖ إِنَّمَا تَقۡضِي هَٰذِهِ ٱلۡحَيَوٰةَ ٱلدُّنۡيَآ","category":["20 (Ta-Ha)","Ta-Ha","Surah Ta-Ha","Chapter Ta-Ha","Ha","Surah Ha","Chapter Ha","Ta Ha","Surah Ta Ha","Chapter Ta Ha","Surah 20","Chapter 20","Ta-Ha","طه"],"ayahNumber":2420,"juzNumber":16,"footnotes":"(1) یہ ترجمہ اس صورت میں ہے جب وَالَّذِي فَطَرَنَا کا عطف مَا جَاءَنَا پر ہو اور یہ بھی صحیح ہے تاہم بعض مفسرین نے اسے قسم قرار دیا ہے۔ یعنی قسم ہے اس ذات کی جس نے ہمیں پیدا کیا، ہم تجھے ان دلیلوں پر ترجیح نہیں دیں گے جو ہمارے سامنے آ چکیں۔\n(2) یعنی تیرے بس میں جو کچھ ہے وہ کر لے ہمیں معلوم ہے کہ تیرا بس صرف اس دنیا میں ہی چل سکتا ہے جب کہ ہم جس پروردگار پر ایمان لائے ہیں اس کی حکمرانی تو دنیا وآخرت دونوں جگہوں پر ہے مرنے کے بعد ہم تیری حکمرانی اور تیرے ظلم وستم سے تو بچ جائیں گے، کیونکہ جسموں سے روح کے نکل جانے کے بعد تیرا اختیار ختم ہو جائے گا۔ لیکن اگر ہم اپنے رب کے نافرمان رہے ،تو ہم مرنے کے بعد بھی رب کے اختیار سے باہر نہیں نکل سکتے، وہ ہمیں سخت عذاب دینے پر قادر ہے۔ رب پر ایمان لانے کے بعد ایک مومن کی زندگی میں جو عظیم انقلاب آنا اور دنیا کی بےثباتی اور آخرت کی دائمی زندگی پر جس طرح یقین ہونا چاہیے اور پھر اس عقیدہ وایمان پر جو تکلیفیں آئیں، انہیں جس حوصلہ وصبر اور عزم و استقامت سے برداشت کرنا چاہیے، جادو گروں نے اس کا ایک بہترین نمونہ پیش کیا کہ ایمان لانے سے قبل کس طرح وہ فرعون سے انعامات اور دنیاوی جاہ ومنصب کے طالب تھے لیکن ایمان لانے کے بعد کوئی ترغیب وتحریض انہیں متزلزل کر سکی نہ تشدید وتعذیب کی دھمکیاں انہیں ایمان سے منحرف کرنے میں کامیاب ہو سکیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qālū lan nu'thiraka ʿalā mā jāanā mina al-bayināti wa-alladhī faṭaranā fa-iq'ḍi mā anta qāḍin innamā taqḍī hādhihi al-ḥayata al-dun'yā ","translations":["They said","Never","we will prefer you","over","what","has come to us","of","the clear proofs","and the One Who","created us","So decree","whatever","you","(are) decreeing","Only","you can decree","(for) this","life","(of) the world","(72)"],"transliterationArr":["qālū","lan","nu'thiraka","ʿalā","mā","jāanā","mina","al-bayināti","wa-alladhī","faṭaranā","fa-iq'ḍi","mā","anta","qāḍin","innamā","taqḍī","hādhihi","al-ḥayata","al-dun'yā",null],"verseTiming":[[1,0,930],[2,930,1340],[3,1340,3070],[4,3070,3790],[5,3790,4020],[6,4020,6600],[7,6600,6930],[8,6930,8600],[9,8600,9630],[10,9630,10860],[11,10860,11980],[12,11980,13770],[13,13770,14980],[14,14980,16610],[15,16610,17860],[16,17860,19940],[17,19940,20850],[18,20850,21780],[19,21780,22830],[20,22830,24035]]}}