{"name":"20:80","price":"اے بنی اسرائیل! دیکھو ہم نے تمہیں تمہارے دشمن سے نجات دی اور تم سے کوه طور کی دائیں طرف کا وعده(1) کیا اور تم پر من وسلویٰ اتارا.(2)","arabic":"يَٰبَنِيٓ إِسۡرَٰٓءِيلَ قَدۡ أَنجَيۡنَٰكُم مِّنۡ عَدُوِّكُمۡ وَوَٰعَدۡنَٰكُمۡ جَانِبَ ٱلطُّورِ ٱلۡأَيۡمَنَ وَنَزَّلۡنَا عَلَيۡكُمُ ٱلۡمَنَّ وَٱلسَّلۡوَىٰ","category":["20 (Ta-Ha)","Ta-Ha","Surah Ta-Ha","Chapter Ta-Ha","Ha","Surah Ha","Chapter Ha","Ta Ha","Surah Ta Ha","Chapter Ta Ha","Surah 20","Chapter 20","Ta-Ha","طه"],"ayahNumber":2428,"juzNumber":16,"footnotes":"(1) وَوَاعَدْنَاكُمْ میں ضمیر جمع مخاطب کی ہے، اس کا مطلب یہ ہے کہ موسیٰ (عليه السلام) کوہ طور پر تمہیں یعنی تمہارے نمائندے بھی ساتھ لے کر آئیں تاکہ تمہارے سامنے ہی ہم موسیٰ (عليه السلام) سے ہم کلام ہوں، یا ضمیر جمع اس لئے لائی گئی کہ کوہ طور پر موسیٰ (عليه السلام) کو بلانا، بنی اسرائیل ہی کی خاطر اور انہی کی ہدایت و رہنمائی کے لئے تھا۔\n(2) مَنٌّ وَسَلْوَى کے نزول کا واقعہ، سورہ بقرہ کے آغاز میں گزر چکا ہے۔ مَنٌّ کوئی میٹھی چیز تھی جو آسمان سے نازل ہوئی تھی اور سَلْوَىٰ سے مراد بٹیر پرندے ہیں جو کثرت سے ان کے پاس آتے اور وہ حسب ضرورت انہیں پکڑ کر پکاتے اور کھا لیتے۔ (ابن کثیر)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yābanī is'rāīla qad anjaynākum min ʿaduwwikum wawāʿadnākum jāniba al-ṭūri al-aymana wanazzalnā ʿalaykumu al-mana wal-salwā ","translations":["O Children of Israel","O Children of Israel","Verily","We delivered you","from","your enemy","and We made a covenant with you","on (the) side","(of) the Mount","the right","and We sent down","to you","the Manna","and the quails","(80)"],"transliterationArr":["yābanī","is'rāīla","qad","anjaynākum","min","ʿaduwwikum","wawāʿadnākum","jāniba","al-ṭūri","al-aymana","wanazzalnā","ʿalaykumu","al-mana","wal-salwā",null],"verseTiming":[[1,0,2620],[2,2620,5590],[3,5590,5980],[4,5980,8110],[5,8110,8920],[6,8920,10250],[7,10250,12130],[8,12130,12840],[9,12840,13740],[10,13740,14770],[11,14770,16310],[12,16310,18210],[13,18210,19280],[14,19280,20860],[15,20860,22185]]}}