{"name":"20:94","price":"ہارون (علیہ السلام) نے کہا اے میرے ماں جائے بھائی! میری داڑھی نہ پکڑ اور سر کے بال نہ کھینچ، مجھے تو صرف یہ خیال دامن گیر ہوا کہ کہیں آپ یہ (نہ) فرمائیں(1) کہ تو نے بنی اسرائیل میں تفرقہ ڈال دیا اور میری بات کا انتظار نہ کیا.(2)","arabic":"قَالَ يَبۡنَؤُمَّ لَا تَأۡخُذۡ بِلِحۡيَتِي وَلَا بِرَأۡسِيٓۖ إِنِّي خَشِيتُ أَن تَقُولَ فَرَّقۡتَ بَيۡنَ بَنِيٓ إِسۡرَٰٓءِيلَ وَلَمۡ تَرۡقُبۡ قَوۡلِي","category":["20 (Ta-Ha)","Ta-Ha","Surah Ta-Ha","Chapter Ta-Ha","Ha","Surah Ha","Chapter Ha","Ta Ha","Surah Ta Ha","Chapter Ta Ha","Surah 20","Chapter 20","Ta-Ha","طه"],"ayahNumber":2442,"juzNumber":16,"footnotes":"(1) حضرت موسیٰ (عليه السلام) قوم کو شرک کی گمراہی میں دیکھ کر سخت غضب ناک تھے اور سمجھتے تھے کہ شاید اس میں ان کے بھائی ہارون (عليه السلام) کی، جن کو وہ اپنا خلیفہ بنا کر گئے تھے، مداہنت کا بھی دخل ہو، اس لئے سخت غصے میں ہارون (عليه السلام) کی داڑھی اور سر پکڑ کر انہیں جھنجھوڑنا اور پوچھنا شروع کیا، جس پر حضرت ہارون (عليه السلام) نے انہیں اتنا سخت رویہ اپنانے سے روکا۔\n(2) سورہ اعراف میں حضرت ہارون (عليه السلام) کا جواب یہ نقل ہوا ہے کہ ”قوم نے مجھے کمزور خیال کیا اور میرے قتل کے درپے ہوگئی“ (آیت: ۱4۲) جس کا مطلب یہ ہے کہ حضرت ہارون (عليه السلام) نے اپنی ذمے داری پوری طرح نبھائی اور انہیں سمجھا نے اور گو سالہ پرستی سے روکنے میں مداہنت اور کوتاہی نہیں کی۔ لیکن معاملے کو اس حد تک نہیں جانے دیا کہ خانہ جنگی شروع ہو جائے کیونکہ ہارون (عليه السلام) کے قتل کا مطلب پھر ان کے حامیوں اور مخالفوں میں آپس میں خونی تصادم ہوتا اور بنی اسرائیل واضح طور پر دو گروہوں میں بٹ جاتے جو ایک دوسرے کے خون کے پیاسے ہوتے۔ حضرت موسیٰ (عليه السلام) چوں کہ خود وہاں موجود نہ تھے اس لیے صورت حال کی نزاکت سے بے خبر تھے اسی بنا پر حضرت ہارون (عليه السلام) کو انہوں نے سخت سست کہا ۔لیکن پھر وضاحت پر وہ اصل مجرم کی طرف متوجہ ہوئے اس لیے یہ استدلال صحیح نہیں (جیسا کہ بعض لوگ کرتے ہیں) کہ مسلمانوں کے اتحاد واتفاق کی خاطر شرکیہ امور اور باطل چیزوں کو بھی برداشت کر لینا چاہیے کیونکہ حضرت ہارون (عليه السلام) نے نہ ایسا کیا ہی ہے نہ ان کے قول کا یہ مطلب ہی ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qāla yabna-umma lā takhudh biliḥ'yatī walā birasī innī khashītu an taqūla farraqta bayna banī is'rāīla walam tarqub qawlī ","translations":["He said","O son of my mother","(Do) not","seize (me)","by my beard","and not","by my head","Indeed, I","[I] feared","that","you would say","You caused division","between","(the) Children of Israel","(the) Children of Israel","and not","you respect","my word","(94)"],"transliterationArr":["qāla","yabna-umma","lā","takhudh","biliḥ'yatī","walā","birasī","innī","khashītu","an","taqūla","farraqta","bayna","banī","is'rāīla","walam","tarqub","qawlī",null],"verseTiming":[[1,0,770],[2,770,2890],[3,2890,3210],[4,3210,4100],[5,4100,5420],[6,5420,6070],[7,6070,7350],[8,7350,9270],[9,9270,10190],[10,10190,11250],[11,11250,12250],[12,12250,13310],[13,13310,13960],[14,13960,15590],[15,15590,18510],[16,18510,19130],[17,19130,20000],[18,20000,21295]]}}