{"name":"20:97","price":"کہا اچھا جا دنیا کی زندگی میں تیری سزا یہی ہے کہ تو کہتا رہے کہ مجھے نہ چھونا(1) ، اور ایک اور بھی وعده تیرے ساتھ ہے جو تجھ سے ہر گز نہ ٹلے گا(2)، اور اب تو اپنے اس معبود کو بھی دیکھ لینا جس کا اعتکاف کیے ہوئے تھا کہ ہم اسے جلا کر دریا میں ریزه ریزه اڑا دیں گے.(3)","arabic":"قَالَ فَٱذۡهَبۡ فَإِنَّ لَكَ فِي ٱلۡحَيَوٰةِ أَن تَقُولَ لَا مِسَاسَۖ وَإِنَّ لَكَ مَوۡعِدٗا لَّن تُخۡلَفَهُۥۖ وَٱنظُرۡ إِلَىٰٓ إِلَٰهِكَ ٱلَّذِي ظَلۡتَ عَلَيۡهِ عَاكِفٗاۖ لَّنُحَرِّقَنَّهُۥ ثُمَّ لَنَنسِفَنَّهُۥ فِي ٱلۡيَمِّ نَسۡفًا","category":["20 (Ta-Ha)","Ta-Ha","Surah Ta-Ha","Chapter Ta-Ha","Ha","Surah Ha","Chapter Ha","Ta Ha","Surah Ta Ha","Chapter Ta Ha","Surah 20","Chapter 20","Ta-Ha","طه"],"ayahNumber":2445,"juzNumber":16,"footnotes":"(1) یعنی عمر بھر تو یہی کہتا رہے گا کہ مجھ سے دور رہو، مجھے نہ چھونا، اس لئے کہ اسے چھو تے ہی چھونے والا بھی اور یہ سامری بھی دونوں بخار میں مبتلا ہو جاتے۔ اس لئے جب کسی انسان کو دیکھتا تو فوراً چیخ اٹھتا لا مِسَاسَ۔ کہا جاتا ہے کہ پھر یہ انسانوں کی بستی سے نکل کر جنگل میں چلا گیا، جہاں جانوروں کے ساتھ اس کی زندگی گزری اور یوں عبرت کا نمونہ بنا رہا، گویا لوگوں کو گمراہ کرنے کے لئے جو شخص جتنا زیادہ حیلہ و فن اور مکر و فریب اختیار کرے گا، دنیا اور آخرت میں اس کی سزا بھی اسی حساب سے شدید تر اور نہایت عبرت ناک ہوگی۔\n(2) یعنی آخرت کا عذاب اس کے علاوہ ہے جو ہرصورت بھگتنا پڑے گا۔\n(3) اس سے معلوم ہوا کہ شرک کے آثار ختم کرنا بلکہ ان کا نام ونشان تک مٹا ڈالنا چاہیے ان کی نسبت کتنی ہی مقدس ہستیوں کی طرف ہو، توہین نہیں، جیسا کہ اہل بدعت، قبر پرست اور تعزیہ پرست باور کراتے ہیں بلکہ یہ توحید کا منشا اور دینی غیرت کا تقاضا ہے جیسے اس واقعے میں اس أَثَرِ الرَّسُولِ کو نہیں دیکھا گیا جس سے ظاہری طور پر روحانی برکات کا مشاہدہ بھی کیا گیا اس کے باوجود اس کی پروا نہیں کی گئی اس لیے کہ وہ شرک کا ذریعہ بن گیا تھا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qāla fa-idh'hab fa-inna laka fī al-ḥayati an taqūla lā misāsa wa-inna laka mawʿidan lan tukh'lafahu wa-unẓur ilā ilāhika alladhī ẓalta ʿalayhi ʿākifan lanuḥarriqannahu thumma lanansifannahu fī al-yami nasfan ","translations":["He said","Then go","And indeed","for you","in","the life","that","you will say","(Do) not","touch","And indeed","for you","(is) an appointment","never","you will fail to (keep) it","And look","at","your god","that which","you have remained","to it","devoted","Surely we will burn it","then","certainly we will scatter it","in","the sea","(in) particles","(97)"],"transliterationArr":["qāla","fa-idh'hab","fa-inna","laka","fī","al-ḥayati","an","taqūla","lā","misāsa","wa-inna","laka","mawʿidan","lan","tukh'lafahu","wa-unẓur","ilā","ilāhika","alladhī","ẓalta","ʿalayhi","ʿākifan","lanuḥarriqannahu","thumma","lanansifannahu","fī","al-yami","nasfan",null],"verseTiming":[[1,0,620],[2,620,1570],[3,1570,2710],[4,2710,3190],[5,3190,3450],[6,3450,4640],[7,4640,5500],[8,5500,6520],[9,6520,6910],[10,6910,9740],[11,9740,10820],[12,10820,11370],[13,11370,12250],[14,12250,13750],[15,13750,15250],[16,15250,16680],[17,16680,18130],[18,18130,19320],[19,19320,20120],[20,20120,20830],[21,20830,21750],[22,21750,23460],[23,23460,26360],[24,26360,27570],[25,27570,30820],[26,30820,31080],[27,31080,32400],[28,32400,33815]]}}