{"name":"21:107","price":"اور ہم نے آپ کو تمام جہان والوں کے لئے رحمت بنا کر ہی بھیجا ہے.(1)","arabic":"وَمَآ أَرۡسَلۡنَٰكَ إِلَّا رَحۡمَةٗ لِّلۡعَٰلَمِينَ","category":["21 (Al-Anbiya)","Al-Anbiya","Surah Al-Anbiya","Chapter Al-Anbiya","Anbiya","Surah Anbiya","Chapter Anbiya","Al Anbiya","Surah Al Anbiya","Chapter Al Anbiya","Surah 21","Chapter 21","The Prophets","الأنبيَاء"],"ayahNumber":2590,"juzNumber":17,"footnotes":"(1) اس کا مطلب یہ ہے کہ آپ (صلى الله عليه وسلم) کی رسالت پر ایمان لے آئے گا اس نے گویا اس رحمت کو قبول کر لیا اور اللہ کی اس نعمت کا شکر ادا کیا۔ نتیجتًا دنیا و آخرت کی سعادتوں سے ہمکنار ہوگا اور اور چونکہ آپ (صلى الله عليه وسلم) کی رسالت پورے جہان کے لیے ہے اس لیے آپ (صلى الله عليه وسلم) پورے جہان کے لیے رحمت بن کر یعنی اپنی تعلیمات کے ذریعے سے دین و دنیا کی سعادتوں سے ہمکنار کرنے کے لیے آئے ہیں بعض لوگوں نے اس اعتبار سے بھی نبی (صلى الله عليه وسلم) کو جہان والوں کے لیے رحمت قرار دیا ہے کہ آپ (صلى الله عليه وسلم) کی وجہ سے یہ امت بالکلیہ تباہی و بربادی سے محفوظ کر دی گئی جیسے پچھلی قومیں اور امتیں حرف غلط کی طرح مٹا دی جاتی رہیں امت محمدیہ (جو امت اجابت اور امت دعوت کے اعتبار سے پوری نوع انسانی پر مشتمل ہے) پر اس طرح کا کلی عذاب نہیں آئے اور احادیث سے معلوم ہوتا ہے کہ مشرکین کے لیے بد دعا نہ کرنا یہ بھی آپ (صلى الله عليه وسلم) کی رحمت کا ایک حصہ تھا۔ «إِنِّي لَمْ أُبْعَثْ لَعَّانًا بُعِثْتُ رَحْمَةً» (صحيح مسلم نمبر:2006) اسی طرح غصے میں کسی مسلمان کو لعنت یا سب وشتم کرنے کو بھی قیامت والے دن رحمت کا باعث قرار دینا آپ (صلى الله عليه وسلم) کی رحمت کا حصہ ہے (مسند أحمد 5/ 437 أبو داود نمبر 4659 والأحاديث الصحيحة للألباني نمبر1758) اسی لیے ایک حدیث میں آپ (صلى الله عليه وسلم) نے فرمایا «إِنَّمَا أَنَا رَحْمَةٌ مُهْدَاةٌ» (صحيح الجامع الصغير نمبر2345) میں رحمت مجسم بن کر آیا ہوں جو اللہ کی طرف سے اہل جہان کے لیے ایک ہدیہ ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wamā arsalnāka illā raḥmatan lil'ʿālamīna ","translations":["And not","We have sent you","but","(as) a mercy","for the worlds","(107)"],"transliterationArr":["wamā","arsalnāka","illā","raḥmatan","lil'ʿālamīna",null],"verseTiming":[[1,0,2070],[2,2070,3480],[3,3480,4310],[4,4310,5120],[5,5120,8155]]}}