{"name":"21:105","price":"ہم زبور میں پند ونصیحت کے بعد یہ لکھ چکے ہیں کہ زمین کے وارث میرے نیک بندے(1) (ہی) ہوں گے.","arabic":"وَلَقَدۡ كَتَبۡنَا فِي ٱلزَّبُورِ مِنۢ بَعۡدِ ٱلذِّكۡرِ أَنَّ ٱلۡأَرۡضَ يَرِثُهَا عِبَادِيَ ٱلصَّٰلِحُونَ","category":["21 (Al-Anbiya)","Al-Anbiya","Surah Al-Anbiya","Chapter Al-Anbiya","Anbiya","Surah Anbiya","Chapter Anbiya","Al Anbiya","Surah Al Anbiya","Chapter Al Anbiya","Surah 21","Chapter 21","The Prophets","الأنبيَاء"],"ayahNumber":2588,"juzNumber":17,"footnotes":"(1) زبور سے مراد یا تو زبور ہی ہے اور ذکر سے مراد پندونصیحت جیسا کہ ترجمہ میں درج ہے یا پھر زبور سے مراد گذشتہ آسمانی کتابیں اور ذکر سے مراد لوح محفوظ ہے۔ یعنی پہلے لوح محفوظ میں یہ بات درج ہے اور اس کے بعد آسمانی کتابوں میں بھی یہ بات لکھی جاتی رہی ہے کہ زمین کے وارث نیک بندے ہونگے۔ زمین سے مراد بعض مفسرین کے نزدیک جنت ہے اور بعض کے نزدیک ارض کفار۔ یعنی اللہ کے نیک بندے زمین میں اقتدار اور سرخرو رہے اور آئندہ بھی جب کبھی وہ اس صفت کے حامل ہوں گے، اس وعدہ الٰہی کے مطابق، زمین کا اقتدار انہی کے پاس ہوگا۔ اس لیے مسلمانوں کی محرومی اقتدار کی موجودہ صورت حال کسی اشکال کا باعث نہیں بننی چاہیے یہ وعدہ مشروط ہے صالحیت عباد کے ساتھ اور إِذَا فَاتَ الشَّرْطُ فَاتَ الْمَشْرُوطُ کے مطابق جب مسلمان اس خوبی سے محروم ہوگئے تو اقتدار سے بھی محروم کردئیے گئے اس میں گویا حصول اقتدار کا طریقہ بتلایا گیا ہے اور وہ ہے صالحیت یعنی اللہ رسول کے احکامات کے مطابق زندگی گزارنا اور اس کے حدود وضابطوں پر کاربند رہنا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walaqad katabnā fī al-zabūri min baʿdi al-dhik'ri anna al-arḍa yarithuhā ʿibādiya al-ṣāliḥūna ","translations":["And verily","We have written","in","the Scripture","after","after","the mention","that","the earth ","will inherit it","My slaves","the righteous","(105)"],"transliterationArr":["walaqad","katabnā","fī","al-zabūri","min","baʿdi","al-dhik'ri","anna","al-arḍa","yarithuhā","ʿibādiya","al-ṣāliḥūna",null],"verseTiming":[[1,0,870],[2,870,1850],[3,1850,2080],[4,2080,3050],[5,3050,3930],[6,3930,4850],[7,4850,5580],[8,5580,6620],[9,6620,7470],[10,7470,8470],[11,8470,9480],[12,9480,12375]]}}