{"name":"21:18","price":"بلکہ ہم سچ کو جھوٹ پر پھینک مارتے ہیں پس سچ جھوٹ کا سر توڑ دیتا ہے(1) اور وه اسی وقت نابود ہو جاتا ہے، تم جو باتیں بناتے ہو وه تمہاری لئے باعﺚ خرابی ہیں.(2)","arabic":"بَلۡ نَقۡذِفُ بِٱلۡحَقِّ عَلَى ٱلۡبَٰطِلِ فَيَدۡمَغُهُۥ فَإِذَا هُوَ زَاهِقٞۚ وَلَكُمُ ٱلۡوَيۡلُ مِمَّا تَصِفُونَ","category":["21 (Al-Anbiya)","Al-Anbiya","Surah Al-Anbiya","Chapter Al-Anbiya","Anbiya","Surah Anbiya","Chapter Anbiya","Al Anbiya","Surah Al Anbiya","Chapter Al Anbiya","Surah 21","Chapter 21","The Prophets","الأنبيَاء"],"ayahNumber":2501,"juzNumber":17,"footnotes":"(1) یعنی تخلیق کائنات کے مقاصد میں سے ایک اہم مقصد یہ ہے کہ یہاں حق و باطل کی جو معرکہ آرائی اور خیرو شر کے درمیان جو تصادم ہے، اس میں ہم حق اور خیر کو غالب اور باطل اور شر کو مغلوب کریں چنانچہ ہم حق کو باطل پر یا سچ کو جھوٹ پر یا خیر کو شر پر مارتے ہیں، جس سے باطل، جھوٹ اور شر کا بھیجہ نکل جاتا ہے اور چشم زدن میں وہ نابود ہو جاتا ہے۔ دَمْغٌ سر کی ایسی چوٹ کو کہتے ہیں جو دماغ تک پہنچ جائے، زَهَقَ کے معنی، ختم یا ہلاک و تلف ہوجانے کے ہیں۔\n(2) یعنی رب کی طرف سے تم جو بےسرو پا باتیں منسوب کرتے یا اس کی بابت باور کراتے ہو، (مثلاً یہ کائنات ایک کھیل ہے، ایک کھلنڈرے کا شوق فضول ہے وغیرہ) یہ تمہاری ہلاکت کا باعث ہے۔ کیونکہ اسے کھیل تماشہ سمجھنے کی وجہ سے تم حق سے گریز اور باطل کو اختیار کرنے میں کوئی تامل اور خوف محسوس نہیں کرتے، جس کا نتیجہ بالآخر تمہاری بربادی اور ہلاکت ہی ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"bal naqdhifu bil-ḥaqi ʿalā al-bāṭili fayadmaghuhu fa-idhā huwa zāhiqun walakumu al-waylu mimmā taṣifūna ","translations":["Nay","We hurl","the truth","against","[the] falsehood","and it breaks its head","behold","it (is)","vanishing","And for you","(is) destruction","for what","you ascribe","(18)"],"transliterationArr":["bal","naqdhifu","bil-ḥaqi","ʿalā","al-bāṭili","fayadmaghuhu","fa-idhā","huwa","zāhiqun","walakumu","al-waylu","mimmā","taṣifūna",null],"verseTiming":[[1,0,490],[2,490,1260],[3,1260,2200],[4,2200,2550],[5,2550,3640],[6,3640,5050],[7,5050,5780],[8,5780,6130],[9,6130,7380],[10,7380,8140],[11,8140,8950],[12,8950,10390],[13,10390,12895]]}}