{"name":"21:34","price":"آپ سے پہلے کسی انسان کو بھی ہم نے ہمیشگی نہیں دی، کیا اگر آپ مرگئے تو وه ہمیشہ کے لئے ره جائیں گے.(1)","arabic":"وَمَا جَعَلۡنَا لِبَشَرٖ مِّن قَبۡلِكَ ٱلۡخُلۡدَۖ أَفَإِيْن مِّتَّ فَهُمُ ٱلۡخَٰلِدُونَ","category":["21 (Al-Anbiya)","Al-Anbiya","Surah Al-Anbiya","Chapter Al-Anbiya","Anbiya","Surah Anbiya","Chapter Anbiya","Al Anbiya","Surah Al Anbiya","Chapter Al Anbiya","Surah 21","Chapter 21","The Prophets","الأنبيَاء"],"ayahNumber":2517,"juzNumber":17,"footnotes":"(1) یہ کفار کے جواب میں، نبی (صلى الله عليه وسلم) کی بابت کہتے تھے کہ ایک دن اسے مر ہی جانا ہے۔ اللہ تعالٰی نے فرمایا، موت تو ہر انسان کو آنی ہے اور اس اصول سے یقینا محمد رسول اللہ (صلى الله عليه وسلم) بھی مستشنٰی نہیں۔ کیونکہ وہ بھی انسان ہی ہیں اور ہم نے انسان کے لئے بھی دوام اور ہمیشگی نہیں رکھی ہے۔ لیکن کیا بات کہنے والے خود نہیں مریں گے۔؟ اس سے صنم پرستوں کی بھی تردید ہوگئی جو دیوتاؤں کی اور انبیاء واولیاء کی زندگی کے قائل ہیں اور اسی بنیاد پر ان کو حاجت روا مشکل کشا سمجھتے ہیں۔ فَنَعُوذُ بِاللهِ مِنْ هَذِهِ الْعَقِيدَةِ الْفَاسِدَةِ الَّتِي تُعَارِضُ الْقُرْآنَ۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wamā jaʿalnā libasharin min qablika al-khul'da afa-in mitta fahumu al-khālidūna ","translations":["And not","We made","for any man","before you","before you","[the] immortality","so if","you die","then (would) they","live forever","(34)"],"transliterationArr":["wamā","jaʿalnā","libasharin","min","qablika","al-khul'da","afa-in","mitta","fahumu","al-khālidūna",null],"verseTiming":[[1,0,700],[2,700,1740],[3,1740,2500],[4,2500,3920],[5,3920,4780],[6,4780,5960],[7,5960,6590],[8,6590,7850],[9,7850,8410],[10,8410,11305]]}}