{"name":"21:30","price":"کیا کافر لوگوں نے یہ نہیں دیکھا(1) کہ آسمان وزمین باہم ملے جلے تھے پھر ہم نے انہیں جدا کیا(2) اور ہر زنده چیز کو ہم نے پانی سے پیدا کیا(3)، کیا یہ لوگ پھر بھی ایمان نہیں ﻻتے.","arabic":"أَوَلَمۡ يَرَ ٱلَّذِينَ كَفَرُوٓاْ أَنَّ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ كَانَتَا رَتۡقٗا فَفَتَقۡنَٰهُمَاۖ وَجَعَلۡنَا مِنَ ٱلۡمَآءِ كُلَّ شَيۡءٍ حَيٍّۚ أَفَلَا يُؤۡمِنُونَ","category":["21 (Al-Anbiya)","Al-Anbiya","Surah Al-Anbiya","Chapter Al-Anbiya","Anbiya","Surah Anbiya","Chapter Anbiya","Al Anbiya","Surah Al Anbiya","Chapter Al Anbiya","Surah 21","Chapter 21","The Prophets","الأنبيَاء"],"ayahNumber":2513,"juzNumber":17,"footnotes":"(1) اس سے رؤیت عینی نہیں، رؤیت قلبی مراد ہے۔ یعنی کیا انہوں نے غور فکر نہیں کیا؟ یا انہوں نے جانا نہیں؟۔\n(2) رَتْقٌ کے معنی، بند کے اور فَتْقٌ کے معنی پھاڑنے، کھولنے اور الگ الگ کرنے کے ہیں۔ یعنی آسمان و زمین، ابتدائے امر ہیں، باہم ملے ہوئے اور ایک دوسرے کے ساتھ پیوست تھے۔ ہم نے ان کو ایک دوسرے سے الگ کیا، آسمانوں کو اوپر کر دیا جس سے بارش برستی ہے اور زمین کو اپنی جگہ پر رہنے دیا، تاہم وہ پیداوار کے قابل ہوگئی۔\n(3) اس سے مراد اگر بارش اور چشموں کا پانی ہے، تب بھی واضح ہے کہ اس کی روئیدگی ہوتی ہے اور ہر ذی روح کو حیات نو ملتی ہے اور اگر مراد نطفہ ہے، تو اس میں بھی کوئی اشکال نہیں کہ ہر زندہ چیز کے وجود کے باعث وہ قطرہ آب ہے جو نر کی پیٹھ کی ہڈیوں سے نکلتا اور مادہ کے رحم میں جاکر قرار پکڑتا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"awalam yara alladhīna kafarū anna al-samāwāti wal-arḍa kānatā ratqan fafataqnāhumā wajaʿalnā mina al-māi kulla shayin ḥayyin afalā yu'minūna ","translations":["Do not","see","those who","disbelieved","that","the heavens","and the earth","were","a joined entity","then We parted them","and We made","from","[the] water","every","living thing","living thing","Then will not","they believe","(30)"],"transliterationArr":["awalam","yara","alladhīna","kafarū","anna","al-samāwāti","wal-arḍa","kānatā","ratqan","fafataqnāhumā","wajaʿalnā","mina","al-māi","kulla","shayin","ḥayyin","afalā","yu'minūna",null],"verseTiming":[[1,0,900],[2,900,1250],[3,1250,2230],[4,2230,4380],[5,4380,5310],[6,5310,6870],[7,6870,7870],[8,7870,8760],[9,8760,9970],[10,9970,12130],[11,12130,14050],[12,14050,14350],[13,14350,17110],[14,17110,17660],[15,17660,18510],[16,18510,19320],[17,19320,20110],[18,20110,22725]]}}