{"name":"21:47","price":"قیامت کے دن ہم درمیان میں ﻻ رکھیں گے ٹھیک ٹھیک تولنے والی ترازو کو۔ پھر کسی پر کچھ بھی ﻇلم نہ کیا جائے گا۔ اور اگر ایک رائی کے دانے کے برابر بھی عمل ہوگا ہم اسے ﻻ حاضر کریں گے، اور ہم کافی ہیں حساب کرنے والے.(1)","arabic":"وَنَضَعُ ٱلۡمَوَٰزِينَ ٱلۡقِسۡطَ لِيَوۡمِ ٱلۡقِيَٰمَةِ فَلَا تُظۡلَمُ نَفۡسٞ شَيۡـٔٗاۖ وَإِن كَانَ مِثۡقَالَ حَبَّةٖ مِّنۡ خَرۡدَلٍ أَتَيۡنَا بِهَاۗ وَكَفَىٰ بِنَا حَٰسِبِينَ","category":["21 (Al-Anbiya)","Al-Anbiya","Surah Al-Anbiya","Chapter Al-Anbiya","Anbiya","Surah Anbiya","Chapter Anbiya","Al Anbiya","Surah Al Anbiya","Chapter Al Anbiya","Surah 21","Chapter 21","The Prophets","الأنبيَاء"],"ayahNumber":2530,"juzNumber":17,"footnotes":"(1) مَوَازِينُ، مِيزَانٌ (ترازو) کی جمع ہے وزن اعمال کے لئے قیامت والے دن یا تو کئی ترازو ہونگے یا ترازو تو ایک ہی ہوگی انسان کے اعمال تو بےوزن ہیں یعنی ان کا کوئی ظاہری وجود یا جسم تو ہے نہیں پھر وزن کس طرح ہوگا؟ یہ سوال آج سے قبل تک شاید کوئی اہمیت رکھتا ہو۔ لیکن آج سائنسی ایجادات نے اسے ممکن بنا دیا ہے۔ اب ان ایجادات کے ذریعے سے بےوزن چیزوں کا وزن بھی تولا جانے لگا ہے۔ جب انسان اس بات پر قادر ہوگیا ہے، تو اللہ کے لئے ان اعمال کا، جو اعراض ہیں، وزن کرنا کون سا مشکل امر ہے، اس کی تو شان ہی عَلَى كُلِّ شَيْءٍ قَدِيرٌہے۔ علاوہ ازیں یہ بھی ممکن ہے کہ انسانوں کو دکھلانے کے لئے ان بےوزن اعمال کو وہ اجسام میں بدل دے گا اور پھر وزن کرے، جیسا کہ حدیث میں بعض اعمالوں کے مجسم ہونے کا ثبوت ملتا ہے۔ مثلا! صاحب قرآن کے لئے ایک خوش شکل نوجوان کی شکل میں آئے گا۔ اور پوچھے گا، تو کون ہے؟ وہ کہے گا میں قرآن ہوں جسے تو راتوں کو (قیام اللیل) بیدار رہ کر اور دن کو پیاسا رہ کر پڑھا کرتا تھا ( مسند أحمد 5/ 348 ، 235 وابن ماجه، كتاب الأدب، باب ثواب القرآن )، اسی طرح مومن کی قبر میں عمل صالح ایک خوش رنگ اور معطر نوجوان کی شکل میں آئے گا اور کافر اور منافق کے پاس اس کی برعکس شکل میں (مسند أحمد 5/287)۔ اس کی مزید تفصیل کے لیے دیکھئے سورۃ الاعراف ۷ کا حاشیہ القِسْطَ مصدر اور الْمَوَازِينَ کی صفت ہے معنی ہیں ذَوَاتُ قِسْطٍ انصاف کرنے والی ترازو یا ترازوئیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wanaḍaʿu al-mawāzīna al-qis'ṭa liyawmi al-qiyāmati falā tuẓ'lamu nafsun shayan wa-in kāna mith'qāla ḥabbatin min khardalin ataynā bihā wakafā binā ḥāsibīna ","translations":["And We set","the scales","(of) the justice","for (the) Day","(of) the Resurrection","so not","will be wronged","any soul","(in) anything","And if","(there) be","weight","(of) a seed","of","a mustard","We will bring","[with] it","And sufficient","(are) We","(as) Reckoners","(47)"],"transliterationArr":["wanaḍaʿu","al-mawāzīna","al-qis'ṭa","liyawmi","al-qiyāmati","falā","tuẓ'lamu","nafsun","shayan","wa-in","kāna","mith'qāla","ḥabbatin","min","khardalin","ataynā","bihā","wakafā","binā","ḥāsibīna",null],"verseTiming":[[1,0,810],[2,810,2200],[3,2200,3120],[4,3120,3910],[5,3910,5180],[6,5180,5770],[7,5770,6580],[8,6580,7850],[9,7850,9750],[10,9750,10230],[11,10230,11530],[12,11530,12560],[13,12560,13570],[14,13570,14450],[15,14450,15540],[16,15540,16610],[17,16610,17340],[18,17340,18630],[19,18630,19350],[20,19350,23535]]}}