{"name":"21:41","price":"اور تجھ سے پہلے رسولوں کے ساتھ بھی ہنسی مذاق کیا گیا پس ہنسی کرنے والوں کو ہی اس چیز نے گھیر لیا جس کی وه ہنسی اڑاتے تھے.(1)","arabic":"وَلَقَدِ ٱسۡتُهۡزِئَ بِرُسُلٖ مِّن قَبۡلِكَ فَحَاقَ بِٱلَّذِينَ سَخِرُواْ مِنۡهُم مَّا كَانُواْ بِهِۦ يَسۡتَهۡزِءُونَ","category":["21 (Al-Anbiya)","Al-Anbiya","Surah Al-Anbiya","Chapter Al-Anbiya","Anbiya","Surah Anbiya","Chapter Anbiya","Al Anbiya","Surah Al Anbiya","Chapter Al Anbiya","Surah 21","Chapter 21","The Prophets","الأنبيَاء"],"ayahNumber":2524,"juzNumber":17,"footnotes":"(1) رسول اللہ (صلى الله عليه وسلم) کو تسلی دی جا رہی ہے کہ مشرکین کے استہزاء اور تکذیب سے بد دل نہ ہوں، یہ کوئی نئی بات نہیں ہے، تجھ سے پہلے آنے والے پیغمبروں کے ساتھ بھی یہی معاملہ کیا گیا، بالآخر وہی عذاب ان پر الٹ پڑا، یعنی اس نے انہیں گھیر لیا، جس کا وہ استہزاء و مذاق اڑایا کرتے تھے اور جس کا وقوع ان کے نزدیک ابھی مستبعد تھاجس طرح دوسرے مقام پر فرمایا «وَلَقَدْ كُذِّبَتْ رُسُلٌ مِنْ قَبْلِكَ فَصَبَرُوا عَلَى مَا كُذِّبُوا وَأُوذُوا حَتَّى أَتَاهُمْ نَصْرُنَا» (الأنعام : 34) ”تجھ سے پہلے بھی رسول جھٹلائے گئے پس انہوں نے تکذیب پر اور ان تکلیفوں پر جو انہیں دی گئیں صبر کیا یہاں تک کہ ان کے پاس ہماری مدد آگئی“، رسول اللہ (صلى الله عليه وسلم) کی تسلی کے ساتھ کفار و مشرکین کے لیے اس میں تہدید و وعید بھی ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walaqadi us'tuh'zi-a birusulin min qablika faḥāqa bi-alladhīna sakhirū min'hum mā kānū bihi yastahziūna ","translations":["And verily","were mocked","Messengers","before you","before you","then surrounded","those who","mocked","from them","what","they used","at it","(to) mock","(41)"],"transliterationArr":["walaqadi","us'tuh'zi-a","birusulin","min","qablika","faḥāqa","bi-alladhīna","sakhirū","min'hum","mā","kānū","bihi","yastahziūna",null],"verseTiming":[[1,0,870],[2,870,1900],[3,1900,2740],[4,2740,3910],[5,3910,5380],[6,5380,6270],[7,6270,7380],[8,7380,8240],[9,8240,8910],[10,8910,10140],[11,10140,10980],[12,10980,11680],[13,11680,14575]]}}