{"name":"21:63","price":"آپ نے جواب دیا بلکہ اس کام کو ان کے بڑے نے کیا ہے تم اپنے خداؤں سے ہی پوچھ لو اگر یہ بولتے چالتے ہوں.(1)","arabic":"قَالَ بَلۡ فَعَلَهُۥ كَبِيرُهُمۡ هَٰذَا فَسۡـَٔلُوهُمۡ إِن كَانُواْ يَنطِقُونَ","category":["21 (Al-Anbiya)","Al-Anbiya","Surah Al-Anbiya","Chapter Al-Anbiya","Anbiya","Surah Anbiya","Chapter Anbiya","Al Anbiya","Surah Al Anbiya","Chapter Al Anbiya","Surah 21","Chapter 21","The Prophets","الأنبيَاء"],"ayahNumber":2546,"juzNumber":17,"footnotes":"(1) چنانچہ حضرت ابراہیم (عليه السلام) کو مجمع عام میں لایا گیا اور ان سے پوچھا گیا، حضرت ابراہیم (عليه السلام) نے جواب دیا کہ یہ کام تو اس بڑے بت نے کیا ہے، اگر یہ (ٹوٹے ہوئے بت) بول کر بتلا سکتے ہیں تو ذرا ان سے پوچھو تو سہی۔ یہ بطور اپنے مطلب کے بات کی یا انہوں نے کہا تاکہ وہ یہ بات جان لیں کہ جو نہ بول سکتا ہو نہ کسی چیز سے آگاہی کی صلاحیت رکھتا ہو، وہ معبود نہیں ہو سکتا۔ نہ اس پر الہ کا اطلاق ہی صحیح ہے ایک حدیث صحیح میں حضرت ابراہیم (عليه السلام) کے اس قول بل فعلہ کبیرھم کو لفظ کذب سے تعبیر کیا گیا ہے کہ ابراہیم (عليه السلام) نے تین جھوٹ بولے دو اللہ کے لیے ایک (انی سقیم) اور دوسرا یہی اور تیسرا حضرت سارہ اپنی بیوی کو بہن کہنا (صحیح بخاری کتاب الانبیاء باب واتخذاللہ ابراہیم خلیلا) زمانہ حال کے بعض مفسرین نے اس حدیث صحیح کو قرآن کے خلاف باور کر کے اس کا انکار کر دیا ہے اور اس کی صحت پر اصرار غلو اور روایت پرستی قرار دیا ہے لیکن ان کی یہ رائے صحیح نہیں یقینا حقیقت کے اعتبار سے انہیں جھوٹ نہیں کہا جا سکتا لیکن ظاہری شکل کے لحاظ سے ان کو کذب سے خارج بھی نہیں کیا جا سکتا ہے گو یہ کذب اللہ کے ہاں قابل مواخذہ نہیں ہے کیونکہ وہ اللہ ہی کے لیے بولے گئے ہیں درآنحالیکہ کوئی گناہ کا کام اللہ کے لیے نہیں ہو سکتا اور یہ تب ہی ہو سکتا ہے کہ ظاہری طور پر کذب ہونے کے باوجود وہ حقیقتا کذب نہ ہو جیسے حضرت آدم (عليه السلام) کے لیے عصی اور غوی کے الفاظ استعمال ہوئے ہیں حالانکہ خود قرآن میں ہی ان کے فعل اکل شجر کو نسیان اور ارادے کی کمزوری کا نتیجہ بھی بتلایا گیا ہے جس کا صاف مطلب یہ ہے کہ کسی کام کے دو پہلو بھی ہو سکتے ہیں من وجہ اس میں استحسان اور من وجہ ظاہری قباحت کا پہلو۔ حضرت ابراہیم (عليه السلام) کا یہ قول اس پہلو سے ظاہری طور پر کذب ہی ہے کہ واقعے کے خلاف تھا بتوں کو انہوں نے خود توڑا تھا لیکن اس کا انتساب بڑے بت کی طرف کیا لیکن چونکہ مقصد ان کا تعریض اور اثبات توحید تھا اس لیے حقیقت کے اعتبار ہم اسے جھوٹ کے بجائے اتمام حجت کا ایک طریق اور مشرکین کی بےعقلی کے اثبات واظہار کا ایک انداز کہیں گے علاوہ ازیں حدیث میں ان کذبات کا ذکر جس ضمن میں آیا ہے وہ بھی قابل غور ہے اور وہ ہے میدان محشر میں اللہ کے روبرو جاکر سفارش کرنے سے اس لیے گریز کرنا کہ ان سے دنیا میں تین موقعوں پر لغزش کا صدور ہوا ہے درآنحالیکہ وہ لغزشیں نہیں یعنی حقیقت اور مقصد کے اعتبار وہ جھوٹ نہیں ہیں مگر وہ اللہ کی عظمت وجلا کیوجہ سے اتنے خوف زدہ ہوں گے کہ یہ باتیں جھوٹ کے ساتھ مماثلت کی وجہ سے قابل گرفت نظر آئیں گی گویا حدیث کا مقصد حضرت ابراہیم (عليه السلام) کو جھوٹا ثابت کرنا ہرگز نہیں ہے بلکہ اس کیفیت کا اظہار ہے جو قیامت والے دن خشیت الہی کی وجہ سے ان پر طاری ہوگی۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qāla bal faʿalahu kabīruhum hādhā fasalūhum in kānū yanṭiqūna ","translations":["He said","Nay","(some doer) did it","Their chief","(is) this","So ask them","if","they (can)","speak","(63)"],"transliterationArr":["qāla","bal","faʿalahu","kabīruhum","hādhā","fasalūhum","in","kānū","yanṭiqūna",null],"verseTiming":[[1,0,570],[2,570,930],[3,930,1920],[4,1920,3070],[5,3070,4000],[6,4000,5370],[7,5370,6320],[8,6320,7070],[9,7070,10675]]}}