{"name":"21:68","price":"کہنے لگے کہ اسے جلا دو اور اپنے خداؤں کی مدد کرو اگر تمہیں کچھ کرنا ہی ہے.(1)","arabic":"قَالُواْ حَرِّقُوهُ وَٱنصُرُوٓاْ ءَالِهَتَكُمۡ إِن كُنتُمۡ فَٰعِلِينَ","category":["21 (Al-Anbiya)","Al-Anbiya","Surah Al-Anbiya","Chapter Al-Anbiya","Anbiya","Surah Anbiya","Chapter Anbiya","Al Anbiya","Surah Al Anbiya","Chapter Al Anbiya","Surah 21","Chapter 21","The Prophets","الأنبيَاء"],"ayahNumber":2551,"juzNumber":17,"footnotes":"(1) حضرت ابراہیم (عليه السلام) نے جب یوں اپنی حجت تمام کر دی اور ان کی ضلالت وحماقت کو ایسے طریقے سے ان پر واضح کر دیا کہ وہ لاجواب ہوگئے۔ تو چونکہ وہ توفیق ہدایت سے محروم تھے اور کفر و شرک نے ان کے دلوں کو بےنور کر دیا تھا۔ اس لئے بجائے اس کے کہ وہ شرک سے بعض آجاتے، الٹا ابراہیم (عليه السلام) کے خلاف سخت اقدام کرنے پر آمادہ ہوگئے اور اپنے معبودوں کی دہائی دیتے ہوئے انہیں آگ میں جھونک دینے کی تیاری شروع کر دی، چنانچہ آگ کا ایک بہت بڑا الاؤ تیار کیا گیا اور اس میں حضرت ابراہیم (عليه السلام) کو کہا جاتا ہے کہ منجنیق (جس سے بڑے پتھر پھینکے جاتے ہیں) کے ذریعے سے پھینکا۔ لیکن اللہ تعالٰی نے آگ کو حکم دیا کہ ابراہیم (عليه السلام) کے لئے ٹھنڈی اور سلامتی بن جا علماء کہتے ہیں کہ اگر اللہ تعالیٰ، ٹھنڈی کے ساتھ ' سلامتی ' نہ فرماتا تو اس کی ٹھنڈک ابراہیم (عليه السلام) کے لئے ناقابل برداشت ہوتی۔ بہرحال یہ ایک بہت بڑا معجزہ ہے جو آسمان سے باتیں کرتی ہوئی دہکتی آگ کے گل و گلزار بن جانے کی صورت میں حضرت ابراہیم (عليه السلام) کے لئے اللہ کی مشیت سے ظاہر ہوا۔ اس طرح اللہ نے اپنے بندے کو دشمنوں کی سازش سے بچا لیا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qālū ḥarriqūhu wa-unṣurū ālihatakum in kuntum fāʿilīna ","translations":["They said","Burn him","and support","your gods","if","you are","doers","(68)"],"transliterationArr":["qālū","ḥarriqūhu","wa-unṣurū","ālihatakum","in","kuntum","fāʿilīna",null],"verseTiming":[[1,0,890],[2,890,2280],[3,2280,5010],[4,5010,6430],[5,6430,7400],[6,7400,9030],[7,9030,11755]]}}