{"name":"21:79","price":"ہم نے اس کا صحیح فیصلہ سلیمان کو سمجھا دیا(1) ۔ ہاں ہر ایک کو ہم نے حکم وعلم دے رکھا تھا اور داؤد کے تابع ہم نے پہاڑ کر دیئے تھے جو تسبیح کرتے(2) تھے اور پرند بھی۔ ہم کرنے والے ہی تھے.(3)","arabic":"فَفَهَّمۡنَٰهَا سُلَيۡمَٰنَۚ وَكُلًّا ءَاتَيۡنَا حُكۡمٗا وَعِلۡمٗاۚ وَسَخَّرۡنَا مَعَ دَاوُۥدَ ٱلۡجِبَالَ يُسَبِّحۡنَ وَٱلطَّيۡرَۚ وَكُنَّا فَٰعِلِينَ","category":["21 (Al-Anbiya)","Al-Anbiya","Surah Al-Anbiya","Chapter Al-Anbiya","Anbiya","Surah Anbiya","Chapter Anbiya","Al Anbiya","Surah Al Anbiya","Chapter Al Anbiya","Surah 21","Chapter 21","The Prophets","الأنبيَاء"],"ayahNumber":2562,"juzNumber":17,"footnotes":"(1) مفسرین نے یہ قصہ اس طرح بیان فرمایا ہے کہ ایک شخص کی بکریاں، دوسرے شخص کے کھیت میں رات کو جا گھسیں اور اس کی کھیتی چر چگئیں۔ حضرت داؤد (عليه السلام) نے جو پیغمبر کے ساتھ حکمران بھی تھے فیصلہ دیا کہ بکریاں، کھیت والا لے لے تاکہ اس کے نقصان کی تلافی ہو جائے۔ حضرت سلیمان (عليه السلام) نے اس فیصلے سے اختلاف کیا اور یہ فیصلہ دیا کہ بکریاں کچھ عرصے کے لئے کھیتی کے مالک کو دے دی جائیں، وہ ان سے فائدہ اٹھائے اور کھیتی بکری والے کے سپرد کر دی جائے تاکہ وہ کھیتی کی آب پاشی اور دیکھ بھال کرکے، اسے صحیح کرے، جب وہ اس حالت میں آجائے جو بکریوں چرنے سے پہلے تھی تو کھیتی، کھیتی والے کو اور بکریاں، بکری والے کو واپس کر دی جائیں۔ پہلے فیصلے کے مقابل میں دوسرا فیصلہ اس لحاظ سے بہتر تھا کہ اس میں کسی کو بھی اپنی چیز سے محروم ہونا نہیں پڑا۔ جب کہ پہلے فیصلے میں بکری والے اپنی بکریوں سے محروم کر دیئے گئے تھے۔ تاہم اللہ نے حضرت داؤد (عليه السلام) کی بھی تعریف کی اور فرمایا کہ ہم نے ہر ایک کو (یعنی داؤد عليه السلام اور سلیمان عليه السلام دونوں کو) علم و حکمت سے نوازا تھا۔ بعض لوگ اس سے استدلال کرتے ہوئے کہتے ہیں۔ امام شوکانی فرماتے ہیں کہ یہ دعویٰ صحیح نہیں۔ کسی ایک معاملے میں دو الگ الگ (متضاد) فیصلہ کرنے والے دو منصف، بیک وقت دونوں مصنفین ہو سکتے، ان میں ضرور ایک مصیب (درست فیصلہ کرنے والا) ہوگا اور دوسرا غلطی کر کے غلط فیصلہ کرنے والا، البتہ یہ الگ بات ہے کہ غلطی سے غلط فیصلہ کرنے سے گناہ گار نہیں ہوگا، بلکہ اسے ایک اجر ملے گا۔ کما فی الحدیث (فتح القدیر)۔\n(2) اس سے مراد یہ نہیں کہ پہاڑ ان کی تسبیح کی آواز سے گونج اٹھتے تھے (کیونکہ اس میں تو کوئی اعجاز ہی باقی نہیں رہتا)، ہر کہ و مہ کی اونچی آواز سے پہاڑوں میں گونج پیدا ہوسکتی ہے۔ بلکہ مطلب حضرت داود (عليه السلام) کی تسبیح کے ساتھ پہاڑوں کا بھی تسبیح پڑھان ہے۔ نیز یہ مجازاً نہیں حقیقتاً تھا۔\n(3) یعنی پرندے بھی داؤد (عليه السلام) کی سوز آواز سن کر اللہ کی تسبیح کرنے لگتے،والطیر یا تو مفتوح ہے اور اس کا عطف الجبال پر ہے یا پھر یہ مرفوع ہے اور خبر محذاوف کا مبتدا ہے یعنی والطیر مسخرات۔ مطلب یہ ہے کہ پرندے بھی داؤد (عليه السلام) کے لئے مسخر کر دیئے گئے تھے (فتح القدیر)\n(4) یعنی یہ تفہیم، ابتائے حکم اور تسخی، ان سب کے کرنے والے ہم ہی تھے، اس لئے ان میں کسی کو تعجب کرنے کی یا انکار کرنے کی ضرورت نہیں ہے، اس لئے کہ ہم جو چاہیں کر سکتے ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"fafahhamnāhā sulaymāna wakullan ātaynā ḥuk'man waʿil'man wasakharnā maʿa dāwūda al-jibāla yusabbiḥ'na wal-ṭayra wakunnā fāʿilīna ","translations":["And We gave understanding of it","(to) Sulaiman","and (to) each","We gave","judgment","and knowledge","And We subjected","with","Dawud","the mountains","(to) glorify Our praises","and the birds","And We were","the Doers","(79)"],"transliterationArr":["fafahhamnāhā","sulaymāna","wakullan","ātaynā","ḥuk'man","waʿil'man","wasakharnā","maʿa","dāwūda","al-jibāla","yusabbiḥ'na","wal-ṭayra","wakunnā","fāʿilīna",null],"verseTiming":[[1,0,1790],[2,1790,4720],[3,4720,5680],[4,5680,6770],[5,6770,8560],[6,8560,10000],[7,10000,11370],[8,11370,11800],[9,11800,12770],[10,12770,13850],[11,13850,15060],[12,15060,16120],[13,16120,17800],[14,17800,20165]]}}