{"name":"21:7","price":"تجھ سے پہلے جتنے پیغمبر ہم نے بھیجے سبھی مرد تھے(1) جن کی طرف ہم وحی اتارتے تھے پس تم اہل کتاب سے پوچھ لو اگر خود تمہیں علم نہ ہو.(2)","arabic":"وَمَآ أَرۡسَلۡنَا قَبۡلَكَ إِلَّا رِجَالٗا نُّوحِيٓ إِلَيۡهِمۡۖ فَسۡـَٔلُوٓاْ أَهۡلَ ٱلذِّكۡرِ إِن كُنتُمۡ لَا تَعۡلَمُونَ","category":["21 (Al-Anbiya)","Al-Anbiya","Surah Al-Anbiya","Chapter Al-Anbiya","Anbiya","Surah Anbiya","Chapter Anbiya","Al Anbiya","Surah Al Anbiya","Chapter Al Anbiya","Surah 21","Chapter 21","The Prophets","الأنبيَاء"],"ayahNumber":2490,"juzNumber":17,"footnotes":"(1) یعنی تمام نبی مرد انسان تھے، نہ کوئی غیر انسان کبھی نبی آیا اور نہ غیر مرد، گویا نبوت انسانوں کے ساتھ اور انسانوں میں بھی مردوں کے ساتھ ہی خاص رہی ہے۔ اس سے معلوم ہوا کہ کوئی عورت نبی نہیں بنی۔ اس لئے نبوت بھی ان کے فرائض میں سے ہے جو عورت کو طبعی اور فطری دائرہ عمل سے خارج ہے۔\n(2) أَهْلَ الذِّكْرِ (اہل علم) سے مراد اہل کتاب ہیں، جو سابقہ آسمانی کتابوں کا علم رکھتے تھے، ان سے پوچھ لو کہ پچھلے انبیاء جو بھی گزرے ہیں، وہ انسان تھے یا غیر انسان؟ وہ تمہیں بتلائیں گے کہ تمام انبیاء انسان ہی تھے۔ اس سے بعض حضرات ”تقلید“ کا اثبات کرتے ہیں، جو غلط ہے۔ ”تقلید“ یہ ہے کہ ایک معین شخص، اور اس کی طرف منسوب ایک معین فقہ کو مرجع بنایا جائے اور اسی پر عمل کیا جائے۔ دوسرا، یہ کہ بغیر دلیل کے اس بات کو تسلیم کیا جائے جب کہ آیت میں اہل الذکر سے مراد کوئی متعین شخص نہیں ہے۔ بلکہ ہر وہ عالم ہے جو تورات و انجیل کا علم رکھتا تھا۔ اس سے تو تقلید شخصی کی نفی ہوتی ہے۔ اس میں تو علماء کی طرف رجوع کرنے کی تاکید ہے، جو عوام کے لئے ناگزیر ہے، جس سے کسی کو مجال انکار نہیں ہے۔ نہ کہ کسی ایک ہی شخصیت کا دامن پکڑ لینے کا حکم ۔ علاوہ ازیں تورات و انجیل، منصوص کتابیں تھیں یا انسانوں کی خود ساختہ فقہیں؟ اگر وہ آسمانی کتابیں تھیں تو مطلب یہ ہوا کہ علماء کے ذریعے سے نصوص شریعت معلوم کریں، جو آیت کا صحیح مفہوم ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wamā arsalnā qablaka illā rijālan nūḥī ilayhim fasalū ahla al-dhik'ri in kuntum lā taʿlamūna ","translations":["And not","We sent","before you","except","men","We revealed","to them","So ask","(the) people","(of) the Reminder","if","you","(do) not","know","(7)"],"transliterationArr":["wamā","arsalnā","qablaka","illā","rijālan","nūḥī","ilayhim","fasalū","ahla","al-dhik'ri","in","kuntum","lā","taʿlamūna",null],"verseTiming":[[1,0,2110],[2,2110,3330],[3,3330,4210],[4,4210,4960],[5,4960,5870],[6,5870,9090],[7,9090,10040],[8,10040,12900],[9,12900,13550],[10,13550,14290],[11,14290,15220],[12,15220,16580],[13,16580,16990],[14,16990,19135]]}}