{"name":"21:90","price":"ہم نے اس کی دعا کو قبول فرما کر اسے یحيٰ (علیہ السلام) عطا فرمایا(1) اور ان کی بیوی کو ان کے لئے درست کر دیا(2)۔ یہ بزرگ لوگ نیک کاموں کی طرف جلدی کرتے تھے اور ہمیں ﻻلچ طمع اور ڈر خوف سے پکارتے تھے۔ اور ہمارے سامنے عاجزی کرنے والے تھے.(3)","arabic":"فَٱسۡتَجَبۡنَا لَهُۥ وَوَهَبۡنَا لَهُۥ يَحۡيَىٰ وَأَصۡلَحۡنَا لَهُۥ زَوۡجَهُۥٓۚ إِنَّهُمۡ كَانُواْ يُسَٰرِعُونَ فِي ٱلۡخَيۡرَٰتِ وَيَدۡعُونَنَا رَغَبٗا وَرَهَبٗاۖ وَكَانُواْ لَنَا خَٰشِعِينَ","category":["21 (Al-Anbiya)","Al-Anbiya","Surah Al-Anbiya","Chapter Al-Anbiya","Anbiya","Surah Anbiya","Chapter Anbiya","Al Anbiya","Surah Al Anbiya","Chapter Al Anbiya","Surah 21","Chapter 21","The Prophets","الأنبيَاء"],"ayahNumber":2573,"juzNumber":17,"footnotes":"(1) حضرت زکریا (عليه السلام) کا بڑھاپے میں اولاد کے لئے دعا کرنا اور اللہ کی طرف سے اس کا عطا کیا جانا، اس کی ضروری تفصیل سورہ آل عمران اور سورہ طٰہٰ میں گزر چکی ہے۔ یہاں بھی اس کی طرف اشارہ ان الفاظ میں کیا ہے۔\n(2) یعنی وہ بانجھ اور ناقابل اولاد تھی، ہم نے اس کے اس نقص کا ازالہ فرما کر اسے نیک بچہ عطا فرمایا۔\n(3) گویا قبولیت دعا کے لئے ضروری ہے کہ ان باتوں کا اہتمام کیا جائے جن کا بطور خاص یہاں ذکر کیا گیا ہے۔ مثلاً الحاح و زاری کے ساتھ اللہ کی بارگاہ میں دعا و مناجات، نیکی کے کاموں میں سبقت، خوف و طمع کے ملے جلے جذبات کے ساتھ رب کو پکارنا اور اس کے سامنے عاجزی اور خشوع خضوع کا اظہار۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"fa-is'tajabnā lahu wawahabnā lahu yaḥyā wa-aṣlaḥnā lahu zawjahu innahum kānū yusāriʿūna fī al-khayrāti wayadʿūnanā raghaban warahaban wakānū lanā khāshiʿīna ","translations":["So We responded","to him","and We bestowed","on him","Yahya","and We cured","for him","his wife","Indeed, they","used (to)","hasten","in","good deeds","and they supplicate to Us","(in) hope","and fear","and they were","to Us","humbly submissive","(90)"],"transliterationArr":["fa-is'tajabnā","lahu","wawahabnā","lahu","yaḥyā","wa-aṣlaḥnā","lahu","zawjahu","innahum","kānū","yusāriʿūna","fī","al-khayrāti","wayadʿūnanā","raghaban","warahaban","wakānū","lanā","khāshiʿīna",null],"verseTiming":[[1,0,1520],[2,1520,2170],[3,2170,3360],[4,3360,3890],[5,3890,4790],[6,4790,6150],[7,6150,6790],[8,6790,8210],[9,8210,9930],[10,9930,10720],[11,10720,12180],[12,12180,12470],[13,12470,13770],[14,13770,15350],[15,15350,16100],[16,16100,18410],[17,18410,19410],[18,19410,19840],[19,19840,22385]]}}