{"name":"21:98","price":"تم اور اللہ کے سوا جن جن کی تم عبادت کرتے ہو، سب دوزخ کا ایندھن بنو گے، تم سب دوزخ میں جانے والے ہو.(1)","arabic":"إِنَّكُمۡ وَمَا تَعۡبُدُونَ مِن دُونِ ٱللَّهِ حَصَبُ جَهَنَّمَ أَنتُمۡ لَهَا وَٰرِدُونَ","category":["21 (Al-Anbiya)","Al-Anbiya","Surah Al-Anbiya","Chapter Al-Anbiya","Anbiya","Surah Anbiya","Chapter Anbiya","Al Anbiya","Surah Al Anbiya","Chapter Al Anbiya","Surah 21","Chapter 21","The Prophets","الأنبيَاء"],"ayahNumber":2581,"juzNumber":17,"footnotes":"(1) یہ آیت مشرکین مکہ کے بارے میں نازل ہوئی ہے جو لات منات اور عزٰی و ہبل کی پوجا کرتے تھے یہ سب پتھر کی مورتیاں تھیں۔ جو جمادات یعنی غیر عاقل تھیں، اس لئے آیت میں مَا تَعْبُدُوْنَ کے الفاظ ہیں اور عربی میں (مَا) غیر عاقل کے لئے آتا ہے۔ یعنی کہا جارہا ہے کہ تم بھی اور تمہارے معبود بھی جن کی مورتیاں بنا کر تم نے عبادت کے لئے رکھی ہوئی ہیں سب جہنم کا ایندھن ہیں۔پتھر کی مورتیوں کا اگرچہ کوئی قصور نہیں ہے کیونکہ وہ تو غیر عاقل اور بے شعود ہیں۔ لیکن انہیں پچاریوں کے ساتھ جہنم میں صرف مشرکوں کو مزید ذلیل و رسوا کرنے کے لئے ڈالا جائے گا کہ جن معبودوں کو تم اپنا سہارا سمجھتے تھے، وہ بھی تمہارے ساتھ ہی جہنم میں، جہنم کا ایندھن ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"innakum wamā taʿbudūna min dūni al-lahi ḥaṣabu jahannama antum lahā wāridūna ","translations":["Indeed, you","and what","you worship","besides Allah","besides Allah","besides Allah","(are) firewood","(of) Hell","You","to it","will come","(98)"],"transliterationArr":["innakum","wamā","taʿbudūna","min","dūni","al-lahi","ḥaṣabu","jahannama","antum","lahā","wāridūna",null],"verseTiming":[[1,0,1660],[2,1660,2260],[3,2260,3390],[4,3390,4380],[5,4380,5400],[6,5400,6210],[7,6210,6900],[8,6900,8350],[9,8350,9770],[10,9770,10470],[11,10470,13425]]}}