{"name":"22:19","price":"یہ دونوں اپنے رب کے بارے میں اختلاف کرنے(1) والے ہیں، پس کافروں کے لئے تو آگ کے کپڑے بیونت کر کاٹے جائیں گے، اور ان کے سروں کے اوپر سے سخت کھولتا ہوا پانی بہایا جائے گا.","arabic":"۞ هَٰذَانِ خَصۡمَانِ ٱخۡتَصَمُواْ فِي رَبِّهِمۡۖ فَٱلَّذِينَ كَفَرُواْ قُطِّعَتۡ لَهُمۡ ثِيَابٞ مِّن نَّارٖ يُصَبُّ مِن فَوۡقِ رُءُوسِهِمُ ٱلۡحَمِيمُ","category":["22 (Al-Hajj)","Al-Hajj","Surah Al-Hajj","Chapter Al-Hajj","Hajj","Surah Hajj","Chapter Hajj","Al Hajj","Surah Al Hajj","Chapter Al Hajj","Surah 22","Chapter 22","The Pilgrimage","الحَجّ"],"ayahNumber":2614,"juzNumber":17,"footnotes":"(1) هَذَانِ خَصْمَانِ یہ دونوں تثنیہ کے صیغے ہیں بعض نے اس سے مراد مذکورہ گمراہ فرقے اور اس کے مقابلے میں دوسرا فرقہ مسلمان کو لیا ہے۔ یہ دونوں اپنے رب کے بارے میں جھگڑتے ہیں، مسلمان تو وحدانیت اور اس کی قدرت علی البعث کے قائل ہیں، جب کہ دوسرے اللہ کے بارے میں مختلف گمراہیوں میں مبتلا ہیں۔ اس ضمن میں جنگ بدر میں لڑنے والے مسلمان اور کافر بھی آجاتے ہیں، جس کے آغاز میں مسلمانوں میں ایک طرف حضرت حمزہ، حضرت علی اور حضرت عبیدۃ (رضي الله عنهم)تھے اور دوسری طرف ان کے مقابلے میں کافروں میں عتبہ، شیبہ اور ولید بن عتبہ تھے (صحیح بخاری، تفسیر سورة الحج)امام ابن کثیر فرماتے ہیں کہ یہ دونوں ہی مفہوم صحیح اور آیت کے مطابق ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"hādhāni khaṣmāni ikh'taṣamū fī rabbihim fa-alladhīna kafarū quṭṭiʿat lahum thiyābun min nārin yuṣabbu min fawqi ruūsihimu al-ḥamīmu ","translations":["These two","opponents","dispute","concerning","their Lord","But those who","disbelieved","will be cut out","for them","garments","of","fire","Will be poured","over","over","their heads","[the] scalding water","(19)"],"transliterationArr":["hādhāni","khaṣmāni","ikh'taṣamū","fī","rabbihim","fa-alladhīna","kafarū","quṭṭiʿat","lahum","thiyābun","min","nārin","yuṣabbu","min","fawqi","ruūsihimu","al-ḥamīmu",null],"verseTiming":[[1,0,1220],[2,1220,2490],[3,2490,3740],[4,3740,4240],[5,4240,5490],[6,5490,7140],[7,7140,8120],[8,8120,9290],[9,9290,9900],[10,9900,10770],[11,10770,12020],[12,12020,13660],[13,13660,15480],[14,15480,15980],[15,15980,17260],[16,17260,18600],[17,18600,21265]]}}