{"name":"22:18","price":"کیا تو نہیں دیکھ رہا کہ اللہ کے سامنے سجده میں ہیں سب آسمانوں والے اور سب زمینوں والے اور سورج اور چاند اور ستارے اور پہاڑ اور درخت اور جانور(1) اور بہت سے انسان بھی(2)۔ ہاں بہت سے وه بھی ہیں جن پر عذاب کا مقولہ ﺛابت ہو چکا ہے(3)، جسے رب ذلیل کردے اسے کوئی عزت دینے واﻻ نہیں(4)، اللہ جو چاہتا ہے کرتا ہے.","arabic":"أَلَمۡ تَرَ أَنَّ ٱللَّهَ يَسۡجُدُۤ لَهُۥۤ مَن فِي ٱلسَّمَٰوَٰتِ وَمَن فِي ٱلۡأَرۡضِ وَٱلشَّمۡسُ وَٱلۡقَمَرُ وَٱلنُّجُومُ وَٱلۡجِبَالُ وَٱلشَّجَرُ وَٱلدَّوَآبُّ وَكَثِيرٞ مِّنَ ٱلنَّاسِۖ وَكَثِيرٌ حَقَّ عَلَيۡهِ ٱلۡعَذَابُۗ وَمَن يُهِنِ ٱللَّهُ فَمَا لَهُۥ مِن مُّكۡرِمٍۚ إِنَّ ٱللَّهَ يَفۡعَلُ مَا يَشَآءُ۩","category":["22 (Al-Hajj)","Al-Hajj","Surah Al-Hajj","Chapter Al-Hajj","Hajj","Surah Hajj","Chapter Hajj","Al Hajj","Surah Al Hajj","Chapter Al Hajj","Surah 22","Chapter 22","The Pilgrimage","الحَجّ"],"ayahNumber":2613,"juzNumber":17,"footnotes":"(1) یہ فیصلہ محض حاکمانہ اختیارات کے زور پر نہیں ہوگا، بلکہ عدل و انصاف کے مطابق ہوگا، کیونکہ وہ باخبر ہستی ہے، اسے ہرچیز کا علم ہے۔\n(2) بعض مفسرین نے اس سجدے سے ان تمام چیزوں کا احکام الٰہی کے تابع ہونا مراد لیا ہے، کسی میں مجال نہیں کہ وہ حکم الٰہی سے سرتابی کر سکے۔ ان کے نزدیک وہ سجدہ اطاعت و عبادت مراد نہیں جو صرف عقلا کے ساتھ خاص ہے۔ جب کہ بعض مفسرین نے اسے مجاز کے بجائے حقیقت پر مبنی کیا ہے کہ ہر مخلوق اپنے اپنے انداز سے اللہ کے سامنے سجدہ ریز ہے مثلا «مَنْ فِي السَّمَواتِ»سے مراد فرشتے ہیں«وَمَنْ فِي الأَرْضِ» سے ہر قسم کے حیوانات، انسان، جنات، چوپائے اور پرندے اور دیگر اشیاء ہیں یہ سب اپنے اپنے انداز سے سجدہ اور تسبیح کرتی ہیں «وَاِنْ مِّنْ شَيْءٍ اِلَّايُسَبِّحُ بِحَمْدِه» (الاسراء:44)۔ سورج چاند اور ستاروں کا بطور خاص اس لیے ذکر کیا گیا ہے کہ مشرکین ان کی عبادت کرتے رہے ہیں اللہ تعالٰی نے بیان فرمایا تم ان کو سجدہ کرتے ہو یہ تو اللہ تعالٰی کو سجدہ کرنے والے ہیں اور اس کے ماتحت ہیں اس لیے تم انہیں سجدہ مت کرو اس ذات کو سجدہ کرو جو ان کا خالق ہے۔ (حم السجدہ: ۳۷) صحیح حدیث میں ہے کہ حضرت ابو ذر (رضي الله عنه) فرماتے ہیں کہ مجھ سے رسول اللہ (صلى الله عليه وسلم) نے پوچھا، جانتے ہو سورج کہاں جاتا ہے؟ میں نے کہا، اللہ اور اس کا رسول (صلى الله عليه وسلم) ہی بہتر جانتے ہیں۔ فرمایا سورج جاتا ہے اور عرش کے نیچے جاکر سجدہ ریز ہو جاتا ہے پھر اسے (طلوع ہونے کا) حکم دیا جاتا ہے ایک وقت آئے گا کہ اسے کہا جائے گا واپس لوٹ جا یعنی جہاں سے آیا ہے وہیں چلا جا۔ (صحيح بخاري، بدء الخلق، باب صفة الشمس والقمر بحسبان - مسلم، كتاب الإيمان، باب بيان الزمن الذي لا يقبل فيه الإيمان) اسی طرح صحابی کا واقعہ حدیث میں بیان کیا گیا ہے کہ انہوں نے خواب میں اپنے ساتھ درخت کو سجدہ کرتے دیکھا (ترمذي، أبواب السفر، باب ما يقول في سجود القرآن تحفة الأحوذي، صفحة 402 ، ابن ماجه 1053) اور پہاڑوں اور درختوں کے سجدے میں ان سایوں کا دائیں بائیں پھرنا یا جھکنا بھی شامل ہے جس طرف اشارہ سورۃ الرعد 15اور النحل 48، 49 میں بھی کیا گیا ہے۔\n(3) یہ سجدہ اطاعت و عبادت ہی ہے جس کو انسانوں کی ایک بڑی تعداد کرتی ہے اور اللہ کی رضا کی مستحق قرار پاتی ہے۔\n(4) یہ وہ ہیں جو سجدہ اطاعت سے انکار کرکے کفر اختیار کرتے ہیں، ورنہ تکوینی احکام یعنی سجدہ انقیاد میں تو انہیں بھی مجال انکار نہیں۔\n(5) کفر اختیار کرنے کا نتیجہ ذلت و رسوائی اور آخرت کا دائمی عذاب ہے، جس سے بچا کر کافروں کو عزت دینے والا کوئی نہیں ہوگا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"alam tara anna al-laha yasjudu lahu man fī al-samāwāti waman fī al-arḍi wal-shamsu wal-qamaru wal-nujūmu wal-jibālu wal-shajaru wal-dawābu wakathīrun mina al-nāsi wakathīrun ḥaqqa ʿalayhi al-ʿadhābu waman yuhini al-lahu famā lahu min muk'rimin inna al-laha yafʿalu mā yashāu ","translations":["Do not","you see","that","(to) Allah","prostrates","to Him","whoever","(is) in","the heavens","and whoever","(is) in","the earth","and the sun","and the moon","and the stars","and the mountains","and the trees","and the moving creatures","and many","of","the people","But many ","(is) justly due","on him","the punishment","And whoever","Allah humiliates","Allah humiliates","then not","for him","any","bestower of honor","Indeed","Allah","does","what","He wills","(18)"],"transliterationArr":["alam","tara","anna","al-laha","yasjudu","lahu","man","fī","al-samāwāti","waman","fī","al-arḍi","wal-shamsu","wal-qamaru","wal-nujūmu","wal-jibālu","wal-shajaru","wal-dawābu","wakathīrun","mina","al-nāsi","wakathīrun","ḥaqqa","ʿalayhi","al-ʿadhābu","waman","yuhini","al-lahu","famā","lahu","min","muk'rimin","inna","al-laha","yafʿalu","mā","yashāu",""],"verseTiming":[[1,0,680],[2,680,1150],[3,1150,2210],[4,2210,3190],[5,3190,3970],[6,3970,4600],[7,4600,5610],[8,5610,5860],[9,5860,7410],[10,7410,8540],[11,8540,8800],[12,8800,9640],[13,9640,10710],[14,10710,11540],[15,11540,13240],[16,13240,14220],[17,14220,15940],[18,15940,17210],[19,17210,18150],[20,18150,22260],[21,22260,23280],[22,23280,24330],[23,24330,27700],[24,27700,29019],[25,29019,29649],[26,29649,30499],[27,30499,32849],[28,32849,33449],[29,33449,34429],[30,34429,34949],[31,34949,35779],[32,35779,36449],[33,36449,37079],[34,37079,37429],[35,37429,39709],[36,39709,41019],[37,41019,41949],[38,41949,43029],[39,43029,43539],[40,43539,46854]]}}