{"name":"22:13","price":"اسے پکارتے ہیں جس کا نقصان اس کے نفع سے زیاده قریب ہے، یقیناً برے والی ہیں اور برے ساتھی.(1)","arabic":"يَدۡعُواْ لَمَن ضَرُّهُۥٓ أَقۡرَبُ مِن نَّفۡعِهِۦۚ لَبِئۡسَ ٱلۡمَوۡلَىٰ وَلَبِئۡسَ ٱلۡعَشِيرُ","category":["22 (Al-Hajj)","Al-Hajj","Surah Al-Hajj","Chapter Al-Hajj","Hajj","Surah Hajj","Chapter Hajj","Al Hajj","Surah Al Hajj","Chapter Al Hajj","Surah 22","Chapter 22","The Pilgrimage","الحَجّ"],"ayahNumber":2608,"juzNumber":17,"footnotes":"(1) بعض مفسرین کے نزدیک یدعو، یقول کے معنی میں ہے۔ یعنی غیر اللہ کا پجاری قیامت والے دن کہے گا کہ جس کا نقصان، اس کے نفع کے قریب تر ہے، وہ والی اور ساتھی یقینا برا ہے۔ یعنی اپنے معبودوں کے بارے یہ کہے گا کہ وہاں اس کے امیدوں کے محل ڈھے جائیں گے اور یہ معبود، جن کی بات اس کا خیال تھا کہ وہ اللہ کے عذاب سے اس بچائیں گے، اس کی شفاعت کریں گے، وہاں خود وہ معبود بھی، اس کے ساتھ ہی جہنم کا ایندھن بنے ہونگے۔ مولیٰ کے معنی ولی اور مددگار کے اور عشیر کےمعنی ہم نشین، ساتھی اور قرابت دار کے ہیں۔ مددگار اور ساتھی تو وہ ہوتا ہے جو مصیبت کے وقت کام آئے، لیکن یہ معبود خود گرفتار عذاب ہوں گے یہ کسی کے کیا کام آئیں گے؟ اس لئے انہیں برا والی اور برا ساتھی کہا گیا۔ ان کی عبادت ضرر ہی ضرر ہے، نفع کا تو اس میں کوئی حصہ ہی نہیں ہے، پھر یہ جو کہا گیا ہے کہ ان کا نقصان، ان کے نفع سے قریب تر ہے، تو ی ایسے ہی ہے جیسے دوسرے مقام پر فرمایا گیا:«وَإِنَّا أَوْ إِيَّاكُمْ لَعَلَى هُدًى أَوْ فِي ضَلالٍ مُبِينٍ» (سبا:24) ”بےشک ہم (یعنی اللہ کے ماننے والے) یا تم (اس کا انکار کرنے والے) ہدایت پر ہیں، یا کھلی گمراہی میں“۔ ظاہر بات ہے کہ ہدایت پر وہی ہیں جو اللہ کو ماننے والے ہیں۔ لیکن اسے واضح الفاظ میں کہنے کی بجائے کنائے اور استفہام کے انداز میں بیان کیا گیا ہے۔ جو سامع کے لئے زیادہ موثر اور بلیغ ہوتا ہے۔ یا اس کا تعلق دنیا سے ہے اور مطلب یہ ہوگا کہ غیر اللہ کو پکارنے سے فوری نقصان تو اس کا ہوا کہ ایمان سے ہاتھ دھو بیٹھا، یہ قریب نقصان ہے۔ اور آخرت میں تو اس کا نقصان تحقیق شدہ ہی ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yadʿū laman ḍarruhu aqrabu min nafʿihi labi'sa al-mawlā walabi'sa al-ʿashīru ","translations":["He calls","(one) who ","his harm","(is) closer","than","his benefit","Surely, an evil","protector","and surely an evil","friend","(13)"],"transliterationArr":["yadʿū","laman","ḍarruhu","aqrabu","min","nafʿihi","labi'sa","al-mawlā","walabi'sa","al-ʿashīru",null],"verseTiming":[[1,0,910],[2,910,2300],[3,2300,5040],[4,5040,5850],[5,5850,6110],[6,6110,8300],[7,8300,9040],[8,9040,10080],[9,10080,11210],[10,11210,14105]]}}