{"name":"22:29","price":"پھر وه اپنا میل کچیل دور کریں(1) اور اپنی نذریں پوری کریں(2) اور اللہ کے قدیم گھر کا طواف کریں.(3)","arabic":"ثُمَّ لۡيَقۡضُواْ تَفَثَهُمۡ وَلۡيُوفُواْ نُذُورَهُمۡ وَلۡيَطَّوَّفُواْ بِٱلۡبَيۡتِ ٱلۡعَتِيقِ","category":["22 (Al-Hajj)","Al-Hajj","Surah Al-Hajj","Chapter Al-Hajj","Hajj","Surah Hajj","Chapter Hajj","Al Hajj","Surah Al Hajj","Chapter Al Hajj","Surah 22","Chapter 22","The Pilgrimage","الحَجّ"],"ayahNumber":2624,"juzNumber":17,"footnotes":"(1) یعنی10 ذوالحجہ کو جمرہ کبریٰ (یا جمرہ عقبہ) کو کنکریاں مارنے کے بعد حاجی تحلل اول (یا تحلّل اصغر) حاصل ہو جاتا ہے، جس کے بعد وہ احرام کھول دیتا ہے اور بیوی سے مباشرت کے سوا، دیگر وہ تمام کام اس کے لئے جائز ہو جاتے ہیں، جو حالت احرام میں ممنوع ہوتے ہیں۔ میل کچیل دور کرنے کا مطلب یہی ہے کہ پھر وہ بالو، ناخنوں وغیرہ کو صاف کرلے، تیل خوشبو استعمال کرے اور سلے ہوئے کپڑے پہن لے وغیرہ۔\n(2) اگر کوئی مانی ہوئی ہو، جیسے لوگ مان لیتے ہیں کہ اگر اللہ نے ہمیں اپنے مقدس گھر کی زیارت نصیب فرمائی، تو ہم فلاں نیکی کا کام کریں گے۔\n(3) عتیق کے معنی قدیم کے ہیں مراد خانہ کعبہ ہے کہ حلق یا تقصیر کے بعد افاضہ کرلے، جسے طواف زیارت بھی کہتے ہیں، اور یہ حج کا رکن ہے جو وقوف عرفہ اور جمرہ عقبہ (یا جمرہ کبرٰی) کو کنکریاں مارنے کے بعد کیا جاتا ہے۔ جب کہ طواف قدوم بعض کے نزدیک واجب اور بعض کے نزدیک سنت ہے اور طواف وداع سنت مؤکدہ (یا واجب) ہے۔ جو اکثر اہل علم کے نزدیک عذر سے ساقط ہو جاتا ہے، جیسے حائضہ عورت سے بالاتفاق ساقط ہو جاتا ہے (ایسر التفاسیر)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"thumma l'yaqḍū tafathahum walyūfū nudhūrahum walyaṭṭawwafū bil-bayti al-ʿatīqi ","translations":["Then","let them end","their prescribed duties","and fulfil","their vows","and circumambulate","the House","[the] Ancient","(29)"],"transliterationArr":["thumma","l'yaqḍū","tafathahum","walyūfū","nudhūrahum","walyaṭṭawwafū","bil-bayti","al-ʿatīqi",null],"verseTiming":[[1,0,1240],[2,1240,2280],[3,2280,3420],[4,3420,4640],[5,4640,6040],[6,6040,7850],[7,7850,8950],[8,8950,11705]]}}