{"name":"22:26","price":"اور جبکہ ہم نے ابراہیم (علیہ السلام) کو کعبہ کے مکان کی جگہ مقرر کر دی(1) اس شرط پر کہ میرے ساتھ کسی کو شریک(2) نہ کرنا اور میرے گھر کو طواف قیام رکوع سجده کرنے والوں کے لئے پاک صاف رکھنا.(3)","arabic":"وَإِذۡ بَوَّأۡنَا لِإِبۡرَٰهِيمَ مَكَانَ ٱلۡبَيۡتِ أَن لَّا تُشۡرِكۡ بِي شَيۡـٔٗا وَطَهِّرۡ بَيۡتِيَ لِلطَّآئِفِينَ وَٱلۡقَآئِمِينَ وَٱلرُّكَّعِ ٱلسُّجُودِ","category":["22 (Al-Hajj)","Al-Hajj","Surah Al-Hajj","Chapter Al-Hajj","Hajj","Surah Hajj","Chapter Hajj","Al Hajj","Surah Al Hajj","Chapter Al Hajj","Surah 22","Chapter 22","The Pilgrimage","الحَجّ"],"ayahNumber":2621,"juzNumber":17,"footnotes":"(1) یہ بدلہ ہے ان لوگوں کا جو مذکورہ گناہوں کے مرتکب ہوں گے۔\n(2) یعنی بیعت اللہ کی جگہ بتلا دی اور وہاں ہم نے ذریت ابراہیم (عليه السلام) کو ٹھہرایا۔ اس سے معلوم ہوتا ہے کہ طوفان نوح (عليه السلام) کی ویرانی کے بعد خانہ کعبہ کی تعمیر سب سے پہلے حضرت ابراہیم (عليه السلام) کے ہاتھوں سے ہوئی ہے۔ جیسا کہ صحیح حدیث سے بھی ثابت ہے جس میں نبی (صلى الله عليه وسلم) نے فرمایا ' سب سے پہلی مسجد جو زمین میں بنائی گئی، مسجد حرام ہے، اور اس کے چالیس سال بعد مسجد اقصٰی تعمیر ہوئی ' (مسند احمد 5۔150، 166- 167 و مسلم کتاب المساجد)\n(3) یہ خانہ کعبہ کی تعمیر کی غرض بیان کی کہ اس میں صرف میری عبادت کی جائے اس سے یہ بتلانا مقصود ہے کہ مشرکین نے اس میں جو بت سجا رکھے ہیں جن کی وہ یہاں آکر عبادت کرتے ہیں یہ ظلم صریح ہے کہ جہاں صرف اللہ کی عبادت کرنی چاہیے تھی وہاں بتوں کی عبادت کی جاتی ہے۔\n(4) کفر بت پرستی اور دیگر گندگیوں اور نجاستوں سے۔ یہاں ذکر صرف نماز پڑھنے والوں کا کیا ہے، کیونکہ یہ دونوں عبادت خانہ کعبہ کے ساتھ خاص ہیں، نماز میں رخ اس کی طرف ہوتا ہے اور طواف صرف اسی کے گرد کیا جاتا ہے۔ لیکن اہل بدعت نے اب بہت سی قبروں کا طواف بھی ایجاد کر لیا ہے اور بعض نمازوں کے لیے قبلہ بھی کوئی اور۔ أَعَاذَنَا اللهُ مِنْهَا","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-idh bawwanā li-ib'rāhīma makāna al-bayti an lā tush'rik bī shayan waṭahhir baytiya lilṭṭāifīna wal-qāimīna wal-rukaʿi al-sujūdi ","translations":["And when","We assigned","to Ibrahim","(the) site","(of) the House","That","(do) not","associate","with Me","anything","and purify","My House","for those who circumambulate","and those who stand","and those who bow","(and) those who prostrate","(26)"],"transliterationArr":["wa-idh","bawwanā","li-ib'rāhīma","makāna","al-bayti","an","lā","tush'rik","bī","shayan","waṭahhir","baytiya","lilṭṭāifīna","wal-qāimīna","wal-rukaʿi","al-sujūdi",null],"verseTiming":[[1,0,700],[2,700,2000],[3,2000,3640],[4,3640,4440],[5,4440,5330],[6,5330,5530],[7,5530,6080],[8,6080,6810],[9,6810,7200],[10,7200,8920],[11,8920,9830],[12,9830,10900],[13,10900,12420],[14,12420,13270],[15,13270,16550],[16,16550,19710],[17,19710,20970],[18,20970,23855]]}}