{"name":"22:2","price":"جس دن تم اسے دیکھ لو گے ہر دودھ پلانے والی اپنے دودھ پیتے بچے کو بھول جائے گی اور تمام حمل والیوں کے حمل گر جائیں گے اور تو دیکھے گا کہ لوگ مدہوش دکھائی دیں گے، حاﻻنکہ درحقیقت وه متوالے نہ ہوں گے لیکن اللہ کا عذاب بڑا ہی سخت ہے.(1)","arabic":"يَوۡمَ تَرَوۡنَهَا تَذۡهَلُ كُلُّ مُرۡضِعَةٍ عَمَّآ أَرۡضَعَتۡ وَتَضَعُ كُلُّ ذَاتِ حَمۡلٍ حَمۡلَهَا وَتَرَى ٱلنَّاسَ سُكَٰرَىٰ وَمَا هُم بِسُكَٰرَىٰ وَلَٰكِنَّ عَذَابَ ٱللَّهِ شَدِيدٞ","category":["22 (Al-Hajj)","Al-Hajj","Surah Al-Hajj","Chapter Al-Hajj","Hajj","Surah Hajj","Chapter Hajj","Al Hajj","Surah Al Hajj","Chapter Al Hajj","Surah 22","Chapter 22","The Pilgrimage","الحَجّ"],"ayahNumber":2597,"juzNumber":17,"footnotes":"(1) آیت مذکورہ میں جس زلزلے کا ذکر ہے، جس کے نتائج دوسری آیت میں بتلائے گئے ہیں جس کا مطلب لوگوں پر سخت خوف، دہشت اور گھبراہٹ کا طاری ہونا، یہ قیامت سے قبل ہوگا اور اس کے ساتھ دنیا فنا ہو جائیگی۔ یا یہ قیامت کے بعد اس وقت ہوگا جب قبروں سے اٹھ کر میدان محشر میں جمع ہوں گے۔ بہت سے مفسرین پہلی رائے کے قائل ہیں۔ جبکہ بعض مفسرین دوسری رائے کے اور اس کی تائید میں وہ احادیث پیش کرتے ہیں مثلا اللہ تعالٰی آدم (عليه السلام) کو حکم دے گا کہ وہ اپنی ذریت میں سے ہزار میں ۹۹۹ جہنم کے لیے نکال دے۔ یہ بات سن کر حمل والیوں کے حمل گرجائیں گے بچے بوڑھے ہوجائیں گے اور لوگ مدہوش سے نظر آئیں گے حالانکہ وہ مدہوش نہیں ہونگے صرف عذاب کی شدت ہوگی۔ یہ بات صحابہ(رضي الله عنهم) پر بڑی گراں گزری ان کے چہرے متغیر ہوگئے نبی (صلى الله عليه وسلم) نے یہ دیکھ کر فرمایا (گھبراؤ نہیں) یہ ۹۹۹ یاجوج ماجوج میں سے ہوں گے اور تم میں سے صرف ایک ہوگا۔ تمہاری (تعداد) لوگوں میں اس طرح ہوگی جیسے سفید رنگ کے بیل کے پہلو میں کالے بال یا کالے رنگ کے بیل کے پہلو میں سفید بال ہوں اور مجھے امید ہے کہ اہل جنت میں تم چوتھائی یا تہائی یا نصف ہو گے جسے سن کر صحابہ کرام (رضي الله عنهم) نے بطور مسرت کے اللہ اکبر کا نعرہ بلند کیا (صحیح بخاری تفسیر سورہ حج) پہلی رائے بھی بےوزن نہیں ہے بعض ضعیف احادیث سے ان کی بھی تائید ہوتی ہے اس لئے زلزلہ اور اس کی کیفیات سے مراد اگر فزع اور ہولناکی کی شدت ہے (ظاہر یہی ہے) تو سخت گھبراہٹ اور ہولناکی کی یہ کیفیت دونوں موقعوں پر ہی ہوگی اس لیے دونوں ہی رائیں صحیح ہوسکتی ہیں کیونکہ دونوں موقعوں پر لوگوں کی کیفیت ایسی ہوگی جیسی اس آیت میں اور صحیح بخاری کی روایت میں بیان کی گئی ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yawma tarawnahā tadhhalu kullu mur'ḍiʿatin ʿammā arḍaʿat wataḍaʿu kullu dhāti ḥamlin ḥamlahā watarā al-nāsa sukārā wamā hum bisukārā walākinna ʿadhāba al-lahi shadīdun ","translations":["(The) Day","you will see it","will forget","every","nursing mother","that which","she was nursing","and will deliver","every","pregnant woman","pregnant woman","her load","and you will see","[the] mankind","intoxicated","while not","they","(are) intoxicated","but","(the) punishment","(of) Allah","(will be) severe","(2)"],"transliterationArr":["yawma","tarawnahā","tadhhalu","kullu","mur'ḍiʿatin","ʿammā","arḍaʿat","wataḍaʿu","kullu","dhāti","ḥamlin","ḥamlahā","watarā","al-nāsa","sukārā","wamā","hum","bisukārā","walākinna","ʿadhāba","al-lahi","shadīdun",null],"verseTiming":[[1,0,730],[2,730,2060],[3,2060,3000],[4,3000,3680],[5,3680,4900],[6,4900,7700],[7,7700,8740],[8,8740,9660],[9,9660,10280],[10,10280,10930],[11,10930,11770],[12,11770,12980],[13,12980,14430],[14,14430,15050],[15,15050,15690],[16,15690,16500],[17,16500,17550],[18,17550,18160],[19,18160,19690],[20,19690,20830],[21,20830,21400],[22,21400,22440],[23,22440,23800],[24,23800,25670],[25,25670,26530],[26,26530,27440],[27,27440,28025]]}}