{"name":"22:25","price":"جن لوگوں نے کفر کیا اور اللہ کی راه سے روکنے لگے اور اس حرمت والی مسجد سے(1) بھی جسے ہم نے تمام لوگوں کے لئے مساوی کر دیا ہے وہیں کے رہنے والے ہوں یا باہر کے ہوں(2)، جو بھی ﻇلم کے ساتھ وہاں الحاد کا اراده کرے(3) ہم اسے درد ناک عذاب چکھائیں گے.(4)","arabic":"إِنَّ ٱلَّذِينَ كَفَرُواْ وَيَصُدُّونَ عَن سَبِيلِ ٱللَّهِ وَٱلۡمَسۡجِدِ ٱلۡحَرَامِ ٱلَّذِي جَعَلۡنَٰهُ لِلنَّاسِ سَوَآءً ٱلۡعَٰكِفُ فِيهِ وَٱلۡبَادِۚ وَمَن يُرِدۡ فِيهِ بِإِلۡحَادِۭ بِظُلۡمٖ نُّذِقۡهُ مِنۡ عَذَابٍ أَلِيمٖ","category":["22 (Al-Hajj)","Al-Hajj","Surah Al-Hajj","Chapter Al-Hajj","Hajj","Surah Hajj","Chapter Hajj","Al Hajj","Surah Al Hajj","Chapter Al Hajj","Surah 22","Chapter 22","The Pilgrimage","الحَجّ"],"ayahNumber":2620,"juzNumber":17,"footnotes":"(1) روکنے والوں سے مراد کفار مکہ ہیں جنہوں نے 6ہجری میں مسلمانوں کو مکہ جاکر عمرہ کرنے سے روک دیا تھا، اور مسلمانوں کو حدیبیہ سے واپس آنا پڑا تھا۔\n(2) اس میں اختلاف ہے کہ مسجد حرام سے مراد خاص مسجد (خانہ کعبہ) ہی ہے یا پورا حرم مکہ۔ کیونکہ قرآن میں بعض جگہ پورے حرم مکہ کے لیے بھی مسجد حرام کا لفظ بولا گیا ہے۔، یعنی جزء بول کر کل مراد لیا گیا ہے۔ جہاں تک خاص مسجد حرام کا تعلق ہے، اس کی بابت تو یہ بات متفقہ ہے کہ اس میں مقیم و غیر مقیم ملکی اور آفاقی سب کا حصہ مساوی ہے یعنی بلا تخسیص و تفریق ہر شخص رات اور دن کے کسی بھی حصے میں عبادت کرسکتا ہے۔ کسی کے لئے بھی کسی مسلمان کو عبادت سے روکنے کی اجازت نہیں ہے۔ البتہ جن علما نے مسجد حرام سے مراد پورا حرم لیا ہے۔ ان کے ایک گروہ کی رائے یہ ہے کہ پورا حرم مکی سب مسلمانوں کے لئے یکساں حیثیت رکھتا ہے اور اس کے مکانوں اور زمینوں کا کوئی مالک نہیں۔ اس لئے ان کی خرید و فروخت اور ان کو کرائے پر دینا ان کے نزدیک جائز نہیں۔ جو شخص بھی کسی جگہ سے حج یا عمرے کے لئے مکہ جائے تو اسے یہ حق حاصل ہے کہ وہ جہاں چاہے ٹھہر جائے، وہاں رہنے والوں کی ذمہ داری ہے کہ وہ اپنے گھروں میں ٹھہرانے سے نہ روکیں۔ دوسری رائے یہ ہے کہ مکانات اور زمینیں ملک خاص ہو سکتی ہیں اور ان میں مالکانہ تصرفات یعنی بیچنا، کرائے پر دینا جائز ہے۔ البتہ وہ مقامات جن کا تعلق مناسک حج سے ہے، مثلاً منی، مزدلفہ اور عرفات کے میدان یہ وقف عام ہیں۔ ان میں کسی کی ملکیت جائز نہیں۔ یہ مسئلہ قدیم فقہاء کے درمیان خاصہ مختلف فیہ رہا ہے۔ تاہم آجکل تقریباً تمام کے تمام علماء ہی ملکیت خاص کے قائل ہوگئے ہیں۔ اور یہ مسئلہ سرے سے اختلافی ہی نہیں رہا۔ مولانا مفتی محمد شفیع مرحوم نے بھی امام ابو حنیفہ اور فقہاء کا مسلک مختار اسی کو قرار پایا ہے۔ (ملاحظہ ہو معارف القرآن جلد 6صفحہ253)\n(3) الحاد کے لفظی معنی تو کج روی ہے ہیں یہاں یہ عام ہے، کفر و شرک سے لے کر ہر قسم کے گناہ کے لئے حتٰی کہ بعض عملا الفاظ قرآنی کے پیش نظر اس بات تک قائل ہیں کہ حرم میں اگر کسی گناہ کا ارادہ بھی کر لے گا، (چاہے اس پر عمل نہ کر سکے) تو وہ بھی اس وعید میں شامل ہے۔ بعض کہتے ہیں کہ محض ارادے پر مؤاخذہ نہیں ہوگا، جیسا کہ دیگر آیات سے واضح ہے۔ تاہم ارادہ اگر عزم مصمم کی حد تک ہو تو پھر گرفت ہو سکتا ہے۔ (فتح القدیر)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"inna alladhīna kafarū wayaṣuddūna ʿan sabīli al-lahi wal-masjidi al-ḥarāmi alladhī jaʿalnāhu lilnnāsi sawāan al-ʿākifu fīhi wal-bādi waman yurid fīhi bi-il'ḥādin biẓul'min nudhiq'hu min ʿadhābin alīmin ","translations":["Indeed","those who","disbelieved","and hinder","from","(the) way","(of) Allah","and Al-Masjid Al-Haraam","and Al-Masjid Al-Haraam","which","We made it","for the mankind","equal","(are) the resident","therein","and the visitor","and whoever","intends","therein","of deviation","(or) wrongdoing","We will make him taste","of","a punishment","painful","(25)"],"transliterationArr":["inna","alladhīna","kafarū","wayaṣuddūna","ʿan","sabīli","al-lahi","wal-masjidi","al-ḥarāmi","alladhī","jaʿalnāhu","lilnnāsi","sawāan","al-ʿākifu","fīhi","wal-bādi","waman","yurid","fīhi","bi-il'ḥādin","biẓul'min","nudhiq'hu","min","ʿadhābin","alīmin",null],"verseTiming":[[1,0,1300],[2,1300,2370],[3,2370,3320],[4,3320,4730],[5,4730,5900],[6,5900,7080],[7,7080,7670],[8,7670,8940],[9,8940,10010],[10,10010,10890],[11,10890,12140],[12,12140,15679],[13,15679,17449],[14,17449,18469],[15,18469,19359],[16,19359,20679],[17,20679,22259],[18,22259,24999],[19,24999,26089],[20,26089,26749],[21,26749,29829],[22,29829,30339],[23,30339,31359],[24,31359,32059],[25,32059,33429],[26,33429,35179],[27,35179,36779],[28,36779,37129],[29,37129,38309],[30,38309,40444]]}}