{"name":"22:39","price":"جن (مسلمانوں) سے (کافر) جنگ کر رہے ہیں انہیں بھی مقابلے کی اجازت دی جاتی ہے کیونکہ وه مظلوم ہیں(1) ۔ بیشک ان کی مدد پر اللہ قادر ہے.","arabic":"أُذِنَ لِلَّذِينَ يُقَٰتَلُونَ بِأَنَّهُمۡ ظُلِمُواْۚ وَإِنَّ ٱللَّهَ عَلَىٰ نَصۡرِهِمۡ لَقَدِيرٌ","category":["22 (Al-Hajj)","Al-Hajj","Surah Al-Hajj","Chapter Al-Hajj","Hajj","Surah Hajj","Chapter Hajj","Al Hajj","Surah Al Hajj","Chapter Al Hajj","Surah 22","Chapter 22","The Pilgrimage","الحَجّ"],"ayahNumber":2634,"juzNumber":17,"footnotes":"(1) اکثر سلف کا قول ہے کہ اس آیت میں سب سے پہلے جہاد کا حکم دیا گیا، جس کے دو مقصد یہاں بیان کئے گئے ہیں۔ مظلومیت کا خاتمہ اور اعلائے کلمۃ اللہ۔ اس لئے کہ مظلومین کی مدد اور ان کی داد رسی نہ کی جائے تو پھر دنیا میں زور آور کمزوروں کو اور بےوسیلہ لوگوں کو جینے ہی نہ دیں جس سے زمین فساد سے بھر جائے۔ اور اگر باطل تو باطل کے غلبے سے دنیا کا امن و سکون اور اللہ کا نام لینے والوں کے لئے کوئی عبادت خانہ باقی نہ رہے (مزید تشریح کے لئے دیکھئے سورہ بقرہ، آیت 251 کا حاشیہ)۔ صَوَامِعُ (صَوْمَعَةٌ کی جمع) سے چھوٹے گرجے اور بِيَعٌ ( بِيعَةٌ کی جمع) سے بڑے گرجے صَلَوَاتٌ سے یہودیوں کے عبادت خانے اور مساجد سے مسلمانوں کی عبادت گاہیں مراد ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"udhina lilladhīna yuqātalūna bi-annahum ẓulimū wa-inna al-laha ʿalā naṣrihim laqadīrun ","translations":["Permission is given","to those who","are being fought","because they","were wronged","And indeed","Allah","for","their victory","(is) surely Able","(39)"],"transliterationArr":["udhina","lilladhīna","yuqātalūna","bi-annahum","ẓulimū","wa-inna","al-laha","ʿalā","naṣrihim","laqadīrun",null],"verseTiming":[[1,0,700],[2,700,1960],[3,1960,3560],[4,3560,5670],[5,5670,6780],[6,6780,8730],[7,8730,9690],[8,9690,10400],[9,10400,11500],[10,11500,14105]]}}