{"name":"22:36","price":"قربانی کے اونٹ(1) ہم نے تمہارے لئے اللہ تعالیٰ کی نشانیاں مقرر کر دی ہیں ان میں تمہیں نفع ہے۔ پس انہیں کھڑا کر کے ان پر اللہ کا نام لو(2)، پھر جب ان کے پہلو زمین سے لگ(3) جائیں اسے (خود بھی) کھاؤ(4) اور مسکین سوال سے رکنے والوں اور سوال کرنے والوں کو بھی کھلاؤ(5)، اسی طرح ہم نے چوپایوں کو تمہارے ماتحت کردیا ہے کہ تم شکر گزاری کرو.","arabic":"وَٱلۡبُدۡنَ جَعَلۡنَٰهَا لَكُم مِّن شَعَٰٓئِرِ ٱللَّهِ لَكُمۡ فِيهَا خَيۡرٞۖ فَٱذۡكُرُواْ ٱسۡمَ ٱللَّهِ عَلَيۡهَا صَوَآفَّۖ فَإِذَا وَجَبَتۡ جُنُوبُهَا فَكُلُواْ مِنۡهَا وَأَطۡعِمُواْ ٱلۡقَانِعَ وَٱلۡمُعۡتَرَّۚ كَذَٰلِكَ سَخَّرۡنَٰهَا لَكُمۡ لَعَلَّكُمۡ تَشۡكُرُونَ","category":["22 (Al-Hajj)","Al-Hajj","Surah Al-Hajj","Chapter Al-Hajj","Hajj","Surah Hajj","Chapter Hajj","Al Hajj","Surah Al Hajj","Chapter Al Hajj","Surah 22","Chapter 22","The Pilgrimage","الحَجّ"],"ayahNumber":2631,"juzNumber":17,"footnotes":"(1) دْنٌ، بَدَنةٌ کی جمع ہے یہ جانور عام طور پر موٹا تازہ ہوتا ہے اس لیے بدنۃ کہا جاتا ہے۔ فربہ جانور۔ اہل لغت نے اسے صرف اونٹوں کے ساتھ خاص کیا ہے لیکن حدیث کی رو سے گائے پر بھی بدنۃ کا اطلاق صحیح ہے مطلب یہ ہے کہ اونٹ اور گائے جو قربانی کے لیے لیے جائیں یہ بھی شعائر اللہ یعنی اللہ کے ان احکام میں سے ہیں جو مسلمانوں کے لیے خاص اور ان کی علامت ہیں۔\n(2) صَوَافَّ مَصْفُوفَةً (صف بستہ یعنی کھڑے ہوئے) معنی میں ہے اونٹ کو اسی طرح کھڑے کھڑے نحر کیا جاتا ہے کہ بایاں ہاتھ پاؤں اس کا بندھا ہوا اور تین پاؤں پر وہ کھڑا ہوتا ہے۔\n(3) یعنی سارا خون نکل جائے اور وہ بےروح ہو کر زمین پر گرے تب اسے کاٹنا شروع کرو۔ کیونکہ جی دار جانور کا گوشت کاٹ کر کھانا ممنوع ہے۔ «مَا قُطِعَ مِنَ الْبَهِيمَةِ وَهِيَ حَيَّةٌ، فَهُوَ مَيْتَةٌ» ( أبو داود، كتاب الصيد، باب في صيد قطع منه قطعة- ترمذي، أبواب الصيد، باب ما جاء ما قطع من الحي فهو ميت، وابن ماجه) ”جس جانور سے اس حال میں گوشت کاٹا جائے کہ وہ زندہ ہو تو وہ (کاٹا) ہوا گوشت مردہ ہے“۔\n(4) بعض علماء کے نزدیک یہ امر وجوب کے لئے ہے یعنی قربانی کا گوشت کھانا، قربانی کرنے والے کے لئے واجب ہے یعنی ضروری ہے اور اکثر علماء کے نزدیک یہ امر جواز کے لئے ہے۔ یعنی اس امر کا مقصد صرف جواز کا اثبات یعنی اگر کھا لیا جائے تو جائز یا پسندیدہ ہے اور اگر کوئی نہ کھائے بلکہ سب کا سب تقسیم کر دے تو کوئی گناہ نہیں ہے۔\n(5) قانع کے ایک معنی سائل کے اور دوسرے معنی قناعت کرنے والے کے کیے گئے ہیں یعنی وہ سوال نہ کرے اور معتر کے معنی بعض نے بغیر سوال کے سامنے آنے والے کے کیے ہیں اور تیسرا سائلین اور معاشرے کی ضرورت مند افراد کے لیے۔ جس کی تائید میں یہ حدیث بھی پیش کی جاتی جس میں رسول اللہ (صلى الله عليه وسلم) نے فرمایا میں نے تمہیں (پہلے) تین دن سے زیادہ قربانی کا گوشت ذخیرہ کرکے رکھنے سے منع کیا تھا لیکن اب تمہیں اجازت ہے کہ کھاؤ اور جو مناسب سمجھو ذخیرہ کرو دوسری روایت کے الفاظ ہیں پس کھاؤ، ذخیرہ کرو اور صدقہ کرو\"۔ ایک اور روایت کے الفاظ اس طرح ہیں \"پس کھاؤ، کھلاؤ اور صدقہ کرو\" (البخاری کتاب الاضاحی ۔ مسلم کتاب الاضاحی، باب بیان ما کان من النھی عن اکل لحوم الاضاحی بعد ثلاث والسنن) بعض علما دو حصے کرنے کے قائل ہیں۔ نصف اپنے لئے اور نصف صدقے کے لئے، وہ اس سے ما قبل گزرنے والی آیت «فَكُلُوا مِنْهَا وَأَطْعِمُوا الْبَائِسَ الْفَقِيرَ» سے استدلال کرتے ہیں۔ لیکن درحقیقت کسی بھی ایت یا حدیث سے اس طرح کے دو یا تین حصوں میں تقسیم کرنے کا حکم نہیں نکلتا بلکہ ان میں مطلقاً کھانے کھلانے کا حکم ہے۔ اس لئے اس اطلاق کو اپنی جگہ برقرار رہنا چاہیے اور کسی تقسیم کا پابند نہیں بنانا چاہیے۔ البتہ قربانی کی کھالوں کی بابت اتفاق ہے کہ اسے یا تو اپنے استعمال میں لاؤ یا صدقہ کردو، اسے بیچنے کی اجازت نہیں ہے۔ جیسا کہ حدیث میں ہے، (مسند احمد: 4/15) تاہم بعض علماء نے کھال خود بیچ کر اس کی قیمت فقراء پر تقسیم کرنے کی رخصت دی ہے، (ابن کثیر) ایک ضروری وضاحت: قرآن کریم میں یہاں قربانی کا ذکر مسائل حج کے ضمن میں آیا ہے، جس سے منکرین حدیث یہ استدلال کرتے ہیں کہ قربانی صرف حاجیوں کے ہی ہے۔ دیگر مسلمانوں کے لئے یہ ضروری نہیں۔ لیکن یہ بات صحیح نہیں۔ قربانی کرنے کا مطلق حکم بھی دوسرے مقام پر موجود ہے، «فَصَلِّ لِرَبِّكَ وَانْحَرْ» (الکوثر:2) «اپنے رب کے لئے نماز پڑھ اور قربانی کر»۔ اس کی تبیین و تشریح (عملی) نبی (صلى الله عليه وسلم) نے اس طرح فرمائی کہ آپ (صلى الله عليه وسلم) خود مدینے میں ہر سال 10 ذوالحجہ کو قربانی کرتے رہے اور مسلمانوں کو بھی قربانی کرنے کی تاکید کرتے رہے۔ چنانچہ صحابہ (رضي الله عنهم) بھی کرتے رہے۔ علاوہ ازیں آپ (صلى الله عليه وسلم) نے قربانی کی بابت جہاں دیگر بہت سی ہدایات دیں، وہاں یہ بھی فرمایا کہ 10 ذوالحجہ کو ہم سب سے پہلے (عید کی) نماز پڑھیں اور اس کے بعد جاکر جانور ذبح کریں، فرمایا، \"جس نے نماز (عید) سے قبل اپنی قربانی کرلی، اس نے گوشت کھانے میں جلدی کی، اس کی قربانی نہیں ہوئی، (صحيح بخاري ، كتاب العيدين ، باب التبكير إلى العيد ، ومسلم كتاب الأضاحي ، باب ... وقتها) اس سے بھی واضح ہے کہ قربانی کا حکم ہر مسلمان کے لئے ہے وہ جہاں بھی ہو۔ کیوں کہ حاجی تو عید الاضحیٰ کی نماز ہی نہیں پڑھتے۔ جس سے صاف ظاہر ہے کہ یہ حکم غیر حاجیوں کے لئے ہی ہے۔ تاہم یہ واجب نہیں ہے۔ سنت مؤکدہ ہے۔ اسی طرح دکھلاوے کی نیت سے کئی کئی قربانیاں کرنے کا رواج بھی خلاف سنت ہے۔ حدیث کے مطابق پورے گھر کے افراد کی طرف سے ایک جانور کی قربانی کافی ہے۔ صحابہ کا عمل اسی کے مطابق تھا، (ترمذي، أبواب الأضاحي، ما جاء أن الشاة الواحدة تجزئ عن أهل البيت، وابن ماجه)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wal-bud'na jaʿalnāhā lakum min shaʿāiri al-lahi lakum fīhā khayrun fa-udh'kurū is'ma al-lahi ʿalayhā ṣawāffa fa-idhā wajabat junūbuhā fakulū min'hā wa-aṭʿimū al-qāniʿa wal-muʿ'tara kadhālika sakharnāhā lakum laʿallakum tashkurūna ","translations":["And the camels and cattle ","We have made them","for you","among","(the) Symbols","(of) Allah","for you","therein","(is) good","So mention","(the) name","(of) Allah","over them","(when) lined up","and when","are down","their sides","then eat","from them","and feed","the needy who do not ask","and the needy who ask","Thus","We have subjected them","to you","so that you may","be grateful","(36)"],"transliterationArr":["wal-bud'na","jaʿalnāhā","lakum","min","shaʿāiri","al-lahi","lakum","fīhā","khayrun","fa-udh'kurū","is'ma","al-lahi","ʿalayhā","ṣawāffa","fa-idhā","wajabat","junūbuhā","fakulū","min'hā","wa-aṭʿimū","al-qāniʿa","wal-muʿ'tara","kadhālika","sakharnāhā","lakum","laʿallakum","tashkurūna",null],"verseTiming":[[1,0,1110],[2,1110,2660],[3,2660,3220],[4,3220,4950],[5,4950,7889],[6,7889,8719],[7,8719,9309],[8,9309,10149],[9,10149,13019],[10,13019,13799],[11,13799,14199],[12,14199,15129],[13,15129,16149],[14,16149,20498],[15,20498,21968],[16,21968,22818],[17,22818,24128],[18,24128,25078],[19,25078,26048],[20,26048,26998],[21,26998,28288],[22,28288,30218],[23,30218,31268],[24,31268,33038],[25,33038,33648],[26,33648,35078],[27,35078,38483]]}}