{"name":"22:30","price":"یہ ہے اور جو کوئی اللہ کی حرمتوں(1) کی تعظیم کرے اس کے اپنے لئے اس کے رب کے پاس بہتری ہے۔ اور تمہارے لئے چوپائے جانور حلال کر دیئے گئے بجز ان کے جو تمہارے سامنے(2) بیان کیے گئے ہیں پس تمہیں بتوں کی گندگی سے بچتے رہنا چاہئے(3) اور جھوٹی بات سے بھی پرہیز کرنا چاہئے.(4)","arabic":"ذَٰلِكَۖ وَمَن يُعَظِّمۡ حُرُمَٰتِ ٱللَّهِ فَهُوَ خَيۡرٞ لَّهُۥ عِندَ رَبِّهِۦۗ وَأُحِلَّتۡ لَكُمُ ٱلۡأَنۡعَٰمُ إِلَّا مَا يُتۡلَىٰ عَلَيۡكُمۡۖ فَٱجۡتَنِبُواْ ٱلرِّجۡسَ مِنَ ٱلۡأَوۡثَٰنِ وَٱجۡتَنِبُواْ قَوۡلَ ٱلزُّورِ","category":["22 (Al-Hajj)","Al-Hajj","Surah Al-Hajj","Chapter Al-Hajj","Hajj","Surah Hajj","Chapter Hajj","Al Hajj","Surah Al Hajj","Chapter Al Hajj","Surah 22","Chapter 22","The Pilgrimage","الحَجّ"],"ayahNumber":2625,"juzNumber":17,"footnotes":"(1) ان حرمتوں سے مراد وہ مناسک حج ہیں جن کی تفصیل ابھی گزری ہے۔ ان کی تعظیم کا مطلب، ان کی اس طرح ادائیگی ہے جس طرح بتلایا گیا ہے۔ یعنی ان کی خلاف ورزی کر کے ان حرمتوں کو پامال نہ کرے۔\n(2) \"جو بیان کئے گئے ہیں \" کا مطلب ہے جن کا حرام ہونا بیان کر دیا گیا، جیسے آیت «حُرِّمَتْ عَلَيْكُمُ الْمَيْتَةُ وَالدَّمُ وَلَحْمُ الْخِنْزِيْرِ» (المائدہ:3) میں تفصیل ہے۔\n(3) رجس کے معنی گندگی اور پلیدی کے ہیں یہاں اس سے مراد لکڑی، لوہے یا کسی اور چیز کے بنے ہوئے بت ہیں۔ مطلب یہ ہے کہ اللہ کو چھوڑ کر کسی اور کی عبادت کرنا، یہ نجاست ہے اور اللہ کے غضب اور عدم رضا کا باعث، اس سے بچو۔\n(4) جھوٹی بات میں، جھوٹی بات کے علاوہ جھوٹی قسم بھی ہے (جس کو حدیث میں شرک اور حقوق والدین کے بعد تیسرے نمبر پر کبیرہ گناہوں میں شمار کیا گیا ہے) اور سب سے بڑا جھوٹ یہ ہے کہ اللہ جن چیزوں سے پاک ہے، وہ اسکی طرف منسوب کی جائیں۔ مثلًا اللہ کی اولاد ہے وغیرہ۔ فلاں بزرگ کے اختیارات میں شریک ہے یافلاں کام پر اللہ کس طرح قادر ہوگاجیسے کفار بعث بعد الموت پر تعجب کا اظہار کرتے رہے ہیں اور کرتے ہیں یا اپنی طرف سے اللہ کی حلال کردہ چیزوں کو حرام اور حرام چیزوں کو حلال کر لینا جیسے مشرکین بحیرہ سائبہ وصیلہ اور عام جانوروں کو اپنے اوپر حرام کر لیتے تھے یہ سب جھوٹ ہیں ان سے اجتناب ضروری ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"dhālika waman yuʿaẓẓim ḥurumāti al-lahi fahuwa khayrun lahu ʿinda rabbihi wa-uḥillat lakumu al-anʿāmu illā mā yut'lā ʿalaykum fa-ij'tanibū al-rij'sa mina al-awthāni wa-ij'tanibū qawla al-zūri ","translations":["That","and whoever","honors","(the) sacred rites","(of) Allah","then it","(is) best","for him","near","his Lord","And are made lawful","to you","the cattle","except","what","is recited","to you","So avoid","the abomination","of","the idols","and avoid","(the) word","false","(30)"],"transliterationArr":["dhālika","waman","yuʿaẓẓim","ḥurumāti","al-lahi","fahuwa","khayrun","lahu","ʿinda","rabbihi","wa-uḥillat","lakumu","al-anʿāmu","illā","mā","yut'lā","ʿalaykum","fa-ij'tanibū","al-rij'sa","mina","al-awthāni","wa-ij'tanibū","qawla","al-zūri",null],"verseTiming":[[1,0,1020],[2,1020,1580],[3,1580,3240],[4,3240,4350],[5,4350,5180],[6,5180,5790],[7,5790,6510],[8,6510,7210],[9,7210,8570],[10,8570,9920],[11,9920,11190],[12,11190,11770],[13,11770,13020],[14,13020,13890],[15,13890,14300],[16,14300,15110],[17,15110,16670],[18,16670,17660],[19,17660,18570],[20,18570,18900],[21,18900,20230],[22,20230,21450],[23,21450,22090],[24,22090,24355]]}}