{"name":"22:34","price":"اور ہر امت کے لئے ہم نے قربانی کے طریقے مقرر فرمائے ہیں تاکہ وه ان چوپائے جانوروں پر اللہ کا نام لیں جو اللہ نے انہیں دے رکھے ہیں(1) ۔ سمجھ لو کہ تم سب کا معبود برحق صرف ایک ہی ہے تم اسی کے تابع فرمان ہو جاؤ عاجزی کرنے والوں کو خوشخبری سنا دیجئے!","arabic":"وَلِكُلِّ أُمَّةٖ جَعَلۡنَا مَنسَكٗا لِّيَذۡكُرُواْ ٱسۡمَ ٱللَّهِ عَلَىٰ مَا رَزَقَهُم مِّنۢ بَهِيمَةِ ٱلۡأَنۡعَٰمِۗ فَإِلَٰهُكُمۡ إِلَٰهٞ وَٰحِدٞ فَلَهُۥٓ أَسۡلِمُواْۗ وَبَشِّرِ ٱلۡمُخۡبِتِينَ","category":["22 (Al-Hajj)","Al-Hajj","Surah Al-Hajj","Chapter Al-Hajj","Hajj","Surah Hajj","Chapter Hajj","Al Hajj","Surah Al Hajj","Chapter Al Hajj","Surah 22","Chapter 22","The Pilgrimage","الحَجّ"],"ayahNumber":2629,"juzNumber":17,"footnotes":"(1) حلال ہونے سے مراد جہاں ان کا ذبح کرنا حلال ہوتا ہے۔ یعنی یہ جانور، مناسک حج کی ادائیگی کے بعد، بیت اللہ اور حرم مکی میں پہنچتے ہیں اور وہاں اللہ کے نام پر ذبح کر دئیے جاتے ہیں، پس مذکورہ فوائد کا سلسلہ بھی ختم ہو جاتا ہے۔ اور اگر وہ ایسے ہی حرم کے لئے قربانی دی جاتی ہے، تو حرم میں پہنچتے ہی ذبح کر دیئے جاتے ہیں اور فقراء مکہ میں ان کا گوشت تقسیم کر دیا جاتا ہے۔\n(2) مَنْسَكٌ، نَسَكَ، يَنْسُكُ کا مصدر ہے معنی ہیں اللہ کے تقرب کے لیے قربانی کرنا ذبیحۃ (ذبح شدہ جانور) کو بھی نسیکۃ کہا جاتا ہے جس کی جمع نُسُكٌ ہے اس کے معنی اطاعت وعبادت کے بھی ہیں۔ کیونکہ رضائے الٰہی کے لئے جانور کی قربانی کرنا عبادت ہے۔ اسی لئے غیر اللہ کے نام پر یا ان کی خوشنودی کے لئے جانور ذبح کرنا غیر اللہ کی عبادت ہے،یا مَنْسِكٌ (سین کی فتح یا کسرے کے ساتھ) اسم ظرف ہے۔ مَوْضِعُ نَحْرٍ (ذبح کرنے کی جگہ) یا مَوْضِعُ عِبَادَةٍ ۔ اسی سے مناسک حج ہے یعنی وہ جگہیں، جہاں حج کے اعمال و ارکان ادا کئے جاتے ہیں، جیسے عرفات، مزدلفہ، منٰی اور مکہ۔ مطلق ارکان و اعمال حج کو بھی مناسک کہہ لیا جاتا ہے۔ مطلب آیت کا یہ ہے کہ ہم پہلے بھی ہر مذہب والوں کے لئے ذبح کا یا عبادت کا یہ طریقہ مقرر کرتے آئے ہیں تاکہ وہ اس کے ذریعے سے اللہ کا قرب حاصل کرتے رہیں۔ اور اس میں حکمت یہ ہے کہ ہمارا نام لیں۔ یعنی بسم اللہ و اللہ اکبر کہہ کر ذبح کریں یا ہمیں یاد رکھیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walikulli ummatin jaʿalnā mansakan liyadhkurū is'ma al-lahi ʿalā mā razaqahum min bahīmati al-anʿāmi fa-ilāhukum ilāhun wāḥidun falahu aslimū wabashiri al-mukh'bitīna ","translations":["And for every","nation","We have appointed","a rite","that they may mention","(the) name","(of) Allah","over","what","He (has) provided them","of","(the) beast","(of) cattle","And your God","(is) God","One","so to Him","submit","And give glad tidings","(to) the humble ones","(34)"],"transliterationArr":["walikulli","ummatin","jaʿalnā","mansakan","liyadhkurū","is'ma","al-lahi","ʿalā","mā","razaqahum","min","bahīmati","al-anʿāmi","fa-ilāhukum","ilāhun","wāḥidun","falahu","aslimū","wabashiri","al-mukh'bitīna",null],"verseTiming":[[1,0,1090],[2,1090,3170],[3,3170,4620],[4,4620,6280],[5,6280,7480],[6,7480,7880],[7,7880,8840],[8,8840,9510],[9,9510,9950],[10,9950,10910],[11,10910,12630],[12,12630,13780],[13,13780,16220],[14,16220,18510],[15,18510,20249],[16,20249,21899],[17,21899,24169],[18,24169,25319],[19,25319,26839],[20,26839,30344]]}}