{"name":"22:44","price":"اور مدین والے بھی اپنے اپنے نبیوں کو جھٹلا چکے ہیں۔ موسیٰ (علیہ السلام) بھی جھٹلائے جا چکے ہیں پس میں نے کافروں کو یوں ہی سی مہلت دی پھر دھر دبایا(1) ، پھر میرا عذاب کیسا ہوا؟(2)","arabic":"وَأَصۡحَٰبُ مَدۡيَنَۖ وَكُذِّبَ مُوسَىٰۖ فَأَمۡلَيۡتُ لِلۡكَٰفِرِينَ ثُمَّ أَخَذۡتُهُمۡۖ فَكَيۡفَ كَانَ نَكِيرِ","category":["22 (Al-Hajj)","Al-Hajj","Surah Al-Hajj","Chapter Al-Hajj","Hajj","Surah Hajj","Chapter Hajj","Al Hajj","Surah Al Hajj","Chapter Al Hajj","Surah 22","Chapter 22","The Pilgrimage","الحَجّ"],"ayahNumber":2639,"juzNumber":17,"footnotes":"(1) اس میں نبی (صلى الله عليه وسلم) کو تسلی دی جا رہی ہے کہ یہ کفار مکہ اگر آپ کو جھٹلا رہے ہیں تو یہ نئی بات نہیں ہے پچھلی قومیں بھی اپنے پیغمبروں کے ساتھ یہی کچھ کرتی رہی ہیں اور میں بھی انہیں مہلت دیتا رہا۔ پھر جب ان کا وقت مہلت ختم ہوگیا تو انہیں تباہ برباد کر دیا گیا۔ اس میں تعریض وکنایہ ہے مشرکین مکہ کے لیے کہ تکذیب کے باوجود تم ابھی تک مؤاخذہ الہی سے بچے ہوئے ہو تو یہ نہ سمجھ لینا کہ ہمارا کوئی مؤاخذہ کرنے والا نہیں بلکہ یہ اللہ کی طرف سے مہلت ہے جو وہ ہر قوم کو دیا کرتا ہے لیکن اگر وہ اس اس مہلت سے فائدہ اٹھا کر اطاعت وانقیاد کا راستہ اختیار نہیں کرتی تو پھر اسے ہلاک یا مسلمانوں کے ذریعے سے مغلوب اور ذلت و رسوائی سے دوچار کردیا جاتا ہے۔\n(2) یعنی کس طرح میں نے انہیں اپنی نعمتوں سے محروم کرکے عذاب و ہلاکت سے دو چار کر دیا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-aṣḥābu madyana wakudhiba mūsā fa-amlaytu lil'kāfirīna thumma akhadhtuhum fakayfa kāna nakīri ","translations":["And the inhabitants","(of) Madyan","And Musa was denied","And Musa was denied","so I granted respite","to the disbelievers","then","I seized them","and how","was","My punishment","(44)"],"transliterationArr":["wa-aṣḥābu","madyana","wakudhiba","mūsā","fa-amlaytu","lil'kāfirīna","thumma","akhadhtuhum","fakayfa","kāna","nakīri",null],"verseTiming":[[1,0,1350],[2,1350,2680],[3,2680,3810],[4,3810,4730],[5,4730,6080],[6,6080,7820],[7,7820,9440],[8,9440,11320],[9,11320,12250],[10,12250,12900],[11,12900,15285]]}}