{"name":"22:41","price":"یہ وه لوگ ہیں کہ اگر ہم زمین میں ان کے پاؤں جما دیں تو یہ پوری پابندی سے نمازیں قائم کریں اور زکوٰتیں دیں اور اچھے کاموں کا حکم کریں اور برے کاموں سے منع کریں(1) ۔ تمام کاموں کا انجام اللہ کے اختیار میں ہے.(2)","arabic":"ٱلَّذِينَ إِن مَّكَّنَّٰهُمۡ فِي ٱلۡأَرۡضِ أَقَامُواْ ٱلصَّلَوٰةَ وَءَاتَوُاْ ٱلزَّكَوٰةَ وَأَمَرُواْ بِٱلۡمَعۡرُوفِ وَنَهَوۡاْ عَنِ ٱلۡمُنكَرِۗ وَلِلَّهِ عَٰقِبَةُ ٱلۡأُمُورِ","category":["22 (Al-Hajj)","Al-Hajj","Surah Al-Hajj","Chapter Al-Hajj","Hajj","Surah Hajj","Chapter Hajj","Al Hajj","Surah Al Hajj","Chapter Al Hajj","Surah 22","Chapter 22","The Pilgrimage","الحَجّ"],"ayahNumber":2636,"juzNumber":17,"footnotes":"(1) اس آیت میں اسلامی حکومت کی بنیادی اہداف اور اغراض و مقاصد بیان کئے گئے ہیں، جنہیں خلافت راشدہ کی دیگر اسلامی حکومتوں میں بروئے کار لایا گیا اور انہوں نے اپنی ترجیحات میں ان کو سر فہرست رکھا تو ان کی بدولت ان کی حکومتوں میں امن اور سکون بھی رہا، رفاہیت و خوش حالی بھی رہی اور مسلمان سربلند اور سرفراز بھی رہے۔ آج بھی سعودی عرب کی حکومت میں بحمد اللہ ان چیزوں کا اہتمام ہے، تو اس کی برکت سے وہ اب بھی امن و خوش حالی کے اعتبار سے دنیا کی بہترین اور مثالی مملکت ہے۔ آجکل اسلامی ملکوں میں فلاحی مملکت کے قیام کا بڑا غلغلہ اور شور ہے اور ہرآنے جانے والاحکمران اس کے دعوے کرتا ہے لیکن ہر اسلامی ملک میں بدامنی، فساد، قتل وغارت اور ادبار وپستی اور زبوں حالی روز افزوں ہے اس کی وجہ یہ ہے کہ سب اللہ کے بتلائے ہوئے راستے کو اختیار کرنے کے بجائے مغرب کے جمہوری اور لادینی نظام کے ذریعے سے فلاح وکامرانی حاصل کرنا چاہتے ہیں جو آسمان میں تھگلی لگانے اور ہوا کو مٹھی میں لینے کے مترادف ہے جب تک مسلمان مملکتیں قرآن کے بتلائے ہوئے اصول کے مطابق اقامت صلوۃ و زکوۃ اور امر بالمعروف اور نہی عن المنکر کا اہتمام نہیں کریں اور اپنی ترجیحات میں ان کو سرفہرست نہیں رکھیں گی وہ فلاحی ممللکت کے قیام میں کبھی کامیاب نہیں ہوسکیں گی۔\n(2) یعنی ہر بات کا مرجع اللہ کا حکم اور اس کی تدبیر ہی ہے اس کے حکم کے بغیر کائنات میں کوئی پتہ بھی نہیں ہلتا۔ چہ جائیکہ کوئی اللہ کے احکام اور ضابطوں سے انحراف کرکے حقیقی فلاح و کامیابی سے ہمکنار ہو جائے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"alladhīna in makkannāhum fī al-arḍi aqāmū al-ṣalata waātawū al-zakata wa-amarū bil-maʿrūfi wanahaw ʿani al-munkari walillahi ʿāqibatu al-umūri ","translations":["Those who","if","We establish them","in","the land","they establish","the prayer","and they give","zakah","and they enjoin","the right","and forbid","from","the wrong","And for Allah","(is the) end","(of) the matters","(41)"],"transliterationArr":["alladhīna","in","makkannāhum","fī","al-arḍi","aqāmū","al-ṣalata","waātawū","al-zakata","wa-amarū","bil-maʿrūfi","wanahaw","ʿani","al-munkari","walillahi","ʿāqibatu","al-umūri",null],"verseTiming":[[1,0,1320],[2,1320,1680],[3,1680,4900],[4,4900,5130],[5,5130,6070],[6,6070,6930],[7,6930,8280],[8,8280,9340],[9,9340,10580],[10,10580,11750],[11,11750,13340],[12,13340,14890],[13,14890,15770],[14,15770,16230],[15,16230,17960],[16,17960,19710],[17,19710,20840],[18,20840,23165]]}}