{"name":"22:54","price":"اور اس لئے بھی کہ جنہیں علم عطا فرمایا گیا ہے وه یقین کر لیں کہ یہ آپ کے رب ہی کی طرف سے سراسر حق ہی ہے پھر وه اس پر ایمان ﻻئیں اور ان کے دل اس کی طرف جھک جائیں(1) ۔ یقیناً اللہ تعالیٰ ایمان داروں کو راه راست کی طرف رہبری کرنے واﻻ ہی(2) ہے.","arabic":"وَلِيَعۡلَمَ ٱلَّذِينَ أُوتُواْ ٱلۡعِلۡمَ أَنَّهُ ٱلۡحَقُّ مِن رَّبِّكَ فَيُؤۡمِنُواْ بِهِۦ فَتُخۡبِتَ لَهُۥ قُلُوبُهُمۡۗ وَإِنَّ ٱللَّهَ لَهَادِ ٱلَّذِينَ ءَامَنُوٓاْ إِلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ","category":["22 (Al-Hajj)","Al-Hajj","Surah Al-Hajj","Chapter Al-Hajj","Hajj","Surah Hajj","Chapter Hajj","Al Hajj","Surah Al Hajj","Chapter Al Hajj","Surah 22","Chapter 22","The Pilgrimage","الحَجّ"],"ayahNumber":2649,"juzNumber":17,"footnotes":"(1) یعنی یہ القائے شیطانی، جو دراصل اغوائے شیطانی ہے، اگر اہل مشرکین اور اہل کفر و شرک کے حق میں فتنے کا ذریعہ ہے تو دوسری طرف جو علم معرفت کے حال ہیں، ان کے ایمان و یقین میں اضافہ ہو جاتا ہے اور وہ سمجھ جاتے ہیں کہ اللہ کی نازل کردہ بات یعنی قرآن حق ہے۔ جس سے ان کے دل بارگاہ الٰہی میں جھک جاتے ہیں۔\n(2) دنیا میں بھی اور آخرت میں بھی دنیا میں اس طرح کی ان کی راہنمائی حق کی طرف کر دیتا ہے اور اس کے قبول اور اتباع کی توفیق سے بھی نواز دیتا ہے باطل کی سمجھ بھی ان کو دے دیتا ہے اور اس سے انہیں بچا بھی لیتا ہے اور آخرت میں سیدھے راستے کی راہنمائی یہ ہے کہ انہیں جہنم کے عذاب الیم و عظیم سے بچا کر جنت میں داخل فرمائے گا اور وہاں اپنی نعمتوں اور دیدار سے انہیں نوازے گا۔ اللَّهُمَّ ! اجْعَلْنَا مِنْهُمْ","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waliyaʿlama alladhīna ūtū al-ʿil'ma annahu al-ḥaqu min rabbika fayu'minū bihi fatukh'bita lahu qulūbuhum wa-inna al-laha lahādi alladhīna āmanū ilā ṣirāṭin mus'taqīmin ","translations":["And that may know","those who","have been given","the knowledge","that it","(is) the truth","from","your Lord","and they believe","in it","and may humbly submit","to it","their hearts","And indeed","Allah","(is) surely (the) Guide","(of) those who","believe","to","a Path","Straight","(54)"],"transliterationArr":["waliyaʿlama","alladhīna","ūtū","al-ʿil'ma","annahu","al-ḥaqu","min","rabbika","fayu'minū","bihi","fatukh'bita","lahu","qulūbuhum","wa-inna","al-laha","lahādi","alladhīna","āmanū","ilā","ṣirāṭin","mus'taqīmin",null],"verseTiming":[[1,0,1440],[2,1440,2700],[3,2700,3290],[4,3290,4130],[5,4130,5460],[6,5460,6370],[7,6370,6610],[8,6610,7770],[9,7770,8960],[10,8960,9850],[11,9850,11080],[12,11080,11690],[13,11690,12970],[14,12970,14960],[15,14960,15920],[16,15920,16930],[17,16930,17950],[18,17950,20160],[19,20160,20810],[20,20810,22000],[21,22000,26215]]}}