{"name":"22:5","price":"لوگو! اگر تمہیں مرنے کے بعد جی اٹھنے میں شک ہے تو سوچو ہم نے تمہیں مٹی سے پیدا کیا پھر نطفہ سے پھر خون بستہ سے پھر گوشت کے لوتھڑے سے جو صورت دیا گیا تھا اور بے نقشہ تھا(1) ۔ یہ ہم تم پر ﻇاہر کر دیتے ہیں(2)، اور ہم جسے چاہیں ایک ٹھہرائے ہوئے وقت تک رحم مادر میں رکھتے ہیں(3) پھر تمہیں بچپن کی حالت میں دنیا میں ﻻتے ہیں پھر تاکہ تم اپنی پوری جوانی کو پہنچو، تم میں سے بعض تو وه ہیں جو فوت کر لئے جاتے ہیں(4) اور بعض بے غرض عمر کی طرف پھر سے لوٹا دیئے جاتے ہیں کہ وه ایک چیز سے باخبر ہونے کے بعد پھر بے خبر ہو جائے(5)۔ تو دیکھتا ہے کہ زمین (بنجر اور) خشک ہے پھر ہم اس پر بارشیں برساتے ہیں تو وه ابھرتی ہے اور پھولتی ہے اور ہر قسم کی رونق دار نباتات اگاتی ہے.(6)","arabic":"يَٰٓأَيُّهَا ٱلنَّاسُ إِن كُنتُمۡ فِي رَيۡبٖ مِّنَ ٱلۡبَعۡثِ فَإِنَّا خَلَقۡنَٰكُم مِّن تُرَابٖ ثُمَّ مِن نُّطۡفَةٖ ثُمَّ مِنۡ عَلَقَةٖ ثُمَّ مِن مُّضۡغَةٖ مُّخَلَّقَةٖ وَغَيۡرِ مُخَلَّقَةٖ لِّنُبَيِّنَ لَكُمۡۚ وَنُقِرُّ فِي ٱلۡأَرۡحَامِ مَا نَشَآءُ إِلَىٰٓ أَجَلٖ مُّسَمّٗى ثُمَّ نُخۡرِجُكُمۡ طِفۡلٗا ثُمَّ لِتَبۡلُغُوٓاْ أَشُدَّكُمۡۖ وَمِنكُم مَّن يُتَوَفَّىٰ وَمِنكُم مَّن يُرَدُّ إِلَىٰٓ أَرۡذَلِ ٱلۡعُمُرِ لِكَيۡلَا يَعۡلَمَ مِنۢ بَعۡدِ عِلۡمٖ شَيۡـٔٗاۚ وَتَرَى ٱلۡأَرۡضَ هَامِدَةٗ فَإِذَآ أَنزَلۡنَا عَلَيۡهَا ٱلۡمَآءَ ٱهۡتَزَّتۡ وَرَبَتۡ وَأَنۢبَتَتۡ مِن كُلِّ زَوۡجِۭ بَهِيجٖ","category":["22 (Al-Hajj)","Al-Hajj","Surah Al-Hajj","Chapter Al-Hajj","Hajj","Surah Hajj","Chapter Hajj","Al Hajj","Surah Al Hajj","Chapter Al Hajj","Surah 22","Chapter 22","The Pilgrimage","الحَجّ"],"ayahNumber":2600,"juzNumber":17,"footnotes":"(1) یعنی نطفے (قطرہ منی) سے چالیس روز بعد عَلَقَۃ گاڑھا خون اور عَلَقَۃ سے مُضْغَۃ گوشت کا لوتھڑا بن جاتا ہے مُخَلَّقَۃ سے، وہ بچہ مراد ہے جس کی پیدائش واضح اور شکل و صورت نمایاں ہو جائے، ایسے بچے میں روح پھونک دی جاتی ہے اور تکمیل کے بعد اس کی ولادت ہوجاتی ہے اور غیر مخلقۃ، اس کے برعکس، جس کی شکل و صورت واضح نہ ہو، نہ اس میں روح پھونکی جائے اور قبل از وقت ہی وہ ساقط ہو جائے۔ صحیح حدیث میں بھی رحم مادر کی ان کیفیات کا ذکر کیا گیا ہے۔ مثلا ایک حدیث میں ہے کہ نطفہ چالیس دن کے بعد علقۃ (گاڑھا خون) بن جاتا ہے پھر چالیس دن کے بعد یہ مضغۃ(لوتھرڑا یا گوشت کی بوٹی) کی شکل اختیار کر لیتا ہے پھر اللہ تعالٰی کی طرف سے ایک فرشتہ آتا ہے جو اس میں روح پھونکتا ہے یعنی چار مہینے کے بعد نفخ روح ہوتا ہے اور بچہ ایک واضح شکل میں ڈھل جاتا ہے (صحيح بخاري كتاب الأنبياء وكتاب القدر، مسلم كتاب القدر ، باب كيفية الخلق الآدميٍ)\n(2) یعنی اس طرح ہم اپنا کمال قدرت و تخلیق تمہارے لئے بیان کرتے ہیں۔\n(3) یعنی جس کو ساقط کرنا نہیں ہوتا۔\n(4) یعنی عمر اشد سے پہلے ہی۔ عمر اشد سے مراد بلوغت یا کمال عقل و کمال قوت و تمیز کی عمر، جو 30 سے 40 سال کے درمیان عمر ہے۔\n(5) اس سے مراد بڑھاپے میں قوائے انسانی میں ضعف و کمزوری کے ساتھ عقل و حافظہ کا کمزور ہو جانا اور یاداشت اور عقل و فہم میں بچے کی طرح ہو جانا، جسے سورہ یٰسین میں «وَمَنْ نُّعَمِّرْهُ نُنَكِّسْهُ فِي الْخَلْقِ»(یس:68) اور سورہ تین میں «ثُمَّ رَدَدْنٰهُ اَسْفَلَ سٰفِلِيْنَ»(التین:5) سے تعبیر کیا گیا ہے۔\n(6) یہ احیائے موتی (مردوں کے زندہ کرنے) پر اللہ تعالٰی کے قادر ہونے کی دوسری دلیل ہے۔ پہلی دلیل، جو مذکورہ ہوئی، یہ تھی کہ جو ذات ایک حقیر قطرہ پانی سے اس طرح ایک انسانی پیکر تراش سکتا ہے اور ایک حسین وجود عطا کر سکتا ہے، علاوہ ازیں وہ اسے مختلف مراحل سے گزارتا ہوا بڑھاپے کے ایسے اسٹیج پر پہنچا سکتا ہے جہاں اس کے جسم سے لے کر اس کی ذہنی و دماغی صلاحیتیں تک، سب ضعف و انحطاط کا شکار ہوجائیں۔ کیا اس کے لئے اسے دوبارہ زندگی عطا کر دینا مشکل ہے؟ یقینا جو ذات انسان کو ان مراحل سے گزار سکتی ہے، وہی ذات مرنے کے بعد دوبارہ زندہ کرکے ایک نیا قالب اور نیا وجود بخش سکتی ہے دوسری دلیل یہ دی ہے کہ دیکھو زمین بنجر اور مردہ ہوتی ہے لیکن اسے بارش کے بعد یہ کس طرح زندہ اور شاداب اور انواع و اقسام کے غلے، میوہ جات اور رنگ برنگ کے پھولوں سے مالا مال ہو جاتی ہے۔ اسی طرح اللہ تعالٰی قیامت والے دن انسانوں کو بھی ان کی قبروں سے اٹھا کر کھڑا کرے گا۔ جس طرح حدیث میں ہے ایک صحابی(رضي الله عنه) نے پوچھا کہ اللہ تعالٰی انسانوں کو جس طرح پیدا فرمائے گا اس کی کوئی نشانی مخلوقات میں سے بیان فرمائیے نبی (صلى الله عليه وسلم) نے فرمایا کیا تمہارا گزر ایسی وادی سے ہوا ہے جو خشک اور بنجر ہو پھر دوبارہ اسے لہلہاتا ہوا دیکھا ہو؟ اس نے کہا ہاں آپ (صلى الله عليه وسلم) نے فرمایا بس اسی طرح انسانوں کی جی اٹھنا ہوگا۔(مسند احمد جلد 4، ص11 ابن ماجہ المقدمہ، حدیث نمبر 180)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāayyuhā al-nāsu in kuntum fī raybin mina al-baʿthi fa-innā khalaqnākum min turābin thumma min nuṭ'fatin thumma min ʿalaqatin thumma min muḍ'ghatin mukhallaqatin waghayri mukhallaqatin linubayyina lakum wanuqirru fī al-arḥāmi mā nashāu ilā ajalin musamman thumma nukh'rijukum ṭif'lan thumma litablughū ashuddakum waminkum man yutawaffā waminkum man yuraddu ilā ardhali al-ʿumuri likaylā yaʿlama min baʿdi ʿil'min shayan watarā al-arḍa hāmidatan fa-idhā anzalnā ʿalayhā al-māa ih'tazzat warabat wa-anbatat min kulli zawjin bahījin ","translations":["O mankind","O mankind","If","you are","in","doubt","about","the Resurrection","then indeed, We","We created you","from","dust","then","from","a semen-drop","then","from","a clinging substance","then","from","an embryonic lump","formed","and unformed","and unformed","that We may make clear","to you","And We cause to remain","in","the wombs","what","We will","for","a term","appointed","then","We bring you out","(as) a child","[then]","that you may reach","[your] maturity","And among you","(is he) who","dies","and among you","(is he) who","is returned","to","the most abject","age","so that not","he knows","after","after","having known","anything","And you see","the earth","barren","then when","We send down","on it","water","it gets stirred","and it swells","and grows","of","every","kind","beautiful","(5)"],"transliterationArr":["yāayyuhā","al-nāsu","in","kuntum","fī","raybin","mina","al-baʿthi","fa-innā","khalaqnākum","min","turābin","thumma","min","nuṭ'fatin","thumma","min","ʿalaqatin","thumma","min","muḍ'ghatin","mukhallaqatin","waghayri","mukhallaqatin","linubayyina","lakum","wanuqirru","fī","al-arḥāmi","mā","nashāu","ilā","ajalin","musamman","thumma","nukh'rijukum","ṭif'lan","thumma","litablughū","ashuddakum","waminkum","man","yutawaffā","waminkum","man","yuraddu","ilā","ardhali","al-ʿumuri","likaylā","yaʿlama","min","baʿdi","ʿil'min","shayan","watarā","al-arḍa","hāmidatan","fa-idhā","anzalnā","ʿalayhā","al-māa","ih'tazzat","warabat","wa-anbatat","min","kulli","zawjin","bahījin",null],"verseTiming":[[1,0,2870],[2,2870,4350],[3,4350,5320],[4,5320,6800],[5,6800,7210],[6,7210,7940],[7,7940,8830],[8,8830,9730],[9,9730,11170],[10,11170,12660],[11,12660,14280],[12,14280,16600],[13,16600,18700],[14,18700,20340],[15,20340,21790],[16,21790,22790],[17,22790,24470],[18,24470,24750],[19,24750,26590],[20,26590,28110],[21,28110,28440],[22,28440,29730],[23,29730,31380],[24,31380,31590],[25,31590,33510],[26,33510,34630],[27,34630,34860],[28,34860,36360],[29,36360,39070],[30,39070,39830],[31,39830,41230],[32,41230,42620],[33,42620,43770],[34,43770,44920],[35,44920,45200],[36,45200,46500],[37,46500,46910],[38,46910,49080],[39,49080,50770],[40,50770,51440],[41,51440,54500],[42,54500,55530],[43,55530,56810],[44,56810,58290],[45,58290,59730],[46,59730,60990],[47,60990,62280],[48,62280,63500],[49,63500,65900],[50,65900,67700],[51,67700,69240],[52,69240,70350],[53,70350,71140],[54,71140,72330],[55,72330,74250],[56,74250,74800],[57,74800,76200],[58,76200,77960],[59,77960,78790],[60,78790,79610],[61,79610,80470],[62,80470,81970],[63,81970,83050],[64,83050,83960],[65,83960,85070],[66,85070,85700],[67,85700,87040],[68,87040,88590],[69,88590,89230],[70,89230,90150],[71,90150,91990],[72,91990,94250],[73,94250,96260],[74,96260,97050],[75,97050,99060],[76,99060,100220],[77,100220,101020],[78,101020,102920],[79,102920,104620],[80,104620,105480],[81,105480,107450],[82,107450,108420],[83,108420,109000],[84,109000,110510],[85,110510,113055]]}}