{"name":"22:67","price":"ہر امت کے لئے ہم نے عبادت کا ایک طریقہ مقرر کر دیا ہے، جسے وه بجا ﻻنے والے(1) ہیں پس انہیں اس امر میں آپ سے جھگڑا نہ کرنا چاہئے(2) آپ اپنے پروردگار کی طرف لوگوں کو بلائیے۔ یقیناً آپ ٹھیک ہدایت پر ہی ہیں.(3)","arabic":"لِّكُلِّ أُمَّةٖ جَعَلۡنَا مَنسَكًا هُمۡ نَاسِكُوهُۖ فَلَا يُنَٰزِعُنَّكَ فِي ٱلۡأَمۡرِۚ وَٱدۡعُ إِلَىٰ رَبِّكَۖ إِنَّكَ لَعَلَىٰ هُدٗى مُّسۡتَقِيمٖ","category":["22 (Al-Hajj)","Al-Hajj","Surah Al-Hajj","Chapter Al-Hajj","Hajj","Surah Hajj","Chapter Hajj","Al Hajj","Surah Al Hajj","Chapter Al Hajj","Surah 22","Chapter 22","The Pilgrimage","الحَجّ"],"ayahNumber":2662,"juzNumber":17,"footnotes":"(1) یعنی ہر زمانے میں ہم نے لوگوں کے لئے ایک شریعت مقرر کی، جو بعض چیزوں میں سے ایک دوسرے سے مختلف بھی ہوتی، جس طرح تورات، امت موسیٰ (عليه السلام) کے لئے، انجیل امت عیسیٰ (عليه السلام) کے لئے شریعت تھی اور اب قرآن امت محمدیہ کے لئے شریعت اور ضابطہ حیات ہے۔\n(2) یعنی اللہ نے آپ کو جو دین اور شریعت عطا کی ہے، یہ بھی مذکورہ اصول کے مطابق ہی ہے، ان سابقہ شریعت والوں کو چاہیے کہ اب آپ (صلى الله عليه وسلم) کی شریعت پر ایمان لے آئیں، نہ کہ اس معاملے میں آپ (صلى الله عليه وسلم) سے جھگڑیں۔\n(3) یعنی آپ (صلى الله عليه وسلم) ان کے جھگڑے کی پرواہ نہ کریں، بلکہ ان کو اپنے رب کی طرف دعوت دیتے رہیں، کیونکہ اب صراط مستقیم پر صرف آپ ہی گامزن ہیں، یعنی پچھلی شریعتیں منسوخ ہوگئی ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"likulli ummatin jaʿalnā mansakan hum nāsikūhu falā yunāziʿunnaka fī al-amri wa-ud'ʿu ilā rabbika innaka laʿalā hudan mus'taqīmin ","translations":["For every","nation","We have made","rite(s)","they","perform it","So let them not dispute with you","So let them not dispute with you","in","the matter","but invite (them)","to","your Lord","Indeed, you","(are) surely on","guidance","straight","(67)"],"transliterationArr":["likulli","ummatin","jaʿalnā","mansakan","hum","nāsikūhu","falā","yunāziʿunnaka","fī","al-amri","wa-ud'ʿu","ilā","rabbika","innaka","laʿalā","hudan","mus'taqīmin",null],"verseTiming":[[1,0,960],[2,960,3130],[3,3130,4200],[4,4200,5860],[5,5860,6330],[6,6330,9200],[7,9200,9860],[8,9860,12460],[9,12460,12700],[10,12700,13310],[11,13310,14510],[12,14510,15110],[13,15110,16030],[14,16030,17460],[15,17460,18270],[16,18270,18780],[17,18780,22415]]}}