{"name":"22:60","price":"بات یہی ہے(1) ، اور جس نے بدلہ لیا اسی کے برابر جو اس کے ساتھ کیا گیا تھا پھر اگر اس سے زیادتی کی جائے تو یقیناً اللہ تعالیٰ خود اس کی مدد فرمائے گا(2)۔ بیشک اللہ درگزر کرنے واﻻ بخشنے واﻻ ہے.(3)","arabic":"۞ ذَٰلِكَۖ وَمَنۡ عَاقَبَ بِمِثۡلِ مَا عُوقِبَ بِهِۦ ثُمَّ بُغِيَ عَلَيۡهِ لَيَنصُرَنَّهُ ٱللَّهُۚ إِنَّ ٱللَّهَ لَعَفُوٌّ غَفُورٞ","category":["22 (Al-Hajj)","Al-Hajj","Surah Al-Hajj","Chapter Al-Hajj","Hajj","Surah Hajj","Chapter Hajj","Al Hajj","Surah Al Hajj","Chapter Al Hajj","Surah 22","Chapter 22","The Pilgrimage","الحَجّ"],"ayahNumber":2655,"juzNumber":17,"footnotes":"(1) یعنی یہ کہ مہاجرین بطور خاص شہادت یا طبعی موت پر ہم نے جو وعدہ کیا ہے، وہ ضرور پورا ہوگا۔\n(2) عقوبت اس سزا یا بدلے کو کہتے ہیں جو کسی فعل کی جزا ہو۔ مطلب یہ کہ کسی نے اگر کسی کے ساتھ کوئی زیادتی کی ہے تو جس سے زیادتی کی گئی ہے، اسے بقدر زیادتی بدلہ لینے کا حق ہے۔ لیکن اگر بدلہ لینے کے بعد، جب کہ ظالم اور مظلوم دونوں برابر سربرا ہو چکے ہوں، ظالم، مظلوم پھر زیادتی کرے تو اللہ تعالٰی اس مظلوم کی ضرور مدد فرماتا ہے۔ یعنی یہ شبہ نہ ہو کہ مظلوم نے معاف کر دینے کی بجائے بدلہ لے کر غلط کام کیا ہے، نہیں، بلکہ اس کی بھی اجازت اللہ ہی نے دی ہے، اس لئے آئندہ بھی اللہ کی مدد کا مستحق رہے گا۔\n(3) اس میں پھر معاف کر دینے کی ترغیب دی گئی ہے کہ اللہ درگزر کرنے والا ہے۔ تم بھی درگزر سے کام لو۔ ایک دوسرے معنی یہ بھی ہو سکتے ہیں کہ بدلہ لینے میں۔ جو بقدر ظلم ظالم ہوگا۔ جتنا ظلم کیا جائے گا، اس کی اجازت چونکہ اللہ کی طرف سے ہے، اس لئے اس پر مؤاخذہ نہیں ہوگا، بلکہ وہ معاف ہے۔ بلکہ اسے ظلم اور سیئہ بطور مشاکلت کے کہا جاتا ہے، ورنہ انتقام یا بدلہ سرے سے ظلم یا سیئہ ہی نہیں ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"dhālika waman ʿāqaba bimith'li mā ʿūqiba bihi thumma bughiya ʿalayhi layanṣurannahu al-lahu inna al-laha laʿafuwwun ghafūrun ","translations":["That","and whoever","has retaliated","with the like","(of) that","he was made to suffer","by it","then","he was oppressed","[on him]","Allah will surely help him","Allah will surely help him","Indeed","Allah","(is) surely Oft-Pardoning","Oft-Forgiving","(60)"],"transliterationArr":["dhālika","waman","ʿāqaba","bimith'li","mā","ʿūqiba","bihi","thumma","bughiya","ʿalayhi","layanṣurannahu","al-lahu","inna","al-laha","laʿafuwwun","ghafūrun",null],"verseTiming":[[1,0,1550],[2,1550,2120],[3,2120,3200],[4,3200,4020],[5,4020,4490],[6,4490,5410],[7,5410,6100],[8,6100,7220],[9,7220,7970],[10,7970,8950],[11,8950,11950],[12,11950,15010],[13,15010,16250],[14,16250,17210],[15,17210,18440],[16,18440,21345]]}}