{"name":"22:75","price":"فرشتوں میں سے اور انسانوں میں سے پیغام پہونچانے والوں کو اللہ ہی چھانٹ لیتا ہے،(1) بیشک اللہ تعالیٰ سننے واﻻ دیکھنے واﻻ ہے.(2)","arabic":"ٱللَّهُ يَصۡطَفِي مِنَ ٱلۡمَلَٰٓئِكَةِ رُسُلٗا وَمِنَ ٱلنَّاسِۚ إِنَّ ٱللَّهَ سَمِيعُۢ بَصِيرٞ","category":["22 (Al-Hajj)","Al-Hajj","Surah Al-Hajj","Chapter Al-Hajj","Hajj","Surah Hajj","Chapter Hajj","Al Hajj","Surah Al Hajj","Chapter Al Hajj","Surah 22","Chapter 22","The Pilgrimage","الحَجّ"],"ayahNumber":2670,"juzNumber":17,"footnotes":"(1) رَسُلٌ رَسُولٌ (فرستادہ، بھیجا ہوا قاصد) کی جمع ہے۔ اللہ تعالٰی نے فرشتوں سے بھی رسالت کا یعنی پیغام رسانی کا کام لیا ہے، جیسے حضرت جبرائیل (عليه السلام) کو اپنی وحی کے لئے منتخب کیا کہ وہ رسولوں کے پاس وحی پہنچائیں۔ یا عذاب لے کر قوموں کے پاس جائیں اور لوگوں میں سے بھی، جنہیں چاہا، رسالت کے لئے چن لیا اور انہیں لوگوں کی ہدایت و راہنمائی پر مامور فرمایا۔ یہ سب اللہ کے بندے تھے، گو منتخب اور چنیدہ تھے لیکن کسی کے لئے؟ خدائی اختیارات میں شرکت کے لئے؟ جس طرح کے بعض لوگوں نے انہیں اللہ کا شریک گردان لیا۔ نہیں، بلکہ صرف اللہ کا پیغام پہنچانے کے لئے۔\n(2) وہ بندوں کے اقوال سننے والا ہے اور بصیر ہے۔ یعنی یہ جانتا ہے کہ رسالت کا مستحق کون ہے؟ جیسے دوسرے مقام پر فرمایا «اَللّٰهُ اَعْلَمُ حَيْثُ يَجْعَلُ رِسَالَتَه» (الانعام:124) ”اس موقع کو اللہ ہی خوب جانتا ہے کہ کہاں وہ اپنی پیغمبری رکھے“۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"al-lahu yaṣṭafī mina al-malāikati rusulan wamina al-nāsi inna al-laha samīʿun baṣīrun ","translations":["Allah","chooses","from","the Angels","Messengers","and from","the mankind","Indeed","Allah","(is) All-Hearer","All-Seer","(75)"],"transliterationArr":["al-lahu","yaṣṭafī","mina","al-malāikati","rusulan","wamina","al-nāsi","inna","al-laha","samīʿun","baṣīrun",null],"verseTiming":[[1,0,1150],[2,1150,2300],[3,2300,2670],[4,2670,5690],[5,5690,6400],[6,6400,7760],[7,7760,11270],[8,11270,12580],[9,12580,13490],[10,13490,15310],[11,15310,18265]]}}