{"name":"23:111","price":"میں نے آج انہیں ان کے اس صبر کا بدلہ دے دیا ہے کہ وه خاطر خواه اپنی مراد کو پہنچ چکے ہیں.(1)","arabic":"إِنِّي جَزَيۡتُهُمُ ٱلۡيَوۡمَ بِمَا صَبَرُوٓاْ أَنَّهُمۡ هُمُ ٱلۡفَآئِزُونَ","category":["23 (Al-Mu'minun)","Al-Mu'minun","Surah Al-Mu'minun","Chapter Al-Mu'minun","Mu'minun","Surah Mu'minun","Chapter Mu'minun","Al Mu'minun","Surah Al Mu'minun","Chapter Al Mu'minun","Surah 23","Chapter 23","The Believers","المُؤمِنُون"],"ayahNumber":2784,"juzNumber":18,"footnotes":"(1) دنیا میں اہل ایمان کے لئے ایک صبر آزما مرحلہ یہ بھی ہوتا ہے کہ جب دین و ایمان پر عمل کرتے ہیں تو دین سے ناآشنا اور ایمان سے بےخبر لوگ انہیں ہنسی مذاق و ملامت کا نشانہ بنا لیتے ہیں۔ کتنے ہی کمزور ایمان والے ہیں کہ وہ ان ملامتوں سے ڈر کر بہت سے احکام اللہ پر عمل کرنے سے کرتے ہیں، جیسے ڈاڑھی ہے، پردے کا مسئلہ ہے، شادی بیاہ کی ہندوانہ رسومات سے اجتناب ہے وغیرہ وغیرہ۔ خوش قسمت ہیں وہ لوگ جو کسی بھی ملامت کی پروا نہیں کرتے اور اللہ و رسول کی اطاعت سے کسی بھی موقع پر انحراف نہیں کرتے، «وَلا يَخَافُونَ لَوْمَةَ لائِمٍ» اللہ تعالٰی قیامت والے دن انہیں اس کی بہترین جزا عطا فرمائے گا اور انہیں کامیابی سے سرفراز کرے گا۔ جیسا کہ اس آیت سے واضح ہے۔ اللَّهُمَّ اجْعَلْنَا مِنْهُمْ ۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"innī jazaytuhumu al-yawma bimā ṣabarū annahum humu al-fāizūna ","translations":["Indeed, I","have rewarded them","this Day","because","they were patient","indeed, they","[they]","(are) the successful ones","(111)"],"transliterationArr":["innī","jazaytuhumu","al-yawma","bimā","ṣabarū","annahum","humu","al-fāizūna",null],"verseTiming":[[1,0,1600],[2,1600,2830],[3,2830,3580],[4,3580,4130],[5,4130,6320],[6,6320,8180],[7,8180,8540],[8,8540,13155]]}}