{"name":"23:100","price":"کہ اپنی چھوڑی ہوئی دنیا میں جا کر نیک اعمال کر لوں(1) ، ہرگز ایسا نہیں ہوگا(2)، یہ تو صرف ایک قول ہے جس کا یہ قائل(3) ہے، ان کے پس پشت تو ایک حجاب ہے، ان کے دوباره جی اٹھنے کے دن تک.(4)","arabic":"لَعَلِّيٓ أَعۡمَلُ صَٰلِحٗا فِيمَا تَرَكۡتُۚ كَلَّآۚ إِنَّهَا كَلِمَةٌ هُوَ قَآئِلُهَاۖ وَمِن وَرَآئِهِم بَرۡزَخٌ إِلَىٰ يَوۡمِ يُبۡعَثُونَ","category":["23 (Al-Mu'minun)","Al-Mu'minun","Surah Al-Mu'minun","Chapter Al-Mu'minun","Mu'minun","Surah Mu'minun","Chapter Mu'minun","Al Mu'minun","Surah Al Mu'minun","Chapter Al Mu'minun","Surah 23","Chapter 23","The Believers","المُؤمِنُون"],"ayahNumber":2773,"juzNumber":18,"footnotes":"(1) یہ آرزو، ہر کافر موت کے وقت، دوبارہ اٹھائے جانے کے وقت، بارگاہ الٰہی میں قیامت کے وقت اور جہنم میں دھکیل دیئے جانے کے وقت کرتا ہے اور کرے گا، لیکن اس کا کوئی فائدہ نہیں ہوگا۔ قرآن کریم میں اس مضمون کو متعدد، جگہ بیان کیا گیا ہے۔ مثلاً سورۂ منافقون:10-11، ابراھیم:44، اعراف: 53، السجدة: 12۔ الانعام: 27-28۔ الشوریٰ: 24۔ المؤمن: 11- 12۔ فاطر: 37 وغیرها من الآیات۔\n(2) کَلَّا، ڈانٹ ڈپٹ کے لئے ہے یعنی ایسا کبھی نہیں ہو سکتا کہ انہیں دوبارہ دنیا میں بھیج دیا جائے۔\n(3) اس کے ایک معنی تو یہ ہیں کہ ایسی بات ہے کہ جو ہر کافر نزع (جان کنی) کے وقت کہتا ہے۔ دوسرے معنی ہیں کہ یہ صرف بات ہی بات ہے عمل نہیں، اگر انہیں دوبارہ بھی دنیا میں بھیج دیا جائے تو ان کا یہ قول، قول ہی رہے گا عمل اصلاح کی توفیق انہیں پھر نصیب نہیں ہوگی،جیسے دوسرے مقام پر فرمایا: «وَلَوْ رُدُّوا لَعَادُوا لِمَا نُهُوا عَنْهُ» (الأنعام ،28) ”اگر انہیں دنیا میں لوٹا دیا جائے تو یہ پھر وہی کام کریں گے جن سے انہیں منع کیا گیا تھا“۔ کافر دنیا میں اپنے خاندان اور قبیلے کے پاس جانے کی آرزو نہیں کرے گا، بلکہ عمل صالح کے لئے دنیا میں آنے کی آرزو کرے گا۔ اس لئے زندگی کے لمحات کو غنیمت جانتے ہوئے زیادہ سے زیادہ عمل صلاح کر لئے جائیں تاکہ کل قیامت کو یہ آرزو کرنے کی ضرورت پیش نہ آئے (ابن کثیر)\n(4) دو چیزوں کے درمیان حجاب اور آڑ کو برزخ کہا جاتا ہے۔ دنیا کی زندگی اور آخرت کی زندگی کے درمیان جو وقفہ ہے، اسے یہاں برزخ سے تعبیر کیا گیا ہے۔ کیونکہ مرنے کے بعد انسان کا تعلق دنیا کی زندگی سے ختم ہو جاتا ہے اور آخرت کی زندگی کا آغاز اس وقت ہوگا جب تمام انسانوں کو دوبارہ زندہ کیا جائے گا۔ یہ درمیان کی زندگی ہے۔ انسان کا وجود جہاں بھی اور جس شکل میں بھی ہوگا، بظاہر وہ مٹی میں مل کر مٹی بن چکا ہوگا، یا راکھ بنا کر ہواؤں میں اڑا دیا یا دریاؤں میں بہا دیا ہوگا یا کسی جانور کی خوراک بن گیا ہوگا، مگر اللہ تعالٰی سب کو ایک نیا وجود عطا فرما کر میدان محشر میں جمع فرمائے گا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"laʿallī aʿmalu ṣāliḥan fīmā taraktu kallā innahā kalimatun huwa qāiluhā wamin warāihim barzakhun ilā yawmi yub'ʿathūna ","translations":["That I may","do","righteous (deeds)","in what","I left behind","No","Indeed, it","(is) a word","he","speaks it","and before them","and before them","(is) a barrier","till","(the) Day","they are resurrected","(100)"],"transliterationArr":["laʿallī","aʿmalu","ṣāliḥan","fīmā","taraktu","kallā","innahā","kalimatun","huwa","qāiluhā","wamin","warāihim","barzakhun","ilā","yawmi","yub'ʿathūna",null],"verseTiming":[[1,0,2230],[2,2230,3010],[3,3010,4650],[4,4650,5520],[5,5520,6850],[6,6850,7750],[7,7750,9660],[8,9660,10760],[9,10760,11200],[10,11200,14350],[11,14350,15500],[12,15500,19500],[13,19500,20530],[14,20530,21100],[15,21100,21720],[16,21720,25155]]}}