{"name":"23:14","price":"پھر نطفہ کو ہم نے جما ہوا خون بنا دیا، پھر اس خون کے لوتھڑے کو گوشت کا ٹکڑا کردیا۔ پھر گوشت کے ٹکڑے کو ہڈیاں بنا دیں، پھر ہڈیوں کو ہم نے گوشت پہنا دیا(1) ، پھر دوسری بناوٹ میں اس کو پیدا کردیا(2)۔ برکتوں واﻻ ہے وه اللہ جو سب سے بہترین پیدا کرنے واﻻ ہے.(3)","arabic":"ثُمَّ خَلَقۡنَا ٱلنُّطۡفَةَ عَلَقَةٗ فَخَلَقۡنَا ٱلۡعَلَقَةَ مُضۡغَةٗ فَخَلَقۡنَا ٱلۡمُضۡغَةَ عِظَٰمٗا فَكَسَوۡنَا ٱلۡعِظَٰمَ لَحۡمٗا ثُمَّ أَنشَأۡنَٰهُ خَلۡقًا ءَاخَرَۚ فَتَبَارَكَ ٱللَّهُ أَحۡسَنُ ٱلۡخَٰلِقِينَ","category":["23 (Al-Mu'minun)","Al-Mu'minun","Surah Al-Mu'minun","Chapter Al-Mu'minun","Mu'minun","Surah Mu'minun","Chapter Mu'minun","Al Mu'minun","Surah Al Mu'minun","Chapter Al Mu'minun","Surah 23","Chapter 23","The Believers","المُؤمِنُون"],"ayahNumber":2687,"juzNumber":18,"footnotes":"(1) اس کی کچھ تفصیل سورہ حج میں گزر چکی ہے۔ یہاں پھر اسے بیان کیا گیا ہے۔ تاہم وہاں مُخلَّقَۃ کا جو ذکر تھا، یہاں اس کی وضاحت، مُضْغَۃ کو ہڈیوں میں تبدیل کرنے اور ہڈیوں کو گوشت پہنانے، سے کر دی ہے۔ مُضْغَۃ گوشت کو ہڈیوں سے تبدیل کرنے کا مقصد، انسانی ڈھانچے کو مضبوط بنیادوں پر کھڑا کرنا ہے کیونکہ محض گوشت میں تو کوئی سختی نہیں ہوتی، پھر اگر اسے ہڈیوں کا ڈھانچہ ہی رکھا جاتا، تو انسان میں وہ حس و رعنائی نہ آتی، جو ہر انسان کے اندر موجود ہے۔ اس لئے ہڈیوں پر ایک خاص تناسب اور مقدار سے گوشت چڑھا دیا گیا کہیں کم اور کہیں زیادہ۔ تاکہ قدو قامت میں غیر موزونیت اور بھدا پن پیدا نہ ہو۔ بلکہ حسن و جمال کا ایک پیکر اور قدرت کی تخلیق کا ایک شاہ کار ہو۔ اسی چیز کو قرآن نے ایک دوسرے مقام پر اس طرح بیان فرمایا «لَقَدْ خَلَقْنَا الْاِنْسَانَ فِيْٓ اَحْسَنِ تَقْوِيْمٍ» (التین:4) ”ہم نے انسان کو احسن تقویم یعنی بہت اچھی ترکیب یا بہت اچھے ڈھانچے میں بنایا“۔\n(2) اس سے مراد وہ بچہ ہے جو نو مہینے کے بعد ایک خاص شکل و صورت لے کر ماں کے پیٹ سے باہر آتا ہے اور حرکت و اضطراب کے ساتھ دیکھنے اور سننے اور ذہنی قوتیں بھی ساتھ ہوتی ہیں۔\n(3) خَالِقِیْنَ یہاں ان صالحین کے معنی میں ہے۔ جو خاص خاص مقداروں میں اشیا کو جوڑ کر کوئی ایک چیز تیار کرتے ہیں۔ یعنی ان تمام صنعت گروں میں، اللہ جیسا بھی کوئی صنعت گر ہے جو اس طرح کی صنعت کاری کا نمونہ پیش کر سکے جو اللہ تعالٰی نے انسانی پیکر کی صورت میں پیش کیا ہے۔ پس سب سے زیادہ خیر و برکت والا وہ اللہ ہی ہے، جو تمام صنعت کاروں سے بڑا اور سب سے اچھا صنعت کار ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"thumma khalaqnā al-nuṭ'fata ʿalaqatan fakhalaqnā al-ʿalaqata muḍ'ghatan fakhalaqnā al-muḍ'ghata ʿiẓāman fakasawnā al-ʿiẓāma laḥman thumma anshanāhu khalqan ākhara fatabāraka al-lahu aḥsanu al-khāliqīna ","translations":["Then","We created","the semen-drop","(into) a clinging substance","then We created","the clinging substance","(into) an embryonic lump","then We created","the embryonic lump","(into) bones","then We clothed","the bones","(with) flesh","then","We produce it","(as) a creation","another","So blessed is","Allah","(the) Best","(of) the Creators","(14)"],"transliterationArr":["thumma","khalaqnā","al-nuṭ'fata","ʿalaqatan","fakhalaqnā","al-ʿalaqata","muḍ'ghatan","fakhalaqnā","al-muḍ'ghata","ʿiẓāman","fakasawnā","al-ʿiẓāma","laḥman","thumma","anshanāhu","khalqan","ākhara","fatabāraka","al-lahu","aḥsanu","al-khāliqīna",null],"verseTiming":[[1,0,1720],[2,1720,2530],[3,2530,4060],[4,4060,5750],[5,5750,6830],[6,6830,7870],[7,7870,9470],[8,9470,10540],[9,10540,11700],[10,11700,13800],[11,13800,14800],[12,14800,15860],[13,15860,17710],[14,17710,18960],[15,18960,20100],[16,20100,21630],[17,21630,23050],[18,23050,25250],[19,25250,26150],[20,26150,27690],[21,27690,28930],[22,28930,29780],[23,29780,30610],[24,30610,34415]]}}