{"name":"23:51","price":"اے پیغمبرو! حلال چیزیں کھاؤ اور نیک عمل کرو(1) تم جو کچھ کر رہے ہو اس سے میں بخوبی واقف ہوں.","arabic":"يَٰٓأَيُّهَا ٱلرُّسُلُ كُلُواْ مِنَ ٱلطَّيِّبَٰتِ وَٱعۡمَلُواْ صَٰلِحًاۖ إِنِّي بِمَا تَعۡمَلُونَ عَلِيمٞ","category":["23 (Al-Mu'minun)","Al-Mu'minun","Surah Al-Mu'minun","Chapter Al-Mu'minun","Mu'minun","Surah Mu'minun","Chapter Mu'minun","Al Mu'minun","Surah Al Mu'minun","Chapter Al Mu'minun","Surah 23","Chapter 23","The Believers","المُؤمِنُون"],"ayahNumber":2724,"juzNumber":18,"footnotes":"(1) طَيِّبَاتٌ‌ سے مراد پاکیزہ اور لذت بخش چیزیں ہیں، بعض نے اس کا ترجمہ حلال چیزیں کیا ہے۔ دونوں ہی اپنی جگہ صحیح ہیں کیونکہ ہر پاکیزہ چیز اللہ نے حلال کر دی ہے اور ہر حلال چیز پاکیزہ اور لذت بخش ہے۔ خبائث کو اللہ نے اس لئے حرام کیا ہے کہ وہ اثرات و نتائج کے لحاظ سے پاکیزہ نہیں ہیں۔ گو خبائث خور قوموں کو اپنے ماحول اور عادت کی وجہ سے ان میں ایک گونہ لذت ہی محسوس ہوتی ہو۔ عمل صالح وہ ہے جو شریعت یعنی قرآن و حدیث کے موافق ہو، نہ کہ وہ جسے لوگ اچھا سمجھیں کیوں کہ لوگوں کو تو بدعات بھی بہت اچھی لگتی ہیں بلکہ اہل بدعت کے ہاں جتنا اہتمام بدعات کا ہے، اتنا فرائض اسلام اور سنن و مستحبات کا بھی نہیں ہے۔اکل حلال کے ساتھ عمل صالح کی تاکید سے معلوم ہوتا ہے کہ ان کا آپس میں گہرا تعلق ہے اور یہ ایک دوسر کے معاون ہیں۔ اکل حلال سے عمل صالح آسان اور عمل صالح انسان کو اکل حلال پر آمادہ اور اسی پر قناعت کرنے کا سبق دیتا ہے۔ اسی لئے اللہ نے تمام پیغمبروں کو ان دونوں باتوں کا حکم دیا۔ چنانچہ تمام پیغمبر محنت کر کے حلال روزی کمانے اور کھانے کا اہتمام کرتے رہے، جس طرح حضرت داؤد (عليه السلام) کے بارے میں آتا ہے«كَانَ يَأْكُلُ مِنْ كَسْبِ يَدِهِ» (صحیح بخاری، کتاب البیوع باب کسب الرجل وعمله بیده) ”کہ وہ اپنے ہاتھ کی کمائی سے کھاتے تھے“ اور نبی (صلى الله عليه وسلم) نے فرمایا \" ہر نبی نے بکریاں چرائی ہیں، میں بھی اہل مکہ کی بکریاں چند سکوں کے عوض چراتا رہا ہوں\"۔(صحیح بخاری، کتاب الاجارة، باب رعی الغنم علی قراریط) آج کل بلیک میلروں، سمگلروں، رشوت و سود خوروں اور دیگر حرام خوروں نے محنت کرکے حلال روزی کھانے والوں کو حقیر اور پست طبقہ بنا کر رکھ دیا ہے دراں حالیکہ معاملہ اس کے برعکس ہے۔ ایک اسلامی معاشرے میں حرام خورعوں کے لئے عزت و شرف کا کوئی مقام نہیں، چاہے وہ قارون کے خزانوں کے مالک ہوں، احترام و تکریم کے مستحق صرف وہ لوگ ہیں جو محنت کرکے حلال کی روزی کھاتے ہیں چاہے روکھی سوکھی ہی ہو۔ اس لئے نبی (صلى الله عليه وسلم) نے اس کی بڑی تاکید فرمائی ہے اور فرمایا ہےکہ ”اللہ تعالیٰ حرام کمائی والے کا صدقہ قبول فرماتا ہے نہ اس کی دعا“۔ (صحیح مسلم، کتاب الزکوٰۃ باب قبول الصدقة من الکسب الطیب)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāayyuhā al-rusulu kulū mina al-ṭayibāti wa-iʿ'malū ṣāliḥan innī bimā taʿmalūna ʿalīmun ","translations":["O Messengers","O Messengers","Eat","of","the good things","and do","righteous (deeds)","Indeed, I Am","of what","you do","All-Knower","(51)"],"transliterationArr":["yāayyuhā","al-rusulu","kulū","mina","al-ṭayibāti","wa-iʿ'malū","ṣāliḥan","innī","bimā","taʿmalūna","ʿalīmun",null],"verseTiming":[[1,0,2870],[2,2870,3750],[3,3750,4310],[4,4310,4670],[5,4670,6220],[6,6220,7190],[7,7190,8460],[8,8460,10370],[9,10370,10960],[10,10960,12150],[11,12150,14885]]}}