{"name":"23:64","price":"یہاں تک کہ جب ہم نے ان کے آسوده حال لوگوں کو عذاب میں پکڑ لیا(1) تو وه بلبلانے لگے.","arabic":"حَتَّىٰٓ إِذَآ أَخَذۡنَا مُتۡرَفِيهِم بِٱلۡعَذَابِ إِذَا هُمۡ يَجۡـَٔرُونَ","category":["23 (Al-Mu'minun)","Al-Mu'minun","Surah Al-Mu'minun","Chapter Al-Mu'minun","Mu'minun","Surah Mu'minun","Chapter Mu'minun","Al Mu'minun","Surah Al Mu'minun","Chapter Al Mu'minun","Surah 23","Chapter 23","The Believers","المُؤمِنُون"],"ayahNumber":2737,"juzNumber":18,"footnotes":"(1) مترفین سے مراد آسودہ حال (متنعمین)ہیں۔ عذاب تو آسودہ اور غیر آسودہ حال دونوں کو ہی ہوتا ہے۔ لیکن آسودہ حال لوگوں کا نام خصوصی طور پر شاید اس لئے لیا گیا کہ قوم کی قیادت بالعموم انہی کے ہاتھوں میں ہوتی ہے، وہ جس طرف چاہیں قوم کا رخ پھیر سکتے ہیں۔ اگر وہ اللہ کی نافرمانی کا راستۃ اختیار کریں اور اس پر ڈٹے رہیں تو انہی کی دیکھا دیکھی قوم بھی ٹس سے مس نہیں ہوتی۔اور توبہ و ندامت کی طرف نہیں آتی۔ یہاں مترفین سے مراد وہ کفار ہیں، جنہیں مال و دولت کی فراوانی اور اولاد و احفاد سے نواز کر مہلت دی گئی۔ جس طرح کہ چند آیات قبل ان کا ذکر کیا گیا ہے۔ یا مراد چوہدری اور سردار قسم کے لوگ ہیں۔ اور عذاب سے مراد اگر دنیاوی ہے، تو جنگ بدر میں کفار مکہ مارے گئے بلکہ نبی (صلى الله عليه وسلم) کی بد دعا کے نتیجے میں بھوک اور قحط سالی کا عذاب مسلط ہوا، وہ مراد ہے یا پھر مراد آخرت کا عذاب ہے۔ مگر یہ سیاق سے بعید ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"ḥattā idhā akhadhnā mut'rafīhim bil-ʿadhābi idhā hum yajarūna ","translations":["Until","when","We seize","their affluent ones","with the punishment","behold","They","cry for help","(64)"],"transliterationArr":["ḥattā","idhā","akhadhnā","mut'rafīhim","bil-ʿadhābi","idhā","hum","yajarūna",null],"verseTiming":[[1,0,1959],[2,1959,4019],[3,4019,5089],[4,5089,7069],[5,7069,8309],[6,8309,8859],[7,8859,9289],[8,9289,12194]]}}