{"name":"23:76","price":"اور ہم نے انہیں عذاب میں بھی پکڑا تاہم یہ لوگ نہ تو اپنے پروردگار کے سامنے جھکے اور نہ ہی عاجزی اختیار کی.(1)","arabic":"وَلَقَدۡ أَخَذۡنَٰهُم بِٱلۡعَذَابِ فَمَا ٱسۡتَكَانُواْ لِرَبِّهِمۡ وَمَا يَتَضَرَّعُونَ","category":["23 (Al-Mu'minun)","Al-Mu'minun","Surah Al-Mu'minun","Chapter Al-Mu'minun","Mu'minun","Surah Mu'minun","Chapter Mu'minun","Al Mu'minun","Surah Al Mu'minun","Chapter Al Mu'minun","Surah 23","Chapter 23","The Believers","المُؤمِنُون"],"ayahNumber":2749,"juzNumber":18,"footnotes":"(1) عذاب سے مراد یہاں وہ شکست ہے جو جنگ بدر میں کفار مکہ کو ہوئی، جس میں ان کے ستر آدمی مارے گئے تھے یا وہ قحط سالی کا عذاب ہے جو نبی (صلى الله عليه وسلم) کی بد دعا کے نتیجے میں ان پر آیا تھا۔ آپ (صلى الله عليه وسلم) نے دعا فرمائی تھی «اللَّهُمَّ أَعِنِّي عَلَيْهِمْ بِسَبْعٍ كَسَبْعِ يُوسُفَ»، (البخاری، کتاب الدعوات، باب الدعاء، علی المشرکین، ومسلم، کتاب المساجد، باب استحباب القنوت فی جمیع الصلاة اذا نزلت بالمسلمین نازلة) ”اے اللہ، جس طرح حضرت یوسف کے زمانے میں سات سال قحط رہا، اسی طرح قحط سالی میں انہیں مبتلا کر کے ان کے مقابلے میں میری مدد فرما“ چنانچہ کفار مکہ اس قحط سالی میں مبتلا ہوگئے جس پر حضرت سفیان نبی (صلى الله عليه وسلم) کے پاس آئے اور انہیں اللہ کا اور رشتہ داری کا واسطہ دے کر کہا کہ اب تو ہم جانوروں کی کھالیں اور خون تک کھانے پر مجبور ہوگئے ہیں۔ جس پر آیت نازل ہوئی (ابن کثیر)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walaqad akhadhnāhum bil-ʿadhābi famā is'takānū lirabbihim wamā yataḍarraʿūna ","translations":["And verily","We seized them","with the punishment","but not","they submit","to their Lord","and not","they supplicate humbly","(76)"],"transliterationArr":["walaqad","akhadhnāhum","bil-ʿadhābi","famā","is'takānū","lirabbihim","wamā","yataḍarraʿūna",null],"verseTiming":[[1,0,930],[2,930,2990],[3,2990,4430],[4,4430,4730],[5,4730,6050],[6,6050,7310],[7,7310,7890],[8,7890,11285]]}}