{"name":"23:89","price":"یہی جواب دیں گے کہ اللہ ہی ہے، کہہ دیجیئے پھر تم کدھر سے جادو کر دیئے جاتے ہو؟(1)","arabic":"سَيَقُولُونَ لِلَّهِۚ قُلۡ فَأَنَّىٰ تُسۡحَرُونَ","category":["23 (Al-Mu'minun)","Al-Mu'minun","Surah Al-Mu'minun","Chapter Al-Mu'minun","Mu'minun","Surah Mu'minun","Chapter Mu'minun","Al Mu'minun","Surah Al Mu'minun","Chapter Al Mu'minun","Surah 23","Chapter 23","The Believers","المُؤمِنُون"],"ayahNumber":2762,"juzNumber":18,"footnotes":"(1) یعنی پھر تمہاری عقلوں کو کیا ہو گیا ہے کہ اس اعتراف اور علم کے باوجود تم دوسروں کو اس کی عبادت میں شریک کرتے ہو؟ قرآن کریم کی اس صراحت سے واضح ہے کہ مشرکین مکہ اللہ تعالٰی کی ربوبیت، اسکی خالقیت و مالکیت اور رزاقیت کے منکر نہیں تھے بلکہ وہ سب باتیں تسلیم کرتے تھے۔ انہیں صرف توحید الوہیت سے انکار تھا۔ یعنی عبادت صرف ایک اللہ کی نہیں کرتے تھے بلکہ اس میں دوسروں کو بھی شریک کرتے تھے اس لئے نہیں کہ آسمان و زمین کی تخلیق یا تدبیر میں کوئی اور بھی شریک ہے بلکہ صرف اس مغالطے کی بنا پر کہ یہ اللہ کے نیک بندے تھے ان کو اللہ نے اختیار دے رکھے ہیں اور ہم ان کے ذریعے سے اللہ کا قرب حاصل کرتے ہیں۔یہی مغالطہ آج کل کے مردہ پرست اہل بدعت کو ہے جس کی بنیاد پر وہ فوت شدگان کو مدد کے لئے پکارتے ، ان کے نام کی نذر نیاز دیتے اور ان کو اللہ کی عبادت میں شریک گردانتے ہیں۔ حالانکہ اللہ نے کہیں بھی یہ نہیں فرمایا کہ میں نے کسی فوت شدہ بزرگ، ولی یا نبی کو اختیارات دے رکھے ہیں، تم ان کے ذریعے سے میرا قرب حاصل کرو، یا انہیں مدد کے لئے پکارو، یا ن کے نام کی نذر نیاز دو۔اسی لئے اللہ نے آگے فرمایا کہ ہم نے انہیں حق پہنچادیا۔ یعنی یہ اچھی طرح واضح کردیا کہ اللہ کے سوا کوئی معبود نہیں، اور یہ اگر اللہ کی عبادت میں دوسروں کو شریک کررہے ہیں، تو اس لئے نہیں کہ ان کے پاس اس کی کوئی دلیل ہے، نہیں، بلکہ محض ایک دوسرے کی دیکھا دیکھی اور آباء پرستی کی وجہ سے اس شرک کا ارتکاب کررہے ہیں۔ورنہ حقیقت میں یہ بالکل جھوٹے ہیں۔ نہ اس کی کوئی اولاد ہے نہ اس کا کوئی شریک ، اگر ایسا ہوتا، تو ہر شریک اپنے حصے کی مخلوق کا انتظام اپنی مرضی سے کرتااور ہر ایک شریک دوسرے پر غالب آنے کی کوشش کرتا۔ اور جب ایسا نہیں ہے اور نظام کائنات میں ایسی کشاکشی نہیں ہے تو یقیناً اللہ تعالیٰ ان تمام باتوں سے پاک اور برتر ہے، جو مشریکین اس کی بابت باور کراتے ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"sayaqūlūna lillahi qul fa-annā tus'ḥarūna ","translations":["They will say","Allah","Say","Then how","are you deluded","(89)"],"transliterationArr":["sayaqūlūna","lillahi","qul","fa-annā","tus'ḥarūna",null],"verseTiming":[[1,0,1400],[2,1400,4260],[3,4260,4530],[4,4530,6180],[5,6180,9295]]}}