{"name":"24:16","price":"تم نے ایسی بات کو سنتے ہی کیوں نہ کہہ دیا کہ ہمیں ایسی بات منھ سے نکالنی بھی ﻻئق نہیں۔ یا اللہ! تو پاک ہے، یہ تو بہت بڑا بہتان ہے اور تہمت ہے.(1)","arabic":"وَلَوۡلَآ إِذۡ سَمِعۡتُمُوهُ قُلۡتُم مَّا يَكُونُ لَنَآ أَن نَّتَكَلَّمَ بِهَٰذَا سُبۡحَٰنَكَ هَٰذَا بُهۡتَٰنٌ عَظِيمٞ","category":["24 (An-Nur)","An-Nur","Surah An-Nur","Chapter An-Nur","Nur","Surah Nur","Chapter Nur","An Nur","Surah An Nur","Chapter An Nur","Surah 24","Chapter 24","The Light","النُّور"],"ayahNumber":2807,"juzNumber":18,"footnotes":"(1) دوسری بات اللہ تعالیٰ نے اہل ایمان کو یہ بتلائی کہ اس بہتان پر انہوں نے ایک گواہ بھی پیش نہیں کیا۔ جب کہ اس کے لئے چار گواہ ضروری تھے، اس کے باوجود تم نے ان بہتان تراشوں کو جھوٹا نہیں کہا۔ یہی وجہ ہے کہ ان آیات کے نزول کے بعد حضرت حسان، مسطح اور حمنہ بنت حجش (رضي الله عنهم) کو حد قذف لگائی گئی۔ (مسند أحمد جلد۔ 6 ، ص 30، ترمذي نمبر 3181 ،ابوداود نمبر 4744 ابن ماجه، نمبر 2567 ) عبداللہ بن ابی کو سزا اس لئے نہیں دی گئی کہ اس کے لئے آخرت کے عذاب عظیم کو ہی کافی سمجھ لیا گیا اور مومنوں کو سزا دے کر دنیا میں ہی پاک کردیا گیا۔ دوسرے، اس کے پیچھے ایک پورا جتھہ تھا، اس کو سزا دینے کی صورت میں کچھ ایسے خطرات تھے کہ جن سے نمٹنا اس وقت مسلمانوں کے لئے مشکل تھا، اس لئے مصلحتاً اسے سزا دینے سے گریز کیا گیا۔ (فتح القدیر)۔\nتیسری بات یہ فرمائی گئی ہے کہ اللہ کا فضل واحسان تم پر نہ ہوتا تو تمہارا یہ رویہ کہ تم نے بلا تحقیق اس افواہ کو آگے پھیلانا شروع کردیا۔ عذاب عظیم کا باعث تھا۔ اس کا مطلب یہ ہے کہ افواہ سازی اور اس کی نشرواشاعت بھی جرم عظیم ہے۔ جس پر انسان عذاب عظیم کا مستحق قرار پا سکتا ہے۔\nچوتھی بات، کہ یہ معاملہ براہ راست حرم رسول (صلى الله عليه وسلم) اور ان کی عزت وآبرو کا تھا لیکن تم نے اسے قرار واقعی اہمیت نہیں دی، اور اسے ہلکا سمجھا۔ اس سے بھی یہ سمجھانا مقصود ہے کہ محض آبروریزی ہی بڑا جرم نہیں ہے کہ جس کی حد سو کوڑے یا رجم ہے بلکہ کسی کی عزت وآبرو پر اس طرح حملہ کرنا اور کسی عفت مآب خاندان کی تذلیل واہانت کا سروسامان کرنا بھی اللہ کے نزدیک بہت بڑا گناہ ہے، اسے ہلکا مت سمجھو۔ اسی لئے آگے پھر مزید تاکید کرتے ہوئے کہا کہ تم نے سنتے ہی یہ کیوں نہیں کہا کہ ہمیں ایسی بات منہ سےنکالنی بھی لائق نہیں۔ یہ یقیناً بہتان عظیم ہے۔ اسی لئے امام مالک فرماتے ہیں کہ جو نام نہاد مسلمان حضرت عائشہ (رضی الله عنها) پر بےحیائی کا الزام عائد کرے وہ کافر ہے کیوں کہ وہ اللہ کی اور قرآن کی تکذیب کرتا ہے۔ (ایسرالتفاسیر)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walawlā idh samiʿ'tumūhu qul'tum mā yakūnu lanā an natakallama bihādhā sub'ḥānaka hādhā buh'tānun ʿaẓīmun ","translations":["And why not","when","you heard it","you said","Not","it is","for us","that","we speak","of this","Glory be to You","This","(is) a slander","great","(16)"],"transliterationArr":["walawlā","idh","samiʿ'tumūhu","qul'tum","mā","yakūnu","lanā","an","natakallama","bihādhā","sub'ḥānaka","hādhā","buh'tānun","ʿaẓīmun",null],"verseTiming":[[1,0,2280],[2,2280,2630],[3,2630,4180],[4,4180,5130],[5,5130,6320],[6,6320,7190],[7,7190,9570],[8,9570,11400],[9,11400,12470],[10,12470,13820],[11,13820,15640],[12,15640,16470],[13,16470,17710],[14,17710,20605]]}}