{"name":"24:19","price":"جو لوگ مسلمانوں میں بےحیائی پھیلانے کے آرزومند رہتے ہیں ان کے لئے دنیا اور آخرت میں دردناک عذاب ہیں(1) ، اللہ سب کچھ جانتا ہے اور تم کچھ بھی نہیں جانتے.","arabic":"إِنَّ ٱلَّذِينَ يُحِبُّونَ أَن تَشِيعَ ٱلۡفَٰحِشَةُ فِي ٱلَّذِينَ ءَامَنُواْ لَهُمۡ عَذَابٌ أَلِيمٞ فِي ٱلدُّنۡيَا وَٱلۡأٓخِرَةِۚ وَٱللَّهُ يَعۡلَمُ وَأَنتُمۡ لَا تَعۡلَمُونَ","category":["24 (An-Nur)","An-Nur","Surah An-Nur","Chapter An-Nur","Nur","Surah Nur","Chapter Nur","An Nur","Surah An Nur","Chapter An Nur","Surah 24","Chapter 24","The Light","النُّور"],"ayahNumber":2810,"juzNumber":18,"footnotes":"(1) فَاحِشَةٌ کے معنی بےحیائی کے ہیں اور قرآن نے بدکاری کو بھی فاحشہ قرار دیا ہے، (بنی اسرائیل) اور یہاں بدکاری کی ایک جھوٹی خبر کی اشاعت کو بھی اللہ تعالیٰ نے بےحیائی سے تعبیر فرمایا ہے اور اسے دنیا وآخرت میں عذاب الیم کا باعث قرار دیا ہے، جس سے بےحیائی کے بارے میں اسلام کے مزاج کا اور اللہ تعالیٰ کی منشا کا اندازہ ہوتا ہے کہ محض بےحیائی کی ایک جھوٹی خبر کی اشاعت عند اللہ اتنا بڑا جرم ہے تو جو لوگ رات دن ایک مسلمان معاشرے میں اخبارات، ریڈیو، ٹی وی اور فلموں ڈراموں کے ذریعے سے بےحیائی پھیلا رہے ہیں اور گھر گھر اسے پہنچا رہے ہیں، اللہ کے ہاں یہ لوگ کتنے بڑے مجرم ہوں گے؟ اور ان اداروں میں کام کرنے والے ملازمین کیوں کر اشاعت فاحشہ کے جرم سے بری الذمہ قرار پائیں گے؟ اسی طرح اپنے گھروں میں ٹی وی لا کر رکھنے والے، جس سے ان کی آئندہ نسلوں میں بےحیائی پھیل رہی ہے، وہ بھی اشاعت فاحشہ کے مجرم کیوں نہیں ہوں گے؟ اور یہی معاملہ فواحش اور منکرات سے بھرپور روزنامہ اخبارات کا ہے کہ ان کا بھی گھروں کے اندر آنا، اشاعت فاحشہ کا ہی سبب ہے، یہ بھی عنداللہ جرم ہوسکتا ہے۔ کاش مسلمان اپنی ذمہ داریوں کا احساس کریں اور اس بےحیائی کے طوفان کو روکنے کے لئے اپنی مقدور بھر سعی کریں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"inna alladhīna yuḥibbūna an tashīʿa al-fāḥishatu fī alladhīna āmanū lahum ʿadhābun alīmun fī al-dun'yā wal-ākhirati wal-lahu yaʿlamu wa-antum lā taʿlamūna ","translations":["Indeed","those who","like","that","(should) spread","the immorality","among","those who","believe","for them","(is) a punishment","painful","in","the world","and the Hereafter","And Allah","knows","while you","(do) not","know","(19)"],"transliterationArr":["inna","alladhīna","yuḥibbūna","an","tashīʿa","al-fāḥishatu","fī","alladhīna","āmanū","lahum","ʿadhābun","alīmun","fī","al-dun'yā","wal-ākhirati","wal-lahu","yaʿlamu","wa-antum","lā","taʿlamūna",null],"verseTiming":[[1,0,1330],[2,1330,2290],[3,2290,3590],[4,3590,4580],[5,4580,5440],[6,5440,6660],[7,6660,6890],[8,6890,7830],[9,7830,8950],[10,8950,9560],[11,9560,10640],[12,10640,12940],[13,12940,13520],[14,13520,14560],[15,14560,15730],[16,15730,16350],[17,16350,17390],[18,17390,18950],[19,18950,19890],[20,19890,20830],[21,20830,22490],[22,22490,22880],[23,22880,25885]]}}