{"name":"24:27","price":"اے ایمان والو! اپنے گھروں کے سوا اور گھروں میں نہ جاؤ جب تک کہ اجازت نہ لے لو اور وہاں کے رہنے والوں کو سلام نہ کرلو(1) ، یہی تمہارے لئے سراسر بہتر ہے تاکہ تم نصیحت حاصل کرو.(2)","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَدۡخُلُواْ بُيُوتًا غَيۡرَ بُيُوتِكُمۡ حَتَّىٰ تَسۡتَأۡنِسُواْ وَتُسَلِّمُواْ عَلَىٰٓ أَهۡلِهَاۚ ذَٰلِكُمۡ خَيۡرٞ لَّكُمۡ لَعَلَّكُمۡ تَذَكَّرُونَ","category":["24 (An-Nur)","An-Nur","Surah An-Nur","Chapter An-Nur","Nur","Surah Nur","Chapter Nur","An Nur","Surah An Nur","Chapter An Nur","Surah 24","Chapter 24","The Light","النُّور"],"ayahNumber":2818,"juzNumber":18,"footnotes":"(1) گزشتہ آیات میں زنا اور قذف اور ان کی حدوں کا بیان گزرا، اب اللہ تعالیٰ گھروں میں داخل ہونے کے آداب بیان فرما رہا ہےتاکہ مرد وعورت کے درمیان اختلاط نہ ہو جو عام طور پر زنا یا قذف کا سبب بنتا ہے۔ اسْتِينَاسٌ کے معنی ہیں، معلوم کرنا، یعنی جب تک تمہیں یہ معلوم نہ ہوجائے کہ اندر کون ہے اور اس نے تمہیں اندر داخل ہونے کی اجازت دے دی ہے، اس وقت تک داخل نہ ہو۔ بعض نے تَسْتَأْنِسُوا کے معنی تَسْتَأْذِنُوا کے کئے ہیں، جیسا کہ ترجمے سے واضح ہے، آیت میں داخل ہونے کی اجازت طلب کرنے کا ذکر پہلے اور سلام کرنے کا ذکر بعد میں ہے۔ لیکن حدیث سے معلوم ہوتا ہے کہ نبی کریم (صلى الله عليه وسلم) پہلے سلام کرتے اور پھر داخل ہونے کی اجازت طلب کرتے۔ اسی طرح آپ (صلى الله عليه وسلم) کا یہ معمول بھی تھا کہ تین مرتبہ آپ (صلى الله عليه وسلم) اجازت طلب فرماتے، اگر کوئی جواب نہیں آتا تو آپ (صلى الله عليه وسلم) واپس لوٹ آتے۔ اور یہ بھی آپ (صلى الله عليه وسلم) کی عادت مبارکہ تھی کہ اجازت طلبی کے وقت آپ (صلى الله عليه وسلم) دروازے کے دائیں یا بائیں کھڑے ہوتے، تاکہ ایک دم سامنا نہ ہو جس میں بےپردگی کا امکان رہتا ہے (ملاحظہ ہو صحيح بخاري، كتاب الاستئذان باب التسليم والاستئذان ثلاثا- مسند أحمد 3 / 138 أبو داود، كتاب الأدب، باب كم مرة يسلم الرجل في الاستئذان) اسی طرح آپ (صلى الله عليه وسلم) نے دروازے پر کھڑے ہو کر اندر جھانکنے سے بھی نہایت سختی سے منع فرمایا ہے حتیٰ کہ اگر کسی شخص نے جھانکنے والے کی آنکھ پھوڑ دی تو آپ (صلى الله عليه وسلم) نے فرمایا کہ اس پر کوئی گناہ نہیں۔ (البخاري، كتاب الديات، باب من اطلع في بيت قوم ففقئوا عينه فلا دية له- مسلم، كتاب الآداب، باب تحريم النظر في بيت غيره) آپ (صلى الله عليه وسلم) نے اس بات کو بھی ناپسند فرمایا کہ جب اندر سے صاحب بیت پوچھے، کون ہے؟ تو اس کے جواب میں میں، میں کہا جائے، اس کا مطلب یہ ہے کہ نام لے کر اپنا تعارف کرائے۔ (صحيح بخاري، كتاب الاستئذان باب إذا قال من ذا؟ قال أنا- ومسلم، كتاب الآداب باب كراهة قول المستأذن أنا إذا قيل من هذا؟ وأبو داود، كتاب الأدب)۔\n(2) یعنی عمل کرو، مطلب یہ ہے کہ اجازت طلبی اور سلام کرنے کے بعد گھر کے اندر داخل ہونا، دونوں کے لئے اچانک داخل ہونے سے بہتر ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāayyuhā alladhīna āmanū lā tadkhulū buyūtan ghayra buyūtikum ḥattā tastanisū watusallimū ʿalā ahlihā dhālikum khayrun lakum laʿallakum tadhakkarūna ","translations":["O you","who","believe","(Do) not","enter","houses","other (than)","your houses","until","you have asked permission","and you have greeted","[on]","its inhabitants","That","(is) best","for you","so that you may","pay heed","(27)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","lā","tadkhulū","buyūtan","ghayra","buyūtikum","ḥattā","tastanisū","watusallimū","ʿalā","ahlihā","dhālikum","khayrun","lakum","laʿallakum","tadhakkarūna",null],"verseTiming":[[1,0,2760],[2,2760,3650],[3,3650,4750],[4,4750,5130],[5,5130,6130],[6,6130,7210],[7,7210,7910],[8,7910,9150],[9,9150,9970],[10,9970,11510],[11,11510,12870],[12,12870,14850],[13,14850,16040],[14,16040,17730],[15,17730,18470],[16,18470,19210],[17,19210,20480],[18,20480,23735]]}}