{"name":"24:26","price":"خبیﺚ عورتیں خبیﺚ مردوں کے ﻻئق ہیں اور خبیﺚ مرد خبیﺚ عورتوں کے ﻻئق ہیں اور پاک عورتیں پاک مردوں کے ﻻئق ہیں اور پاک مرد پاک عورتوں کے ﻻئق ہیں(1) ۔ ایسے پاک لوگوں کے متعلق جو کچھ بکواس (بہتان باز) کر رہے ہیں وه ان سے بالکل بری ہیں، ان کے لئے بخشش ہے اور عزت والی روزی.(2)","arabic":"ٱلۡخَبِيثَٰتُ لِلۡخَبِيثِينَ وَٱلۡخَبِيثُونَ لِلۡخَبِيثَٰتِۖ وَٱلطَّيِّبَٰتُ لِلطَّيِّبِينَ وَٱلطَّيِّبُونَ لِلطَّيِّبَٰتِۚ أُوْلَٰٓئِكَ مُبَرَّءُونَ مِمَّا يَقُولُونَۖ لَهُم مَّغۡفِرَةٞ وَرِزۡقٞ كَرِيمٞ","category":["24 (An-Nur)","An-Nur","Surah An-Nur","Chapter An-Nur","Nur","Surah Nur","Chapter Nur","An Nur","Surah An Nur","Chapter An Nur","Surah 24","Chapter 24","The Light","النُّور"],"ayahNumber":2817,"juzNumber":18,"footnotes":"(1) اس کا مفہوم تو یہی بیان کیا گیا ہے جو ترجمے سے واضح ہے . اس صورت میں یہ «الزَّانِي لا يَنْكِحُ إِلا زَانِيَةً»کے ہم معنی آیت ہوگی، اور خبیثات اور خبیثون سے زانی مرد وعورت اور طیبات اور طیبون سے مراد پاک دامن عورت اور مرد ہوں گے۔ دوسرے معنی اس کے ہیں کہ ناپاک باتیں ناپاک مردوں کے لئے اور ناپاک مرد ناپاک باتوں کے لئے ہیں اور پاکیزہ باتیں پاکیزہ مردوں کے لئے اور پاکیزہ مرد پاکیزہ باتوں کے لئے ہیں اور مطلب یہ ہوگا کہ ناپاک باتیں وہی مرد وعورت کرتے ہیں جو ناپاک ہیں اور پاکیزہ باتیں کرنا پاکیزہ مردوں اور عورتوں کا شیوہ ہے۔ اس میں اشارہ ہے، اس بات کی طرف کہ حضرت عائشہ (رضی الله عنها) پر ناپاکی کا الزام عائد کرنے والے ناپاک اور ان سے اس کی براءت کرنے والے پاک ہیں۔\n(2) اس سے مراد جنت کی روزی ہے جو اہل ایمان کو نصیب ہوگی۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"al-khabīthātu lil'khabīthīna wal-khabīthūna lil'khabīthāti wal-ṭayibātu lilṭṭayyibīna wal-ṭayibūna lilṭṭayyibāti ulāika mubarraūna mimmā yaqūlūna lahum maghfiratun wariz'qun karīmun ","translations":["Evil women","(are) for evil men","and evil men","(are) for evil women","And good women","(are) for good men","and good men","(are) for good women","Those","(are) innocent","of what","they say","For them","(is) forgiveness","and a provision","noble","(26)"],"transliterationArr":["al-khabīthātu","lil'khabīthīna","wal-khabīthūna","lil'khabīthāti","wal-ṭayibātu","lilṭṭayyibīna","wal-ṭayibūna","lilṭṭayyibāti","ulāika","mubarraūna","mimmā","yaqūlūna","lahum","maghfiratun","wariz'qun","karīmun",null],"verseTiming":[[1,0,1960],[2,1960,3670],[3,3670,5600],[4,5600,9480],[5,9480,11250],[6,11250,13030],[7,13030,14760],[8,14760,16310],[9,16310,18729],[10,18729,21400],[11,21400,23380],[12,23380,24970],[13,24970,28440],[14,28440,29440],[15,29440,31630],[16,31630,33240],[17,33240,34755]]}}