{"name":"24:32","price":"تم میں سے جو مرد عورت بےنکاح کے ہوں ان کا نکاح کر دو(1) اور اپنے نیک بخت غلام اور لونڈیوں کا بھی(2)۔ اگر وه مفلس بھی ہوں گے تو اللہ تعالیٰ انہیں اپنے فضل سے غنی بنا دے گا(3)۔ اللہ تعالیٰ کشادگی واﻻ اور علم واﻻ ہے.","arabic":"وَأَنكِحُواْ ٱلۡأَيَٰمَىٰ مِنكُمۡ وَٱلصَّٰلِحِينَ مِنۡ عِبَادِكُمۡ وَإِمَآئِكُمۡۚ إِن يَكُونُواْ فُقَرَآءَ يُغۡنِهِمُ ٱللَّهُ مِن فَضۡلِهِۦۗ وَٱللَّهُ وَٰسِعٌ عَلِيمٞ","category":["24 (An-Nur)","An-Nur","Surah An-Nur","Chapter An-Nur","Nur","Surah Nur","Chapter Nur","An Nur","Surah An Nur","Chapter An Nur","Surah 24","Chapter 24","The Light","النُّور"],"ayahNumber":2823,"juzNumber":18,"footnotes":"(1) ۔أَيَامَى، أَيِّمٌ کی جمع ہے، أَيِّمٌ ایسی عورت کو کہا جاتا ہے جس کا خاوند نہ ہو، جس میں کنواری، بیوہ اور مطلقہ تینوں آجاتی ہیں۔ اور ایسے مرد کو بھی أَيِّمٌ کہتے ہیں جس کی بیوی نہ ہو۔ آیت میں خطاب اولیاء سے ہے کہ نکاح کر دو، یہ نہیں فرمایا کہ نکاح کر لو، کہ مخاطب نکاح کرنے والے مردو عورت ہوتے۔ اس سے معلوم ہوا کہ عورت ولی کی اجازت اور رضامندی کے بغیر از خود اپنا نکاح نہیں کرسکتی۔ جس کی تائید احادیث سے بھی ہوتی ہے۔ اسی طرح امر کے صیغے سے بعض نے استدلال کیا ہے کہ نکاح کرنا واجب ہے، جب کہ بعض نے اسے مباح اور بعض نے مستحب قرار دیا ہے۔ تاہم استطاعت رکھنے والے کے لئے یہ سنت موکدہ بلکہ بعض حالات میں واجب ہے اور اس سے اعراض سخت وعید کا باعث ہے۔ نبی (صلى الله عليه وسلم) کا فرمان ہے «وَمَنْ رَغِبَ عَنْ سُنَّتِي فَلَيْسَ مِنِّي» (البخاري نمبر 50 63، ومسلم، نمبر 1020 ) \"جس نے میری سنت سے اعراض کیا، وہ مجھ سے نہیںL۔\n(2) یہاں صالحیت سے مراد ایمان ہے، اس میں اختلاف ہے کہ مالک اپنے غلام اور لونڈیوں کو نکاح کرنے پر مجبور کرسکتے ہیں یا نہیں؟ بعض اکراہ کے قائل ہیں، بعض نہیں۔ تاہم اندیشہ ضرر کی صورت میں شرعاً مجبور کرنا جائز ہے۔ بصورت دیگر غیر مشروع (ایسرالتفاسیر)۔\n(3) یعنی محض غربت اور تنگ دستی نکاح میں مانع نہیں ہونی چاہیئے۔ ممکن ہے نکاح کے بعد اللہ ان کی تنگ دستی کو اپنے فضل سے وسعت وفراخی میں بدل دے۔ حدیث میں آتا ہے۔ تین شخص ہیں جن کی اللہ ضرور مدد فرماتا ہے۔ 1۔ نکاح کرنے والا، جو پاک دامنی کی نیت سے نکاح کرتا ہے۔ 2۔ مکاﺗب غلام، جو ادائیگی کی نیت رکھتا ہے۔ 3۔ اور اللہ کی راہ میں جہاد کرنے والا۔ (ترمذي- أبواب فضائل الجهاد، باب ما جاء في المجاهد، والمكاتب والنكاح)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-ankiḥū al-ayāmā minkum wal-ṣāliḥīna min ʿibādikum wa-imāikum in yakūnū fuqarāa yugh'nihimu al-lahu min faḍlihi wal-lahu wāsiʿun ʿalīmun ","translations":["And marry","the single","among you","and the righteous","among","your male slaves","and your female slaves","If","they are","poor","Allah will enrich them","Allah will enrich them","from","His Bounty","And Allah","(is) All-Encompassing","All-Knowing","(32)"],"transliterationArr":["wa-ankiḥū","al-ayāmā","minkum","wal-ṣāliḥīna","min","ʿibādikum","wa-imāikum","in","yakūnū","fuqarāa","yugh'nihimu","al-lahu","min","faḍlihi","wal-lahu","wāsiʿun","ʿalīmun",null],"verseTiming":[[1,0,1720],[2,1720,3050],[3,3050,4460],[4,4460,6170],[5,6170,6510],[6,6510,7960],[7,7960,11530],[8,11530,12470],[9,12470,13500],[10,13500,16170],[11,16170,17270],[12,17270,18190],[13,18190,18490],[14,18490,20610],[15,20610,21730],[16,21730,22730],[17,22730,25315]]}}