{"name":"24:36","price":"ان گھروں میں جن کے بلند کرنے، اور جن میں اپنے نام کی یاد کا اللہ تعالیٰ نے حکم دیا ہے(1) وہاں صبح وشام اللہ تعالیٰ کی تسبیح بیان کرتے ہیں.(2)","arabic":"فِي بُيُوتٍ أَذِنَ ٱللَّهُ أَن تُرۡفَعَ وَيُذۡكَرَ فِيهَا ٱسۡمُهُۥ يُسَبِّحُ لَهُۥ فِيهَا بِٱلۡغُدُوِّ وَٱلۡأٓصَالِ","category":["24 (An-Nur)","An-Nur","Surah An-Nur","Chapter An-Nur","Nur","Surah Nur","Chapter Nur","An Nur","Surah An Nur","Chapter An Nur","Surah 24","Chapter 24","The Light","النُّور"],"ayahNumber":2827,"juzNumber":18,"footnotes":"(1) جب اللہ تعالیٰ نے قلب مومن کو اور اس میں جو ایمان وہدایت اور علم ہے، اس کو ایسے چراغ سے تشبیہ دی جو شیشے کی قندیل میں ہو اور جو صاف شفاف تیل سے روشن ہو۔ تو اب اس کا محل بیان کیا جارہا ہے کہ یہ قندیل ایسے گھروں میں ہیں، جن کی بابت حکم دیا گیا ہے کہ انہیں بلندکیا جائے اور ان میں اللہ کا ذکر کیا جائے۔ مراد مسجدیں ہیں، جو اللہ کو زمین کے حصوں میں سب سے زیادہ محبوب ہیں۔ بلندی سے مراد محض سنگ وخشت کی بلندی نہیں ہے بلکہ اس میں مسجدوں کو گندگی، لغویات اور غیرمناسب اقوال و افعال سے پاک رکھنا بھی شامل ہے۔ ورنہ محض مسجدوں کی عمارتوں کو عالی شان اور فلک بوس بنا دینا، مطلوب نہیں ہے بلکہ احادیث میں مسجدوں کو زرنگار اور زیادہ آراستہ وپیراستہ کرنے سے منع کیا گیا ہے۔ اور ایک حدیث میں تو اسے قرب قیامت کی علامات میں سے بتلایا گیا ہے۔ (أبو داود، كتاب الصلاة باب في بناء المساجد) علاوہ ازیں، جس طرح مسجدوں میں تجارت وکاروبار اور شور وشغب ممنوع ہیں کیونکہ یہ مسجد کے اصل مقصد، عبادت کے منفی ہیں۔ اسی طرح اللہ کا ذکر کرنے میں یہ بات بھی شامل ہے کہ صرف ایک اللہ کا ذکر کیا جائے، اسی کی عبادت کی جائے اور صرف اسی کو مدد کے لئے پکارا جائے۔ «وَأَنَّ الْمَسَاجِدَ لِلَّهِ فَلا تَدْعُوا مَعَ اللَّهِ أَحَدًا» (سورة جن: 18) ”مسجدیں، اللہ کے لئے ہیں، پس اللہ کے ساتھ کسی کو مت پکارو“۔\n(2) تسبیح سے مراد نماز ہے۔ آصَالٌ، أَصِيلٌ کی جمع ہے بمعنی شام۔ یعنی اہل ایمان، جن کے دل ایمان و ہدایت کے نور سے روشن ہوتے ہیں، صبح وشام مسجدوں میں اللہ کی رضا کے لئے نماز پڑھتے اور اس کی عبادت کرتے ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"fī buyūtin adhina al-lahu an tur'faʿa wayudh'kara fīhā us'muhu yusabbiḥu lahu fīhā bil-ghuduwi wal-āṣāli ","translations":["In","houses","(which) Allah ordered","(which) Allah ordered","that","they be raised","and be mentioned","in them","His name","Glorify","[to] Him","in them","in the mornings","and (in) the evenings","(36)"],"transliterationArr":["fī","buyūtin","adhina","al-lahu","an","tur'faʿa","wayudh'kara","fīhā","us'muhu","yusabbiḥu","lahu","fīhā","bil-ghuduwi","wal-āṣāli",null],"verseTiming":[[1,0,490],[2,490,1670],[3,1670,2280],[4,2280,3300],[5,3300,4380],[6,4380,5460],[7,5460,6460],[8,6460,7060],[9,7060,7980],[10,7980,9190],[11,9190,9820],[12,9820,10860],[13,10860,12370],[14,12370,13030],[15,13030,13980],[16,13980,15400],[17,15400,18885]]}}