{"name":"24:41","price":"کیا آپ نے نہیں دیکھا کہ آسمانوں اور زمین کی کل مخلوق اور پر پھیلائے(1) اڑنے والے کل پرند اللہ کی تسبیح میں مشغول ہیں۔ ہر ایک کی نماز اور تسبیح اسے معلوم ہے(2)، لوگ جو کچھ کریں اس سے اللہ بخوبی واقف ہے.(3)","arabic":"أَلَمۡ تَرَ أَنَّ ٱللَّهَ يُسَبِّحُ لَهُۥ مَن فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَٱلطَّيۡرُ صَٰٓفَّٰتٖۖ كُلّٞ قَدۡ عَلِمَ صَلَاتَهُۥ وَتَسۡبِيحَهُۥۗ وَٱللَّهُ عَلِيمُۢ بِمَا يَفۡعَلُونَ","category":["24 (An-Nur)","An-Nur","Surah An-Nur","Chapter An-Nur","Nur","Surah Nur","Chapter Nur","An Nur","Surah An Nur","Chapter An Nur","Surah 24","Chapter 24","The Light","النُّور"],"ayahNumber":2832,"juzNumber":18,"footnotes":"(1) صَافَّاتٌ کے معنی ہیں باسطات اور اس کا مفعول أَجْنِحَتَهَا محذوف ہے۔ اپنے پر پھیلائے ہوئے۔ مَنْ فِي السَّمَاوَاتِ وَالأَرْضِ میں پرندے بھی شامل تھے۔ لیکن یہاں ان کاذکر الگ سے کیا، اس لئے کہ پرندے، تمام حیوانات میں ایک نہایت ممتاز مخلوق ہیں، جو اللہ کی قدرت کاملہ سے آسمان وزمین کے درمیان فضا میں اڑتے ہوئے اللہ کی تسبیح کرتی ہے۔ یہ مخلوق اڑنے پر بھی قدرت رکھتی ہے جس سے دیگر تمام حیوانات محروم ہیں اور زمین پر چلنے پھرنے کی قدرت بھی رکھتی ہے۔\n(2) یعنی اللہ نے ہر مخلوق کو یہ علم الہام والقا کیا ہے کہ وہ اللہ کی تسبیح کس طرح کرے، جس کا مطلب یہ ہے کہ یہ بخت واتفاق کی بات نہیں بلکہ آسمان و زمین کی ہر چیز کا تسبیح کرنا اور نماز ادا کرنا یہ بھی اللہ ہی کی قدرت کا ایک مظہر ہے، جس طرح ان کی تخلیق اللہ کی ایک صنعت بدیع ہے، جس پر اللہ کے سوا کوئی قادر نہیں۔\n(3) یعنی اہل زمین واہل آسمان جس طرح اللہ کی اطاعت اور اس کی تسبیح کرتے ہیں، سب اس کے علم میں ہے، یہ گویا انسانوں اور جنوں کو تنبیہ ہے کہ تمہیں اللہ نے شعور اور ارادے کی آزادی دی ہے تو تمہیں تو دوسری مخلوقات سے زیادہ اللہ کی تسبیح وتحمید اور اس کی اطاعت کرنی چاہیئے۔ لیکن معاملہ اس کے برعکس ہے۔ دیگر مخلوقت تو تسبیح الٰہی میں مصروف ہیں۔ لیکن شعور اور ارادہ سے بہرہ ور مخلوق اس میں کوتاہی کا ارتکاب کرتی ہے۔ جس پر یقیناً وہ اللہ کی گرفت کی مستحق ہوگی۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"alam tara anna al-laha yusabbiḥu lahu man fī al-samāwāti wal-arḍi wal-ṭayru ṣāffātin kullun qad ʿalima ṣalātahu watasbīḥahu wal-lahu ʿalīmun bimā yafʿalūna ","translations":["Do not","you see","that","Allah ","glorify","Him","whoever","(is) in","the heavens","and the earth","and the birds","(with) wings outspread","Each one","verily","knows","its prayer","and its glorification","And Allah","(is) All-Knower","of what","they do","(41)"],"transliterationArr":["alam","tara","anna","al-laha","yusabbiḥu","lahu","man","fī","al-samāwāti","wal-arḍi","wal-ṭayru","ṣāffātin","kullun","qad","ʿalima","ṣalātahu","watasbīḥahu","wal-lahu","ʿalīmun","bimā","yafʿalūna",null],"verseTiming":[[1,0,750],[2,750,1250],[3,1250,2530],[4,2530,3410],[5,3410,4550],[6,4550,4990],[7,4990,5770],[8,5770,6360],[9,6360,7970],[10,7970,9140],[11,9140,10190],[12,10190,13259],[13,13259,15329],[14,15329,17469],[15,17469,17859],[16,17859,18549],[17,18549,20069],[18,20069,21979],[19,21979,23069],[20,23069,25009],[21,25009,25609],[22,25609,28214]]}}