{"name":"24:55","price":"تم میں سے ان لوگوں سے جو ایمان ﻻئے ہیں اور نیک اعمال کئے ہیں اللہ تعالیٰ وعده فرما چکا ہے کہ انہیں ضرور زمین میں خلیفہ بنائے گا جیسے کہ ان لوگوں کو خلیفہ بنایا تھا جو ان سے پہلے تھے اور یقیناً ان کے لئے ان کے اس دین کو مضبوطی کے ساتھ محکم کرکے جما دے گا جسے ان کے لئے وه پسند فرما چکا ہے اور ان کے اس خوف وخطر کو وه امن وامان سے بدل دے گا(1) ، وه میری عبادت کریں گے میرے ساتھ کسی کو بھی شریک نہ ٹھہرائیں گے(2)۔ اس کے بعد بھی جو لوگ ناشکری اور کفر کریں وه یقیناً فاسق ہیں.(3)","arabic":"وَعَدَ ٱللَّهُ ٱلَّذِينَ ءَامَنُواْ مِنكُمۡ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ لَيَسۡتَخۡلِفَنَّهُمۡ فِي ٱلۡأَرۡضِ كَمَا ٱسۡتَخۡلَفَ ٱلَّذِينَ مِن قَبۡلِهِمۡ وَلَيُمَكِّنَنَّ لَهُمۡ دِينَهُمُ ٱلَّذِي ٱرۡتَضَىٰ لَهُمۡ وَلَيُبَدِّلَنَّهُم مِّنۢ بَعۡدِ خَوۡفِهِمۡ أَمۡنٗاۚ يَعۡبُدُونَنِي لَا يُشۡرِكُونَ بِي شَيۡـٔٗاۚ وَمَن كَفَرَ بَعۡدَ ذَٰلِكَ فَأُوْلَٰٓئِكَ هُمُ ٱلۡفَٰسِقُونَ","category":["24 (An-Nur)","An-Nur","Surah An-Nur","Chapter An-Nur","Nur","Surah Nur","Chapter Nur","An Nur","Surah An Nur","Chapter An Nur","Surah 24","Chapter 24","The Light","النُّور"],"ayahNumber":2846,"juzNumber":18,"footnotes":"(1) بعض نے اس وعدۂ الٰہی کو صحابہ کرام کے ساتھ یا خلفائے راشدین کے ساتھ خاص قرار دیا ہے لیکن اس کی تخصیص کی کوئی دلیل نہیں۔ قرآن کے الفاظ عام ہیں اور ایمان وعمل صالح کے ساتھ مشروط ہیں۔ البتہ یہ بات ضرور ہے کہ عہد خلافت راشدہ اور عہد خیرالقرون میں، اس وعدۂ الٰہی کا ظہور ہوا، اللہ تعالیٰ نے مسلمانوں کو زمین پر غلبہ عطا فرمایا، اپنے پسندیدہ دین اسلام کو عروج دیا اور مسلمانوں کے خوف کو، امن سے بدل دیا۔ پہلے مسلمان کفار عرب سے ڈرتے تھے، پھر اس کے برعکس معاملہ ہوگیا۔ نبی کریم (صلى الله عليه وسلم) نے بھی جو پیش گوئیاں فرمائی تھیں، وہ بھی اس عہد میں پوری ہوئیں۔ مثلاً آپ (صلى الله عليه وسلم) نے فرمایا تھا کہ حیرہ سے ایک عورت تن تنہا اکیلی چلے گی اور بیت اللہ کا آکر طواف کرے گی، اسے کوئی خوف اور خطرہ نہیں ہوگا۔ کسریٰ کے خزانے تمہارے قدموں میں ڈھیر ہوجائیں گے۔ چنانچہ ایسا ہی ہوا (صحيح بخاري، كتاب المناقب، باب علامات النبوة في الإسلام) نبی کریم (صلى الله عليه وسلم) نے یہ بھی فرمایا تھا «إِنَّ اللهَ زَوَى لِيَ الأَرْضَ، فَرَأَيْتُ مَشَارِقَهَا وَمَغَارِبَهَا، وَإِنَّ أُمَّتِي سَيَبْلُغُ مُلْكُهَا مَا زُوِيَ لِي مِنْهَا»(صحيح مسلم كتاب الفتن وأشراط الساعة- باب هلاك هذه الأمة بعضهم ببعض) ”اللہ تعالیٰ نے زمین کو میرے لئے سکیڑ دیا، پس میں نے اس کے مشرقی اور مغربی حصے دیکھے، عنقریب میری امت کا دائرہ اقتدار وہاں تک پہنچے گا، جہاں تک میرے لئے زمین سکیڑ دی گئی“۔ حکمرانی کی یہ وسعت بھی مسلمانوں کے حصے میں آئی، اور فارس وشام اور مصروافریقہ اور دیگر دوردراز کے ممالک فتح ہوئے اور کفر وشرک کی جگہ توحید وسنت کی مشعلیں ہر جگہ روشن ہوگئیں اور اسلامی تہذیب وتمدن کا پھریرا چار دانگ عالم میں لہرا گیا۔ لیکن یہ وعدہ چونکہ مشروط تھا، جب مسلمان ایمان میں کمزور اور عمل صالح میں کوتاہی کے مرتکب ہوئے تو اللہ نے ان کی عزت کو ذلت میں، ان کے اقتدار اور غلبے کو غلامی میں اور ان کے امن و استحکام کو خوف اور دہشت میں بدل دیا۔\n(2) یہ بھی ایمان اور عمل صالح کے ساتھ ایک اور بنیادی شرط ہے جس کی وجہ سے مسلمان اللہ کی مدد کے مستحق، اور اس وصف توحید سے عاری ہونے کے بعد وہ اللہ کی مدد سے محروم ہوجائیں گے۔\n(3) اس کفر سے مراد، وہی ایمان، عمل صالح اور توحید سے محرومی ہے، جس کے بعد ایک انسان اللہ کی اطاعت سے نکل جاتا اور کفر وفسق کے دائرے میں داخل ہوجاتا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waʿada al-lahu alladhīna āmanū minkum waʿamilū al-ṣāliḥāti layastakhlifannahum fī al-arḍi kamā is'takhlafa alladhīna min qablihim walayumakkinanna lahum dīnahumu alladhī ir'taḍā lahum walayubaddilannahum min baʿdi khawfihim amnan yaʿbudūnanī lā yush'rikūna bī shayan waman kafara baʿda dhālika fa-ulāika humu al-fāsiqūna ","translations":["Allah (has) promised","Allah (has) promised","those who","believe","among you","and do","righteous deeds","surely He will grant them succession","in","the earth","as","He gave succession","to those who","(were) before them","(were) before them","and that He will surely establish","for them","their religion","which","He has approved","for them","and surely He will change for them","after","after","their fear","security","(for) they worship Me","not","they associate","with Me","anything","But whoever","disbelieved","after","that","then those","[they]","(are) the defiantly disobedient","(55)"],"transliterationArr":["waʿada","al-lahu","alladhīna","āmanū","minkum","waʿamilū","al-ṣāliḥāti","layastakhlifannahum","fī","al-arḍi","kamā","is'takhlafa","alladhīna","min","qablihim","walayumakkinanna","lahum","dīnahumu","alladhī","ir'taḍā","lahum","walayubaddilannahum","min","baʿdi","khawfihim","amnan","yaʿbudūnanī","lā","yush'rikūna","bī","shayan","waman","kafara","baʿda","dhālika","fa-ulāika","humu","al-fāsiqūna",null],"verseTiming":[[1,0,740],[2,740,1810],[3,1810,2910],[4,2910,4240],[5,4240,5640],[6,5640,6520],[7,6520,8230],[8,8230,11280],[9,11280,11550],[10,11550,12800],[11,12800,15960],[12,15960,16220],[13,16220,17080],[14,17080,17490],[15,17490,18680],[16,18680,19900],[17,19900,21180],[18,21180,22280],[19,22280,24810],[20,24810,25520],[21,25520,26990],[22,26990,29660],[23,29660,30310],[24,30310,31450],[25,31450,32170],[26,32170,33200],[27,33200,33880],[28,33880,37280],[29,37280,38800],[30,38800,39450],[31,39450,40670],[32,40670,41780],[33,41780,44170],[34,44170,44650],[35,44650,46040],[36,46040,46470],[37,46470,47640],[38,47640,49340],[39,49340,50080],[40,50080,51140],[41,51140,51730],[42,51730,54319],[43,54319,54709],[44,54709,57904]]}}