{"name":"24:53","price":"بڑی پختگی کے ساتھ اللہ تعالیٰ کی قسمیں کھا کھا کر کہتے ہیں(1) کہ آپ کا حکم ہوتے ہی نکل کھڑے ہوں گے۔ کہہ دیجیئے کہ بس قسمیں نہ کھاؤ (تمہاری) اطاعت (کی حقیقت) معلوم ہے(2)۔ جو کچھ تم کر رہے ہو اللہ تعالیٰ اس سے باخبر ہے.(3)","arabic":"۞ وَأَقۡسَمُواْ بِٱللَّهِ جَهۡدَ أَيۡمَٰنِهِمۡ لَئِنۡ أَمَرۡتَهُمۡ لَيَخۡرُجُنَّۖ قُل لَّا تُقۡسِمُواْۖ طَاعَةٞ مَّعۡرُوفَةٌۚ إِنَّ ٱللَّهَ خَبِيرُۢ بِمَا تَعۡمَلُونَ","category":["24 (An-Nur)","An-Nur","Surah An-Nur","Chapter An-Nur","Nur","Surah Nur","Chapter Nur","An Nur","Surah An Nur","Chapter An Nur","Surah 24","Chapter 24","The Light","النُّور"],"ayahNumber":2844,"juzNumber":18,"footnotes":"(1) جَهْدَ أَيْمَانِهِمْ، میں جَهْدٌ فعل محذوف کا مصدر ہے جو بطور تاکید کے ہے، يَجْهَدُونَ أَيْمَانَهُمْ جَهْدًا یا یہ حال کی وجہ سے منصوب ہے یعنی مُجْتَهِدِينَ فِي أَيْمَانِهِمْ، مطلب یہ ہے کہ اپنی وسعت بھر قسمیں کھا کر کہتے ہیں (فتح القدیر)۔\n(2) اور وہ یہ ہے کہ جس طرح تم قسمیں جھوٹی کھاتے ہو، تمہاری اطاعت بھی نفاق پر مبنی ہے۔ بعض نے یہ معنی کئے ہیں کہ تمہارا معاملہ طاعت معروفہ ہونا چاہیئے۔ یعنی معروف میں بغیر کسی قسم کے حلف کے اطاعت، جس طرح مسلمان کرتے ہیں، پس تم بھی ان کی مثل ہوجاؤ۔ (ابن کثیر)۔\n(3) یعنی وہ تمہارے سب کے حالات سے باخبر ہے۔ کون فرمانبردار ہے اور کون نافرمان؟ پس حلف اٹھا کر اطاعت کے اظہار کرنے سے، جب کہ تمہارے دل میں اس کے خلاف عزم ہو، تم اللہ کو دھوکہ نہیں دے سکتے، اس لئے کہ وہ پوشیدہ ہے، پوشیدہ تر بات کو بھی جانتا ہے اور وہ تمہارے سینوں میں پلنے والے رازوں سے بھی آگاہ ہے اگرچہ تم زبان سے اس کے خلاف اظہار کرو!۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-aqsamū bil-lahi jahda aymānihim la-in amartahum layakhrujunna qul lā tuq'simū ṭāʿatun maʿrūfatun inna al-laha khabīrun bimā taʿmalūna ","translations":["And they swear","by Allah","strong","their oaths","that if","you ordered them","surely they (would) go forth","Say","(Do) not","swear","Obedience","(is) known","Indeed","Allah","(is) All-Aware","of what","you do","(53)"],"transliterationArr":["wa-aqsamū","bil-lahi","jahda","aymānihim","la-in","amartahum","layakhrujunna","qul","lā","tuq'simū","ṭāʿatun","maʿrūfatun","inna","al-laha","khabīrun","bimā","taʿmalūna",null],"verseTiming":[[1,0,1350],[2,1350,2630],[3,2630,3300],[4,3300,4970],[5,4970,5600],[6,5600,6850],[7,6850,9330],[8,9330,10190],[9,10190,10760],[10,10760,11980],[11,11980,13770],[12,13770,16300],[13,16300,17450],[14,17450,18400],[15,18400,20130],[16,20130,20980],[17,20980,24685]]}}