{"name":"24:5","price":"ہاں جو لوگ اس کے بعد توبہ اور اصلاح کرلیں(1) تو اللہ تعالیٰ بخشنے واﻻ اور مہربانی کرنے واﻻ ہے.","arabic":"إِلَّا ٱلَّذِينَ تَابُواْ مِنۢ بَعۡدِ ذَٰلِكَ وَأَصۡلَحُواْ فَإِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ","category":["24 (An-Nur)","An-Nur","Surah An-Nur","Chapter An-Nur","Nur","Surah Nur","Chapter Nur","An Nur","Surah An Nur","Chapter An Nur","Surah 24","Chapter 24","The Light","النُّور"],"ayahNumber":2796,"juzNumber":18,"footnotes":"(1) توبہ سے کوڑوں کی سزا تو معاف نہیں ہوگی، تائب ہو جائے یا اصرار کرے، یہ سزا تو بہرحال ملے گی۔البتہ دوسری دو باتیں جو ہیں، مردود الشہادۃ اور فاسق ہونا، اس کے بارے میں اختلاف ہے، بعض علماء اس استثنا کو فسق تک محدود رکھتے ہیں۔ یعنی توبہ کے بعد فاسق نہیں رہے گا۔ اور بعض مفسرین دونوں جملوں کو اس میں شامل سمجھتے ہیں، یعنی توبہ کے بعد مقبول الشہادۃ بھی ہو جائے گا۔امام شوکانی نے اسی دوسری رائے کو ترجیح دی ہے اور ابداً کا مطلب بیان کیا ہے مادام قاذفاً یعنی جب تک وہ بہتان تراشی پر قائم رہے جس طرح کہا جائے کہ کافر کی شہادت کبھی قبول نہیں، تو یہاں \"کبھی\"کا مطلب یہی ہوگا کہ جب تک وہ کافر ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"illā alladhīna tābū min baʿdi dhālika wa-aṣlaḥū fa-inna al-laha ghafūrun raḥīmun ","translations":["Except","those who","repent","after","after","that","and reform","Then indeed","Allah","(is) Oft-Forgiving","Most Merciful","(5)"],"transliterationArr":["illā","alladhīna","tābū","min","baʿdi","dhālika","wa-aṣlaḥū","fa-inna","al-laha","ghafūrun","raḥīmun",null],"verseTiming":[[1,0,690],[2,690,1750],[3,1750,2840],[4,2840,3960],[5,3960,4680],[6,4680,5630],[7,5630,6950],[8,6950,8660],[9,8660,9610],[10,9610,10650],[11,10650,13855]]}}