{"name":"25:12","price":"جب وه انہیں دور سے دیکھے گی تو یہ اس کا غصے سے بپھرنا اور دھاڑنا سنیں گے.(1)","arabic":"إِذَا رَأَتۡهُم مِّن مَّكَانِۭ بَعِيدٖ سَمِعُواْ لَهَا تَغَيُّظٗا وَزَفِيرٗا","category":["25 (Al-Furqan)","Al-Furqan","Surah Al-Furqan","Chapter Al-Furqan","Furqan","Surah Furqan","Chapter Furqan","Al Furqan","Surah Al Furqan","Chapter Al Furqan","Surah 25","Chapter 25","The Criterion","الفُرقان"],"ayahNumber":2867,"juzNumber":18,"footnotes":"(1) یعنی جہنم ان کافروں کو دور سے میدان محشر میں دیکھ کر ہی غصے سے کھول اٹھے گی اور ان کو اپنے دامن غضب میں لینے کے لئے چلائے گی اور جھنجھلائے گی، جس طرح دوسرے مقام پر فرمایا: «إِذَا أُلْقُوا فِيهَا سَمِعُوا لَهَا شَهِيقًا وَهِيَ تَفُورُ (1) تَكَادُ تَمَيَّزُ مِنَ الْغَيْظِ» (سورة الملك - 7،8) (جب جہنمی، جہنم میں ڈالے جائیں گے تو اس کا دھاڑنا سنیں گے اور وہ (جوش غضب سے) اچھلتی ہوگی، ایسے لگے گا کہ وہ غصے سے پھٹ پڑےگی)۔ جہنم کا دیکھنا اور چلانا، ایک حقیقت ہے، استعارہ نہیں۔ اللہ کے لئے اس کے اندر احساس و ادراک کی قوت پیدا کردینا، مشکل نہیں ہے، وہ جو چاہے کرسکتا ہے۔ آخر قوت گویائی بھی تو اللہ تعالیٰ اسے عطا فرمائے گا اور وہ «هَلْ مِنْ مَزِيدٍ»کی صدا بلند کرے گی (سورۂ ق: 30)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"idhā ra-athum min makānin baʿīdin samiʿū lahā taghayyuẓan wazafīran ","translations":["When","it sees them","from","a place","far","they will hear","its","raging","and roaring","(12)"],"transliterationArr":["idhā","ra-athum","min","makānin","baʿīdin","samiʿū","lahā","taghayyuẓan","wazafīran",null],"verseTiming":[[1,0,720],[2,720,1770],[3,1770,2750],[4,2750,5050],[5,5050,6370],[6,6370,8060],[7,8060,8660],[8,8660,10970],[9,10970,12975]]}}