{"name":"25:1","price":"بہت بابرکت ہے وه اللہ تعالیٰ جس نے اپنے بندے پر فرقان (1) اتارا تاکہ وه تمام لوگوں کے(2) لئے آگاه کرنے واﻻ بن جائے.","arabic":"تَبَارَكَ ٱلَّذِي نَزَّلَ ٱلۡفُرۡقَانَ عَلَىٰ عَبۡدِهِۦ لِيَكُونَ لِلۡعَٰلَمِينَ نَذِيرًا","category":["25 (Al-Furqan)","Al-Furqan","Surah Al-Furqan","Chapter Al-Furqan","Furqan","Surah Furqan","Chapter Furqan","Al Furqan","Surah Al Furqan","Chapter Al Furqan","Surah 25","Chapter 25","The Criterion","الفُرقان"],"ayahNumber":2856,"juzNumber":18,"footnotes":"(1) فرقان کے معنی ہیں حق وباطل، توحید وشرک اور عدل وظلم کے درمیان فرق کرنے والا، اس قرآن نے کھول کر ان امور کی وضاحت کردی ہے، اس لئے اسے فرقان سے تعبیر کیا۔\n(2) اس سے بھی معلوم ہوا کہ نبی کریم (صلى الله عليه وسلم) کی نبوت عالم گیر ہے اور آپ تمام انسانوں اور جنوں کے لئے ہادی ورہنما بنا کر بھیجے گئے ہیں۔ جس طرح دوسرے مقام پر فرمایا «قُلْ يَا أَيُّهَا النَّاسُ إِنِّي رَسُولُ اللَّهِ إِلَيْكُمْ جَمِيعًا» (الأعراف - 158) اور حدیث میں بھی فرمایا «بُعِثْتُ إِلَى الأَحْمَرِ وَالأَسْوَدِ» (صحيح مسلم، كتاب المساجد) «كَانَ النَّبِيُّ يُبْعَثُ إِلَى قَوْمِهِ خَاصَّةً، وَبُعِثْتُ إِلَى النَّاسِ عَامَّةً» (صحيح بخاري، كتاب التيمم ومسلم كتاب المساجد) ”مجھے احمر واسود سب کی طرف نبی بنا کر بھیجا گیا ہے۔ پہلے نبی کسی ایک قوم کی طرف معبوث ہوتا تھا اور میں تمام لوگوں کی طرف نبی بنا کر بھیجا گیا ہوں“۔ رسالت ونبوت کے بعد، توحید کا بیان کیا جا رہا ہے۔ یہاں اللہ کی چار صفات بیان کی گئی ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"tabāraka alladhī nazzala al-fur'qāna ʿalā ʿabdihi liyakūna lil'ʿālamīna nadhīran ","translations":["Blessed is He","Who","sent down","the Criterion","upon","His slave","that he may be","to the worlds","a warner ","(1)"],"transliterationArr":["tabāraka","alladhī","nazzala","al-fur'qāna","ʿalā","ʿabdihi","liyakūna","lil'ʿālamīna","nadhīran",null],"verseTiming":[[1,0,1090],[2,1090,2160],[3,2160,2990],[4,2990,4370],[5,4370,5020],[6,5020,6440],[7,6440,7370],[8,7370,9270],[9,9270,11025]]}}