{"name":"25:22","price":"جس دن یہ فرشتوں کو دیکھ لیں گے اس دن ان گناه گاروں کو کوئی خوشی نہ ہوگی(1) اور کہیں گے یہ محروم ہی محروم کیے گئے.(2)","arabic":"يَوۡمَ يَرَوۡنَ ٱلۡمَلَٰٓئِكَةَ لَا بُشۡرَىٰ يَوۡمَئِذٖ لِّلۡمُجۡرِمِينَ وَيَقُولُونَ حِجۡرٗا مَّحۡجُورٗا","category":["25 (Al-Furqan)","Al-Furqan","Surah Al-Furqan","Chapter Al-Furqan","Furqan","Surah Furqan","Chapter Furqan","Al Furqan","Surah Al Furqan","Chapter Al Furqan","Surah 25","Chapter 25","The Criterion","الفُرقان"],"ayahNumber":2877,"juzNumber":19,"footnotes":"(1) اس دن سے مراد موت کا دن ہے یعنی یہ کافر فرشتوں کو دیکھنے کی آرزو تو کرتے ہیں لیکن موت کے وقت جب یہ فرشتوں کو دیکھیں گے تو ان کے لیے کوئی خوشی اور مسرت نہیں ہوگی، اس لیے کہ فرشتے انہیں اس موقع پر عذاب جہنم کی وعید سناتے ہیں اورکہتے ہیں اے خبیث روح خبیث جسم سےنکل، جسم سے روح دوڑتی اور بھاگتی ہے، جس پر فرشتے اسے مارتے اور کوٹتے ہیں جیسا کہ سورۃ الانفال: 50 سورۃ الانعام:93 میں ہے۔ اس کے برعکس مومن کا حال وقت احتضار (جان کنی کے وقت) یہ ہوتا ہے کہ فرشتے اسے جنت اور اس کی نعمتوں کو نوید جاں فزا سناتے ہیں۔ جیسا کہ سورۂ حم السجدۃ:30۔ 32 میں ہے اور حدیث میں بھی آتا ہے کہ (فرشتے مومن کی روح سے کہتے ہیں، اے پاک روح، جو پاک جسم میں تھی، نکل! اور ایسی جگہ چل جہاں اللہ کی نعمتیں ہیں اور وہ رب ہے جو تجھ سے راضی ہے)۔ (تفصیل کے لیے دیکھیے مسند احمد2 / 364۔ 365 ابن ماجه، كتاب الزهد، باب ذكر الموت) بعض کہتے ہیں کہ اس سے مراد قیامت کاﺩن ہے۔ امام ابن کثیر فرماتے ہیں کہ دونوں ہی قول صحیح ہیں۔ اس لیے کہ دونوں ہی دن ایسے ہیں کہ فرشتے مومن اور کافر دونوں کے سامنے ظاہر ہوتے ہیں۔ مومنوں کو رحمت و رضوان الٰہی کی خوش خبری اور کافروں کو ہلاکت و خسران کی خبر دیتے ہیں۔\n(2) حِجْرٌ کے اصل معنی ہیں منع کرنا، روک دینا۔ جس طرح قاضی کسی کو اس کیے بے وقوفی یا صغر سنی کی وجہ سے اس کے اپنے مال میں تصرف کرنے سے روک دےتو کہتے ہیں حَجَرَ الْقَاضِي عَلَى فُلانٍ کو تصرف کرنے سے روک دیا ہے۔ اسی مفہوم میں خانہ کعبہ کے اس حصے (حطیم) کو حجر کہا جاتا ہے جسے قریش مکہ نے خانہ کعبہ میں شامل نہیں کیا تھا۔ اس لیے طواف کرنے والوں کے لیے اس کے اندر سے طواف کرنا منع ہے۔ طواف کرتے وقت، اس کے بیرونی حصے سے گزرنا چاہیے جسے دیوار سےممتاز کردیاگیا ہے۔ اور عقل کو بھی حجر کہا جاتا ہے، اس لیے کہ عقل بھی انسانوں کو ایسے کاموں سے روکتی ہے جو انسانوں کے لائق نہیں ہیں۔ معنی یہ ہیں کہ فرشتے کافروں کو کہتے ہیں کہ تم ان چیزوں سے محروم ہو جن کی خوش خبری متقین کو دی جاتی ہے۔ یعنی یہ حَرَامًا مُحَرَّمًا عَلَيْكُمْ کے معنی میں ہے۔ آج جنت الفردوس اور اس کی نعمتیں تم پرحرام ہیں، اس کے مستحق صرف اہل ایمان و تقویٰ ہوں گے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yawma yarawna al-malāikata lā bush'rā yawma-idhin lil'muj'rimīna wayaqūlūna ḥij'ran maḥjūran ","translations":["(The) Day","they see","the Angels","no","glad tidings","(will be) that Day","for the criminals","and they will say","A partition","forbidden","(22)"],"transliterationArr":["yawma","yarawna","al-malāikata","lā","bush'rā","yawma-idhin","lil'muj'rimīna","wayaqūlūna","ḥij'ran","maḥjūran",null],"verseTiming":[[1,0,710],[2,710,1470],[3,1470,4500],[4,4500,4850],[5,4850,5680],[6,5680,6800],[7,6800,8600],[8,8600,10100],[9,10100,10840],[10,10840,13585]]}}