{"name":"25:23","price":"اور انہوں نے جو جو اعمال کیے تھے ہم نےان کی طرف بڑھ کر انہیں پراگنده ذروں کی طرح کردیا.(1)","arabic":"وَقَدِمۡنَآ إِلَىٰ مَا عَمِلُواْ مِنۡ عَمَلٖ فَجَعَلۡنَٰهُ هَبَآءٗ مَّنثُورًا","category":["25 (Al-Furqan)","Al-Furqan","Surah Al-Furqan","Chapter Al-Furqan","Furqan","Surah Furqan","Chapter Furqan","Al Furqan","Surah Al Furqan","Chapter Al Furqan","Surah 25","Chapter 25","The Criterion","الفُرقان"],"ayahNumber":2878,"juzNumber":19,"footnotes":"(1) هَبَاءً ان باریک ذروں کو کہتے ہیں جو کسی سوراخ سے گھر کےاندر داخل ہونےوالی سورج کی کرن میں محسوس ہوتے ہیں لیکن اگر کوئی انہیں ہاتھ میں پکڑنا چاہے تو یہ ممکن نہیں ہے۔ کافروں کے عمل بھی قیامت والے دن ان ہی ذروں کی طرح بے حیثیت ہوں گے۔ کیوں کہ وہ ایمان و اخلاص سے بھی خالی ہوں گے اور موافقت شریعت سے بھی عاری۔ جب کہ عنداللہ قبولیت کےلیے دونوں شرطیں ضروری ہیں۔ ایمان و اخلاص بھی اور شریعت اسلامیہ کی مطابقت بھی۔ یہاں کافروں کے اعمال کو جس طرح بے حیثیت ذروں کی مثل کہا گیا ہے۔ اسی طرح دوسرے مقامات پر کہیں راکھ سے، کہیں سراب سے اور کہیں صاف چکنے پتھر سے تعبیر کیاگیا ہے۔ یہ ساری تمثیلات پہلے گزر چکی ہیں ملاحظہ ہو سورۃ البقرۃ: 264، سورۃ ابراہیم: 18 اور سورۃ النور:29۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waqadim'nā ilā mā ʿamilū min ʿamalin fajaʿalnāhu habāan manthūran ","translations":["And We will proceed","to","whatever","they did","of","(the) deed(s)","and We will make them","(as) dust","dispersed","(23)"],"transliterationArr":["waqadim'nā","ilā","mā","ʿamilū","min","ʿamalin","fajaʿalnāhu","habāan","manthūran",null],"verseTiming":[[1,0,2340],[2,2340,2970],[3,2970,3380],[4,3380,4240],[5,4240,4630],[6,4630,5850],[7,5850,7850],[8,7850,10130],[9,10130,13585]]}}