{"name":"25:20","price":"ہم نے آپ سے پہلے جتنے رسول بھیجے سب کے سب کھانا بھی کھاتے تھے(1) اور بازاروں میں بھی چلتے پھرتے تھے(2) اور ہم نے تم میں سے ہر ایک کو دوسرے کی آزمائش کا ذریعہ بنا دیا(3)۔ کیا تم صبر کرو گے؟ تیرا رب سب کچھ دیکھنے واﻻ ہے.(4)","arabic":"وَمَآ أَرۡسَلۡنَا قَبۡلَكَ مِنَ ٱلۡمُرۡسَلِينَ إِلَّآ إِنَّهُمۡ لَيَأۡكُلُونَ ٱلطَّعَامَ وَيَمۡشُونَ فِي ٱلۡأَسۡوَاقِۗ وَجَعَلۡنَا بَعۡضَكُمۡ لِبَعۡضٖ فِتۡنَةً أَتَصۡبِرُونَۗ وَكَانَ رَبُّكَ بَصِيرٗا","category":["25 (Al-Furqan)","Al-Furqan","Surah Al-Furqan","Chapter Al-Furqan","Furqan","Surah Furqan","Chapter Furqan","Al Furqan","Surah Al Furqan","Chapter Al Furqan","Surah 25","Chapter 25","The Criterion","الفُرقان"],"ayahNumber":2875,"juzNumber":18,"footnotes":"(1) یعنی وہ انسان تھے اور غذا کے محتاج۔\n(2) یعنی رزق حلال کی فراہمی کے لئے کسب وتجارت بھی کرتے تھے۔ مطلب اس سے یہ ہے کہ یہ چیزیں منصب نبوت کے منافی نہیں، جس طرح کہ بعض لوگ سمجھتے ہیں۔\n(3) یعنی ہم نے ا ن انبیا کی اور ان کے ذریعے سے ان پر ایمان لانے والوں کی بھی آزمائش کی، تاکہ کھرے کھوٹے کی تمیز ہو جائے، جنہوں نے آزمائش میں صبر کا دامن پکڑے رکھا، وہ کامیاب اور دوسرے ناکام رہے۔ اسی لئے آگے فرمایا (کیا تم صبر کرو گے)؟\n(4) یعنی وہ جانتا ہے کہ وحی ورسالت کا مستحق کون ہے اور کون نہیں؟ «اللَّهُ أَعْلَمُ حَيْثُ يَجْعَلُ رِسَالَتَهُ» (الأنعام: 124) حدیث میں بھی آتا ہے رسول کریم (صلى الله عليه وسلم) نے فرمایا کہ اللہ تعالیٰ نے مجھے اختیار دیا کہ بادشاہ نبی بنوں یا بندہ رسول؟ میں نے بندہ رسول بننا پسند کیا (ابن کثیر)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wamā arsalnā qablaka mina al-mur'salīna illā innahum layakulūna al-ṭaʿāma wayamshūna fī al-aswāqi wajaʿalnā baʿḍakum libaʿḍin fit'natan ataṣbirūna wakāna rabbuka baṣīran ","translations":["And not","We sent","before you","any","Messengers","but","indeed, they","[surely] ate","food","and walked","in","the markets","And We have made","some of you","for others","a trial","will you have patience","And is","your Lord","All-Seer","(20)"],"transliterationArr":["wamā","arsalnā","qablaka","mina","al-mur'salīna","illā","innahum","layakulūna","al-ṭaʿāma","wayamshūna","fī","al-aswāqi","wajaʿalnā","baʿḍakum","libaʿḍin","fit'natan","ataṣbirūna","wakāna","rabbuka","baṣīran",null],"verseTiming":[[1,0,1900],[2,1900,2890],[3,2890,4010],[4,4010,4360],[5,4360,5810],[6,5810,8010],[7,8010,9330],[8,9330,10780],[9,10780,11880],[10,11880,13230],[11,13230,13480],[12,13480,16550],[13,16550,18200],[14,18200,19260],[15,19260,20310],[16,20310,22080],[17,22080,25520],[18,25520,26380],[19,26380,27540],[20,27540,29545]]}}