{"name":"25:32","price":"اور کافروں نے کہا کہ اس پر قرآن سارا کا سارا ایک ساتھ ہی کیوں نہ اتارا گیا(1) اسی طرح ہم نے (تھوڑا تھوڑا کرکے) اتارا تاکہ اس سے ہم آپ کا دل قوی رکھیں، ہم نے اسے ٹھہر ٹھہر کر ہی پڑھ سنایا ہے.(2)","arabic":"وَقَالَ ٱلَّذِينَ كَفَرُواْ لَوۡلَا نُزِّلَ عَلَيۡهِ ٱلۡقُرۡءَانُ جُمۡلَةٗ وَٰحِدَةٗۚ كَذَٰلِكَ لِنُثَبِّتَ بِهِۦ فُؤَادَكَۖ وَرَتَّلۡنَٰهُ تَرۡتِيلٗا","category":["25 (Al-Furqan)","Al-Furqan","Surah Al-Furqan","Chapter Al-Furqan","Furqan","Surah Furqan","Chapter Furqan","Al Furqan","Surah Al Furqan","Chapter Al Furqan","Surah 25","Chapter 25","The Criterion","الفُرقان"],"ayahNumber":2887,"juzNumber":19,"footnotes":"(1) جس طرح تورات، انجیل اور زبور وغیرہ کتابیں بیک مرتبہ نازل ہوئیں۔\n(2) اللہ نے جواب میں فرمایا کہ ہم نے حالات و ضروریات کے مطابق اس قرآن کو 23 سال میں تھوڑ تھوڑا کرکے اتارا تاکہ اے پیغمبر ! تیرا اور اہل ایمان کاﺩل مضبوط ہو اور ان کے خوب ذہن نشین ہوجائے۔ جس طرح دوسرے مقام پر فرمایا: «وَقُرْآنًا فَرَقْنَاهُ لِتَقْرَأَهُ عَلَى النَّاسِ عَلَى مُكْثٍ وَنَـزَّلْنَاهُ تَنْـزِيلا» (سورة بني إسرائيل: 106) ”اور قرآن، اس کو ہم نےجدا جداکیا، تاکہ تو اسے لوگوں پر رک رک کر پڑھے اور ہم نے اس کو وقفے وقفے سے اتارا“ اس قرآن کی مثال بارش کی طرح ہے۔ بارش جب بھی نازل ہوتی ہے،مردہ زمین میں زندگی کی لہر دوڑ جاتی ہے اور یہ فائدہ بالعموم اسی وقت ہوتا ہے جب بارش وقتاً فوقتاً نازل ہو، نہ کہ ایک ہی مرتبہ ساری بارش کے نزول سے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waqāla alladhīna kafarū lawlā nuzzila ʿalayhi al-qur'ānu jum'latan wāḥidatan kadhālika linuthabbita bihi fuādaka warattalnāhu tartīlan ","translations":["And said","those who","disbelieve","Why not","was revealed","to him","the Quran","all at once","all at once","Thus","that We may strengthen","thereby","your heart","and We have recited it","(with distinct) recitation","(32)"],"transliterationArr":["waqāla","alladhīna","kafarū","lawlā","nuzzila","ʿalayhi","al-qur'ānu","jum'latan","wāḥidatan","kadhālika","linuthabbita","bihi","fuādaka","warattalnāhu","tartīlan",null],"verseTiming":[[1,0,840],[2,840,2000],[3,2000,2890],[4,2890,3670],[5,3670,4650],[6,4650,5460],[7,5460,6680],[8,6680,7680],[9,7680,9950],[10,9950,11030],[11,11030,12290],[12,12290,12900],[13,12900,14060],[14,14060,15650],[15,15650,17605]]}}