{"name":"25:43","price":"کیا آپ نے اسے بھی دیکھا جو اپنی خواہش نفس کو اپنا معبود بنائے ہوئے ہے کیا آپ اس کے ذمہدار ہوسکتے ہیں؟(1)","arabic":"أَرَءَيۡتَ مَنِ ٱتَّخَذَ إِلَٰهَهُۥ هَوَىٰهُ أَفَأَنتَ تَكُونُ عَلَيۡهِ وَكِيلًا","category":["25 (Al-Furqan)","Al-Furqan","Surah Al-Furqan","Chapter Al-Furqan","Furqan","Surah Furqan","Chapter Furqan","Al Furqan","Surah Al Furqan","Chapter Al Furqan","Surah 25","Chapter 25","The Criterion","الفُرقان"],"ayahNumber":2898,"juzNumber":19,"footnotes":"(1) یعنی جو چیز اس کے نفس کواچھی لگی، اسی کو اپنا دین و مذہب بنالیا، کیا ایسے شخص کو تو راہ یاب کرسکتا ہے یا اللہ کے عذاب سے چھڑا سکے گا؟ اس کو دوسرے مقام پر اس طرح بیان فرمایا (کیا وہ شخص جس کے لیے اس کا برا عمل مزین کردیا گیا، پس وہ اسے اچھا سمجھتا ہے، پس اللہ تعالیٰ ہی جسے چاہتا ہے گمراہ کرتا ہے اورجسے چاہتا ہے راہ یاب۔ پس تو ان پر حسرت و افسوس نہ کر) (فاطر۔ 8) حضرت ابن عباس (رضي الله عنه) اس کی تفسیر میں فرماتے ہیں۔ زمانۂ جاہلیت میں آدمی ایک عرصےتک سفید پتھر کی عبادت کرتا رہتا، جب اسے اس سے اچھا پتھر نظر آجاتا تو وہ پہلے پتھر کو چھوڑ کر دوسرے پتھر کی پوجا شروع کردیتا (ابن کثیر) مطلب یہ ہے کہ ایسے اشخاص، جو عقل و فہم سے اس طرح عاری اورمحض خواہش نفس کو اپنا معبود بنائے ہوئے ہیں۔ اے پیغمبر کیا تو ان کو ہدایت کےراستے پر لگا سکتا ہے؟ یعنی نہیں لگا سکتا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"ara-ayta mani ittakhadha ilāhahu hawāhu afa-anta takūnu ʿalayhi wakīlan ","translations":["Have you seen","(one) who","takes","(as) his god","his own desire","Then would you","be","over him","a guardian","(43)"],"transliterationArr":["ara-ayta","mani","ittakhadha","ilāhahu","hawāhu","afa-anta","takūnu","ʿalayhi","wakīlan",null],"verseTiming":[[1,0,1100],[2,1100,1610],[3,1610,2380],[4,2380,3690],[5,3690,4530],[6,4530,6140],[7,6140,7120],[8,7120,8010],[9,8010,9665]]}}