{"name":"25:47","price":"اور وہی ہے جس نے رات کو تمہارے لیے پرده بنایا(1) ۔ اور نیند کو راحت بنائی(2)۔ اور دن کو اٹھ کھڑے ہونے کا وقت.(3)","arabic":"وَهُوَ ٱلَّذِي جَعَلَ لَكُمُ ٱلَّيۡلَ لِبَاسٗا وَٱلنَّوۡمَ سُبَاتٗا وَجَعَلَ ٱلنَّهَارَ نُشُورٗا","category":["25 (Al-Furqan)","Al-Furqan","Surah Al-Furqan","Chapter Al-Furqan","Furqan","Surah Furqan","Chapter Furqan","Al Furqan","Surah Al Furqan","Chapter Al Furqan","Surah 25","Chapter 25","The Criterion","الفُرقان"],"ayahNumber":2902,"juzNumber":19,"footnotes":"(1) یعنی لباس، جس طرح لباس انسانی دھانچے کو چھپالیتا ہے، اسی طرح رات تمہیں اپنی تاریکی میں چھپالیتی ہے۔\n(2) سبات کے معنی کاٹنےکے ہوتے ہیں۔ نیند انسان کے جسم کو عمل سے کاﭦ دیتی ہے، جس سےاس کو راحت میسر آتی ہے۔ بعض کےنزدیک سبات کے معنی تمدد پھیلنے کے ہیں۔ نیند میں بھی انسان دراز ہو جاتا ہے، اس لیے اسے سبات کہا (ایسرالتفاسیرو فتح القدیر)۔\n(3) یعنی نیند، جو موت کی بہن ہے، دن کو انسان اس نیند سے بیدار ہو کر کاروبار اور تجارت کے لیےپھراٹھ کھڑا ہوتا ہے۔ حدیث میں آتا ہے کہ نبی (صلى الله عليه وسلم) صبح بیدار ہوتے تو یہ دعا پڑھتے۔ «الْحَمْدِ للهِ الَّذِي أَحْيَانَا بَعْدَمَا أَمَاتَنَا وَإِلَيهِ النُّشُورُ» (رواه البخاري- مشكاة، كتاب الدعوات) ”تمام تعریفیں اس اللہ کے لیے ہیں جس نے ہمیں مارنے کے بعد زندہ کیا اور اسی کی طرف اکٹھے ہونا ہے“۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wahuwa alladhī jaʿala lakumu al-layla libāsan wal-nawma subātan wajaʿala al-nahāra nushūran ","translations":["And He","(is) the One Who","made","for you","the night","(as) a covering","and the sleep","a rest","and made","the day","a resurrection","(47)"],"transliterationArr":["wahuwa","alladhī","jaʿala","lakumu","al-layla","libāsan","wal-nawma","subātan","wajaʿala","al-nahāra","nushūran",null],"verseTiming":[[1,0,650],[2,650,1550],[3,1550,2270],[4,2270,2810],[5,2810,3720],[6,3720,5570],[7,5570,7030],[8,7030,8140],[9,8140,9350],[10,9350,10740],[11,10740,12565]]}}