{"name":"25:70","price":"سوائے ان لوگوں کے جو توبہ کریں اور ایمان ﻻئیں اور نیک کام کریں(1) ، ایسے لوگوں کے گناہوں کو اللہ تعالیٰ نیکیوں سے بدل دیتا ہے(2)، اللہ بخشنے واﻻ مہربانی کرنے واﻻ ہے.","arabic":"إِلَّا مَن تَابَ وَءَامَنَ وَعَمِلَ عَمَلٗا صَٰلِحٗا فَأُوْلَٰٓئِكَ يُبَدِّلُ ٱللَّهُ سَيِّـَٔاتِهِمۡ حَسَنَٰتٖۗ وَكَانَ ٱللَّهُ غَفُورٗا رَّحِيمٗا","category":["25 (Al-Furqan)","Al-Furqan","Surah Al-Furqan","Chapter Al-Furqan","Furqan","Surah Furqan","Chapter Furqan","Al Furqan","Surah Al Furqan","Chapter Al Furqan","Surah 25","Chapter 25","The Criterion","الفُرقان"],"ayahNumber":2925,"juzNumber":19,"footnotes":"(1) اس سے معلوم ہوا کہ دنیا میں خالص توبہ سے ہر گناہ معاف ہوسکتا ہے، چاہے وہ کتنا ہی بڑا ہو۔ اور سورۂ نساء کی آیت 93 میں جو مومن کے قتل کی سزا جہنم بتلائی گئی ہے، تو وہ اس صورت پر محمول ہوگی، جب قاتل نے توبہ نہ کی ہو اور بغیر توبہ کیے ہی فوت ہوگیا ہو۔ ورنہ حدیث میں آتا ہے کہ سو آدمی کے قاتل نےبھی خالص توبہ کی تو اللہ تعالیٰ نے اسے معاف فرمادیا۔ (صحيح مسلم، كتاب التوبة)۔\n(2) اس کے ایک معنی تو یہ ہیں کہ اللہ تعالیٰ اس کا حال تبدیل فرمادیتا ہے، اسلام قبول کرنے سے پہلے وہ برائیاں کرتا تھا، اب نیکیاں کرتا ہے، پہلے شرک کرتا تھا، اب صرف الہٰ واحد کی عبادت کرتا ہے، پہلےکافروں کےساتھ مل کرمسلمانوں سے لڑتاتھا، اب مسلمانوں کی طرف سے کافروں سے لڑتا ہے۔ وغیرہ وغیرہ دوسرے معنی ہیں کہ اس کی برائیوں کو نیکیوں میں بدل دیا جاتا ہے۔ اس کی تائید حدیث سے بھی ہوتی ہے۔ رسول اللہ (صلى الله عليه وسلم) نے فرمایا ”میں اس شخص کو جانتا ہوں، جو سب سے آخر میں جنت میں داخل ہونے والا اور سب سے آخر میں جہنم سے نکلنے والا ہوگا۔ یہ وہ آدمی ہوگا کہ قیامت کےدن اس پر اس کے چھوٹے چھوٹے گناہ پیش کیے جائیں گے، بڑے گناہ ایک طرف رکھ دیئے جائیں گے۔ اس کو کہا جائے گا کہ تو نے فلاں فلاں دن فلاں فلاں کام کیا تھا؟ وہ اثبات میں جواب دے گا، انکار کی اسے طاقت نہ ہوگی، علاوہ ازیں اس بات سے بھی ڈر رہا ہوگا کہ ابھی تو بڑے گناہ بھی پیش کیے جائیں گے۔ کہ اتنے میں اس سے کہا جائے گا کہ جا، تیرے لیے ہر برائی کے بدلے ایک نیکی ہے۔ اللہ کی یہ مہربانی دیکھ کر وہ کہے گا، کہ ابھی تو میرے بہت سےاعمال ایسے ہیں کہ میں انہیں یہاں نہیں دیکھ رہا، یہ بیان کرکے رسول اللہ (صلى الله عليه وسلم) ہنس پڑے، یہاں تک کہ آپ (صلى الله عليه وسلم) کےدانت ظاہر ہوگئے“ (صحيح مسلم كتاب الإيمان ، باب أدنى أهل الجنة منزلة فيها)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"illā man tāba waāmana waʿamila ʿamalan ṣāliḥan fa-ulāika yubaddilu al-lahu sayyiātihim ḥasanātin wakāna al-lahu ghafūran raḥīman ","translations":["Except","(he) who","repents","and believes","and does","righteous deeds","righteous deeds","then (for) those","Allah will replace","Allah will replace","their evil deeds","(with) good ones","And is","Allah","Oft-Forgiving","Most Merciful","(70)"],"transliterationArr":["illā","man","tāba","waāmana","waʿamila","ʿamalan","ṣāliḥan","fa-ulāika","yubaddilu","al-lahu","sayyiātihim","ḥasanātin","wakāna","al-lahu","ghafūran","raḥīman",null],"verseTiming":[[1,0,960],[2,960,1890],[3,1890,2910],[4,2910,4030],[5,4030,4880],[6,4880,6460],[7,6460,7560],[8,7560,11770],[9,11770,14450],[10,14450,15510],[11,15510,16420],[12,16420,18300],[13,18300,19080],[14,19080,21240],[15,21240,21360],[16,21360,22670],[17,22670,23710],[18,23710,24600],[19,24600,26375]]}}