{"name":"26:166","price":"اور تمہاری جن عورتوں کو اللہ تعالیٰ نے تمہارا جوڑا بنایا ہے ان کو چھوڑ دیتے ہو(1) ، بلکہ تم ہو ہی حد سے گزر جانے والے.(2)","arabic":"وَتَذَرُونَ مَا خَلَقَ لَكُمۡ رَبُّكُم مِّنۡ أَزۡوَٰجِكُمۚ بَلۡ أَنتُمۡ قَوۡمٌ عَادُونَ","category":["26 (Ash-Shu'ara)","Ash-Shu'ara","Surah Ash-Shu'ara","Chapter Ash-Shu'ara","Shu'ara","Surah Shu'ara","Chapter Shu'ara","Ash Shu'ara","Surah Ash Shu'ara","Chapter Ash Shu'ara","Surah 26","Chapter 26","The Poets","الشُّعَرَاء"],"ayahNumber":3098,"juzNumber":19,"footnotes":"(1) یہ قوم لوط کی سب سے بری عادت تھی، جس کی ابتدا اسی قوم سے ہوئی تھی، اسی لیے اس فعل بد کو لواطت سے تعبیر کیا جاتا ہے یعنی وہ بدفعلی جس کا آغاز قوم لوط سے ہوا لیکن اب یہ بدفعلی پوری دنیا میں عام ہے بلکہ یورپ میں تو اسے قانوناً جائز تسلیم کرلیاگیا ہے یعنی ان کے ہاں اب یہ سرے سے گناہ ہی نہیں ہے۔ جس قوم کا مزاج اتنا بگڑ گیا ہو کہ مرد و عورت کا ناجائز جنسی ملاپ (بشرطیکہ باہمی رضا مندی سے ہو) ان کے نزدیک جرم نہ ہو، تو وہاں دو مردوں کا آپس میں بدفعلی کرنی کیونکر گناہ اور ناجائز ہوسکتا ہے؟ أَعَاذَنَا اللهُ مِنْهُ۔\n(2) عَادُونَ، عاد کی جمع ہے۔ عربی میں عاد کے معنی ہیں حد سے تجاوز کرنے والا۔ یعنی حق کو چھوڑ کر باطل کو اور حلال کو چھوڑ کر حرام کو اختیار کرنے والا۔ اللہ تعالیٰ نے نکاح شرعی کے ذریعے سے عورت کی فرج سے اپنی جنسی خواہش کی تسکین کو حلال قرار دیا ہے اور اس کام کے لیے مرد کی دبر کو حرام۔ قوم لوط نے عورتوں کی شرم گاہوں کو چھوڑ کر مردوں کی دبر اس کام کے لیے استعمال کی اور یوں اس نے اس حد سے تجاوز کیا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"watadharūna mā khalaqa lakum rabbukum min azwājikum bal antum qawmun ʿādūna ","translations":["And you leave","what","created","for you","your Lord","of","your mates","Nay","you","(are) a people","transgressing","(166)"],"transliterationArr":["watadharūna","mā","khalaqa","lakum","rabbukum","min","azwājikum","bal","antum","qawmun","ʿādūna",null],"verseTiming":[[1,0,1330],[2,1330,1610],[3,1610,2340],[4,2340,2920],[5,2920,4220],[6,4220,5270],[7,5270,7260],[8,7260,7660],[9,7660,9210],[10,9210,10060],[11,10060,13005]]}}