{"name":"26:214","price":"اپنے قریبی رشتہ والوں کو ڈرا دے.(1)","arabic":"وَأَنذِرۡ عَشِيرَتَكَ ٱلۡأَقۡرَبِينَ","category":["26 (Ash-Shu'ara)","Ash-Shu'ara","Surah Ash-Shu'ara","Chapter Ash-Shu'ara","Shu'ara","Surah Shu'ara","Chapter Shu'ara","Ash Shu'ara","Surah Ash Shu'ara","Chapter Ash Shu'ara","Surah 26","Chapter 26","The Poets","الشُّعَرَاء"],"ayahNumber":3146,"juzNumber":19,"footnotes":"(1) پیغمبر کی دعوت صرف رشتے داروں کے لیے نہیں، بلکہ پوری قوم کے لیے ہوتی ہے اور نبی (صلى الله عليه وسلم) تو پوری نسل انسانی کے لیے ہادی اور رہبر بن کر آئے تھے۔ قریبی رشتے داروں کو دعوت ایمان، دعوت عام کے منافی نہیں، بلکہ اسی کا ایک حصہ یا اس کا ایک ترجیحی پہلو ہے۔ جس طرح حضرت ابراہیم (عليه السلام) نے بھی سب سے پہلے اپنے باپ آزر کو توحید کی دعوت دی تھی۔ اس حکم کےبعد نبی (صلى الله عليه وسلم) صفاپہاڑی پر چڑھ گئے اور يَا صَبَاحَاهُ کہہ کر آواز دی۔ یہ کلمہ اس وقت بولا جاتا ہے جب دشمن اچانک حملہ کردے، اس کے ذریعے سے قوم کو خبردار کیا جاتا ہے۔ یہ کلمہ سن کر لوگ جمع ہوگئے، آپ نے قریش کے مختلف قبیلوں کے نام لے لے کر فرمایا، بتلاؤ اگر میں تمہیں یہ کہوں کہ اس پہاڑ کی پشت پر دشمن کا لشکر موجود ہے جو تم پر حملہ آور ہواچاہتا ہے، تو کیا تم مانو گے؟ سب نےکہا ہاں، یقیناً ہم تصدیق کریں گے۔ آپ (صلى الله عليه وسلم) نے فرمایا کہ مجھے اللہ نے نذیربنا کربھیجا ہے، میں تمہیں ایک سخت عذاب سے ڈراتا ہوں، اس پر ابو لہب نے کہا تَبًّا لَكَ أَمَا دَعَوْتَنَا إِلا لِهَذَا ”تیرے لیے ہلاکت ہو، کیا تو نے ہمیں اسی لیے بلایا تھا؟“ اس کے جواب میں سورۂ تبت نازل ہوئی (صحيح بخاري، تفسير سورة المسد) آپ (صلى الله عليه وسلم) نے اپنی بیٹی فاطمہ (رضی الله عنها) اور اپنی پھوپھی حضرت صفیہ (رضی الله عنها) کو بھی فرمایا، تم اللہ کے ہاں بچاؤ کا بندوبست کر لو، میں وہاں تمہارے کام نہیں آسکوں گا (صحيح مسلم كتاب الإيمان، باب وأنذر عشيرتك الأقربين)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-andhir ʿashīrataka al-aqrabīna ","translations":["And warn","your kindred","[the] closest","(214)"],"transliterationArr":["wa-andhir","ʿashīrataka","al-aqrabīna",null],"verseTiming":[[1,0,1900],[2,1900,3120],[3,3120,6895]]}}