{"name":"26:227","price":"سوائے ان کے جو ایمان ﻻئے(1) اور نیک عمل کیے اور بکثرت اللہ تعالیٰ کا ذکر کیا اور اپنی مظلومی کے بعد انتقام لیا(2)، جنہوں نے ﻇلم کیا ہے وه بھی عنقریب جان لیں گے کہ کس کروٹ الٹتے ہیں.(3)","arabic":"إِلَّا ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ وَذَكَرُواْ ٱللَّهَ كَثِيرٗا وَٱنتَصَرُواْ مِنۢ بَعۡدِ مَا ظُلِمُواْۗ وَسَيَعۡلَمُ ٱلَّذِينَ ظَلَمُوٓاْ أَيَّ مُنقَلَبٖ يَنقَلِبُونَ","category":["26 (Ash-Shu'ara)","Ash-Shu'ara","Surah Ash-Shu'ara","Chapter Ash-Shu'ara","Shu'ara","Surah Shu'ara","Chapter Shu'ara","Ash Shu'ara","Surah Ash Shu'ara","Chapter Ash Shu'ara","Surah 26","Chapter 26","The Poets","الشُّعَرَاء"],"ayahNumber":3159,"juzNumber":19,"footnotes":"(1) اس سے ان شاعروں کو مستثنیٰ فرما دیا گیا، جن کی شاعری صداقت اور حقائق پر مبنی ہے اور استثنا ایسے الفاظ سے فرمایا جن سے واضح ہو جاتا ہے کہ مومن، عمل صالح پر کاربند اور کثرت سے اللہ کا ذکر کرنے والا شاعر غلط شاعری، جس میں جھوٹ، غلو اور افراط و تفریط ہو، کر ہی نہیں سکتا۔ یہ ان ہی لوگوں کا کام ہے جو مومنانہ صفات سےعاری ہوں۔\n(2) یعنی ایسے مومن شاعر، ان کافر شعراء کا جواب دیتے ہیں، جس میں انہوں نے مسلمانوں کی ہجو (برائی) کی ہو۔ جس طرح حضرت حسان بن ثابت (رضي الله عنه) کافروں کی ہجویہ شاعری کا جواب دیا کرتے تھے اور خود نبی (صلى الله عليه وسلم) ان کو فرماتے کہ ”ان (کافروں) کی ہجو بیان کرو، جبرائیل (عليه السلام) بھی تمہارے ساتھ ہیں“۔ (صحيح بخاري، كتاب بدء الخلق، باب ذكر الملائكة، مسلم، فضائل حسان بن ثابت) اس سے معلوم ہوا کہ ایسی شاعری جائز ہے جس میں کذب و مبالغہ نہ ہو اور جس کے ذریعے سے مشرکین و کفار اور مبتدعین و اہل باطل کو جواب دیاجائے اور مسلک حق اور توحید و سنت کا اثبات کیاجائے۔\n(3) یعنی أَيَّ مَرْجَع يَرْجِعُونَ یعنی کون سی جگہ وہ لوٹتے ہیں؟ اور وہ جہنم ہے۔ اس میں ظالموں کے لیے سخت وعید ہے۔ جس طرح حدیث میں بھی فرمایا گیا ہے ”تم ظلم سے بچو! اس لیے کہ ظلم قیامت والے دن اندھیروں کا باعث ہوگا“۔ (صحيح مسلم، كتاب البر، باب تحريم الظلم)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"illā alladhīna āmanū waʿamilū al-ṣāliḥāti wadhakarū al-laha kathīran wa-intaṣarū min baʿdi mā ẓulimū wasayaʿlamu alladhīna ẓalamū ayya munqalabin yanqalibūna ","translations":["Except","those who","believe","and do","righteous deeds","and remember","Allah","much","and defend themselves","after","after","after","they were wronged","And will come to know","those who","have wronged","(to) what","return","they will return","(227)"],"transliterationArr":["illā","alladhīna","āmanū","waʿamilū","al-ṣāliḥāti","wadhakarū","al-laha","kathīran","wa-intaṣarū","min","baʿdi","mā","ẓulimū","wasayaʿlamu","alladhīna","ẓalamū","ayya","munqalabin","yanqalibūna",null],"verseTiming":[[1,0,600],[2,600,1610],[3,1610,2910],[4,2910,3680],[5,3680,5250],[6,5250,6130],[7,6130,6970],[8,6970,9040],[9,9040,10740],[10,10740,11770],[11,11770,12430],[12,12430,12740],[13,12740,13910],[14,13910,15700],[15,15700,16670],[16,16670,19200],[17,19200,19740],[18,19740,23440],[19,23440,27505]]}}