{"name":"26:49","price":"فرعون نے کہا کہ میری اجازت سے پہلے تم اس پر ایمان لے آئے؟ یقیناً یہی تمہارا وه بڑا (سردار) ہے جس نے تم سب کو جادو سکھایا ہے(1) ، سو تمہیں ابھی ابھی معلوم ہوجائے گا، قسم ہے میں ابھی تمہارے ہاتھ پاؤں الٹے طور پر کاٹ دوں گا اور تم سب کو سولی پر لٹکا دوں گا.(2)","arabic":"قَالَ ءَامَنتُمۡ لَهُۥ قَبۡلَ أَنۡ ءَاذَنَ لَكُمۡۖ إِنَّهُۥ لَكَبِيرُكُمُ ٱلَّذِي عَلَّمَكُمُ ٱلسِّحۡرَ فَلَسَوۡفَ تَعۡلَمُونَۚ لَأُقَطِّعَنَّ أَيۡدِيَكُمۡ وَأَرۡجُلَكُم مِّنۡ خِلَٰفٖ وَلَأُصَلِّبَنَّكُمۡ أَجۡمَعِينَ","category":["26 (Ash-Shu'ara)","Ash-Shu'ara","Surah Ash-Shu'ara","Chapter Ash-Shu'ara","Shu'ara","Surah Shu'ara","Chapter Shu'ara","Ash Shu'ara","Surah Ash Shu'ara","Chapter Ash Shu'ara","Surah 26","Chapter 26","The Poets","الشُّعَرَاء"],"ayahNumber":2981,"juzNumber":19,"footnotes":"(1) فرعون کے لیے یہ واقعہ بڑا عجیب اور نہایت حیرت ناک تھا کہ جن جادوگروں کے ذریعے سے وہ فتح و غلبے کی آس لگائے بیٹھا تھا، وہی نہ صرف مغلوب ہوگئے بلکہ موقع پر ہی وہ اس رب پر ایمان لے آئے، جس نے حضرت موسیٰ و ہارون علیہما السلام کو دلائل و معجزات دے کر بھیجا تھا۔ لیکن بجائے اس کے کہ فرعون بھی غوروفکر سےکام لیتا اور ایمان لاتا، اس نے مکابرہ اور عناد کا راستہ اختیار کیا اور جادوگروں کو ڈرانا دھمکانا شروع کردیا اورکہاکہ تم سب اسی کے شاگرد لگتے ہو اورتمہارا مقصد یہ معلوم ہوتا ہے کہ اس سازش کے ذریعے سے تم ہمیں یہاں سے بے دخل کردو، «إِنَّ هَذَا لَمَكْرٌ مَكَرْتُمُوهُ فِي الْمَدِينَةِ لِتُخْرِجُوا مِنْهَا أَهْلَهَا» (الأعراف: 123) ۔\n(2) الٹے طور پر ہاتھ پاؤں کاٹنے کا مطلب، دایاں ہاتھ اور بایاں پیر یا بایاں ہاتھ اور دایاں پیر ہے۔ اس پر سولی مستزاد۔ یعنی ہاتھ پیر کاٹنے سے بھی اس کی آتش غضب ٹھنڈی نہ ہوئی، مزید اس نے سولی پر لٹکانے کا اعلان کیا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qāla āmantum lahu qabla an ādhana lakum innahu lakabīrukumu alladhī ʿallamakumu al-siḥ'ra falasawfa taʿlamūna la-uqaṭṭiʿanna aydiyakum wa-arjulakum min khilāfin wala-uṣallibannakum ajmaʿīna ","translations":["He said","You believed","in him","before","[that]","I gave permission","to you","Indeed, he","(is) surely your chief","who","has taught you","the magic","so surely soon","you will know","I will surely cut off","your hands","and your feet","of","opposite sides","and I will surely crucify you","all","(49)"],"transliterationArr":["qāla","āmantum","lahu","qabla","an","ādhana","lakum","innahu","lakabīrukumu","alladhī","ʿallamakumu","al-siḥ'ra","falasawfa","taʿlamūna","la-uqaṭṭiʿanna","aydiyakum","wa-arjulakum","min","khilāfin","wala-uṣallibannakum","ajmaʿīna",null],"verseTiming":[[1,0,730],[2,730,2730],[3,2730,3290],[4,3290,4020],[5,4020,4340],[6,4340,5190],[7,5190,6330],[8,6330,7980],[9,7980,9570],[10,9570,10510],[11,10510,11750],[12,11750,12640],[13,12640,13640],[14,13640,16250],[15,16250,18610],[16,18610,19930],[17,19930,21700],[18,21700,22560],[19,22560,23720],[20,23720,27250],[21,27250,29885]]}}