{"name":"26:44","price":"انہوں نے اپنی رسیاں اور ﻻٹھیاں ڈال دیں اور کہنے لگے عزت فرعون کی قسم! ہم یقیناً غالب ہی رہیں گے.(1)","arabic":"فَأَلۡقَوۡاْ حِبَالَهُمۡ وَعِصِيَّهُمۡ وَقَالُواْ بِعِزَّةِ فِرۡعَوۡنَ إِنَّا لَنَحۡنُ ٱلۡغَٰلِبُونَ","category":["26 (Ash-Shu'ara)","Ash-Shu'ara","Surah Ash-Shu'ara","Chapter Ash-Shu'ara","Shu'ara","Surah Shu'ara","Chapter Shu'ara","Ash Shu'ara","Surah Ash Shu'ara","Chapter Ash Shu'ara","Surah 26","Chapter 26","The Poets","الشُّعَرَاء"],"ayahNumber":2976,"juzNumber":19,"footnotes":"(1) جیسا کہ سورۂ اعراف اور طٰہ میں گزرا کہ ان جادوگروں نے اپنے خیال میں بہت بڑا جادو پیش کیا «سَحَرُوا أَعْيُنَ النَّاسِ وَاسْتَرْهَبُوهُمْ وَجَاءُوا بِسِحْرٍ عَظِيمٍ» (سورة الأعراف۔:116) حتیٰ کہ حضرت موسیٰ (عليه السلام) نے بھی اپنے دل میں خوف محسوس کیا، «فَأَوْجَسَ فِي نَفْسِهِ خِيفَةً مُوسَى» (طه۔ 67) چنانچہ ان جادوگروں کو اپنی کامیابی اور برتری کابڑا یقین تھا، جیسا کہ یہاں ان الفاظ سے ظاہر ہے لیکن اللہ تعالیٰ نے حضرت موسیٰ (عليه السلام) کو تسلی دی، کہ گھبرانے کی ضرورت نہیں ہے۔ ذرا اپنی لاٹھی زمین پر پھینکو اور پھر دیکھو۔ چنانچہ لاٹھی کا زمین پر پھینکنا تھا کہ اس نے ایک خوفناک اژدھے کی شکل اختیار کرلی اور ایک ایک کرکے ان کے سارے کرتبوں کو وہ نگل گیا۔ جیسا کہ اگلی آیت میں ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"fa-alqaw ḥibālahum waʿiṣiyyahum waqālū biʿizzati fir'ʿawna innā lanaḥnu al-ghālibūna ","translations":["So they threw","their ropes","and their staffs","and said","By the might","(of) Firaun","indeed, we","surely, we","(are) the victorious","(44)"],"transliterationArr":["fa-alqaw","ḥibālahum","waʿiṣiyyahum","waqālū","biʿizzati","fir'ʿawna","innā","lanaḥnu","al-ghālibūna",null],"verseTiming":[[1,0,1090],[2,1090,2410],[3,2410,3940],[4,3940,4950],[5,4950,6040],[6,6040,7120],[7,7120,8710],[8,8710,9520],[9,9520,12595]]}}