{"name":"26:59","price":"اسی طرح ہوا اور ہم نےان (تمام) چیزوں کا وارث بنی اسرائیل کو بنا دیا.(1)","arabic":"كَذَٰلِكَۖ وَأَوۡرَثۡنَٰهَا بَنِيٓ إِسۡرَٰٓءِيلَ","category":["26 (Ash-Shu'ara)","Ash-Shu'ara","Surah Ash-Shu'ara","Chapter Ash-Shu'ara","Shu'ara","Surah Shu'ara","Chapter Shu'ara","Ash Shu'ara","Surah Ash Shu'ara","Chapter Ash Shu'ara","Surah 26","Chapter 26","The Poets","الشُّعَرَاء"],"ayahNumber":2991,"juzNumber":19,"footnotes":"(1) یعنی جو اقتدار اوربادشاہت فرعون کو حاصل تھی، وہ اس سے چھین کر ہم نےبنی اسرائیل کو عطا کردی۔ بعض کہتے ہیں کہ اس سے مراد مصر جیسا اقتدار اور دنیوی جاہ و جلال ہم نے بنی اسرائیل کو بھی عطاکیا۔ کیوں کہ بنی اسرائیل، مصر سے نکل جانے کے بعد مصر واپس نہیں آئے۔ نیز سورۂ دخان میں فرمایا گیا ہے«وَأَوْرَثْنَاهَا قَوْمًا آخَرِينَ» کہ ”ہم نے اس کا وارث کسی دوسری قوم کو بنایا“ (ایسر التفاسیر) اول الذکر اہل علم کہتے ہیں کہ قوما آخرين میں قوم کا لفظ اگرچہ عام ہے لیکن یہاں سورۂ شعراء میں جب بنی اسرائیل کو وارث بنانےکی صراحت آگئی ہے، تو اس سے مراد بھی قوم بنی اسرائیل ہی ہوگی۔ مگر خود قرآن کی صراحت کے مطابق مصر سے نکلنے کے بعد بنو اسرائیل کو ارض مقدس میں داخل ہونےکا حکم دیا گیا۔ اور ان کےانکار پر چالیس سال کے لیے یہ داخلہ موخر کرکے میدان تیہ میں بھٹکایا گیا۔ پھر وہ ارض مقدس میں داخل ہوئے چنانچہ حضرت موسیٰ (عليه السلام) کی قبر، حدیث اسراء کے مطابق بیت المقدس کے قریب ہی ہے۔ اس لیے صحیح معنی یہی ہے کہ جیسی نعمتیں آل فرعون کو مصر میں حاصل تھیں، ویسی ہی نعمتیں اب بنو اسرائیل کو عطا کی گئیں۔ لیکن مصر میں نہیں بلکہ فلسطین میں، وَاللهُ أَعْلَمُ۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"kadhālika wa-awrathnāhā banī is'rāīla ","translations":["Thus","And We caused to inherit them","(the) Children of Israel","(the) Children of Israel","(59)"],"transliterationArr":["kadhālika","wa-awrathnāhā","banī","is'rāīla",null],"verseTiming":[[1,0,1490],[2,1490,3380],[3,3380,5360],[4,5360,9865]]}}