{"name":"27:17","price":"سلیمان کے سامنے ان کے تمام لشکر جنات اور انسان اور پرند میں سے جمع کیے گئے(1) (ہر ہر قسم کی) الگ الگ درجہ بندی کردی گئی.(2)","arabic":"وَحُشِرَ لِسُلَيۡمَٰنَ جُنُودُهُۥ مِنَ ٱلۡجِنِّ وَٱلۡإِنسِ وَٱلطَّيۡرِ فَهُمۡ يُوزَعُونَ","category":["27 (An-Naml)","An-Naml","Surah An-Naml","Chapter An-Naml","Naml","Surah Naml","Chapter Naml","An Naml","Surah An Naml","Chapter An Naml","Surah 27","Chapter 27","The Ant","النَّمْل"],"ayahNumber":3176,"juzNumber":19,"footnotes":"(1) اس میں حضرت سلیمان (عليه السلام) کی اس انفرادی خصوصیت و فضیلت کاذکر ہے، جس میں وہ پوری تاریخ انسانیت میں ممتاز ہیں کہ ان کی حکمرانی صرف انسانوں پر ہی نہیں بلکہ جنات، حیوانات اور چرند و پرند حتیٰ کہ ہوا تک ان کے ماتحت تھی، اس میں کہا گیا ہے کہ سلیمان (عليه السلام) کے تمام لشکر یعنی جنوں، انسانوں اور پرندوں سب کو جمع کیاگیا۔ یعنی کہیں جانے کے لیے یہ لاؤ لشکر جمع کیاگیا۔\n(2) یہ ترجمہ (توزیع بمعنی تفریق) کےاعتبار سے ہے۔ یعنی سب کو الگ الگ گروہوں میں تقسیم (قسم وار) کردیا جاتا تھا، مثلاً انسانوں، جنوں کا گروہ، پرندوں اور حیوانات کے گروہ۔ وغیرہ وغیرہ۔ دوسرے معنی اس کے (پس وہ روکے جایا کرتے تھے) یعنی یہ لشکر اتنی بڑی تعداد میں ہوتا تھا کہ راستے میں روک روک کر ان کو درست کیا جاتا تھا کہ شاہی لشکر بدنظمی اور انتشار کا شکار نہ ہو یہ وَزَعَ يَزَعُ سے ہے، جس کے معنی روکنے کے ہیں۔ اسی مادے میں ہمزۂ سلب کا اضافہ کرکے أَوْزِعْنِي بنایا گیا ہے۔ جو اگلی آیت نمبر 19 میں آرہا ہے یعنی ایسی چیزیں مجھ سے دور فرمادے، جو مجھے تیری نعمتوں پر تیرا شکر کرنے سے روکتی ہیں۔ اس کو اردو میں ہم الہام و توفیق سے تعبیر کر لیتے ہیں۔ (فتح القدیر، ایسرالتفاسیر وابن کثیر)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waḥushira lisulaymāna junūduhu mina al-jini wal-insi wal-ṭayri fahum yūzaʿūna ","translations":["And were gathered","for Sulaiman","his hosts","of","jinn","and the men","and the birds","and they","(were) set in rows","(17)"],"transliterationArr":["waḥushira","lisulaymāna","junūduhu","mina","al-jini","wal-insi","wal-ṭayri","fahum","yūzaʿūna",null],"verseTiming":[[1,0,970],[2,970,2280],[3,2280,3650],[4,3650,4010],[5,4010,5410],[6,5410,7250],[7,7250,8240],[8,8240,8920],[9,8920,11965]]}}