{"name":"27:15","price":"اور ہم نے یقیناً داؤد اور سلیمان کو علم دے رکھا تھا(1) ۔ اور دونوں نے کہا، تعریف اس اللہ کے لیے ہے جس نے ہمیں اپنے بہت سے ایماندار بندوں پر فضیلت عطا فرمائی ہے.","arabic":"وَلَقَدۡ ءَاتَيۡنَا دَاوُۥدَ وَسُلَيۡمَٰنَ عِلۡمٗاۖ وَقَالَا ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِي فَضَّلَنَا عَلَىٰ كَثِيرٖ مِّنۡ عِبَادِهِ ٱلۡمُؤۡمِنِينَ","category":["27 (An-Naml)","An-Naml","Surah An-Naml","Chapter An-Naml","Naml","Surah Naml","Chapter Naml","An Naml","Surah An Naml","Chapter An Naml","Surah 27","Chapter 27","The Ant","النَّمْل"],"ayahNumber":3174,"juzNumber":19,"footnotes":"(1) سورت کے شروع میں فرمایا گیا تھا کہ یہ قرآن اللہ کی طرف سے سکھلایا جاتا ہے، اس کی دلیل کے طور پر حضرت موسیٰ (عليه السلام) کا قصہ مختصراً بیان فرمایا اور اب دوسری دلیل حضرت داود (عليه السلام) وسلیمان (عليه السلام) کا یہ قصہ ہے۔ انبیا علیہم السلام کے یہ واقعات اس بات کی دلیل ہیں کہ حضرت محمد (صلى الله عليه وسلم) اللہ کے سچے رسول ہیں۔ علم سے مراد نبوت کے علم کے علاوہ وہ علم ہے جن سے حضرت حضرت داود (عليه السلام) اور سلیمان (عليه السلام) کو بطور خاص نوازا گیا تھا جیسے حضرت داود (صلى الله عليه وسلم) کو لوہے کی صنعت کاعلم اور حضرت سلیمان (عليه السلام) کو جانورون کی بولیوں کا علم عطا کیاگیا تھا۔ ان دونوں باپ بیٹوں کو اور بھی بہت کچھ عطا کیا گیا تھا، لیکن یہاں صرف علم کا ذکر کیاگیا ہے، جس سے واضح ہوتا ہےکہ علم اللہ کی سب سے بڑی نعمت ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walaqad ātaynā dāwūda wasulaymāna ʿil'man waqālā al-ḥamdu lillahi alladhī faḍḍalanā ʿalā kathīrin min ʿibādihi al-mu'minīna ","translations":["And verily","We gave","Dawood","and Sulaiman","knowledge","and they said","Praise be","to Allah","the One Who","has favored us","over","many","of","His servants","the believers","(15)"],"transliterationArr":["walaqad","ātaynā","dāwūda","wasulaymāna","ʿil'man","waqālā","al-ḥamdu","lillahi","alladhī","faḍḍalanā","ʿalā","kathīrin","min","ʿibādihi","al-mu'minīna",null],"verseTiming":[[1,0,740],[2,740,2050],[3,2050,3090],[4,3090,4470],[5,4470,5790],[6,5790,6580],[7,6580,7420],[8,7420,8440],[9,8440,9280],[10,9280,10480],[11,10480,11130],[12,11130,12000],[13,12000,13290],[14,13290,14410],[15,14410,17085]]}}