{"name":"27:44","price":"اس سے کہا گیا کہ محل میں چلی چلو، جسے دیکھ کر یہ سمجھ کر کہ یہ حوض ہے اس نے اپنی پنڈلیاں کھول دیں(1) ، فرمایا یہ توشیشے سے منڈھی ہوئی عمارت ہے، کہنے لگی میرے پروردگار! میں نے اپنے آپ پر ﻇلم کیا۔ اب میں سلیمان کے ساتھ اللہ رب العالمین کی مطیع اور فرمانبردار بنتی ہوں.(2)","arabic":"قِيلَ لَهَا ٱدۡخُلِي ٱلصَّرۡحَۖ فَلَمَّا رَأَتۡهُ حَسِبَتۡهُ لُجَّةٗ وَكَشَفَتۡ عَن سَاقَيۡهَاۚ قَالَ إِنَّهُۥ صَرۡحٞ مُّمَرَّدٞ مِّن قَوَارِيرَۗ قَالَتۡ رَبِّ إِنِّي ظَلَمۡتُ نَفۡسِي وَأَسۡلَمۡتُ مَعَ سُلَيۡمَٰنَ لِلَّهِ رَبِّ ٱلۡعَٰلَمِينَ","category":["27 (An-Naml)","An-Naml","Surah An-Naml","Chapter An-Naml","Naml","Surah Naml","Chapter Naml","An Naml","Surah An Naml","Chapter An Naml","Surah 27","Chapter 27","The Ant","النَّمْل"],"ayahNumber":3203,"juzNumber":19,"footnotes":"(1) یہ محل شیشے کا بنا ہوا تھا جس کا صحن اور فرش بھی شیشے کا تھا۔ لُجَّةً گہرے پانی یا حوض کو کہتے ہیں۔ حضرت سلیمان (عليه السلام) نے اپنی نبوت کے اعجازی مظاہر دکھانے کے بعد مناسب سمجھا کہ اسے اپنی اس دنیوی شان و شوکت کی بھی ایک جھلک دکھلادی جائے جس میں اللہ نے انہیں تاریخ انسانیت میں ممتاز کیا تھا۔ چنانچہ اس محل میں داخل ہونے کا حکم دیا گیا، جب وہ داخل ہونے لگی تو اس نے اپنے پائنچے چڑھالیے۔ شیشے کافرش اسے پانی معلوم ہوا جس سے اپنے کپڑوں کو بچانے کے لیے اس نے کپڑے سمیٹ لیے۔\n(2) یعنی جب اس پر فرش کی حقیقت واضح ہوئی تو اپنی کوتاہی اور غلطی کا بھی احساس ہوگیا اور اعتراف قصور کرتے ہوئے مسلمان ہونے کا اعلان کردیا۔ صاف چکنے گھڑے ہوئے پتھروں کو مُمَرَّدٌ کہا جاتا ہے۔ اسی سے امرد ہے جو اس خوش شکل بچے کو کہا جاتا ہے جس کے چہرے پر ابھی داڑھی مونچھ نہ ہو۔ جس درخت پر پتے نہ ہوں اسے شجرۃ مرداء کہا جاتا ہے۔ (فتح القدیر) لیکن یہاں یہ تعبیر یا جڑاؤ کےمعنی میں ہے۔ یعنی شیشوں کا بنا ہوا یا جڑا ہوا محل۔\nملحوظة: ملکۂ سبا (بلقیس) کے مسلمان ہونے کے بعد کیا ہوا؟ قرآن میں یا کسی صحیح حدیث میں اس کی تفصیل نہیں ملتی۔ تفسیری روایات میں یہ ضرور ملتا ہے کہ ان کا باہم نکاح ہوگیا تھا۔ لیکن قرآن و حدیث اس صراحت سے خاموش ہیں تو اس کی بابت خاموشی ہی بہتر ہے۔ وَاللهُ أَعْلَمُ بِالصَّوَابِ۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qīla lahā ud'khulī al-ṣarḥa falammā ra-athu ḥasibathu lujjatan wakashafat ʿan sāqayhā qāla innahu ṣarḥun mumarradun min qawārīra qālat rabbi innī ẓalamtu nafsī wa-aslamtu maʿa sulaymāna lillahi rabbi al-ʿālamīna ","translations":["It was said","to her","Enter","the palace","Then when","she saw it","she thought it","(was) a pool","and she uncovered","[on]","her shins","He said","Indeed, it","(is) a palace","made smooth","of","glass","She said","My Lord","indeed, I","[I] have wronged","myself","and I submit","with","Sulaiman","to Allah","(the) Lord","(of) the worlds","(44)"],"transliterationArr":["qīla","lahā","ud'khulī","al-ṣarḥa","falammā","ra-athu","ḥasibathu","lujjatan","wakashafat","ʿan","sāqayhā","qāla","innahu","ṣarḥun","mumarradun","min","qawārīra","qālat","rabbi","innī","ẓalamtu","nafsī","wa-aslamtu","maʿa","sulaymāna","lillahi","rabbi","al-ʿālamīna",null],"verseTiming":[[1,0,700],[2,700,1040],[3,1040,1730],[4,1730,2300],[5,2300,4390],[6,4390,5160],[7,5160,6180],[8,6180,7970],[9,7970,8960],[10,8960,10210],[11,10210,11710],[12,11710,12790],[13,12790,14780],[14,14780,15530],[15,15530,17590],[16,17590,19390],[17,19390,20250],[18,20250,22359],[19,22359,23569],[20,23569,24119],[21,24119,25669],[22,25669,26629],[23,26629,27499],[24,27499,28839],[25,28839,29239],[26,29239,30499],[27,30499,31709],[28,31709,32529],[29,32529,36924]]}}