{"name":"27:43","price":"اسے انہوں نے روک رکھا تھا جن کی وه اللہ کے سوا پرستش کرتی رہی تھی، یقیناً وه کافر لوگوں میں سے تھی.(1)","arabic":"وَصَدَّهَا مَا كَانَت تَّعۡبُدُ مِن دُونِ ٱللَّهِۖ إِنَّهَا كَانَتۡ مِن قَوۡمٖ كَٰفِرِينَ","category":["27 (An-Naml)","An-Naml","Surah An-Naml","Chapter An-Naml","Naml","Surah Naml","Chapter Naml","An Naml","Surah An Naml","Chapter An Naml","Surah 27","Chapter 27","The Ant","النَّمْل"],"ayahNumber":3202,"juzNumber":19,"footnotes":"(1) یعنی یہاں آنے سےقبل ہی ہم سمجھ گئے تھے کہ آپ اللہ کے نبی ہیں اور آپ کے مطیع و منقاد ہوگئے تھے۔ لیکن امام ابن کثیر وشوکانی وغیرہ نے اسے حضرت سلیمان (عليه السلام) کا قول قرار دیا ہے کہ ہمیں پہلے ہی یہ علم دے دیاگیا تھا کہ ملکۂ سبا تابع فرمان ہو کر حاضر خدمت ہوگی۔\n(2) یہ اللہ تعالیٰ کا قول ہے اور صَدَّهَا کا فاعل مَا كَانَتْ تَعْبُدُ ہے یعنی اسے اللہ کی عبادت سے جس چیز نے روک رکھا تھا، وہ غیراللہ کی عبادت تھی، اور اس کی وجہ یہ تھی کہ اس کا تعلق ایک کافر قوم سے تھا، اس لیے توحید کی حقیقت سے بے خبر رہی بعض نے صَدَّهَا کا فاعل اللہ کو اور بعض نے سلیمان (عليه السلام) کو قرار دیا ہے۔ یعنی اللہ نے یا اللہ کے حکم سے سلیمان (عليه السلام) نے اسے غیر اللہ کی عبادت سے روک دیا۔ لیکن پہلا قول زیادہ صحیح ہے۔ (فتح القدیر)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waṣaddahā mā kānat taʿbudu min dūni al-lahi innahā kānat min qawmin kāfirīna ","translations":["And has averted her","what","she used (to)","worship","besides","besides","Allah","Indeed, she","was","from","a people","who disbelieve","(43)"],"transliterationArr":["waṣaddahā","mā","kānat","taʿbudu","min","dūni","al-lahi","innahā","kānat","min","qawmin","kāfirīna",null],"verseTiming":[[1,0,1380],[2,1380,1790],[3,1790,2570],[4,2570,3630],[5,3630,4840],[6,4840,5560],[7,5560,8310],[8,8310,9790],[9,9790,10680],[10,10680,12160],[11,12160,12910],[12,12910,16945]]}}