{"name":"27:65","price":"کہہ دیجئے کہ آسمانوں والوں میں سے زمین والوں میں سے سوائے اللہ کے کوئی غیب نہیں جانتا(1) ، انہیں تو یہ بھی نہیں معلوم کہ کب اٹھا کھڑے کیے جائیں گے؟","arabic":"قُل لَّا يَعۡلَمُ مَن فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ ٱلۡغَيۡبَ إِلَّا ٱللَّهُۚ وَمَا يَشۡعُرُونَ أَيَّانَ يُبۡعَثُونَ","category":["27 (An-Naml)","An-Naml","Surah An-Naml","Chapter An-Naml","Naml","Surah Naml","Chapter Naml","An Naml","Surah An Naml","Chapter An Naml","Surah 27","Chapter 27","The Ant","النَّمْل"],"ayahNumber":3224,"juzNumber":20,"footnotes":"(1) یعنی جس طرح مذکورہ معاملات میں اللہ تعالیٰ متفرد ہے، اس کا کوئی شریک نہیں۔ اسی طرح غیب کے علم میں بھی وہ متفرد ہے۔ اس کے سوا کوئی عالم الغیب نہیں۔ نبیوں اور رسولوں کو بھی اتنا ہی علم ہوتا ہے جتنا اللہ تعالیٰ وحی والہام کے ذریعے سے انہیں بتلا دیتا ہے اور جو علم کسی بتلانے سے حاصل ہو، اس کے عالم کو عالم الغیب نہیں کہا جاتا۔ عالم الغیب تو وہ ہے جو بغیر کسی واسطے اور ذریعے کے ذاتی طور پر ہر چیز کا علم رکھے، ہر حقیقت سے باخبر ہو اور مخفی سے مخفی چیز بھی اس کے دائرہ علم سے باہر نہ ہو۔ یہ صفت صرف اور صرف اللہ کی ہے اس لیے صرف وہی عالم الغیب ہے۔ اس کے سوا کائنات میں کوئی عالم الغیب نہیں۔ حضرت عائشہ (رضی الله عنها) فرماتی ہیں کہ جو شخص یہ گمان رکھتا ہے کہ نبی (صلى الله عليه وسلم) آئندہ کل کو پیش آنے والے حالات کا علم رکھتے ہیں، اس نے اللہ پر بہت بڑا بہتان باندھا اس لیے کہ وہ تو فرما رہا ہے کہ آسمان وزمین میں غیب کا علم صرف اللہ کو ہے۔ (صحيح بخاري نمبر 48 55 ، صحيح مسلم نمبر 287 الترمذي نمبر3068) حضرت قتادہ (رضي الله عنه) فرماتے ہیں کہ اللہ تعالیٰ نے ستارے تین مقصد کے لیے بنائے ہیں۔ آسمان کی زینت، رہنمائی کا ذریعہ اور شیطان کو سنگسار کرنا۔ لیکن اللہ کے احکام سے بے خبر لوگوں نے ان سے غیب کا علم حاصل کرنے (کہانت) کا ڈھونگ رچا لیا ہے۔ مثلاً کہتے ہیں جو فلاں فلاں ستارے کے وقت نکاح کرے گا تو یہ یہ ہوگا فلاں فلاں ستارے کے وقت سفر کرے گا تو ایسا ایسا ہوگا، فلاں فلاں ستارے کے وقت پیدا ہوگا تو ایسا ایسا ہوگا وغیرہ وغیرہ۔ یہ سب ڈھکوسلے ہیں۔ ان کے قیاسات کے خلاف اکثر ہوتا رہتا ہے۔ ستاروں، پرندوں اور جانوروں سے غیب کا علم کس طرح حاصل ہوسکتا ہے؟ جب کہ اللہ کا فیصلہ تو یہ ہے کہ آسمان وزمین میں اللہ کے سوا کوئی غیب نہیں جانتا۔ (ابن کثیر)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qul lā yaʿlamu man fī al-samāwāti wal-arḍi al-ghayba illā al-lahu wamā yashʿurūna ayyāna yub'ʿathūna ","translations":["Say","No (one)","knows","whoever","(is) in","the heavens","and the earth","(of) the unseen","except","Allah","and not","they perceive","when","they will be resurrected","(65)"],"transliterationArr":["qul","lā","yaʿlamu","man","fī","al-samāwāti","wal-arḍi","al-ghayba","illā","al-lahu","wamā","yashʿurūna","ayyāna","yub'ʿathūna",null],"verseTiming":[[1,0,480],[2,480,910],[3,910,1840],[4,1840,2900],[5,2900,3160],[6,3160,4810],[7,4810,5860],[8,5860,6650],[9,6650,7270],[10,7270,10940],[11,10940,11540],[12,11540,12800],[13,12800,13820],[14,13820,17415]]}}