{"name":"27:60","price":"بھلا بتاؤ تو؟ کہ آسمانوں کو اور زمین کو کس نے پیدا کیا؟ کس نے آسمان سے بارش برسائی؟ پھر اس سے ہرے بھرے بارونق باغات اگا دیئے؟ ان باغوں کے درختوں کو تم ہر گز نہ اگا سکتے(1) ، کیا اللہ کے ساتھ اور کوئی معبود بھی ہے(2)؟ بلکہ یہ لوگ ہٹ جاتے ہیں(3) (سیدھی راه سے).","arabic":"أَمَّنۡ خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ وَأَنزَلَ لَكُم مِّنَ ٱلسَّمَآءِ مَآءٗ فَأَنۢبَتۡنَا بِهِۦ حَدَآئِقَ ذَاتَ بَهۡجَةٖ مَّا كَانَ لَكُمۡ أَن تُنۢبِتُواْ شَجَرَهَآۗ أَءِلَٰهٞ مَّعَ ٱللَّهِۚ بَلۡ هُمۡ قَوۡمٞ يَعۡدِلُونَ","category":["27 (An-Naml)","An-Naml","Surah An-Naml","Chapter An-Naml","Naml","Surah Naml","Chapter Naml","An Naml","Surah An Naml","Chapter An Naml","Surah 27","Chapter 27","The Ant","النَّمْل"],"ayahNumber":3219,"juzNumber":20,"footnotes":"(1) یہاں سے پچھلے جملے کی تشریح اور اس کے دلائل جارہے ہیں کہ وہی اللہ پیدائش ، رزق اور تدبیر وغیرہ میں متفرد ہے۔ کوئی اس کا شریک نہیں ہے۔ فرمایا آسمانوں کو اتنی بلندی اور خوبصورتی کے ساتھ بنانے والا، ان میں درخشاں کواکب، روشن ستارے اور گردش کرنے والے افلاک بنانے والا۔ اسی طرح زمین اور اس میں پہاڑ، نہریں، چشمے، سمندر، اشجار کھیتیاں اور انواع واقسام کے طیور و حیوانات وغیرہ پیدا کرنے والا اور آسمان سے بارش برسا کر اس کے ذریعے سے بارونق باغات اگانے والا کون ہے؟ کیا تم میں سے کوئی ایسا ہے جو زمین سے درخت ہی اگا کر دکھا دے؟ ان سب کے جواب میں مشرکین بھی کہتے اور اعتراف کرتے تھے کہ یہ سب کچھ کرنے والا اللہ تعالیٰ ہے، جیسا کہ قرآن میں دوسرے مقام پر ہے۔ (مثلاً سورۃ العنکبوت۔63)۔\n(2) یعنی ان سب حقیقتوں کے باوجود کیا اللہ کے ساتھ کوئی اور بھی ہستی ایسی ہے، جو عبادت کے لائق ہو؟ یا جس نے ان میں سے کسی چیز کو پیدا کیا ہو؟ یعنی کوئی ایسا نہیں جس نے کچھ بنایا ہو یا عبادت کے لائق ہو۔ أمن کا ان آیات میں مفہوم یہ ہے کہ کیا وہ ذات جو ان تمام چیزوں کو بنانے والی ہے، اس شخص کی طرح ہے جو ان میں سے کسی چیز پر قادر نہیں؟ (ابن کثیر)۔\n(3) اس کا دوسرا ترجمہ ہے کہ وہ لوگ اللہ کا ہمسر اور نظیر ٹھہراتے ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"amman khalaqa al-samāwāti wal-arḍa wa-anzala lakum mina al-samāi māan fa-anbatnā bihi ḥadāiqa dhāta bahjatin mā kāna lakum an tunbitū shajarahā a-ilāhun maʿa al-lahi bal hum qawmun yaʿdilūna ","translations":["Or Who","has created","the heavens","and the earth","and sent down","for you","from","the sky","water","And We caused to grow","thereby","gardens","of beauty (and delight)","of beauty (and delight)","not","it is","for you","that","you cause to grow","their trees","Is there any god","with","Allah","Nay","they","(are) a people","who ascribe equals","(60)"],"transliterationArr":["amman","khalaqa","al-samāwāti","wal-arḍa","wa-anzala","lakum","mina","al-samāi","māan","fa-anbatnā","bihi","ḥadāiqa","dhāta","bahjatin","mā","kāna","lakum","an","tunbitū","shajarahā","a-ilāhun","maʿa","al-lahi","bal","hum","qawmun","yaʿdilūna",null],"verseTiming":[[1,0,1470],[2,1470,2090],[3,2090,3700],[4,3700,4880],[5,4880,6740],[6,6740,7280],[7,7280,8380],[8,8380,10830],[9,10830,13690],[10,13690,15920],[11,15920,18450],[12,18450,19080],[13,19080,21600],[14,21600,22270],[15,22270,23130],[16,23130,24300],[17,24300,24930],[18,24930,25660],[19,25660,25970],[20,25970,28040],[21,28040,29510],[22,29510,31010],[23,31010,32220],[24,32220,35670],[25,35670,36070],[26,36070,36520],[27,36520,37080],[28,37080,38160],[29,38160,41055]]}}