{"name":"27:82","price":"جب ان کے اوپر عذاب کا وعده ﺛابت ہو جائے گا(1) ، ہم زمین سے ان کے لیے ایک جانور نکالیں گے جو ان سے باتیں کرتا ہوگا(2) کہ لوگ ہماری آیتوں پر یقین نہیں کرتے تھے.(3)","arabic":"۞ وَإِذَا وَقَعَ ٱلۡقَوۡلُ عَلَيۡهِمۡ أَخۡرَجۡنَا لَهُمۡ دَآبَّةٗ مِّنَ ٱلۡأَرۡضِ تُكَلِّمُهُمۡ أَنَّ ٱلنَّاسَ كَانُواْ بِـَٔايَٰتِنَا لَا يُوقِنُونَ","category":["27 (An-Naml)","An-Naml","Surah An-Naml","Chapter An-Naml","Naml","Surah Naml","Chapter Naml","An Naml","Surah An Naml","Chapter An Naml","Surah 27","Chapter 27","The Ant","النَّمْل"],"ayahNumber":3241,"juzNumber":20,"footnotes":"(1) یعنی جب نیکی کا حکم دینے والا اور برائی سے روکنے والا نہیں رہ جائے گا۔\n(2) یہ دابہ وہی ہے جو قرب قیامت کی علامات میں سے ہے جیسا کہ حدیث میں ہے۔ نبی (صلى الله عليه وسلم) نے فرمایا (قیامت اس وقت تک قائم نہیں ہوگی جب تک تم دس نشانیاں نہ دیکھ لو، ان میں ایک جانور کا نکلنا ہے۔ (صحيح مسلم كتاب الفتن، باب في الآيات التي تكون قبل الساعة، والسنن ) دوسری روایت میں ہے (سب سے پہلی نشانی جو ظاہر ہوگی ، وہ ہے سورج کا مشرق کی بجائے ، مغرب سے طلوع ہونا اور چاشت کے وقت جانور کا نکلنا۔ ان دونوں میں سے جو پہلے ظاہر ہوگی، دوسری اس کے فوراً بعد ہی ظاہر ہو جائے گی (صحيح مسلم، باب في خروج الدجال ومكثه في الأرض)\n(3) یہ جانور کے نکلنے کی علت ہے۔ یعنی اللہ تعالیٰ اپنی یہ نشانی اس لیے دکھلائے گا کہ لوگ اللہ کی نشانیوں یا آیتوں (احکام) پر یقین نہیں رکھتے۔ بعض کہتے ہیں کہ یہ جملہ وہ جانور اپنی زبان سے ادا کرے گا۔ تاہم اس جانور کے لوگوں سے کلام کرنے میں تو کوئی شک نہیں کیونکہ قرآن نے اس کی صراحت کی ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-idhā waqaʿa al-qawlu ʿalayhim akhrajnā lahum dābbatan mina al-arḍi tukallimuhum anna al-nāsa kānū biāyātinā lā yūqinūna ","translations":["And when","(is) fulfilled","the word","against them","We will bring forth","for them","a creature","from","the earth","speaking to them","that","the people","were","of Our Signs","not","certain","(82)"],"transliterationArr":["wa-idhā","waqaʿa","al-qawlu","ʿalayhim","akhrajnā","lahum","dābbatan","mina","al-arḍi","tukallimuhum","anna","al-nāsa","kānū","biāyātinā","lā","yūqinūna",null],"verseTiming":[[1,0,940],[2,940,1530],[3,1530,2510],[4,2510,3520],[5,3520,4840],[6,4840,5530],[7,5530,8950],[8,8950,10040],[9,10040,10970],[10,10970,12830],[11,12830,14220],[12,14220,15420],[13,15420,17100],[14,17100,17870],[15,17870,19670],[16,19670,20110],[17,20110,22725]]}}