{"name":"27:80","price":"بیشک آپ نہ مُردوں کو سنا سکتے ہیں اور نہ بہروں کو اپنی پکار سنا سکتے ہیں(1) ، جبکہ وه پیٹھ پھیرے روگرداں جا رہے ہوں.(2)","arabic":"إِنَّكَ لَا تُسۡمِعُ ٱلۡمَوۡتَىٰ وَلَا تُسۡمِعُ ٱلصُّمَّ ٱلدُّعَآءَ إِذَا وَلَّوۡاْ مُدۡبِرِينَ","category":["27 (An-Naml)","An-Naml","Surah An-Naml","Chapter An-Naml","Naml","Surah Naml","Chapter Naml","An Naml","Surah An Naml","Chapter An Naml","Surah 27","Chapter 27","The Ant","النَّمْل"],"ayahNumber":3239,"juzNumber":20,"footnotes":"(1) یہ ان کافروں کی پروا نہ کرنے اور صرف اللہ پر بھروسہ رکھنے کی دوسری وجہ ہے کہ یہ لوگ مردہ ہیں جو کسی کی بات سن کر فائدہ نہیں اٹھا سکتے یا بہرے ہیں جو سنتے ہیں نہ سمجھتے ہیں اور نہ راہ یاب ہونے والے ہیں۔ گویا کافروں کو مردوں سے تشبیہ دی جن میں حس ہوتی ہے نہ عقل اور بہروں سے، جو وعظ ونصیحت سنتے ہیں نہ دعوت الی اللہ قبول کرتے ہیں۔\n(2) یعنی وہ حق سے مکمل طور پر گریزاں اور متنفر ہیں کیونکہ بہرہ آدمی رو در رو بھی کوئی بات نہیں سن پاتا چہ جائیکہ اس وقت سن سکے جب وہ منہ موڑ لے اور پیٹھ پھیرے ہوئے ہو۔ قرآن کریم کی اس آیت سے یہ بھی معلوم ہوا کہ سماع موتی کا عقیدہ قرآن کے خلاف ہے۔ مردے کسی کی بات نہیں سن سکتے۔ البتہ اس سے صرف وہ صورتیں مستثنیٰ ہوں گی جہاں سماعت کی صراحت کسی نص سے ثابت ہوگی۔ جیسے حدیث میں آتا ہے کہ مردے کو جب دفنا کر واپس جاتے ہیں تو وہ ان کے جوتوں کی آہٹ سنتا ہے (صحيح بخاري نمبر 338 ، صحيح مسلم نمبر 2201) یا جنگ بدر میں کافر مقتولین کو جو قلیب بدر میں پھینک دیئے گئے تھے۔ نبی (صلى الله عليه وسلم) نے خطاب فرمایا، جس پر صحابہ نے کہا ”آپ (صلى الله عليه وسلم) بے روح جسموں سے گفتگو فرما رہے ہیں“۔ آپ (صلى الله عليه وسلم) نے فرمایا کہ ”یہ تم سے زیادہ میری بات سن رہے ہیں“۔ یعنی معجزانہ طور پر اللہ تعالیٰ نے آپ کی بات مردہ کافروں کو سنوا دی (صحيح بخاري نمبر 1307)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"innaka lā tus'miʿu al-mawtā walā tus'miʿu al-ṣuma al-duʿāa idhā wallaw mud'birīna ","translations":["Indeed, you","(can) not","cause to hear","the dead","and not","can you cause to hear","the deaf","the call","when","they turn back","retreating","(80)"],"transliterationArr":["innaka","lā","tus'miʿu","al-mawtā","walā","tus'miʿu","al-ṣuma","al-duʿāa","idhā","wallaw","mud'birīna",null],"verseTiming":[[1,0,1730],[2,1730,2120],[3,2120,2980],[4,2980,4060],[5,4060,4710],[6,4710,5570],[7,5570,7050],[8,7050,9560],[9,9560,10220],[10,10220,11070],[11,11070,14395]]}}