{"name":"28:13","price":"پس ہم نے اسے اس کی ماں کی طرف واپس پہنچایا(1) ، تاکہ اس کی آنکھیں ٹھنڈی رہیں اور آزرده خاطر نہ ہو اور جان لے کہ اللہ تعالی کا وعده سچا ہے(2) لیکن اکثر لوگ نہیں جانتے.(3)","arabic":"فَرَدَدۡنَٰهُ إِلَىٰٓ أُمِّهِۦ كَيۡ تَقَرَّ عَيۡنُهَا وَلَا تَحۡزَنَ وَلِتَعۡلَمَ أَنَّ وَعۡدَ ٱللَّهِ حَقّٞ وَلَٰكِنَّ أَكۡثَرَهُمۡ لَا يَعۡلَمُونَ","category":["28 (Al-Qasas)","Al-Qasas","Surah Al-Qasas","Chapter Al-Qasas","Qasas","Surah Qasas","Chapter Qasas","Al Qasas","Surah Al Qasas","Chapter Al Qasas","Surah 28","Chapter 28","The Stories","القَصَص"],"ayahNumber":3265,"juzNumber":20,"footnotes":"(1) چنانچہ انہوں نے ہمشیرہ موسیٰ (عليه السلام) سے کہا کہ جا اس عورت کو لے آ، چنانچہ وہ دوڑی دوڑی گئی اور اپنی ماں کو، جو موسیٰ (عليه السلام) کی بھی ماں تھی، ساتھ لے آئی۔\n(2) جب حضرت موسیٰ (عليه السلام) نے اپنی والدہ کا دودھ پی لیا، تو فرعون نے والدۂ موسیٰ سے محل میں رہنے کی استدعا کی تاکہ بچے کی صحیح پرورش اور نگہداشت ہوسکے۔ لیکن انہوں نے کہا کہ میں اپنے خاوند اور بچوں کو چھوڑ کر یہاں نہیں رہ سکتی۔ بالآخر یہ طے پایا کہ بچے کو وہ اپنے ساتھ ہی اپنے گھر لے جائیں اور وہیں اس کی پرورش کریں اور اس کی اجرت انہیں شاہی خزانے سے دی جائے گی ، سبحان اللہ ! اللہ کی قدرت کے کیا کہنے، دودھ اپنے بچے کو پلائیں اور تنخواہ فرعون سے وصول کریں، رب نے موسیٰ (عليه السلام) کو واپس لوٹانے کا وعدہ کس احسن طریقے سے پورا فرمایا۔ فَسُبْحَانَ الَّذِي بِيَدِهِ مَلَكُوتُ كُلِّ شَيْءٍ ایک مرسل روایت میں ہے ”اس کاریگر کی مثال جو اپنی بنائی ہوئی چیز میں ثواب اور خیر کی نیت بھی رکھتا ہے، موسیٰ (عليه السلام) کی ماں کی طرح ہے جو اپنے ہی بچے کو دودھ پلاتی ہے اور اس کی اجرت بھی وصول کرتی ہے“ (مراسیل أبی داود)\n(3) یعنی بہت سے کام ایسے ہوتے ہیں کہ ان کے انجام کی حقیقت سے اکثر لوگ بےعلم ہوتے ہیں لیکن اللہ کو اس کے حسن انجام کا علم ہوتا ہے۔ اسی لیے اللہ نے فرمایا ”ہوسکتا ہے جس چیز کو تم برا سمجھو، اس میں تمہارے لیے خیر ہو اور جس چیز کو تم پسند کرو، اس میں تمہارے لیے شرکا پہلو ہو“ (البقرۃ: 216) دوسرے مقام پر فرمایا ”ہوسکتا ہے تم کسی چیز کو برا سمجھو، اور اللہ اس میں تمہارے لیے خیر کثیر پیدا فرما دے“ (النساء: 19) اس لیے انسان کی بہتری اسی میں ہے کہ وہ اپنی پسند وناپسند سے قطع نظر ہر معاملے میں اللہ اور رسول کے احکام کی پابندی کرلے کہ اسی میں اس کے لیے خیر اور حسن انجام ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"faradadnāhu ilā ummihi kay taqarra ʿaynuhā walā taḥzana walitaʿlama anna waʿda al-lahi ḥaqqun walākinna aktharahum lā yaʿlamūna ","translations":["So We restored him","to","his mother","that","might be comforted","her eye","and not","she may grieve","and that she would know","that","the Promise of Allah","the Promise of Allah","(is) true","But","most of them","(do) not","know","(13)"],"transliterationArr":["faradadnāhu","ilā","ummihi","kay","taqarra","ʿaynuhā","walā","taḥzana","walitaʿlama","anna","waʿda","al-lahi","ḥaqqun","walākinna","aktharahum","lā","yaʿlamūna",null],"verseTiming":[[1,0,1740],[2,1740,3770],[3,3770,5530],[4,5530,5740],[5,5740,6850],[6,6850,7920],[7,7920,8610],[8,8610,9540],[9,9540,10790],[10,10790,12090],[11,12090,12600],[12,12600,13600],[13,13600,14910],[14,14910,16240],[15,16240,17450],[16,17450,18050],[17,18050,18920],[18,18920,20450],[19,20450,22230],[20,22230,23590],[21,23590,23980],[22,23980,26985]]}}