{"name":"28:28","price":"موسیٰ (علیہ السلام) نے کہا، خیر تو یہ بات میرے اور آپ کے درمیان پختہ ہوگئی، میں ان دونوں مدتوں میں سے جسے پورا کروں مجھ پر کوئی زیادتی نہ ہو(1) ، ہم یہ جو کچھ کہہ رہے ہیں اس پر اللہ (گواه اور) کارساز ہے.(2)","arabic":"قَالَ ذَٰلِكَ بَيۡنِي وَبَيۡنَكَۖ أَيَّمَا ٱلۡأَجَلَيۡنِ قَضَيۡتُ فَلَا عُدۡوَٰنَ عَلَيَّۖ وَٱللَّهُ عَلَىٰ مَا نَقُولُ وَكِيلٞ","category":["28 (Al-Qasas)","Al-Qasas","Surah Al-Qasas","Chapter Al-Qasas","Qasas","Surah Qasas","Chapter Qasas","Al Qasas","Surah Al Qasas","Chapter Al Qasas","Surah 28","Chapter 28","The Stories","القَصَص"],"ayahNumber":3280,"juzNumber":20,"footnotes":"(1) یعنی آٹھ سال کے بعد یا دس سال کے بعد جانا چاہوں تو مجھ سے مزید رہنے کا مطالبہ نہ کیا جائے۔\n(2) یہ بعض کے نزدیک شعیب (عليه السلام) یا برادر زادہ شعیب (عليه السلام) کا قول ہے اور بعض کے نزدیک حضرت موسیٰ (عليه السلام) کا۔ ممکن ہے دونوں ہی کی طرف سے ہو۔ کیونکہ جمع کا صیغہ ہے گویا دونوں نے اس معاملے پر اللہ کو گواہ ٹھہرایا۔ اور اس کے ساتھ ہی ان کی لڑکی اور موسیٰ (عليه السلام) کے درمیان رشتہ ازدواج قائم ہوگیا۔ باقی تفصیلات اللہ نے ذکر نہیں کی ہیں۔ ویسے اسلام میں طرفین کی رضامندی کے ساتھ صحت نکاح کے لیے دو عادل گواہ بھی ضروری ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qāla dhālika baynī wabaynaka ayyamā al-ajalayni qaḍaytu falā ʿud'wāna ʿalayya wal-lahu ʿalā mā naqūlu wakīlun ","translations":["He said","That","(is) between me","and between you","Whichever","(of) the two terms","I complete","then no","injustice","to me","and Allah","over","what","we say","(is) a Witness","(28)"],"transliterationArr":["qāla","dhālika","baynī","wabaynaka","ayyamā","al-ajalayni","qaḍaytu","falā","ʿud'wāna","ʿalayya","wal-lahu","ʿalā","mā","naqūlu","wakīlun",null],"verseTiming":[[1,0,810],[2,810,1610],[3,1610,2430],[4,2430,4060],[5,4060,4820],[6,4820,6130],[7,6130,7080],[8,7080,7730],[9,7730,8780],[10,8780,9420],[11,9420,11160],[12,11160,11680],[13,11680,12270],[14,12270,13410],[15,13410,17145]]}}