{"name":"28:34","price":"اور میرا بھائی ہارون (علیہ السلام) مجھ سے بہت زیاده فصیح زبان واﻻ ہے تو اسے بھی میرا مددگار بنا کر میرے ساتھ بھیج(1) کہ وه مجھے سچا مانے، مجھے تو خوف ہے کہ وه سب مجھے جھٹلا دیں گے.","arabic":"وَأَخِي هَٰرُونُ هُوَ أَفۡصَحُ مِنِّي لِسَانٗا فَأَرۡسِلۡهُ مَعِيَ رِدۡءٗا يُصَدِّقُنِيٓۖ إِنِّيٓ أَخَافُ أَن يُكَذِّبُونِ","category":["28 (Al-Qasas)","Al-Qasas","Surah Al-Qasas","Chapter Al-Qasas","Qasas","Surah Qasas","Chapter Qasas","Al Qasas","Surah Al Qasas","Chapter Al Qasas","Surah 28","Chapter 28","The Stories","القَصَص"],"ayahNumber":3286,"juzNumber":20,"footnotes":"(1) اسرائیلی روایات کی رو سے حضرت موسیٰ (عليه السلام) کی زبان میں لکنت تھی ، جس کی وجہ یہ بیان کی گئی ہے کہ حضرت موسیٰ (عليه السلام) کے سامنے آگ کا انگارہ اور کھجور یا موتی رکھے گئے تو آپ نے انگارہ اٹھا کر منہ میں رکھ لیا تھا جس سے آپ کی زبان جل گئی۔ یہ وجہ صحیح ہے یا نہیں۔ تاہم قرآن کریم کی اس نص سے یہ تو ثابت ہے کہ حضرت موسیٰ (عليه السلام) کے مقابلے میں حضرت ہارون (عليه السلام) فصیح اللسان تھے اور حضرت موسیٰ (عليه السلام) کی زبان میں گرہ تھی۔ جس کے کھولنے کی دعا انہوں نے نبوت سے سرفراز ہونے کے بعد کی۔ رِدْءًا کے معنی ہیں معین، مددگار، تقویت پہنچانے والا۔ یعنی ہارون (عليه السلام) اپنی فصاحت لسانی سے مجھے مدد اور تقویت پہنچائیں گے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-akhī hārūnu huwa afṣaḥu minnī lisānan fa-arsil'hu maʿiya rid'an yuṣaddiqunī innī akhāfu an yukadhibūni ","translations":["And my brother","Harun","he","(is) more eloquent","than me","(in) speech","so send him","with me","(as) a helper","who will confirm me","Indeed","I fear","that","they will deny me","(34)"],"transliterationArr":["wa-akhī","hārūnu","huwa","afṣaḥu","minnī","lisānan","fa-arsil'hu","maʿiya","rid'an","yuṣaddiqunī","innī","akhāfu","an","yukadhibūni",null],"verseTiming":[[1,0,1000],[2,1000,2130],[3,2130,2490],[4,2490,3430],[5,3430,4900],[6,4900,6600],[7,6600,7900],[8,7900,8620],[9,8620,10540],[10,10540,11200],[11,11200,12350],[12,12350,15690],[13,15690,18240],[14,18240,19130],[15,19130,19400],[16,19400,23595]]}}