{"name":"28:38","price":"فرعون کہنے لگا اے درباریو! میں تو اپنے سوا کسی کو تمہارا معبود نہیں جانتا۔ سن اے ہامان! تو میرے لیے مٹی کو آگ سے پکوا(1) پھر میرے لیے ایک محل تعمیر کر تو میں موسیٰ کے معبود کو جھانک لوں(2) اسے میں تو جھوٹوں میں سے ہی گمان کر رہا ہوں.(3)","arabic":"وَقَالَ فِرۡعَوۡنُ يَٰٓأَيُّهَا ٱلۡمَلَأُ مَا عَلِمۡتُ لَكُم مِّنۡ إِلَٰهٍ غَيۡرِي فَأَوۡقِدۡ لِي يَٰهَٰمَٰنُ عَلَى ٱلطِّينِ فَٱجۡعَل لِّي صَرۡحٗا لَّعَلِّيٓ أَطَّلِعُ إِلَىٰٓ إِلَٰهِ مُوسَىٰ وَإِنِّي لَأَظُنُّهُۥ مِنَ ٱلۡكَٰذِبِينَ","category":["28 (Al-Qasas)","Al-Qasas","Surah Al-Qasas","Chapter Al-Qasas","Qasas","Surah Qasas","Chapter Qasas","Al Qasas","Surah Al Qasas","Chapter Al Qasas","Surah 28","Chapter 28","The Stories","القَصَص"],"ayahNumber":3290,"juzNumber":20,"footnotes":"(1) ظالم سے مراد مشرک اور کافر ہیں۔ کیونکہ ظلم کے معنی ہیں ”وَضْعُ الشَّيْءِ فِي غَيْرِ مَحَلِّهِ“ کسی چیز کو اس کے اصل مقام سے ہٹا کر کسی اور جگہ رکھ دینا۔ مشرک بھی چونکہ الوہیت کے مقام پر ایسے لوگوں کو بٹھا دیتے ہیں جو اس کے مستحق نہیں ہوتے۔ اسی طرح کافر بھی رب کے اصل مقام سے ناآشنا ہی رہتے ہیں۔ اس لیے یہ لوگ سب سے بڑے ظالم ہیں اور یہ کامیابی سے یعنی آخرت میں اللہ کی رحمت ومغفرت سے محروم رہیں گے۔ اس آیت سے بھی معلوم ہوا کہ اصل کامیابی آخرت ہی کی کامیابی ہے۔ دنیا میں خوش حالی اور مال واسباب کی فراوانی حقیقی کامیابی نہیں ہے، اس لیے کہ یہ عارضی کامیابی اہل کفر وشرک کو بھی دنیا میں مل جاتی ہے۔ لیکن اللہ تعالیٰ ان سے کامیابی کی نفی فرما رہا ہے جس کا صاف مطلب یہ ہے کہ حقیقی کامیابی آخرت ہی کی کامیابی ہے نہ کہ دنیا کی چند روزہ عارضی خوش حالی وفراوانی۔\n(2) یعنی مٹی کو آگ میں تپا کر اینٹیں تیار کر۔ ہامان، فرعون کا وزیر، مشیر اور اس کے معاملات کا انتظام کرنے والا تھا۔\n(3) یعنی ایک اونچا اور مضبوط محل تیار کر، جس پر چڑھ کر میں آسمان پر یہ دیکھ سکوں کہ وہاں میرے سوا کوئی اور رب ہے؟\n(4) یعنی موسیٰ (عليه السلام) جو یہ دعویٰ کرتا ہے کہ آسمانوں پر رب ہے جو ساری کائنات کا پالنہار ہے، میں تو اسے جھوٹا سمجھتا ہوں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waqāla fir'ʿawnu yāayyuhā al-mala-u mā ʿalim'tu lakum min ilāhin ghayrī fa-awqid lī yāhāmānu ʿalā al-ṭīni fa-ij'ʿal lī ṣarḥan laʿallī aṭṭaliʿu ilā ilāhi mūsā wa-innī la-aẓunnuhu mina al-kādhibīna ","translations":["And Firaun said","And Firaun said","O chiefs","O chiefs","Not","I know","for you","any","god","other than me","So kindle","for me","O Haman","Upon","the clay","and make","for me","a lofty tower","so that [I]","I may look","at","(the) God","(of) Musa","And indeed, I","[I] think that he","(is) of","the liars","(38)"],"transliterationArr":["waqāla","fir'ʿawnu","yāayyuhā","al-mala-u","mā","ʿalim'tu","lakum","min","ilāhin","ghayrī","fa-awqid","lī","yāhāmānu","ʿalā","al-ṭīni","fa-ij'ʿal","lī","ṣarḥan","laʿallī","aṭṭaliʿu","ilā","ilāhi","mūsā","wa-innī","la-aẓunnuhu","mina","al-kādhibīna",null],"verseTiming":[[1,0,1010],[2,1010,2150],[3,2150,4820],[4,4820,5740],[5,5740,6200],[6,6200,7080],[7,7080,7790],[8,7790,8820],[9,8820,9830],[10,9830,10760],[11,10760,11920],[12,11920,12400],[13,12400,13860],[14,13860,14320],[15,14320,15210],[16,15210,16020],[17,16020,17240],[18,17240,18170],[19,18170,18470],[20,18470,19230],[21,19230,21720],[22,21720,22760],[23,22760,24540],[24,24540,25400],[25,25400,26190],[26,26190,27880],[27,27880,29900],[28,29900,30270],[29,30270,33255]]}}