{"name":"28:45","price":"لیکن ہم نے بہت سی نسلیں پیدا کیں(1) جن پر لمبی مدتیں گزر گئیں(2)، اور نہ تو مدین کے رہنے والوں میں سے تھا(3) کہ ان کے سامنے ہماری آیتوں کی تلاوت کرتا بلکہ ہم ہی رسولوں کے بھیجنے والے رہے.(4)","arabic":"وَلَٰكِنَّآ أَنشَأۡنَا قُرُونٗا فَتَطَاوَلَ عَلَيۡهِمُ ٱلۡعُمُرُۚ وَمَا كُنتَ ثَاوِيٗا فِيٓ أَهۡلِ مَدۡيَنَ تَتۡلُواْ عَلَيۡهِمۡ ءَايَٰتِنَا وَلَٰكِنَّا كُنَّا مُرۡسِلِينَ","category":["28 (Al-Qasas)","Al-Qasas","Surah Al-Qasas","Chapter Al-Qasas","Qasas","Surah Qasas","Chapter Qasas","Al Qasas","Surah Al Qasas","Chapter Al Qasas","Surah 28","Chapter 28","The Stories","القَصَص"],"ayahNumber":3297,"juzNumber":20,"footnotes":"(1) قُرُونٌ، قَرْنٌ کی جمع ہے، زمانہ۔ لیکن یہاں امتوں کے معنی میں ہے یعنی اے محمد! (صلى الله عليه وسلم) آپ کے اور موسی، (عليه السلام) کے درمیان جو زمانہ ہے اس میں ہم نے کئی امتیں پیدا کیں۔\n(2) یعنی مرور ایام سے شرائع واحکام بھی متغیر ہوگئے اور لوگ بھی دین کو بھول گئے، جس کی وجہ سے انہوں نے اللہ کے حکموں کو پس پشت ڈال دیا اور اس کے عہد کو فراموش کر دیا اور یوں اس کی ضرورت پیدا ہوگئی کہ ایک نئے نبی کو مبعوث کیا جائے یا یہ مطلب ہے کہ طول زمان کی وجہ سے عرب کے لوگ نبوت ورسالت کو بالکل ہی بھلا بیٹھے، اس لیے آپ کی نبوت پر انہیں تعجب ہورہا ہے اور اسے ماننے کے لیے تیار نہیں ہیں۔\n(3) جس سے آپ خود اس واقعے کی تفصیلات سے آگاہ ہو جاتے۔\n(4) اور اسی اصول سے ہم نے آپ کو رسول بنا کر بھیجا ہے اور پچھلے حالات وواقعات سے آپ کو باخبر کر رہے ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walākinnā anshanā qurūnan fataṭāwala ʿalayhimu al-ʿumuru wamā kunta thāwiyan fī ahli madyana tatlū ʿalayhim āyātinā walākinnā kunnā mur'silīna ","translations":["But We","[We] produced","generations","and prolonged","for them","the life","And not","you were","a dweller","among","(the) people","(of) Madyan","reciting","to them","Our Verses","but We","[We] were","the Senders","(45)"],"transliterationArr":["walākinnā","anshanā","qurūnan","fataṭāwala","ʿalayhimu","al-ʿumuru","wamā","kunta","thāwiyan","fī","ahli","madyana","tatlū","ʿalayhim","āyātinā","walākinnā","kunnā","mur'silīna",null],"verseTiming":[[1,0,3830],[2,3830,5580],[3,5580,7260],[4,7260,8690],[5,8690,9810],[6,9810,10840],[7,10840,11730],[8,11730,13460],[9,13460,15120],[10,15120,17200],[11,17200,17830],[12,17830,18670],[13,18670,19500],[14,19500,20590],[15,20590,22170],[16,22170,24350],[17,24350,25990],[18,25990,29015]]}}