{"name":"28:48","price":"پھر جب ان کے پاس ہماری طرف سے حق آپہنچا تو کہتے ہیں کہ یہ وه کیوں نہیں دیا گیا جیسے دیئے گئے تھے موسیٰ (علیہ السلام)(1) اچھا تو کیا موسیٰ (علیہ السلام) کو جو کچھ دیا گیا تھا اس کے ساتھ لوگوں نے کفر نہیں کیا تھا(2)، صاف کہا تھا کہ یہ دونوں جادوگر ہیں جو ایک دوسرے کے مددگار ہیں اور ہم تو ان سب کے منکر ہیں.(3)","arabic":"فَلَمَّا جَآءَهُمُ ٱلۡحَقُّ مِنۡ عِندِنَا قَالُواْ لَوۡلَآ أُوتِيَ مِثۡلَ مَآ أُوتِيَ مُوسَىٰٓۚ أَوَلَمۡ يَكۡفُرُواْ بِمَآ أُوتِيَ مُوسَىٰ مِن قَبۡلُۖ قَالُواْ سِحۡرَانِ تَظَٰهَرَا وَقَالُوٓاْ إِنَّا بِكُلّٖ كَٰفِرُونَ","category":["28 (Al-Qasas)","Al-Qasas","Surah Al-Qasas","Chapter Al-Qasas","Qasas","Surah Qasas","Chapter Qasas","Al Qasas","Surah Al Qasas","Chapter Al Qasas","Surah 28","Chapter 28","The Stories","القَصَص"],"ayahNumber":3300,"juzNumber":20,"footnotes":"(1) یعنی حضرت موسیٰ (عليه السلام) کے سے معجزات ، جیسے لاٹھی کا سانپ بن جانا اور ہاتھ کا چمکنا وغیرہ۔\n(2) یعنی مطلوبہ معجزات، اگر دکھا بھی دیئے جائیں تو کیا فائدہ؟ جنہیں ایمان نہیں لانا ہے، وہ ہر طرح کی نشانیاں دیکھنے کے باوجود بھی ایمان سے محروم ہی رہیں گے۔ کیا موسیٰ (عليه السلام) کے مذکورہ معجزات دیھ کر فرعونی مسلمان ہوگئے تھے، انہوں نے کفر نہیں کیا؟ یا يَكْفُرُوا کی ضمیر قریش مکہ کی طرف ہے یعنی کیا انہوں نے نبوت محمدیہ سے پہلے موسیٰ (عليه السلام) کے ساتھ کفر نہیں کیا؟\n(3) پہلے مفہوم کے اعتبار سے دونوں سے مراد حضرت موسیٰ وہارون علیہماالسلام ہوں گے اور سِحْرَانِ بمعنی سَاحِرَانِ ہوگا۔ اور دوسرے مفہوم میں اس سے قرآن اور تورات مراد ہوں گے یعنی دونوں جادو ہیں جو ایک دوسرے کے مددگار ہیں اور ہم سب کے یعنی موسیٰ (عليه السلام) اور محمد (صلى الله عليه وسلم) کے منکر ہیں۔ (فتح القدیر)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"falammā jāahumu al-ḥaqu min ʿindinā qālū lawlā ūtiya mith'la mā ūtiya mūsā awalam yakfurū bimā ūtiya mūsā min qablu qālū siḥ'rāni taẓāharā waqālū innā bikullin kāfirūna ","translations":["But when","came to them","the truth","from Us","from Us","they said","Why not","he was given","(the) like","(of) what","was given","(to) Musa","Did not","they disbelieve","in what","was given","(to) Musa","before","before","They said","Two magic (works)","supporting each other","And they said","Indeed, we","in all","(are) disbelievers","(48)"],"transliterationArr":["falammā","jāahumu","al-ḥaqu","min","ʿindinā","qālū","lawlā","ūtiya","mith'la","mā","ūtiya","mūsā","awalam","yakfurū","bimā","ūtiya","mūsā","min","qablu","qālū","siḥ'rāni","taẓāharā","waqālū","innā","bikullin","kāfirūna",null],"verseTiming":[[1,0,1870],[2,1870,4250],[3,4250,5160],[4,5160,5520],[5,5520,7130],[6,7130,8010],[7,8010,8690],[8,8690,10570],[9,10570,11760],[10,11760,13660],[11,13660,14520],[12,14520,15470],[13,15470,16960],[14,16960,18100],[15,18100,20220],[16,20220,21120],[17,21120,21960],[18,21960,22930],[19,22930,23920],[20,23920,25080],[21,25080,26280],[22,26280,27650],[23,27650,30240],[24,30240,31600],[25,31600,32320],[26,32320,33440],[27,33440,36425]]}}