{"name":"28:56","price":"آپ جسے چاہیں ہدایت نہیں کر سکتے بلکہ اللہ تعالیٰ ہی جسے چاہے ہدایت کرتا ہے۔ ہدایت والوں سے وہی خوب آگاه ہے.(1)","arabic":"إِنَّكَ لَا تَهۡدِي مَنۡ أَحۡبَبۡتَ وَلَٰكِنَّ ٱللَّهَ يَهۡدِي مَن يَشَآءُۚ وَهُوَ أَعۡلَمُ بِٱلۡمُهۡتَدِينَ","category":["28 (Al-Qasas)","Al-Qasas","Surah Al-Qasas","Chapter Al-Qasas","Qasas","Surah Qasas","Chapter Qasas","Al Qasas","Surah Al Qasas","Chapter Al Qasas","Surah 28","Chapter 28","The Stories","القَصَص"],"ayahNumber":3308,"juzNumber":20,"footnotes":"(1) یہ آیت اس وقت نازل ہوئی، جب نبی (صلى الله عليه وسلم) کے ہمدرد اور غم گسار چچا جناب ابو طالب کا انتقال ہونے لگا تو آپ (صلى الله عليه وسلم) نے کوشش فرمائی کہ چچا اپنی زبان سے ایک مرتبہ لا إِلَهَ إِلا اللهُ کہہ دیں تاکہ قیامت والے دن میں اللہ سے ان کی مغفرت کی سفارش کرسکوں۔ لیکن وہاں دوسرے روسائے قریش کی موجودگی کی وجہ سے ابو طالب قبول ایمان کی سعادت سے محروم رہے اور کفر پر ہی ان کا خاتمہ ہوگیا۔ نبی (صلى الله عليه وسلم) کو اس بات کا بڑا قلق اور صدمہ تھا۔ اس موقعے پر اللہ تعالیٰ نے یہ آیت نازل فرما کر نبی (صلى الله عليه وسلم) پر واضح کیا کہ آپ کا کام صرف تبلیغ ودعوت اور رہنمائی ہے۔ لیکن ہدایت کے راستے پر چلا دینا، یہ ہمارا کام ہے، ہدایت اسے ہی ملے گی جسے ہم ہدایت سے نوازنا چاہیں نہ کہ اسے جسے آپ ہدایت پر دیکھنا پسند کریں۔ (صحيح بخاري، تفسير سورة القصص- مسلم، كتاب الإيمان، باب أول الإيمان- قول لا إله إلا الله)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"innaka lā tahdī man aḥbabta walākinna al-laha yahdī man yashāu wahuwa aʿlamu bil-muh'tadīna ","translations":["Indeed, you","(can) not","guide","whom","you love","but","Allah","guides","whom","He wills","And He","(is) most knowing","(of) the guided ones","(56)"],"transliterationArr":["innaka","lā","tahdī","man","aḥbabta","walākinna","al-laha","yahdī","man","yashāu","wahuwa","aʿlamu","bil-muh'tadīna",null],"verseTiming":[[1,0,1520],[2,1520,1910],[3,1910,2850],[4,2850,3260],[5,3260,4290],[6,4290,6000],[7,6000,6890],[8,6890,7830],[9,7830,8090],[10,8090,12040],[11,12040,12590],[12,12590,13500],[13,13500,17925]]}}