{"name":"28:78","price":"قارون نے کہا یہ سب کچھ مجھے میری اپنی سمجھ کی بنا پر ہی دیا گیا ہے(1) ، کیا اسے اب تک یہ نہیں معلوم کہ اللہ تعالیٰ نے اس سے پہلے بہت سے بستی والوں کو غارت کر دیا جو اس سے بہت زیاده قوت والے اور بہت بڑی جمع پونجی والے تھے(2)۔ اور گنہگاروں سے ان کے گناہوں کی باز پرس ایسے وقت نہیں کی جاتی.(3)","arabic":"قَالَ إِنَّمَآ أُوتِيتُهُۥ عَلَىٰ عِلۡمٍ عِندِيٓۚ أَوَلَمۡ يَعۡلَمۡ أَنَّ ٱللَّهَ قَدۡ أَهۡلَكَ مِن قَبۡلِهِۦ مِنَ ٱلۡقُرُونِ مَنۡ هُوَ أَشَدُّ مِنۡهُ قُوَّةٗ وَأَكۡثَرُ جَمۡعٗاۚ وَلَا يُسۡـَٔلُ عَن ذُنُوبِهِمُ ٱلۡمُجۡرِمُونَ","category":["28 (Al-Qasas)","Al-Qasas","Surah Al-Qasas","Chapter Al-Qasas","Qasas","Surah Qasas","Chapter Qasas","Al Qasas","Surah Al Qasas","Chapter Al Qasas","Surah 28","Chapter 28","The Stories","القَصَص"],"ayahNumber":3330,"juzNumber":20,"footnotes":"(1) ان نصیحتوں کے جواب میں اس نے یہ کہا۔ اس کا مطلب ہے کہ مجھے کسب وتجارت کا جو فن آتا ہے، یہ دولت تو اس کا نتیجہ اور ثمر ہے، اللہ کے فضل وکرم سے اس کا کیا تعلق ہے؟ دوسرے معنی یہ کیے گئے ہیں کہ اللہ نے مجھے یہ مال دیا ہے تو اس نے اپنے علم کی وجہ سے دیا ہے کہ میں اس کا مستحق ہوں اور میرے لیے اس نے یہ پسند کیا ہے۔ جیسے دوسرے مقام پر انسانوں کا ایک اور قول اللہ نے نقل فرمایا ہے (جب انسان کو تکلیف پہنچتی ہے تو ہمیں پکارتا ہے، پھر جب ہم اسے اپنی نعمت سے نواز دیتے ہیں تو کہتا ہے «إِنَّمَا أُوتِيتُهُ عَلَى عِلْمٍ» (القصص۔ 78) أَيْ: عَلَى عِلْمٍ مِنَ اللهِ یعنی ”مجھے یہ نعمت اس لیے ملی ہے کہ اللہ کے علم میں میں اس کا مستحق تھا“۔ ایک مقام پر ہے جب ہم انسان پر تکلیف کے بعد اپنی رحمت کرتے ہیں تو کہتا ہے هَذَا لِي (حم السجدة: 50) أَيْ: هَذَا أَسْتَحِقُّهُ یہ تو میرا استحقاق ہے (ابن کثیر) بعض کہتے ہیں کہ قارون کو کیمیا (سونا بنانے کا) علم آتا تھا، یہاں یہی مراد ہے اسی کیمیا گری سے اس نے اتنی دولت کمائی تھی۔ لیکن امام ابن کثیر فرماتے ہیں کہ یہ علم سراسر جھوٹ، فریب اور دھوکہ ہے۔ کوئی شخص اس بات پر قادر نہیں ہے کہ وہ کسی چیز کی ماہیت تبدیل کر دے۔ اس لیے قارون کے لیے بھی یہ ممکن نہیں تھا کہ وہ دوسری دھاتوں کو تبدیل کر کے سونا بنا لیا کرتا اور اس طرح دولت کے انبار جمع کر لیتا۔\n(2) یعنی قوت اور مال کی فراوانی ، یہ فضیلت کا باعث نہیں۔ اگر ایسا ہوتا تو پچھلی قومیں تباہ وبرباد نہ ہوتیں۔ اس لیے قارون کا اپنی دولت پر گھمنڈ کرنے اور اسے باعث فضیلت گرداننے کا کوئی جواز نہیں۔\n(3) یعنی جب گناہ اتنی زیادہ تعداد میں ہوں کہ ان کی وجہ سے وہ مستحق عذاب قرار دے دیئے گئے ہوں تو پھر ان سے باز پرس نہیں ہوتی، بلکہ اچانک ان کا مواخذہ کر لیا جاتا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qāla innamā ūtītuhu ʿalā ʿil'min ʿindī awalam yaʿlam anna al-laha qad ahlaka min qablihi mina al-qurūni man huwa ashaddu min'hu quwwatan wa-aktharu jamʿan walā yus'alu ʿan dhunūbihimu al-muj'rimūna ","translations":["He said","Only","I have been given it","on (account)","(of) knowledge","I have","Did not","he know","that","Allah","indeed","destroyed","before him","before him","of","the generations","who","[they]","(were) stronger","than him","(in) strength","and greater","(in) accumulation","And not","will be questioned","about","their sins","the criminals","(78)"],"transliterationArr":["qāla","innamā","ūtītuhu","ʿalā","ʿil'min","ʿindī","awalam","yaʿlam","anna","al-laha","qad","ahlaka","min","qablihi","mina","al-qurūni","man","huwa","ashaddu","min'hu","quwwatan","wa-aktharu","jamʿan","walā","yus'alu","ʿan","dhunūbihimu","al-muj'rimūna",null],"verseTiming":[[1,0,730],[2,730,3920],[3,3920,5430],[4,5430,6120],[5,6120,6930],[6,6930,9290],[7,9290,10100],[8,10100,10930],[9,10930,11980],[10,11980,12930],[11,12930,13290],[12,13290,14170],[13,14170,15160],[14,15160,16160],[15,16160,16490],[16,16490,17660],[17,17660,18030],[18,18030,18400],[19,18400,19340],[20,19340,19950],[21,19950,21150],[22,21150,22400],[23,22400,23350],[24,23350,24450],[25,24450,25280],[26,25280,26320],[27,26320,27540],[28,27540,30705]]}}