{"name":"28:73","price":"اسی نے تو تمہارے لیے اپنے فضل وکرم سے دن رات مقرر کر دیے ہیں کہ تم رات میں آرام کرو اور دن میں اس کی بھیجی ہوئی روزی تلاش کرو(1) ، یہ اس لیے کہ تم شکر ادا کرو.(2)","arabic":"وَمِن رَّحۡمَتِهِۦ جَعَلَ لَكُمُ ٱلَّيۡلَ وَٱلنَّهَارَ لِتَسۡكُنُواْ فِيهِ وَلِتَبۡتَغُواْ مِن فَضۡلِهِۦ وَلَعَلَّكُمۡ تَشۡكُرُونَ","category":["28 (Al-Qasas)","Al-Qasas","Surah Al-Qasas","Chapter Al-Qasas","Qasas","Surah Qasas","Chapter Qasas","Al Qasas","Surah Al Qasas","Chapter Al Qasas","Surah 28","Chapter 28","The Stories","القَصَص"],"ayahNumber":3325,"juzNumber":20,"footnotes":"(1) دن اور رات، یہ دونوں اللہ کی بہت بڑی نعمتیں ہیں۔ رات کو تاریک بنایا تاکہ سب لوگ آرام کرسکیں۔ اس اندھیرے کی وجہ سے ہر مخلوق سونے اور آرام کرنے پر مجبور ہے۔ ورنہ اگر آرام کرنے اور سونے کے اپنے اپنے اوقات ہوتے تو کوئی بھی مکمل طریقے سے سونے کا موقع نہ پاتا، جب کہ معاشی تگ ودو اور کاروبار جہاں کے لیے نیند کا پورا کرنا نہایت ضروری ہے۔ اس کے بغیر توانائی بحال نہیں ہوتی۔ اگر کچھ لوگ سو رہے ہوتے اور کچھ جاگ کر مصروف تگ وتاز ہوتے، تو سونے والوں کے آرام وراحت میں خلل پڑتا، نیز لوگ ایک دوسرے کے تعاون سے بھی محروم رہتے، جب کہ دنیا کا نظام ایک دوسرے کے تعاون وتناصر کا محتاج ہے اس لیے اللہ نے رات کو تاریک کر دیا تاکہ ساری مخلوق بیک وقت آرام کرے اور کوئی کسی کی نیند اور آرام میں مخل نہ ہوسکے۔ اسی طرح دن کو روشن بنایا تاکہ روشنی میں انسان اپنا کاروبار بہتر طریقے سے کرسکے۔ دن کی یہ روشنی نہ ہوتی تو انسان کو جن مشکلات کا سامنا کرنا پڑتا ، اسے ہر شخص بآسانی سمجھتا اور اس کا ادراک رکھتا ہے۔\nاللہ تعالیٰ نے اپنی ان نعمتوں کے حوالے سے اپنی توحید کا اثبات فرمایا ہے کہ بتلاؤ اگر اللہ تعالیٰ دن اور رات کا یہ نظام ختم کرکے ہمیشہ کے لیے تم پر رات ہی مسلط کر دے۔ تو کیا اللہ کے سوا کوئی اور معبود ایسا ہے جو تمہیں دن کی روشنی عطا کر دے؟ یا اگر وہ ہمیشہ کے لیے دن ہی دن رکھے تو کیا کوئی تمہیں رات کی تاریکی سے بہرہ ور کرسکتا ہے، جس میں تم آرام کرسکو؟ نہیں۔ یقیناً نہیں۔ یہ صرف اللہ کی کمال مہربانی ہے کہ اس نے دن اور رات کا ایسا نظام قائم کر دیا ہے کہ رات آتی ہے تو دن کی روشنی ختم ہو جاتی ہے اور تمام مخلوق آرام کر لیتی ہے اور رات جاتی ہے تو دن کی روشنی سے کائنات کی ہر چیز نمایاں اور واضح تر ہو جاتی ہے اور انسان کسب ومحنت کے ذریعے سے اللہ کا فضل (روزی) تلاش کرتا ہے۔\n(2) یعنی اللہ کی حمدوثنا بھی بیان کرو (یہ زبانی شکر ہے) اور اللہ کی دی ہوئی دولت، صلاحیتوں اور توانائیوں کو اس کے احکام وہدایات کے مطابق استعمال کرو۔ (یہ عملی شکر ہے)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wamin raḥmatihi jaʿala lakumu al-layla wal-nahāra litaskunū fīhi walitabtaghū min faḍlihi walaʿallakum tashkurūna ","translations":["And from","His Mercy","He made","for you","the night","and the day","that you may rest","therein","and that you may seek","from","His Bounty","and so that you may","be grateful","(73)"],"transliterationArr":["wamin","raḥmatihi","jaʿala","lakumu","al-layla","wal-nahāra","litaskunū","fīhi","walitabtaghū","min","faḍlihi","walaʿallakum","tashkurūna",null],"verseTiming":[[1,0,390],[2,390,1900],[3,1900,2560],[4,2560,3120],[5,3120,4000],[6,4000,5550],[7,5550,6700],[8,6700,7370],[9,7370,8800],[10,8800,9610],[11,9610,11610],[12,11610,13020],[13,13020,13400],[14,13400,15240],[15,15240,16660],[16,16660,19815]]}}