{"name":"28:7","price":"ہم نے موسیٰ (علیہ السلام) کی ماں کو وحی کی(1) کہ اسے دودھ پلاتی ره اور جب تجھے اس کی نسبت کوئی خوف معلوم ہو تو اسے دریا میں بہا دینا اور کوئی ڈر خوف یا رنج غم نہ کرنا(2)، ہم یقیناً اسے تیری طرف لوٹانے والے ہیں(3) اور اسے اپنے پیغمبروں میں بنانے والے ہیں.","arabic":"وَأَوۡحَيۡنَآ إِلَىٰٓ أُمِّ مُوسَىٰٓ أَنۡ أَرۡضِعِيهِۖ فَإِذَا خِفۡتِ عَلَيۡهِ فَأَلۡقِيهِ فِي ٱلۡيَمِّ وَلَا تَخَافِي وَلَا تَحۡزَنِيٓۖ إِنَّا رَآدُّوهُ إِلَيۡكِ وَجَاعِلُوهُ مِنَ ٱلۡمُرۡسَلِينَ","category":["28 (Al-Qasas)","Al-Qasas","Surah Al-Qasas","Chapter Al-Qasas","Qasas","Surah Qasas","Chapter Qasas","Al Qasas","Surah Al Qasas","Chapter Al Qasas","Surah 28","Chapter 28","The Stories","القَصَص"],"ayahNumber":3259,"juzNumber":20,"footnotes":"(1) وحی سے مراد یہاں دل میں بات ڈالنا ہے، وہ وحی نہیں ہے ، جو انبیا پر فرشتے کے ذریعے سے نازل کی جاتی تھی اور اگر فرشتے کے ذریعے سے بھی آئی ہو، تب بھی اس ایک وحی سے ام موسیٰ (عليه السلام) کا نبی ہونا ثابت نہیں ہوتا، کیونکہ فرشتے بعض دفعہ عام انسانوں کے پاس بھی آجاتے ہیں۔ جیسے حدیث میں اقرع، ابرص اور اعمی کے پاس فرشتوں کا آنا ثابت ہے۔ (متفق علیہ، بخاری، کتاب احادیث الانبیاء)\n(2) یعنی دریا میں ڈوب جانے یا ضائع ہو جانے سے نہ ڈرنا اور اس کی جدائی کا غم نہ کرنا۔\n(3) یعنی ایسے طریقے سے کہ جس سے اس کی نجات یقینی ہو، کہتے ہیں کہ جب قتل اولاد کا یہ سلسلہ زیادہ ہوا تو فرعون کی قوم کو خطرہ لاحق ہوا کہ کہیں بنی اسرائیل کی نسل ہی ختم نہ ہو جائے اور پھر مشقت والے کام ہمیں نہ کرنے پڑیں۔ اس اندیشے کا ذکر انہوں نے فرعون سے کیا، جس پر نیا حکم جاری کر دیا گیا کہ ایک سال بچے قتل کئے اور ایک سال چھوڑ دیئے جائیں۔ حضرت ہارون (عليه السلام) اس سال پیدا ہوئے جس میں بچے قتل نہیں کیے جاتے تھے، جب کہ موسیٰ (عليه السلام) قتل والے سال میں پیدا ہوئے۔ لیکن اللہ تعالیٰ نے ان کی حفاظت کا سروسامان اس طرح پیدا فرمایا کہ ایک تو ان کی والدہ پر حمل کے آثار اس طرح ظاہر نہیں فرمائے، جس سے وہ فرعون کی چھوڑی ہوئی دائیوں کی نگاہ میں آجائیں۔ اس لیے ولادت کا مرحلہ تو خاموشی کے ساتھ ہوگیا اور یہ واقعہ حکومت کے منصوبہ بندوں کے علم میں نہیں آیا، لیکن ولادت کے بعد قتل کا اندیشہ موجود تھا، جس کا حل خود اللہ تعالیٰ نے وحی والقا کے ذریعے سے موسیٰ (عليه السلام) کی ماں کو سمجھا دیا۔ چنانچہ انہوں نے اسے تابوت میں لٹا کر دریائے نیل میں ڈال دیا۔ (ابن کثیر)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-awḥaynā ilā ummi mūsā an arḍiʿīhi fa-idhā khif'ti ʿalayhi fa-alqīhi fī al-yami walā takhāfī walā taḥzanī innā rāddūhu ilayki wajāʿilūhu mina al-mur'salīna ","translations":["And We inspired","[to]","(the) mother","(of) Musa","that","Suckle him","but when","you fear","for him","then cast him","in(to)","the river","and (do) not","fear","and (do) not","grieve","Indeed, We","(will) restore him","to you","and (will) make him","of","the Messengers","(7)"],"transliterationArr":["wa-awḥaynā","ilā","ummi","mūsā","an","arḍiʿīhi","fa-idhā","khif'ti","ʿalayhi","fa-alqīhi","fī","al-yami","walā","takhāfī","walā","taḥzanī","innā","rāddūhu","ilayki","wajāʿilūhu","mina","al-mur'salīna",null],"verseTiming":[[1,0,3490],[2,3490,5700],[3,5700,6760],[4,6760,9340],[5,9340,9830],[6,9830,12980],[7,12980,14020],[8,14020,14700],[9,14700,15630],[10,15630,16940],[11,16940,17190],[12,17190,18560],[13,18560,19210],[14,19210,20400],[15,20400,21050],[16,21050,22960],[17,22960,24430],[18,24430,28500],[19,28500,29450],[20,29450,30920],[21,30920,31340],[22,31340,34295]]}}