{"name":"28:80","price":"ذی علم لوگ انہیں سمجھانے لگے کہ افسوس! بہتر چیز تو وه ہے جو بطور ﺛواب انہیں ملے گی جو اللہ پر ایمان ﻻئیں اور نیک عمل کریں(1) یہ بات انہی کے(2) دل میں ڈالی جاتی ہے جو صبر وسہارا والے ہوں.","arabic":"وَقَالَ ٱلَّذِينَ أُوتُواْ ٱلۡعِلۡمَ وَيۡلَكُمۡ ثَوَابُ ٱللَّهِ خَيۡرٞ لِّمَنۡ ءَامَنَ وَعَمِلَ صَٰلِحٗاۚ وَلَا يُلَقَّىٰهَآ إِلَّا ٱلصَّٰبِرُونَ","category":["28 (Al-Qasas)","Al-Qasas","Surah Al-Qasas","Chapter Al-Qasas","Qasas","Surah Qasas","Chapter Qasas","Al Qasas","Surah Al Qasas","Chapter Al Qasas","Surah 28","Chapter 28","The Stories","القَصَص"],"ayahNumber":3332,"juzNumber":20,"footnotes":"(1) یعنی جن کے پاس دین کا علم تھااور دنیا اور اس کے مظاہر کی اصل حقیقت سے باخبر تھے، انہوں نے کہا کہ یہ کیا ہے؟ کچھ بھی نہیں۔ اللہ نے اہل ایمان اور اعمال صالح بجا لانے والوں کے لیے جو اجر وثواب رکھا ہے، وہ اس سے کہیں زیادہ بہتر ہے۔ جیسے حدیث قدسی میں ہے۔ اللہ تعالیٰ فرماتا ہے : ”میں نے اپنے نیک بندوں کے لیے ایسی ایسی چیزیں تیار کر رکھی ہیں جنہیں کسی آنکھ نے نہیں دیکھا، کسی کان نے نہیں سنا اور نہ کسی کے وہم وگمان میں ان کا گزر ہوا“۔ (البخاري، كتاب التوحيد، باب قول الله تعالى يريدون أن يبدلوا كلام الله، ومسلم، كتاب الإيمان، باب أدنى أهل الجنة منزلة)\n(2) یعنی يُلَقَّاهَا میں ”ھا“ کا مرجع، کلمہ ہے اور یہ قول اللہ کا ہے۔ اور اگر اسے اہل علم ہی کے قول کا تتمہ قرار دیا جائے تو ھا کا مرجع جنت ہوگی یعنی جنت کے مستحق وہ صابر ہی ہوں گے جو دنیاوی لذتوں سے کنارہ کش اور آخرت کی زندگی میں رغبت رکھنے والے ہوں گے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waqāla alladhīna ūtū al-ʿil'ma waylakum thawābu al-lahi khayrun liman āmana waʿamila ṣāliḥan walā yulaqqāhā illā al-ṣābirūna ","translations":["But said","those who","were given","the knowledge","Woe to you","(The) reward","(of) Allah","(is) better","for (he) who","believes","and does","righteous (deeds)","And not","it is granted","except","(to) the patient ones","(80)"],"transliterationArr":["waqāla","alladhīna","ūtū","al-ʿil'ma","waylakum","thawābu","al-lahi","khayrun","liman","āmana","waʿamila","ṣāliḥan","walā","yulaqqāhā","illā","al-ṣābirūna",null],"verseTiming":[[1,0,870],[2,870,1920],[3,1920,2610],[4,2610,3490],[5,3490,4500],[6,4500,5330],[7,5330,6190],[8,6190,6910],[9,6910,7680],[10,7680,8550],[11,8550,9310],[12,9310,10650],[13,10650,11690],[14,11690,14630],[15,14630,15150],[16,15150,18365]]}}