{"name":"29:18","price":"اور اگر تم جھٹلاؤ تو تم سے پہلے کی امتوں نے بھی جھٹلایا ہے(1) ، رسول کے ذمہ تو صرف صاف طور پر پہنچا دینا ہی ہے.(2)","arabic":"وَإِن تُكَذِّبُواْ فَقَدۡ كَذَّبَ أُمَمٞ مِّن قَبۡلِكُمۡۖ وَمَا عَلَى ٱلرَّسُولِ إِلَّا ٱلۡبَلَٰغُ ٱلۡمُبِينُ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut","Chapter Al-Ankabut","Ankabut","Surah Ankabut","Chapter Ankabut","Al Ankabut","Surah Al Ankabut","Chapter Al Ankabut","Surah 29","Chapter 29","The Spider","العَنكَبُوت"],"ayahNumber":3358,"juzNumber":20,"footnotes":"(1) یہ حضرت ابراہیم (عليه السلام) کا قول بھی ہوسکتا ہے، جو انہوں نے اپنی قوم سے کہا۔ یا اللہ تعالیٰ کا قول ہے جس میں اہل مکہ سے خطاب ہے اور اس میں نبی (صلى الله عليه وسلم) کو تسلی دی جارہی ہے کہ کفار مکہ اگر آپ کو جھٹلا رہے ہیں، تو اس سے گھبرانے کی ضرورت نہیں ہے۔ پیغمبروں کے ساتھ یہی ہوتا آیا ہے۔ پہلی امتیں بھی رسولوں کو جھٹلاتی اور اس کا نتیجہ بھی وہ ہلاکت وتباہی کی صورت میں بھگتتی رہی ہیں۔\n(2) اس لیے آپ بھی تبلیغ کا کام کرتے رہیے۔ اس سے کوئی راہ یاب ہوتا ہے یا نہیں؟ اس کے ذمے دار آپ نہیں ہیں، نہ آپ سے اس کی بابت پوچھا ہی جائے گا، کیونکہ ہدایت دینا نہ دینا یہ صرف اللہ کے اختیار میں ہے، جو اپنی سنت کے مطابق، جس میں ہدایت کی طلب صادق دیکھتا ہے، اس کو ہدایت سے نواز دیتا ہے۔ دوسروں کو ضلالت کی تاریکیوں میں بھٹکتا ہوا چھوڑ دیتا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-in tukadhibū faqad kadhaba umamun min qablikum wamā ʿalā al-rasūli illā al-balāghu al-mubīnu ","translations":["And if","you deny","then verily","denied","(the) nations","before you","before you","And not","(is) on","the Messenger","except","the conveyance","clear","(18)"],"transliterationArr":["wa-in","tukadhibū","faqad","kadhaba","umamun","min","qablikum","wamā","ʿalā","al-rasūli","illā","al-balāghu","al-mubīnu",null],"verseTiming":[[1,0,1320],[2,1320,2530],[3,2530,3210],[4,3210,4090],[5,4090,4880],[6,4880,5900],[7,5900,8080],[8,8080,8610],[9,8610,9070],[10,9070,10050],[11,10050,10620],[12,10620,11630],[13,11630,14675]]}}