{"name":"29:17","price":"تم تو اللہ تعالیٰ کے سوا بتوں کی پوجا پاٹ کر رہے ہو اور جھوٹی باتیں دل سے گھڑ لیتے ہو(1) ۔ سنو! جن جنکی تم اللہ تعالیٰ کے سوا پوجا پاٹ کر رہے ہو وه تو تمہاری روزی کے مالک نہیں پس تمہیں چاہئے کہ تم اللہ تعالیٰ ہی سے روزیاں طلب کرو اور اسی کی عبادت کرو اور اسی کی شکر گزاری(2) کرو اور اسی کی طرف تم لوٹائے جاؤ گے.(3)","arabic":"إِنَّمَا تَعۡبُدُونَ مِن دُونِ ٱللَّهِ أَوۡثَٰنٗا وَتَخۡلُقُونَ إِفۡكًاۚ إِنَّ ٱلَّذِينَ تَعۡبُدُونَ مِن دُونِ ٱللَّهِ لَا يَمۡلِكُونَ لَكُمۡ رِزۡقٗا فَٱبۡتَغُواْ عِندَ ٱللَّهِ ٱلرِّزۡقَ وَٱعۡبُدُوهُ وَٱشۡكُرُواْ لَهُۥٓۖ إِلَيۡهِ تُرۡجَعُونَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut","Chapter Al-Ankabut","Ankabut","Surah Ankabut","Chapter Ankabut","Al Ankabut","Surah Al Ankabut","Chapter Al Ankabut","Surah 29","Chapter 29","The Spider","العَنكَبُوت"],"ayahNumber":3357,"juzNumber":20,"footnotes":"(1) أَوْثَانٌ وَثَنٌ کی جمع ہے۔ جس طرح أَصْنَامٌ، صَنَمٌ کی جمع ہے۔ دونوں کے معنی بت کے ہیں۔ بعض کہتے ہیں صنم ، سونے، چاندی، پیتل اور پتھر کی مورت کو اور وثن مورت کو بھی اور چونے کے پتھر وغیرہ کے بنے ہوئے آستانوں کو بھی کہتے ہیں۔ تَخْلُقُونَ إِفْكًا کے معنی ہیں تُكَذِّبُونَ كَذِبًا ، جیسا کہ متن کے ترجمہ سے واضح ہے۔ دوسرے معنی ہیں تَعْمَلُونَهَا وَتَنْحِتُونَهَا لِلإِفْكِ ، جھوٹے مقصد کے لیے انہیں بناتے اور گھڑتے ہو۔ مفہوم کے اعتبار سے دونوں ہی معنی صحیح ہیں۔ یعنی اللہ کو چھوڑ کر تم جن بتوں کی عبادت کرتے ہو، وہ تو پتھر کے بنے ہوئے ہیں جو سن سکتے ہیں نہ دیکھ سکتے ہیں، نقصان پہنچا سکتے ہیں نہ نفع۔ اپنے دل سے ہی تم نے انہیں گھڑ لیا ہے کوئی دلیل تو ان کی صداقت کی تمہارے پاس نہیں ہے۔ یا یہ بت تو وہ ہیں جنہیں تم خود اپنے ہاتھوں سے تراشتے اور گھڑتے ہو اور جب ان کی ایک خاص شکل وصورت بن جاتی ہے تو تم سمجھتے ہو کہ اب ان میں خدائی اختیارات آگئے ہیں اور ان سے تم امیدیں وابستہ کرکے انہیں حاجت روا اور مشکل کشا باور کر لیتے ہو۔\n(2) یعنی جب یہ بت تمہاری روزی کے اسباب ووسائل میں سے کسی بھی چیز کے مالک نہیں ہیں، نہ بارش برسا سکتے ہیں، نہ زمین میں درخت اگا سکتے ہیں اور نہ سورج کی حرارت پہنچا سکتے ہیں اور نہ تمہیں وہ صلاحیتیں دے سکتے ہیں، جنہیں بروئے کار لاکر تم قدرت کی ان چیزوں سے فیض یاب ہوتے ہو، تو پھر تم روزی اللہ ہی سے طلب کرو، اسی کی عبادت اور اسی کی شکر گزاری کرو۔\n(3) یعنی مرکر اور پھر دوبارہ زندہ ہوکر جب اسی کی طرف لوٹنا ہے، اسی کی بارگاہ میں پیش ہونا ہے تو پھر اس کا در چھوڑ کر دوسروں کے در پر اپنی جبین نیاز کیوں جھکاتے ہو؟ اس کے بجائے دوسروں کی عبادت کیوں کرتے؟ اور دوسروں کو حاجت روا اور مشکل کشا کیوں سمجھتے ہو؟","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"innamā taʿbudūna min dūni al-lahi awthānan watakhluqūna if'kan inna alladhīna taʿbudūna min dūni al-lahi lā yamlikūna lakum riz'qan fa-ib'taghū ʿinda al-lahi al-riz'qa wa-uʿ'budūhu wa-ush'kurū lahu ilayhi tur'jaʿūna ","translations":["Only","you worship","besides","besides","Allah","idols","and you create","falsehood","Indeed","those whom","you worship","besides","besides","Allah","(do) not","possess","for you","any provision","So seek","from","Allah","the provision","and worship Him","and be grateful","to Him","To Him","you will be returned","(17)"],"transliterationArr":["innamā","taʿbudūna","min","dūni","al-lahi","awthānan","watakhluqūna","if'kan","inna","alladhīna","taʿbudūna","min","dūni","al-lahi","lā","yamlikūna","lakum","riz'qan","fa-ib'taghū","ʿinda","al-lahi","al-riz'qa","wa-uʿ'budūhu","wa-ush'kurū","lahu","ilayhi","tur'jaʿūna",null],"verseTiming":[[1,0,1800],[2,1800,3050],[3,3050,4030],[4,4030,4700],[5,4700,5540],[6,5540,7210],[7,7210,8600],[8,8600,9630],[9,9630,11430],[10,11430,12430],[11,12430,13840],[12,13840,14760],[13,14760,15420],[14,15420,16320],[15,16320,16720],[16,16720,17950],[17,17950,18560],[18,18560,20190],[19,20190,21290],[20,21290,22560],[21,22560,23420],[22,23420,24240],[23,24240,25520],[24,25520,26430],[25,26430,27520],[26,27520,28370],[27,28370,30945]]}}