{"name":"29:11","price":"جو لوگ ایمان ﻻئے اللہ انہیں بھی ﻇاہر کرکے رہے گا اور منافقوں کو بھی ﻇاہر کرکے رہے گا.(1)","arabic":"وَلَيَعۡلَمَنَّ ٱللَّهُ ٱلَّذِينَ ءَامَنُواْ وَلَيَعۡلَمَنَّ ٱلۡمُنَٰفِقِينَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut","Chapter Al-Ankabut","Ankabut","Surah Ankabut","Chapter Ankabut","Al Ankabut","Surah Al Ankabut","Chapter Al Ankabut","Surah 29","Chapter 29","The Spider","العَنكَبُوت"],"ayahNumber":3351,"juzNumber":20,"footnotes":"(1) اس کا مطلب ہے کہ اللہ تعالیٰ خوشی اور تکلیف دے کر آزمائے گا تاکہ منافق اور مومن کی تمیز ہو جائے جو دونوں حالتوں میں اللہ کی اطاعت کرے گا، وہ مومن ہے اور جو صرف خوشی اور راحت میں اطاعت کرے گا تو اس کے معنی یہ ہیں کہ وہ صرف اپنے حظ نفس کا مطیع ہے ، اللہ کا نہیں۔ جس طرح دوسرے مقام پر فرمایا: «وَلَنَبْلُوَنَّكُمْ حَتَّى نَعْلَمَ الْمُجَاهِدِينَ مِنْكُمْ وَالصَّابِرِينَ وَنَبْلُوَ أَخْبَارَكُمْ» (سورة محمد: 31) ”ہم تمہیں ضرور آزمائیں گے، تاکہ ہم جان لیں تم میں مجاہد اور صابر کون ہیں اور تمہارے دیگر حالت بھی جانچیں گے“۔ جنگ احد کے بعد، جس میں مسلمان اختیار وامتحان کی بھٹی سے گزارے گئے تھے، فرمایا: «مَا كَانَ اللَّهُ لِيَذَرَ الْمُؤْمِنِينَ عَلَى مَا أَنْتُمْ عَلَيْهِ حَتَّى يَمِيزَ الْخَبِيثَ مِنَ الطَّيِّبِ» (سورة آل عمران: 179) ”نہیں ہے اللہ تعالیٰ کہ وہ چھوڑ دے مومنوں کو، اس حالت پر جس پر کہ تم ہو، یہاں تک کہ وہ جدا کر دے ناپاک کو پاک سے“۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walayaʿlamanna al-lahu alladhīna āmanū walayaʿlamanna al-munāfiqīna ","translations":["And Allah will surely make evident","And Allah will surely make evident","those who","believe","And He will surely make evident","the hypocrites","(11)"],"transliterationArr":["walayaʿlamanna","al-lahu","alladhīna","āmanū","walayaʿlamanna","al-munāfiqīna",null],"verseTiming":[[1,0,52688],[2,52688,53542],[3,53542,54544],[4,54544,55615],[5,55615,58081],[6,58081,60846]]}}