{"name":"29:29","price":"کیا تم مردوں کے پاس بدفعلی کے لیے آتے ہو(1) اور راستے بند کرتے ہو(2) اور اپنی عام مجلسوں میں بے حیائیوں کا کام کرتے ہو(3)؟ اس کے جواب میں اس کی قوم نے بجز اس کے اور کچھ نہیں کہا کہ بس(4) جا اگر سچا ہے تو ہمارے پاس اللہ تعالیٰ کا عذاب لے آ.","arabic":"أَئِنَّكُمۡ لَتَأۡتُونَ ٱلرِّجَالَ وَتَقۡطَعُونَ ٱلسَّبِيلَ وَتَأۡتُونَ فِي نَادِيكُمُ ٱلۡمُنكَرَۖ فَمَا كَانَ جَوَابَ قَوۡمِهِۦٓ إِلَّآ أَن قَالُواْ ٱئۡتِنَا بِعَذَابِ ٱللَّهِ إِن كُنتَ مِنَ ٱلصَّٰدِقِينَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut","Chapter Al-Ankabut","Ankabut","Surah Ankabut","Chapter Ankabut","Al Ankabut","Surah Al Ankabut","Chapter Al Ankabut","Surah 29","Chapter 29","The Spider","العَنكَبُوت"],"ayahNumber":3369,"juzNumber":20,"footnotes":"(1) یعنی تمہاری شہوت پرستی اس انتہا کو پہنچ گئی ہے کہ اس کے لیے طبعی طریقے تمہارے لیے ناکافی ہوگئے ہیں اور غیر طبعی طریقہ تم نے اختیار کر لیا ہے۔ جنسی شہوت کی تسکین کے لیے طبعی طریقہ اللہ تعالیٰ نے بیویوں سے مباشرت کی صورت میں رکھا ہے۔ اسے چھوڑ کر اس کام کے لیے مردوں کی دبر استعمال کرنا غیر فطری اور غیر طبعی طریقہ ہے۔\n(2) اس کے ایک معنی تو یہ کیے گئے ہیں کہ آنے جانے والے مسافروں، نوواردوں اور گزرنے والوں کو زبردستی پکڑ پکڑ کر تم ان سے بےحیائی کا کام کرتے ہو، جس سے لوگوں کے لیے راستوں سے گزرنا مشکل ہوگیا اور لوگ گھروں میں بیٹھے رہنے میں عافیت سمجھتے ہیں۔ دوسرے معنی ہیں کہ تم آنے جانے والوں کو لوٹ لیتے اور قتل کر دیتے ہو یا ازراہ شرارت انہیں کنکریاں مارتے ہو۔ تیسرے معنی کیے گئے ہیں کہ سرراہ ہی بےحیائی کا ارتکاب کرتے ہو جس سے وہاں سے گزرتے ہوئے لوگ شرم محسوس کرتے ہیں۔ ان تمام صورتوں سے راستے بند ہو جاتے ہیں۔ امام شوکانی فرماتے ہیں کہ کسی ایک خاص سبب کی تعیین تو مشکل ہے تاہم وہ ایسا کام ضرور کرتے تھے ، جس سے عملاً راستہ بند ہو جاتا تھا۔ قطع طریق کے ایک معنی قطع نسل کے بھی کیے گئے ہیں۔ یعنی عورتوں کی شرم گاہوں کو استعمال کرنے کے بجائے مردوں کی دبر استعمال کرکے تم اپنی نسل بھی منقطع کرنے میں لگے ہوئےہو۔ (فتح القدیر)\n(3) یہ بےحیائی کیا تھی؟ اس میں بھی مختلف اقوال ہیں، مثلاً لوگوں کو کنکریاں مارنا ، اجنبی مسافر کا استہزا واستخفاف ، مجلسوں میں پاد مارنا، ایک دوسرے کے سامنے اغلام بازی، شطرنج وغیرہ قسم کی قمار بازی، رنگے ہوئے کپڑے پہننا، وغیرہ۔ امام شوکانی فرماتے ہیں (کوئی بعید نہیں کہ وہ یہ تمام ہی منکرات کرتے رہے ہوں)۔\n(4) حضرت لوط (عليه السلام) نے جب انہیں ان منکرات سے منع کیا تو اس کے جواب میں کہا . . .۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"a-innakum latatūna al-rijāla wataqṭaʿūna al-sabīla watatūna fī nādīkumu al-munkara famā kāna jawāba qawmihi illā an qālū i'tinā biʿadhābi al-lahi in kunta mina al-ṣādiqīna ","translations":["Indeed, you","approach","the men","and you cut off","the road","and commit","in","your meetings","evil","And not","was","(the) answer","(of) his people","except","that","they said","Bring upon us","(the) punishment","(of) Allah","if","you are","of","the truthful","(29)"],"transliterationArr":["a-innakum","latatūna","al-rijāla","wataqṭaʿūna","al-sabīla","watatūna","fī","nādīkumu","al-munkara","famā","kāna","jawāba","qawmihi","illā","an","qālū","i'tinā","biʿadhābi","al-lahi","in","kunta","mina","al-ṣādiqīna",null],"verseTiming":[[1,0,1850],[2,1850,3090],[3,3090,4200],[4,4200,5580],[5,5580,6720],[6,6720,7920],[7,7920,8410],[8,8410,9610],[9,9610,12050],[10,12050,12590],[11,12590,13260],[12,13260,14160],[13,14160,16150],[14,16150,18200],[15,18200,19030],[16,19030,19680],[17,19680,20500],[18,20500,21560],[19,21560,22440],[20,22440,23420],[21,23420,24650],[22,24650,25030],[23,25030,28215]]}}