{"name":"29:26","price":"پس حضرت ابراہیم (علیہ السلام) پر حضرت لوط (علیہ السلام) ایمان ﻻئے(1) اور کہنے لگے کہ میں اپنے رب کی طرف ہجرت کرنے واﻻ ہوں(2)۔ وه بڑا ہی غالب اور حکیم ہے.","arabic":"۞ فَـَٔامَنَ لَهُۥ لُوطٞۘ وَقَالَ إِنِّي مُهَاجِرٌ إِلَىٰ رَبِّيٓۖ إِنَّهُۥ هُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut","Chapter Al-Ankabut","Ankabut","Surah Ankabut","Chapter Ankabut","Al Ankabut","Surah Al Ankabut","Chapter Al Ankabut","Surah 29","Chapter 29","The Spider","العَنكَبُوت"],"ayahNumber":3366,"juzNumber":20,"footnotes":"(1) حضرت لوط (عليه السلام) ، حضرت ابراہیم (عليه السلام) کے برادر زاد تھے، یہ حضرت ابراہیم (عليه السلام) پر ایمان لائے، بعد میں ان کو بھی (سدوم) کے علاقے میں نبی بنا کر بھیجا گیا۔\n(2) یہ حضرت ابراہیم (عليه السلام) نے کہا اور بعض کے نزدیک حضرت لوط (عليه السلام) نے۔ اور بعض کہتے ہیں دونوں نے ہی ہجرت کی۔ یعنی جب ابراہیم (عليه السلام) اور ان پر ایمان لانے والے لوط (عليه السلام) کے لیے اپنے علاقے، (كوثى) میں، جو حران کی طرف جاتے ہوئے کوفے کی ایک بستی تھی، اللہ کی عبادت کرنی مشکل ہوگئی تو وہاں سے ہجرت کرکےشام کے علاقےمیں چلے گئے۔ تیسری، ان کے ساتھ حضرت ابراہیم (عليه السلام) کی اہلیہ سارہ تھیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"faāmana lahu lūṭun waqāla innī muhājirun ilā rabbī innahu huwa al-ʿazīzu al-ḥakīmu ","translations":["And believed","[in] him","Lut","and he said","Indeed I (am)","emigrating","to","my Lord","Indeed, He","[He] (is)","the All-Mighty","the All-Wise","(26)"],"transliterationArr":["faāmana","lahu","lūṭun","waqāla","innī","muhājirun","ilā","rabbī","innahu","huwa","al-ʿazīzu","al-ḥakīmu",null],"verseTiming":[[1,0,1060],[2,1060,1640],[3,1640,3590],[4,3590,5020],[5,5020,6400],[6,6400,7650],[7,7650,8220],[8,8220,9620],[9,9620,11240],[10,11240,11600],[11,11600,12750],[12,12750,15695]]}}