{"name":"29:23","price":"جو لوگ اللہ تعالیٰ کی آیتوں اور اس کی ملاقات کو بھلاتے ہیں وه میری رحمت سے ناامید ہو جائیں(1) اور ان کے لیے دردناک عذاب ہے.","arabic":"وَٱلَّذِينَ كَفَرُواْ بِـَٔايَٰتِ ٱللَّهِ وَلِقَآئِهِۦٓ أُوْلَٰٓئِكَ يَئِسُواْ مِن رَّحۡمَتِي وَأُوْلَٰٓئِكَ لَهُمۡ عَذَابٌ أَلِيمٞ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut","Chapter Al-Ankabut","Ankabut","Surah Ankabut","Chapter Ankabut","Al Ankabut","Surah Al Ankabut","Chapter Al Ankabut","Surah 29","Chapter 29","The Spider","العَنكَبُوت"],"ayahNumber":3363,"juzNumber":20,"footnotes":"(1) اللہ تعالیٰ کی رحمت، دنیا میں عام ہے جس سے کافر اور مومن، منافق اور مخلص اور نیک اور بد سب یکساں طور پر مستفیض ہو رہے ہیں۔ اللہ تعالیٰ سب کو دنیا کے وسائل، آسائشیں اور مال ودولت عطا کر رہا ہے یہ رحمت الٰہی کی وہ وسعت ہے جسے اللہ تعالیٰ نے دوسرے مقام پر فرمایا «وَرَحْمَتِي وَسِعَتْ كُلَّ شَيْءٍ» (الأعراف: 156) ”میری رحمت نے ہر چیز کو گھیر لیا ہے“۔ لیکن آخرت چونکہ دارالجزا ہے، انسان نے دنیا کی کھیتی میں جو کچھ بویا ہوگا، اسی کی فصل اسے وہاں کاٹنی ہوگی، جیسے عمل کیے ہوں گے، اسی کی جزا اسے وہاں ملے گی۔ اللہ کی بارگاہ میں بےلاگ فیصلے ہوں گے۔ دنیا کی طرح اگر آخرت میں بھی نیک وبد کے ساتھ یکساں سلوک ہو اور مومن وکافر دونوں ہی رحمت الٰہی کے مستحق قرار پائیں تو اس سے ایک تو اللہ تعالیٰ کی صفت عدل پر حرف آتا ہے، دوسرے قیامت کا مقصد ہی فوت ہو جاتا ہے۔ قیامت کا دن تو اللہ نے رکھا ہی اس لیے ہے کہ وہاں نیکوں کو ان کی نیکیوں کے صلے میں جنت اور بدوں کو ان کی بدیوں کی جزا میں جہنم دی جائے۔ اس لیے قیامت والے دن اللہ تعالیٰ کی رحمت صرف اہل ایمان کے لیے خاص ہوگی۔ جسے یہاں بھی بیان کیا گیا ہے کہ جو لوگ آخرت اور معاد کے ہی منکر ہوں گے وہ میری رحمت سے ناامید ہوں گے یعنی ان کے حصے میں رحمت الٰہی نہیں آئے گی۔ سورۂ اعراف میں ان کو ان الفاظ سے بیان کیا گیا ہے۔ «فَسَأَكْتُبُهَا لِلَّذِينَ يَتَّقُونَ وَيُؤْتُونَ الزَّكَاةَ وَالَّذِينَ هُمْ بِآيَاتِنَا يُؤْمِنُونَ» (الأعراف: 156) ”میں یہ رحمت (آخرت میں) ان لوگوں کے لیے لکھوں گا جو متقی، زکوٰۃ ادا کرنے والے اور ہماری آیتوں پر ایمان رکھنے والے ہوں گے“۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-alladhīna kafarū biāyāti al-lahi waliqāihi ulāika ya-isū min raḥmatī wa-ulāika lahum ʿadhābun alīmun ","translations":["And those who","disbelieve","in (the) Signs","(of) Allah","and (the) meeting (with) Him","those","(have) despaired","of","My Mercy","And those","for them","(is) a punishment","painful","(23)"],"transliterationArr":["wa-alladhīna","kafarū","biāyāti","al-lahi","waliqāihi","ulāika","ya-isū","min","raḥmatī","wa-ulāika","lahum","ʿadhābun","alīmun",null],"verseTiming":[[1,0,1160],[2,1160,2050],[3,2050,3430],[4,3430,4250],[5,4250,8560],[6,8560,11040],[7,11040,11890],[8,11890,12060],[9,12060,13310],[10,13310,16470],[11,16470,19160],[12,19160,19690],[13,19690,20780],[14,20780,23265]]}}