{"name":"29:24","price":"ان کی قوم کا جواب بجز اس کے کچھ نہ تھا کہ کہنے لگے کہ اسے مار ڈالو یا اسے جلا دو(1) ۔ آخر اللہ نے انہیں آگ سے بچا لیا(2)، اس میں ایمان والے لوگوں کے لیے تو بہت سی نشانیاں ہیں.","arabic":"فَمَا كَانَ جَوَابَ قَوۡمِهِۦٓ إِلَّآ أَن قَالُواْ ٱقۡتُلُوهُ أَوۡ حَرِّقُوهُ فَأَنجَىٰهُ ٱللَّهُ مِنَ ٱلنَّارِۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يُؤۡمِنُونَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut","Chapter Al-Ankabut","Ankabut","Surah Ankabut","Chapter Ankabut","Al Ankabut","Surah Al Ankabut","Chapter Al Ankabut","Surah 29","Chapter 29","The Spider","العَنكَبُوت"],"ayahNumber":3364,"juzNumber":20,"footnotes":"(1) ان آیات سے قبل حضرت ابراہیم (عليه السلام) کا قصہ بیان ہو رہا تھا، اب پھر اس کا بقیہ بیان کیا جارہا ہے۔ درمیان میں جملہ معترضہ کے طور پر اللہ کی توحید اور اس کی قدرت وطاقت کو بیان کیا گیا ہے۔ بعض کہتے ہیں کہ یہ سب حضرت ابراہیم (عليه السلام) ہی کے وعظ کا حصہ ہے، جس میں انہوں نے توحید ومعاد کے اثبات میں دلائل دیئے ہیں، جن کا کوئی جواب جب ان کی قوم سےنہیں بنا تو انہوں نے اس کا جواب ظلم وتشدد کی اس کارروائی سے دیا، جس کا ذکر اس آیت میں ہے کہ اسے قتل کر دو یا جلا ڈالو۔ چنانچہ انہوں نے آگ کا ایک بہت بڑا الاؤ تیار کرکے حضرت ابراہیم (عليه السلام) کو منجنیق کے ذریعے سے اس میں پھینک دیا۔\n(2) یعنی اللہ نے اس آگ کو گلزار کی صورت میں بدل کر اپنے بندے کو بچا لیا، جیسا کہ سورہ انبیاء میں گزرا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"famā kāna jawāba qawmihi illā an qālū uq'tulūhu aw ḥarriqūhu fa-anjāhu al-lahu mina al-nāri inna fī dhālika laāyātin liqawmin yu'minūna ","translations":["And not","was","(the) answer","(of) his people","except","that","they said","Kill him","or","burn him","But Allah saved him","But Allah saved him","from","the fire","Indeed","in","that","surely (are) Signs","for a people","who believe","(24)"],"transliterationArr":["famā","kāna","jawāba","qawmihi","illā","an","qālū","uq'tulūhu","aw","ḥarriqūhu","fa-anjāhu","al-lahu","mina","al-nāri","inna","fī","dhālika","laāyātin","liqawmin","yu'minūna",null],"verseTiming":[[1,0,680],[2,680,1300],[3,1300,2230],[4,2230,4680],[5,4680,6550],[6,6550,7590],[7,7590,8130],[8,8130,9260],[9,9260,9630],[10,9630,10900],[11,10900,12870],[12,12870,13770],[13,13770,14100],[14,14100,17460],[15,17460,18750],[16,18750,19250],[17,19250,20120],[18,20120,21420],[19,21420,23400],[20,23400,26305]]}}