{"name":"29:3","price":"ان سے اگلوں کو بھی ہم نے خوب جانچا(1) ۔ یقیناً اللہ تعالیٰ انہیں بھی جان لے گا جو سچ کہتے ہیں اور انہیں بھی معلوم کرلے گا جو جھوٹے ہیں.","arabic":"وَلَقَدۡ فَتَنَّا ٱلَّذِينَ مِن قَبۡلِهِمۡۖ فَلَيَعۡلَمَنَّ ٱللَّهُ ٱلَّذِينَ صَدَقُواْ وَلَيَعۡلَمَنَّ ٱلۡكَٰذِبِينَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut","Chapter Al-Ankabut","Ankabut","Surah Ankabut","Chapter Ankabut","Al Ankabut","Surah Al Ankabut","Chapter Al Ankabut","Surah 29","Chapter 29","The Spider","العَنكَبُوت"],"ayahNumber":3343,"juzNumber":20,"footnotes":"(1) یعنی یہ سنت الٰہی ہے جو پہلے سے چلی آرہی ہے۔ اس لیے وہ اس امت کے مومنوں کی بھی آزمائش کرے گا، جس طرح پہلی امتوں کی آزمائش کی گئی۔ ان آیات کی شان نزول کی روایات میں آتا ہے کہ صحابہ کرام (رضي الله عنهم) نے اس ظلم وستم کی شکایت کی جس کا نشانہ وہ کفار مکہ کی طرف سے بنے ہوئے تھے اور رسول اللہ (صلى الله عليه وسلم) سے دعا کی درخواست کی تاکہ اللہ تعالیٰ ان کی مدد فرمائے۔ آپ (صلى الله عليه وسلم) نے فرمایا کہ یہ تشدد وایذا تو اہل ایمان کی تاریخ کا حصہ ہے۔ تم سے پہلے بعض مومنوں کا یہ حال کیا گیا کہ انہیں ایک گڑھا کھود کر اس میں کھڑا کر دیا گیا اور پھر ان کے سروں پر آرا چلا دیا گیا، جس سے ان کے جسم دو حصوں میں تقسیم ہوگئے، اسی طرح لوہے کی کنگھیاں ان کے گوشت پر ہڈیوں تک پھیری گئیں۔ لیکن یہ ایذائیں انہیں دین حق سے پھیرنے میں کامیاب نہیں ہوئیں۔ (صحيح بخاري، كتاب أحاديث الأنبياء، باب علامات النبوة في الإسلام) حضرت عمار، ان کی والدہ حضرت سمیہ اور والد حضرت یاسر، حضرت صہیب، بلال ومقداد وغیرہم رضوان اللہ علیہم اجمعین پر اسلام کے ابتدائی دور میں جو ظلم وستم کے پہاڑ توڑے گئے، وہ صفحات تاریخ میں محفوظ ہیں۔ یہ واقعات ہی ان آیات کے نزول کا سبب بنے۔ تاہم عموم الفاظ کے اعتبار سے قیامت تک کے اہل ایمان اس میں داخل ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walaqad fatannā alladhīna min qablihim falayaʿlamanna al-lahu alladhīna ṣadaqū walayaʿlamanna al-kādhibīna ","translations":["And indeed","We tested","those who","(were) before them","(were) before them","And Allah will surely make evident","And Allah will surely make evident","those who","(are) truthful","and He will surely make evident","the liars","(3)"],"transliterationArr":["walaqad","fatannā","alladhīna","min","qablihim","falayaʿlamanna","al-lahu","alladhīna","ṣadaqū","walayaʿlamanna","al-kādhibīna",null],"verseTiming":[[1,0,830],[2,830,2190],[3,2190,3260],[4,3260,4320],[5,4320,5330],[6,5330,7690],[7,7690,8600],[8,8600,9680],[9,9680,10630],[10,10630,12920],[11,12920,16365]]}}