{"name":"29:45","price":"جو کتاب آپ کی طرف وحی کی گئی ہے اسے پڑھئے(1) اور نماز قائم کریں(2)، یقیناً نماز بے حیائی اور برائی سے روکتی ہے(3)، بیشک اللہ کا ذکر بہت بڑی چیز ہے(4)، تم جو کچھ کر رہے ہو اس سے اللہ خبردار ہے.","arabic":"ٱتۡلُ مَآ أُوحِيَ إِلَيۡكَ مِنَ ٱلۡكِتَٰبِ وَأَقِمِ ٱلصَّلَوٰةَۖ إِنَّ ٱلصَّلَوٰةَ تَنۡهَىٰ عَنِ ٱلۡفَحۡشَآءِ وَٱلۡمُنكَرِۗ وَلَذِكۡرُ ٱللَّهِ أَكۡبَرُۗ وَٱللَّهُ يَعۡلَمُ مَا تَصۡنَعُونَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut","Chapter Al-Ankabut","Ankabut","Surah Ankabut","Chapter Ankabut","Al Ankabut","Surah Al Ankabut","Chapter Al Ankabut","Surah 29","Chapter 29","The Spider","العَنكَبُوت"],"ayahNumber":3385,"juzNumber":20,"footnotes":"(1) قرآن کریم کی تلاوت متعدد مقاصد کے لئے مطلوب ہے، محض اجر وثواب کے لئے، اس کے معانی ومطالب پر تدبرو تفکر کے لئے، تعلیم وتدریس کے لئے، اور وعظ ونصیحت کے لئے، اس حکم تلاوت میں ساری ہی صورتیں شامل ہیں۔\n(2) کیونکہ نماز سے (بشرطیکہ نماز ہو) انسان کا تعلق خصوصی اللہ تعالیٰ کے ساتھ قائم ہو جاتا ہے، جس سے انسان کو اللہ تعالیٰ کی مدد حاصل ہوتی ہے جو زندگی کے ہر موڑ پر اس کے عزم وثبات کا باعث، اور ہدایت کا ذریعہ ثابت ہوتی ہے۔ اسی لئے قرآن کریم میں کہا گیاہے اے ایمان والو! صبر اور نماز سےمدد حاصل کرو (البقرۃ: 153) نمازاور صبر کوئی مرئی چیز تو ہے نہیں کہ انسان ان کا سہارا پکڑ کر ان سے مدد حاصل کر لے۔ یہ تو غیر مرئی چیز ہے۔ مطلب یہ ہے کہ ان کے ذریعے سے انسان کا اپنے رب کے ساتھ جو خصوصی ربط وتعلق پیدا ہوتا ہے وہ قدم قدم پر اس کی دستگیری اور رہنمائی کرتا ہے اسی لئے نبی (صلى الله عليه وسلم) کو رات کی تنہائی میں تہجد کی نماز بھی پڑھنے کی تاکید کی گئی، کیونکہ آپ (صلى الله عليه وسلم) کے ذمے جو عظیم کام سونپا گیا تھا، اس میں آپ (صلى الله عليه وسلم) کو اللہ کی مدد کی بہت زیادہ ضرورت تھی اور یہی وجہ ہے کہ خود آنحضرت (صلى الله عليه وسلم) کو بھی جب کوئی اہم مرحلہ درپیش ہوتا تو آپ (صلى الله عليه وسلم) نماز کا اہتمام فرماتے ”إِذَا حَزَبَهُ أَمْرٌ فَزِعَ إِلى الصَّلاةِ“ (مسند أحمد وأبو دود)\n(3) یعنی، بے حیائی اور برائی کے روکنے کا سبب اور ذریعہ بنتی ہے جس طرح دواؤں کی مختلف تاثیرات ہیں اور کہا جاتا ہے کہ فلاں دوا فلاں بیماری کو روکتی ہے اور واقعتاً ایسا ہوتا ہے لیکن کب؟ جب دو باتوں کا التزام کیا جائے۔ ایک دوائی پابندی کے ساتھ اس طریقے اور شرائط کے ساتھ استعمال کیا جائےجو حکیم اور ڈاکٹر بتلائے۔ دوسرا پرہیز یعنی ایسی چیزوں سے اجتناب کیا جائے جو اس دوائی کے اثرات کو زائل کرنے والی ہوں۔ اسی طرح نماز کے اندر بھی یقیناً اللہ نے ایسی روحانی تاثیر رکھی ہے کہ یہ انسان کو بے حیائی اور برائی سے روکتی ہے لیکن اسی وقت، جب نماز کو سنت نبوی (صلى الله عليه وسلم) کے مطابق ان آداب اور شرائط کے ساتھ پڑھا جائے جو اس کی صحت وقبولیت کے لئے ضروری ہیں۔ مثلاً اس کے لئے پہلی چیز اخلاص ہے، ثانیاً طہارت قلب، یعنی نماز میں اللہ کے سوا کسی اور کی طرف التفات نہ ہو، ثالثاً باجماعت اوقات مقررہ پر اس کا اہتمام۔ رابعا ارکان صلوۃ (قراءت، رکوع، قومہ، سجدہ وغیرہ) میں اعتدال واطمینان، خامساً خشوع وخضوع اور رقت کی کیفیت۔ سادساً مواظبت یعنی پابندی کے ساتھ اس کا التزام، سابعاً رزق حلال کا اہتمام۔ ہماری نمازیں ان آداب وشرائط سے عاری ہیں، اس لئے ان کے وہ اثرات بھی ہماری زندگی میں ظاہر نہیں ہو رہے ہیں، جو قرآن کریم میں بتلائے گئے ہیں۔ بعض نے اس کے معنی امر کے کیے ہیں۔ یعنی نماز پڑھنے والے کو چاہئے کہ بے حیائی کے کاموں سے اور برائی سے رک جائے۔\n(4) یعنی بے حیائی اور برائی سے روکنے میں اللہ کا ذکر، اقامت صلوٰۃ سے بھی زیادہ موثر ہے۔ اس لئے کہ آدمی جب تک نماز میں ہوتا ہے، برائی سے رکا رہتا ہے۔ لیکن بعد میں اس کی تاثیر کمزور ہو جاتی ہے، اس کے برعکس ہر وقت اللہ کا ذکر اس کے لئے ہر وقت برائی میں مانع رہتا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"ut'lu mā ūḥiya ilayka mina al-kitābi wa-aqimi al-ṣalata inna al-ṣalata tanhā ʿani al-faḥshāi wal-munkari waladhik'ru al-lahi akbaru wal-lahu yaʿlamu mā taṣnaʿūna ","translations":["Recite","what","has been revealed","to you","of","the Book","and establish","the prayer","Indeed","the prayer","prevents","from","the immorality","and evil deeds","and surely (the) remembrance","(of) Allah","(is) greatest","And Allah","knows","what","you do","(45)"],"transliterationArr":["ut'lu","mā","ūḥiya","ilayka","mina","al-kitābi","wa-aqimi","al-ṣalata","inna","al-ṣalata","tanhā","ʿani","al-faḥshāi","wal-munkari","waladhik'ru","al-lahi","akbaru","wal-lahu","yaʿlamu","mā","taṣnaʿūna",null],"verseTiming":[[1,0,730],[2,730,2650],[3,2650,3440],[4,3440,4270],[5,4270,4600],[6,4600,5720],[7,5720,6550],[8,6550,8980],[9,8980,10580],[10,10580,11660],[11,11660,12500],[12,12500,12930],[13,12930,15630],[14,15630,18110],[15,18110,19150],[16,19150,20020],[17,20020,21220],[18,21220,22250],[19,22250,23310],[20,23310,23590],[21,23590,27325]]}}