{"name":"29:40","price":"پھر تو ہر ایک کو ہم نے اس کے گناه کے وبال میں گرفتار کر لیا(1) ، ان میں سے بعض پر ہم نے پتھروں کا مینہ برسایا(2) اور ان میں سے بعض کو زور دار سخت آواز نے دبوچ لیا(3) اور ان میں سے بعض کو ہم نے زمین میں دھنسا دیا(4) اور ان میں سے بعض کو ہم نے ڈبو دیا(5)، اللہ تعالیٰ ایسا نہیں کہ ان پر ﻇلم کرے بلکہ یہی لوگ اپنی جانوں پر ﻇلم کرتے تھے.(6)","arabic":"فَكُلًّا أَخَذۡنَا بِذَنۢبِهِۦۖ فَمِنۡهُم مَّنۡ أَرۡسَلۡنَا عَلَيۡهِ حَاصِبٗا وَمِنۡهُم مَّنۡ أَخَذَتۡهُ ٱلصَّيۡحَةُ وَمِنۡهُم مَّنۡ خَسَفۡنَا بِهِ ٱلۡأَرۡضَ وَمِنۡهُم مَّنۡ أَغۡرَقۡنَاۚ وَمَا كَانَ ٱللَّهُ لِيَظۡلِمَهُمۡ وَلَٰكِن كَانُوٓاْ أَنفُسَهُمۡ يَظۡلِمُونَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut","Chapter Al-Ankabut","Ankabut","Surah Ankabut","Chapter Ankabut","Al Ankabut","Surah Al Ankabut","Chapter Al Ankabut","Surah 29","Chapter 29","The Spider","العَنكَبُوت"],"ayahNumber":3380,"juzNumber":20,"footnotes":"(1) یعنی ان مذکورین میں سے ہر ایک کی، ان کے گناہوں کی پاداش میں، ہم نے گرفت کی۔\n(2) یہ قوم عاد تھی، جس پر نہایت تندوتیز ہوا کا عذاب آیا۔ یہ ہوا زمین سے کنکریاں اڑا اڑا کر ان پر برساتی ، بالآخر اس کی شدت اتنی بڑھی کہ انہیں اچک کر آسمان تک لے جاتی اور انہیں سر کے بل زمین پر دے مارتی، جس سے ان کا سر الگ اور دھڑ الگ ہو جاتا گویا کہ وہ کھجور کے کھوکھلے تنے ہیں۔ (ابن کثیر) بعض مفسرین نے حاصبا کا مصداق قوم لوط (عليه السلام) کو ٹھہرایا ہے۔ لیکن امام ابن کثیر نے اسے غیر صحیح اور حضرت ابن عباس (رضي الله عنه) کی طرف منسوب قول کو منقطع قرار دیا ہے۔\n(3) یہ حضرت صالح (عليه السلام) کی قوم، ثمود ہے۔ جنہیں ان کے کہنے پر ایک چٹان سے اونٹنی نکال کر دکھائی گئی۔ لیکن ان ظالموں نے ایمان لانے کے بجائے اس اونٹنی کو ہی مار دالا۔ جس کے تین دن بعد ان پر سخت چنگھاڑ کا عذاب آیا، جس نے ان کی آوازوں اور حرکتوں کو خاموش کر دیا۔\n(4) یہ قارون ہے، جسے مال و دولت کے خزانے عطا کیے گئے تھے، لیکن یہ اس گھمنڈ میں مبتلا ہوگیا کہ یہ مال و دولت اس بات کی دلیل ہے کہ میں اللہ کے ہاں معزز و محترم ہوں۔ مجھے موسیٰ (عليه السلام) کی بات ماننے کی کیا ضرورت ہے؟ چنانچہ اسے اس کے خزانوں اور محلات سمیت زمین میں دھنسا دیا گیا۔\n(5) یہ فرعون ہے، جو ملک مصر کا حکمران تھا، لیکن حد سے تجاوز کرکے اس نے اپنے بارے میں الوہیت کا دعویٰ بھی کر دیا۔ حضرت موسیٰ (عليه السلام) پر ایمان لانے سے اور ان کی قوم بنی اسرائیل کو، جس کو اس نے غلام بنا رکھا تھا، آزاد کرنے سے انکار کر دیا۔ بالآخر ایک صبح اس کو اس کے پورے لشکر سمیت دریائے قلزم میں غرق کر دیا گیا۔\n(6) یعنی اللہ کی شان نہیں کہ وہ ظلم کرے۔ اس لیے پچھلی قومیں، جن پر عذاب آیا، محض اس لیے ہلاک ہوئیں کہ کفروشرک اور تکذیب ومعاصی کا ارتکاب کرکے انہوں نے خود ہی اپنی جانوں پر ظلم کیا تھا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"fakullan akhadhnā bidhanbihi famin'hum man arsalnā ʿalayhi ḥāṣiban wamin'hum man akhadhathu al-ṣayḥatu wamin'hum man khasafnā bihi al-arḍa wamin'hum man aghraqnā wamā kāna al-lahu liyaẓlimahum walākin kānū anfusahum yaẓlimūna ","translations":["So each","We seized","for his sin","Then of them","(was he) who","We sent","on him","a violent storm","and of them","(was he) who","seized him","the awful cry","and of them","(was he) who","We caused to swallow","him","the earth","and of them","(was he) who","We drowned","And not","was","Allah","to wrong them","but","they were","themselves","doing wrong","(40)"],"transliterationArr":["fakullan","akhadhnā","bidhanbihi","famin'hum","man","arsalnā","ʿalayhi","ḥāṣiban","wamin'hum","man","akhadhathu","al-ṣayḥatu","wamin'hum","man","khasafnā","bihi","al-arḍa","wamin'hum","man","aghraqnā","wamā","kāna","al-lahu","liyaẓlimahum","walākin","kānū","anfusahum","yaẓlimūna",null],"verseTiming":[[1,0,990],[2,990,2000],[3,2000,4570],[4,4570,5700],[5,5700,6910],[6,6910,8150],[7,8150,8980],[8,8980,10750],[9,10750,11570],[10,11570,12680],[11,12680,13730],[12,13730,14770],[13,14770,15650],[14,15650,16510],[15,16510,17580],[16,17580,18040],[17,18040,18880],[18,18880,19710],[19,19710,20850],[20,20850,22210],[21,22210,23360],[22,23360,23940],[23,23940,24890],[24,24890,26300],[25,26300,27820],[26,27820,29470],[27,29470,31560],[28,31560,34555]]}}