{"name":"29:65","price":"پس یہ لوگ جب کشتیوں میں سوار ہوتے ہیں تو اللہ تعالیٰ ہی کو پکارتے ہیں اس کے لئے عبادت کو خالص کر کے پھر جب وه انہیں خشکی کی طرف بچا ﻻتا ہے تو اسی وقت شرک کرنے لگتے ہیں.(1)","arabic":"فَإِذَا رَكِبُواْ فِي ٱلۡفُلۡكِ دَعَوُاْ ٱللَّهَ مُخۡلِصِينَ لَهُ ٱلدِّينَ فَلَمَّا نَجَّىٰهُمۡ إِلَى ٱلۡبَرِّ إِذَا هُمۡ يُشۡرِكُونَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut","Chapter Al-Ankabut","Ankabut","Surah Ankabut","Chapter Ankabut","Al Ankabut","Surah Al Ankabut","Chapter Al Ankabut","Surah 29","Chapter 29","The Spider","العَنكَبُوت"],"ayahNumber":3405,"juzNumber":21,"footnotes":"(1) مشرکین کے اس تناقض کو بھی قرآن کریم میں متعدد جگہ بیان فرمایا گیا ہے۔ اس تناقض کو حضرت عکرمہ (رضي الله عنه) سمجھ گئے تھے جس کی وجہ سے انہیں قبول اسلام کی توفیق حاصل ہوگئی۔ ان کے متعلق آیا ہے کہ فتح مکہ کے بعد یہ مکہ سے فرار ہوگئے تاکہ نبی (صلى الله عليه وسلم) کی گرفت سے بچ جائیں۔ یہ حبشہ جانے کے لئے ایک کشتی میں بیٹھے، کشتی گرداب میں پھنس گئی، تو کشتی میں سوار لوگوں نے ایک دوسرے سے کہا کہ پورے خلوص سے رب سے دعائیں کرو، اس لئےکہ یہاں اس کےعلاوہ کوئی نجات دینے والا نہیں ہے۔ حضرت عکرمہ (رضي الله عنه) نے یہ سن کر کہا کہ اگر یہاں سمندر میں اس کے سوا کوئی نجات نہیں دے سکتا تو خشکی میں بھی اس کے سوا کوئی نجات نہیں دے سکتا۔ اور اسی وقت اللہ سے عہد کر لیا کہ اگر میں یہاں سے بخیرت ساحل پر پہنچ گیا تو میں محمد (صلى الله عليه وسلم) کے ہاتھ پر بیعت کر لوں گا یعنی مسلمان ہو جاؤں گا، چنانچہ یہاں سے نجات پاکر انہوں نے اسلام قبول کرلیا (رضي الله عنه)۔ (ابن کثیر بحوالہ سیرت محمد بن اسحاق)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"fa-idhā rakibū fī al-ful'ki daʿawū al-laha mukh'liṣīna lahu al-dīna falammā najjāhum ilā al-bari idhā hum yush'rikūna ","translations":["And when","they embark","[in]","the ship","they call","Allah","(being) sincere","to Him","(in) the religion","But when","He delivers them","to","the land","behold","they","associate partners (with Him)","(65)"],"transliterationArr":["fa-idhā","rakibū","fī","al-ful'ki","daʿawū","al-laha","mukh'liṣīna","lahu","al-dīna","falammā","najjāhum","ilā","al-bari","idhā","hum","yush'rikūna",null],"verseTiming":[[1,0,830],[2,830,1650],[3,1650,1900],[4,1900,2740],[5,2740,3320],[6,3320,4210],[7,4210,5470],[8,5470,5800],[9,5800,6650],[10,6650,8200],[11,8200,9400],[12,9400,9780],[13,9780,10610],[14,10610,11250],[15,11250,11720],[16,11720,14485]]}}