{"name":"29:60","price":"اور بہت سے(1) جانور ہیں جو اپنی روزی اٹھائے نہیں پھرتے(2)، ان سب کو اور تمہیں بھی اللہ تعالیٰ ہی روزی دیتا ہے(3)، وه بڑا ہی سننے جاننے واﻻ ہے.(4)","arabic":"وَكَأَيِّن مِّن دَآبَّةٖ لَّا تَحۡمِلُ رِزۡقَهَا ٱللَّهُ يَرۡزُقُهَا وَإِيَّاكُمۡۚ وَهُوَ ٱلسَّمِيعُ ٱلۡعَلِيمُ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut","Chapter Al-Ankabut","Ankabut","Surah Ankabut","Chapter Ankabut","Al Ankabut","Surah Al Ankabut","Chapter Al Ankabut","Surah 29","Chapter 29","The Spider","العَنكَبُوت"],"ayahNumber":3400,"juzNumber":21,"footnotes":"(1) كَأَيِّنْ میں کاف تشبیہ کا ہے اور معنی ہیں کتنے ہی یا بہت سے۔\n(2) کیونکہ اٹھا کر لے جانے کی ان میں ہمت ہی نہیں ہوتی، اسی طرح وہ ذخیرہ بھی نہیں کر سکتے۔ مطلب یہ ہے کہ رزق کسی خاص جگہ کے ساتھ مختص نہیں ہے بلکہ اللہ کا رزق اپنی مخلوق کے لئے عام ہے وہ جو بھی ہو اور جہاں بھی ہو بلکہ اللہ تعالیٰ نےہجرت کو جانے والے صحابہ (رضي الله عنهم) کو پہلے سے کہیں زیادہ وسیع اور پاکیزہ رزق عطا فرمایا، نیز تھوڑے ہی عرصے کے بعد انہیں عرب کے متعدد علاقوں کا حکمران بنا دیا۔ رَضِيَ اللهُ عَنْهُمْ أَجْمَعِينَ.\n(3) یعنی کمزور ہے یا طاقت ور، اسباب ووسائل سے بہرہ ور ہے یا بے بہرہ، اپنے وطن میں ہے یا مہاجر اور بے وطن، سب کا روزی رساں وہی اللہ ہے جو چیونٹی کو زمین کے کونوں کھدروں میں، پرندوں کو ہواؤں میں اور مچھلیوں اور دیگر آبی جانوروں کو سمندر کی گہرائیوں میں روزی پہنچاتا ہے۔ اس موقع پر مطلب یہ ہے کہ فقر وفاقہ کا ڈر ہجرت میں رکاوٹ نہ بنے، اس لئے کہ اللہ تعالیٰ تمہاری اور تمام مخلوقات کی روزی کا ذمے دار ہے۔\n(4) وہ جاننے والا ہے تمہارے اعمال وافعال کو اور تمہارے ظاہر وباطن کو، اس لئے صرف اسی سے ڈرو، اس کے سوا کسی سے مت ڈرو! اسی کی اطاعت میں سعادت وکمال ہے اور اس کی معصیت میں شقاوت ونقصان۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waka-ayyin min dābbatin lā taḥmilu riz'qahā al-lahu yarzuquhā wa-iyyākum wahuwa al-samīʿu al-ʿalīmu ","translations":["And how many","of","a creature","(does) not","carry","its provision","Allah","provides (for) it","and (for) you","And He","(is) the All-Hearer","the All-Knower","(60)"],"transliterationArr":["waka-ayyin","min","dābbatin","lā","taḥmilu","riz'qahā","al-lahu","yarzuquhā","wa-iyyākum","wahuwa","al-samīʿu","al-ʿalīmu",null],"verseTiming":[[1,0,1110],[2,1110,3200],[3,3200,7010],[4,7010,7500],[5,7500,8410],[6,8410,9160],[7,9160,10040],[8,10040,11390],[9,11390,13300],[10,13300,13850],[11,13850,15030],[12,15030,17415]]}}