{"name":"29:8","price":"ہم نے ہر انسان کو اپنے ماں باپ کے ساتھ اچھا سلوک کرنے کی نصیحت کی ہے(1) ہاں اگر وه یہ کوشش کریں کہ آپ میرے ساتھ اسے شریک کرلیں جس کا آپ کو علم نہیں تو ان کا کہنا نہ مانیئے(2)، تم سب کا لوٹنا میری ہی طرف ہے پھر میں ہر اس چیز سے جو تم کرتے تھے تمہیں خبر دوں گا.","arabic":"وَوَصَّيۡنَا ٱلۡإِنسَٰنَ بِوَٰلِدَيۡهِ حُسۡنٗاۖ وَإِن جَٰهَدَاكَ لِتُشۡرِكَ بِي مَا لَيۡسَ لَكَ بِهِۦ عِلۡمٞ فَلَا تُطِعۡهُمَآۚ إِلَيَّ مَرۡجِعُكُمۡ فَأُنَبِّئُكُم بِمَا كُنتُمۡ تَعۡمَلُونَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut","Chapter Al-Ankabut","Ankabut","Surah Ankabut","Chapter Ankabut","Al Ankabut","Surah Al Ankabut","Chapter Al Ankabut","Surah 29","Chapter 29","The Spider","العَنكَبُوت"],"ayahNumber":3348,"juzNumber":20,"footnotes":"(1) قرآن کریم کے متعدد مقامات پر اللہ تعالیٰ نے اپنی توحید وعبادت کا حکم دینے کے ساتھ والدین کے ساتھ حسن سلوک کی تاکید کی ہے جس سے اس امر کی وضاحت ہوتی ہے کہ ربوبیت (الہٰ واحد) کے تقاضوں کو صحیح طریقے سے وہی سمجھ سکتا اور انہیں ادا کرسکتا ہے جو والدین کی اطاعت وخدمت کے تقاضوں کو سمجھتا اور ادا کرتا ہے۔ جو شخص یہ بات سمجھنے سے قاصر ہے کہ دنیا میں اس کا وجود والدین کی باہمی قربت کا نتیجہ اور اس کی تربیت وپرداخت، ان کی غایت مہربانی اور شفقت کا ثمرہ ہے۔ اس لیے مجھے ان کی خدمت میں کوئی کوتاہی اور ان کی اطاعت سے سرتابی نہیں کرنی چاہیے۔ وہ یقیناً خالق کائنات کو سمجھنے اور اس کی توحید وعبادت کے تقاضوں کی ادائیگی سے بھی قاصر رہے گا۔ اسی لیے احادیث میں بھی والدین کے ساتھ حسن سلوک کی بڑی تاکید آئی ہے۔ ایک حدیث میں والدین کی رضامندی کو اللہ کی رضا اور ان کی ناراضی کو رب کی ناراضی کا باعث قرار دیا گیا ہے۔\n(2) یعنی والدین اگر شرک کا حکم دیں (اور اسی میں دیگر معاصی کا حکم بھی شامل ہے) اور اس کے لیے خاص کوشش بھی کریں۔ (جیسا کہ مجاہدہ کے لفظ سے واضح ہے) تو ان کی اطاعت نہیں کرنی چاہیئے۔ کیونکہ «لا طَاعَةَ لأَحَدٍ فِي مَعْصِيَةِ اللهِ تَبَارَكَ وَتَعَالَى» (مسند أحمد5/66 والصحيحة للألباني، نمبر 179) ”اللہ کی نافرمانی میں کسی کی اطاعت نہیں“۔\nاس آیت کی شان نزول میں حضرت سعد بن ابی وقاص (رضي الله عنه) ، کا واقعہ آتا ہے کہ ان کے مسلمان ہونے پر ان کی والدہ نے کہا کہ میں نہ کھاؤں گی نہ پیوں گی، یہاں تک کہ مجھے موت آجائے یا پھر تو محمد (صلى الله عليه وسلم) کی نبوت کا انکار کر دے، بالآخر یہ اپنی والدہ کو زبردستی منہ کھول کر کھلاتے، جس پر یہ آیت نازل ہوئی۔ (صحيح مسلم، ترمذي، تفسير سورة العنكبوت)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wawaṣṣaynā al-insāna biwālidayhi ḥus'nan wa-in jāhadāka litush'rika bī mā laysa laka bihi ʿil'mun falā tuṭiʿ'humā ilayya marjiʿukum fa-unabbi-ukum bimā kuntum taʿmalūna ","translations":["And We have enjoined","(on) man","goodness to his parents","goodness to his parents","but if","they both strive against you","to make you associate","with Me","what","not","you have","of it","any knowledge","then (do) not","obey both of them","To Me","(is) your return","and I will inform you","about what","you used","(to) do","(8)"],"transliterationArr":["wawaṣṣaynā","al-insāna","biwālidayhi","ḥus'nan","wa-in","jāhadāka","litush'rika","bī","mā","laysa","laka","bihi","ʿil'mun","falā","tuṭiʿ'humā","ilayya","marjiʿukum","fa-unabbi-ukum","bimā","kuntum","taʿmalūna",null],"verseTiming":[[1,0,1160],[2,1160,3200],[3,3200,4670],[4,4670,5630],[5,5630,7480],[6,7480,8760],[7,8760,9800],[8,9800,10230],[9,10230,10630],[10,10630,11270],[11,11270,11610],[12,11610,12260],[13,12260,13620],[14,13620,14250],[15,14250,15650],[16,15650,17100],[17,17100,18280],[18,18280,20710],[19,20710,21330],[20,21330,22910],[21,22910,26205]]}}