{"name":"2:107","price":"کیا تجھے علم نہیں کہ زمین و آسمان کا ملک اللہ ہی کے لئے ہے(1) اور اللہ کے سوا تمہارا کوئی ولی اور مددگار نہیں۔","arabic":"أَلَمۡ تَعۡلَمۡ أَنَّ ٱللَّهَ لَهُۥ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۗ وَمَا لَكُم مِّن دُونِ ٱللَّهِ مِن وَلِيّٖ وَلَا نَصِيرٍ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":114,"juzNumber":1,"footnotes":"(1) نسخ کے لغوی معنی تو نقل کرنے کے ہیں، لیکن شرعی اصطلاح میں ایک حکم کو بدل کر دوسرا حکم نازل کرنے کے ہیں۔ یہ نسخ اللہ تعالیٰ کی طرف سے ہوا ہے۔ جیسے آدم (عليه السلام) کے زمانے میں سگے بہن بھائیوں کا آپس میں نکاح جائز تھا، بعد میں اسے حرام کردیا گیا، وغیرہ اسی طرح قرآن میں بھی اللہ تعالیٰ نے بعض احکام منسوخ فرمائے اور ان کی جگہ نیا حکم نازل فرمایا۔ ان کی تعداد میں اختلاف ہے۔ شاہ ولی اللہ نے ”الفوزالکبیر“ میں ان کی تعداد صرف پانچ بیان کی ہے۔ یہ نسخ تین قسم کا ہے۔ ایک تو مطلقاً نسخ حکم یعنی ایک کو بدل کر دوسرا حکم نازل کردیا گیا۔ دوسرا ہے نسخ مع التلاوۂ۔ یعنی پہلے حکم کے الفاظ قرآن مجید میں موجود رکھے گئے ہیں، ان کی تلاوت ہوتی ہے لیکن دوسرا حکم بھی، جو بعد میں نازل کیا گیا، قرآن میں موجود ہے، یعنی ناسخ اور منسوخ دونوں آیات موجود ہیں۔ نسخ کی ایک تیسری قسم یہ ہے کہ ان کی تلاوت منسوخ کردی گئی۔ یعنی قرآن کریم میں نبی (صلى الله عليه وسلم) نے انہیں شامل نہیں فرمایا، لیکن ان کا حکم باقی رکھا گیا۔ جیسے «الشَّيْخُ وَالشَّيْخَةُ إِذَا زَنَيَا فَارْجُمُوهُمَا الْبَتَّةَ»۔ (موطا امام مالک) ”شادی شدہ مرد اور عورت اگر زنا کا ارتکاب کریں تو یقیناً انہیں سنگسار کردیا جائے۔“ اس آیت میں نسخ کی پہلی دو قسموں کا بیان ہے «مَا نَنْسَخْ مِنْ آيَةٍ» میں دوسری قسم اور «أَوْ نُنْسِهَا» میں پہلی قسم۔ «نُنْسِهَا» ”ہم بھلوادیتے ہیں“ کا مطلب ہے کہ اس کا حکم اور تلاوت دونوں اٹھا لیتے ہیں۔ گویا کہ ہم نے اسے بھلا دیا اور نیا حکم نازل کردیا۔ یا نبی (صلى الله عليه وسلم) کے قلب سے ہی ہم نے اسے مٹا دیا اور اسے نسیاً منسیا کردیا گیا۔ یہودی تورات کو ناقابل نسخ قرار دیتے تھے اور قرآن پر بھی انہوں نے بعض احکام کے منسوخ ہونے کی وجہ سے اعتراض کیا۔ اللہ تعالیٰ نے ان کی تردید فرمائی اور کہا کہ زمین وآسمان کی بادشاہی اسی کے ہاتھ میں ہے، وہ جو مناسب سمجھے کرے، جس وقت جو حکم اس کی مصلحت وحکمت کے مطابق ہو، اسے نافذ کرے اور جسے چاہے منسوخ کردے۔ یہ اس کی قدرت ہی کا ایک مظاہرہ ہے۔ بعض قدیم گمراہوں (مثلاً ابومسلم اصفہانی معتزلی) اور آج کل کے بھی بعض متجددین نے یہودیوں کی طرح قرآن میں نسخ ماننے سے انکار کیا ہے۔ لیکن صحیح بات وہی ہے جو مذکورہ سطروں میں بیان کی گئی ہے، سلف صالحین کا عقیدہ بھی اثبات نسخ ہی رہا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"alam taʿlam anna al-laha lahu mul'ku al-samāwāti wal-arḍi wamā lakum min dūni al-lahi min waliyyin walā naṣīrin ","translations":["Do not","you know","that","Allah","for Him","(is the) Kingdom","(of) the heavens","and the earth","And not","(is) for you","from","besides","Allah","any","protector","and not","any helper","(107)"],"transliterationArr":["alam","taʿlam","anna","al-laha","lahu","mul'ku","al-samāwāti","wal-arḍi","wamā","lakum","min","dūni","al-lahi","min","waliyyin","walā","naṣīrin",null],"verseTiming":[[1,0,620],[2,620,1440],[3,1440,2450],[4,2450,3320],[5,3320,3850],[6,3850,4460],[7,4460,5870],[8,5870,7240],[9,7240,7810],[10,7810,8330],[11,8330,9820],[12,9820,10670],[13,10670,11470],[14,11470,12230],[15,12230,13930],[16,13930,14450],[17,14450,16795]]}}