{"name":"2:102","price":"اور اس چیز کے پیچھے لگ گئے جسے شیاطین (حضرت) سلیمان کی حکومت میں پڑھتے تھے۔ سلیمان نے تو کفر نہ کیا تھا، بلکہ یہ کفر شیطانوں کا تھا، وه لوگوں کو جادو سکھایا کرتے تھے(1) ، اور بابل میں ہاروت ماروت دو فرشتوں پرجو اتارا گیا تھا(2)، وه دونوں بھی کسی شخص کو اس وقت تک نہیں سکھاتے تھے(3) جب تک یہ نہ کہہ دیں کہ ہم تو ایک آزمائش ہیں(4) تو کفر نہ کر، پھر لوگ ان سے وه سیکھتے جس سے خاوند وبیوی میں جدائی ڈال دیں اور دراصل وه بغیر اللہ تعالیٰ کی مرضی کے کسی کو کوئی نقصان نہیں پہنچا سکتے(5)، یہ لوگ وه سیکھتے ہیں جو انہیں نقصان پہنچائے اور نفع نہ پہنچا سکے، اور وه بالیقین جانتے ہیں کہ اس کے لینے والے کا آخرت میں کوئی حصہ نہیں۔ اور وه بدترین چیز ہے جس کے بدلے وه اپنے آپ کو فروخت کر رہے ہیں، کاش کہ یہ جانتے ہوتے۔","arabic":"وَٱتَّبَعُواْ مَا تَتۡلُواْ ٱلشَّيَٰطِينُ عَلَىٰ مُلۡكِ سُلَيۡمَٰنَۖ وَمَا كَفَرَ سُلَيۡمَٰنُ وَلَٰكِنَّ ٱلشَّيَٰطِينَ كَفَرُواْ يُعَلِّمُونَ ٱلنَّاسَ ٱلسِّحۡرَ وَمَآ أُنزِلَ عَلَى ٱلۡمَلَكَيۡنِ بِبَابِلَ هَٰرُوتَ وَمَٰرُوتَۚ وَمَا يُعَلِّمَانِ مِنۡ أَحَدٍ حَتَّىٰ يَقُولَآ إِنَّمَا نَحۡنُ فِتۡنَةٞ فَلَا تَكۡفُرۡۖ فَيَتَعَلَّمُونَ مِنۡهُمَا مَا يُفَرِّقُونَ بِهِۦ بَيۡنَ ٱلۡمَرۡءِ وَزَوۡجِهِۦۚ وَمَا هُم بِضَآرِّينَ بِهِۦ مِنۡ أَحَدٍ إِلَّا بِإِذۡنِ ٱللَّهِۚ وَيَتَعَلَّمُونَ مَا يَضُرُّهُمۡ وَلَا يَنفَعُهُمۡۚ وَلَقَدۡ عَلِمُواْ لَمَنِ ٱشۡتَرَىٰهُ مَا لَهُۥ فِي ٱلۡأٓخِرَةِ مِنۡ خَلَٰقٖۚ وَلَبِئۡسَ مَا شَرَوۡاْ بِهِۦٓ أَنفُسَهُمۡۚ لَوۡ كَانُواْ يَعۡلَمُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":109,"juzNumber":1,"footnotes":"(1) یعنی ان یہودیوں نے اللہ کی کتاب اور اس کے عہد کی تو کوئی پروا نہیں کی، البتہ شیطان کے پیچھے لگ کر نہ صرف جادو ٹونے پر عمل کرتے رہے، بلکہ یہ دعویٰ کیا کہ حضرت سلیمان (عليه السلام) بھی (نعوذ باللہ) اللہ کے پیغمبر نہیں تھے بلکہ ایک جادوگر تھے اور جادو کے زور سے ہی حکومت کرتے رہے۔ اللہ تعالیٰ نے فرمایا : حضرت سلیمان (عليه السلام) جادو کا عمل نہیں کرتے تھے، کیوں کہ عمل سحر تو کفر ہے، اس کفر کا ارتکاب حضرت سلیمان (عليه السلام) کیوں کر سکتے تھے؟ کہتے ہیں کہ حضرت سلیمان (عليه السلام) کے زمانے میں جادوگری کا سلسلہ بہت عام ہوگیا تھا، حضرت سلیمان (عليه السلام) نے اس کے سدباب کے لئے جادو کی کتابیں لے کر اپنی کرسی یا تخت کے نیچے دفن کردیں۔ حضرت سلیمان (عليه السلام) کی وفات کے بعد ان شیاطین اور جادوگروں نے ان کتابوں کو نکال کر نہ صرف لوگوں کو دکھایا ، بلکہ لوگوں کو یہ باور کرایا کہ حضرت سلیمان (عليه السلام) کی قوت واقتدار کا راز یہی جادو کا عمل تھا اور اسی بنا پر ان ظالموں نے حضرت سلیمان علیہ السلام کو بھی کافر قرار دیا، جس کی تردید اللہ تعالیٰ نے فرمائی (ابن کثیر۔ وغیرہ) واللہ اعلم۔\n(2) بعض مفسرین نے «وَمَا أُنْزِلَ» میں ما نافیہ مراد لیا ہے اور ہاروت وماروت پر کسی چیز کے اترنے کی نفی کی ہے، لیکن قرآن کریم کا سیاق اس کی تائید نہیں کرتا۔ اسی لئے ابن جریر وغیرہ نے اس کی تردید کی ہے (ابن کثیر) اسی طرح ہاروت وماروت کے بارے میں بھی تفاسیر میں اسرائیلی روایات کی بھرمار ہے۔ لیکن کوئی صحیح مرفوع روایت اس بارے میں ثابت نہیں۔ اللہ تعالیٰ نے بغیر کسی تفصیل کے نہایت اختصار کےساتھ یہ واقعہ بیان کیا ہے، ہمیں صرف اس پر اور اسی حد تک ایمان رکھنا چاہیے (تفسیر ابن کثیر) قرآن کے الفاظ سے یہ ضرور معلوم ہوتا ہے کہ اللہ تعالیٰ نے بابل میں ہاروت وماروت فرشتوں پر جادو کا علم نازل فرمایا تھا اور اس کا مقصد\"واللهُ أَعْلَمُ بِالصَّوَابِ\" یہ معلوم ہوتا ہے، تاکہ وہ لوگوں کو بتائیں کہ انبیا (عليهم السلام)کے ہاتھوں پر ظاہر شدہ معجزے، جادو سے مختلف چیز ہے اور جادو یہ ہے جس کا علم اللہ تعالیٰ کی طرف سے ہمیں عطا کیا گیا ہے (اس دور میں جادو عام ہونے کی وجہ سے لوگ انبیا کو بھی نعوذ باللہ جادوگر اور شعبدہ باز سمجھنے لگے تھے) اسی مغالطے سے لوگوں کو بچانے کے لئے اور بطور امتحان فرشتوں کو نازل فرمایا گیا۔\n- دوسرا مقصد بنواسرائیل کی اخلاقی گراوٹ کی نشاندہی معلوم ہوتا ہے کہ بنواسرائیل کس طرح جادو سیکھنے کے لئے ان فرشتوں کے پیچھے پڑے اور یہ بتلانے کے باوجود کہ جادو کفر ہے اور ہم آزمائش کے لئے آئے ہیں، وہ علم سحر حاصل کرنے کے لئے ٹوٹے پڑ رہے تھے جس سے ان کا مقصد ہنستے بستے گھروں کو اجاڑنا اور میاں بیوی کے درمیان نفرت کی دیواریں کھڑی کرنا تھا۔ یعنی یہ ان کے گراوٹ ، بگاڑ اور فساد کے سلسلے کی اہم کڑی تھی اور اس طرح کے توہمات اور اخلاقی گراوٹ کسی قوم کی انتہائی بگاڑ کی علامت ہیں۔ أَعَاذَنَا اللهُ مِنْهُ\n(3) یہ ایسے ہی ہے جیسے باطل کی تردید کے لئے، باطل مذاہب کا علم کسی استاذ سے حاصل کیا جائے، استاذ شاگرد کو اس یقین دہانی پر باطل مذہب کا علم سکھائے کہ وہ اس کی تردید کرے گا۔ لیکن علم حاصل کرنے کے بعد وہ خود بدمذہب ہوجائے، یا اس کا غلط استعمال کرے تو استاذ اس میں قصوروار نہیں ہوگا۔\n(4) «أَيْ: إِنَّمَا نَحْنُ ابْتِلاءٌ وَاخْتِبَارٌ مِنَ اللهِ لِعِبادِهِ»۔ ”ہم اللہ کی طرف سے بندوں کے لئے آزمائش ہیں۔“ (فتح القدیر)۔\n(5) یہ جادو بھی اس وقت تک کسی کو نقصان نہیں پہنچا سکتا جب تک اللہ کی مشیت اور اس کا اذن نہ ہو۔ اس لئے اس کے سیکھنے کا فائدہ بھی کیا ہے؟ یہی وجہ ہے کہ اسلام نے جادو کے سیکھنے اور اس پر عمل کرنے کو کفر قرار دیا ہے، ہر قسم کی خیر کی طلب اور ضرر کے دفع کے لئے صرف اللہ تعالیٰ ہی کی طرف رجوع کیا جائے، کیوں کہ وہی ہر چیز کا خالق ہے اور کائنات میں ہر کام اسی کی مشیت سے ہوتا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-ittabaʿū mā tatlū al-shayāṭīnu ʿalā mul'ki sulaymāna wamā kafara sulaymānu walākinna al-shayāṭīna kafarū yuʿallimūna al-nāsa al-siḥ'ra wamā unzila ʿalā al-malakayni bibābila hārūta wamārūta wamā yuʿallimāni min aḥadin ḥattā yaqūlā innamā naḥnu fit'natun falā takfur fayataʿallamūna min'humā mā yufarriqūna bihi bayna al-mari wazawjihi wamā hum biḍārrīna bihi min aḥadin illā bi-idh'ni al-lahi wayataʿallamūna mā yaḍurruhum walā yanfaʿuhum walaqad ʿalimū lamani ish'tarāhu mā lahu fī al-ākhirati min khalāqin walabi'sa mā sharaw bihi anfusahum law kānū yaʿlamūna ","translations":["And they followed","what","recite(d)","the devils","over","(the) kingdom","(of) Sulaiman","And not","disbelieved","Sulaiman","[and] but","the devils","disbelieved","they teach","the people","[the] magic","and what","was sent down","to","the two angels","in Babylon","Harut","and Marut","And not","they both teach","any","one","unless","they [both] say","Only","we","(are) a trial","so (do) not","disbelieve","But they learn","from those two","what","[they] causes separation","with it","between","the man","and his spouse","And not","they (could)","at all [be those who] harm","with it","any","one","except","by permission","(of) Allah","And they learn","what","harms them","and not","profits them","And indeed","they knew","that whoever","buys it","not","for him","in","the Hereafter","any","share","And surely evil","(is) what","they sold","with it","themselves","if","they were","(to) know","(102)"],"transliterationArr":["wa-ittabaʿū","mā","tatlū","al-shayāṭīnu","ʿalā","mul'ki","sulaymāna","wamā","kafara","sulaymānu","walākinna","al-shayāṭīna","kafarū","yuʿallimūna","al-nāsa","al-siḥ'ra","wamā","unzila","ʿalā","al-malakayni","bibābila","hārūta","wamārūta","wamā","yuʿallimāni","min","aḥadin","ḥattā","yaqūlā","innamā","naḥnu","fit'natun","falā","takfur","fayataʿallamūna","min'humā","mā","yufarriqūna","bihi","bayna","al-mari","wazawjihi","wamā","hum","biḍārrīna","bihi","min","aḥadin","illā","bi-idh'ni","al-lahi","wayataʿallamūna","mā","yaḍurruhum","walā","yanfaʿuhum","walaqad","ʿalimū","lamani","ish'tarāhu","mā","lahu","fī","al-ākhirati","min","khalāqin","walabi'sa","mā","sharaw","bihi","anfusahum","law","kānū","yaʿlamūna",null],"verseTiming":[[1,0,1300],[2,1300,1600],[3,1600,2290],[4,2290,3690],[5,3690,4350],[6,4350,4910],[7,4910,8430],[8,8430,8960],[9,8960,9560],[10,9560,10750],[11,10750,12260],[12,12260,13630],[13,13630,14400],[14,14400,15690],[15,15690,16960],[16,16960,17780],[17,17780,19830],[18,19830,21330],[19,21330,21670],[20,21670,22920],[21,22920,23930],[22,23930,24975],[23,24975,27977],[24,27977,28895],[25,28895,30235],[26,30235,30440],[27,30440,31160],[28,31160,31920],[29,31920,34380],[30,34380,35900],[31,35900,36420],[32,36420,37890],[33,37890,38760],[34,38760,39530],[35,39530,41680],[36,41680,42630],[37,42630,42990],[38,42990,44370],[39,44370,44990],[40,44990,45500],[41,45500,46370],[42,46370,47820],[43,47820,48450],[44,48450,49600],[45,49600,53410],[46,53410,54080],[47,54080,54460],[48,54460,55290],[49,55290,55960],[50,55960,57061],[51,57061,59254],[52,59254,61081],[53,61081,61300],[54,61300,62530],[55,62530,63140],[56,63140,65510],[57,65510,66200],[58,66200,66990],[59,66990,67550],[60,67550,68580],[61,68580,68980],[62,68980,69530],[63,69530,69760],[64,69760,70960],[65,70960,71250],[66,71250,73670],[67,73670,74970],[68,74970,75280],[69,75280,75920],[70,75920,78030],[71,78030,80490],[72,80490,80830],[73,80830,81640],[74,81640,84235]]}}