{"name":"2:114","price":"اس شخص سے بڑھ کر ﻇالم کون ہے جو اللہ تعالیٰ کی مسجدوں میں اللہ تعالیٰ کے ذکر کئے جانے کو روکے(1) اور ان کی بربادی کی کوشش کرے(2)، ایسے لوگوں کو خوف کھاتے ہوئے اس میں جانا چاہیئے(3)، ان کے لئے دنیا میں بھی رسوائی ہے اور آخرت میں بھی بڑا عذاب ہے۔","arabic":"وَمَنۡ أَظۡلَمُ مِمَّن مَّنَعَ مَسَٰجِدَ ٱللَّهِ أَن يُذۡكَرَ فِيهَا ٱسۡمُهُۥ وَسَعَىٰ فِي خَرَابِهَآۚ أُوْلَٰٓئِكَ مَا كَانَ لَهُمۡ أَن يَدۡخُلُوهَآ إِلَّا خَآئِفِينَۚ لَهُمۡ فِي ٱلدُّنۡيَا خِزۡيٞ وَلَهُمۡ فِي ٱلۡأٓخِرَةِ عَذَابٌ عَظِيمٞ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":121,"juzNumber":1,"footnotes":"(1) جن لوگوں نے مسجدوں میں اللہ کا ذکر کرنے سے روکا، یہ کون ہیں؟ ان کے بارے میں مفسرین کی دو رائے ہیں : ایک رائے یہ ہے کہ اس سے مراد عیسائی ہیں، جنہوں نے بادشاہ روم کے ساتھ مل کر بیت المقدس میں یہودیوں کو نماز پڑھنے سے روکا او ر اس کی تخریب میں حصہ لیا۔ ابن جریر طبری نے اسی رائے کو اختیار کیا ہے، لیکن حافظ ابن کثیر نے اس سے اختلاف کرتے ہوئے اس کا مصداق مشرکین مکہ کو قرار دیا ہے، جنہوں نے ایک تو نبی (صلى الله عليه وسلم) اورآپ (صلى الله عليه وسلم) کے صحابہ (رضي الله عنهم) کو مکہ سے نکلنے پر مجبور کردیا اور یوں خانہ کعبہ میں مسلمانوں کو عبادت سے روکا۔ پھر صلح حدیبیہ کے موقعے پر بھی یہی کردار دہرایا اور کہا کہ ہم اپنے آبا واجداد کے قاتلوں کو مکہ میں داخل نہیں ہونے دیں گے، حالانکہ خانہ کعبہ میں کسی کو عبادت سے روکنے کی اجازت اور روایت نہیں تھی۔\n(2) تخریب اور بربادی صرف یہی نہیں ہے کہ اسےڈھا دیا جائے اور عمارت کو نقصان پہنچایا جائے، بلکہ ان میں اللہ کی عبادت اور ذکر سے روکنا، اقامت شریعت اور مظاہر شرک سے پاک کرنے سے منع کرنا بھی تخریب اور اللہ کے گھروں کو برباد کرنا ہے۔\n(3) یہ الفاظ خبر کے ہیں، لیکن مراد اس سے یہ خواہش ہے کہ جب اللہ تعالیٰ تمہیں تمکن اور غلبہ عطا فرمائے تو تم ان مشرکین کو اس میں صلح اور جزیے کے بغیر رہنے کی اجازت نہ دینا، چنانچہ جب 8 ہجری میں مکہ فتح ہوا تو نبی (صلى الله عليه وسلم) نے اعلان فرما دیا کہ آئندہ سال کعبہ میں کسی مشرک کو حج کرنے کی اور ننگا طواف کرنے کی اجازت نہیں ہوگی اور جس سے جو معاہدہ ہے، معاہدے کی مدت تک اسے یہاں رہنے کی اجازت ہے، بعض نے کہا ہے کہ یہ خوشخبری اور پیش گوئی ہے کہ عنقریب مسلمانوں کو غلبہ حاصل ہوجائے گا اور یہ مشرکین خانہ کعبہ میں ڈرتے ہوئے داخل ہوں گے کہ ہم نے جو مسلمانوں پر پہلے زیادتیاں کی ہیں، ان کے بدلے میں ہمیں سزا سے دوچار یا قتل نہ کردیا جائے۔ چنانچہ جلد ہی یہ خوشخبری پوری ہوگئی۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waman aẓlamu mimman manaʿa masājida al-lahi an yudh'kara fīhā us'muhu wasaʿā fī kharābihā ulāika mā kāna lahum an yadkhulūhā illā khāifīna lahum fī al-dun'yā khiz'yun walahum fī al-ākhirati ʿadhābun ʿaẓīmun ","translations":["And who","(is) more unjust","than (one) who","prevents","(the) masajid","(of) Allah","to","be mentioned","in them","His name","and strives","for","their destruction","Those","Not","it is","for them","that","they enter them","except","(like) those in fear","For them","in","the world","(is) disgrace","and for them","in","the Hereafter","(is) a punishment","great","(114)"],"transliterationArr":["waman","aẓlamu","mimman","manaʿa","masājida","al-lahi","an","yudh'kara","fīhā","us'muhu","wasaʿā","fī","kharābihā","ulāika","mā","kāna","lahum","an","yadkhulūhā","illā","khāifīna","lahum","fī","al-dun'yā","khiz'yun","walahum","fī","al-ākhirati","ʿadhābun","ʿaẓīmun",null],"verseTiming":[[1,0,738],[2,738,1688],[3,1688,3323],[4,3323,4348],[5,4348,5170],[6,5170,6057],[7,6057,7074],[8,7074,7710],[9,7710,8309],[10,8309,9113],[11,9113,9813],[12,9813,10356],[13,10356,11690],[14,11690,14338],[15,14338,14830],[16,14830,15375],[17,15375,16045],[18,16045,17142],[19,17142,19621],[20,19621,20342],[21,20342,24500],[22,24500,25269],[23,25269,25694],[24,25694,26463],[25,26463,28014],[26,28014,28608],[27,28608,28974],[28,28974,29917],[29,29917,30847],[30,30847,33091]]}}