{"name":"2:118","price":"اسی طرح بے علم لوگوں نے بھی کہا کہ خود اللہ تعالیٰ ہم سے باتیں کیوں نہیں کرتا، یا ہمارے پاس کوئی نشانی کیوں نہیں آتی؟(1) اسی طرح ایسی ہی بات ان کے اگلوں نے بھی کہی تھی، ان کے اور ان کے دل یکساں ہوگئے(2) ہم نے تو یقین والوں کے لئے نشانیاں بیان کردیں","arabic":"وَقَالَ ٱلَّذِينَ لَا يَعۡلَمُونَ لَوۡلَا يُكَلِّمُنَا ٱللَّهُ أَوۡ تَأۡتِينَآ ءَايَةٞۗ كَذَٰلِكَ قَالَ ٱلَّذِينَ مِن قَبۡلِهِم مِّثۡلَ قَوۡلِهِمۡۘ تَشَٰبَهَتۡ قُلُوبُهُمۡۗ قَدۡ بَيَّنَّا ٱلۡأٓيَٰتِ لِقَوۡمٖ يُوقِنُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":125,"juzNumber":1,"footnotes":"(1) اس سے مراد مشرکین عرب ہیں جنہوں نے یہودیوں کی طرح مطالبہ کیا کہ اللہ تعالیٰ ہم سے براہ راست گفتگو کیوں نہیں کرتا، یا کوئی بڑی نشانی کیوں نہیں دکھا دیتا؟ جسے دیکھ کر ہم مسلمان ہوجائیں جس طرح کہ سورۂ بنی اسرائیل (آیت 90 تا 93) میں اور دیگر مقامات پر بھی بیان کیا گیا ہے۔\n(2) یعنی مشرکین عرب کے دل، کفروعناد اور انکار وسرکشی میں اپنے ماقبل کے لوگوں کے دلوں کے مشابہ ہوگئے۔ جیسے سورۂ ذاریات میں فرمایا گیا : «كَذَلِكَ مَا أَتَى الَّذِينَ مِنْ قَبْلِهِمْ مِنْ رَسُولٍ إِلا قَالُوا سَاحِرٌ أَوْ مَجْنُونٌ، أَتَوَاصَوْا بِهِ بَلْ هُمْ قَوْمٌ طَاغُونَ»۔ ”ان سے پہلے جو بھی رسول آیا، اس کو لوگوں نے جادوگر یا دیوانہ ہی کہا۔ کیا یہ اس بات کی ایک دوسرے کوو صیت کرجاتے تھے؟ نہیں یہ سب سرکش لوگ ہیں۔“ یعنی قدر مشترک ان سب میں سرکشی کا جذبہ ہے، اس لئے داعیان حق کے سامنے نئے نئے مطالبے رکھتے ہیں، یا انہیں دیوانہ گردانتے ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waqāla alladhīna lā yaʿlamūna lawlā yukallimunā al-lahu aw tatīnā āyatun kadhālika qāla alladhīna min qablihim mith'la qawlihim tashābahat qulūbuhum qad bayyannā al-āyāti liqawmin yūqinūna ","translations":["And said","those who","(do) not","know","Why not","speaks to us","Allah","or","comes to us","a sign","Like that","said","those","from","before them","similar","their saying","Became alike","their hearts","Indeed","We have made clear","the signs","for people","(who) firmly believe","(118)"],"transliterationArr":["waqāla","alladhīna","lā","yaʿlamūna","lawlā","yukallimunā","al-lahu","aw","tatīnā","āyatun","kadhālika","qāla","alladhīna","min","qablihim","mith'la","qawlihim","tashābahat","qulūbuhum","qad","bayyannā","al-āyāti","liqawmin","yūqinūna",null],"verseTiming":[[1,0,870],[2,870,1870],[3,1870,2360],[4,2360,3610],[5,3610,4330],[6,4330,5510],[7,5510,6400],[8,6400,6730],[9,6730,9340],[10,9340,10500],[11,10500,11520],[12,11520,12010],[13,12010,13060],[14,13060,14050],[15,14050,15010],[16,15010,16300],[17,16300,17660],[18,17660,18920],[19,18920,20450],[20,20450,20810],[21,20810,22350],[22,22350,23650],[23,23650,25300],[24,25300,28405]]}}