{"name":"2:121","price":"جنہیں ہم نے کتاب دی ہے(1) اور وه اسے پڑھنے کے حق کے ساتھ پڑھتے ہیں(2)، وه اس کتاب پر بھی ایمان رکھتے ہیں اور جو اس کے ساتھ کفر کرے وه نقصان واﻻ ہے۔(3)","arabic":"ٱلَّذِينَ ءَاتَيۡنَٰهُمُ ٱلۡكِتَٰبَ يَتۡلُونَهُۥ حَقَّ تِلَاوَتِهِۦٓ أُوْلَٰٓئِكَ يُؤۡمِنُونَ بِهِۦۗ وَمَن يَكۡفُرۡ بِهِۦ فَأُوْلَٰٓئِكَ هُمُ ٱلۡخَٰسِرُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":128,"juzNumber":1,"footnotes":"(1) اہل کتاب کے ناخلف لوگوں کے مذموم اخلاق وکردار کی ضروری تفصیل کے بعد ان میں جو لوگ کچھ صالح اور اچھے کردار کے تھے، اس آیت میں ان کی خوبیاں، اور ان کے مومن ہونے کی خبر دی جارہی ہے۔ ان میں عبداللہ بن سلام (رضي الله عنه) اور ان جیسے دیگر افراد ہیں، جن کو یہودیوں میں سے قبول اسلام کی توفیق حاصل ہوئی۔\n(2) (وہ اس طرح پڑھتے ہیں، جس طرح پڑھنے کا حق ہے)۔ کے کئی مطلب بیان کئے گئے ہیں۔ مثلاً خوب توجہ اور غور سے پڑھتے ہیں۔ جنت کا ذکر آتا ہے تو جنت کا سوال کرتے اور جہنم کا ذکر آتا ہے تو اس سے پناہ مانگتے ہیں۔ اس کے حلال کو حلال، حرام کو حرام سمجھتے اور کلام الٰہی میں تحریف نہیں کرتے (جیسے دوسرے یہودی کرتے تھے)۔ اس میں جو کچھ تحریر ہے، لوگوں کو بتلاتے ہیں، اس کی کوئی بات چھپاتے نہیں۔ اس کی محکم باتوں پر عمل کرتے، متشابہات پر ایمان رکھتے اور جو باتیں سمجھ میں نہیں آتیں، انہیں علما سے حل کراتے ہیں اس کی ایک ایک بات کا اتباع کرتے ہیں (فتح القدیر) واقعہ یہ ہے کہ حق تلاوت میں یہ سارے ہی مفہوم داخل ہیں اور ہدایت ایسے ہی لوگوں کے حصے میں آتی ہے جو مذکورہ باتوں کا اہتمام کرتے ہیں۔\n(3) اہل کتاب میں سے جو نبی (صلى الله عليه وسلم) کی رسالت پر ایمان نہیں لائے گا، وہ جہنم میں جائے گا۔ كَمَا فِي الصَّحِيحِ (ابن کثیر)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"alladhīna ātaynāhumu al-kitāba yatlūnahu ḥaqqa tilāwatihi ulāika yu'minūna bihi waman yakfur bihi fa-ulāika humu al-khāsirūna ","translations":["Those","We have given them","the Book","recite it","(as it has the) right","(of) its recitation","Those (people)","believe","in it","And whoever","disbelieves","in it","then those","they","(are) the losers","(121)"],"transliterationArr":["alladhīna","ātaynāhumu","al-kitāba","yatlūnahu","ḥaqqa","tilāwatihi","ulāika","yu'minūna","bihi","waman","yakfur","bihi","fa-ulāika","humu","al-khāsirūna",null],"verseTiming":[[1,0,1240],[2,1240,2780],[3,2780,3920],[4,3920,5190],[5,5190,5870],[6,5870,8510],[7,8510,11320],[8,11320,12500],[9,12500,13310],[10,13310,13690],[11,13690,15640],[12,15640,16260],[13,16260,18770],[14,18770,19130],[15,19130,22405]]}}