{"name":"2:129","price":"اے ہمارے رب! ان میں انہی میں سے رسول بھیج(1) جو ان کے پاس تیری آیتیں پڑھے، انہیں کتاب وحکمت(2) سکھائے اور انہیں پاک کرے(3)، یقیناً تو غلبہ واﻻ اور حکمت واﻻ ہے۔","arabic":"رَبَّنَا وَٱبۡعَثۡ فِيهِمۡ رَسُولٗا مِّنۡهُمۡ يَتۡلُواْ عَلَيۡهِمۡ ءَايَٰتِكَ وَيُعَلِّمُهُمُ ٱلۡكِتَٰبَ وَٱلۡحِكۡمَةَ وَيُزَكِّيهِمۡۖ إِنَّكَ أَنتَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":136,"juzNumber":1,"footnotes":"(1) یہ حضرت ابراہیم واسماعیل علیہما السلام کی آخری دعا ہے۔ یہ بھی اللہ تعالیٰ نے قبول فرمائی اور حضرت اسماعیل (عليه السلام) کی اولاد میں سے حضرت محمد رسول (صلى الله عليه وسلم) کو مبعوث فرمایا۔ اسی لئے نبی (صلى الله عليه وسلم) نے فرمایا: ”میں اپنے باپ حضرت ابراہیم (عليه السلام) کی دعا، حضرت عیسیٰ (عليه السلام) کی بشارت اور اپنی والدہ کا خواب ہوں۔“ (الفتح الربانی، ج 20،ص181،189)\n(2) کتاب سے مراد قرآن مجید اور حکمت سے مراد حدیث ہے۔ تلاوت آیات کے بعد تعلیم کتاب وحکمت کے بیان سے معلوم ہوتا ہے کہ قرآن مجید کی نفس تلاوت بھی مقصود اور باعث اجر وثواب ہے۔ تاہم اگر ان کا مفہوم ومطلب بھی سمجھ میں آتا جائے تو سبحان اللہ، سونے پر سہاگہ ہے۔ لیکن اگر قرآن کا ترجمہ ومطلب نہیں آتا، تب بھی اس کی تلاوت میں کوتاہی جائز نہیں ہے۔ تلاوت بجائے خود ایک الگ اور نیک عمل ہے۔ تاہم اس کے مفاہیم اور مطالب سمجھنے کی بھی حتی الامکان کوشش کرنی چاہیے۔\n(3) تلاوت وتعلیم کتاب اور تعلیم حکمت کے بعد آپ (صلى الله عليه وسلم) کی بعثت کا یہ چوتھا مقصد ہے کہ انہیں شرک وتوہمات کی آلائشوں سے اور اخلاق وکردار کی کوتاہیوں سے پاک کریں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"rabbanā wa-ib'ʿath fīhim rasūlan min'hum yatlū ʿalayhim āyātika wayuʿallimuhumu al-kitāba wal-ḥik'mata wayuzakkīhim innaka anta al-ʿazīzu al-ḥakīmu ","translations":["Our Lord","[And] raise up","in them","a Messenger","from them","(who) will recite","to them","Your Verses","and will teach them","the Book","and the wisdom","and purify them","Indeed You","You (are)","the All-Mighty","the All-Wise","(129)"],"transliterationArr":["rabbanā","wa-ib'ʿath","fīhim","rasūlan","min'hum","yatlū","ʿalayhim","āyātika","wayuʿallimuhumu","al-kitāba","wal-ḥik'mata","wayuzakkīhim","innaka","anta","al-ʿazīzu","al-ḥakīmu",null],"verseTiming":[[1,0,1260],[2,1260,1930],[3,1930,2650],[4,2650,3580],[5,3580,4950],[6,4950,5710],[7,5710,6730],[8,6730,8000],[9,8000,9530],[10,9530,10610],[11,10610,11780],[12,11780,13420],[13,13420,15430],[14,15430,16650],[15,16650,17790],[16,17790,21405]]}}