{"name":"2:124","price":"جب ابراہیم ﴿علیہ السلام﴾ کو ان کے رب نے کئی باتوں سے آزمایا(1) اور انہوں نے سب کو پورا کردیا تو اللہ نے فرمایا کہ میں تمہیں لوگوں کا امام بنا دوں گا، عرض کرنے لگے: اور میری اوﻻد کو(2)، فرمایا میرا وعده ﻇالموں سے نہیں۔","arabic":"۞ وَإِذِ ٱبۡتَلَىٰٓ إِبۡرَٰهِـۧمَ رَبُّهُۥ بِكَلِمَٰتٖ فَأَتَمَّهُنَّۖ قَالَ إِنِّي جَاعِلُكَ لِلنَّاسِ إِمَامٗاۖ قَالَ وَمِن ذُرِّيَّتِيۖ قَالَ لَا يَنَالُ عَهۡدِي ٱلظَّٰلِمِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":131,"juzNumber":1,"footnotes":"(1) کلمات سے مراد احکام شریعت، مناسک حج، ذبح پسر، ہجرت، نارنمرود وغیرہ وہ تمام آزمائشیں ہیں، جن سے حضرت ابراہیم (عليه السلام) گزارے گئے اور ہر آزمائش میں کامیاب وکامران رہے، جس کے صلے میں امام الناس کے منصب پر فائز کئے گئے، چنانچہ مسلمان ہی نہیں، یہودی عیسائی حتیٰ کہ مشرکین عرب سب ہی میں ان کی شخصیت محترم اور پیشوا مانی اور سمجھی جاتی ہے۔\n(2) اللہ تعالیٰ نے حضرت ابراہیم (عليه السلام) کی اس خواہش کو پورا فرمایا، جس کا ذکر قرآن مجید میں ہی ہے: «وَجَعَلْنَا فِي ذُرِّيَّتِهِ النُّبُوَّةَ وَالْكِتَابَ»۔ (العنکبوت: 27) ”ہم نے نبوت اور کتاب کو اس کی اولاد میں کردیا۔“ پس ہر نبی جسے اللہ نے مبعوث کیا اور ہر کتاب جو ابراہیم (عليه السلام) کے بعد نازل فرمائی، اولاد ابراہیم ہی میں یہ سلسلہ رہا۔ (ابن کثیر) اس کے ساتھ ہی یہ فرما کر کہ (میرا وعدہ ظالموں سے نہیں) اس امر کی وضاحت فرمادی کہ ابراہیم کی اتنی اونچی شان اور عنداللہ منزلت کے باوجود، اولاد ابراہیم میں سے جو ناخلف اور ظالم ومشرک ہوں گے، ان کی شقاوت ومحرومی کو دور کرنے والا کوئی نہیں ہوگا۔ اللہ تعالیٰ نے یہاں پیمبر زادگی کی جڑ کاٹ دی ہے۔ اگر ایمان وعمل صالح نہیں، تو پیرزادگی اور صاحبزادگی کی بارگاہ الٰہی میں کیا حیثیت ہوگی؟ نبی (صلى الله عليه وسلم) کا فرمان ہے : «مَنْ بَطَّأَ بِهِ عَمَلُهُ لَمْ يُسْرِعْ بِه نَسَبُه» (صحيح مسلم ، كتاب الذكر والدعاء ... باب فضل الاجتماع على تلاوة القرآن ...) ”جس کو اس کا عمل پیچھے چھوڑ گیا، اس کا نسب اسے آگے نہیں بڑھا سکے گا۔“","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-idhi ib'talā ib'rāhīma rabbuhu bikalimātin fa-atammahunna qāla innī jāʿiluka lilnnāsi imāman qāla wamin dhurriyyatī qāla lā yanālu ʿahdī al-ẓālimīna ","translations":["And when","tried","Ibrahim","his Lord","with words","and he fulfilled them","He said","Indeed I","(am) the One to make you","for the mankind","a leader","He said","And from","my offspring","He said","(Does) not","reach","My Covenant","(to) the wrongdoers","(124)"],"transliterationArr":["wa-idhi","ib'talā","ib'rāhīma","rabbuhu","bikalimātin","fa-atammahunna","qāla","innī","jāʿiluka","lilnnāsi","imāman","qāla","wamin","dhurriyyatī","qāla","lā","yanālu","ʿahdī","al-ẓālimīna",null],"verseTiming":[[1,0,770],[2,770,3330],[3,3330,4710],[4,4710,5800],[5,5800,7940],[6,7940,10890],[7,10890,11930],[8,11930,13130],[9,13130,14220],[10,14220,15960],[11,15960,17450],[12,17450,18070],[13,18070,19250],[14,19250,20930],[15,20930,21980],[16,21980,22330],[17,22330,23180],[18,23180,23770],[19,23770,26535]]}}