{"name":"2:13","price":"اور جب ان سے کہا جاتا ہے کہ اور لوگوں (یعنی صحابہ) کی طرح تم بھی ایمان لاؤ تو جواب دیتے ہیں کہ کیا ہم ایسا ایمان ﻻئیں جیسا بیوقوف ﻻئے ہیں(1) ، خبردار ہوجاؤ! یقیناً یہی بیوقوف ہیں، لیکن جانتے نہیں۔(2)","arabic":"وَإِذَا قِيلَ لَهُمۡ ءَامِنُواْ كَمَآ ءَامَنَ ٱلنَّاسُ قَالُوٓاْ أَنُؤۡمِنُ كَمَآ ءَامَنَ ٱلسُّفَهَآءُۗ أَلَآ إِنَّهُمۡ هُمُ ٱلسُّفَهَآءُ وَلَٰكِن لَّا يَعۡلَمُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":20,"juzNumber":1,"footnotes":"(1) ان منافقین نے ان صحابہ (رضي الله عنهم) کو ”بےوقوف“ کہا، جنہوں نے اللہ کی راہ میں جان ومال کی کسی بھی قربانی سے دریغ نہیں کیا اور آﺝ کے منافقین یہ باور کراتے ہیں کہ نعوذ باللہ صحابہ کرام (رضي الله عنهم) دولت ایمان ہی سے محروم تھے۔ اللہ تعالیٰ نے جدید وقدیم دونوں منافقین کی تردید فرمائی۔ فرمایا کسی اعلیٰ تر مقصد کے لئے دنیوی مفادات کو قربان کردینا، بے وقوفی نہیں، عین عقل مندی اور سعادت ہے۔ صحابہ (رضي الله عنهم) نے اسی سعادت مندی کا ثبوت مہیا کیا ہے، اس لئے وہ پکے مومن ہی نہیں، بلکہ ایمان کے لئے ایک معیار اور کسوٹی ہیں، اب ایمان ان ہی کا معتبر ہوگا جو صحابہ کرام (رضي الله عنهم) ہی کی طرح ایمان لائیں گے۔ «فَإِنۡ ءَامَنُواْ بِمِثۡلِ مَآ ءَامَنتُم بِهِۦ فَقَدِ ٱهۡتَدَواْ» (البقرة: 137).\n(2) ظاہر بات ہے کہ نفع عاجل (فوری فائدے) کے لئے نفع آجل (دیر سے ملنے والے فائدے) کو نظرانداز کردینا اور آخرت کی پائیدار اور دائمی زندگی کے مقابلے میں دنیا کی فانی زندگی کو ترجیح دینا اور اللہ کی بجائے لوگوں سے ڈرنا پرلے درجے کی سفاہت ہے جس کا ارتکاب ان منافقین نے کیا۔ یوں ایک مسلمہ حقیقت سے بےعلم رہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-idhā qīla lahum āminū kamā āmana al-nāsu qālū anu'minu kamā āmana al-sufahāu alā innahum humu al-sufahāu walākin lā yaʿlamūna ","translations":["And when","it is said","to them","Believe","as","believed","the people","they say","Should we believe","as","believed","the fools","Beware","certainly they","themselves","(are) the fools","[and] but","not","they know","(13)"],"transliterationArr":["wa-idhā","qīla","lahum","āminū","kamā","āmana","al-nāsu","qālū","anu'minu","kamā","āmana","al-sufahāu","alā","innahum","humu","al-sufahāu","walākin","lā","yaʿlamūna",null],"verseTiming":[[1,0,850],[2,850,1430],[3,1430,1940],[4,1940,2810],[5,2810,4600],[6,4600,5250],[7,5250,6590],[8,6590,8470],[9,8470,9390],[10,9390,11280],[11,11280,11930],[12,11930,14680],[13,14680,16920],[14,16920,18230],[15,18230,18610],[16,18610,21110],[17,21110,21850],[18,21850,22380],[19,22380,24835]]}}