{"name":"2:135","price":"یہ کہتے ہیں کہ یہود و نصاریٰ بن جاؤ تو ہدایت پاؤ گے۔ تم کہو بلکہ صحیح راه پر ملت ابراہیمی والے ہیں، اور ابراہیم خالص اللہ کے پرستار تھے اور مشرک نہ تھے۔(1)","arabic":"وَقَالُواْ كُونُواْ هُودًا أَوۡ نَصَٰرَىٰ تَهۡتَدُواْۗ قُلۡ بَلۡ مِلَّةَ إِبۡرَٰهِـۧمَ حَنِيفٗاۖ وَمَا كَانَ مِنَ ٱلۡمُشۡرِكِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":142,"juzNumber":1,"footnotes":"(1) یہودی، مسلمانوں کو یہودیت کی اور عیسائی، عیسائیت کی دعوت دیتے اور کہتے کہ ہدایت اسی میں ہے۔ اللہ تعالیٰ نے فرمایا، ان سے کہو ہدایت ملت ابراہیم کی پیروی میں ہے جو حنیف تھا (یعنی الٰہ واحد کا پرستار اور سب سے کٹ کر اسی کی عبادت کرنے والا) اور وہ مشرک نہیں تھا۔ جب کہ یہودیت اور عیسائیت دونوں میں شرک کی آمیزش موجود ہے۔ اور اب بدقسمتی سے مسلمانوں میں بھی شرک کے مظاہر عام ہیں، اسلام کی تعلیمات اگرچہ بحمداللہ قرآن وحدیث میں محفوظ ہیں، جن میں توحید کا تصور بالکل بےغبار اور نہایت واضح ہے، جس سے یہودیت، عیسائیت اور ثنویت (دو خداؤں کے قائل مذاہب) سے اسلام کا امتیاز نمایاں ہے لیکن مسلمانوں کی ایک بہت بڑی تعداد کے اعمال وعقائد مین جو مشرکانہ اقدار وتصورات در آئے ہیں، اس نے اسلام کے امتیاز کو دنیا کی نظروں سے اوجھل کردیا ہے۔ کیوں کہ غیر مذاہب والوں کی دسترس براہ راست قرآن وحدیث تک تو نہیں ہوسکتی، وہ تو مسلمانوں کے عمل کو دیکھ کر ہی یہ اندازہ کریں گے کہ اسلام میں اور دیگر مشرکانہ تصورات سے آلودہ مذاہب کے مابین تو کوئی امتیاز ہی نظر نہیں آتا۔ اگلی آیت میں ایمان کا معیار بتلایا جارہا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waqālū kūnū hūdan aw naṣārā tahtadū qul bal millata ib'rāhīma ḥanīfan wamā kāna mina al-mush'rikīna ","translations":["And they said","Be","Jews","or","Christians","(then) you will be guided","Say","Nay","(the) religion","(of) Ibrahim","(the) upright","and not","he was","of","those who associated partners (with Allah)","(135)"],"transliterationArr":["waqālū","kūnū","hūdan","aw","naṣārā","tahtadū","qul","bal","millata","ib'rāhīma","ḥanīfan","wamā","kāna","mina","al-mush'rikīna",null],"verseTiming":[[1,0,1090],[2,1090,2000],[3,2000,2800],[4,2800,3200],[5,3200,4280],[6,4280,5430],[7,5430,6280],[8,6280,6710],[9,6710,7560],[10,7560,8890],[11,8890,10490],[12,10490,10940],[13,10940,11620],[14,11620,11960],[15,11960,15185]]}}