{"name":"2:148","price":"ہر شخص ایک نہ ایک طرف متوجہ ہو رہا ہے(1) تم نیکیوں کی طرف دوڑو۔ جہاں کہیں بھی تم ہوگے، اللہ تمہیں لے آئے گا۔ اللہ تعالیٰ ہر چیز پر قادر ہے۔","arabic":"وَلِكُلّٖ وِجۡهَةٌ هُوَ مُوَلِّيهَاۖ فَٱسۡتَبِقُواْ ٱلۡخَيۡرَٰتِۚ أَيۡنَ مَا تَكُونُواْ يَأۡتِ بِكُمُ ٱللَّهُ جَمِيعًاۚ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":155,"juzNumber":2,"footnotes":"(1) یعنی ہر مذہب والے نے اپنا پسندیدہ قبلہ بنا رکھا ہے جس کی طرف وہ رخ کرتا ہے۔ ایک دوسرا مفہوم یہ ہے کہ ہر ایک مذہب نے اپنا ایک منہاج اور طریقہ بنا رکھا ہے، جیسے قرآن مجید کے دوسرے مقام پر ہے: «لِكُلّٖ جَعَلۡنَا مِنكُمۡ شِرۡعَةٗ وَمِنۡهَاجٗاۚ وَلَوۡ شَآءَ ٱللَّهُ لَجَعَلَكُمۡ أُمَّةٗ وَٰحِدَةٗ وَلَٰكِن لِّيَبۡلُوَكُمۡ فِي مَآ ءَاتَىٰكُمۡ» [المائدة: 48]. یعنی اللہ تعالیٰ نے ہدایت اور ضلالت دونوں کی وضاحت کے بعد انسان کو ان دونوں میں سے کسی کو بھی اختیار کرنے کی جو آزادی دی ہے، اس کی وجہ ے مختلف طریقے اور دستور لوگوں نے بنا لئے ہیں جو ایک دوسرے سے مختلف ہیں۔ اللہ تعالیٰ چاہتا تو سب کو ایک ہی راستےیعنی ہدایت کے راستے پر چلا سکتا تھا، لیکن یہ سلب اختیارات کے بغیر ممکن نہ تھا اور اختیار دینے سے مقصود ان کا امتحان ہے۔ اس لئے اےمسلمانو! تم تو خیرات کی طرف سبقت کرو، یعنی نیکی اور بھلائی ہی کے راستے پر گامزن رہو اور یہ وحی الٰہی اور اتباع رسول (صلى الله عليه وسلم) ہی کا راستہ ہے جس سے دیگر اہل ادیان محروم ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walikullin wij'hatun huwa muwallīhā fa-is'tabiqū al-khayrāti ayna mā takūnū yati bikumu al-lahu jamīʿan inna al-laha ʿalā kulli shayin qadīrun ","translations":["And for everyone","(is) a direction ","he","turns towards it","so race","(to) the good","Wherever","that","you will be","will bring","you","(by) Allah","together","Indeed","Allah","(is) on","every","thing","All-Powerful","(148)"],"transliterationArr":["walikullin","wij'hatun","huwa","muwallīhā","fa-is'tabiqū","al-khayrāti","ayna","mā","takūnū","yati","bikumu","al-lahu","jamīʿan","inna","al-laha","ʿalā","kulli","shayin","qadīrun",null],"verseTiming":[[1,0,1320],[2,1320,2760],[3,2760,3060],[4,3060,4580],[5,4580,5930],[6,5930,8750],[7,8750,9280],[8,9280,9590],[9,9590,10580],[10,10580,11150],[11,11150,11670],[12,11670,12430],[13,12430,13930],[14,13930,15290],[15,15290,16070],[16,16070,16600],[17,16600,17140],[18,17140,18650],[19,18650,20845]]}}