{"name":"2:143","price":"ہم نے اسی طرح تمہیں عادل امت بنایا ہے(1) تاکہ تم لوگوں پر گواه ہوجاؤ اور رسول (صلی اللہ علیہ وسلم) تم پر گواه ہوجائیں، جس قبلہ پر تم پہلے سے تھے اسے ہم نے صرف اس لئے مقرر کیا تھا کہ ہم جان لیں کہ رسول کا سچا تابعدار کون ہے اور کون ہے جو اپنی ایڑیوں کے بل پلٹ جاتا ہے(2) گو یہ کام مشکل ہے، مگر جنہیں اللہ نے ہدایت دی ہے (ان پر کوئی مشکل نہیں) اللہ تعالیٰ تمہارے ایمان ضائع نہ کرے گا(3) اللہ تعالیٰ لوگوں کے ساتھ شفقت اور مہربانی کرنے واﻻ ہے","arabic":"وَكَذَٰلِكَ جَعَلۡنَٰكُمۡ أُمَّةٗ وَسَطٗا لِّتَكُونُواْ شُهَدَآءَ عَلَى ٱلنَّاسِ وَيَكُونَ ٱلرَّسُولُ عَلَيۡكُمۡ شَهِيدٗاۗ وَمَا جَعَلۡنَا ٱلۡقِبۡلَةَ ٱلَّتِي كُنتَ عَلَيۡهَآ إِلَّا لِنَعۡلَمَ مَن يَتَّبِعُ ٱلرَّسُولَ مِمَّن يَنقَلِبُ عَلَىٰ عَقِبَيۡهِۚ وَإِن كَانَتۡ لَكَبِيرَةً إِلَّا عَلَى ٱلَّذِينَ هَدَى ٱللَّهُۗ وَمَا كَانَ ٱللَّهُ لِيُضِيعَ إِيمَٰنَكُمۡۚ إِنَّ ٱللَّهَ بِٱلنَّاسِ لَرَءُوفٞ رَّحِيمٞ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":150,"juzNumber":2,"footnotes":"(1) «وَسَطٌ» کے لغوی معنی تو درمیان کے ہیں، لیکن یہ بہتر اور افضل کے معنی میں بھی استعمال ہوتا ہے، یہاں اسی معنی میں اس کا استعمال ہوا ہے،یعنی جس طرح تمہیں سب سے بہتر قبلہ عطاکیاگیا ہے، اسی طرح تمہیں سب سے افضل امت بھی بنایا گیا ہے اور مقصد اس کا یہ ہے کہ تم لوگوں پر گواہی دو۔ جیسا کہ دوسرے مقام پر ہے «لِيَكُونَ الرَّسُولُ شَهِيدًا عَلَيْكُمْ وَتَكُونُوا شُهَدَاءَ عَلَى النَّاسِ» (سورۂ الحج۔78) ”رسول تم پر اور تم لوگوں پر گواہ ہو۔“ اس کی وضاحت بعض احادیث میں اس طرح آتی ہے کہ جب اللہ تعالیٰ پیغمبروں سے قیامت والے دن پوچھے گا کہ تم نے میرا پیغام لوگوں تک پہنچایا تھا؟ وہ اثبات میں جواب دیں گے، اللہ تعالیٰ فرمائے گا، تمہارا کوئی گواہ ہے؟ وہ کہیں گے ہاں محمد (صلى الله عليه وسلم) اور ان کی امت، چنانچہ یہ امت گواہی دے گی۔ اس لئے اس کا ترجمہ عادل بھی کیا گیا ہے۔ (ابن کثیر) ایک معنی وسط کے اعتدال کے بھی کئے گئے ہیں۔ یعنی امت معتدل یعنی افراط وتفریط سے پاک۔ یہ اسلام کی تعلیمات کے اعتبار سے ہے کہ اس میں اعتدال ہے، افراط وتفریط نہیں۔\n(2) یہ تحویل قبلہ کی ایک غرض بیان کی گئی ہے، مومنین صادقین تو رسول اللہ (صلى الله عليه وسلم) کے اشارۂ ابرو کے منتظر رہا کرتے تھے، اس لئے ان کے تو ادھر سے ادھر پھر جانا کوئی مشکل معاملہ نہ تھا بلکہ ایک مقام پر تو عین نماز کی حالت میں جب کہ وہ رکوع میں تھے یہ حکم پہنچا تو انہوں نے رکوع ہی میں اپنا رخ خانہ کعبہ کی طرف پھیر لیا۔ یہ مسجد قبلتین (یعنی وہ مسجد جس میں ایک نماز دو قبلوں کی طرف رخ کرکے پڑھی گئی) کہلاتی ہے اور ایسا ہی واقعہ مسجد قبا میں بھی ہوا۔ «لِنَعْلَمَ» ”تاکہ ہم جان لیں“ اللہ کو تو پہلے بھی علم تھا، اس کا مطلب ہے تاکہ ہم اہل یقین کو اہل شک سے علیحدہ کردیں تاکہ لوگوں کے سامنےبھی دونوں قسم کے لوگ واضح ہوجائیں (فتح القدیر)\n(3) بعض صحابہ (رضي الله عنهم) کے ذہن میں یہ اشکال پیدا ہوا کہ جو صحابہ (رضي الله عنهم) بیت المقدس کی طرف رخ کرکے نماز پڑھنے کے زمانے میں فوت ہوچکے تھے، یا ہم جتنے عرصے اس طرف رخ کرکے نماز پڑھتے رہے ہیں یہ ضائع ہوگئیں،یا شاید ان کا ثواب نہیں ملے گا، اللہ تعالیٰ نے فرمایا یہ نمازیں ضائع نہیں ہوں گی، تمہیں پورا ثواب ملے گا۔ یہاں نماز کو ایمان سے تعبیر کرکے یہ بھی واضح کردیا کہ نماز کے بغیر ایمان کی کوئی حیثیت نہیں۔ ایمان تب ہی معتبر ہے جب نماز اور دیگر احکام الٰہی کی پابندی ہوگی۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wakadhālika jaʿalnākum ummatan wasaṭan litakūnū shuhadāa ʿalā al-nāsi wayakūna al-rasūlu ʿalaykum shahīdan wamā jaʿalnā al-qib'lata allatī kunta ʿalayhā illā linaʿlama man yattabiʿu al-rasūla mimman yanqalibu ʿalā ʿaqibayhi wa-in kānat lakabīratan illā ʿalā alladhīna hadā al-lahu wamā kāna al-lahu liyuḍīʿa īmānakum inna al-laha bil-nāsi laraūfun raḥīmun ","translations":["And thus","We made you","a community","(of the) middle way","so that you will be","witnesses","over","the mankind","and will be","the Messenger","on you","a witness","And not","We made","the direction of prayer","which","you were used to","[on it]","except","that We make evident","(he) who","follows","the Messenger","from (he) who","turns back","on","his heels","And indeed","it was","certainly a great (test)","except","for","those whom","guided","(by) Allah","And not","will","Allah","let go waste","your faith","Indeed","Allah","(is) to [the] mankind","Full of Kindness","Most Merciful","(143)"],"transliterationArr":["wakadhālika","jaʿalnākum","ummatan","wasaṭan","litakūnū","shuhadāa","ʿalā","al-nāsi","wayakūna","al-rasūlu","ʿalaykum","shahīdan","wamā","jaʿalnā","al-qib'lata","allatī","kunta","ʿalayhā","illā","linaʿlama","man","yattabiʿu","al-rasūla","mimman","yanqalibu","ʿalā","ʿaqibayhi","wa-in","kānat","lakabīratan","illā","ʿalā","alladhīna","hadā","al-lahu","wamā","kāna","al-lahu","liyuḍīʿa","īmānakum","inna","al-laha","bil-nāsi","laraūfun","raḥīmun",null],"verseTiming":[[1,0,1370],[2,1370,2750],[3,2750,5020],[4,5020,5640],[5,5640,7000],[6,7000,9510],[7,9510,9850],[8,9850,11250],[9,11250,12170],[10,12170,13230],[11,13230,14180],[12,14180,15770],[13,15770,16380],[14,16380,17150],[15,17150,18120],[16,18120,18960],[17,18960,20260],[18,20260,22370],[19,22370,23190],[20,23190,24180],[21,24180,24350],[22,24350,26150],[23,26150,27140],[24,27140,28210],[25,28210,30330],[26,30330,30990],[27,30990,33620],[28,33620,34790],[29,34790,35560],[30,35560,36990],[31,36990,37770],[32,37770,38200],[33,38200,39130],[34,39130,39560],[35,39560,42410],[36,42410,42960],[37,42960,43550],[38,43550,44430],[39,44430,45430],[40,45430,47080],[41,47080,48660],[42,48660,49530],[43,49530,51320],[44,51320,52240],[45,52240,54795]]}}