{"name":"2:158","price":"صفا اور مروه اللہ تعالیٰ کی نشانیوں میں سے ہیں(1) ، اس لئے بیت اللہ کا حج وعمره کرنے والے پر ان کا طواف کرلینے میں بھی کوئی گناه نہیں(2) اپنی خوشی سے بھلائی کرنے والوں کا اللہ قدردان ہے اور انہیں خوب جاننے واﻻ ہے۔","arabic":"۞ إِنَّ ٱلصَّفَا وَٱلۡمَرۡوَةَ مِن شَعَآئِرِ ٱللَّهِۖ فَمَنۡ حَجَّ ٱلۡبَيۡتَ أَوِ ٱعۡتَمَرَ فَلَا جُنَاحَ عَلَيۡهِ أَن يَطَّوَّفَ بِهِمَاۚ وَمَن تَطَوَّعَ خَيۡرٗا فَإِنَّ ٱللَّهَ شَاكِرٌ عَلِيمٌ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":165,"juzNumber":2,"footnotes":"(1) شَعَائِرُ شَعِيرَةٌ کی جمع ہے، جس کے معنی علامت کے ہیں، یہاں حج کے وہ مناسک (مثلاً موقف، سعی، منحر، ہدی (قربانی) کو اشعار کرنا وغیرہ) مراد ہیں، جو اللہ تعالیٰ نے مقرر فرمائے ہیں۔\n(2) صفا اور مروہ کے درمیان سعی کرنا، حج کا ایک رکن ہے۔ لیکن قرآن کے الفاظ (کوئی گناہ نہیں) سے بعض صحابہ (رضي الله عنهم) کو یہ شبہ ہوا کہ شاید یہ ضروری نہیں ہے۔ حضرت عائشہ (رضي الله عنه) کے علم مین جب یہ بات آئی تو انہوں نے فرمایا: اگر اس کا یہ مطلب ہوتا تو پھر اللہ تعالیٰ یوں فرماتا: «فَلا جُنَاحَ عَلَيْهِ أَنْ لا يَطَّوَّفَ بِهمَا» ”اگر ان کا طواف نہ کرے تو کوئی گناہ نہیں“ پھر اس کی شان نزول بیان فرمائی کہ انصار قبول اسلام سے قبل مناۂ طاغیہ (بت) کے نام کا تلبیہ پکارتے، جس کی وہ مشلل پہاڑی پر عبادت کرتے تھے اور پھر مکہ پہنچ کر ایسے لوگ صفا مروہ کے درمیان سعی کو گناہ سمجھتے تھے، مسلمان ہونے کے بعد انہوں نے رسول اللہ (صلى الله عليه وسلم) سے پوچھا تو یہ آیت نازل ہوئی جس میں کہا گیا کہ صفا مروہ کے درمیان سعی گناہ نہیں۔ (صحيح بخاري، كتاب الحج باب وجوب الصفا والمروة) بعض حضرات نے اس کا پس منظر اس طرح بیان فرمایا ہے کہ جاہلیت میں مشرکوں نے صفا پہاڑی پر ایک بت (اساف) مروہ پہاڑی پر نائلہ بت رکھا ہوا تھا، جنہیں وہ سعی کے دوران بوسہ دیتے یا چھوتے۔ جب مسلمان ہوئے تو ان کے ذہن میں آیا کہ صفا مروہ کے درمیان سعی تو شاید گناہ ہو، کیوں کہ اسلام سے قبل دو بتوں کی وجہ سے سعی کرتے رہے تھے۔ اللہ تعالیٰ نے اس آیت میں ان کے اس وہم اور خلش کو دور فرما دیا۔ اب یہ سعی ضروری ہے جس کا آغاز صفا سے اور خاتمہ مروہ پر ہوتا ہے۔ (ایسر التفاسیر)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"inna al-ṣafā wal-marwata min shaʿāiri al-lahi faman ḥajja al-bayta awi iʿ'tamara falā junāḥa ʿalayhi an yaṭṭawwafa bihimā waman taṭawwaʿa khayran fa-inna al-laha shākirun ʿalīmun ","translations":["Indeed","the Safa","and the Marwah","(are) from","(the) symbols","(of) Allah","So whoever","performs Hajj","(of) the House","or","performs Umrah","so no","blame","on him","that","he walks","between [both of] them","And whoever","voluntarily does","good","then indeed","Allah","(is) All-Appreciative","All-Knowing","(158)"],"transliterationArr":["inna","al-ṣafā","wal-marwata","min","shaʿāiri","al-lahi","faman","ḥajja","al-bayta","awi","iʿ'tamara","falā","junāḥa","ʿalayhi","an","yaṭṭawwafa","bihimā","waman","taṭawwaʿa","khayran","fa-inna","al-laha","shākirun","ʿalīmun",null],"verseTiming":[[1,0,1170],[2,1170,1920],[3,1920,3050],[4,3050,3820],[5,3820,5960],[6,5960,8310],[7,8310,8800],[8,8800,9410],[9,9410,10160],[10,10160,10480],[11,10480,11230],[12,11230,11710],[13,11710,12450],[14,12450,13190],[15,13190,13490],[16,13490,15030],[17,15030,15800],[18,15800,17520],[19,17520,18450],[20,18450,19680],[21,19680,21090],[22,21090,21860],[23,21860,22810],[24,22810,24855]]}}