{"name":"2:15","price":"اللہ تعالیٰ بھی ان سے مذاق کرتا ہے(1) اور انہیں ان کی سرکشی اور بہکاوے میں اور بڑھا دیتا ہے۔","arabic":"ٱللَّهُ يَسۡتَهۡزِئُ بِهِمۡ وَيَمُدُّهُمۡ فِي طُغۡيَٰنِهِمۡ يَعۡمَهُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":22,"juzNumber":1,"footnotes":"(1) ”اللہ تعالیٰ بھی ان سے مذاق کرتا ہے“ کا ایک مطلب تو یہ ہے کہ وہ جس طرح مسلمانوں کے ساتھ استہزا واستخفاف کا معاملہ کرتے ہیں، اللہ تعالیٰ بھی ان سے ایسا ہی معاملہ کرتے ہوئے انہیں ذلت وادبار میں مبتلا کرتا ہے۔ اس کو استہزا سے تعبیر کرنا، زبان کا اسلوب ہے، ورنہ حقیقتاً یہ استہزا نہیں ہے، ان کے فعل استہزا کی سزا ہے جیسے «وَجَزَٰٓؤُاْ سَيِّئَةٖ سَيِّئَةٞ مِّثۡلُهَا» (الشورى- 40) ”برائی کا بدلہ، اسی کی مثل برائی ہے“ میں برائی کے بدلے کو برائی کہا گیا ہے حالانکہ وہ برائی نہیں ہے ایک جائز فعل ہے۔ اسی طرح «يُخَادِعُونَ اللَّهَ وَهُوَ خَادِعُهُمْ»، «وَمَكَرُوا وَمَكَرَ اللَّهُ» وغیرہ آیات میں ہے۔ دوسرا مطلب یہ ہے کہ قیامت والے دن اللہ تعالیٰ بھی ان سے استہزا فرمائے گا۔ جیسا کہ سورۂ حدید کی آیت «يَوْمَ يَقُولُ الْمُنَافِقُونَ» الآية میں وضاحت ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"al-lahu yastahzi-u bihim wayamudduhum fī ṭugh'yānihim yaʿmahūna ","translations":["Allah","mocks","at them","and prolongs them","in","their transgression","they wander blindly","(15)"],"transliterationArr":["al-lahu","yastahzi-u","bihim","wayamudduhum","fī","ṭugh'yānihim","yaʿmahūna",null],"verseTiming":[[1,0,950],[2,950,2050],[3,2050,2590],[4,2590,3770],[5,3770,4170],[6,4170,5440],[7,5440,7855]]}}