{"name":"2:150","price":"اور جس جگہ سے آپ نکلیں اپنا منھ مسجد حرام کی طرف پھیر لیں اور جہاں کہیں تم ہو اپنے چہرے اسی طرف کیا کرو(1) تاکہ لوگوں کی کوئی حجت تم پر باقی نہ ره جائے(2) سوائے ان لوگوں کے جنہوں نے ان میں سے ﻇلم کیا ہے(3) تم ان سے نہ ڈرو(4) مجھ ہی سے ڈرو اور تاکہ میں اپنی نعمت تم پر پوری کروں اور اس لئے بھی کہ تم راه راست پاؤ۔","arabic":"وَمِنۡ حَيۡثُ خَرَجۡتَ فَوَلِّ وَجۡهَكَ شَطۡرَ ٱلۡمَسۡجِدِ ٱلۡحَرَامِۚ وَحَيۡثُ مَا كُنتُمۡ فَوَلُّواْ وُجُوهَكُمۡ شَطۡرَهُۥ لِئَلَّا يَكُونَ لِلنَّاسِ عَلَيۡكُمۡ حُجَّةٌ إِلَّا ٱلَّذِينَ ظَلَمُواْ مِنۡهُمۡ فَلَا تَخۡشَوۡهُمۡ وَٱخۡشَوۡنِي وَلِأُتِمَّ نِعۡمَتِي عَلَيۡكُمۡ وَلَعَلَّكُمۡ تَهۡتَدُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":157,"juzNumber":2,"footnotes":"(1) قبلہ کی طرف منہ پھیرنے کا حکم تین مرتبہ دہرایا گیا ہے، یا تو اس کی تاکید اور اہمیت واضح کرنے کے لئے، یا یہ چوں کہ نسخ حکم کا پہلا تجربہ تھا، اس لئے ذہنی خلجان دور کرنے کے لئے ضروری تھا کہ اسے بار بار دہرا کر دلوں میں راسخ کردیا جائے، یا تعدد علت کی وجہ سے ایسا کیا گیا۔ ایک علت نبی (صلى الله عليه وسلم) کی مرضی اور خواہش تھی، وہاں اسے بیان کیا۔ دوسری علت، ہر اہل ملت اور صاحب دعوت کے لئے ایک مستقل مرکز کا وجود ہے، وہاں اسے دہرایا۔ تیسری، علت مخالفین کے اعتراضات کا ازالہ ہے، وہاں اسے بیان کیا گیا ہے (فتح القدیر)\n(2) یعنی اہل کتاب یہ نہ کہہ سکیں کہ ہماری کتابوں میں تو ان کا قبلہ خانہ کعبہ ہے اور نماز یہ بیت المقدس کی طرف پڑھتے ہیں۔\n(3) یہاں«ظَلَمُوا» سے مراد معاندین (عنادرکھنے والے) ہیں یعنی اہل کتب میں سے جو معاندین ہیں، وہ یہ جاننے کے باوجود کہ پیغمبر آخرالزماں (صلى الله عليه وسلم) کا قبلہ خانہ کعبہ ہی ہوگا، وہ بطور عناد کہیں گے کہ بیت المقدس کے بجائے خانہ کعبہ کو اپنا قبلہ بنا کر یہ پیغمبر (صلى الله عليه وسلم) بالآخر اپنے آبائی دین ہی کی طرف مائل ہوگیا ہے اور بعض کے نزدیک اس سے مراد مشرکین مکہ ہیں۔\n(4) ظالموں سے نہ ڈرو۔ یعنی مشرکوں کی باتوں کی پروا مت کرو۔ انہوں نے کہا تھا کہ محمد ( (صلى الله عليه وسلم) ) نے ہمارا قبلہ تو اختیار کرلیا ہے، عنقریب ہمارا دین بھی اپنا لیں گے۔ (مجھ ہی سے ڈرتے رہو)۔ جو حکم میں دیتا رہوں، اس پر بلاخوف عمل کرتے رہو۔ تحویل قبلہ کو اتمام نعمت اور ہدایت یافتگی سے تعبیر فرمایا کہ حکم الٰہی پر عمل کرنا یقیناً انسان کو انعام واکرام کا مستحق بھی بناتا ہے اور ہدایت کی توفیق بھی اسے نصیب ہوتی ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wamin ḥaythu kharajta fawalli wajhaka shaṭra al-masjidi al-ḥarāmi waḥaythu mā kuntum fawallū wujūhakum shaṭrahu li-allā yakūna lilnnāsi ʿalaykum ḥujjatun illā alladhīna ẓalamū min'hum falā takhshawhum wa-ikh'shawnī wali-utimma niʿ'matī ʿalaykum walaʿallakum tahtadūna ","translations":["And from","wherever","you start forth","[so] turn","your face","(in the) direction","(of) Al-Masjid","Al-Haraam","And wherever","that","you (all) are","[so] turn","your faces","(in) its direction","so that not","will be","for the people","against you","any argument","except","those who","wronged","among them","so (do) not","fear them","but fear Me","And that I complete","My favor","upon you","[and] so that you may","(be) guided","(150)"],"transliterationArr":["wamin","ḥaythu","kharajta","fawalli","wajhaka","shaṭra","al-masjidi","al-ḥarāmi","waḥaythu","mā","kuntum","fawallū","wujūhakum","shaṭrahu","li-allā","yakūna","lilnnāsi","ʿalaykum","ḥujjatun","illā","alladhīna","ẓalamū","min'hum","falā","takhshawhum","wa-ikh'shawnī","wali-utimma","niʿ'matī","ʿalaykum","walaʿallakum","tahtadūna",null],"verseTiming":[[1,0,700],[2,700,1270],[3,1270,2040],[4,2040,2830],[5,2830,3560],[6,3560,4030],[7,4030,5110],[8,5110,7070],[9,7070,8310],[10,8310,8640],[11,8640,10290],[12,10290,11440],[13,11440,12410],[14,12410,13400],[15,13400,14380],[16,14380,15190],[17,15190,16560],[18,16560,17540],[19,17540,18530],[20,18530,19060],[21,19060,20010],[22,20010,20800],[23,20800,21580],[24,21580,22130],[25,22130,23440],[26,23440,25010],[27,25010,25570],[28,25570,26840],[29,26840,28040],[30,28040,29710],[31,29710,30630],[32,30630,31680],[33,31680,33010],[34,33010,35765]]}}