{"name":"2:165","price":"بعض لوگ ایسے بھی ہیں جو اللہ کے شریک اوروں کو ٹھہرا کر ان سے ایسی محبت رکھتے ہیں، جیسی محبت اللہ سے ہونی چاہیئے(1) اور ایمان والے اللہ کی محبت میں بہت سخت ہوتے ہیں(2) کاش کہ مشرک لوگ جانتے جب کہ اللہ کے عذاب کو دیکھ کر (جان لیں گے) کہ تمام طاقت اللہ ہی کو ہے اور اللہ تعالیٰ سخت عذاب دینے واﻻ ہے (تو ہرگز شرک نہ کرتے)۔","arabic":"وَمِنَ ٱلنَّاسِ مَن يَتَّخِذُ مِن دُونِ ٱللَّهِ أَندَادٗا يُحِبُّونَهُمۡ كَحُبِّ ٱللَّهِۖ وَٱلَّذِينَ ءَامَنُوٓاْ أَشَدُّ حُبّٗا لِّلَّهِۗ وَلَوۡ يَرَى ٱلَّذِينَ ظَلَمُوٓاْ إِذۡ يَرَوۡنَ ٱلۡعَذَابَ أَنَّ ٱلۡقُوَّةَ لِلَّهِ جَمِيعٗا وَأَنَّ ٱللَّهَ شَدِيدُ ٱلۡعَذَابِ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":172,"juzNumber":2,"footnotes":"(1) مذکورہ دلائل واضحہ اور براہین قاطعہ کے باوجود ایسے لوگ ہیں جو اللہ کو چھوڑ کر دوسروں کو اس کا شریک بنا لیتے ہیں اور ان سے اسی طرح محبت کرتے ہیں جس طرح اللہ سے کرنی چاہیے، بعثت محمدی کے وقت ہی ایسا نہیں تھا، شرک کے یہ مظاہر آج بھی عام ہیں، بلکہ اسلام کے نام لیواؤں کے اندر بھی یہ بیماری گھر کر گئی ہے، انہوں نے بھی نہ صرف غیر اللہ اور پیروں، فقیروں اور سجادہ نشینوں کو اپنا ماویٰ وملجا اور قبلۂ حاجات بنا رکھا ہے، بلکہ ان سے ان کی محبت، اللہ سے بھی زیادہ ہے اور توحید کا وعظ ان کو بھی اسی طرح کھلتا ہے جس طرح مشرکین مکہ کو اس سے تکلیفیں ہوتی تھی، جس کا نقشہ اللہ نے اس آیت میں کھینچا ہے : «وَإِذَا ذُكِرَ اللَّهُ وَحْدَهُ اشْمَأَزَّتْ قُلُوبُ الَّذِينَ لا يُؤْمِنُونَ بِالآخِرَةِ وَإِذَا ذُكِرَ الَّذِينَ مِنْ دُونِهِ إِذَا هُمْ يَسْتَبْشِرُونَ» (سورة الزمر:45) ”اور جب تنہا اللہ کا ذکر کیا جاتا ہے تو جو لوگ آخرت پر یقین نہیں رکھتے، ان کے دل سکڑ جاتے ہیں اور جب اس کے سوا اوروں کا ذکر کیا جاتا ہے تو خوش ہوجاتے ہیں۔“ «اشْمَأزَّتْ»، دلوں کا تنگ ہونا۔\n(2) تاہم اہل ایمان کو مشرکین کے برعکس اللہ تعالیٰ ہی سے سب سے زیادہ محبت ہوتی ہے۔ کیونکہ مشرکین جب سمندر وغیرہ میں پھنس جاتے ہیں تووہاں انہیں اپنے معبود بھول جاتے ہیں اور وہاں صرف اللہ تعالیٰ ہی کو پکارتے ہیں۔ «فَإِذَا رَكِبُوا فِي الْفُلْكِ دَعَوُا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ» (العنكبوت: 65) «وَإِذَا غَشِيَهُمْ مَوْجٌ كَالظُّلَلِ دَعَوُا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ» (لقمان:32) «وَظَنُّوا أَنَّهُمْ أُحِيطَ بِهِمْ دَعَوُا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ» (يونس: 22) ان سب کا خلاصہ یہ ہے کہ مشرکین سخت مصیبت میں مدد کے لئے صرف ایک اللہ کو پکارتے ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wamina al-nāsi man yattakhidhu min dūni al-lahi andādan yuḥibbūnahum kaḥubbi al-lahi wa-alladhīna āmanū ashaddu ḥubban lillahi walaw yarā alladhīna ẓalamū idh yarawna al-ʿadhāba anna al-quwata lillahi jamīʿan wa-anna al-laha shadīdu al-ʿadhābi ","translations":["And among","the mankind","who","takes","from","besides","Allah","equals","They love them","as (they should) love","Allah","And those who","believe[d]","(are) stronger","(in) love","for Allah","And if","would see","those who","wronged","when","they will see","the punishment","that","the power","(belongs) to Allah","all","and [that]","Allah","(is) severe","(in) [the] punishment","(165)"],"transliterationArr":["wamina","al-nāsi","man","yattakhidhu","min","dūni","al-lahi","andādan","yuḥibbūnahum","kaḥubbi","al-lahi","wa-alladhīna","āmanū","ashaddu","ḥubban","lillahi","walaw","yarā","alladhīna","ẓalamū","idh","yarawna","al-ʿadhāba","anna","al-quwata","lillahi","jamīʿan","wa-anna","al-laha","shadīdu","al-ʿadhābi",null],"verseTiming":[[1,0,670],[2,670,2060],[3,2060,2260],[4,2260,3940],[5,3940,4820],[6,4820,5400],[7,5400,6250],[8,6250,7840],[9,7840,10250],[10,10250,11030],[11,11030,13140],[12,13140,14270],[13,14270,15350],[14,15350,16610],[15,16610,17340],[16,17340,17940],[17,17940,20730],[18,20730,21280],[19,21280,21670],[20,21670,22610],[21,22610,24370],[22,24370,24690],[23,24690,25400],[24,25400,26460],[25,26460,27310],[26,27310,28300],[27,28300,29270],[28,29270,30220],[29,30220,31890],[30,31890,32660],[31,32660,33460],[32,33460,35395]]}}