{"name":"2:178","price":"اے ایمان والو! تم پر مقتولوں کا قصاص لینا فرض کیا گیا ہے، آزاد آزاد کے بدلے، غلام غلام کے بدلے، عورت عورت کے بدلے(1) ۔ ہاں جس کسی کو اس کے بھائی کی طرف سے کچھ معافی دے دی جائے اسے بھلائی کی اتباع کرنی چاہئے اور آسانی کے ساتھ دیت ادا کرنی چاہئے(2)۔ تمہارے رب کی طرف سے یہ تخفیف اور رحمت(3) ہے اس کے بعد بھی جو سرکشی کرے اسے درد ناک عذاب ہوگا۔(4)","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ كُتِبَ عَلَيۡكُمُ ٱلۡقِصَاصُ فِي ٱلۡقَتۡلَىۖ ٱلۡحُرُّ بِٱلۡحُرِّ وَٱلۡعَبۡدُ بِٱلۡعَبۡدِ وَٱلۡأُنثَىٰ بِٱلۡأُنثَىٰۚ فَمَنۡ عُفِيَ لَهُۥ مِنۡ أَخِيهِ شَيۡءٞ فَٱتِّبَاعُۢ بِٱلۡمَعۡرُوفِ وَأَدَآءٌ إِلَيۡهِ بِإِحۡسَٰنٖۗ ذَٰلِكَ تَخۡفِيفٞ مِّن رَّبِّكُمۡ وَرَحۡمَةٞۗ فَمَنِ ٱعۡتَدَىٰ بَعۡدَ ذَٰلِكَ فَلَهُۥ عَذَابٌ أَلِيمٞ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":185,"juzNumber":2,"footnotes":"(1) زمانہ جاہلیت میں کوئی نظم اور قانون تو تھا نہیں، اس لئے زور آور قبیلے کمزور قبیلوں پر جس طرح چاہتے، ظلم وجور کا ارتکاب کرلیتے۔ ایک ظلم کی شکل یہ تھی کہ کسی طاقت ور قبیلے کا کوئی مرد قتل ہوجاتا تو وہ صرف قاتل کو قتل کرنے کے بجائے قاتل کے قبیلے کے کئی مردوںکو ، بلکہ بسااوقات پورے قبیلے ہی کو تہس نہس کرنے کی کوشش کرتے اور عورت کے بدلے مرد کو اور غلام کے بدلے آزاد کو قتل کرتے۔ اللہ تعالیٰ نے اس فرق وامتیاز کو ختم کرتے ہوئے فرمایا کہ جو قاتل ہوگا، قصاص (بدلے) میں اسی کو قتل کیا جائے گا۔ قاتل آزاد ہے تو بدلے میں وہی آزاد، غلام ہے تو بدلے میں وہی غلام اور عورت ہے تو بدلے میں وہی عورت ہی قتل کی جائے گی، نہ کہ غلام کی جگہ آزاد اور عورت کی جگہ مرد، یا ایک مرد کے بدلے میں متعدد مرد۔ اس کا یہ مطلب نہیں کہ مرد اگر عورت کو قتل کردے تو قصاص میں کوئی عورت قتل کی جائے گی، یا عورت مرد کو قتل کردے تو کسی مرد کو قتل کیا جائے گا (جیسا کہ ظاہری الفاظ سے مفہوم نکلتا ہے) بلکہ یہ الفاظ شان نزول کے اعتبار سے ہیں جس سے یہ واضح ہوجاتا ہے کہ قصاص میں قاتل ہی کو قتل کیا جائے گا، چاہے مرد ہو یا عورت، طاقتور ہو یا کمزور۔ «الْمُسْلِمُونَ تَتَكَافَأُ دِمَاؤُهُمْ » - الحديث (سنن أبي داود ، كتاب الجهاد ، باب في السرية ترد على أهل العسكر) «تمام مسلمانوں کے خون (مرد ہو یا عورت) برابر ہیں»۔ گویا آیت کا وہی مفہوم ہے جو قرآن کریم کی دوسری آیت، «النَّفْسَ بِالنَّفْسِ» (المائدۂ: 45) کا ہے۔ احناف نے اس سے استدلال کرتے ہوئے کہا ہے کہ مسلمان کو کافر کے قصاص میں قتل کیا جائے گا لیکن جمہور علما اس کے قائل نہیں، کیوں کہ حدیث میں وضاحت ہے: «لا يُقْتَلُ مُسْلِمٌ بِكَافِرٍ» (صحيح بخاري، كتاب الديات، باب لا يقتل المسلم بالكافر) ”مسلمان، کافر کے بدلے قتل نہیں کیا جائے گا“ (فتح القدیر) مزید دیکھیے آیت 45، سورۂ المائدہ۔\n(2) معافی کی دو صورتیں ہیں : ایک بغیر معاوضہ مالی یعنی دیت لئے بغیر ہی محض رضائے الٰہی کے لئے معاف کردینا، دوسری صورت، قصاص کی بجائے دیت قبول کرلینا، اگر یہ دوسری صورت اختیار کی جائے تو کہا جا رہا ہے کہ طالب دیت بھلائی کا اتباع کرے۔ «وَأَدَاءٌ إِلَيْهِ بِإِحْسَانٍ» میں قاتل کو کہا جا رہا ہے کہ بغیر تنگ کئے اچھے طریقے سے دیت کی ادائیگی کرے۔ اولیائے مقتول نے اس کی جان بخشی کرکے اس پر جو احسان کیا ہے، اس کا بدلہ احسان ہی کے ساتھ دے۔ «هَلْ جَزَاءُ الإِحْسَانِ إِلا الإِحْسَانُ» (الرحمٰن)\n(3) یہ تخفیف اور رحمت (یعنی قصاص،معافی یا دیت تین صورتیں) اللہ تعالیٰ کی طرف سے خاص تم پر ہوئی ہے ورنہ اس سے قبل اہل تورات کے لئے قصاص یا معافی تھی، دیت نہیں تھی اور اہل انجیل (عیسائیوں) میں صرف معافی ہی تھی، قصاص تھا نہ دیت۔ (ابن کثیر)۔\n(4) قبول دیت یا اخذ دیت کے بعد قتل بھی کردے تو یہ سرکشی اور زیادتی ہے جس کی سزا اسے دنیا وآخرت میں بھگتنی ہوگی۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāayyuhā alladhīna āmanū kutiba ʿalaykumu al-qiṣāṣu fī al-qatlā al-ḥuru bil-ḥuri wal-ʿabdu bil-ʿabdi wal-unthā bil-unthā faman ʿufiya lahu min akhīhi shayon fa-ittibāʿun bil-maʿrūfi wa-adāon ilayhi bi-iḥ'sānin dhālika takhfīfun min rabbikum waraḥmatun famani iʿ'tadā baʿda dhālika falahu ʿadhābun alīmun ","translations":["O you","who","believe[d]","Prescribed","for you","(is) the legal retribution","in","(the matter of) the murdered","the freeman","for the freeman","and the slave","for the slave","and the female","for the female","But whoever","is pardoned","[for it]","from","his brother","anything","then follows up","with suitable","[and] payment","to him","with kindness","That (is)","a concession","from","your Lord","and mercy","Then whoever","transgresses","after","that","then for him","(is) a punishment","painful","(178)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","kutiba","ʿalaykumu","al-qiṣāṣu","fī","al-qatlā","al-ḥuru","bil-ḥuri","wal-ʿabdu","bil-ʿabdi","wal-unthā","bil-unthā","faman","ʿufiya","lahu","min","akhīhi","shayon","fa-ittibāʿun","bil-maʿrūfi","wa-adāon","ilayhi","bi-iḥ'sānin","dhālika","takhfīfun","min","rabbikum","waraḥmatun","famani","iʿ'tadā","baʿda","dhālika","falahu","ʿadhābun","alīmun",null],"verseTiming":[[1,0,2600],[2,2600,3450],[3,3450,4410],[4,4410,4990],[5,4990,5880],[6,5880,6800],[7,6800,7000],[8,7000,8520],[9,8520,9400],[10,9400,10270],[11,10270,11190],[12,11190,12090],[13,12090,13850],[14,13850,15880],[15,15880,16750],[16,16750,17400],[17,17400,17830],[18,17830,18220],[19,18220,18920],[20,18920,20080],[21,20080,21710],[22,21710,23000],[23,23000,25290],[24,25290,26080],[25,26080,28680],[26,28680,29420],[27,29420,30570],[28,30570,31340],[29,31340,32530],[30,32530,33760],[31,33760,34300],[32,34300,35040],[33,35040,35620],[34,35620,36330],[35,36330,37040],[36,37040,38010],[37,38010,40085]]}}