{"name":"2:172","price":"اے ایمان والو! جو پاکیزه چیزیں ہم نے تمہیں دے رکھی ہیں انہیں کھاؤ، پیو اور اللہ تعالیٰ کا شکر کرو، اگر تم خاص اسی کی عبادت کرتے ہو۔(1)","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ كُلُواْ مِن طَيِّبَٰتِ مَا رَزَقۡنَٰكُمۡ وَٱشۡكُرُواْ لِلَّهِ إِن كُنتُمۡ إِيَّاهُ تَعۡبُدُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":179,"juzNumber":2,"footnotes":"(1) اس میں اہل ایمان کو ان تمام پاکیزہ چیزوں کے کھانے کا حکم ہے جو اللہ نے حلال کی ہیں اور اس پر اللہ کا شکر ادا کرنے کی تاکید ہے۔ اس سے ایک تو یہ معلوم ہوا کہ اللہ کی حلال کردہ چیزیں ہی پاک اور طیب ہیں، حرام کردہ اشیا پاک نہیں، چاہے وہ نفس کو کتنی ہی مرغوب ہوں (جیسے اہل یورپ کو سور کا گوشت بڑا مرغوب ہے) دوسرایہ کہ بتوں کے نام پر منسوب جانوروں اور اشیا کو مشرکین اپنے اوپر جو حرام کرلیتے تھے (جس کی تفصیل سورۂ الانعام میں ہے) مشرکین کا یہ عمل غلط ہے اور اس طرح ایک حلال چیز حرام نہیں ہوتی، تم ان کی طرح ان کو حرام مت کرو (حرام صرف وہی ہیں جس کی تفصیل اس کے بعد والی آیت میں ہے) ، تیسرا یہ کہ اگر تم صرف ایک اللہ کے عبادت گزار ہو تو ادائے شکر کا اہتمام کرو۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāayyuhā alladhīna āmanū kulū min ṭayyibāti mā razaqnākum wa-ush'kurū lillahi in kuntum iyyāhu taʿbudūna ","translations":["O you","who","believe[d]","Eat","from","(the) good","(of) what","We have provided you","and be grateful","to Allah","if","you","alone","worship Him","(172)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","kulū","min","ṭayyibāti","mā","razaqnākum","wa-ush'kurū","lillahi","in","kuntum","iyyāhu","taʿbudūna",null],"verseTiming":[[1,0,2650],[2,2650,3530],[3,3530,4400],[4,4400,4990],[5,4990,5840],[6,5840,6990],[7,6990,7280],[8,7280,8640],[9,8640,9460],[10,9460,11830],[11,11830,12690],[12,12690,13610],[13,13610,14610],[14,14610,16010],[15,16010,16880],[16,16880,19815]]}}