{"name":"2:173","price":"تم پر مرده اور (بہا ہوا) خون اور سور کا گوشت اور ہر وه چیز جس پر اللہ کے سوا دوسروں کا نام پکارا گیا ہو حرام ہے(1) پھر جو مجبور ہوجائے اور وه حد سے بڑھنے واﻻ اور زیادتی کرنے واﻻ نہ ہو، اس پر ان کے کھانے میں کوئی گناه نہیں، اللہ تعالیٰ بخشش کرنے واﻻ مہربان ہے۔","arabic":"إِنَّمَا حَرَّمَ عَلَيۡكُمُ ٱلۡمَيۡتَةَ وَٱلدَّمَ وَلَحۡمَ ٱلۡخِنزِيرِ وَمَآ أُهِلَّ بِهِۦ لِغَيۡرِ ٱللَّهِۖ فَمَنِ ٱضۡطُرَّ غَيۡرَ بَاغٖ وَلَا عَادٖ فَلَآ إِثۡمَ عَلَيۡهِۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٌ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":180,"juzNumber":2,"footnotes":"(1) اس آیت میں چار حرام کردہ چیزوں کا ذکر ہے، لیکن اسے کلمہ حصر (انما) کے ساتھ بیان کیا گیا ہے، جس سے ذہن میں یہ شبہ پیدا ہوتا ہے کہ حرام صرف یہی چار چیزیں ہیں، جب کہ ان کے علاوہ بھی کئی چیزیں حرام ہیں، اس لئے اول تو یہ سمجھ لینا چاہیے کہ یہ حصر ایک خاص سیاق میں آیا ہے، یعنی مشرکین کے اس فعل کے ضمن میں کہ وہ حلال جانوروں کو بھی، حرام قرار دے لیتے تھے، اللہ تعالیٰ نے فرمایا کہ وہ حرام نہیں، حرام تو صرف یہ یہ ہیں۔ اس لئے حصر اضافی ہے، یعنی اس کے علاوہ بھی دیگر محرمات ہیں جو یہاں مذکور نہیں۔ دوسرے، حدیث میں دو اصول، جانوروں کی حلت وحرمت کے لئے، بیان کردیئے گئے ہیں، وہ آیت کی صحیح تفسیر کے طور پر سامنے رہنے چاہئیں درندوں میں ذو ناب (وہ درندہ جو کچلیوں سے شکار کرے) اور پرندوں میں ذومخلب (جو پنجے سے شکار کرے) حرام ہیں، تیسرے، جن جانوروں کی حرمت حدیث سے ثابت ہے، مثلاً گدھا، کتا وغیرہ وہ بھی حرام ہیں، جس سے اس بات کی طرف اشارہ نکلتا ہے کہ حدیث بھی قرآن کریم کی طرح دین کا ماخذ اور دین میں حجت ہے اور دین دونوں کے ماننے سے مکمل ہوتا ہے، نہ کہ حدیث کو نظرانداز کرکے، صرف قرآن سے۔ مردہ سے مراد ہر وہ حلال جانور ہے، جو بغیر ذبح کئے طبعی طور پر یا کسی حادثے سے (جس کی تفصیل سورۂ المائدہ میں ہے) مرگیا ہو۔ یا شرعی طریقے کے خلاف اسے ذبح کیا گیا ہو، مثلاً گلا گھونٹ دیا جائے، یا پتھر اور لکڑی وغیرہ سے مارا جائے، یا جس طرح آج کل مشینی ذبح کا طریقہ ہے جس میں جھٹکے سے مارا جاتا ہے۔ البتہ حدیث میں دو مردار جانور حلال قرار دیئے گئے ہیں۔ ایک مچھلی، دوسری ٹڈی، وہ اس حکم میتہ سے مستثنیٰ ہیں۔ خون سے مراد دم مسفوح ہے۔ یعنی ذبح کے وقت جو خون نکلتا اور بہتا ہے۔ گوشت کے ساتھ جو خون لگا رہ جاتا ہے وہ حلال ہے۔ یہاں بھی دو خون حدیث کی رو سے حلال ہیں : کلیجی اور تلی۔ خنزیر یعنی سور کا گوشت، یہ بےغیرتی میں بدترین جانور ہے، اللہ نے اسے حرام قرار دیا ہے وَمَا أُهِلَّ وہ جانور یا کوئی اور چیز جسے غیراللہ کے نام پر پکارا جائے۔ اس سے مراد وہ جانور ہیں جو غیر اللہ کے نام پر ذبح کئے جائیں۔ جیسے مشرکین عرب لات وعزیٰ وغیرہ کے ناموں پر ذبح کرتے تھے، یا آگ کے نام پر، جیسے مجوسی کرتے تھے۔\nاور اسی میں وہ جانور بھی آجاتے ہیں جو جاہل مسلمان فوت شدہ بزرگوں کی عقیدت ومحبت، ان کی خوشنودی وتقرب حاصل کرنے کے لئے یا ان سے ڈرتے اور امید رکھتے ہوئے، قبروں اور آستانوں پر ذبح کرتے ہیں، یا مجاورین کو بزرگوں کی نیاز کے نام پر دے آتے ہیں (جیسے بہت سے بزرگوں کی قبروں پر بورڈ لگے ہوئے ہیں مثلاً داتا صاحب کی نیاز کے لئے بکرے یہاں جمع کرائے جائیں) ، ان جانوروں کو، چاہے ذبح کے وقت اللہ ہی کا نام لے کر ذبح کیا جائے، یہ حرام ہی ہوں گے۔ کیوں کہ اس سے مقصود، رضائے الہیٰ نہیں، رضائے اہل قبور اور تعظیم لغیر اللہ، یا خوف یا رجاء من غیر اللہ (غیر اللہ سے مافوق الاسباب طریقے سے دڈ یا امید) ہے، جو شرک ہے۔ اسی طریقے سے جانوروں کے علاوہ جو اشیا بھی غیر اللہ کے نام پر نذر نیاز اور چڑھاوے کی ہوں گی، حرام ہوں گی، جیسے قبروں پر لے جاکر یا وہاں سےخرید کر، قبور کے ارد گرد فقرا، ومساکین پر دیگوں اور لنگروں کی، یا مٹھائی اور پیسوں وغیرہ کی تقسیم، یا وہاں صندوقچی میں نذرنیاز کے پیسے ڈالنا، یا عرس کے موقع پر وہاں دودھ پہنچانا، یہ سب کام حرام اور ناجائز ہیں، کیوں کہ یہ سب غیر اللہ کی نذرونیاز کی صورت ہیں اور نذر بھی . نماز، روزہ وغیرہ عبادات کی طرح، ایک عبادت ہے، اور عبادت کی ہر قسم صرف ایک اللہ کے لئے مخصوص ہے۔ اسی لئے حدیث میں ہے : «مَلْعُونٌ مَنْ ذَبَحَ لِغَيْرِ اللهِ» (صحيح الجامع الصغير وزيادته ألباني . جص) ”جس نے غیر اللہ کے نام پر جانور ذبح کیا، وہ ملعون ہے۔“\nتفسیر عزیزی میں بحوالہ تفسیر نیشاپوری ہے; ”أَجْمَعَ الْعُلَمَاءُ لَوْ أَنَّ مُسْلِمًا ذَبَحَ ذَبِيحَةً، يُرِيدُ بِذَبْحِهَا التَّقَرُّبَ إِلَى غَيْرِ اللهِ، صَارَ مُرْتَدًّا وَذَبِيحَتُهُ ذَبِيحَةُ مُرْتَدٍّ۔“ (تفسیر عزیزی ص 611 بحوالہ اشرف الحواشی) ”علما کا اس بات پر اجماع ہے کہ اگر کسی مسلمان نے کوئی جانور غیر اللہ کا تقرب حاصل کرنے کی نیت سے ذبح کیا تو وہ مرتد ہوجائے گا اور اس کا ذبیحہ ایک مرتد کا ذبیحہ ہوگا۔“","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"innamā ḥarrama ʿalaykumu al-maytata wal-dama walaḥma al-khinzīri wamā uhilla bihi lighayri al-lahi famani uḍ'ṭurra ghayra bāghin walā ʿādin falā ith'ma ʿalayhi inna al-laha ghafūrun raḥīmun ","translations":["Only","He has forbidden","to you","the dead animals","and [the] blood","and flesh","(of) swine","and what","has been dedicated","[with it]","to other than","Allah","So whoever","(is) forced by necessity","without","(being) disobedient","and not","transgressor","then no","sin","on him","Indeed","Allah","(is) Oft-Forgiving","Most Merciful","(173)"],"transliterationArr":["innamā","ḥarrama","ʿalaykumu","al-maytata","wal-dama","walaḥma","al-khinzīri","wamā","uhilla","bihi","lighayri","al-lahi","famani","uḍ'ṭurra","ghayra","bāghin","walā","ʿādin","falā","ith'ma","ʿalayhi","inna","al-laha","ghafūrun","raḥīmun",null],"verseTiming":[[1,0,1620],[2,1620,2380],[3,2380,3240],[4,3240,4230],[5,4230,4840],[6,4840,5560],[7,5560,7320],[8,7320,8960],[9,8960,9680],[10,9680,10190],[11,10190,10930],[12,10930,13010],[13,13010,13510],[14,13510,14370],[15,14370,14920],[16,14920,16180],[17,16180,16630],[18,16630,18010],[19,18010,19500],[20,19500,20050],[21,20050,22230],[22,22230,23200],[23,23200,24050],[24,24050,25000],[25,25000,27165]]}}