{"name":"2:184","price":"گنتی کے چند ہی دن ہیں لیکن تم میں سے جو شخص بیمار ہو یا سفر میں ہو تو وه اور دنوں میں گنتی کو پورا(1) کر لے اور اس کی طاقت رکھنے والے(2) فدیہ میں ایک مسکین کو کھانا دیں، پھر جو شخص نیکی میں سبقت کرے وه اسی کے لئے بہتر ہے(3) لیکن تمہارے حق میں بہتر کام روزے رکھنا ہی ہے، اگر تم باعلم ہو۔","arabic":"أَيَّامٗا مَّعۡدُودَٰتٖۚ فَمَن كَانَ مِنكُم مَّرِيضًا أَوۡ عَلَىٰ سَفَرٖ فَعِدَّةٞ مِّنۡ أَيَّامٍ أُخَرَۚ وَعَلَى ٱلَّذِينَ يُطِيقُونَهُۥ فِدۡيَةٞ طَعَامُ مِسۡكِينٖۖ فَمَن تَطَوَّعَ خَيۡرٗا فَهُوَ خَيۡرٞ لَّهُۥۚ وَأَن تَصُومُواْ خَيۡرٞ لَّكُمۡ إِن كُنتُمۡ تَعۡلَمُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":191,"juzNumber":2,"footnotes":"(1) یہ بیمار اور مسافر کو رخصت دے دی گئی ہے کہ وہ بیماری یا سفر کی وجہ سے رمضان المبارک میں جتنے روزے نہ رکھ سکے ہوں، وہ بعد میں رکھ کر گنتی پوری کرلیں۔\n(2) يُطِيقُونَهُ کا ترجمہ يتَجَشَّمُونَهُ (نہایت مشقت سے روزہ رکھ سکیں) کیا گیا ہے (یہ حضرت ابن عباس رضی اللہ عنہما سے منقول ہے، امام بخاری نے بھی اسے پسند کیا ہے) یعنی جو شخص زیادہ بڑھاپے یا ایسی بیماری کی وجہ سے، جس سے شفایابی کی امید نہ ہو، روزہ رکھنے میں مشقت محسوس کرے، وہ ایک مسکین کا کھانا بطور فدیہ دے دے، لیکن جمہور مفسرین نے اس کا ترجمہ (طاقت رکھتے) ہیں ہی کیا ہے، جس کا مطلب یہ ہے کہ ابتدائے اسلام میں روزے کی عادت نہ ہونے کی وجہ سے طاقت رکھنے والوں کو بھی رخصت دے دی گئی تھی کہ اگر وہ روزہ نہ رکھیں تو اس کے بدلے ایک مسکین کو کھانا دے دیا کریں۔ لیکن بعد میں «فَمَنْ شَهِدَ مِنْكُمُ الشَّهْرَ فَلْيَصُمْهُ» کے ذریعے اسے منسوخ کرکے ہر صاحب طاقت کے لئے روزہ فرض کردیا گیا، تاہم زیادہ بوڑھے، دائمی مریض کے لئے اب بھی یہی حکم ہے کہ وہ فدیہ دے دیں اور ”حَامِلَةٌ“ (حمل والی) اور ”مُرْضِعَةٌ“ (دودھ پلانے والی) عورتیں اگر مشقت محسوس کریں تو وہ مریض کے حکم میں ہوں گی یعنی وہ روزہ نہ رکھیں اور بعد میں روزے کی قضا دیں (تحفة الأحوذي شرح ترمذي)\n(3) جو خوشی سے ایک مسکین کی بجائے دو یا تین مسکینوں کو کھانا کھلا دے تو اس کے لئے زیادہ بہتر ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"ayyāman maʿdūdātin faman kāna minkum marīḍan aw ʿalā safarin faʿiddatun min ayyāmin ukhara waʿalā alladhīna yuṭīqūnahu fid'yatun ṭaʿāmu mis'kīnin faman taṭawwaʿa khayran fahuwa khayrun lahu wa-an taṣūmū khayrun lakum in kuntum taʿlamūna ","translations":["(Fasting for) days","numbered","So whoever","is","among you","sick","or","on","a journey","then a prescribed number","of","days","other","And on","those who","can afford it","a ransom","(of) feeding","a poor","And whoever","volunteers","good","then it","(is) better","for him","And to","fast","(is) better","for you","if","you","know","(184)"],"transliterationArr":["ayyāman","maʿdūdātin","faman","kāna","minkum","marīḍan","aw","ʿalā","safarin","faʿiddatun","min","ayyāmin","ukhara","waʿalā","alladhīna","yuṭīqūnahu","fid'yatun","ṭaʿāmu","mis'kīnin","faman","taṭawwaʿa","khayran","fahuwa","khayrun","lahu","wa-an","taṣūmū","khayrun","lakum","in","kuntum","taʿlamūna",null],"verseTiming":[[1,0,1440],[2,1440,4670],[3,4670,5150],[4,5150,5240],[5,5240,5930],[6,5930,6420],[7,6420,7770],[8,7770,9250],[9,9250,9580],[10,9580,10110],[11,10110,11460],[12,11460,12360],[13,12360,13360],[14,13360,14520],[15,14520,15470],[16,15470,15950],[17,15950,16820],[18,16820,18290],[19,18290,19710],[20,19710,20540],[21,20540,22870],[22,22870,24020],[23,24020,24980],[24,24980,26210],[25,26210,26700],[26,26700,27320],[27,27320,28220],[28,28220,29360],[29,29360,30320],[30,30320,31100],[31,31100,32130],[32,32130,33230],[33,33230,34550],[34,34550,37055]]}}