{"name":"2:2","price":"اس کتاب (کے اللہ کی کتاب ہونے) میں کوئی شک نہیں(1) پرہیزگاروں کو راه دکھانے والی ہے۔(2)","arabic":"ذَٰلِكَ ٱلۡكِتَٰبُ لَا رَيۡبَۛ فِيهِۛ هُدٗى لِّلۡمُتَّقِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":9,"juzNumber":1,"footnotes":"(1) اس کے منزل من اللہ ہونے میں کوئی شبہ نہیں جیسا کہ دوسرے مقام پر ہے: «تَنزِيلُ ٱلۡكِتَٰبِ لَا رَيۡبَ فِيهِ مِن رَّبِّ ٱلۡعَٰلَمِينَ» (السجدة: 2) بعض علما نے کہا ہے کہ یہ خبر بمعنی نہی ہے۔ أَيْ :لا تَرْتَابُوا فِيهِ (اس میں شک نہ کرو)۔ علاوہ ازیں اس میں جو واقعات بیان کئے گئے ہیں، ان کی صداقت میں، جو احکام ومسائل بیان کئے گئے ہیں، ان سے انسانیت کی فلاح ونجات وابستہ ہونے میں اور جو عقائد (توحید ورسالت اور معاد کے بارے میں) بیان کئے گئے ہیں، ان کے برحق ہونے میں کوئی شک نہیں۔\n(2) ویسے تو یہ کتاب الٰہی تمام انسانوں کی ہدایت و رہنمائی کے لئے نازل ہوئی ہے، لیکن اس چشمۂ فیض سے سیراب صرف وہی لوگ ہوں گے، جو آب حیات کے متلاشی اور خوف الٰہی سے سرشار ہوں گے۔ جن کے دل میں مرنے کے بعد اللہ کی بارگاہ میں کھڑے ہوکر جواب دہی کا احساس اور اس کی فکر ہی نہیں، جن کے اندر ہدایت کی طلب، یا گمراہی سے بچنے کا جذبہ ہی نہیں ہوگا تو انھیں ہدایت کہاں سے اور کیوں کر حاصل ہوسکتی ہے؟","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"dhālika al-kitābu lā rayba fīhi hudan lil'muttaqīna ","translations":["That","(is) the book","no","doubt","in it","a Guidance","for the God-conscious","(2)"],"transliterationArr":["dhālika","al-kitābu","lā","rayba","fīhi","hudan","lil'muttaqīna",null],"verseTiming":[[1,0,900],[2,900,1800],[3,1800,2180],[4,2180,2750],[5,2750,5010],[6,5010,5310],[7,5310,8905]]}}