{"name":"2:207","price":"اور بعض لوگ وه بھی ہیں کہ اللہ تعالیٰ کی رضامندی کی طلب میں اپنی جان تک بیچ ڈالتے ہیں (1) اور اللہ تعالیٰ اپنے بندوں پر بڑی مہربانی کرنے واﻻ ہے۔","arabic":"وَمِنَ ٱلنَّاسِ مَن يَشۡرِي نَفۡسَهُ ٱبۡتِغَآءَ مَرۡضَاتِ ٱللَّهِۚ وَٱللَّهُ رَءُوفُۢ بِٱلۡعِبَادِ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":214,"juzNumber":2,"footnotes":"(1) یہ آیت، کہتے ہیں حضرت صہیب (رضي الله عنه) رومی کے بارے میں نازل ہوئی ہے کہ جب وہ ہجرت کرنے لگے تو کافروں نے کہا کہ یہ مال سب یہاں کا کمایا ہوا ہے، اسے ہم ساتھ نہیں لے جانے دیں گے، حضرت صہیب (رضي الله عنه) نے یہ سارا مال ان کے حوالے کردیا اور دین ساتھ لے کر حضور جکی خدمت میں حاضر ہوگئے۔ آپ (صلى الله عليه وسلم) نے سن کر فرمایا: ”صہیب نے نفع بخش تجارت کی ہے“ دو مرتبہ فرمایا (فتح القدیر) لیکن یہ آیت بھی عام ہے، جو تمام مومنین متقین اور دنیا کے مقابلے میں دین کو اور آخرت کو ترجیح دینے والوں کو شامل ہے، کیوں کہ اس قسم کی تمام آیات کے بارے میں، جو کسی خاص شخص یا واقعہ کے بارے میں نازل ہوئیں یہ اصول ہے: ”الْعِبْرَةُ بِعُمُومِ اللَّفْظِ لا بِخُصُوصِ السَّبَبِ“ یعنی لفظ کے عموم کا اعتبار ہوگا، سبب نزول کے خصوص کا اعتبار نہیں کیا جائے گا۔ پس اخنس بن شریق (جس کا ذکر پچھلی آیت میں ہوا) برے کردار کا ایک نمونہ ہے جو ہر اس شخص پر صادق آئے گا جو اس جیسے برے کردار کا حامل ہوگا اور صہیب (رضي الله عنه) خیر اور کمال ایمان کی ایک مثال ہیں ہر اس شخص کے لئے جو ان صفات خیر وکمال سے متصف ہوگا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wamina al-nāsi man yashrī nafsahu ib'tighāa marḍāti al-lahi wal-lahu raūfun bil-ʿibādi ","translations":["And of","the people","(is the one) who","sells","his own self","seeking","pleasure","(of) Allah","And Allah","(is) full of Kindness","to His servants","(207)"],"transliterationArr":["wamina","al-nāsi","man","yashrī","nafsahu","ib'tighāa","marḍāti","al-lahi","wal-lahu","raūfun","bil-ʿibādi",null],"verseTiming":[[1,0,490],[2,490,1710],[3,1710,1930],[4,1930,3230],[5,3230,3950],[6,3950,6470],[7,6470,7480],[8,7480,9570],[9,9570,10550],[10,10550,12040],[11,12040,14495]]}}