{"name":"2:208","price":"ایمان والو! اسلام میں پورے پورے داخل ہوجاؤ اور شیطان کے قدموں کی تابعداری نہ کرو(1) وه تمہارا کھلا دشمن ہے۔","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱدۡخُلُواْ فِي ٱلسِّلۡمِ كَآفَّةٗ وَلَا تَتَّبِعُواْ خُطُوَٰتِ ٱلشَّيۡطَٰنِۚ إِنَّهُۥ لَكُمۡ عَدُوّٞ مُّبِينٞ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":215,"juzNumber":2,"footnotes":"(1) اہل ایمان کو کہا جا رہا ہے کہ اسلام میں پورے کے پورے داخل ہوجاؤ۔ اس طرح نہ کرو کہ جو باتیں تمہاری مصلحتوں اور خواہشات کے مطابق ہوں، ان پر تو عمل کرلو اور دوسرے حکموں کو نظر انداز کردو۔ اسی طرح جو دین تم چھوڑ آئے ہو، اس کی باتیں اسلام میں شامل کرنے کی کوشش مت کرو، بلکہ صرف اسلام کو مکمل طور پر اپناؤ۔ اس سے دین میں بدعات کی بھی نفی کردی گئی اور آج کل کے سیکولر ذہن کی تردید بھی، جو اسلام کو مکمل طور پر اپنانے کے لئے تیار نہیں، بلکہ دین کو عبادات، یعنی مساجد تک محدود کرنا، اور سیاست اور ایوان حکومت سے دیس کو نکالا دینا چاہتا ہے۔ اسی طرح عوام کو بھی سمجھایا جارہا ہے جو رسوم ورواج اور علاقائی ثقافت وروایات کو پسند کرتے ہیں اور انہیں چھوڑنے کے لئے آمادہ نہیں ہوئے، جیسے مرگ اور شادی بیاہ کی مسرفانہ اور ہندوانہ رسوم اور دیگر رواج۔ اور یہ کہا جا رہا ہےکہ شیطان کے قدموں کی پیروی مت کرو، جو تمہیں مذکورہ خلاف اسلام باتوں کے لئے حسین فلسفے تراش کر پیش کرتا، برائیوں پر خوش نما غلاف چڑھاتا اور بدعات کو بھی نیکی باور کراتا ہے، تاکہ اس کے دام ہم رنگ زمین میں پھنسے رہو۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāayyuhā alladhīna āmanū ud'khulū fī al-sil'mi kāffatan walā tattabiʿū khuṭuwāti al-shayṭāni innahu lakum ʿaduwwun mubīnun ","translations":["O you","who","believe[d]","Enter","in","Islam","completely","and (do) not","follow","footsteps","(of) the Shaitaan","Indeed, he","(is) for you","an enemy","open","(208)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","ud'khulū","fī","al-sil'mi","kāffatan","walā","tattabiʿū","khuṭuwāti","al-shayṭāni","innahu","lakum","ʿaduwwun","mubīnun",null],"verseTiming":[[1,0,2490],[2,2490,3380],[3,3380,4120],[4,4120,4840],[5,4840,5040],[6,5040,5780],[7,5780,9689],[8,9689,10149],[9,10149,11159],[10,11159,12169],[11,12169,14619],[12,14619,16569],[13,16569,17149],[14,17149,17949],[15,17949,21244]]}}