{"name":"2:20","price":"قریب ہے کہ بجلی ان کی آنکھیں اُچک لے جائے، جب ان کے لئے روشنی کرتی ہے تو اس میں چلتے پھرتے ہیں اور جب ان پر اندھیرا کرتی ہے تو کھڑے ہوجاتے ہیں(1) اور اگر اللہ تعالیٰ چاہے تو ان کے کانوں اور آنکھوں کو بیکار کردے(2)۔ یقیناً اللہ تعالیٰ ہر چیز پر قدرت رکھنے واﻻ ہے","arabic":"يَكَادُ ٱلۡبَرۡقُ يَخۡطَفُ أَبۡصَٰرَهُمۡۖ كُلَّمَآ أَضَآءَ لَهُم مَّشَوۡاْ فِيهِ وَإِذَآ أَظۡلَمَ عَلَيۡهِمۡ قَامُواْۚ وَلَوۡ شَآءَ ٱللَّهُ لَذَهَبَ بِسَمۡعِهِمۡ وَأَبۡصَٰرِهِمۡۚ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":27,"juzNumber":1,"footnotes":"(1) یہ منافقین کے ایک دوسرے گروہ کا ذکر ہے جس پر کبھی حق واضح ہوتا ہے اور کبھی اس کی بابت وہ ریب وشک میں مبتلا ہوجاتے ہیں۔ پس ان کے دل ریب وتردد میں اس بارش کی طرح ہیں جو اندھیروں (شکوک، کفر اور نفاق) میں اترتی ہے، گرج چمک سے ان کے دل ڈر ڈر جاتے ہیں، حتیٰ کہ خوف کے مارے اپنی انگلیاں اپنے کانوں میں ٹھونس لیتے ہیں۔ لیکن یہ تدبیریں اور یہ خوف ودہشت انہیں اللہ کی گرفت سے نہیں بچا سکے گا، کیوں کہ وہ اللہ کے گھیرے سے نہیں نکل سکتے۔ کبھی حق کی کرنیں ان پر پڑتی ہیں تو حق کی طرف جھک پڑتے ہیں، لیکن پھر جب اسلام یا مسلمانوں پر مشکلات کا دور آتا ہے تو پھر حیران وسرگردان کھڑے ہوجاتے ہیں۔ (ابن کثیر) منافقین کا یہ گروہ آخر وقت تک تذبذب اور گومگو کا شکار اور قبول حق (اسلام) سے محروم رہتا ہے۔\n(2) اس میں اس امر کی تنبیہ ہے کہ اگر اللہ تعالیٰ چاہے تو وہ اپنی دی ہوئی صلاحیتوں کو سلب کرلے۔ اس لئے انسانوں کو اللہ تعالیٰ کی اطاعت سے گریزاں اور اس کے عذاب اور مواخذے سے کبھی بےخوف نہیں ہونا چاہیے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yakādu al-barqu yakhṭafu abṣārahum kullamā aḍāa lahum mashaw fīhi wa-idhā aẓlama ʿalayhim qāmū walaw shāa al-lahu ladhahaba bisamʿihim wa-abṣārihim inna al-laha ʿalā kulli shayin qadīrun ","translations":["Almost","the lightning","snatches away","their sight","Whenever","it flashes","for them","they walk","in it","and when","it darkens","on them","they stand (still)","And if","had willed","Allah","He would certainly have taken away","their hearing","and their sight","Indeed","Allah","(is) on","every","thing","All-Powerful","(20)"],"transliterationArr":["yakādu","al-barqu","yakhṭafu","abṣārahum","kullamā","aḍāa","lahum","mashaw","fīhi","wa-idhā","aẓlama","ʿalayhim","qāmū","walaw","shāa","al-lahu","ladhahaba","bisamʿihim","wa-abṣārihim","inna","al-laha","ʿalā","kulli","shayin","qadīrun",null],"verseTiming":[[1,0,920],[2,920,1640],[3,1640,2400],[4,2400,4140],[5,4140,6370],[6,6370,8590],[7,8590,9110],[8,9110,10280],[9,10280,10920],[10,10920,13030],[11,13030,13750],[12,13750,14710],[13,14710,15570],[14,15570,16470],[15,16470,18340],[16,18340,19180],[17,19180,19880],[18,19880,21140],[19,21140,23000],[20,23000,24110],[21,24110,24940],[22,24940,25560],[23,25560,26200],[24,26200,28050],[25,28050,30375]]}}