{"name":"2:217","price":"لوگ آپ سے حرمت والے مہینوں میں لڑائی کی بابت سوال کرتے ہیں، آپ کہہ دیجیئے کہ ان میں لڑائی کرنا بڑا گناه ہے، لیکن اللہ کی راه سے روکنا، اس کے ساتھ کفر کرنا اور مسجد حرام سے روکنا اور وہاں کے رہنے والوں کو وہاں سے نکالنا، اللہ کے نزدیک اس سے بھی بڑا گناه ہے یہ فتنہ قتل سے بھی بڑا گناه ہے(1) ، یہ لوگ تم سے لڑائی بھڑائی کرتے ہی رہیں گے یہاں تک کہ اگر ان سے ہوسکے تو تمہیں تمہارے دین سے مرتد کردیں(2) اور تم میں سے جو لوگ اپنے دین سے پلٹ جائیں اور اسی کفر کی حالت میں مریں، ان کے اعمال دنیوی اور اخروی سب غارت ہوجائیں گے۔ یہ لوگ جہنمی ہوں گے اور ہمیشہ ہمیشہ جہنم میں ہی رہیں گے۔(3)","arabic":"يَسۡـَٔلُونَكَ عَنِ ٱلشَّهۡرِ ٱلۡحَرَامِ قِتَالٖ فِيهِۖ قُلۡ قِتَالٞ فِيهِ كَبِيرٞۚ وَصَدٌّ عَن سَبِيلِ ٱللَّهِ وَكُفۡرُۢ بِهِۦ وَٱلۡمَسۡجِدِ ٱلۡحَرَامِ وَإِخۡرَاجُ أَهۡلِهِۦ مِنۡهُ أَكۡبَرُ عِندَ ٱللَّهِۚ وَٱلۡفِتۡنَةُ أَكۡبَرُ مِنَ ٱلۡقَتۡلِۗ وَلَا يَزَالُونَ يُقَٰتِلُونَكُمۡ حَتَّىٰ يَرُدُّوكُمۡ عَن دِينِكُمۡ إِنِ ٱسۡتَطَٰعُواْۚ وَمَن يَرۡتَدِدۡ مِنكُمۡ عَن دِينِهِۦ فَيَمُتۡ وَهُوَ كَافِرٞ فَأُوْلَٰٓئِكَ حَبِطَتۡ أَعۡمَٰلُهُمۡ فِي ٱلدُّنۡيَا وَٱلۡأٓخِرَةِۖ وَأُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلنَّارِۖ هُمۡ فِيهَا خَٰلِدُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":224,"juzNumber":2,"footnotes":"(1) رجب، ذوالقعدہ، ذوالحجہ اور محرم۔ یہ چار مہینے زمانۂ جاہلیت میں بھی حرمت والے سمجھے جاتے تھے، جن میں قتال وجدال ناپسندیدہ تھا۔ اسلام نے بھی ان کی حرمت کو برقرار رکھا۔ نبی (صلى الله عليه وسلم) کے زمانے میں ایک مسلمان فوجی دستے کے ہاتھوں رجب کے مہینے میں ایک کافر قتل ہوگیا اور بعض کافر قیدی بنا لئے گئے۔ مسلمانوں کے علم میں یہ نہیں تھا کہ رجب شروع ہوگیا ہے۔ کفار نے مسلمانوں کو طعنہ دیا کہ دیکھو یہ حرمت والے مہینے کی حرمت کا بھی خیال نہیں رکھتے، جس پر یہ آیت نازل ہوئی اور کہا گیا کہ یقیناً حرمت والے مہینے میں قتال بڑا گناہ ہے، لیکن حرمت کی دہائی دینے والوں کو اپنا عمل نظر نہیں آتا؟ یہ خود اس سے بھی بڑے جرائم کے مرتکب ہیں یہ اللہ کے راستے سے اور مسجد حرام سے لوگوں کو روکتے ہیں اور وہاں سے مسلمانوں کو نکلنے پر انہوں نے مجبور کردیا۔ علاوہ ازیں کفر وشرک بجائے خود قتل سے بھی بڑا گناہ ہے۔ اس لئے اگر مسلمانوں سے غلطی سے ایک آدھ قتل حرمت والے مہینے میں ہوگیا تو کیا ہوا؟ اس پر واویلا کرنے کے بجائے ان کو اپنا نامۂ سیاہ بھی تو دیکھ لینا چاہیے۔\n(2) جب یہ اپنی شرارتوں، سازشوں اور تمہیں مرتد بنانے کی کوششوں سے باز آنے والے نہیں تو پھر تم ان سے مقابلہ کرنے میں شہر حرام کی وجہ سے کیوں رکے رہو؟\n(3) جو دین اسلام سے پھر جائے، یعنی مرتد ہوجائے (اگر وہ توبہ نہ کرے) تو اس کی دنیوی سزا قتل ہے۔ حدیث میں ہے :«مَنْ بَدَّلَ دِينَهُ فَاقْتُلُوهُ» (صحيح بخاري ، كتاب الجهاد، باب لا يعذب بعذاب الله) آیت میں اس کی اخروی سزا بیان کی جارہی ہے۔ جس سے معلوم ہوا کہ ایمان کی حالت میں کئے گئے اعمال صالحہ بھی کفر ارتداد کی وجہ سے کالعدم ہوجائیں گے اور جس طرح ایمان قبول کرنے سے انسان کے پچھلے گناہ معاف ہوجاتے ہیں، اسی طرح کفر ارتداد سے تمام نیکیاں برباد ہوجاتی ہیں۔ تاہم قرآن کے الفاظ سے واضح ہے کہ حبط اعمال اسی وقت ہوگا جب خاتمہ کفر پر ہوگا، اگر موت سے پہلے تائب ہوجائے گا تو ایسا نہیں ہوگا، یعنی مرتد کی توبہ مقبول ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yasalūnaka ʿani al-shahri al-ḥarāmi qitālin fīhi qul qitālun fīhi kabīrun waṣaddun ʿan sabīli al-lahi wakuf'run bihi wal-masjidi al-ḥarāmi wa-ikh'rāju ahlihi min'hu akbaru ʿinda al-lahi wal-fit'natu akbaru mina al-qatli walā yazālūna yuqātilūnakum ḥattā yaruddūkum ʿan dīnikum ini is'taṭāʿū waman yartadid minkum ʿan dīnihi fayamut wahuwa kāfirun fa-ulāika ḥabiṭat aʿmāluhum fī al-dun'yā wal-ākhirati wa-ulāika aṣḥābu al-nāri hum fīhā khālidūna ","translations":["They ask you","about","the month","[the] sacred ","(concerning) fighting","in it","Say","Fighting","therein","(is) a great (sin)","but hindering (people)","from","(the) way","(of) Allah","and disbelief","in Him","and (preventing access to) Al-Masjid","Al-Haraam","and driving out","its people","from it","(is) greater (sin)","near","Allah","And [the] oppression","(is) greater","than","[the] killing","And not","they will cease","(to) fight with you","until","they turn you away","from","your religion","if","they are able","And whoever","turns away","among you","from","his religion","then dies","while he","(is) a disbeliever","for those","became worthless","their deeds","in","the world","and the Hereafter","And those","(are) companions","(of) the Fire","they","in it","(will) abide forever","(217)"],"transliterationArr":["yasalūnaka","ʿani","al-shahri","al-ḥarāmi","qitālin","fīhi","qul","qitālun","fīhi","kabīrun","waṣaddun","ʿan","sabīli","al-lahi","wakuf'run","bihi","wal-masjidi","al-ḥarāmi","wa-ikh'rāju","ahlihi","min'hu","akbaru","ʿinda","al-lahi","wal-fit'natu","akbaru","mina","al-qatli","walā","yazālūna","yuqātilūnakum","ḥattā","yaruddūkum","ʿan","dīnikum","ini","is'taṭāʿū","waman","yartadid","minkum","ʿan","dīnihi","fayamut","wahuwa","kāfirun","fa-ulāika","ḥabiṭat","aʿmāluhum","fī","al-dun'yā","wal-ākhirati","wa-ulāika","aṣḥābu","al-nāri","hum","fīhā","khālidūna",null],"verseTiming":[[1,0,1390],[2,1390,1700],[3,1700,2430],[4,2430,3370],[5,3370,5040],[6,5040,7190],[7,7190,7490],[8,7490,8710],[9,8710,9540],[10,9540,11780],[11,11780,12710],[12,12710,13540],[13,13540,14530],[14,14530,15060],[15,15060,16480],[16,16480,17050],[17,17050,18160],[18,18160,19060],[19,19060,20110],[20,20110,21020],[21,21020,21570],[22,21570,22270],[23,22270,23300],[24,23300,25570],[25,25570,26690],[26,26690,27390],[27,27390,27690],[28,27690,28380],[29,28380,29300],[30,29300,30370],[31,30370,32050],[32,32050,32760],[33,32760,34050],[34,34050,35110],[35,35110,36110],[36,36110,36430],[37,36430,37610],[38,37610,38470],[39,38470,39180],[40,39180,40030],[41,40030,41120],[42,41120,42140],[43,42140,43030],[44,43030,43810],[45,43810,44270],[46,44270,45850],[47,45850,48500],[48,48500,51110],[49,51110,51880],[50,51880,53070],[51,53070,53300],[52,53300,54240],[53,54240,55940],[54,55940,58430],[55,58430,59280],[56,59280,60700],[57,60700,61070],[58,61070,61780],[59,61780,64025]]}}