{"name":"2:214","price":"کیا تم یہ گمان کئے بیٹھے ہو کہ جنت میں چلے جاؤ گے، حاﻻنکہ اب تک تم پر وه حاﻻت نہیں آئے جو تم سے اگلے لوگوں پر آئے تھے(1) ۔ انہیں بیماریاں اور مصیبتیں پہنچیں اور وہ یہاں تک جھنجھوڑے گئے کہ رسول اور اس کے ساتھ کے ایمان والے کہنے لگے کہ اللہ کی مدد کب آئے گی؟ سن رکھو کہ اللہ کی مدد قریب ہی ہے۔(2)","arabic":"أَمۡ حَسِبۡتُمۡ أَن تَدۡخُلُواْ ٱلۡجَنَّةَ وَلَمَّا يَأۡتِكُم مَّثَلُ ٱلَّذِينَ خَلَوۡاْ مِن قَبۡلِكُمۖ مَّسَّتۡهُمُ ٱلۡبَأۡسَآءُ وَٱلضَّرَّآءُ وَزُلۡزِلُواْ حَتَّىٰ يَقُولَ ٱلرَّسُولُ وَٱلَّذِينَ ءَامَنُواْ مَعَهُۥ مَتَىٰ نَصۡرُ ٱللَّهِۗ أَلَآ إِنَّ نَصۡرَ ٱللَّهِ قَرِيبٞ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":221,"juzNumber":2,"footnotes":"(1) ہجرت مدینہ کے بعد جب مسلمانوں کو یہودیوں، منافقوں اور مشرکین عرب سے مختلف قسم کی ایذائیں اور تکلیفیں پہنچیں تو بعض مسلمانوں نے نبی (صلى الله عليه وسلم) سے شکایت کی، جس پر مسلمانوں کی تسلی کے لئے یہ آیت بھی نازل ہوئی اور خود نبی (صلى الله عليه وسلم) نے فرمایا «تم سے پہلے لوگوں کو ان کے سر سے لے کر پیروں تک آرے سے چیرا گیا اور لوہے کی کنگھی سے ان کے گوشت پوست کو نوچا گیا، لیکن یہ ظلم وتشدد ان کو ان کی دین سے نہیں پھیر سکا»، پھر فرمایا: «اللہ کی قسم، اللہ تعالیٰ اس معاملے کو مکمل (یعنی اسلام کو غالب) فرمائے گا۔ یہاں تک کہ ایک سوار صنعاء سے حضرموت تک تنہا سفر کرے گا اور اسے اللہ کے سوا کسی کا ڈر نہ ہوگا»۔ الحدیث (صحيح بخاري، كتاب الإكراه، باب من اختار الضرب والقتل والهوان على الكفر) مقصد نبی (صلى الله عليه وسلم) کا مسلمانوں کے اندر حوصلہ اور استقامت کا عزم پیدا کرنا تھا۔\n(2) اس لئے «كُلُّ مَا هُوَ آتٍ فَهَوَ قَرِيبٌ»۔ ”ہر آنے والی چیز، قریب ہے“ اور اہل ایمان کے لئے اللہ کی مدد یقینی ہے، اس لئے وہ قریب ہی ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"am ḥasib'tum an tadkhulū al-janata walammā yatikum mathalu alladhīna khalaw min qablikum massathumu al-basāu wal-ḍarāu wazul'zilū ḥattā yaqūla al-rasūlu wa-alladhīna āmanū maʿahu matā naṣru al-lahi alā inna naṣra al-lahi qarībun ","translations":["Or","(do) you think","that","you will enter","Paradise","while not","(has) come to you","like (came to)","those who","passed away","from","before you","Touched them","[the] adversity","and [the] hardship","and they were shaken","until","said","the Messenger","and those who","believed","with him","When","[will] (the) help","(of) Allah (come)","Unquestionably","[Indeed]","help","(of) Allah","(is) near","(214)"],"transliterationArr":["am","ḥasib'tum","an","tadkhulū","al-janata","walammā","yatikum","mathalu","alladhīna","khalaw","min","qablikum","massathumu","al-basāu","wal-ḍarāu","wazul'zilū","ḥattā","yaqūla","al-rasūlu","wa-alladhīna","āmanū","maʿahu","matā","naṣru","al-lahi","alā","inna","naṣra","al-lahi","qarībun",null],"verseTiming":[[1,0,430],[2,430,1390],[3,1390,2240],[4,2240,3000],[5,3000,4470],[6,4470,5810],[7,5810,6660],[8,6660,7800],[9,7800,8700],[10,8700,9240],[11,9240,10150],[12,10150,11050],[13,11050,15040],[14,15040,17610],[15,17610,18670],[16,18670,19440],[17,19440,20180],[18,20180,21190],[19,21190,22180],[20,22180,23190],[21,23190,23890],[22,23890,24480],[23,24480,24980],[24,24980,27200],[25,27200,29230],[26,29230,30310],[27,30310,30860],[28,30860,31620],[29,31620,33575]]}}