{"name":"2:215","price":"آپ سے پوچھتے ہیں کہ وه کیا خرچ کریں؟ آپ کہہ دیجیئے جو مال تم خرچ کرو وه ماں باپ کے لئے ہے اور رشتہداروں اور یتیموں اور مسکینوں اور مسافروں کے لئے ہے(1) اور تم جو کچھ بھلائی کرو گے اللہ تعالیٰ کو اس کا علم ہے۔","arabic":"يَسۡـَٔلُونَكَ مَاذَا يُنفِقُونَۖ قُلۡ مَآ أَنفَقۡتُم مِّنۡ خَيۡرٖ فَلِلۡوَٰلِدَيۡنِ وَٱلۡأَقۡرَبِينَ وَٱلۡيَتَٰمَىٰ وَٱلۡمَسَٰكِينِ وَٱبۡنِ ٱلسَّبِيلِۗ وَمَا تَفۡعَلُواْ مِنۡ خَيۡرٖ فَإِنَّ ٱللَّهَ بِهِۦ عَلِيمٞ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":222,"juzNumber":2,"footnotes":"(1) بعض صحابہ (رضي الله عنهم) کے استفسار پر مال خرچ کرنے کے اولین مصارف بیان کئے جا رہے ہیں، یعنی یہ سب سے زیادہ تمہارے مالی تعاون کے مستحق ہیں۔ اس سے معلوم ہوا کہ انفاق کایہ حکم صدقات نافلہ سے متعلق ہے، زکٰوۃ سے متعلق نہیں۔ کیوں کہ ماں باپ پر زکٰوۃ کی رقم خرچ کرنی جائز نہیں ہے۔ حضرت میمون بن مہران نے اس آیت کی تلاوت کرکے فرمایا ”مال خرچ کرنے کی ان جگہوں میں نہ طبلہ سارنگی کا ذکر ہے اور نہ چوبی تصویروں اور دیواروں پر لٹکائے جانے والے آرائشی پردوں کا“ مطلب یہ ہے کہ ان چیزوں پر مال خرچ کرنا ناپسندیدہ اور اسراف ہے۔ افسوس ہے کہ آج یہ مسرفانہ اور ناپسندیدہ اخراجات ہماری زندگی کا اس طرح لازمی حصہ بن گئے ہیں کہ اس میں کراہیت کا کوئی پہلو ہی ہماری نظروں میں نہیں رہا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yasalūnaka mādhā yunfiqūna qul mā anfaqtum min khayrin falil'wālidayni wal-aqrabīna wal-yatāmā wal-masākīni wa-ib'ni al-sabīli wamā tafʿalū min khayrin fa-inna al-laha bihi ʿalīmun ","translations":["They ask you","what","they (should) spend","Say","Whatever","you spend","of","good","(is) for parents","and the relatives","and the orphans","and the needy","and (of)","the wayfarer","And whatever","you do","of","good","So indeed","Allah","of it","(is) All-Aware","(215)"],"transliterationArr":["yasalūnaka","mādhā","yunfiqūna","qul","mā","anfaqtum","min","khayrin","falil'wālidayni","wal-aqrabīna","wal-yatāmā","wal-masākīni","wa-ib'ni","al-sabīli","wamā","tafʿalū","min","khayrin","fa-inna","al-laha","bihi","ʿalīmun",null],"verseTiming":[[1,0,1340],[2,1340,2050],[3,2050,5040],[4,5040,5370],[5,5370,7160],[6,7160,8680],[7,8680,9630],[8,9630,10890],[9,10890,12500],[10,12500,13980],[11,13980,15330],[12,15330,16790],[13,16790,17350],[14,17350,19680],[15,19680,20190],[16,20190,21110],[17,21110,21400],[18,21400,22160],[19,22160,24030],[20,24030,24840],[21,24840,25430],[22,25430,27265]]}}