{"name":"2:226","price":"جو لوگ اپنی بیویوں سے (تعلق نہ رکھنے کی) قسمیں کھائیں، ان کے لئے چار مہینے کی مدت(1) ہے، پھر اگر وه لوٹ آئیں تو اللہ تعالیٰ بھی بخشنے واﻻ مہربان ہے۔","arabic":"لِّلَّذِينَ يُؤۡلُونَ مِن نِّسَآئِهِمۡ تَرَبُّصُ أَرۡبَعَةِ أَشۡهُرٖۖ فَإِن فَآءُو فَإِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":233,"juzNumber":2,"footnotes":"(1) إِيلاءٌ کے معنی قسم کھانے کے ہیں، یعنی کوئی شوہر اگر قسم کھا لے کہ اپنی بیوی سے ایک مہینے یا دو مہینے (مثلاً) تعلق نہیں رکھوں گا، پھر قسم کی مدت پوری کرکے تعلق قائم کرلیتا ہے تو کوئی کفارہ نہیں، ہاں اگر مدت پوری ہونے سے قبل تعلق قائم کرے گا تو کفارۂ قسم ادا کرنا ہوگا۔ اور اگر چار مہینے سے زیادہ مدت کے لئے یا مدت کی تعیین کے بغیر قسم کھاتا ہے تو اس آیت میں ایسے لوگوں کے لئے مدت کا تعین کردیا گیا ہے کہ وہ چار مہینے گزرنے کے بعد یا تو بیوی سے تعلق قائم کرلیں، یا پھر اسے طلاق دے دیں (اسے چار مہینے سے زیادہ معلق رکھنے کی اجازت نہیں ہے) پہلی صورت میں اسے کفارۂ قسم ادا کرنا ہوگا اور اگر دونوں میں سے کوئی صورت اختیار نہیں کرے گا تو عدالت اس کو دونوں میں سے کسی ایک بات کے اختیار کرنے پر مجبور کرے گی کہ وہ اس سے تعلق قائم کرے، یا طلاق دے، تاکہ عورت پر ظلم نہ ہو۔ (تفسیر ابن کثیر )","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"lilladhīna yu'lūna min nisāihim tarabbuṣu arbaʿati ashhurin fa-in fāū fa-inna al-laha ghafūrun raḥīmun ","translations":["For those who","swear (off)","from","their wives","(is a) waiting (of)","four","months","then if","they return ","then indeed","Allah","(is) Oft-Forgiving","Most Merciful","(226)"],"transliterationArr":["lilladhīna","yu'lūna","min","nisāihim","tarabbuṣu","arbaʿati","ashhurin","fa-in","fāū","fa-inna","al-laha","ghafūrun","raḥīmun",null],"verseTiming":[[1,0,1080],[2,1080,2080],[3,2080,2310],[4,2310,5440],[5,5440,6410],[6,6410,7350],[7,7350,7970],[8,7970,9350],[9,9350,10660],[10,10660,11940],[11,11940,13000],[12,13000,13850],[13,13850,14560],[14,14560,17045]]}}