{"name":"2:222","price":"آپ سے حیض کے بارے میں سوال کرتے ہیں، کہہ دیجیئے کہ وه گندگی ہے، حالت حیض میں عورتوں سے الگ رہو(1) اور جب تک وه پاک نہ ہوجائیں ان کے قریب نہ جاؤ، ہاں جب وه پاک ہوجائیں(2) تو ان کے پاس جاؤ جہاں سے اللہ نے تمہیں اجازت دی(3) ہے، اللہ توبہ کرنے والوں کو اور پاک رہنے والوں کو پسند فرماتا ہے۔","arabic":"وَيَسۡـَٔلُونَكَ عَنِ ٱلۡمَحِيضِۖ قُلۡ هُوَ أَذٗى فَٱعۡتَزِلُواْ ٱلنِّسَآءَ فِي ٱلۡمَحِيضِ وَلَا تَقۡرَبُوهُنَّ حَتَّىٰ يَطۡهُرۡنَۖ فَإِذَا تَطَهَّرۡنَ فَأۡتُوهُنَّ مِنۡ حَيۡثُ أَمَرَكُمُ ٱللَّهُۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلتَّوَّٰبِينَ وَيُحِبُّ ٱلۡمُتَطَهِّرِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":229,"juzNumber":2,"footnotes":"(1) بلوغت کے بعد ہر عورت کو ایام ماہواری میں جو خون آتا ہے، اسے حیض کہا جاتا ہے اور بعض دفعہ عادت کے خلاف بیماری کی وجہ سے خون آتا ہے، اسے استحاضہ کہتے ہیں، جس کا حکم حیض سے مختلف ہے۔ حیض کے ایام میں عورت سے نماز معاف ہے اور روزے رکھنا ممنوع ہیں، تاہم روزوں کی قضا بعد میں ضروری ہے۔ مرد کے لئے صرف ہم بستری منع ہے، البتہ بوس وکنار جائز ہے۔ اسی طرح عورت ان دنوں میں کھانا پکانا اور دیگر گھر کا ہر کام کرسکتی ہے، لیکن یہودیوں میں ان دنوں میں عورت کو بالکل نجس سمجھا جاتا تھا، وہ اس کے ساتھ اختلاط اور کھانا پینا بھی جائز نہیں سمجھتے تھے۔ صحابہ کرام (رضي الله عنهم) نے اس کی بابت حضور (صلى الله عليه وسلم) سے پوچھا تو یہ آیت اتری، جس میں صرف جماع کرنے سے روکا گیا۔ علیحدہ رہنے اور قریب نہ جانے کا مطلب صرف جماع سے ممانعت ہے۔ (ابن کثیر وغیرہ )\n(2) جب وہ پاک ہوجائیں۔ اس کے دو معنی بیان کئے گئے ہیں ”ایک خون بند ہوجائے“ یعنی پھر غسل کیے بغیر بھی پاک ہیں، مرد کے لئے ان سے مباشرت کرنا جائز ہے۔ ابن حزم اور بعض ائمہ اس کے قائل ہیں۔ علامہ البانی نے بھی اس کی تائید کی ہے (آداب الزفاف ص 47) دوسرے معنی ہیں، خون بند ہونے کے بعد غسل کرکے پاک ہوجائیں۔ اس دوسرے معنی کے اعتبار سے عورت جب تک غسل نہ کرلے، اس سے مباشرت حرام رہے گی۔ امام شوکانی نے اس کو راجح قرار دیا ہے (فتح القدیر) ہمارے نزدیک دونوں مسلک قابل عمل ہیں، لیکن دوسرا قابل ترجیح۔\n(3) ”جہاں سے اجازت دی ہے“ یعنی شرمگاہ سے۔ کیوں کہ حالت حیض میں بھی اسی کے استعمال سے روکا گیا تھا اور اب پاک ہونے کے بعد جو اجازت دی جارہی ہے تو اس کا مطلب اسی (فرج، شرمگاہ) کی اجازت ہے، نہ کہ کسی اور حصے کی۔ اس سے یہ استدلال کیا گیا ہے کہ عورت کی دبر کا استعمال حرام ہے، جیسا کہ احادیث میں اس کی مزید صراحت کردی گئی ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wayasalūnaka ʿani al-maḥīḍi qul huwa adhan fa-iʿ'tazilū al-nisāa fī al-maḥīḍi walā taqrabūhunna ḥattā yaṭhur'na fa-idhā taṭahharna fatūhunna min ḥaythu amarakumu al-lahu inna al-laha yuḥibbu al-tawābīna wayuḥibbu al-mutaṭahirīna ","translations":["And they ask you","about","[the] menstruation","Say","It","(is) a hurt","so keep away (from)","[the] women","during","(their) [the] menstruation","And (do) not","approach them","until","they are cleansed","Then when","they are purified","then come to them","from","where","has ordered you","Allah","Indeed","Allah","loves","those who turn in repentance","and loves","those who purify themselves","(222)"],"transliterationArr":["wayasalūnaka","ʿani","al-maḥīḍi","qul","huwa","adhan","fa-iʿ'tazilū","al-nisāa","fī","al-maḥīḍi","walā","taqrabūhunna","ḥattā","yaṭhur'na","fa-idhā","taṭahharna","fatūhunna","min","ḥaythu","amarakumu","al-lahu","inna","al-laha","yuḥibbu","al-tawābīna","wayuḥibbu","al-mutaṭahirīna",null],"verseTiming":[[1,0,1510],[2,1510,1890],[3,1890,3970],[4,3970,4840],[5,4840,5160],[6,5160,6510],[7,6510,7370],[8,7370,9850],[9,9850,10060],[10,10060,12040],[11,12040,13130],[12,13130,15110],[13,15110,15880],[14,15880,17300],[15,17300,18010],[16,18010,19130],[17,19130,21030],[18,21030,21370],[19,21370,21960],[20,21960,22900],[21,22900,25150],[22,25150,26380],[23,26380,27180],[24,27180,27930],[25,27930,29450],[26,29450,30220],[27,30220,33445]]}}