{"name":"2:223","price":"تمہاری بیویاں تمہاری کھیتیاں ہیں، اپنی کھیتیوں میں جس طرح چاہو(1) آؤ اور اپنے لئے (نیک اعمال) آگے بھیجو اور اللہ تعالیٰ سے ڈرتے رہا کرو اور جان رکھو کہ تم اس سے ملنے والے ہو اور ایمان والوں کو خوش خبری سنا دیجیئے۔","arabic":"نِسَآؤُكُمۡ حَرۡثٞ لَّكُمۡ فَأۡتُواْ حَرۡثَكُمۡ أَنَّىٰ شِئۡتُمۡۖ وَقَدِّمُواْ لِأَنفُسِكُمۡۚ وَٱتَّقُواْ ٱللَّهَ وَٱعۡلَمُوٓاْ أَنَّكُم مُّلَٰقُوهُۗ وَبَشِّرِ ٱلۡمُؤۡمِنِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":230,"juzNumber":2,"footnotes":"(1) یہودیوں کا خیال تھا کہ اگر عورت کو پیٹ کے بل لٹا کر (مُدْبِرَةً) مباشرت کی جائے تو بچہ بھینگا پیدا ہوتا ہے۔ اس کی تردید مین کہا جارہا ہے کہ مباشرت آگے سے کرو (چت لٹا کر) یا پیچھے سے (پیٹ کے بل) یا کروٹ پر، جس طرح چاہو، جائز ہے، لیکن یہ ضروری ہے کہ ہر صورت میں عورت کی فرج ہی استعمال ہو۔ بعض لوگ اس سے یہ استدلال کرتے ہیں (جس طرح چاہو) میں تو دبر بھی آجاتی ہے، لہذا دبر کا استعمال بھی جائز ہے۔ لیکن یہ بالکل غلط ہے۔ جب قرآن نے عورت کو کھیتی قرار دیا ہے تو اس کا صاف مطلب یہ ہے کہ صرف کھیتی کے استعمال کے لئے یہ کہا جا رہا ہے کہ (اپنی کھیتوں میں جس طرح چاہو، آؤ) اور یہ کھیتی (موضع ولد) صرف فرج ہے نہ کہ دبر۔ بہرحال یہ غیرفطری فعل ہے ایسے شخص کو جو اپنی عورت کی دبر استعمال کرتا ہے ملعون قرار دیا گیا ہے (بحوالہ ابن کثیر و فتح القدیر )","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"nisāukum ḥarthun lakum fatū ḥarthakum annā shi'tum waqaddimū li-anfusikum wa-ittaqū al-laha wa-iʿ'lamū annakum mulāqūhu wabashiri al-mu'minīna ","translations":["Your wives","(are) a tilth","for you","so come","(to) your tilth","when","you wish","and send forth (good deeds)","for yourselves","And be conscious","(of) Allah","and know","that you","(will) meet Him","And give glad tidings","(to) the believers","(223)"],"transliterationArr":["nisāukum","ḥarthun","lakum","fatū","ḥarthakum","annā","shi'tum","waqaddimū","li-anfusikum","wa-ittaqū","al-laha","wa-iʿ'lamū","annakum","mulāqūhu","wabashiri","al-mu'minīna",null],"verseTiming":[[1,0,2820],[2,2820,3420],[3,3420,4210],[4,4210,4960],[5,4960,5920],[6,5920,7130],[7,7130,7960],[8,7960,9060],[9,9060,11560],[10,11560,12290],[11,12290,13060],[12,13060,15420],[13,15420,16800],[14,16800,20280],[15,20280,21240],[16,21240,24125]]}}