{"name":"2:232","price":"اور جب تم اپنی عورتوں کو طلاق دو اور وه اپنی عدت پوری کرلیں تو انہیں ان کے خاوندوں سے نکاح کرنے سے نہ روکو جب کہ وه آپس میں دستور کے مطابق رضامند ہوں(1) ۔ یہ نصیحت انہیں کی جاتی ہے جنہیں تم میں سے اللہ تعالیٰ پر اور قیامت کے دن پر یقین وایمان ہو، اس میں تمہاری بہترین صفائی اور پاکیزگی ہے۔ اللہ تعالیٰ جانتا ہے اور تم نہیں جانتے۔","arabic":"وَإِذَا طَلَّقۡتُمُ ٱلنِّسَآءَ فَبَلَغۡنَ أَجَلَهُنَّ فَلَا تَعۡضُلُوهُنَّ أَن يَنكِحۡنَ أَزۡوَٰجَهُنَّ إِذَا تَرَٰضَوۡاْ بَيۡنَهُم بِٱلۡمَعۡرُوفِۗ ذَٰلِكَ يُوعَظُ بِهِۦ مَن كَانَ مِنكُمۡ يُؤۡمِنُ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِۗ ذَٰلِكُمۡ أَزۡكَىٰ لَكُمۡ وَأَطۡهَرُۚ وَٱللَّهُ يَعۡلَمُ وَأَنتُمۡ لَا تَعۡلَمُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":239,"juzNumber":2,"footnotes":"- اس میں مطلقہ عورت کی بابت ایک تیسرا حکم دیا جا رہا ہے وہ یہ کہ عدت گزرنے کے بعد (پہلی یا دوسری طلاق کے بعد) اگر سابقہ خاوند بیوی باہمی رضامندی سے دوبارہ نکاح کرنا چاہیں تو تم ان کو مت روکو۔ نبی (صلى الله عليه وسلم) کے زمانے میں ایک ایسا واقعہ ہوا تو عورت کے بھائی نے انکار کردیا جس پر یہ آیت اتری (صحيح بخاري، كتاب النكاح ، باب لا نكاح إلا بولي) اس سے ایک تو یہ معلوم ہوا کہ عورت اپنا نکاح نہیں کرسکتی، بلکہ اس کے نکاح کے لئے ولی کی اجازت اور رضامندی ضروری ہے۔ تب ہی اللہ تعالیٰ نے ولیوں کو اپنا حق ولایت غلط طریقے سے استعمال کرنے سے روکا ہے۔ اس کی مزید تائید حدیث نبوی (صلى الله عليه وسلم) سے ہوتی ہے :«لا نِكَاحَ إلا بِوَلِيٍّ» «ولی کی اجازت سے بغیر نکاح نہیں»، (رواه الخمسة إلا النسائي إرواء الغليل (صلى الله عليه وسلم) ص۔ صححه الألباني) ایک اور روایت میں ہے۔ «أَيُّمَا امْرَأَةٍ نَكَحَتْ بِغَيْرِ إِذْنِ وَلِيِّهَا فَنِكَاحُهَا بَاطِلٌ فَنِكَاحُهَا بَاطِلٌ فَنِكَاحُهَا بَاطِلٌ»، (حواله مذكور وصححه أيضا الألباني) جس عورت نے ولی کی اجازت کے بغیر نکاح کرلیا، پس اس کا نکاح باطل ہے، اس کا نکاح باطل ہے، اس کا نکاح باطل ہے۔۔۔ (حوالہ مذکور) ان احادیث کو علامہ انور شاہ کشمیری نے بھی، دیگر محدثین کی طرح، صحیح اور احسن تسلیم کیا ہے۔ فیض الباری،ج کتاب النکاح) دوسری بات یہ معلوم ہوئی کہ عورت کے ولیوں کو بھی عورت پر جبر کرنے کی اجازت نہیں، بلکہ ان کے لئے ضروری ہے کہ وہ عورت کی رضامندی کو بھی ضرور ملحوظ رکھیں۔ اگر ولی عورت کی رضامندی کو نظرانداز کرکے زبردستی نکاح کردے، تو شریعت نے عورت کو بذریعہ عدالت نکاح فسخ کرانے کا اختیار دیا ہے۔ اس لئے ضروری ہے کہ نکاح میں دونوں کی رضامندی حاصل کی جائے، کوئی ایک فریق بھی من مانی نہ کرے۔ اگر عورت من مانے طریقے سے ولی کی اجازت نظرانداز کرے گی تو وہ نکاح ہی صحیح نہیں ہوگا اور ولی زبردستی کرے گا اور لڑکی کے مفادات کے مقابلے میں اپنے مفادات کو ترجیح دے گا تو عدالت ایسے ولی کو حق ولایت سے محروم کرکے ولی ابعد کے ذریعے سے یا خود ولی بن کر اس عورت کے نکاح کا فریضہ انجام دے گی۔ «فَإِنِ اشْتَجَرُوا فالسُلْطَانُ وَلِيُّ مَنْ لا وَلِيَّ لَهَا» (إرواء الغليل)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-idhā ṭallaqtumu al-nisāa fabalaghna ajalahunna falā taʿḍulūhunna an yankiḥ'na azwājahunna idhā tarāḍaw baynahum bil-maʿrūfi dhālika yūʿaẓu bihi man kāna minkum yu'minu bil-lahi wal-yawmi al-ākhiri dhālikum azkā lakum wa-aṭharu wal-lahu yaʿlamu wa-antum lā taʿlamūna ","translations":["And when","you divorce","[the] women","and they reached","their (waiting) term","then (do) not","hinder them","[that]","(from) marrying","their husbands","when","they agree","between themselves","in a fair manner","That","is admonished","with it","whoever","[is]","among you","believes","in Allah","and the Day","[the] Last","that","(is) more virtuous","for you","and more purer","And Allah","knows","and you","(do) not","know","(232)"],"transliterationArr":["wa-idhā","ṭallaqtumu","al-nisāa","fabalaghna","ajalahunna","falā","taʿḍulūhunna","an","yankiḥ'na","azwājahunna","idhā","tarāḍaw","baynahum","bil-maʿrūfi","dhālika","yūʿaẓu","bihi","man","kāna","minkum","yu'minu","bil-lahi","wal-yawmi","al-ākhiri","dhālikum","azkā","lakum","wa-aṭharu","wal-lahu","yaʿlamu","wa-antum","lā","taʿlamūna",null],"verseTiming":[[1,0,770],[2,770,1850],[3,1850,4790],[4,4790,5660],[5,5660,7130],[6,7130,7650],[7,7650,9610],[8,9610,9810],[9,9810,11780],[10,11780,13890],[11,13890,14430],[12,14430,15410],[13,15410,16290],[14,16290,17320],[15,17320,18840],[16,18840,20970],[17,20970,22120],[18,22120,22870],[19,22870,23380],[20,23380,24200],[21,24200,24660],[22,24660,25910],[23,25910,26580],[24,26580,27510],[25,27510,28440],[26,28440,29260],[27,29260,30630],[28,30630,31360],[29,31360,31950],[30,31950,33330],[31,33330,34180],[32,34180,35020],[33,35020,36400],[34,36400,36820],[35,36820,39665]]}}