{"name":"2:246","price":"کیا آپ نے (حضرت) موسیٰ کے بعد والی بنی اسرائیل کی جماعت کو نہیں دیکھا(1) جب کہ انہوں نے اپنے پیغمبر سے کہا کہ کسی کو ہمارا بادشاه بنا دیجیئے(2) تاکہ ہم اللہ کی راه میں جہاد کریں۔ پیغمبر نے کہا کہ ممکن ہے جہاد فرض ہوجانے کے بعد تم جہاد نہ کرو، انہوں نے کہا بھلا ہم اللہ کی راه میں جہاد کیوں نہ کریں گے؟ ہم تو اپنے گھروں سے اجاڑے گئے ہیں اور بچوں سے دور کردیئے گئے ہیں۔ پھر جب ان پر جہاد فرض ہوا تو سوائے تھوڑے سے لوگوں کے سب پھر گئے اور اللہ تعالیٰ ﻇالموں کو خوب جانتا ہے۔","arabic":"أَلَمۡ تَرَ إِلَى ٱلۡمَلَإِ مِنۢ بَنِيٓ إِسۡرَٰٓءِيلَ مِنۢ بَعۡدِ مُوسَىٰٓ إِذۡ قَالُواْ لِنَبِيّٖ لَّهُمُ ٱبۡعَثۡ لَنَا مَلِكٗا نُّقَٰتِلۡ فِي سَبِيلِ ٱللَّهِۖ قَالَ هَلۡ عَسَيۡتُمۡ إِن كُتِبَ عَلَيۡكُمُ ٱلۡقِتَالُ أَلَّا تُقَٰتِلُواْۖ قَالُواْ وَمَا لَنَآ أَلَّا نُقَٰتِلَ فِي سَبِيلِ ٱللَّهِ وَقَدۡ أُخۡرِجۡنَا مِن دِيَٰرِنَا وَأَبۡنَآئِنَاۖ فَلَمَّا كُتِبَ عَلَيۡهِمُ ٱلۡقِتَالُ تَوَلَّوۡاْ إِلَّا قَلِيلٗا مِّنۡهُمۡۚ وَٱللَّهُ عَلِيمُۢ بِٱلظَّٰلِمِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":253,"juzNumber":2,"footnotes":"(1) مَلأ کسی قوم کے ان اشراف، سردار اور اہل حل وعقد کو کہا جاتا ہے جو خاص مشیر اور قائد ہوتے ہیں، جن کے دیکھنے سے آنکھیں اور دل رعب سے بھر جاتے ہیں، ملا کے لغوی معنی (بھرنے کے ہیں) (ایسرالتفاسیر) جس پیغمبر کا یہاں ذکر ہے اس کا نام شمویل بتلایا جاتا ہے۔ ابن کثیر وغیرہ مفسرین نے جو واقعہ بیان کیا ہے اس کا خلاصہ یہ ہے کہ بنواسرائیل حضرت موسیٰ (عليه السلام) کے بعد کچھ عرصے تک تو ٹھیک رہے، پھر ان میں انحراف آگیا، دین میں بدعات ایجاد کرلیں۔ حتیٰ کہ بتوں کی پوجا شروع کردی۔ انبیا ان کو روکتے رہے، لیکن یہ معصیت اور شرک سے باز نہیں آئے۔ اس کے نتیجے میں اللہ نے ان کے دشمنوں کو ان پر مسلط کردیا، جنہوں نے ان کے علاقے بھی چھین لئے اور ان کی ایک بڑی تعداد کو قیدی بھی بنا لیا، ان میں نبوت وغیرہ کا سلسلہ بھی منقطع ہوگیا، بالآخر بعض لوگوں کی دعاؤں سے شمویل نبی پیدا ہوئے، جنہوں نے دعوت وتبلیغ کا کام شروع کیا۔ انہوں نے پیغمبر سے یہ مطالبہ کیا کہ ہمارے لئے ایک بادشاہ مقرر کردیں جس کی قیادت میں ہم دشمنوں سے لڑیں۔ پیغمبر نے ان کے سابقہ کردار کے پیش نظر کہا کہ تم مطالبہ تو کر رہے ہو، لیکن میرا اندازہ یہ ہے کہ تم اپنی بات پر قائم نہیں رہو گے۔ چنانچہ ایسا ہی ہوا، جیسا کہ قرآن نے بیان کیا ہے۔\n(2) نبی کی موجودگی میں بادشاہ مقرر کرنے کا مطالبہ، بادشاہت کے جواز کی دلیل ہے۔ کیونکہ اگر بادشاہت جائز نہ ہوتی تو اللہ تعالیٰ اس مطالبے کو رد فرما دیتا، لیکن اللہ نے اس معاملہ کو رد نہیں فرمایا، بلکہ طالوت کو ان کے لئے بادشاہ مقرر کر دیا، جیسا کہ آگے آرہا ہے، اس سے معلوم ہوا کہ بادشاہ اگر مطلق العنان نہیں ہے بلکہ وہ احکام الٰہی کا پابند اور عدل وانصاف کرنے والا ہے تو اس کی بادشاہت جائز ہی نہیں، بلکہ مطلوب ومحبوب بھی ہے۔ مزید دیکھیے : سورۃ المائدۃ، آیت 20 کا حاشیہ۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"alam tara ilā al-mala-i min banī is'rāīla min baʿdi mūsā idh qālū linabiyyin lahumu ib'ʿath lanā malikan nuqātil fī sabīli al-lahi qāla hal ʿasaytum in kutiba ʿalaykumu al-qitālu allā tuqātilū qālū wamā lanā allā nuqātila fī sabīli al-lahi waqad ukh'rij'nā min diyārinā wa-abnāinā falammā kutiba ʿalayhimu al-qitālu tawallaw illā qalīlan min'hum wal-lahu ʿalīmun bil-ẓālimīna ","translations":["Did not","you see","[towards]","the chiefs","of","(the) Children","(of) Israel","from","after","Musa","when","they said","to a Prophet","of theirs","Appoint","for us","a king","we may fight","in","(the) way","(of) Allah","He said","Would","you perhaps ","if","prescribed","upon you","[the] fighting","that not","you fight","They said","And what","for us","that not","we fight","in","(the) way","(of) Allah","while surely","we have been driven","from","our homes","and our children","Yet, when","was prescribed","upon them","the fighting","they turned away","except","a few","among them","And Allah","(is) All-Knowing","of the wrongdoers","(246)"],"transliterationArr":["alam","tara","ilā","al-mala-i","min","banī","is'rāīla","min","baʿdi","mūsā","idh","qālū","linabiyyin","lahumu","ib'ʿath","lanā","malikan","nuqātil","fī","sabīli","al-lahi","qāla","hal","ʿasaytum","in","kutiba","ʿalaykumu","al-qitālu","allā","tuqātilū","qālū","wamā","lanā","allā","nuqātila","fī","sabīli","al-lahi","waqad","ukh'rij'nā","min","diyārinā","wa-abnāinā","falammā","kutiba","ʿalayhimu","al-qitālu","tawallaw","illā","qalīlan","min'hum","wal-lahu","ʿalīmun","bil-ẓālimīna",null],"verseTiming":[[1,0,510],[2,510,970],[3,970,1280],[4,1280,2010],[5,2010,2900],[6,2900,4480],[7,4480,7300],[8,7300,8130],[9,8130,8740],[10,8740,10680],[11,10680,11080],[12,11080,11840],[13,11840,12760],[14,12760,13890],[15,13890,14290],[16,14290,15000],[17,15000,15890],[18,15890,16620],[19,16620,17170],[20,17170,17710],[21,17710,18340],[22,18340,19640],[23,19640,19980],[24,19980,20990],[25,20990,22840],[26,22840,23410],[27,23410,23680],[28,23680,24710],[29,24710,25530],[30,25530,25970],[31,25970,26920],[32,26920,27850],[33,27850,28550],[34,28550,29770],[35,29770,30950],[36,30950,31460],[37,31460,33270],[38,33270,33930],[39,33930,34950],[40,34950,35210],[41,35210,36200],[42,36200,36720],[43,36720,37280],[44,37280,38290],[45,38290,39120],[46,39120,40230],[47,40230,43190],[48,43190,44980],[49,44980,45510],[50,45510,46400],[51,46400,47270],[52,47270,48230],[53,48230,48860],[54,48860,49650],[55,49650,51050],[56,51050,52250],[57,52250,53750],[58,53750,56345]]}}