{"name":"2:24","price":"پس اگر تم نے نہ کیا اور تم ہرگز نہیں کرسکتے(1) تو (اسے سچا مان کر) اس آگ سے بچو جس کا ایندھن انسان اور پتھر ہیں(2)، جو کافروں کے لئے تیار کی گئی ہے۔(3)","arabic":"فَإِن لَّمۡ تَفۡعَلُواْ وَلَن تَفۡعَلُواْ فَٱتَّقُواْ ٱلنَّارَ ٱلَّتِي وَقُودُهَا ٱلنَّاسُ وَٱلۡحِجَارَةُۖ أُعِدَّتۡ لِلۡكَٰفِرِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":31,"juzNumber":1,"footnotes":"(1) یہ قرآن کریم کی صداقت کی ایک اور واضح دلیل ہے کہ عرب وعجم کے تمام کافروں کو چیلنج دیا گیا، لیکن وہ آج تک اس کا جواب دینے سے قاصر ہیں اور یقیناً قیامت تک قاصر رہیں گے۔\n(2) پتھر سے مراد بقول ابن عباس گندھک کے پتھر ہیں اور بعض حضرات کے نزدیک پتھر کے وہ أَصْنَامٌ (بت) بھی جہنم کا ایندھن ہوں گے جن کی لوگ دنیا میں پرستش کرتے رہے ہوں گے جیسا کہ قرآن مجید میں بھی ہے: «إِنَّكُمۡ وَمَا تَعۡبُدُونَ مِن دُونِ ٱللَّهِ حَصَبُ جَهَنَّمَ» [الأنبياء: 98] ”تم اور جن کی تم عبادت کرتے ہو، جہنم کا ایندھن ہوں گے۔“\n(3) اس سے ایک تو یہ معلوم ہوا کہ جہنم اصل میں کافروں اور مشرکوں کے لئے تیار کی گئی ہے اور دوسری بات یہ معلوم ہوئی کہ جنت اور دوزخ کا وجود ہے جو اس وقت بھی ثابت ہے۔ یہی سلف امت کا عقیدہ ہے۔ یہ تمثیلی چیزیں نہیں ہیں، جیسا کہ بعض متجددین اور منکرین حدیث باور کراتے ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"fa-in lam tafʿalū walan tafʿalū fa-ittaqū al-nāra allatī waqūduhā al-nāsu wal-ḥijāratu uʿiddat lil'kāfirīna ","translations":["But if","not","you do","and never","will you do","then fear","the Fire","whose","[its] fuel","(is) [the] men","and [the] stones","prepared","for the disbelievers","(24)"],"transliterationArr":["fa-in","lam","tafʿalū","walan","tafʿalū","fa-ittaqū","al-nāra","allatī","waqūduhā","al-nāsu","wal-ḥijāratu","uʿiddat","lil'kāfirīna",null],"verseTiming":[[1,0,450],[2,450,1000],[3,1000,2010],[4,2010,3250],[5,3250,4220],[6,4220,4980],[7,4980,6220],[8,6220,7000],[9,7000,7920],[10,7920,9380],[11,9380,11020],[12,11020,11960],[13,11960,14795]]}}