{"name":"2:243","price":"کیا تم نے انہیں نہیں دیکھا جو ہزاروں کی تعداد میں تھے اور موت کے ڈر کے مارے اپنے گھروں سے نکل کھڑے ہوئے تھے۔ اللہ تعالیٰ نے انہیں فرمایا مرجاؤ، پھر انہیں زنده کردیا(1) بے شک اللہ تعالیٰ لوگوں پر بڑا فضل واﻻ ہے، لیکن اکثر لوگ ناشکرے ہیں۔","arabic":"۞ أَلَمۡ تَرَ إِلَى ٱلَّذِينَ خَرَجُواْ مِن دِيَٰرِهِمۡ وَهُمۡ أُلُوفٌ حَذَرَ ٱلۡمَوۡتِ فَقَالَ لَهُمُ ٱللَّهُ مُوتُواْ ثُمَّ أَحۡيَٰهُمۡۚ إِنَّ ٱللَّهَ لَذُو فَضۡلٍ عَلَى ٱلنَّاسِ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يَشۡكُرُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":250,"juzNumber":2,"footnotes":"(1) یہ واقعہ سابقہ کسی امت کا ہے، جس کی تفصیل کسی صحیح حدیث میں بیان نہیں کی گئی۔ تفسیری روایات میں اسے بنی اسرائیل کے زمانے کا واقعہ اور اس پیغمبر کا نام، جس کی دعا سے انہیں اللہ تعالیٰ نے دوبارہ زندہ فرمایا، حزقیل بتلایا گیا ہے۔ یہ جہاد میں قتل کےڈر سے، یا وبائی بیماری طاعون کے خوف سے اپنے گھروں سے نکل کھڑے ہوئے تھے، تاکہ موت کے منہ میں جانے سے بچ جائیں۔ اللہ تعالیٰ نے انہیں مار کر ایک تو یہ بتلا دیا کہ اللہ کی تقدیر سے تم بچ کر کہیں نہیں جاسکتے۔ دوسرا یہ کہ انسانوں کی آخری جائے پناہ اللہ تعالیٰ ہی کی ذات ہے۔ تیسرا یہ کہ اللہ تعالیٰ دوبارہ پیدا کرنے پر قادر ہے اور وہ تمام انسانوں کو اسی طرح زندہ فرمائے گا جس طرح اللہ نے ان کو مار کر زندہ کردیا۔ اگلی آیت میں مسلمانوں کو جہاد کا حکم دیا جارہا ہے۔ اس سے پہلے اس واقعے کے بیان میں یہی حکمت ہے کہ جہاد سے جی مت چراؤ، موت وحیات تو اللہ کے قبضے میں ہے اور اس موت کا وقت بھی متعین ہے جسے جہاد سے گریز و فرار کرکے تم ٹال نہیں سکتے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"alam tara ilā alladhīna kharajū min diyārihim wahum ulūfun ḥadhara al-mawti faqāla lahumu al-lahu mūtū thumma aḥyāhum inna al-laha ladhū faḍlin ʿalā al-nāsi walākinna akthara al-nāsi lā yashkurūna ","translations":["Did not","you see","[to]","those who","went out","from","their homes","and they","(were in) thousands","(in) fear","(of) [the] death","Then said","to them","Allah","Die","then","He restored them to life","Indeed","Allah","(is) surely Possessor","(of) bounty","for","[the] mankind","[and] but","most","(of) the people","(are) not","grateful","(243)"],"transliterationArr":["alam","tara","ilā","alladhīna","kharajū","min","diyārihim","wahum","ulūfun","ḥadhara","al-mawti","faqāla","lahumu","al-lahu","mūtū","thumma","aḥyāhum","inna","al-laha","ladhū","faḍlin","ʿalā","al-nāsi","walākinna","akthara","al-nāsi","lā","yashkurūna",null],"verseTiming":[[1,0,490],[2,490,890],[3,890,1160],[4,1160,1950],[5,1950,2650],[6,2650,3480],[7,3480,4480],[8,4480,4910],[9,4910,5700],[10,5700,6300],[11,6300,6960],[12,6960,7710],[13,7710,8120],[14,8120,8900],[15,8900,9520],[16,9520,10770],[17,10770,12220],[18,12220,13240],[19,13240,14000],[20,14000,14430],[21,14430,15110],[22,15110,15450],[23,15450,16640],[24,16640,17970],[25,17970,18580],[26,18580,19720],[27,19720,20030],[28,20030,22165]]}}