{"name":"2:248","price":"ان کے نبی نے انہیں پھر کہا کہ اس کی بادشاہت کی ﻇاہری نشانی یہ ہے کہ تمہارے پاس وه صندوق(1) آ جائے گا جس میں تمہارے رب کی طرف سے دلجمعی ہے اور آل موسیٰ اور آل ہارون کا بقیہ ترکہ ہے، فرشتے اسے اٹھا کر ﻻئیں گے۔ یقیناً یہ تو تمہارے لئے کھلی دلیل ہے اگر تم ایمان والے ہو۔","arabic":"وَقَالَ لَهُمۡ نَبِيُّهُمۡ إِنَّ ءَايَةَ مُلۡكِهِۦٓ أَن يَأۡتِيَكُمُ ٱلتَّابُوتُ فِيهِ سَكِينَةٞ مِّن رَّبِّكُمۡ وَبَقِيَّةٞ مِّمَّا تَرَكَ ءَالُ مُوسَىٰ وَءَالُ هَٰرُونَ تَحۡمِلُهُ ٱلۡمَلَٰٓئِكَةُۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لَّكُمۡ إِن كُنتُم مُّؤۡمِنِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":255,"juzNumber":2,"footnotes":"(1) صندوق یعنی تابوت، جو توب سے ہے، جس کے معنی رجوع کرنے کے ہیں۔ کیوں کہ بنی اسرائیل تبرک کے لئے اس کی طرف رجوع کرتے تھے (فتح القدیر) اس تابوت میں حضرت موسیٰ وہارون علیہما السلام کے تبرکات تھے، یہ تابوت بھی ان کے دشمن ان سے چھین کر لے گئے تھے۔ اللہ تعالیٰ نے نشانی کے طور پر یہ تابوت فرشتوں کے ذریعے سے حضرت طالوت کے دروازے پر پہنچا دیا۔ جسے دیکھ کر بنو اسرائیل خوش بھی ہوئے اور اسے طالوت کی بادشاہی کے لئے منجانب اللہ کی نشانی بھی سمجھا اور اللہ تعالیٰ نے بھی اسے ان کے لئے ایک اعجاز (آیت) اور فتح وسکینت کا سبب قرار دیا۔ سکینت کا مطلب ہی اللہ تعالیٰ کی طرف سے خاص نصرت کا ایسا نزول ہے جو وہ اپنے خاص بندوں پر نازل فرماتا ہے اور جس کی وجہ سے جنگ کی خون ریز معرکہ آرائیوں میں جس سے بڑے بڑے شیردل بھی کانپ اٹھتے ہیں، اہل ایمان کے دل دشمن کے خوف اور ہیبت سے خالی اور فتح وکامرانی کی امید سے لبریز ہوتے ہیں۔ اس واقعہ سے معلوم ہوتا ہے کہ انبیاء و صالحین کے تبرکات یقینا باذن اللہ اہمیت و افادیت رکھتے ہیں۔ بشرطیکہ وہ واقعی تبرکات ہوں۔ جس طرح اس تابوت میں یقینا حضرت موسیٰ و ہارون علیہما السلام کے تبرکات تھے لیکن محض جھوٹی نسبت سے کوئی چیز متبرک نہیں بن جاتی، جس طرح آج کل \"تبرکات\" کے نام پر کئی جگہوں پر مختلف چیزیں رکھی ہوئی ہیں، جن کا تاریخی طور پر پورا ثبوت نہیں ہے۔ اسی طرح خود ساختہ چیزوں سے بھی کچھ حاصل نہیں ہوسکتا۔ جس طرح بعض لوگ نبی (صلى الله عليه وسلم) کے نعل مبارک کی تمثال بنا کر اپنے پاس رکھنے کو، یا گھروں میں لٹکانے کو، یا مخصوص طریقے سے اس کے استعمال کو قضائے حاجات اور دفع بلیات کے لئے اکشیر سمجھتے ہیں۔ اسی طرح قبروں پر بزرگوں کے ناموں کی نذر و نیاز کی چیزوں کو اور لنگر کو متبرک سمجھتے ہیں، حالاں کہ یہ غیر اللہ کے نام کا چڑھاوا ہے جو شرک کے دائرے میں آتا ہے، اس کا کھان قطعاً حرام ہے، قبروں کو غسل دیا جاتا ہے اور اس کے پانی کو متبرک سمجھا جاتا ہے، حالاں کہ قبروں کو غسل دینا بھی خانہ کعبہ کے غسل کی نقل ہے، جس کا کوئی جواز نہیں ہے، یہ گندا پانی متبرک کیسے ہوسکتا ہے؟ بہر حال یہ سب باتیں غلط ہیں جن کی کوئی اصل شریعت میں نہیں ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waqāla lahum nabiyyuhum inna āyata mul'kihi an yatiyakumu al-tābūtu fīhi sakīnatun min rabbikum wabaqiyyatun mimmā taraka ālu mūsā waālu hārūna taḥmiluhu al-malāikatu inna fī dhālika laāyatan lakum in kuntum mu'minīna ","translations":["And said","to them","their Prophet","Indeed","a sign","(of) his kingship","(is) that","will come to you","the ark","in it","(is) tranquility","from","your Lord","and a remnant","of what","(was) left","(by the) family","(of) Musa","and family","(of) Harun","will carry it","the Angels","Indeed","in","that","(is) surely a sign","for you","if","you are","believers","(248)"],"transliterationArr":["waqāla","lahum","nabiyyuhum","inna","āyata","mul'kihi","an","yatiyakumu","al-tābūtu","fīhi","sakīnatun","min","rabbikum","wabaqiyyatun","mimmā","taraka","ālu","mūsā","waālu","hārūna","taḥmiluhu","al-malāikatu","inna","fī","dhālika","laāyatan","lakum","in","kuntum","mu'minīna",null],"verseTiming":[[1,0,850],[2,850,1340],[3,1340,2350],[4,2350,3490],[5,3490,4280],[6,4280,6280],[7,6280,6450],[8,6450,8190],[9,8190,9280],[10,9280,9800],[11,9800,10880],[12,10880,11490],[13,11490,12660],[14,12660,13850],[15,13850,15670],[16,15670,16290],[17,16290,16810],[18,16810,17480],[19,17480,18250],[20,18250,19120],[21,19120,19970],[22,19970,22770],[23,22770,23860],[24,23860,24270],[25,24270,25030],[26,25030,25960],[27,25960,26670],[28,26670,27520],[29,27520,28680],[30,28680,32005]]}}