{"name":"2:256","price":"دین کے بارے میں کوئی زبردستی نہیں، ہدایت ضلالت سے روشن ہوچکی ہے(1) ، اس لئے جو شخص اللہ تعالیٰ کے سوا دوسرے معبودوں کا انکار کرکے اللہ تعالیٰ پر ایمان ﻻئے اس نے مضبوط کڑے کو تھام لیا، جو کبھی نہ ٹوٹے گا اور اللہ تعالیٰ سننے واﻻ، جاننے واﻻ ہے۔","arabic":"لَآ إِكۡرَاهَ فِي ٱلدِّينِۖ قَد تَّبَيَّنَ ٱلرُّشۡدُ مِنَ ٱلۡغَيِّۚ فَمَن يَكۡفُرۡ بِٱلطَّٰغُوتِ وَيُؤۡمِنۢ بِٱللَّهِ فَقَدِ ٱسۡتَمۡسَكَ بِٱلۡعُرۡوَةِ ٱلۡوُثۡقَىٰ لَا ٱنفِصَامَ لَهَاۗ وَٱللَّهُ سَمِيعٌ عَلِيمٌ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":263,"juzNumber":3,"footnotes":"(1) اس کی شان نزول میں بتایا گیا ہے کہ انصار کے کچھ نوجوان یہودی یا عیسائی ہوگئے تھے، پھر جب یہ انصار مسلمان ہو گئے تو انہوں نے اپنی نوجوان اولاد کو بھی جو یہودی یا عیسائی بن چکے تھے، زبردستی مسلمان بنانا چاہا ، جس پر یہ آیت نازل ہوئی۔ شان نزول کے اس اعتبار سے بعض مفسرین نے اسے اہل کتاب کے لئے خاص مانا ہے یعنی مسلمان مملکت میں رہنے والے اہل کتاب، اگر وہ جزیہ ادا کرتے ہوں، تو انہیں قبول اسلام پر مجبور نہیں کیا جائے گا۔ لیکن یہ آیت حکم کے اعتبار سے عام ہے، یعنی کسی پر بھی قبول اسلام کے لئے جبر نہیں کیا جائے گا، کیونکہ اللہ تعالیٰ نے ہدایت اور گمراہی دونوں کو واضح کردیا ہے۔ تاہم کفر وشرک کے خاتمے اور باطل کا زور توڑنے کے لئے جہاد ایک الگ اور جبرواکراہ سے مختلف چیز ہے۔ مقصد معاشرے سے اس قوت کا زور اور دباؤ ختم کرنا ہے جو اللہ کے دین پر عمل اور اس کی تبلیغ کی راہ میں روڑہ بنی ہوئی ہو۔ تاکہ ہر شخص اپنی آزاد مرضی سے چاہے تو اپنے کفر پر قائم رہے اور چاہے تو اسلام میں داخل ہوجائے۔ چونکہ روڑہ بننے والی طاقتیں رہ رہ کر ابھرتی رہیں گی اس لئے جہاد کا حکم اور اس کی ضرورت بھی قیامت تک رہے گی، جیسا کہ حدیث میں ہے«الجِهَادُ مَاضٍ إِلَى يَوْمِ القِيَامَةِ»، ”جہاد قیامت تک جاری رہے گا“، خود نبی (صلى الله عليه وسلم) نے کافروں اور مشرکوں سے جہاد کیا ہے اور فرمایا ہے۔«أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَشْهَدُوا أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ»، الحديث- (صحيح بخاري- كتاب الإيمان ، باب فإن تابوا وأقاموا الصلاة) ”مجھے حکم دیا گیا ہے میں لوگوں سے اس وقت تک جہاد کروں جب تک کہ وہ لا الٰہ الا اللہ اور محمد رسول اللہ کا اقرار نہ کرلیں“۔ اسی طرح سزائے ارتداد (قتل) سے بھی اس آیت کا کوئی ٹکراؤ نہیں ہے (جیسا کہ بعض لوگ ایسا باور کراتے ہیں)۔ کیونکہ ارتداد کی سزا۔ قتل۔ سے مقصود جبرواکراہ نہیں ہے بلکہ اسلامی ریاست کی نظریاتی حیثیت کا تحفظ ہے۔ ایک اسلامی مملکت میں ایک کافر کو اپنے کفر پر قائم رہ جانے کی اجازت تو بےشک دی جاسکتی ہے لیکن ایک بار جب وہ اسلام میں داخل ہوجائے تو پھر اس سے بغاوت وانحراف کی اجازت نہیں دی جاسکتی لہذا وہ خوب سوچ کر اسلام لائے۔ کیونکہ اگر یہ اجازت دے دی جاتی تو نظریاتی اساس منہدم ہوسکتی تھی جس سے نظریاتی انتشار اور فکری انارکی پھیلتی جو اسلامی معاشرے کے امن کو اور ملک کے استحکام کو خطرے میں ڈال سکتی تھی۔ اس لئے جس طرح انسانی حقوق کے نام پر، قتل، چوری ، زنا، ڈاکہ اور حرابہ وغیرہ جرائم کی اجازت نہیں دی جاسکتی، اسی طرح آزادی رائے کے نام پر ایک اسلامی مملکت میں نظریاتی بغاوت (ارتداد) کی اجازت بھی نہیں دی جاسکتی۔ یہ جبر واکراہ نہیں ہے۔ بلکہ مرتد کا قتل اسی طرح عین انصاف ہے جس طرح قتل وغارت گری اور اخلاقی جرائم کا ارتکاب کرنے والوں کو سخت سزائیں دینا عین انصاف ہے۔ ایک کا مقصدملک کا نظریاتی تحفظ ہے اور دوسرے کا مقصد ملک کو شروفساد سے بچانا ہے اور دونوں ہی مقصد، ایک مملکت کے لئے ناگزیر ہیں۔ آج اکثر اسلامی ممالک ان دونوں ہی مقاصد کو نظرانداز کرکے جن الجھنوں، دشواریوں اور پریشانیوں سے دوچار ہیں، محتاج وضاحت نہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"lā ik'rāha fī al-dīni qad tabayyana al-rush'du mina al-ghayi faman yakfur bil-ṭāghūti wayu'min bil-lahi faqadi is'tamsaka bil-ʿur'wati al-wuth'qā lā infiṣāma lahā wal-lahu samīʿun ʿalīmun ","translations":["(There is) no","compulsion","in","the religion","Surely","has become distinct","the right (path)","from","the wrong","Then whoever","disbelieves","in false deities","and believes","in Allah","then surely","he grasped","the handhold ","[the] firm","(which) not","(will) break","[for it]","And Allah","(is) All-Hearing","All-Knowing","(256)"],"transliterationArr":["lā","ik'rāha","fī","al-dīni","qad","tabayyana","al-rush'du","mina","al-ghayi","faman","yakfur","bil-ṭāghūti","wayu'min","bil-lahi","faqadi","is'tamsaka","bil-ʿur'wati","al-wuth'qā","lā","infiṣāma","lahā","wal-lahu","samīʿun","ʿalīmun",null],"verseTiming":[[1,0,2120],[2,2120,3070],[3,3070,3300],[4,3300,5780],[5,5780,5960],[6,5960,7070],[7,7070,7840],[8,7840,8160],[9,8160,8840],[10,8840,9700],[11,9700,11060],[12,11060,12430],[13,12430,13920],[14,13920,14920],[15,14920,15460],[16,15460,16410],[17,16410,17540],[18,17540,18500],[19,18500,18670],[20,18670,20200],[21,20200,20710],[22,20710,22090],[23,22090,22950],[24,22950,25115]]}}