{"name":"2:254","price":"اے ایمان والو! جو ہم نے تمہیں دے رکھا ہے اس میں سے خرچ کرتے رہو اس سے پہلے کہ وه دن آئے جس میں نہ تجارت ہے نہ دوستی اور شفاعت(1) اور کافر ہی ﻇالم ہیں۔","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ أَنفِقُواْ مِمَّا رَزَقۡنَٰكُم مِّن قَبۡلِ أَن يَأۡتِيَ يَوۡمٞ لَّا بَيۡعٞ فِيهِ وَلَا خُلَّةٞ وَلَا شَفَٰعَةٞۗ وَٱلۡكَٰفِرُونَ هُمُ ٱلظَّٰلِمُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":261,"juzNumber":3,"footnotes":"(1) یہود و نصاریٰ اور کفار ومشرکین اپنے اپنے پیشواؤں یعنی نبیوں، ولیوں، بزرگوں، پیروں، مرشدوں وغیرہ کے بارے میں یہ عقیدہ رکھتے تھے کہ اللہ پر ان کا اتنا اثر ہے کہ وہ اپنی شخصیت کے دباؤ سے اسے اپنے پیروکاروں کے بارے میں جو بات چاہیں اللہ سے منواسکتے ہیں اور منوا لیتے ہیں۔ اسی کو وہ شفاعت کہتے تھے۔ یعنی ان کا عقیدہ تقریباً وہی تھا جو آج کل کے جاہلوں کا ہے کہ ہماے بزرگ اللہ کے پاس اڑ کر بیٹھ جائیں گے، اور بخشوا کر اٹھیں گے۔ اس آیت میں بتایا گیا ہے کہ اللہ کے یہاں ایسی کسی شفاعت کا کوئی وجود نہیں۔ پھر اس کے بعد آیت الکرسی میں اور دوسری متعدد آیات واحادیث میں بتایا گیا کہ اللہ کے یہاں ایک دوسری قسم کی شفاعت بےشک ہوگی، مگر یہ شفاعت وہی لوگ کرسکیں گے۔ جنہیں اللہ اجازت دے گا۔ اور صرف اسی بندے کے بارے میں کرسکیں گے جس کے لئے اللہ اجازت دے گا۔ اور اللہ صرف اور صرف اہل توحید کے بارے میں اجازت دے گا۔ یہ شفاعت فرشتے بھی کریں گے، انبیا ورسل بھی، اور شہدا وصالحین بھی۔ مگر اللہ پر ان میں کسی بھی شخصیت کا کوئی دباؤ نہ ہوگا۔ بلکہ اس کے برعکس یہ لوگ خود اللہ کے خوف سے اس قدر لرزاں وترساں ہوں گے کہ ان کے چہروں کا رنگ اڑ رہا ہوگا۔ «وَلا يَشْفَعُونَ إِلا لِمَنِ ارْتَضَى وَهُمْ مِنْ خَشْيَتِهِ مُشْفِقُونَ» (الأنبياء : 28)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāayyuhā alladhīna āmanū anfiqū mimmā razaqnākum min qabli an yatiya yawmun lā bayʿun fīhi walā khullatun walā shafāʿatun wal-kāfirūna humu al-ẓālimūna ","translations":["O you","who","believe[d]","Spend","of what","We (have) provided you","from","before","that","comes","a Day","no","bargaining","in it","and no","friendship","and no","intercession","And the deniers ","they","(are) the wrongdoers","(254)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","anfiqū","mimmā","razaqnākum","min","qabli","an","yatiya","yawmun","lā","bayʿun","fīhi","walā","khullatun","walā","shafāʿatun","wal-kāfirūna","humu","al-ẓālimūna",null],"verseTiming":[[1,0,2510],[2,2510,3450],[3,3450,5470],[4,5470,6890],[5,6890,8140],[6,8140,9410],[7,9410,10900],[8,10900,11430],[9,11430,11530],[10,11530,12460],[11,12460,13610],[12,13610,14210],[13,14210,15520],[14,15520,16130],[15,16130,16660],[16,16660,18370],[17,18370,18800],[18,18800,20330],[19,20330,21860],[20,21860,22210],[21,22210,24925]]}}