{"name":"2:25","price":"اور ایمان والوں اور نیک عمل کرنے والوں کو(1) ان جنتوں کی خوشخبریاں دو، جن کےنیچے نہریں بہہ رہی ہیں۔ جب کبھی وه پھلوں کا رزق دیئے جائیں گے اور ہم شکل ﻻئے جائیں گے تو کہیں گے یہ وہی ہے جو ہم اس سے پہلے دیئے گئے تھے(2) اور ان کے لئے بیویاں ہیں صاف(3) ستھری اور وه ان جنتوں میں ہمیشہ رہنے والے ہیں۔(4)","arabic":"وَبَشِّرِ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ أَنَّ لَهُمۡ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُۖ كُلَّمَا رُزِقُواْ مِنۡهَا مِن ثَمَرَةٖ رِّزۡقٗا قَالُواْ هَٰذَا ٱلَّذِي رُزِقۡنَا مِن قَبۡلُۖ وَأُتُواْ بِهِۦ مُتَشَٰبِهٗاۖ وَلَهُمۡ فِيهَآ أَزۡوَٰجٞ مُّطَهَّرَةٞۖ وَهُمۡ فِيهَا خَٰلِدُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":32,"juzNumber":1,"footnotes":"(1) قرآن کریم نے ہر جگہ ایمان کے ساتھ عمل صالح کا تذکرہ فرما کر اس بات کو واضح کردیا ہے کہ ایمان اور عمل صالح ان دونوں کا چولی دامن کا ساتھ ہے۔ عمل صالح کے بغیر ایمان ثمر آور نہیں اور ایمان کے بغیر اعمال خیر کی عنداللہ کوئی اہمیت نہیں۔ اور عمل صالح کیا ہے؟ جو سنت کے مطابق ہو اور خالص رضائے الٰہی کی نیت سے کیا جائے۔ خلاف سنت عمل بھی نامقبول اور نمود ونمائش اور ریاکاری کے لئے کئے گئے عمل بھی مردود ومطرود۔\n(2) مُتَشَابِهًا کا مطلب یا تو جنت کے تمام میووں کا آپس میں ہم شکل ہونا ہے، یا دنیا کے میووں کے ہم شکل ہونا۔ تاہم یہ مشابہت صرف شکل یا نام کی حد تک ہی ہوگی، ورنہ جنت کے میووں کے مزے اور ذائقے سے دنیا کے میووں کو کوئی نسبت ہی نہیں ہے۔ جنت کی نعمتوں کی بابت حدیث میں ہے :«مَا لا عَينٌ رَأَتْ، وَلا أُذُنٌ سَمِعَتْ، وَلا خَطَرَ عَلَى قَلْبِ بَشَرٍ» (صحیح بخاری، تفسیر الم السجدۂ) ”نہ کسی آنکھ نے انہیں دیکھا، نہ کسی کان نے ان کی بابت سنا (اور دیکھنا سننا تو کجا) کسی انسان کے دل میں ان کا گمان بھی نہیں گزرا۔“ (3) یعنی حیض ونفاس اور دیگر آلائشوں سے پاک ہوں گی۔\n(4) خُلُودٌ کے معنی ہمیشگی کے ہیں۔ اہل جنت ہمیشہ ہمیش کے لئے جنت میں رہیں گے اور خوش رہیں گے اور اہل دوزخ ہمیشہ ہمیش کے لئے جہنم میں رہیں گے اور مبتلائے عذاب رہیں گے۔ حدیث میں ہے۔ جنت اور جہنم میں جانے کے بعد ایک فرشتہ اعلان کرے گا ”اے جہنمیو! اب موت نہیں ہے اور اے جنتیو! اب موت نہیں ہے۔ جو فریق جس حالت میں ہے، اسی حالت میں ہمیشہ رہے گا۔“ (صحيح بخاري، كتاب الرقاق، باب يدخل الجنة سبعون ألفا- وصحيح مسلم كتاب الجنة)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wabashiri alladhīna āmanū waʿamilū al-ṣāliḥāti anna lahum jannātin tajrī min taḥtihā al-anhāru kullamā ruziqū min'hā min thamaratin riz'qan qālū hādhā alladhī ruziq'nā min qablu wa-utū bihi mutashābihan walahum fīhā azwājun muṭahharatun wahum fīhā khālidūna ","translations":["And give good news","(to) those who","believe","and do","[the] righteous deeds","that","for them","(will be) Gardens","flow","[from]","under them","the rivers","Every time","they are provided","therefrom","of","fruit","(as) provision","they (will) say","This (is)","the one which","we were provided","from","before","And they will be given","therefrom","(things) in resemblance","And for them","therein","spouses","purified","and they","therein","(will) abide forever","(25)"],"transliterationArr":["wabashiri","alladhīna","āmanū","waʿamilū","al-ṣāliḥāti","anna","lahum","jannātin","tajrī","min","taḥtihā","al-anhāru","kullamā","ruziqū","min'hā","min","thamaratin","riz'qan","qālū","hādhā","alladhī","ruziq'nā","min","qablu","wa-utū","bihi","mutashābihan","walahum","fīhā","azwājun","muṭahharatun","wahum","fīhā","khālidūna",null],"verseTiming":[[1,0,1100],[2,1100,1850],[3,1850,2860],[4,2860,3480],[5,3480,4810],[6,4810,5730],[7,5730,6330],[8,6330,8220],[9,8220,9420],[10,9420,10320],[11,10320,11010],[12,11010,13790],[13,13790,14630],[14,14630,15380],[15,15380,16130],[16,16130,17140],[17,17140,17940],[18,17940,19330],[19,19330,20190],[20,20190,20660],[21,20660,21410],[22,21410,22340],[23,22340,23440],[24,23440,23950],[25,23950,24650],[26,24650,25220],[27,25220,27060],[28,27060,27740],[29,27740,30190],[30,30190,31150],[31,31150,33850],[32,33850,34470],[33,34470,35310],[34,35310,38225]]}}