{"name":"2:263","price":"نرم بات کہنا اور معاف کردینا اس صدقہ سے بہتر ہے جس کے بعد ایذا رسانی ہو(1) اور اللہ تعالیٰ بےنیاز اور بردبار ہے۔","arabic":"۞ قَوۡلٞ مَّعۡرُوفٞ وَمَغۡفِرَةٌ خَيۡرٞ مِّن صَدَقَةٖ يَتۡبَعُهَآ أَذٗىۗ وَٱللَّهُ غَنِيٌّ حَلِيمٞ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":270,"juzNumber":3,"footnotes":"(1) سائل سے نرمی اور شفقت سے بولنا یا دعائیہ کلمات (اللہ تعالیٰ تجھے بھی اور ہمیں بھی اپنے فضل وکرم سے نوازے وغیرہ) سے اس کو جواب دینا قول معروف ہے اور مَغْفِرَةٌ کا مطلب سائل کے فقر اور اس کی حاجت کا لوگوں کے سامنے عدم اظہار اور اس کی پردہ پوشی ہے اور اگر سائل کے منہ سے کوئی نازیبا بات نکل جائے تو اس سے چشم پوشی بھی اس میں شامل ہے۔ یعنی سائل سے نرمی وشفقت اور چشم پوشی، پردہ پوشی، اس صدقے سے بہتر ہے جس کے بعد اس کو لوگوں میں ذلیل ورسوا کرکے اسے تکلیف پہنچائی جائے۔ اسی لئے حدیث میں کیا گیا ہے «الْكَلِمَةُ الطَّيِّبَةُ صَدَقَةٌ»، (صحيح مسلم كتاب الزكاة، باب بيان أن اسم الصدقة يقع على نوع من المعروف) ”پاکیزہ کلمہ بھی صدقہ ہے“، نیز نبی (صلى الله عليه وسلم) نے فرمایا ”تم کسی بھی معروف (نیکی) کو حقیر مت سمجھو، اگرچہ اپنے بھائی سے خندہ پیشانی سے ملنا ہی ہو۔“ «لا تَحْقِرَنَّ مِنَ الْمَعْرُوفِ شَيْئًا وَلَوْ أَنْ تَلْقَى أَخَاكَ بِوَجْهٍ طَلِقٍ»۔ (مسلم، كتاب البرّ، باب استحباب طلاقة الوجه عند اللقاء)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qawlun maʿrūfun wamaghfiratun khayrun min ṣadaqatin yatbaʿuhā adhan wal-lahu ghaniyyun ḥalīmun ","translations":["A word","kind","and (seeking) forgiveness","(are) better","than","a charity","followed [it]","(by) hurt","And Allah","(is) All-Sufficient","All-Forbearing","(263)"],"transliterationArr":["qawlun","maʿrūfun","wamaghfiratun","khayrun","min","ṣadaqatin","yatbaʿuhā","adhan","wal-lahu","ghaniyyun","ḥalīmun",null],"verseTiming":[[1,0,620],[2,620,2980],[3,2980,4280],[4,4280,5060],[5,5060,6800],[6,6800,8480],[7,8480,11120],[8,11120,12300],[9,12300,13240],[10,13240,14200],[11,14200,16435]]}}