{"name":"2:271","price":"اگر تم صدقے خیرات کو ﻇاہر کرو تو وه بھی اچھا ہے اور اگر تم اسے پوشیده پوشیده مسکینوں کو دے دو تو یہ تمہارے حق میں بہتر ہے(1) ، اللہ تعالیٰ تمہارے گناہوں کو مٹا دے گا اور اللہ تعالیٰ تمہارے تمام اعمال کی خبر رکھنے واﻻ ہے،","arabic":"إِن تُبۡدُواْ ٱلصَّدَقَٰتِ فَنِعِمَّا هِيَۖ وَإِن تُخۡفُوهَا وَتُؤۡتُوهَا ٱلۡفُقَرَآءَ فَهُوَ خَيۡرٞ لَّكُمۡۚ وَيُكَفِّرُ عَنكُم مِّن سَيِّـَٔاتِكُمۡۗ وَٱللَّهُ بِمَا تَعۡمَلُونَ خَبِيرٞ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":278,"juzNumber":3,"footnotes":"(1) اس سے معلوم ہوا کہ عام حالات میں خفیہ طور پر صدقہ کرنا افضل ہے، سوائے کسی ایسی صورت کے کہ علانیہ صدقہ دینے میں لوگوں کے لئے ترغیب کا پہلو ہو۔ اگر ریاکاری کا جذبہ شامل نہ ہو تو ایسے موقعوں پر پہل کرنے والے جو خاص فضیلت حاصل کرسکتے ہیں، وہ احادیث سے واضح ہے۔ تاہم اس قسم کی مخصوص صورتوں کے علاوہ دیگر مواقع پر خاموشی سے صدقہ وخیرات کرنا ہی بہتر ہے۔ نبی (صلى الله عليه وسلم) نے فرمایا ہے کہ جن لوگوں کوقیامت کے دن عرش الٰہی کا سایہ نصیب ہوگا، ان میں ایک وہ شخص بھی ہوگا جس نے اتنے خفیہ طریقے سے صدقہ کیا، کہ اس کے بائیں ہاتھ کو بھی یہ پتہ نہیں چلا کہ اس کے دائیں ہاتھ نے کیا خرچ کیا ہے۔ صدقے میں اخفا کی افضیلت کو بعض علما نے صرف نفلی صدقات تک محدود رکھا ہے اور زکٰوۃ کی ادائیگی میں اظہار کو بہتر سمجھا ہے۔ لیکن قرآن کا عموم صدقات نافلہ اور واجبہ دونوں کو شامل ہے (ابن کثیر) اور حدیث کا عموم بھی اسی کی تائید کرتا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"in tub'dū al-ṣadaqāti faniʿimmā hiya wa-in tukh'fūhā watu'tūhā al-fuqarāa fahuwa khayrun lakum wayukaffiru ʿankum min sayyiātikum wal-lahu bimā taʿmalūna khabīrun ","translations":["If","you disclose","the charities","then good","it (is)","But if","you keep it secret","and give it","(to) the poor","then it","(is) better","for you","And He will remove","from you","[of]","your evil deeds","And Allah","with what","you do","(is) All-Aware","(271)"],"transliterationArr":["in","tub'dū","al-ṣadaqāti","faniʿimmā","hiya","wa-in","tukh'fūhā","watu'tūhā","al-fuqarāa","fahuwa","khayrun","lakum","wayukaffiru","ʿankum","min","sayyiātikum","wal-lahu","bimā","taʿmalūna","khabīrun",null],"verseTiming":[[1,0,1060],[2,1060,1710],[3,1710,2870],[4,2870,4560],[5,4560,5080],[6,5080,6640],[7,6640,7910],[8,7910,8980],[9,8980,11440],[10,11440,12000],[11,12000,12660],[12,12660,13790],[13,13790,14880],[14,14880,16370],[15,16370,18070],[16,18070,20140],[17,20140,21090],[18,21090,21640],[19,21640,22790],[20,22790,24925]]}}