{"name":"2:27","price":"جو لوگ اللہ تعالیٰ کے مضبوط عہد کو(1) توڑ دیتے ہیں اور اللہ تعالیٰ نے جن چیزوں کے جوڑنے کا حکم دیا ہے، انہیں کاٹتے اور زمین میں فساد پھیلاتے ہیں، یہی لوگ نقصان اٹھانے والے ہیں۔(2)","arabic":"ٱلَّذِينَ يَنقُضُونَ عَهۡدَ ٱللَّهِ مِنۢ بَعۡدِ مِيثَٰقِهِۦ وَيَقۡطَعُونَ مَآ أَمَرَ ٱللَّهُ بِهِۦٓ أَن يُوصَلَ وَيُفۡسِدُونَ فِي ٱلۡأَرۡضِۚ أُوْلَٰٓئِكَ هُمُ ٱلۡخَٰسِرُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":34,"juzNumber":1,"footnotes":"(1) مفسرین نے عَهْدٌ کے مختلف مفہوم بیان کئے ہیں۔ مثلاً اللہ تعالیٰ کی وہ وصیت جو اس نے اپنے اوامر بجا لانے اور نواہی سے باز رکھنے کے لئے انبیاء (عليهم السلام) کے ذریعے سے مخلوق کو کی۔ ۔ وہ عہد جو اہل کتاب سے تورات میں لیا گیا کہ نبی آخر الزمان (صلى الله عليه وسلم) کے آجانے کے بعد تمہارے لئے ان کی تصدیق کرنا اور ان کی نبوت پر ایمان لانا ضروری ہوگا۔ وہ عہدالست جو صلب آدم سے نکالنے کے بعد تمام ذریت آدم سے لیا گیا، جس کا ذکر قرآن مجید میں کیا گیا ہے: «وَإِذۡ أَخَذَ رَبُّكَ مِنۢ بَنِيٓ ءَادَمَ مِن ظُهُورِهِمۡ» (الأعراف: 172) نقض عہد کا مطلب عہد کی پروا نہ کرنا ہے (ابن کثیر)\n(2) ظاہر بات ہے کہ نقصان اللہ کی نافرمانی کرنے والوں کو ہی ہوگا، اللہ کا یا اس کے پیغمبروں اور داعیوں کا کچھ نہ بگڑے گا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"alladhīna yanquḍūna ʿahda al-lahi min baʿdi mīthāqihi wayaqṭaʿūna mā amara al-lahu bihi an yūṣala wayuf'sidūna fī al-arḍi ulāika humu al-khāsirūna ","translations":["Those who","break","(the) Covenant","(of) Allah","from","after","its ratification","and [they] cut","what","has ordered","Allah","it","to","be joined","and [they] spread corruption","in","the earth","Those","they","(are) the losers","(27)"],"transliterationArr":["alladhīna","yanquḍūna","ʿahda","al-lahi","min","baʿdi","mīthāqihi","wayaqṭaʿūna","mā","amara","al-lahu","bihi","an","yūṣala","wayuf'sidūna","fī","al-arḍi","ulāika","humu","al-khāsirūna",null],"verseTiming":[[1,0,1110],[2,1110,2890],[3,2890,3510],[4,3510,4260],[5,4260,5220],[6,5220,5810],[7,5810,7040],[8,7040,8470],[9,8470,10210],[10,10210,10750],[11,10750,11500],[12,11500,13440],[13,13440,13750],[14,13750,15040],[15,15040,16250],[16,16250,16470],[17,16470,17270],[18,17270,20150],[19,20150,20470],[20,20470,23395]]}}