{"name":"2:275","price":"سود خور(1) لوگ نہ کھڑے ہوں گے مگر اسی طرح جس طرح وہ کھڑا ہوتا ہے جسے شیطان چھو کر خبطی بنا دے(2) یہ اس لئے کہ یہ کہا کرتے تھے کہ تجارت بھی تو سود ہی کی طرح ہے(3)، حالانکہ اللہ تعالیٰ نے تجارت کو حلال کیا اور سود کو حرام، جو شخص اپنے پاس آئی ہوئی اللہ تعالیٰ کی نصیحت سن کر رک گیا اس کے لئے وہ ہے جو گزرا(4) اور اس کا معاملہ اللہ تعالیٰ کی طرف ہے(5)، اور جو پھر دوبارہ ﴿حرام کی طرف﴾ لوٹا، وہ جہنمی ہے، ایسے لوگ ہمیشہ ہی اس میں رہیں گے۔","arabic":"ٱلَّذِينَ يَأۡكُلُونَ ٱلرِّبَوٰاْ لَا يَقُومُونَ إِلَّا كَمَا يَقُومُ ٱلَّذِي يَتَخَبَّطُهُ ٱلشَّيۡطَٰنُ مِنَ ٱلۡمَسِّۚ ذَٰلِكَ بِأَنَّهُمۡ قَالُوٓاْ إِنَّمَا ٱلۡبَيۡعُ مِثۡلُ ٱلرِّبَوٰاْۗ وَأَحَلَّ ٱللَّهُ ٱلۡبَيۡعَ وَحَرَّمَ ٱلرِّبَوٰاْۚ فَمَن جَآءَهُۥ مَوۡعِظَةٞ مِّن رَّبِّهِۦ فَٱنتَهَىٰ فَلَهُۥ مَا سَلَفَ وَأَمۡرُهُۥٓ إِلَى ٱللَّهِۖ وَمَنۡ عَادَ فَأُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلنَّارِۖ هُمۡ فِيهَا خَٰلِدُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":282,"juzNumber":3,"footnotes":"(1) رِبَا کے لغوی معنی زیادتی اور اضافے کے ہیں۔ اور شریعت میں اس کا اطلاق \"رِبَا الْفَضْلِاوررِبَا النَّسِيئَةِ\" پر ہوتا ہے۔ \"رِبَا الْفَضْلِ\"، اس سود کو کہتے ہیں جو چھ اشیا میں کمی بیشی یا نقد وادھار کی وجہ سے ہوتا ہے (جس کی تفصیل حدیث میں ہے، مثلاً گندم کا تبادلہ گندم سے کرنا ہے تو فرمایا گیا ہے کہ ایک تو برابر برابر ہو۔ دوسرے يَدًا بِيَدٍ( ہاتھوں ہاتھ) ہو۔ اس میں کمی بیشی ہوگی تب بھی اور ہاتھوں ہاتھ ہونے کی بجائے، ایک نقد اور دوسرا ادھار یا دونوں ہی ادھار ہوں، تب بھی سود ہے) \"رِبَا النَّسِيئَةِ\" کا مطلب ہے کسی کو (مثلاً) 6 مہینے کے لئے اس شرط پر سو روپے دینا، کہ واپسی 125 روپے ہوگی۔ 25روپے 6 مہینے کی مہلت کے لئے جائیں حضرت علی (رضي الله عنه) کی طرف منسوب قول میں اسے اس طرح بیان کیا گیا ہے۔ \"كُلُّ قَرْضٍ جَرَّ مَنْفَعَةً فَهُوَ رِبًا\" (فيض القدير شرح الجامع الصغير، ج 5، ص 28 ) ”قرض پر لیا گیا نفع سود ہے“، یہ قرضہ ذاتی ضرورت کے لئے لیا گیا ہو یا کاروبار کے لئے دونوں قسم کے قرضوں پر لیا گیا سود حرام ہے اور زمانۂ جاہلیت میں بھی دونوں قسم کے قرضوں کا رواج تھا۔ شریعت نے بغیر کسی قسم کی تفریق کے دونوں کو مطلقاً حرام قرار دیا ہے۔ اس لئے بعض لوگوں کا یہ کہنا کہ تجارتی قرضہ (جو عام طور پر بنک سے لیا جاتا ہے) اس پر اضافہ، سود نہیں ہے۔ اس لئے کہ قرض لینے والا اس سے فائدہ اٹھاتا ہے جس کا کچھ حصہ وہ بنک کو یا قرض دہندہ کو لوٹا دیتا ہے تو اس میں کیا قباحت ہے؟ اس کی قباحت ان متجددین کو نظر نہیں آتی جو اس کو جائز قرار دینا چاہتے ہیں، ورنہ اللہ تعالیٰ کی نظر میں تو اس میں بڑی قباحتیں ہیں۔ مثلاً قرض لے کر کاروبار کرنے والے کا منافع تو یقینی نہیں ہے۔ بلکہ، منافع تو کجا اصل رقم کی حفاظت کی بھی ضمانت نہیں ہے۔ بعض دفعہ کاروبار میں ساری رقم ہی ڈوب جاتی ہے۔ جب کہ اس کے برعکس قرض دہندہ (چاہے وہ بنک ہو یا کوئی ساہوکار) کا منافع متعین ہے جس کی ادائیگی ہر صورت میں لازمی ہے۔ یہ ظلم کی ایک واضح صورت ہے جسے شریعت اسلامیہ کس طرح جائز قرار دے سکتی ہے؟ علاوہ ازیں شریعت تو اہل ایمان کو معاشرے کے ضرورت مندوں پر بغیر کسی دنیوی غرض ومنفعت کے خرچ کرنے کی ترغیب دیتی ہے، جس سے معاشرے میں اخوت، بھائی چارے، ہمدردی، تعاون اور شفقت و محبت کے جذبات فروغ پاتے ہیں۔ اس کے برعکس سودی نظام سے سنگ دلی اور خود غرضی کو فروغ ملتا ہے۔ ایک سرمائے دار کو اپنے سرمائے کے نفع سے غرض ہوتی ہے چاہے معاشرے میں ضرورت مند، بیماری، بھوک، افلاس سے کراہ رہے ہوں یا بےروزگار اپنی زندگی سے بیزار ہوں۔ شریعت اس شقاوت سنگ دلی کو کس طرح پسند کرسکتی ہے؟ اس کے اور بہت سے نقصانات ہیں، تفصیل کی یہاں گنجائش نہیں۔ بہرحال سود مطلقاً حرام ہے چاہے ذاتی ضرورت کے لئے لئے گئے قرضے کا سود ہو یا تجارتی قرضے پر۔\n(2) سود خور کی یہ کیفیت قبر سے اٹھتے وقت یا میدان محشر میں ہوگی۔\n(3) حالانکہ تجارت میں تو نقد رقم اور کسی چیز کا آپس میں تبادلہ ہوتا ہے۔ دوسرے اس میں نفع نقصان کا امکان رہتا ہے، جب کہ سود میں یہ دونوں چیزیں مفقود ہیں، علاوہ ازیں بیع کو اللہ نے حلال اور سود کو حرام قرار دیا ہے۔ پھر یہ دونوں ایک کس طرح قبول ہوسکتے ہیں؟\n(4) قبول ایمان یا توبہ کے بعد پچھلے سود پر گرفت نہیں ہوگی۔\n(5) کہ وہ توبہ پر ثابت قدم رکھتا ہو یا سؤ عمل اور فسادنیت کی وجہ سے اسے حالات کے رحم و کرم پر چھوڑ دیتا ہے۔ اسی لئے اس کے بعد دوبارہ سود لینے والے کے لئے وعید ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"alladhīna yakulūna al-riba lā yaqūmūna illā kamā yaqūmu alladhī yatakhabbaṭuhu al-shayṭānu mina al-masi dhālika bi-annahum qālū innamā al-bayʿu mith'lu al-riba wa-aḥalla al-lahu al-bayʿa waḥarrama al-riba faman jāahu mawʿiẓatun min rabbihi fa-intahā falahu mā salafa wa-amruhu ilā al-lahi waman ʿāda fa-ulāika aṣḥābu al-nāri hum fīhā khālidūna ","translations":["Those who","consume","[the] usury","not","they can stand","except","like","stands","the one who","confounds him","the Shaitaan","with","(his) touch","That","(is) because they","say","Only","the trade","(is) like","[the] usury","While has permitted","Allah","[the] trade","but (has) forbidden","[the] usury","Then whoever ","comes to him","(the) admonition","from","His Lord","and he refrained","then for him","what","(has) passed","and his case","(is) with","Allah","and whoever","repeated","then those","(are the) companions","(of) the Fire","they","in it","will abide forever","(275)"],"transliterationArr":["alladhīna","yakulūna","al-riba","lā","yaqūmūna","illā","kamā","yaqūmu","alladhī","yatakhabbaṭuhu","al-shayṭānu","mina","al-masi","dhālika","bi-annahum","qālū","innamā","al-bayʿu","mith'lu","al-riba","wa-aḥalla","al-lahu","al-bayʿa","waḥarrama","al-riba","faman","jāahu","mawʿiẓatun","min","rabbihi","fa-intahā","falahu","mā","salafa","wa-amruhu","ilā","al-lahi","waman","ʿāda","fa-ulāika","aṣḥābu","al-nāri","hum","fīhā","khālidūna",null],"verseTiming":[[1,0,1140],[2,1140,2320],[3,2320,3050],[4,3050,3430],[5,3430,4580],[6,4580,5280],[7,5280,5940],[8,5940,6700],[9,6700,7540],[10,7540,8870],[11,8870,10050],[12,10050,10350],[13,10350,11160],[14,11160,12290],[15,12290,13830],[16,13830,15650],[17,15650,16930],[18,16930,17770],[19,17770,18300],[20,18300,19200],[21,19200,20500],[22,20500,21330],[23,21330,22190],[24,22190,23100],[25,23100,23950],[26,23950,25530],[27,25530,28030],[28,28030,29060],[29,29060,29790],[30,29790,30950],[31,30950,32520],[32,32520,33270],[33,33270,33630],[34,33630,34270],[35,34270,36510],[36,36510,36850],[37,36850,39350],[38,39350,39820],[39,39820,40430],[40,40430,42999],[41,42999,43839],[42,43839,47219],[43,47219,47539],[44,47539,48269],[45,48269,50684]]}}