{"name":"2:284","price":"آسمانوں اور زمین کی ہر چیز اللہ تعالیٰ ہی کی ملکیت ہے۔ تمہارے دلوں میں جو کچھ ہے اسے تم ﻇاہر کرو یا چھپاؤ، اللہ تعالیٰ اس کا حساب تم سے لے گا(1) ۔ پھر جسے چاہے بخشے اور جسے چاہے سزا دے اور اللہ تعالیٰ ہر چیز پر قادر ہے۔","arabic":"لِّلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ وَإِن تُبۡدُواْ مَا فِيٓ أَنفُسِكُمۡ أَوۡ تُخۡفُوهُ يُحَاسِبۡكُم بِهِ ٱللَّهُۖ فَيَغۡفِرُ لِمَن يَشَآءُ وَيُعَذِّبُ مَن يَشَآءُۗ وَٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":291,"juzNumber":3,"footnotes":"(1) احادیث میں آتا ہے کہ جب یہ آیت نازل ہوئی تو صحابہ کرام بڑے پریشان ہوئے۔ انہوں نے دربار رسالت میں حاضر ہو کر عرض کیا کہ یا رسول اللہ ! نماز، روزہ، زکٰوۃ وجہاد وغیرہ یہ سارے اعمال، جن کا ہمیں حکم دیا گیا ہے، ہم بجا لاتے ہیں۔ کیونکہ یہ ہماری طاقت سے بالا نہیں ہیں۔ لیکن دل میں پیدا ہونے والے خیالات اور وسوسوں پر تو ہمارا اختیار ہی نہیں ہے اور وہ تو انسانی طاقت سے ہی ماورا ہیں۔ لیکن اللہ تعالیٰ نے ان پر بھی محاسبہ کا اعلان فرما دیا ہے۔ نبی کریم (صلى الله عليه وسلم) نے فرمایا۔ فی الحال تم«سَمِعْنَا وَأَطَعْنَا»ہی کہو۔ چنانچہ صحابہ (رضي الله عنهم) کے جذبہ سمع وطاعت کو دیکھتے ہوئےاللہ تعالے نے اسے آیت «لا يُكَلِّفُ اللَّهُ نَفْسًا إِلا وُسْعَهَا» ”اللہ تعالیٰ کسی جان کو اس کی طاقت سے زیادہ تکلیف نہیں دیتا“، سے منسوخ فرما دیا (ابن کثیر وفتح القدیر) صحیحین وسنن اربعہ کی یہ حدیث بھی اس کی تائید کرتی ہے۔ «إِنَّ اللهَ تَجَاوَزَ لِي عَنْ أُمَّتِي مَا وَسْوَسَتْ بِهِ صُدُورُهَا مَا لَمْ تَعْمَلْ أَوْ تَتَكَلَّمْ»۔ (صحيح بخاري، كتاب العتق ، باب الخطأ والنسيان في العتاقة... ومسلم، كتاب الإيمان، باب تجوز أمته عن حديث النفس ....) ”اللہ تعالیٰ نے میری امت سے جی میں آنے والی باتوں کو معاف کردیا ہے۔ البتہ ان پر گرفت ہوگی جن پر عمل کیا جائے یا جن کا اظہار زبان سے کردیا جائے“، اس سے معلوم ہوا کہ دل میں گزرنے والے خیالات پر محاسبہ نہیں ہوگا، صرف ان پر محاسبہ ہوگا جو پختہ عزم وارادہ میں ڈھل جائیں یا عمل کا قالب اختیار کرلیں۔ اس کے برعکس امام ابن جریر طبری کا خیال ہے کہ یہ آیت منسوخ نہیں ہے کیونکہ محاسبہ معاقبہ کو لازم نہیں ہے۔ یعنی ایسا نہیں ہے کہ اللہ تعالیٰ جس کا بھی محاسبہ کرے، اس کو سزا بھی ضرور دے، بلکہ اللہ تعالیٰ محاسبہ تو ہر ایک کا کرے گا ، لیکن بہت سے لوگ ہوں گے کہ محاسبہ کرنے کے بعد اللہ تعالیٰ ان کو معاف فرما دے گا بلکہ بعض کے ساتھ تو یہ معاملہ فرمائے گا کہ اس کا ایک ایک گناہ یاد کراکے ان کا اس سے اعتراف کروائے گا اور پھر فرمائے گا کہ میں نے دنیا میں ان پر پردہ ڈالے رکھا، جاآج میں ان کو معاف کرتا ہوں (یہ حدیث صحیح بخاری، مسلم وغیرہما میں ہے بحوالہ ابن کثیر) اور بعض علما نے کہا ہے کہ یہاں نسخ اصطلاحی معنی میں نہیں ہے بلکہ بعض دفعہ اسے وضاحت کے معنی میں بھی استعمال کرلیا جاتا ہے۔ چنانچہ صحابہ کرام کے دل میں جو شبہ اس آیت سے پیدا ہوا تھا، اسے آیت«لا يُكَلِّفُ اللَّهُ نَفْسًا» اور حدیث «إِنَّ اللهَ تَجَاوَزَ لِي عَنْ أُمَّتِي...»، وغیرہ سے دور کردیا گیا۔ اس طرح ناسخ منسوخ ماننے کی ضرورت باقی نہیں رہتی۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"lillahi mā fī al-samāwāti wamā fī al-arḍi wa-in tub'dū mā fī anfusikum aw tukh'fūhu yuḥāsib'kum bihi al-lahu fayaghfiru liman yashāu wayuʿadhibu man yashāu wal-lahu ʿalā kulli shayin qadīrun ","translations":["To Allah (belongs)","whatever","(is) in","the heavens","and whatever","(is) in","the earth","And if","you disclose","what","(is) in","yourselves","or","you conceal it","will call you to account","for it","Allah","Then, He will forgive","[to] whom","He wills","and He will punish","whom","He wills","And Allah","on","every","thing","(is) All-Powerful","(284)"],"transliterationArr":["lillahi","mā","fī","al-samāwāti","wamā","fī","al-arḍi","wa-in","tub'dū","mā","fī","anfusikum","aw","tukh'fūhu","yuḥāsib'kum","bihi","al-lahu","fayaghfiru","liman","yashāu","wayuʿadhibu","man","yashāu","wal-lahu","ʿalā","kulli","shayin","qadīrun",null],"verseTiming":[[1,0,1090],[2,1090,1400],[3,1400,1600],[4,1600,2910],[5,2910,3460],[6,3460,3670],[7,3670,4700],[8,4700,5750],[9,5750,6570],[10,6570,6870],[11,6870,8710],[12,8710,10360],[13,10360,10680],[14,10680,11600],[15,11600,13560],[16,13560,13920],[17,13920,15980],[18,15980,16820],[19,16820,17400],[20,17400,20450],[21,20450,21450],[22,21450,21750],[23,21750,25330],[24,25330,26260],[25,26260,26780],[26,26780,27360],[27,27360,29060],[28,29060,31225]]}}