{"name":"2:280","price":"اور اگر کوئی تنگی والا ہو تو اسے آسانی تک مہلت دینی چاہئے اور صدقہ کرو تو تمہارے لئے بہت ہی بہتر ہے(1) ، اگر تم میں علم ہو۔","arabic":"وَإِن كَانَ ذُو عُسۡرَةٖ فَنَظِرَةٌ إِلَىٰ مَيۡسَرَةٖۚ وَأَن تَصَدَّقُواْ خَيۡرٞ لَّكُمۡ إِن كُنتُمۡ تَعۡلَمُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":287,"juzNumber":3,"footnotes":"(1) زمانۂ جاہلیت میں قرض کی ادائیگی نہ ہونے کی صورت میں سود در سود، اصل رقم میں اضافہ ہی ہوتا چلا جاتا تھا، جس سے وہ تھوڑی سی رقم ایک پہاڑ بن جاتی اور اس کی ادائیگی ناممکن ہوجاتی۔ اس کے برعکس اللہ تعالیٰ نے حکم دیا کہ کوئی تنگ دست ہو تو (سود لینا تو درکنار اصل مال لینے میں بھی) آسانی تک اسے مہلت دے دو اور اگر قرض بالکل ہی معاف کر دو تو زیادہ بہتر ہے، احادیث میں بھی اس کی بڑی فضیلت بیان کی گئی ہے۔ کتنا فرق ہے ان دونوں نظاموں میں ؟ ایک سراسر ظلم، سنگ دلی اور خود غرضی پر مبنی نظام اور دوسرا ہمدردی، تعاون اور ایک دوسرے کو سہارا دینے والا نظام۔ مسلمان خود ہی اس بابرکت اور پررحمت نظام الٰہی کو نہ اپنائیں تو اس میں اسلام کا کیا قصور اور اللہ پر کیا الزام ؟ کاش مسلمان اپنے دین کی اہمیت و افادیت کو سمجھ سکیں اور اس پر اپنے نظام زندگی کو استوار کرسکیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-in kāna dhū ʿus'ratin fanaẓiratun ilā maysaratin wa-an taṣaddaqū khayrun lakum in kuntum taʿlamūna ","translations":["And if","is","the (debtor)","in difficulty","then postponement","until","ease","And if","you remit as charity","(it is) better","for you","If","you","know","(280)"],"transliterationArr":["wa-in","kāna","dhū","ʿus'ratin","fanaẓiratun","ilā","maysaratin","wa-an","taṣaddaqū","khayrun","lakum","in","kuntum","taʿlamūna",null],"verseTiming":[[1,0,1310],[2,1310,1860],[3,1860,2260],[4,2260,3280],[5,3280,4800],[6,4800,5390],[7,5390,6660],[8,6660,7590],[9,7590,8720],[10,8720,9350],[11,9350,10470],[12,10470,11600],[13,11600,13120],[14,13120,15585]]}}