{"name":"2:29","price":"وه اللہ جس نے تمہارے لئے زمین کی تمام چیزوں کو پیدا کیا(1) ، پھر آسمان کی طرف قصد کیا(2) اور ان کو ٹھیک ٹھاک سات آسمان(3) بنایا اور وه ہر چیز کو جانتا ہے۔","arabic":"هُوَ ٱلَّذِي خَلَقَ لَكُم مَّا فِي ٱلۡأَرۡضِ جَمِيعٗا ثُمَّ ٱسۡتَوَىٰٓ إِلَى ٱلسَّمَآءِ فَسَوَّىٰهُنَّ سَبۡعَ سَمَٰوَٰتٖۚ وَهُوَ بِكُلِّ شَيۡءٍ عَلِيمٞ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":36,"juzNumber":1,"footnotes":"(1) اس سے استدلال کیا گیا ہے کہ زمین کی اشیاء مخلوقہ کے لئے (اصل) حلت ہے۔ الا یہ کہ کسی چیز کی حرمت نص سے ثابت ہو (فتح القدیر)\n(2) بعض سلف امت نے اس کا ترجمہ ”پھر آسمان کی طرف چڑھ گیا“ کیا ہے (صحیح بخاری) اللہ تعالیٰ کا آسمانوں کے اوپر عرش پر چڑھنا اور خاص خاص مواقع پر آسمان دنیا پر نزول، اللہ کی صفات میں سے ہے، جن پر اسی طرح بغیر تاویل کے ایمان رکھنا ضروری ہے۔ جس طرح قرآن یا احادیث میں بیان کی گئی ہیں۔\n(3) اس سے ایک تو یہ معلوم ہوا کہ (آسمان) ایک حسی وجود اور حقیقت ہے۔ محض بلندی کو سماء سے تعبیر نہیں کیا گیا ہے۔ دوسری بات یہ معلوم ہوئی کہ ان کی تعداد سات ہے۔ اور حدیث کے مطابق دو آسمانوں کے درمیان سال کی مسافت ہے۔ اور زمین کی بابت قرآن کریم میں ہے «وَمِنَ الأَرْضِ مِثْلَهُنَّ» (الطلاق:12) ”اور زمین بھی آسمان کی مثل ہیں“ اس سے زمین کی تعداد بھی سات ہی معلوم ہوتی ہے جس کی مزید تائید حدیث نبوی سے ہوجاتی ہے : «مَنْ أَخَذَ شِبْرًا مِنْ الأَرْضِ ظُلْمًا، فَإِنَّهُ يُطَوَّقُهُ يَوْمَ الْقِيامَةِ مِنْ سَبْعِ أَرْضِينَ» (صحيح بخاري، بدء الخلق ما جاء في سبع أرضين) ”جس نے ظلماً کسی کی ایک بالشت زمین لے لی تو اللہ تعالیٰ اسے قیامت کے دن ساتوں زمینوں کا طوق پہنائے گا۔“ اس آیت سے یہ بھی معلوم ہوتا ہے کہ آسمان سے پہلے زمین کی تخلیق ہوئی ہے۔ لیکن سورہ نازعات میں آسمان کے ذکر کے بعد فرمایا گیا ہے۔ «وَالأَرْضَ بَعْدَ ذَلِكَ دَحَاهَا» ”زمین کو اس کے بعد بچھایا“ اس کی توجیہ یہ کی گئی ہے کہ تخلیق پہلے زمین ہی کی ہوئی ہے اور دَحْوٌ (صاف اور ہموار کرکے بچھانا) تخلیق سے مختلف چیز ہے جو آسمان کی تخلیق کے بعد عمل میں آیا۔ (فتح القدیر)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"huwa alladhī khalaqa lakum mā fī al-arḍi jamīʿan thumma is'tawā ilā al-samāi fasawwāhunna sabʿa samāwātin wahuwa bikulli shayin ʿalīmun ","translations":["He","(is) the One Who","created","for you","what","(is) in","the earth","all","Moreover","He turned","to","the heaven","and fashioned them","seven","heavens","And He","of every","thing","(is) All-Knowing","(29)"],"transliterationArr":["huwa","alladhī","khalaqa","lakum","mā","fī","al-arḍi","jamīʿan","thumma","is'tawā","ilā","al-samāi","fasawwāhunna","sabʿa","samāwātin","wahuwa","bikulli","shayin","ʿalīmun",null],"verseTiming":[[1,0,380],[2,380,1110],[3,1110,1750],[4,1750,2430],[5,2430,3330],[6,3330,3610],[7,3610,4350],[8,4350,5950],[9,5950,7090],[10,7090,9599],[11,9599,9959],[12,9959,12409],[13,12409,14449],[14,14449,14999],[15,14999,17569],[16,17569,18029],[17,18029,18809],[18,18809,19539],[19,19539,21634]]}}