{"name":"2:3","price":"جو لوگ غیب پر ایمان ﻻتے ہیں(1) اور نماز کو قائم رکھتے ہیں(2) اور ہمارے دیئے ہوئے (مال) میں سے خرچ کرتے ہیں۔(3)","arabic":"ٱلَّذِينَ يُؤۡمِنُونَ بِٱلۡغَيۡبِ وَيُقِيمُونَ ٱلصَّلَوٰةَ وَمِمَّا رَزَقۡنَٰهُمۡ يُنفِقُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":10,"juzNumber":1,"footnotes":"(1) أُمُورٌ غَيْبِيَّةٌ سے مراد وہ چیزیں ہیں جن کا ادراک عقل وحواس سے ممکن نہیں۔ جیسے ذات باری تعالیٰ، وحی الٰہی، جنت، دوزخ، ملائکہ، عذاب قبر اور حشراجساد وغیرہ۔ اس سے معلوم ہوا کہ اللہ اور رسول (صلى الله عليه وسلم) کی بتلائی ہوئی ماورائے عقل واحساس باتوں پر یقین رکھنا، جزو ایمان ہے اور ان کا انکار کفروضلالت ہے۔\n(2) اقامت صلوٰۃ سے مراد پابندی سے اور سنت نبوی کے مطابق نماز کا اہتمام کرنا ہے، ورنہ نماز تو منافقین بھی پڑھتے تھے۔ (3) إِنْفَاقٌ کا لفظ عام ہے، جو صدقات واجبہ اور نافلہ دونوں کو شامل ہے۔ اہل ایمان حسب استطاعت دونوں میں کوتاہی نہیں کرتے، بلکہ ماں باپ اور اہل وعیال پر صحیح طریقے سے خرچ کرنا بھی اس میں داخل ہے اور باعث اجر وثواب ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"alladhīna yu'minūna bil-ghaybi wayuqīmūna al-ṣalata wamimmā razaqnāhum yunfiqūna ","translations":["Those who","believe","in the unseen","and establish","the prayer","and out of what","We have provided them","they spend","(3)"],"transliterationArr":["alladhīna","yu'minūna","bil-ghaybi","wayuqīmūna","al-ṣalata","wamimmā","razaqnāhum","yunfiqūna",null],"verseTiming":[[1,0,1040],[2,1040,2190],[3,2190,3090],[4,3090,4260],[5,4260,5220],[6,5220,6580],[7,6580,7990],[8,7990,11365]]}}