{"name":"2:30","price":"اور جب تیرے رب نے فرشتوں(1) سے کہا کہ میں زمین میں خلیفہ بنانے واﻻ ہوں، تو انہوں(2) نے کہا ایسے شخص کو کیوں پیدا کرتا ہے جو زمین میں فساد کرے اور خون بہائے؟ اور ہم تیری تسبیح، حمد اور پاکیزگی بیان کرنے والے ہیں۔ اللہ تعالیٰ نے فرمایا، جو میں جانتا ہوں تم نہیں جانتے۔(3)","arabic":"وَإِذۡ قَالَ رَبُّكَ لِلۡمَلَٰٓئِكَةِ إِنِّي جَاعِلٞ فِي ٱلۡأَرۡضِ خَلِيفَةٗۖ قَالُوٓاْ أَتَجۡعَلُ فِيهَا مَن يُفۡسِدُ فِيهَا وَيَسۡفِكُ ٱلدِّمَآءَ وَنَحۡنُ نُسَبِّحُ بِحَمۡدِكَ وَنُقَدِّسُ لَكَۖ قَالَ إِنِّيٓ أَعۡلَمُ مَا لَا تَعۡلَمُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":37,"juzNumber":1,"footnotes":"(1) مَلائِكَةٌ (فرشتے) اللہ کی نوری مخلوق ہیں، جن کا مسکن آسمان ہے، جو اوامرالٰہی کے بجالانے اور اس کی تحمید وتقدیس میں مصروف رہتے ہیں اور اس کے کسی حکم سے سرتابی نہیں کرتے۔\n(2) خَلِيفَةٌ سے مراد ایسی قوم ہے جو ایک دوسرے کے بعد آئے گی اور یہ کہنا کہ انسان اس دنیا میں اللہ تعالیٰ کا خلیفہ اور نائب ہے غلط ہے۔\n(3) فرشتوں کا یہ کہنا حسد یا اعتراض کے طور پر نہیں تھا، بلکہ اس کی حقیقت اور حکمت معلوم کرنے کی غرض سے تھا کہ اے رب اس مخلوق کے پیدا کرنے میں کیا حکمت ہے، جب کہ ان میں کچھ ایسے لوگ بھی ہوں گے جو فساد پھیلائیں گے اور خون ریزی کریں گے؟ اگر مقصود یہ ہے کہ تیری عبادت ہو تو اس کام کے لئے ہم تو موجود ہیں، ہم سے وہ خطرات بھی نہیں جو نئی مخلوق سے متوقع ہیں۔ اللہ تعالیٰ نے فرمایا: ”میں وہ مصلحت راجحہ جانتا ہوں جس کی بنا پر ان ذکر کردہ مفاسد کے باوجود میں اسے پیدا کر رہا ہوں، جو تم نہیں جانتے۔“ کیوں کہ ان میں انبیا، شہدا، وصالحین اور زہاد بھی ہوں گے۔ (ابن کثیر)\nذریت آدم کی بابت فرشتوں کو کیسے علم ہوا کہ وہ فساد برپا کرے گی؟ اس کا اندازہ انہوں نے انسانی مخلوق سے پہلے کی مخلوق کے اعمال یا کسی اور طریقے سے کرلیا ہوگا۔ بعض نے کہا ہے کہ اللہ تعالیٰ نے ہی بتلا دیا تھا کہ وہ ایسے ایسے کام بھی کرے گی۔ یوں وہ کلام میں حذف مانتے ہیں کہ إِنِّي جَاعِلٌ فِي الأَرْضِ خَلِيفَةً يَفْعَلُ كَذَا وَكَذَا (فتح القدیر)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-idh qāla rabbuka lil'malāikati innī jāʿilun fī al-arḍi khalīfatan qālū atajʿalu fīhā man yuf'sidu fīhā wayasfiku al-dimāa wanaḥnu nusabbiḥu biḥamdika wanuqaddisu laka qāla innī aʿlamu mā lā taʿlamūna ","translations":["And when","said","your Lord","to the angels","Indeed, I (am)","going to place","in","the earth","a vicegerent","they said","Will You place","in it","(one) who","will spread corruption","in it","and will shed","[the] blood[s]","while we","[we] glorify (You)","with Your praises","and we sanctify","[to] You","He said","Indeed, I","[I] know","what","not","you know","(30)"],"transliterationArr":["wa-idh","qāla","rabbuka","lil'malāikati","innī","jāʿilun","fī","al-arḍi","khalīfatan","qālū","atajʿalu","fīhā","man","yuf'sidu","fīhā","wayasfiku","al-dimāa","wanaḥnu","nusabbiḥu","biḥamdika","wanuqaddisu","laka","qāla","innī","aʿlamu","mā","lā","taʿlamūna",null],"verseTiming":[[1,0,640],[2,640,1270],[3,1270,1970],[4,1970,4710],[5,4710,5860],[6,5860,7050],[7,7050,7690],[8,7690,8420],[9,8420,9820],[10,9820,12060],[11,12060,12980],[12,12980,13760],[13,13760,13940],[14,13940,14850],[15,14850,15490],[16,15490,16200],[17,16200,17150],[18,17150,19260],[19,19260,19910],[20,19910,20840],[21,20840,21770],[22,21770,22900],[23,22900,23090],[24,23090,24220],[25,24220,26620],[26,26620,27420],[27,27420,27810],[28,27810,28120],[29,28120,30475]]}}