{"name":"2:34","price":"اور جب ہم نے فرشتوں سے کہا کہ آدم کو سجده کرو(1) تو ابلیس کے سوا سب نے سجده کیا۔ اس نے انکار کیا(2) اور تکبر کیا اور وه کافروں میں ہوگیا۔(3)","arabic":"وَإِذۡ قُلۡنَا لِلۡمَلَٰٓئِكَةِ ٱسۡجُدُواْ لِأٓدَمَ فَسَجَدُوٓاْ إِلَّآ إِبۡلِيسَ أَبَىٰ وَٱسۡتَكۡبَرَ وَكَانَ مِنَ ٱلۡكَٰفِرِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":41,"juzNumber":1,"footnotes":"(1) علمی فضیلت کے بعد حضرت آدم (عليه السلام) کی یہ دوسری تکریم ہوئی۔ سجدہ کے معنی ہیں خضوع اور تذلل کے، اس کی انتہا ہے (زمین پر پیشانی کا ٹکا دینا) (قرطبی) یہ سجدہ شریعت اسلامیہ میں اللہ تعالیٰ کے سوا کسی کے لئے جائز نہیں ہے۔ نبی کریم (صلى الله عليه وسلم) کا مشہور فرمان ہے کہ اگر سجدہ کسی اور کے لئے جائز ہوتا تو میں عورت کو حکم دیتا کہ وہ اپنے خاوند کو سجدہ کرے۔ (سنن ترمذی) تاہم فرشتوں نے اللہ کے حکم پر حضرت آدم (عليه السلام) کو سجدہ کیا، جس سے ان کی تکریم وفضیلت فرشتوں پر واضح کردی گئی۔ کیوں کہ یہ سجدہ اکرام و تعظیم کے طور پر ہی تھا، نہ کہ عبادت کے طور پر۔ اب تعظیماً بھی کسی کو سجدہ نہیں کیا جاسکتا۔\n(2) ابلیس نے سجدے سے انکار کیا اور راندۂ درگاہ ہوگیا۔ ابلیس حسب صراحت قرآن جنات میں سے تھا، لیکن اللہ تعالیٰ نے اسے اعزازاً فرشتوں میں شامل کر رکھا تھا، اس لئےبحکم الٰہی اس کے لئے بھی سجدہ کرنا ضروری تھا، لیکن اس نے حسد اور تکبر کی بنا پر سجدہ کرنے سے انکار کردیا۔ گویا حسد اور تکبر وہ گناہ ہیں جن کا ارتکاب دنیائے انسانیت میں سب سے پہلے کیا گیا اور اس کا مرتکب ابلیس تھا۔\n(3) یعنی اللہ تعالیٰ کے علم و تقدیر میں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-idh qul'nā lil'malāikati us'judū liādama fasajadū illā ib'līsa abā wa-is'takbara wakāna mina al-kāfirīna ","translations":["And when","We said","to the angels","Prostrate","to Adam","[so] they prostrated","except","Iblis","He refused","and was arrogant","and became","of","the disbelievers","(34)"],"transliterationArr":["wa-idh","qul'nā","lil'malāikati","us'judū","liādama","fasajadū","illā","ib'līsa","abā","wa-is'takbara","wakāna","mina","al-kāfirīna",null],"verseTiming":[[1,0,650],[2,650,1440],[3,1440,4370],[4,4370,5120],[5,5120,6020],[6,6020,8200],[7,8200,10340],[8,10340,11240],[9,11240,11850],[10,11850,13000],[11,13000,13750],[12,13750,14050],[13,14050,16755]]}}