{"name":"2:37","price":"آدم (علیہ السلام) نے اپنے رب سے چند باتیں سیکھ لیں(1) اور اللہ تعالیٰ نے ان کی توبہ قبول فرمائی، بےشک وہی توبہ قبول کرنے واﻻ اور رحم کرنے واﻻ ہے۔","arabic":"فَتَلَقَّىٰٓ ءَادَمُ مِن رَّبِّهِۦ كَلِمَٰتٖ فَتَابَ عَلَيۡهِۚ إِنَّهُۥ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":44,"juzNumber":1,"footnotes":"(1) حضرت آدم (عليه السلام) جب پشیمانی میں ڈوبے دنیا میں تشریف لائے تو توبہ واستغفار میں مصروف ہوگئے۔ اس موقعے پر بھی اللہ تعالیٰ نے رہنمائی ودست گیری فرمائی اور وہ کلمات معافی سکھا دیئے جو (الاعراف) میں بیان کئے گئے ہیں «رَبَّنَا ظَلَمْنَا أَنْفُسَنَا وَإِنْ لَمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا» الآية بعض حضرات یہاں ایک موضوع روایت کا سہارا لیتے ہوئے کہتے ہیں کہ حضرت آدم نے عرش الٰہی پر ”لا إِلهَ إِلا اللهُ مُحَمَّدٌ رَّسُولُ اللهِ“ لکھا ہوا دیکھا اور محمد رسول اللہ کے وسیلے سے دعا مانگی تو اللہ تعالیٰ نے انہیں معاف فرما دیا۔ یہ روایت بےسند ہے اور قرآن کے بھی معارض ہے۔ علاوہ ازیں اللہ تعالیٰ کے بتلائے ہوئے طریقے کے بھی خلاف ہے۔ تمام انبیا (عليهم السلام) نے ہمیشہ براہ راست اللہ سے دعائیں کی ہیں، کسی نبی، ولی، بزرگ کا واسطہ اور وسیلہ نہیں پکڑا، اس لئے نبی کریم (صلى الله عليه وسلم) سمیت تمام انبیا کا طریقہ دعا یہی رہا ہے کہ بغیر کسی واسطے اور وسیلے کے اللہ کی بارگاہ میں دعا کی جائے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"fatalaqqā ādamu min rabbihi kalimātin fatāba ʿalayhi innahu huwa al-tawābu al-raḥīmu ","translations":["Then received","Adam","from","his Lord","words","So (his Lord) turned","towards him","Indeed He","He","(is) the Oft-returning (to mercy)","the Most Merciful","(37)"],"transliterationArr":["fatalaqqā","ādamu","min","rabbihi","kalimātin","fatāba","ʿalayhi","innahu","huwa","al-tawābu","al-raḥīmu",null],"verseTiming":[[1,0,2950],[2,2950,3720],[3,3720,3870],[4,3870,5020],[5,5020,6920],[6,6920,7630],[7,7630,10110],[8,10110,11700],[9,11700,12020],[10,12020,13180],[11,13180,15585]]}}