{"name":"2:39","price":"اور جو انکار کرکے ہماری آیتوں کو جھٹلائیں، وه جہنمی ہیں اور ہمیشہ اسی میں رہیں گے۔(1)","arabic":"وَٱلَّذِينَ كَفَرُواْ وَكَذَّبُواْ بِـَٔايَٰتِنَآ أُوْلَٰٓئِكَ أَصۡحَٰبُ ٱلنَّارِۖ هُمۡ فِيهَا خَٰلِدُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":46,"juzNumber":1,"footnotes":"(1) قبولیت دعا کے باوجود اللہ تعالیٰ نے انہیں دوبارہ جنت میں آباد کرنے کے بجائے دنیا میں ہی رہ کر جنت کے حصول کی تلقین فرمائی اور حضرت آدم (عليه السلام) کے واسطے سے تمام بنو آدم کو جنت کا یہ راستہ بتلایا جارہا ہے کہ انبیا (عليهم السلام)کے ذریعے سے میری ہدایت (زندگی گزارنے کے احکام وضابطے) تم تک پہنچے گی، جو اس کو قبول کرے گا وہ جنت کا مستحق، اور بصورت دیگر عذاب الٰہی کا سزاوار ہوگا۔ (ان پر خوف نہیں ہوگا) کا تعلق آخرت سے ہے۔ أيْ: فِيمَا يَسْتَقْبِلُونَهُ مِنْ أَمْرِ الآخِرَةِ۔ اور (حزن نہیں ہوگا) کا تعلق دنیا سے۔ عَلَى مَا فَاتَهُمْ مِنْ أُمُورِ الدُّنْيَا (جو فوت ہوگیا امور دنیا سے یا اپنے پیچھے دنیا میں چھوڑ آئے) جس طرح دوسرے مقام پر ہے، فَمَنِ اتَّبَعَ هُدَايَ فَلا يَضِلُّ وَلا يَشْقَى (طٰہ: 123) جس نے میری ہدایت کی پیروی کی، پس وہ (دنیا میں) گمراہ ہوگا اور نہ (آخرت میں) بدبخت۔) (ابن کثیر) گویا «لا خَوْفٌ عَلَيْهِمْ وَلا هُمْ يَحْزَنُونَ» کا مقام ہر مومن صادق کو حاصل ہے۔ یہ کوئی ایسا مقام نہیں جو صرف بعض اولیاء اللہ ہی کو حاصل ہو اور پھر اس ”مقام“ کا مفہوم بھی کچھ کا کچھ بیان کیا جاتا ہے۔ حالانکہ تمام مومنین و متقین بھی ”اولیاء اللہ“ ہیں اولیاء اللہ کوئی الگ مخلوق نہیں۔ ہاں البتہ اولیاء کے درجات میں فرق ہوسکتا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-alladhīna kafarū wakadhabū biāyātinā ulāika aṣḥābu al-nāri hum fīhā khālidūna ","translations":["And those","who disbelieve[d]","and deny","Our Signs","those","(are the) companions","(of) the Fire","they","in it","(will) abide forever","(39)"],"transliterationArr":["wa-alladhīna","kafarū","wakadhabū","biāyātinā","ulāika","aṣḥābu","al-nāri","hum","fīhā","khālidūna",null],"verseTiming":[[1,0,1150],[2,1150,1980],[3,1980,3080],[4,3080,5900],[5,5900,8260],[6,8260,9120],[7,9120,12790],[8,12790,13190],[9,13190,14060],[10,14060,17475]]}}