{"name":"2:40","price":"اے بنی اسرائیل!(1) میری اس نعمت کو یاد کرو جو میں نے تم پر انعام کی اور میرے عہد کو پورا کرو میں تمہارے عہد کو پورا کروں گا اور مجھ ہی سے ڈرو۔","arabic":"يَٰبَنِيٓ إِسۡرَٰٓءِيلَ ٱذۡكُرُواْ نِعۡمَتِيَ ٱلَّتِيٓ أَنۡعَمۡتُ عَلَيۡكُمۡ وَأَوۡفُواْ بِعَهۡدِيٓ أُوفِ بِعَهۡدِكُمۡ وَإِيَّٰيَ فَٱرۡهَبُونِ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":47,"juzNumber":1,"footnotes":"(1) إِسْرَائِيلُ (بمعنی عبداللہ) حضرت یعقوب (عليه السلام) کا لقب تھا۔ یہود کو بنواسرائیل کہا جاتا ہے یعنی یعقوب (عليه السلام) کی اولاد۔ کیونکہ حضرت یعقوب (عليه السلام) کے بارہ بیٹے تھے، جن سے یہود کے بارہ قبیلے بنے اور ان میں بکثرت انبیا ورسل ہوئے۔ یہود کو عرب میں اس کی گزشتہ تاریخ اور علم و مذہب سے وابستگی کی وجہ سے ایک خاص مقام حاصل تھا۔ اس لئے انہیں گزشتہ انعامات الٰہی یاد کرا کے کہا جارہا ہے کہ تم میرا وہ عہد پورا کرو جو تم سے نبی آخرالزمان کی نبوت اور ان پر ایمان لانے کی بابت لیا گیا تھا۔ اگر تم اس عہد کو پورا کروگے تو میں بھی اپنا عہد پورا کروں گا کہ تم سے وہ بوجھ اتاردیئے جائیں گے جو تمہاری غلطیوں اور کوتاہیوں کی وجہ سے بطور سزا تم پر لاد دیئے گئے تھے اور تمہیں دوبارہ عروج عطا کیا جائے گا۔ اور مجھ سے ڈرو کہ میں تمہیں مسلسل اس ذلت وادبار میں مبتلا رکھ سکتا ہوں جس میں تم بھی مبتلا ہو اور تمہارے آبا واجداد بھی مبتلا رہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yābanī is'rāīla udh'kurū niʿ'matiya allatī anʿamtu ʿalaykum wa-awfū biʿahdī ūfi biʿahdikum wa-iyyāya fa-ir'habūni ","translations":["O Children","(of) Israel","Remember","My Favor","which","I bestowed","upon you","and fulfill","My Covenant","I will fulfill","your covenant","and Me Alone","fear [Me]","(40)"],"transliterationArr":["yābanī","is'rāīla","udh'kurū","niʿ'matiya","allatī","anʿamtu","ʿalaykum","wa-awfū","biʿahdī","ūfi","biʿahdikum","wa-iyyāya","fa-ir'habūni",null],"verseTiming":[[1,0,2650],[2,2650,5480],[3,5480,6240],[4,6240,7220],[5,7220,9170],[6,9170,10080],[7,10080,11060],[8,11060,11980],[9,11980,13500],[10,13500,14400],[11,14400,16570],[12,16570,17120],[13,17120,18320],[14,18320,19390],[15,19390,21815]]}}