{"name":"2:47","price":"اے اوﻻد یعقوب! میری اس نعمت کو یاد کرو جو میں نے تم پر انعام کی اور میں نے تمہیں تمام جہانوں پر فضیلت دی۔(1)","arabic":"يَٰبَنِيٓ إِسۡرَٰٓءِيلَ ٱذۡكُرُواْ نِعۡمَتِيَ ٱلَّتِيٓ أَنۡعَمۡتُ عَلَيۡكُمۡ وَأَنِّي فَضَّلۡتُكُمۡ عَلَى ٱلۡعَٰلَمِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":54,"juzNumber":1,"footnotes":"(1) یہاں سے دوبارہ بنی اسرائیل کو وہ انعامات یاد کرائے جارہے ہیں، جو ان پر کئے گئے اور ان کو قیامت کے دن سے ڈرایا جارہا ہے، جس دن نہ کوئی کسی کے کام آئے گا، نہ سفارش قبول ہوگی، نہ معاوضہ دے کر چھٹکارا ہوسکے گا، نہ کوئی مددگار آگے آئے گا۔ ایک انعام یہ بیان فرمایا کہ ان کو تمام جہانوں پر فضیلت دی گئی، یعنی امت محمدیہ سے پہلے افضل العالمین ہونے کی یہ فضیلت بنواسرائیل کو حاصل تھی جو انہوں نے معصیت الٰہی کا ارتکاب کرکے گنوالی اور امت محمدیہ کو خَيْرُ أُمَّةٍ کے لقب سے نوازا گیا۔ اس میں اس امر پر تنبیہ ہے کہ انعامات الٰہی کسی خاص نسل کے ساتھ وابستہ نہیں ہیں، بلکہ یہ ایمان اور عمل کی بنیاد پر ملتے ہیں، اور ایمان و عمل سے محرومی پر سلب کر لئے جاتے ہیں، جس طرح امت محمدیہ کی اکثریت بھی اس وقت اپنی بدعملیوں اور شرک وبدعات کے ارتکاب کی وجہ سے ”خَيْرُ أُمَّةٍ“ کے بجائے ”شَرُّ أمَّةٍ“ بنی ہوئی ہے۔ هَدَاهَا اللهُ تَعَالى\nیہود کو یہ دھوکہ بھی تھا کہ ہم تو اللہ کے محبوب اور چہیتے ہیں، اس لئے مواخذہ آخرت سے محفوظ رہیں گے، اللہ تعالیٰ نے فرما دیا کہ وہاں اللہ کے نافرمانوں کو کوئی سہارا نہیں دے سکے گا، اسی فریب میں امت محمدیہ بھی مبتلا ہے اور مسئلہ شفاعت کو (جو اہل سنت کے یہاں مسلمہ ہے) اپنی بدعملی کا جواز بنا رکھا ہے۔ نبی (صلى الله عليه وسلم) یقیناً شفاعت فرمائیں گے اور اللہ تعالیٰ ان کی شفاعت قبول بھی فرمائے گا (احادیث صحیحہ سے یہ ثابت ہے) لیکن یہ بھی احادیث میں آتا ہے کہ إِحْدَاثٌ فِي الدِّينِ (بدعات) کے مرتکب اس سے محروم ہی رہیں گے۔ نیز بہت سے گناہ گاروں کو جہنم میں سزا دینے کے بعد آپ (صلى الله عليه وسلم) کی شفاعت پر جہنم سے نکالا جائے گا، کیا جہنم کی یہ چند روزہ سزا قابل برداشت ہے کہ ہم شفاعت پر تکیہ کرکے معصیت کا ارتکاب کرتے رہیں؟","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yābanī is'rāīla udh'kurū niʿ'matiya allatī anʿamtu ʿalaykum wa-annī faḍḍaltukum ʿalā al-ʿālamīna ","translations":["O Children","(of) Israel","Remember","My Favor","which","I bestowed","upon you","and that I","[I] preferred you","over","the worlds","(47)"],"transliterationArr":["yābanī","is'rāīla","udh'kurū","niʿ'matiya","allatī","anʿamtu","ʿalaykum","wa-annī","faḍḍaltukum","ʿalā","al-ʿālamīna",null],"verseTiming":[[1,0,2450],[2,2450,5440],[3,5440,6270],[4,6270,7220],[5,7220,9190],[6,9190,10140],[7,10140,11180],[8,11180,12660],[9,12660,14060],[10,14060,14470],[11,14470,17265]]}}