{"name":"2:62","price":"مسلمان ہوں، یہودی(1) ہوں، نصاریٰ(2) ہوں یا صابی(3) ہوں، جو کوئی بھی اللہ تعالیٰ پر اور قیامت کے دن پر ایمان ﻻئے اور نیک عمل کرے ان کے اجر ان کے رب کے پاس ہیں اور ان پر نہ تو کوئی خوف ہے اور نہ اداسی(4)","arabic":"إِنَّ ٱلَّذِينَ ءَامَنُواْ وَٱلَّذِينَ هَادُواْ وَٱلنَّصَٰرَىٰ وَٱلصَّٰبِـِٔينَ مَنۡ ءَامَنَ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِ وَعَمِلَ صَٰلِحٗا فَلَهُمۡ أَجۡرُهُمۡ عِندَ رَبِّهِمۡ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":69,"juzNumber":1,"footnotes":"(1) يَهُود هَوَادَةٌ (بمعنی محبت) سے یا تَهَوّدٌ (بمعنی توبہ) سے بنا ہے۔ گویا ان کا یہ نام اصل میں توبہ کرنے یا ایک دوسرے کے ساتھ محبت رکھنے کی وجہ سے پڑا۔ تاہم موسیٰ (عليه السلام) کے ماننے والوں کو یہود کہا جاتا ہے۔\n(2) نَصَارَى، نَصْرَانٌ کی جمع ہے۔ جیسے سُكَارَى سَكْرَانُ کی جمع ہے۔ اس کا مادہ نصرت ہے۔ آپس میں ایک دوسرے کی مدد کرنے کی وجہ سے ان کا نام پڑا، ان کو انصار بھی کہا جاتا ہے جیسا کہ انہوں نے حضرت عیسیٰ (عليه السلام) کو کہا تھا: «نَحْنُ أَنْصَارُ اللَّهِ» حضرت عیسیٰ (عليه السلام) کے پیروکاروں کو نصاریٰ کہا جاتا ہے، جن کو عیسائی بھی کہتے ہیں۔\n(3) صَابِئِينَ صَابِئٌ کی جمع ہے۔ یہ لوگ وہ ہیں جو یقیناً ابتداءً کسی دین حق کے پیرو رہے ہوں گے (اسی لئے قرآن میں یہودیت و عیسائیت کے ساتھ ان کا ذکر کیا گیا ہے) لیکن بعد میں ان کے اندر فرشتہ پرستی اور ستارہ پرستی آگئی، یا یہ کسی بھی دین کے پیرو نہ رہے۔ اسی لئے لا مذہب لوگوں کو صابی کہا جانے لگا۔\n(4) بعض جدید مفسرین کو اس آیت کا مفہوم سمجھنے میں بڑی غلطی لگی ہے اور اس سے انہوں نے وحدت ادیان کا فلسفہ کشید کرنے کی مذموم سعی کی ہے۔ یعنی رسالت محمدیہ پر ایمان لانا ضروری نہیں ہے، بلکہ جو بھی جس دین کو مانتا ہے اور اس کے مطابق ایمان رکھتا اور اچھے عمل کرتا ہے، اس کی نجات ہوجائے گی، یہ فلسفہ سخت گمراہ کن ہے، آیت کی صحیح تفسیر یہ ہے کہ جب اللہ تعالیٰ نے سابقہ آیات میں یہود کی بدعلمیوں اور سرکشیوں اور اس کی بنا پر ان کے مستحق عذاب ہونے کا تذکرہ فرمایا تو ذہن میں اشکال پیدا ہوسکتا تھا کہ ان یہود میں جو لوگ صحیح، کتاب الٰہی کے پیرو اور اپنے پیغمبر کی ہدایات کے مطابق زندگی گزارنے والے تھے، ان کے ساتھ اللہ تعالیٰ نے کیا معاملہ فرمایا؟ یا کیا معاملہ فرمائے گا؟ اللہ تعالیٰ نے اس کی وضاحت فرمادی کہ صرف یہودی ہی نہیں، نصاریٰ اور صابی بھی اپنے اپنے وقت میں جنہوں نے اللہ پر اور یوم آخرت پر ایمان رکھا اور عمل صالح کرتے رہے، وہ سب نجات اخروی سے ہمکنار ہوں گے اور اسی طرح اب رسالت محمدیہ پر ایمان لانے والے مسلمان بھی اگر صحیح طریقے سے ایمان باللہ والیوم الآخر اور عمل صالح کا اہتمام کریں تو یہ بھی یقیناً آخرت کی ابدی نعمتوں کے مستحق قرار پائیں گے۔ نجات اخروی میں کسی کے ساتھ امتیاز نہیں کیا جائے گا۔\nوہاں بےلاگ فیصلہ ہوگا۔ چاہے مسلمان ہوں یا رسول آخرالزمان (صلى الله عليه وسلم) سے پہلے گزر جانے والے یہودی، عیسائی اور صابی وغیرھم۔ اس کی تائید بعض مرسل آثار سے ہوتی ہے، مثلاً مجاہد حضرت سلمان فارسی! سے نقل کرتے ہیں جس میں وہ کہتے ہیں کہ میں نے نبی (صلى الله عليه وسلم) سے ان اہل دین کے بارے میں پوچھا جو میرے ساتھی تھے، عبادت گزار اور نمازی تھے (یعنی رسالت محمدیہ سے قبل وہ اپنے دین کے پابند تھے) تو اس موقعے پر یہ آیت نازل ہوئی۔ «إِنَّ الَّذِينَ آمَنُوا وَالَّذِينَ هَادُوا»۔ الآیۃ (ابن کثیر) قرآن کریم کے دوسرے مقامات سے اس کی مزید تائید ہوتی ہے مثلاً «إِنَّ الدِّينَ عِنْدَ اللَّهِ الإِسْلامُ» (آل عمران: 19) اللہ کے نزدیک دین صرف اسلام ہی ہے۔ «وَمَنْ يَبْتَغِ غَيْرَ الإِسْلامِ دِينًا فَلَنْ يُقْبَلَ مِنْهُ» (آل عمران: 85) جواسلام کے سوا کسی اور دین کا متلاشی ہوگا، وہ ہرگز مقبول نہیں ہوگا اور احادیث میں بھی نبی (صلى الله عليه وسلم) نے وضاحت فرمادی کہ اب میری رسالت پر ایمان لائے بغیر کسی شخص کی نجات نہیں ہوسکتی، مثلاً فرمایا: «والَّذِي نَفْسِي بِيَدِه! لا يَسْمَعُ بِي رَجَلٌ مِنْ هَذِهِ الأُمَّةِ يَهُودِيٌّ وَّلا نَصْرَانِيٌّ ثُمّ لا يُؤْمِنُ بِي إِلا دَخَل النَّارَ» (صحيح مسلم ، كتاب الإيمان ، باب وجوب الإيمان برسالة نبينا محمد (صلى الله عليه وسلم) ) ”قسم ہے اس ذات کی جس کے ہاتھ میں میری جان ہے میری اس امت میں جو شخص بھی میری بابت سن لے، وہ یہودی ہو یا عیسائی، پھر وہ مجھ پر ایمان نہ لائے تو وہ جہنم میں جائے گا۔“ اس کا مطلب یہ ہے کہ وحدت ادیان کی گمراہی، جہاں دیگر آیات قرآنی کو نظرانداز کرنے کا نتیجہ ہے، وہاں احادیث کے بغیر قرآن کو سمجھنے کی مذموم سعی کا بھی اس میں بہت دخل ہے۔ اسی لئے یہ کہنا بالکل صحیح ہے کہ احادیث صحیحہ کے بغیر قرآن کو نہیں سمجھا جاسکتا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"inna alladhīna āmanū wa-alladhīna hādū wal-naṣārā wal-ṣābiīna man āmana bil-lahi wal-yawmi al-ākhiri waʿamila ṣāliḥan falahum ajruhum ʿinda rabbihim walā khawfun ʿalayhim walā hum yaḥzanūna ","translations":["Indeed","those who","believed","and those who","became Jews","and the Christians","and the Sabians ","who","believed","in Allah","and the Day","[the] Last","and did","righteous deeds","so for them","their reward","(is) with","their Lord","and no","fear","on them","and not","they","will grieve","(62)"],"transliterationArr":["inna","alladhīna","āmanū","wa-alladhīna","hādū","wal-naṣārā","wal-ṣābiīna","man","āmana","bil-lahi","wal-yawmi","al-ākhiri","waʿamila","ṣāliḥan","falahum","ajruhum","ʿinda","rabbihim","walā","khawfun","ʿalayhim","walā","hum","yaḥzanūna",null],"verseTiming":[[1,0,1290],[2,1290,2220],[3,2220,3270],[4,3270,4280],[5,4280,5150],[6,5150,7340],[7,7340,8820],[8,8820,9160],[9,9160,9850],[10,9850,10950],[11,10950,11850],[12,11850,12780],[13,12780,13470],[14,13470,15050],[15,15050,15760],[16,15760,17150],[17,17150,17880],[18,17880,18820],[19,18820,19980],[20,19980,20930],[21,20930,21450],[22,21450,22180],[23,22180,23190],[24,23190,23780],[25,23780,24130],[26,24130,26865]]}}