{"name":"2:7","price":"اللہ تعالیٰ نے ان کے دلوں پر اور ان کے کانوں پر مہر کر دی ہے اور ان کی آنکھوں پر پرده ہے اور ان کے لئے بڑا عذاب ہے۔(1)","arabic":"خَتَمَ ٱللَّهُ عَلَىٰ قُلُوبِهِمۡ وَعَلَىٰ سَمۡعِهِمۡۖ وَعَلَىٰٓ أَبۡصَٰرِهِمۡ غِشَٰوَةٞۖ وَلَهُمۡ عَذَابٌ عَظِيمٞ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":14,"juzNumber":1,"footnotes":"(1) یہ ان کے عدم ایمان کی وجہ بیان کی گئی ہے کہ چونکہ کفرومعصیت کے مسلسل ارتکاب کی وجہ سے ان کے دلوں سے قبول حق کی استعداد ختم ہوچکی ہے، ان کے کان حق بات سننے کے لئے آمادہ نہیں اور ان کی نگاہیں کائنات میں پھیلی ہوئی رب کی نشانیاں دیکھنے سے محروم ہیں تو اب وہ ایمان کس طرح لاسکتے ہیں؟ ایمان تو ان ہی لوگوں کے حصے میں آتا ہے، جو اللہ تعالیٰ کی دی ہوئی صلاحیتوں کا صحیح استعمال کرتے اور ان سے معرفت کردگار حاصل کرتے ہیں۔ اس کے برعکس لوگ تو اس حدیث کا مصداق ہیں جس میں بیان کیا گیا ہے کہ مومن جب گناہ کر بیٹھتا ہے تو اس کے دل میں سیاہ نقطہ پڑ جاتا ہے، اگر وہ توبہ کرکے گناہ سے باز آجاتا ہے تو اس کا دل پہلے کی طرح صاف شفاف ہوجاتا ہے اور اگر وہ توبہ کی بجائے گناہ پر گناہ کرتا جاتا ہے تو وہ نقطہ سیاہ پھیل کر اس کے پورے دل پر چھا جاتا ہے۔ نبی (صلى الله عليه وسلم) نے فرمایا: ”یہی وہ زنگ ہے جسے اللہ تعالیٰ نے بیان فرمایا ہے «كَلَّاۖ بَلۡۜ رَانَ عَلَىٰ قُلُوبِهِم مَّا كَانُواْ يَكۡسِبُونَ» (المطففين: 14) یعنی ”ان کے کرتوتوں کی وجہ سے ان کے دلوں پر زنگ چڑھ گیا ہے۔“ (ترمذی، تفسیر سورۂ مطففین) اسی کیفیت کو قرآن نے ”ختم“ (مہر لگ جانے) سے تعبیر فرمایا ہے، جو ان کی مسلسل بداعمالیوں کا منطقی نتیجہ ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"khatama al-lahu ʿalā qulūbihim waʿalā samʿihim waʿalā abṣārihim ghishāwatun walahum ʿadhābun ʿaẓīmun ","translations":["Has set a seal","Allah","on","their hearts","and on","their hearing","and on","their vision","(is) a veil","And for them","(is) a punishment","great","(7)"],"transliterationArr":["khatama","al-lahu","ʿalā","qulūbihim","waʿalā","samʿihim","waʿalā","abṣārihim","ghishāwatun","walahum","ʿadhābun","ʿaẓīmun",null],"verseTiming":[[1,0,680],[2,680,1460],[3,1460,1980],[4,1980,3190],[5,3190,3890],[6,3890,5270],[7,5270,6940],[8,6940,8230],[9,8230,9270],[10,9270,10320],[11,10320,11290],[12,11290,13235]]}}