{"name":"2:72","price":"جب تم نے ایک شخص کو قتل کر ڈاﻻ، پھر اس میں اختلاف کرنے لگے اور تمہاری پوشیدگی کو اللہ تعالیٰ ﻇاہر کرنے واﻻ تھا۔(1)","arabic":"وَإِذۡ قَتَلۡتُمۡ نَفۡسٗا فَٱدَّٰرَٰءۡتُمۡ فِيهَاۖ وَٱللَّهُ مُخۡرِجٞ مَّا كُنتُمۡ تَكۡتُمُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":79,"juzNumber":1,"footnotes":"(1) یہ قتل کا وہی واقعہ ہے جس کی بنا پر بنی اسرائیل کو گائے ذبح کرنے کا حکم دیا گیا تھا اور اس طرح اللہ تعالیٰ نے اس قتل کا راز فاش کردیا، دراں حالیکہ وہ قتل رات کی تاریکی میں لوگوں سے چھپ کرکیا گیا تھا۔ مطلب یہ ہوا کہ نیکی یا بدی تم کتنی بھی چھپ کر کرو، اللہ کے علم میں ہے اور اللہ تعالیٰ اسے لوگوں پر ظاہر کرنے کی قدرت رکھتا ہے۔ اس لئے خلوت ہو یا جلوت ہر وقت اور ہر جگہ اچھے کام ہی کیا کرو تاکہ اگر وہ کسی وقت ظاہر ہوجائیں اور لوگوں کے علم میں بھی آجائیں تو شرمندگی نہ ہو، بلکہ اس کے احترام ووقار میں اضافہ ہی ہو اور بدی کتنی بھی چھپ کر کیوں نہ کی جائے، اس کے فاش ہونے کا امکان ہے جس سے انسان کی بدنامی اور ذلت ورسوائی ہوتی ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-idh qataltum nafsan fa-iddāratum fīhā wal-lahu mukh'rijun mā kuntum taktumūna ","translations":["And when","you killed","a man","then you disputed","concerning it","but Allah","(is) the One Who brought forth","what","you were","concealing","(72)"],"transliterationArr":["wa-idh","qataltum","nafsan","fa-iddāratum","fīhā","wal-lahu","mukh'rijun","mā","kuntum","taktumūna",null],"verseTiming":[[1,0,690],[2,690,1700],[3,1700,3030],[4,3030,4650],[5,4650,5430],[6,5430,6440],[7,6440,7240],[8,7240,8240],[9,8240,9840],[10,9840,12935]]}}