{"name":"2:73","price":"ہم نے کہا کہ اس گائے کا ایک ٹکڑا مقتول کے جسم پر لگا دو، (وه جی اٹھے گا) اسی طرح اللہ مردوں کو زنده کرکے تمہیں تمہاری عقل مندی کے لئے اپنی نشانیاں دکھاتا ہے۔(1)","arabic":"فَقُلۡنَا ٱضۡرِبُوهُ بِبَعۡضِهَاۚ كَذَٰلِكَ يُحۡيِ ٱللَّهُ ٱلۡمَوۡتَىٰ وَيُرِيكُمۡ ءَايَٰتِهِۦ لَعَلَّكُمۡ تَعۡقِلُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":80,"juzNumber":1,"footnotes":"(1) مقتول کے دوبارہ جی اٹھنے سے استدلال کرتے ہوئے اللہ تعالیٰ روز قیامت تمام انسانوں کو دوبارہ زندہ کرنے کی قدرت کا اعلان فرما رہا ہے۔ قیامت کے دن دوبارہ مردوں کا زندہ ہونا، منکرین قیامت کے لئے ہمیشہ حیرت واستعجاب کا باعث رہا ہے، اس لئے اللہ تعالیٰ نے اس مسئلے کو بھی قرآن کریم میں جگہ جگہ مختلف اسلوب اور پیرائے میں بیان فرمایا ہے سورہ بقرۂ میں ہی اللہ تعالیٰ نے اس کی پانچ مثالیں بیان فرمائی ہیں۔ ایک مثال: «ثُمَّ بَعَثْنَاكُمْ مِنْ بَعْدِ مَوْتِكُمْ» (البقرۂ :56) میں گزر چکی ہے۔ دوسری مثال یہی قصہ ہے۔ تیسری مثال دوسرے پارے کی آیت نمبر 243 «مُوتُوا ثُمَّ أَحْيَاهُمْ» چوتھی آیت نمبر 259 «فَأَمَاتَهُ اللَّهُ مِائَةَ عَامٍ ثُمَّ بَعَثَهُ» اور پانچویں مثال اس کے بعد والی آیت میں حضرت ابراہیم (عليه السلام) کے طیور اربعہ (چار چڑیوں) کی ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"faqul'nā iḍ'ribūhu bibaʿḍihā kadhālika yuḥ'yī al-lahu al-mawtā wayurīkum āyātihi laʿallakum taʿqilūna ","translations":["So We said","Strike him","with a part of it","Like this","revives","Allah","the dead","and shows you","His Signs","perhaps you may","use your intellect","(73)"],"transliterationArr":["faqul'nā","iḍ'ribūhu","bibaʿḍihā","kadhālika","yuḥ'yī","al-lahu","al-mawtā","wayurīkum","āyātihi","laʿallakum","taʿqilūna",null],"verseTiming":[[1,0,920],[2,920,2000],[3,2000,3220],[4,3220,4600],[5,4600,5230],[6,5230,5980],[7,5980,6960],[8,6960,8140],[9,8140,9490],[10,9490,10680],[11,10680,13255]]}}