{"name":"2:8","price":"بعض لوگ کہتے ہیں کہ ہم اللہ تعالیٰ پر اور قیامت کے دن پر ایمان رکھتے ہیں، لیکن درحقیقت وه ایمان والے نہیں ہیں۔(1)","arabic":"وَمِنَ ٱلنَّاسِ مَن يَقُولُ ءَامَنَّا بِٱللَّهِ وَبِٱلۡيَوۡمِ ٱلۡأٓخِرِ وَمَا هُم بِمُؤۡمِنِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":15,"juzNumber":1,"footnotes":"(1) یہاں سے تیسرے گروہ منافقین کا تذکرہ شروع ہوتا ہے جن کے دل تو ایمان سے محروم تھے، مگر وہ اہل ایمان کو فریب دینے کے لئے زبان سے ایمان کا اظہار کرتے تھے، اللہ تعالیٰ نے فرمایا کہ وہ نہ اللہ کو دھوکہ دینے میں کامیاب ہو سکتے ہیں، کیوں کہ وہ تو سب کچھ جانتا ہے اور نہ اہل ایمان کو مستقل فریب میں رکھ سکتے ہیں، کیوں کہ اللہ تعالیٰ وحی کے ذریعے سے مسلمانوں کو ان کی فریب کاریوں سے آگاہ فرما دیتا تھا۔ یوں اس فریب کاری کا سارا نقصان خود ان ہی کو پہنچا کہ انہوں نے اپنی عاقبت برباد کرلی اور دنیا میں بھی رسوا ہوئے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wamina al-nāsi man yaqūlu āmannā bil-lahi wabil-yawmi al-ākhiri wamā hum bimu'minīna ","translations":["And of","the people","(are some) who","say","We believed","in Allah","and in the Day","[the] Last","but not","they","(are) believers (at all)","(8)"],"transliterationArr":["wamina","al-nāsi","man","yaqūlu","āmannā","bil-lahi","wabil-yawmi","al-ākhiri","wamā","hum","bimu'minīna",null],"verseTiming":[[1,0,590],[2,590,1920],[3,1920,2170],[4,2170,3510],[5,3510,5030],[6,5030,6050],[7,6050,7130],[8,7130,8050],[9,8050,8640],[10,8640,9610],[11,9610,11985]]}}