{"name":"2:84","price":"اورجب ہم نے تم سے وعده لیا کہ آپس میں خون نہ بہانا (قتل نہ کرنا) اور آپس والوں کو جلا وطن نہ کرنا، تم نے اقرار کیا اور تم اس کے شاہد بنے۔(1)","arabic":"وَإِذۡ أَخَذۡنَا مِيثَٰقَكُمۡ لَا تَسۡفِكُونَ دِمَآءَكُمۡ وَلَا تُخۡرِجُونَ أَنفُسَكُم مِّن دِيَٰرِكُمۡ ثُمَّ أَقۡرَرۡتُمۡ وَأَنتُمۡ تَشۡهَدُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":91,"juzNumber":1,"footnotes":"(1) ان آیات میں پھر وہ عہد بیان کیا جارہا ہے جو بنی اسرائیل سے لیا گیا، لیکن اس سے بھی انہوں نے اعراض ہی کیا۔ اس عہد میں اولاً صرف ایک اللہ کی عبادت کی تاکید ہے جو ہر نبی کی بنیادی اور اولین دعوت رہی ہے (جیسا کہ سورۂ الانبیاء آیت اور دیگر آیات سے واضح ہے) اس کے بعد والدین کے ساتھ حسن سلوک کا حکم ہے اللہ کی عبادت کے بعد دوسرے نمبر پر والدین کی اطاعت وفرماں برداری اور ان کےساتھ حسن سلوک کی تاکید سے واضح کردیا گیا کہ جس طرح اللہ کی عبادت بہت ضروری ہے، اسی طرح اس کے بعد والدین کی اطاعت بھی بہت ضروری ہے اور اس میں کوتاہی کی کوئی گنجائش نہیں ہے۔ قرآن میں متعدد مقامات پر اللہ تبارک وتعالیٰ نے اپنی عبادت کے بعد دوسرے نمبر پر والدین کی اطاعت کا ذکر کرکے اس کی اہمیت کو واضح کردیا ہے، اس کے بعد رشتے داروں، یتیموں اور مساکین کے ساتھ حسن سلوک کی تاکید اور حسن گفتار کا حکم ہے، اسلام میں بھی ان باتوں کی بڑی تاکید ہے، جیسا کہ احادیث رسول (صلى الله عليه وسلم) سے واضح ہے۔ اس عہد میں اقامت صلٰوۃ اور ایتائے زکٰوۃ کا بھی حکم ہے۔ جس سے معلوم ہوتا ہے کہ یہ دونوں عبادتیں پچھلی شریعتوں میں بھی موجود رہی ہیں جن سے ان کی اہمیت واضح ہے۔ اسلام میں بھی یہ دونوں عبادتیں نہایت اہم ہیں، حتیٰ کہ ان میں سے کسی ایک کے ا نکار، یا اس سے اعراض کو کفر کے مترادف سمجھا گیا ہے، جیسا کہ حضرت ابوبکر صدیق (رضي الله عنه) کے عہد خلافت میں مانعین زکوٰۃ کے خلاف جہاد کرنے سے واضح ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-idh akhadhnā mīthāqakum lā tasfikūna dimāakum walā tukh'rijūna anfusakum min diyārikum thumma aqrartum wa-antum tashhadūna ","translations":["And when","We took","your covenant","Not","will you shed","your blood","and not","(will) evict","yourselves","from","your homes","then","you ratified","while you","(were) witnessing","(84)"],"transliterationArr":["wa-idh","akhadhnā","mīthāqakum","lā","tasfikūna","dimāakum","walā","tukh'rijūna","anfusakum","min","diyārikum","thumma","aqrartum","wa-antum","tashhadūna",null],"verseTiming":[[1,0,660],[2,660,1610],[3,1610,2920],[4,2920,3280],[5,3280,4460],[6,4460,7130],[7,7130,7650],[8,7650,8790],[9,8790,10440],[10,10440,11880],[11,11880,13030],[12,13030,14410],[13,14410,15640],[14,15640,17150],[15,17150,19575]]}}