{"name":"2:86","price":"یہ وه لوگ ہیں جنہوں نے دنیا کی زندگی کو آخرت کے بدلے خرید لیا ہے، ان کے نہ تو عذاب ہلکے ہوں گے اور نہ ان کی مدد کی جائے گی۔(1)","arabic":"أُوْلَٰٓئِكَ ٱلَّذِينَ ٱشۡتَرَوُاْ ٱلۡحَيَوٰةَ ٱلدُّنۡيَا بِٱلۡأٓخِرَةِۖ فَلَا يُخَفَّفُ عَنۡهُمُ ٱلۡعَذَابُ وَلَا هُمۡ يُنصَرُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":93,"juzNumber":1,"footnotes":"(1) یہ شریعت کے کسی حکم کے مان لینے اور کسی کو نظرانداز کردینے کی سزا بیان کی جارہی ہے۔ اس کی سزا دنیا میں عزت وسرفرازی کی جگہ (جو مکمل شریعت پر عمل کرنے کا نتیجہ ہے) ذلت ورسوائی اور آخرت میں ابدی نعمتوں کے بجائے سخت عذاب ہے۔ اس سے معلوم ہوا کہ اللہ کے ہاں وہ اطاعت مقبول ہے جو مکمل ہو، بعض بعض باتوں کا مان لینا، یا ان پر عمل کرلینا اللہ تعالیٰ کے ہاں اس کی کوئی اہمیت نہیں۔ یہ آیت ہم مسلمانوں کو بھی دعوت غوروفکر دے رہی ہے کہ کہیں مسلمانوں کی ذلت ورسوائی کی وجہ بھی مسلمانوں کا وہی کردار تو نہیں جو مذکورہ آیات میں یہودیوں کا بیان کیا گیا ہے؟","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"ulāika alladhīna ish'tarawū al-ḥayata al-dun'yā bil-ākhirati falā yukhaffafu ʿanhumu al-ʿadhābu walā hum yunṣarūna ","translations":["Those","(are) the ones who","bought","the life","(of) the world","for the Hereafter","so not","will be lightened","for them","the punishment","and not","they","will be helped","(86)"],"transliterationArr":["ulāika","alladhīna","ish'tarawū","al-ḥayata","al-dun'yā","bil-ākhirati","falā","yukhaffafu","ʿanhumu","al-ʿadhābu","walā","hum","yunṣarūna",null],"verseTiming":[[1,0,2430],[2,2430,3370],[3,3370,4210],[4,4210,5230],[5,5230,6260],[6,6260,8060],[7,8060,8600],[8,8600,9620],[9,9620,10330],[10,10330,11470],[11,11470,12170],[12,12170,12550],[13,12550,16775]]}}