{"name":"2:87","price":"ہم نے (حضرت) موسیٰ کو کتاب دی اور ان کے پیچھے اور رسول بھیجے اور ہم نے (حضرت) عیسیٰ ابن مریم کو روشن دلیلیں دیں اور روح القدس سے ان کی تائید کروائی(1) ۔ لیکن جب کبھی تمہارے پاس رسول وه چیز ﻻئے جو تمہاری طبیعتوں کے خلاف تھی، تم نے جھٹ سے تکبر کیا، پس بعض کو تو جھٹلادیا اور بعض کو قتل بھی کرڈاﻻ۔(2)","arabic":"وَلَقَدۡ ءَاتَيۡنَا مُوسَى ٱلۡكِتَٰبَ وَقَفَّيۡنَا مِنۢ بَعۡدِهِۦ بِٱلرُّسُلِۖ وَءَاتَيۡنَا عِيسَى ٱبۡنَ مَرۡيَمَ ٱلۡبَيِّنَٰتِ وَأَيَّدۡنَٰهُ بِرُوحِ ٱلۡقُدُسِۗ أَفَكُلَّمَا جَآءَكُمۡ رَسُولُۢ بِمَا لَا تَهۡوَىٰٓ أَنفُسُكُمُ ٱسۡتَكۡبَرۡتُمۡ فَفَرِيقٗا كَذَّبۡتُمۡ وَفَرِيقٗا تَقۡتُلُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":94,"juzNumber":1,"footnotes":"(1) «وَقَفَّيْنَا مِنْ بَعْدِهِ بِالرُّسُلِ» کے معنی ہیں کہ موسیٰ (عليه السلام) کے بعد مسلسل پیغمبر آتے رہے، حتیٰ کہ بنی اسرائیل میں انبیاکا یہ سلسلہ حضرت عیسیٰ (عليه السلام) پر ختم ہوگیا۔ «بَيِّنَاتٌ» سے معجزات مراد ہیں جو حضرت عیسیٰ (عليه السلام) کو دیئے گئے۔ جیسے مردوں کو زندہ کرنا، کوڑھی اور اندھے کو صحت یاب کرنا وغیرہ، جن کا ذکر سورۂ آل عمران (آیت 49) میں ہے۔ \"رُوحُ الْقُدُسِ\" سے مراد حضرت جبریل (عليه السلام) ہیں، ان کو (روح القدس)اس لئے کہا گیا ہے کہ وہ امرتکوینی سے ظہور میں آئے تھے، جیسا کہ خود حضرت عیسیٰ (عليه السلام) کو رُوحٌ کہا گیا ہے اور الْقُدُس سے ذات الٰہی مراد ہے اور اس کی طرف روح کی اضافت تشریفی ہے۔ ابن جریر نے اسی کو صحیح تر قرار دیا ہے، کیونکہ المائدۂ (آیت 10) میں (روح القدس) اور انجیل دونوں الگ الگ مذکور ہیں اس لئے (روح القدس) سے انجیل مراد نہیں ہوسکتی ایک اور آیت میں حضرت جبریل (عليه السلام) کو «الرُّوحُ الأَمِينُ» فرمایا گیا ہے اور آنحضرت (صلى الله عليه وسلم) نے حضرت حسان! کے متعلق فرمایا :«اللَّهُمَّ! أَيِّدْهُ بِرُوحِ الْقُدُسِ»۔ ”اے اللہ روح القدس سے اس کی تائید فرما۔“ ایک دوسری حدیث میں ہے «وَجِبْريلُ مَعَكَ»۔ ”جبریل (عليه السلام) تمہارے ساتھ ہیں۔“ معلوم ہوا کہ روح القدس سے مراد حضرت جبریل (عليه السلام) ہی ہیں، (فتح البیان، ابن کثیر بحوالہ اشرف الحواشی)\n(2) جیسے حضرت محمد (صلى الله عليه وسلم) اور حضرت عیسیٰ (عليه السلام) کو جھٹلایا اورحضرت زکریا ویحییٰ علیھماالسلام کو قتل کیا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walaqad ātaynā mūsā al-kitāba waqaffaynā min baʿdihi bil-rusuli waātaynā ʿīsā ib'na maryama al-bayināti wa-ayyadnāhu birūḥi al-qudusi afakullamā jāakum rasūlun bimā lā tahwā anfusukumu is'takbartum fafarīqan kadhabtum wafarīqan taqtulūna ","translations":["And indeed","We gave","Musa","the Book","and We followed up","from","after him","with [the] Messengers","And We gave","Isa","(the) son","(of) Maryam","[the] clear signs","and We supported him","(with)","the Holy Spirit","Is it (not) so (that) whenever","came to you","a Messenger","with what","(does) not","desire","yourselves","you acted arrogantly","So a party","you denied","and a party","you kill(ed)","(87)"],"transliterationArr":["walaqad","ātaynā","mūsā","al-kitāba","waqaffaynā","min","baʿdihi","bil-rusuli","waātaynā","ʿīsā","ib'na","maryama","al-bayināti","wa-ayyadnāhu","birūḥi","al-qudusi","afakullamā","jāakum","rasūlun","bimā","lā","tahwā","anfusukumu","is'takbartum","fafarīqan","kadhabtum","wafarīqan","taqtulūna",null],"verseTiming":[[1,0,880],[2,880,1960],[3,1960,2500],[4,2500,3430],[5,3430,4660],[6,4660,5580],[7,5580,6450],[8,6450,7400],[9,7400,9050],[10,9050,9590],[11,9590,10020],[12,10020,10710],[13,10710,12070],[14,12070,13550],[15,13550,14300],[16,14300,15170],[17,15170,16670],[18,16670,18930],[19,18930,20390],[20,20390,21030],[21,21030,21320],[22,21320,23390],[23,23390,25030],[24,25030,26380],[25,26380,28080],[26,28080,29220],[27,29220,31050],[28,31050,33435]]}}