{"name":"2:95","price":"لیکن اپنی کرتوتوں کو دیکھتے ہوئے کبھی بھی موت نہیں مانگیں گے(1) اللہ تعالیٰ ﻇالموں کو خوب جانتا ہے۔","arabic":"وَلَن يَتَمَنَّوۡهُ أَبَدَۢا بِمَا قَدَّمَتۡ أَيۡدِيهِمۡۚ وَٱللَّهُ عَلِيمُۢ بِٱلظَّٰلِمِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":102,"juzNumber":1,"footnotes":"(1) حضرت ابن عباس (رضي الله عنه) نے اس کی تفسیر دعوت مباہلہ سے کی ہے، یعنی یہودیوں کو کہا گیا کہ اگر تم نبوت محمدیہ کے انکار اور اللہ سے محبوبیت کے دعوے میں سچے ہو تو مباہلہ کرلو، یعنی اللہ کی بارگاہ میں مسلمان اور یہودی دونوں مل کر یہ عرض کریں کہ یا اللہ دونوں میں سے جو جھوٹا ہے، اسے موت سے ہمکنار کردے، یہی دعوت انہیں سورت جمعہ میں بھی دی گئی ہے۔ نجر ان کے عیسائیوں کو دعوت مباہلہ دی گئی تھی، جیسا کہ آل عمران میں ہے۔ لیکن چونکہ یہودی بھی، عیسائیوں کی طرح، جھوٹے تھے، اس لئے عیسائیوں ہی کی طرح یہودیوں کے بارے میں بھی اللہ تعالیٰ نے فرمایا، کہ یہ ہرگز موت کی آرزو (یعنی مباہلہ) نہیں کریں گے۔ حافظ ابن کثیر نے اسی تفسیر کو ترجیح دی ہے۔ (تفسیر ابن کثیر)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walan yatamannawhu abadan bimā qaddamat aydīhim wal-lahu ʿalīmun bil-ẓālimīna ","translations":["And never (will)","they wish for it","ever","because","(of what) sent ahead","their hands","And Allah","(is) All-Knower","of the wrongdoers","(95)"],"transliterationArr":["walan","yatamannawhu","abadan","bimā","qaddamat","aydīhim","wal-lahu","ʿalīmun","bil-ẓālimīna",null],"verseTiming":[[1,0,510],[2,510,3440],[3,3440,4830],[4,4830,5420],[5,5420,6440],[6,6440,8030],[7,8030,8980],[8,8980,10610],[9,10610,13515]]}}