{"name":"2:96","price":"بلکہ سب سے زیاده دنیا کی زندگی کا حریص اے نبی! آپ انہیں کو پائیں گے۔ یہ حرص زندگی میں مشرکوں سے بھی زیاده ہیں(1) ان میں سے تو ہر شخص ایک ایک ہزار سال کی عمر چاہتا ہے، گویا یہ عمر دیا جانا بھی انہیں عذاب سے نہیں چھڑا سکتا، اللہ تعالیٰ ان کے کاموں کو بخوبی دیکھ رہا ہے","arabic":"وَلَتَجِدَنَّهُمۡ أَحۡرَصَ ٱلنَّاسِ عَلَىٰ حَيَوٰةٖ وَمِنَ ٱلَّذِينَ أَشۡرَكُواْۚ يَوَدُّ أَحَدُهُمۡ لَوۡ يُعَمَّرُ أَلۡفَ سَنَةٖ وَمَا هُوَ بِمُزَحۡزِحِهِۦ مِنَ ٱلۡعَذَابِ أَن يُعَمَّرَۗ وَٱللَّهُ بَصِيرُۢ بِمَا يَعۡمَلُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":103,"juzNumber":1,"footnotes":"(1) موت کی آرزو تو کجا، یہ تو دنیوی زندگی کے تمام لوگوں حتیٰ کہ مشرکین سے بھی زیادہ حریص ہیں، لیکن عمر کی یہ درازی انہیں عذاب الٰہی سے بچا نہیں سکے گی۔ ان آیات سے معلوم ہوا کہ یہودی اپنے ان دعوؤں میں یکسر جھوٹے تھے کہ وہ اللہ کے محبوب اور چہیتے ہیں، یا جنت کے مستحق صرف وہی ہیں اور دوسرے جہنمی، کیوں کہ فی الواقع اگر ایسا ہوتا، یا کم از کم انہیں اپنے دعوؤں کی صداقت پر پورا یقین ہوتا، تو یقیناً وہ مباہلہ کرنے پر آمادہ ہوجاتے، تاکہ ان کی سچائی واضح اور مسلمانوں کی غلطی آشکارا ہوجاتی۔ مباہلے سے پہلے یہودیوں کا اعراض اور گریز اس بات کی نشان دہی کرتا ہے کہ گو وہ زبان سے اپنے بارے میں خوش کن باتیں کرلیتے تھے، لیکن ان کے دل اصل حقیقت سے آگاہ تھے اور جانتے تھے کہ اللہ کی بارگاہ میں جانے کے بعد ان کا حشر وہی ہوگا جو اللہ نے اپنے نافرمانوں کے لئے طے کر رکھا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walatajidannahum aḥraṣa al-nāsi ʿalā ḥayatin wamina alladhīna ashrakū yawaddu aḥaduhum law yuʿammaru alfa sanatin wamā huwa bimuzaḥziḥihi mina al-ʿadhābi an yuʿammara wal-lahu baṣīrun bimā yaʿmalūna ","translations":["And surely you will find them","(the) most greedy","(of) [the] mankind","for","life","and (greedier) than","those who","associate[d] partners (with Allah)","Loves","(each) one of them","if","he could be granted a life","(of) a thousand","year(s)","But not","it","(will) remove him","from","the punishment","that","he should be granted life","And Allah","(is) All-Seer","of what","they do","(96)"],"transliterationArr":["walatajidannahum","aḥraṣa","al-nāsi","ʿalā","ḥayatin","wamina","alladhīna","ashrakū","yawaddu","aḥaduhum","law","yuʿammaru","alfa","sanatin","wamā","huwa","bimuzaḥziḥihi","mina","al-ʿadhābi","an","yuʿammara","wal-lahu","baṣīrun","bimā","yaʿmalūna",null],"verseTiming":[[1,0,2560],[2,2560,3440],[3,3440,5260],[4,5260,5870],[5,5870,7640],[6,7640,8100],[7,8100,9100],[8,9100,10210],[9,10210,11360],[10,11360,12290],[11,12290,12680],[12,12680,14280],[13,14280,14810],[14,14810,16050],[15,16050,16710],[16,16710,17060],[17,17060,18700],[18,18700,19040],[19,19040,20000],[20,20000,20230],[21,20230,22990],[22,22990,23980],[23,23980,25540],[24,25540,26170],[25,26170,28745]]}}