{"name":"2:98","price":"جو شخص اللہ کا اور اس کے فرشتوں اور اس کے رسولوں اور جبرائیل اور میکائیل کا دشمن ہو، ایسے کافروں کا دشمن خود اللہ ہے۔(1)","arabic":"مَن كَانَ عَدُوّٗا لِّلَّهِ وَمَلَٰٓئِكَتِهِۦ وَرُسُلِهِۦ وَجِبۡرِيلَ وَمِيكَىٰلَ فَإِنَّ ٱللَّهَ عَدُوّٞ لِّلۡكَٰفِرِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":105,"juzNumber":1,"footnotes":"(1) یہود کہتے تھے کہ میکائیل ہمارا دوست ہے، اللہ تعالیٰ نے فرمایا : یہ سب میرے مقبول بندے ہیں جو ان کا یا ان میں سے کسی ایک کا بھی دشمن ہے، وہ اللہ کا بھی دشمن ہے۔ حدیث میں ہے: «مَنْ عَادَى لِي وَلِيًّا فَقَدْ بَارَزَنِي بِالْحَرْبِ»۔(صحیح بخاری کتاب الرقاق باب التواضع) ”جس نے میرے کسی دوست سے دشمنی رکھی، اس نے میرے ساتھ اعلان جنگ کیا ہے“، گویا اللہ کے کسی ایک ولی سے دشمنی سارے اولیاء اللہ سے، بلکہ اللہ تعالیٰ سے بھی دشمنی ہے۔ اس سے واضح ہوا کہ اولیاء اللہ کی محبت اور ان کی تعظیم نہایت ضروری اور ان سے بغض وعناد اتنا بڑا جرم ہے کہ اللہ تعالیٰ اس کے خلاف اعلان جنگ فرماتا ہے۔ اولیاء اللہ کون ہیں؟ اس کے لئے ملاحظہ ہو سورۂ یونس، آیت62-63 ، لیکن محبت اور تعظیم کا یہ مطلب ہرگز نہیں ہے کہ ان کے مرنے کے بعد ان کی قبروں پر گنبد اور قبے بنائے جائیں، ان کی قبروں پر سالانہ عرس کے نام پر میلوں ٹھیلوں کا اہتمام کیا جائے، ان کے نام کی نذرونیاز اور قبروں کو غسل دیا جائے اور ان پر چادریں چڑھائی جائیں اور انہیں حاجت روا، مشکل کشا، نافع وضار سمجھا جائے، ان کی قبروں پر دست بستہ قیام اور ان کی چوکھٹوں پر سجدہ کیا جائے وغیرہ، جیسا کہ بدقسمتی سے ”اولیاء اللہ کی محبت“ کے نام پر یہ کاروبار لات ومنات فروغ پذیر ہے۔ حالانکہ یہ ”محبت“ نہیں ہے، ان کی عبادت ہے، جو شرک اور ظلم عظیم ہے۔ اللہ تعالیٰ اس فتنۂ عبادت قبور سے محفوظ رکھے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"man kāna ʿaduwwan lillahi wamalāikatihi warusulihi wajib'rīla wamīkāla fa-inna al-laha ʿaduwwun lil'kāfirīna ","translations":["Whoever","is","an enemy","(to) Allah","and His Angels","and His Messengers","and Jibreel","and Meekael","then indeed","Allah","(is) an enemy","to the disbelievers","(98)"],"transliterationArr":["man","kāna","ʿaduwwan","lillahi","wamalāikatihi","warusulihi","wajib'rīla","wamīkāla","fa-inna","al-laha","ʿaduwwun","lil'kāfirīna",null],"verseTiming":[[1,0,1530],[2,1530,2110],[3,2110,2960],[4,2960,4090],[5,4090,7120],[6,7120,8310],[7,8310,9520],[8,9520,10720],[9,10720,12040],[10,12040,12970],[11,12970,13830],[12,13830,16995]]}}