{"name":"30:18","price":"تمام تعریفوں کے ﻻئق آسمان وزمین میں صرف وہی ہے تیسرے پہر کو اور ﻇہر کے وقت بھی (اس کی پاکیزگی بیان کرو).(1)","arabic":"وَلَهُ ٱلۡحَمۡدُ فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَعَشِيّٗا وَحِينَ تُظۡهِرُونَ","category":["30 (Ar-Rum)","Ar-Rum","Surah Ar-Rum","Chapter Ar-Rum","Rum","Surah Rum","Chapter Rum","Ar Rum","Surah Ar Rum","Chapter Ar Rum","Surah 30","Chapter 30","The Romans","الرُّوم"],"ayahNumber":3427,"juzNumber":21,"footnotes":"(1) یہ اللہ تعالیٰ کی طرف سے اپنی ذات مقدسہ کے لئے تسبیح وتحمید ہے، جس سے مقصد اپنے بندوں کی رہنمائی ہے کہ ان اوقات میں، جو ایک دوسرے کے پیچھے آتے ہیں اور جو اس کے کمال قدرت وعظمت پر دلالت کرتے ہیں، اس کی تسبیح وتحمید کیا کرو، شام کا وقت، رات کی تاریکی کا پیش خیمہ اور سپیدۂ سحر دن کی روشنی کا پیامبر ہوتا ہے۔ عشاء، شدت تاریکی کا اور ظہر، خوب روشن ہو جانے کا وقت ہے۔ پس وہ ذات پاک ہےجو ان سب کی خالق ہے اور جس نے ان تمام اوقات میں الگ الگ فوائد رکھے ہیں۔ بعض کہتے ہیں کہ تسبیح سے مراد، نماز ہے اور دونوں آیات میں مذکور اوقات پانچ نمازوں کے اوقات ہیں۔ تُمْسُونَ میں مغرب وعشاء، تُصْبِحُونَ میں نماز فجر، عَشِيًّا (سہ پہر) میں عصر اور تُظْهِرُونَ میں نماز ظہر آجاتی ہے، (فتح القدیر) ایک ضعیف حدیث میں ان دونوں آیات کو صبح وشام پڑھنے کی یہ فضیلت بیان ہوئی ہے کہ اس سے شب وروز کی کوتاہیوں کا ازلہ ہوتا ہے۔ (أبو داود ، كتاب الأدب ، باب ما يقول إذا أصبح)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walahu al-ḥamdu fī al-samāwāti wal-arḍi waʿashiyyan waḥīna tuẓ'hirūna ","translations":["And for Him","(are) all praises","in","the heavens","and the earth","and (at) night","and when","you are at noon","(18)"],"transliterationArr":["walahu","al-ḥamdu","fī","al-samāwāti","wal-arḍi","waʿashiyyan","waḥīna","tuẓ'hirūna",null],"verseTiming":[[1,0,770],[2,770,1640],[3,1640,1840],[4,1840,3330],[5,3330,4360],[6,4360,5880],[7,5880,6980],[8,6980,10465]]}}