{"name":"30:21","price":"اور اس کی نشانیوں میں سے ہے کہ تمہاری ہی جنس سے بیویاں پیدا کیں(1) تاکہ تم ان سے آرام پاؤ(2) اس نے تمہارے درمیان محبت اور ہمدردی قائم کر دی(3)، یقیناً غور وفکر کرنے والوں کے لئے اس میں بہت سی نشانیاں ہیں.","arabic":"وَمِنۡ ءَايَٰتِهِۦٓ أَنۡ خَلَقَ لَكُم مِّنۡ أَنفُسِكُمۡ أَزۡوَٰجٗا لِّتَسۡكُنُوٓاْ إِلَيۡهَا وَجَعَلَ بَيۡنَكُم مَّوَدَّةٗ وَرَحۡمَةًۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يَتَفَكَّرُونَ","category":["30 (Ar-Rum)","Ar-Rum","Surah Ar-Rum","Chapter Ar-Rum","Rum","Surah Rum","Chapter Rum","Ar Rum","Surah Ar Rum","Chapter Ar Rum","Surah 30","Chapter 30","The Romans","الرُّوم"],"ayahNumber":3430,"juzNumber":21,"footnotes":"(1) یعنی تمہاری ہی جنس سے عورتیں پیدا کیں تاکہ وہ تمہاری بیویاں بنیں اور تم جوڑا جوڑا ہو جاؤ زَوْجٌ عربی میں جوڑے کو کہتے ہیں۔ اس اعتبار سے مرد عورت کے لئے اور عورت مرد کے لئے زوج ہے۔ عورت کے جنس بشر ہونے کا مطلب ہے کہ دنیا کی پہلی عورت۔ حضرت حوا۔ کو حضرت آدم (عليه السلام) کی بائیں پسلی سے پیدا کیا گیا۔ پھر ان دونوں سے نسل انسانی کا سلسلہ چلا۔\n(2) مطلب یہ ہے کہ اگر مرد اور عورت کی جنس ایک دوسرے سے مختلف ہوتی، مثلاً عورتیں جنات یا حیوانات میں سے ہوتیں، تو ان سے وہ سکون کبھی حاصل نہ ہوتا جو اس وقت دونوں کے ایک ہی جنس سے ہونے کی وجہ سے حاصل ہوتا ہے۔ بلکہ ایک دوسرے سے نفرت ووحشت ہوتی۔ یہ اللہ تعالیٰ کی کمال رحمت ہے کہ اس نے انسانوں کی بیویاں، انسان ہی بنائیں۔\n(3) مَوَدَّةٌ یہ ہے کہ مرد بیوی سے بے پناہ پیار کرتا ہے اور ایسے ہی بیوی شوہر سے۔ جیسا کہ عام مشاہدہ ہے۔ ایسی محبت جو میاں بیوی کے درمیان ہوتی ہے، دنیا میں کسی بھی دو شخصوں کے درمیان نہیں ہوتی۔ اور رحمت یہ ہے کہ مرد بیوی کو ہر طرح کی سہولت اور آسائشیں بہم پہنچاتا ہے، جس کا مکلف اسے اللہ تعالیٰ نے بنایا ہے اور ایسے ہی عورت بھی اپنے قدرت واختیار کے دائرہ میں۔ تاہم انسان کو یہ سکون اور باہمی پیار انہی جوڑوں سے حاصل ہوتا ہےجو قانون شریعت کے مطابق باہم نکاح سے قائم ہوتے ہیں اور اسلام انہی کو جوڑا قرار دیتا ہے۔ غیر قانونی جوڑوں کو وہ جوڑا ہی تسلیم نہیں کرتا بلکہ انہیں زانی اور بدکار قرار دیتا اور ان کے لئے سخت سزا تجویز کرتا ہے۔ آج کل مغربی تہذیب کے علم بردار شیاطین ان مذموم کوششوں میں مصروف ہیں کہ مغربی معاشروں کی طرح اسلامی ملکوں میں بھی نکاح کو غیر ضروری قرار دیتے ہوئے بدکار مرد وعورت کو (جوڑا) (COUPLE) تسلیم کروایا جائے اور ان کے لئےسزا کے بجائے، وہ حقوق منوائے جائیں، جو ایک قانونی جوڑے کو حاصل ہوتے ہیں۔ قَاتَلَهُمْ اللهُ أَنَّى يُؤْفَكُونَ.","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wamin āyātihi an khalaqa lakum min anfusikum azwājan litaskunū ilayhā wajaʿala baynakum mawaddatan waraḥmatan inna fī dhālika laāyātin liqawmin yatafakkarūna ","translations":["And among","His Signs","(is) that","He created","for you","from","yourselves","mates","that you may find tranquility","in them","and He placed","between you","love","and mercy","Indeed","in","that","surely (are) Signs","for a people","who reflect","(21)"],"transliterationArr":["wamin","āyātihi","an","khalaqa","lakum","min","anfusikum","azwājan","litaskunū","ilayhā","wajaʿala","baynakum","mawaddatan","waraḥmatan","inna","fī","dhālika","laāyātin","liqawmin","yatafakkarūna",null],"verseTiming":[[1,0,990],[2,990,3850],[3,3850,4150],[4,4150,4920],[5,4920,5450],[6,5450,6470],[7,6470,8440],[8,8440,9570],[9,9570,12460],[10,12460,13490],[11,13490,14370],[12,14370,15280],[13,15280,17910],[14,17910,19600],[15,19600,20710],[16,20710,21230],[17,21230,22060],[18,22060,23380],[19,23380,25300],[20,25300,28545]]}}