{"name":"30:30","price":"پس آپ یک سو ہو کر اپنا منھ دین کی طرف متوجہ کر دیں(1) ۔ اللہ تعالیٰ کی وه فطرت جس پر اس نے لوگوں کو پیدا کیا ہے(2)، اللہ تعالیٰ کے بنائے کو بدلنا نہیں، یہی سیدھا دین ہے(3) لیکن اکثر لوگ نہیں سمجھتے.(4)","arabic":"فَأَقِمۡ وَجۡهَكَ لِلدِّينِ حَنِيفٗاۚ فِطۡرَتَ ٱللَّهِ ٱلَّتِي فَطَرَ ٱلنَّاسَ عَلَيۡهَاۚ لَا تَبۡدِيلَ لِخَلۡقِ ٱللَّهِۚ ذَٰلِكَ ٱلدِّينُ ٱلۡقَيِّمُ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يَعۡلَمُونَ","category":["30 (Ar-Rum)","Ar-Rum","Surah Ar-Rum","Chapter Ar-Rum","Rum","Surah Rum","Chapter Rum","Ar Rum","Surah Ar Rum","Chapter Ar Rum","Surah 30","Chapter 30","The Romans","الرُّوم"],"ayahNumber":3439,"juzNumber":21,"footnotes":"(1) یعنی اللہ کی توحید اور اس کی عبادت پر قائم رہیں اور ادیان باطلہ کی طرف التفات ہی نہ کریں۔\n(2) فطرت کےاصل معنی خلقت (پیدائش) کے ہیں۔ یہاں مراد ملت اسلام (وتوحید) ہے مطلب یہ ہے کہ سب کی پیدائش، بغیر مسلم وکافر کی تفریق کے، اسلام اور توحید پر ہوتی ہے، اس لئے توحید ان کی فطرت یعنی جبلت میں شامل ہے جس طرح کہ عہدالست سےواضح ہے۔ بعد میں بہت سوں کو ماحول یادیگر عوارض، فطرت کی اس آواز کی طرف نہیں آنے دیتے، جس کی وجہ سےوہ کفر پر ہی باقی رہتے ہیں جس طرح نبی (صلى الله عليه وسلم) کی حدیث ہے ”ہربچہ فطرت پر پیدا ہوتا ہے، لیکن پھر اس کے ماں باپ، اس کو یہودی، عیسائی اور مجوسی وغیرہ بنا دیتے ہیں“۔ (صحيح بخاري، تفسير سورة الروم، مسلم كتاب القدر ، باب معنى كل مولود يولد على الفطرة)۔\n(3) یعنی اللہ کی اس خلقت (فطرت) کو تبدیل نہ کرو بلکہ صحیح تربیت کےذریعےسےاس کی نشوونما کرو تاکہ ایمان وتوحید بچوں کے دل ودماغ میں راسخ ہوجائے۔ یہ خبربمعنی انشا ہے یعنی نفی، نہی کے معنی میں ہے۔\n(4) یعنی وہ دین جس کی طرف یکسو اور متوجہ ہونے کا حکم ہے، یا جو فطرت کا تقاضا ہے وہ یہی دین قیم ہے۔\n(5) اسی لئے وہ اسلام اور توحید سے ناآشنا رہتے ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"fa-aqim wajhaka lilddīni ḥanīfan fiṭ'rata al-lahi allatī faṭara al-nāsa ʿalayhā lā tabdīla likhalqi al-lahi dhālika al-dīnu al-qayimu walākinna akthara al-nāsi lā yaʿlamūna ","translations":["So set","your face","to the religion","upright","Nature","(made by) Allah","(upon) which","He has created","mankind","[on it]","No","change","(should there be) in the creation","(of) Allah","That","(is) the religion","the correct","but","most","men","(do) not","know","(30)"],"transliterationArr":["fa-aqim","wajhaka","lilddīni","ḥanīfan","fiṭ'rata","al-lahi","allatī","faṭara","al-nāsa","ʿalayhā","lā","tabdīla","likhalqi","al-lahi","dhālika","al-dīnu","al-qayimu","walākinna","akthara","al-nāsi","lā","yaʿlamūna",null],"verseTiming":[[1,0,1010],[2,1010,1810],[3,1810,2900],[4,2900,4120],[5,4120,5350],[6,5350,6320],[7,6320,7150],[8,7150,7790],[9,7790,9330],[10,9330,10530],[11,10530,11270],[12,11270,12370],[13,12370,13270],[14,13270,15750],[15,15750,16650],[16,16650,17500],[17,17500,18690],[18,18690,20680],[19,20680,21500],[20,21500,23010],[21,23010,23440],[22,23440,26165]]}}