{"name":"30:39","price":"تم جو سود پر دیتے ہو کہ لوگوں کے مال میں بڑھتا رہے وه اللہ تعالیٰ کے ہاں نہیں بڑھتا(1) ۔ اور جو کچھ صدقہ زکوٰة تم اللہ تعالیٰ کا منھ دیکھنے (اورخوشنودی کے لئے) دو تو ایسے لوگ ہی اپنا دو چند کرنے والے ہیں.(2)","arabic":"وَمَآ ءَاتَيۡتُم مِّن رِّبٗا لِّيَرۡبُوَاْ فِيٓ أَمۡوَٰلِ ٱلنَّاسِ فَلَا يَرۡبُواْ عِندَ ٱللَّهِۖ وَمَآ ءَاتَيۡتُم مِّن زَكَوٰةٖ تُرِيدُونَ وَجۡهَ ٱللَّهِ فَأُوْلَٰٓئِكَ هُمُ ٱلۡمُضۡعِفُونَ","category":["30 (Ar-Rum)","Ar-Rum","Surah Ar-Rum","Chapter Ar-Rum","Rum","Surah Rum","Chapter Rum","Ar Rum","Surah Ar Rum","Chapter Ar Rum","Surah 30","Chapter 30","The Romans","الرُّوم"],"ayahNumber":3448,"juzNumber":21,"footnotes":"(1) یعنی سود سے بظاہر اضافہ معلوم ہوتا ہے لیکن درحقیقت ایسا نہیں ہوتا، بلکہ اس کی نحوست بالآخر دنیا وآخرت میں تباہی کا باعث ہے۔ حضرت ابن عباس اور متعدد صحابہ وتابعین (رضي الله عنهم) نےاس آیت میں ربا سے مراد سود (بیاج) نہیں، بلکہ وہ ہدیہ اور تحفہ لیا ہے جو کوئی غریب آدمی کسی مالدار کو یا رعایا کا کوئی فرد بادشاہ یا حکمران کو اور ایک خادم اپنے مخدوم کو اس نیت سے دیتا ہے کہ وہ اس کے بدلے میں مجھے اس سے زیادہ دے گا۔ اسے ”ربا“ سے اس لئے تعبیرکیا گیا ہے کہ دیتے وقت اس میں زیادتی کی نیت ہوتی ہے۔ یہ اگرچہ مباح ہے تاہم اللہ کے ہاں اس پر اجر نہیں ملے گا، فَلا يَرْبُو عِنْدَ اللَّهِ سے اسی اخروی اجر کی نفی ہے۔ اس صورت میں ترجمہ ہوگا جو تم عطیہ دو، اس نیت سے کہ واپسی کی صورت میں زیادہ ملے، پس اللہ کے ہاں اس کا ثواب نہیں۔ (ابن کثیر، ایسر التفاسیر)۔\n(2) زکوٰۃ وصدقات سےایک تو روحانی ومعنوی اضافہ ہوتا ہے یعنی بقیہ مال میں اللہ کی طرف سے برکت ڈال دی جاتی ہے۔ دوسرے، قیامت والے دن اس کا اجر وثواب کئی کئی گنا ملے گا، جس طرح حدیث میں ہے کہ حلال کمائی سے ایک کھجور کے برابر صدقہ بڑھ بڑھ کراحد پہاڑ کے برابر ہو جائے گا۔ (صحیح مسلم،کتاب الزکٰوۃ)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wamā ātaytum min riban liyarbuwā fī amwāli al-nāsi falā yarbū ʿinda al-lahi wamā ātaytum min zakatin turīdūna wajha al-lahi fa-ulāika humu al-muḍ'ʿifūna ","translations":["And what","you give","for","usury","to increase","in","(the) wealth","(of) people","not","(will) increase","with","Allah","But what","you give","of","zakah","desiring","(the) Countenance","(of) Allah","then those","[they]","(will) get manifold","(39)"],"transliterationArr":["wamā","ātaytum","min","riban","liyarbuwā","fī","amwāli","al-nāsi","falā","yarbū","ʿinda","al-lahi","wamā","ātaytum","min","zakatin","turīdūna","wajha","al-lahi","fa-ulāika","humu","al-muḍ'ʿifūna",null],"verseTiming":[[1,0,2720],[2,2720,3920],[3,3920,4890],[4,4890,5480],[5,5480,6730],[6,6730,8690],[7,8690,9630],[8,9630,11390],[9,11390,12040],[10,12040,12890],[11,12890,14380],[12,14380,17040],[13,17040,18970],[14,18970,20260],[15,20260,21270],[16,21270,22000],[17,22000,23510],[18,23510,25120],[19,25120,25580],[20,25580,26590],[21,26590,29600],[22,29600,30000],[23,30000,33225]]}}