{"name":"30:38","price":"پس قرابت دار کو مسکین کو مسافر کو ہر ایک کو اس کا حق دیجئے(1) ، یہ ان کے لئے بہتر ہے جو اللہ تعالیٰ کا منھ دیکھنا چاہتے ہوں(2)، ایسے ہی لوگ نجات پانے والے ہیں.","arabic":"فَـَٔاتِ ذَا ٱلۡقُرۡبَىٰ حَقَّهُۥ وَٱلۡمِسۡكِينَ وَٱبۡنَ ٱلسَّبِيلِۚ ذَٰلِكَ خَيۡرٞ لِّلَّذِينَ يُرِيدُونَ وَجۡهَ ٱللَّهِۖ وَأُوْلَٰٓئِكَ هُمُ ٱلۡمُفۡلِحُونَ","category":["30 (Ar-Rum)","Ar-Rum","Surah Ar-Rum","Chapter Ar-Rum","Rum","Surah Rum","Chapter Rum","Ar Rum","Surah Ar Rum","Chapter Ar Rum","Surah 30","Chapter 30","The Romans","الرُّوم"],"ayahNumber":3447,"juzNumber":21,"footnotes":"(1) جب وسائل رزق تمام تر اللہ ہی کےاختیار میں ہیں اور وہ جس پر چاہے اس کےدروازے کھول دیتا ہےتو اصحاب ثروت کو چاہئے کہ وہ اللہ کے دیے ہوئےمال میں سے ان کا وہ حق ادا کرتے رہیں جو ان کے مال میں ان کے مستحق رشتے داروں، مساکین اور مسافر کا رکھا گیا ہے، رشتےدار اس لئے مقدم کیاکہ اس کی فضیلت زیادہ ہے۔ حدیث میں آتا ہے کہ غریب رشتےدار کے ساتھ احسان کرنا دوہرے اجر کا باعث ہے۔ ایک صدقے کا اجر اور دوسرا صلۂ رحمی کا۔ علاوہ ازیں اسے حق سےتعبیر کرکے اس طرف بھی اشارہ فرما دیا کہ امداد کرکے ان پر تم احسان نہیں کرو گے بلکہ ایک حق کی ہی ادائیگی کرو گے۔\n(2) یعنی جنت میں اس کے دیدار سےمشرف ہونا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"faāti dhā al-qur'bā ḥaqqahu wal-mis'kīna wa-ib'na al-sabīli dhālika khayrun lilladhīna yurīdūna wajha al-lahi wa-ulāika humu al-muf'liḥūna ","translations":["So give","the relative","the relative","his right","and the poor","and the wayfarer","and the wayfarer","That","(is) best","for those who","desire","(the) Countenance","(of) Allah","And those","they","(are) the successful ones","(38)"],"transliterationArr":["faāti","dhā","al-qur'bā","ḥaqqahu","wal-mis'kīna","wa-ib'na","al-sabīli","dhālika","khayrun","lilladhīna","yurīdūna","wajha","al-lahi","wa-ulāika","humu","al-muf'liḥūna",null],"verseTiming":[[1,0,1140],[2,1140,1270],[3,1270,2340],[4,2340,3150],[5,3150,4950],[6,4950,5550],[7,5550,9130],[8,9130,10060],[9,10060,10660],[10,10660,12090],[11,12090,13450],[12,13450,14090],[13,14090,17130],[14,17130,20170],[15,20170,20590],[16,20590,23945]]}}