{"name":"30:37","price":"کیا انہوں نے نہیں دیکھا کہ اللہ تعالیٰ جسے چاہے کشاده روزی دیتا ہے اور جسے چاہے تنگ(1) ، اس میں بھی ان لوگوں کے لئے جو ایمان ﻻتے ہیں نشانیاں ہیں.","arabic":"أَوَلَمۡ يَرَوۡاْ أَنَّ ٱللَّهَ يَبۡسُطُ ٱلرِّزۡقَ لِمَن يَشَآءُ وَيَقۡدِرُۚ إِنَّ فِي ذَٰلِكَ لَأٓيَٰتٖ لِّقَوۡمٖ يُؤۡمِنُونَ","category":["30 (Ar-Rum)","Ar-Rum","Surah Ar-Rum","Chapter Ar-Rum","Rum","Surah Rum","Chapter Rum","Ar Rum","Surah Ar Rum","Chapter Ar Rum","Surah 30","Chapter 30","The Romans","الرُّوم"],"ayahNumber":3446,"juzNumber":21,"footnotes":"(1) یعنی اپنی حکمت ومصلحت سے وہ کسی کو مال ودولت زیادہ اور کسی کوکم دیتا ہے۔ حتیٰ کہ بعض دفعہ عقل وشعور میں اور ظاہری اسباب ووسائل میں دو انسان ایک جیسے ہی محسوس ہوتے ہیں، ایک جیسا ہی کاروبار بھی شروع کرتے ہیں۔ لیکن ایک کے کاروبار کو خوب فروغ ملتا ہے اور اس کےوارے نیارے ہو جاتے ہیں، جب کہ دوسرےشخص کا کاروبار محدود ہی رہتا ہے اور اسے وسعت نصیب نہیں ہوتی۔ آخر یہ کون ہستی ہے، جس کے پاس تمام اختیارات ہیں اور وہ اس قسم کے تصرفات فرماتا ہے۔ علاوہ ازیں وہ کبھی دولت فراواں کے مالک کو محتاج اور محتاج کو مال ودولت سے نواز دیتا ہے۔ یہ سب اسی ایک اللہ کے ہاتھ میں ہے جس کا کوئی شریک نہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"awalam yaraw anna al-laha yabsuṭu al-riz'qa liman yashāu wayaqdiru inna fī dhālika laāyātin liqawmin yu'minūna ","translations":["Do not","they see","that","Allah","extends","the provision","for whom","He wills","and straitens (it)","Indeed","in","that","surely (are) Signs","for a people","who believe","(37)"],"transliterationArr":["awalam","yaraw","anna","al-laha","yabsuṭu","al-riz'qa","liman","yashāu","wayaqdiru","inna","fī","dhālika","laāyātin","liqawmin","yu'minūna",null],"verseTiming":[[1,0,1020],[2,1020,1680],[3,1680,3110],[4,3110,4000],[5,4000,4890],[6,4890,5690],[7,5690,6110],[8,6110,7180],[9,7180,9790],[10,9790,10690],[11,10690,12810],[12,12810,13300],[13,13300,14190],[14,14190,15600],[15,15600,17690],[16,17690,20525]]}}