{"name":"30:32","price":"ان لوگوں میں سے جنہوں نے اپنے دین کو ٹکڑے ٹکڑے کر دیا اور خود بھی گروه گروه ہوگئے(1) ہر گروه اس چیز پر جو اس کے پاس ہے مگن ہے.(2)","arabic":"مِنَ ٱلَّذِينَ فَرَّقُواْ دِينَهُمۡ وَكَانُواْ شِيَعٗاۖ كُلُّ حِزۡبِۭ بِمَا لَدَيۡهِمۡ فَرِحُونَ","category":["30 (Ar-Rum)","Ar-Rum","Surah Ar-Rum","Chapter Ar-Rum","Rum","Surah Rum","Chapter Rum","Ar Rum","Surah Ar Rum","Chapter Ar Rum","Surah 30","Chapter 30","The Romans","الرُّوم"],"ayahNumber":3441,"juzNumber":21,"footnotes":"(1) یعنی اصل دین کو چھوڑ کر یا اس میں من مانی تبدیلیاں کرکےالگ الگ فرقوں میں بٹ گئے، جیسے کوئی یہودی، کوئی نصرانی، کوئی مجوسی وغیرہ ہوگیا۔\n(2) یعنی ہر فرقہ اور گروہ سمجھتا ہے کہ وہ حق پر ہے اور دوسرے باطل پر، اور جو سہارے انہوں نے تلاش کر رکھے ہیں، جن کو وہ دلائل سے تعبیر کرتے ہیں، ان پر خوش اور مطمئن ہیں، بدقسمتی سے ملت اسلامیہ کا بھی یہی حال ہوا کہ وہ بھی مختلف فرقوں میں بٹ گئی اور ان کا بھی ہر فرقہ اسی زعم باطل میں مبتلا ہے کہ وہ حق پر ہے، حالانکہ حق پر صرف ایک ہی گروہ ہے جس کی پہچان نبی (صلى الله عليه وسلم) نے بتلا دی ہے کہ میرے اور میرے صحابہ کے طریقے پر چلنے والا ہوگا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"mina alladhīna farraqū dīnahum wakānū shiyaʿan kullu ḥiz'bin bimā ladayhim fariḥūna ","translations":["Of","those who","divide","their religion","and become","sects","each","party","in what","they have","rejoicing","(32)"],"transliterationArr":["mina","alladhīna","farraqū","dīnahum","wakānū","shiyaʿan","kullu","ḥiz'bin","bimā","ladayhim","fariḥūna",null],"verseTiming":[[1,0,520],[2,520,1590],[3,1590,2750],[4,2750,3860],[5,3860,4880],[6,4880,6010],[7,6010,6920],[8,6920,8750],[9,8750,9460],[10,9460,10450],[11,10450,13655]]}}