{"name":"30:41","price":"خشکی اور تری میں لوگوں کی بداعمالیوں کے باعﺚ فساد پھیل گیا۔ اس لئے کہ انہیں ان کے بعض کرتوتوں کا پھل اللہ تعالیٰ چکھا دے (بہت) ممکن ہے کہ وه باز آجائیں.(1)","arabic":"ظَهَرَ ٱلۡفَسَادُ فِي ٱلۡبَرِّ وَٱلۡبَحۡرِ بِمَا كَسَبَتۡ أَيۡدِي ٱلنَّاسِ لِيُذِيقَهُم بَعۡضَ ٱلَّذِي عَمِلُواْ لَعَلَّهُمۡ يَرۡجِعُونَ","category":["30 (Ar-Rum)","Ar-Rum","Surah Ar-Rum","Chapter Ar-Rum","Rum","Surah Rum","Chapter Rum","Ar Rum","Surah Ar Rum","Chapter Ar Rum","Surah 30","Chapter 30","The Romans","الرُّوم"],"ayahNumber":3450,"juzNumber":21,"footnotes":"(1) خشکی سے مراد، انسانی آبادیاں اور تری سے مراد سمندر، سمندری راستےاور ساحلی آبادیاں ہیں۔ فساد سے مراد ہر وہ بگاڑ ہےجس سےانسانوں کے معاشرے اور آبادیوں میں امن وسکون تہ وبالا اور ان کے عیش وآرام میں خلل واقع ہو۔ اس لئے اس کا اطلاق معاصی وسیئات پر بھی صحیح ہے کہ انسان ایک دوسرے پر ظلم کر رہے ہیں، اللہ کی حدوں کو پامال اور اخلاقی ضابطوں کو توڑ رہے ہیں اور قتل وخونریزی عام ہوگئی ہے اور ان ارضی وسماوی آفات پر بھی اس کا اطلاق صحیح ہے۔ جو اللہ کی طرف سے بطور سزا وتنبیہ نازل ہوتی ہیں۔ جیسے قحط، کثرت موت، خوف اور سیلاب وغیرہ مطلب یہ ہے کہ جب انسان اللہ کی نافرمانیوں کو اپنا وطیرہ بنا لیں تو پھر مکافات عمل کے طور پر اللہ تعالیٰ کی طرف سے انسانوں کے اعمال وکردار کا رخ برائیوں کی طرف پھر جاتا ہےاور زمین فساد سے بھر جاتی ہے امن وسکون ختم اور اس کی جگہ خوف ودہشت، سلب ونہب اور قتل وغارت گری عام ہو جاتی ہے اس کےساتھ ساتھ بعض دفعہ آفات ارضی وسماوی کا بھی نزول ہوتا ہے۔ مقصد اس سے یہی ہوتا ہے کہ اس عام بگاڑ یا آفات الہیہٰ کو دیکھ کر شاید لوگ گناہوں سے باز آجائیں، توبہ، کر لیں اور ان کا رجوع اللہ کی طرف ہوجائے۔\nاس کے برعکس جس معاشرے کا نظام اطاعت الٰہی پر قائم ہو اور اللہ کی حدیں نافذ ہوں، ظلم کی جگہ عدل کا دور دورہ ہو۔ وہاں امن وسکون اور اللہ کی طرف سے خیر وبرکت کا نزول ہوتا ہے۔ جس طرح ایک حدیث میں آتا ہے زمین میں اللہ کی ایک حد کا قائم کرنا، وہاں کے انسانوں کے لئے چالیس روز کی بارش سے بہتر ہے۔ (النسائي، كتاب قطع يد السارق، باب الترغيب في إقامة الحد - وابن ماجه) اسی طرح یہ حدیث ہے کہ جب ایک بدکار (فاجر) آدمی فوت ہو جاتا ہے تو بندے ہی اس سے راحت محسوس نہیں کرتے شہر بھی اور درخت اور جانور بھی آرام پاتے ہیں۔ (صحيح بخاري، كتاب الرقاق، باب سكرات الموت- مسلم، كتاب الجنائز، باب ما جاء في مستريح ومستراح منه)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"ẓahara al-fasādu fī al-bari wal-baḥri bimā kasabat aydī al-nāsi liyudhīqahum baʿḍa alladhī ʿamilū laʿallahum yarjiʿūna ","translations":["Has appeared","the corruption","in","the land","and the sea","for what","have earned","(the) hands","(of) people","so that He may let them taste","a part","(of) that which","they have done","so that they may","return","(41)"],"transliterationArr":["ẓahara","al-fasādu","fī","al-bari","wal-baḥri","bimā","kasabat","aydī","al-nāsi","liyudhīqahum","baʿḍa","alladhī","ʿamilū","laʿallahum","yarjiʿūna",null],"verseTiming":[[1,0,940],[2,940,2040],[3,2040,2290],[4,2290,3140],[5,3140,4200],[6,4200,4790],[7,4790,5710],[8,5710,6320],[9,6320,7940],[10,7940,9830],[11,9830,11830],[12,11830,12480],[13,12480,13360],[14,13360,14200],[15,14200,15530],[16,15530,18525]]}}