{"name":"30:46","price":"اس کی نشانیوں میں سے خوشخبریاں دینے والی(1) ہواؤں کو چلانا بھی ہے اس لئے کہ تمہیں اپنی رحمت سے لطف اندوز کرے(2)، اور اس لئے کہ اس کے حکم سے کشتیاں چلیں(3)، اور اس لئے کہ اس کے فضل کو تم ڈھونڈو(4)، اور اس لئے کہ تم شکر گزاری کرو.(5)","arabic":"وَمِنۡ ءَايَٰتِهِۦٓ أَن يُرۡسِلَ ٱلرِّيَاحَ مُبَشِّرَٰتٖ وَلِيُذِيقَكُم مِّن رَّحۡمَتِهِۦ وَلِتَجۡرِيَ ٱلۡفُلۡكُ بِأَمۡرِهِۦ وَلِتَبۡتَغُواْ مِن فَضۡلِهِۦ وَلَعَلَّكُمۡ تَشۡكُرُونَ","category":["30 (Ar-Rum)","Ar-Rum","Surah Ar-Rum","Chapter Ar-Rum","Rum","Surah Rum","Chapter Rum","Ar Rum","Surah Ar Rum","Chapter Ar Rum","Surah 30","Chapter 30","The Romans","الرُّوم"],"ayahNumber":3455,"juzNumber":21,"footnotes":"(1) یعنی یہ ہوائیں بارش کی پیامبر ہوتی ہیں۔\n(2) یعنی بارش سےانسان بھی لذت وسرور محسوس کرتا ہے اور فصلیں بھی لہلہا اٹھتی ہیں۔\n(3) یعنی ان ہواؤں کے ذریعے سے کشتیاں بھی چلتی ہیں۔ مراد بادبانی کشتیاں ہیں۔ اب انسان نے اللہ کی دی ہوئی دماغی صلاحیتوں کے بھرپور استعمال سے دوسری کشتیاں اور جہاز ایجاد کر لئے ہیں جو مشینوں کے ذریعے سے چلتے ہیں۔ تاہم ان کے لئے بھی موافق اور مناسب ہوائیں ضروری ہیں، ورنہ اللہ تعالیٰ انہیں بھی طوفانی موجوں کے ذریعے سے غرق آب کر دینے پر قادر ہے۔\n(4) یعنی ان کے ذریعے سے مختلف ممالک میں آجا کر تجارت وکاروبار کرکے۔\n(5) ان ظاہری وباطنی نعمتوں پر، جن کا کوئی شمار ہی نہیں۔ یعنی یہ ساری سہولتیں اللہ تعالیٰ تمہیں اس لئے بہم پہنچاتا ہے کہ تم اپنی زندگی میں ان سے فائدہ اٹھاؤ اور اللہ کی بندگی واطاعت بھی کرو!","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wamin āyātihi an yur'sila al-riyāḥa mubashirātin waliyudhīqakum min raḥmatihi walitajriya al-ful'ku bi-amrihi walitabtaghū min faḍlihi walaʿallakum tashkurūna ","translations":["And among","His Signs","(is) that","He sends","the winds","(as) bearers of glad tidings","and to let you taste","of","His Mercy","and that may sail","the ships","at His Command","and that you may seek","of","His Bounty","and that you may","be grateful","(46)"],"transliterationArr":["wamin","āyātihi","an","yur'sila","al-riyāḥa","mubashirātin","waliyudhīqakum","min","raḥmatihi","walitajriya","al-ful'ku","bi-amrihi","walitabtaghū","min","faḍlihi","walaʿallakum","tashkurūna",null],"verseTiming":[[1,0,760],[2,760,3740],[3,3740,3970],[4,3970,5500],[5,5500,6500],[6,6500,8080],[7,8080,9510],[8,9510,11350],[9,11350,13010],[10,13010,14030],[11,14030,15630],[12,15630,16850],[13,16850,17740],[14,17740,18970],[15,18970,20410],[16,20410,20810],[17,20810,22630],[18,22630,24090],[19,24090,26805]]}}