{"name":"30:5","price":"اللہ کی مدد سے(1) ، وه جس کی چاہتا ہے مدد کرتا ہے۔ اصل غالب اور مہربان وہی ہے.","arabic":"بِنَصۡرِ ٱللَّهِۚ يَنصُرُ مَن يَشَآءُۖ وَهُوَ ٱلۡعَزِيزُ ٱلرَّحِيمُ","category":["30 (Ar-Rum)","Ar-Rum","Surah Ar-Rum","Chapter Ar-Rum","Rum","Surah Rum","Chapter Rum","Ar Rum","Surah Ar Rum","Chapter Ar Rum","Surah 30","Chapter 30","The Romans","الرُّوم"],"ayahNumber":3414,"juzNumber":21,"footnotes":"(1) عہدرسالت میں دو بڑی طاقتیں تھیں۔ ایک فارس (ایران) کی، دوسری روم کی۔ اول الذکر حکومت آتش پرست اور دوسری عیسائی یعنی اہل کتاب تھی۔ مشرکین مکہ کی ہمدردیاں فارس کے ساتھ تھیں کیونکہ دونوں غیر اللہ کے پجاری تھے۔ جبکہ مسلمانوں کی ہمدردیاں روم کی عیسائی حکومت کے ساتھ تھیں، اس لیے کہ عیسائی بھی مسلمان کی طرح اہل کتاب تھے اور وحی ورسالت پر یقین رکھتے تھے۔ ان کی آپس میں ٹھنی رہتی تھی۔ نبی (صلى الله عليه وسلم) کی بعثت کے چند سال بعد ایسا ہوا کہ فارس کی حکومت عیسائی حکومت پر غالب آگئی، جس پر مشرکوں کو خوشی اور مسلمانوں کو غم ہوا، اس موقعہ پر قرآن کریم کی یہ آیات نازل ہوئیں، جن میں یہ پیش گوئی کی گئی کہ بِضْعِ سِنِينَ کے اندر رومی پھر غالب آجائیں گے اور غالب، مغلوب اور مغلوب غالب ہو جائیں گے۔ بظاہر اسباب یہ پیش گوئی ناممکن العمل نظر آتی تھی۔ تاہم مسلمانوں کو اللہ کےاس فرمان کی وجہ سےیقین تھا کہ ایسا ضرور ہو کر رہے گا۔ اسی لئےحضرت ابو بکر صدیق (رضي الله عنه) نےابوجہل سے یہ شرط باندھ لی کہ رومی پانچ سال کےاندر دوبارہ غالب آجائیں گے۔ نبی (صلى الله عليه وسلم) کے علم میں یہ بات آئی تو فرمایا کہ بِضْعٌ کا لفظ تین سےدس تک کےعدد کے لئے استعمال ہوتا ہے تم نے 5 سال کی مدت کم رکھی ہے، اس میں اضافہ کر لو۔ چنانچہ آپ (صلى الله عليه وسلم) کی ہدایت کے مطابق حضرت ابوبکر (رضي الله عنه) نے اس مدت میں اضافہ کروا لیا۔ اور پھر ایسا ہی ہوا کہ رومی 9 سال کی مدت کےاندر اندر یعنی ساتویں سال دوبارہ فارس پر غالب آگئے، جس سے یقیناً مسلمانوں کو بڑی خوشی ہوئی، (ترمذی، تفسیر سورۃ الروم) بعض کہتے ہیں کہ رومیوں کو یہ فتح اس وقت ہوئی، جب بدر میں مسلمانوں کو کافروں پر غلبہ حاصل ہوا،اور مسلمان اپنی فتح پر خوش ہوئے۔ رومیوں کی یہ فتح قرآن کریم کی صداقت کی ایک بہت بڑی دلیل ہے۔ نزدیک کی زمین سے مراد، عرب کی زمین کے قریب کے علاقے ہیں، یعنی شام وفلسطین وغیرہ، جہاں عیسائیوں کی حکومت تھی۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"binaṣri al-lahi yanṣuru man yashāu wahuwa al-ʿazīzu al-raḥīmu ","translations":["With (the) help","(of) Allah","He helps","whom","He wills","And He","(is) the All-Mighty","the Most Merciful","(5)"],"transliterationArr":["binaṣri","al-lahi","yanṣuru","man","yashāu","wahuwa","al-ʿazīzu","al-raḥīmu",null],"verseTiming":[[1,0,1090],[2,1090,4060],[3,4060,5750],[4,5750,6680],[5,6680,9409],[6,9409,9909],[7,9909,11059],[8,11059,14084]]}}