{"name":"30:55","price":"اور جس دن قیامت(1) برپا ہو جائے گی گناه گار لوگ قسمیں کھائیں گے کہ (دنیا میں) ایک گھڑی(2) کے سوا نہیں ٹھہرے، اسی طرح یہ بہکے ہوئے ہی رہے.(3)","arabic":"وَيَوۡمَ تَقُومُ ٱلسَّاعَةُ يُقۡسِمُ ٱلۡمُجۡرِمُونَ مَا لَبِثُواْ غَيۡرَ سَاعَةٖۚ كَذَٰلِكَ كَانُواْ يُؤۡفَكُونَ","category":["30 (Ar-Rum)","Ar-Rum","Surah Ar-Rum","Chapter Ar-Rum","Rum","Surah Rum","Chapter Rum","Ar Rum","Surah Ar Rum","Chapter Ar Rum","Surah 30","Chapter 30","The Romans","الرُّوم"],"ayahNumber":3464,"juzNumber":21,"footnotes":"(1) ساعت کے معنی ہیں، گھڑی، لمحہ، مراد قیامت ہے، اس کو ساعت اس لئے کہا گیا ہے کہ اس کا وقوع جب اللہ چاہے گا، ایک گھڑی میں ہو جائے گا۔ یا اس لئے کہ یہ اس گھڑی میں ہوگی جب دنیا کی آخری گھڑی ہوگی۔\n(2) دنیا میں یاقبروں میں۔ یہ اپنی عادت کے مطابق جھوٹی قسم کھائیں گے، اس لئے کہ دنیا میں وہ جتنا عرصہ رہے ہوں گے، ان کے علم میں ہی ہوگا اور اگر مراد قبر کی زندگی ہے تو ان کا حلف جہالت پر ہوگا کیونکہ وہ قبر کی مدت نہیں جانتے ہوں گے۔ بعض کہتے ہیں کہ آخرت کے شدائد اور ہولناک احوال کے مقابلے میں دنیا کی زندگی انہیں گھڑی کی طرح ہی لگے گی۔\n(3) أَفَكَ الرَّجُلُ کے معنی ہیں۔ سچ سے پھر گیا، مطلب یہ ہوگا، اسی پھرنے کے مثل وہ دنیا میں پھرتے رہے یا بہکے رہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wayawma taqūmu al-sāʿatu yuq'simu al-muj'rimūna mā labithū ghayra sāʿatin kadhālika kānū yu'fakūna ","translations":["And (the) Day","will (be) established","the Hour","will swear","the criminals","not","they remained","but","an hour","Thus","they were","deluded","(55)"],"transliterationArr":["wayawma","taqūmu","al-sāʿatu","yuq'simu","al-muj'rimūna","mā","labithū","ghayra","sāʿatin","kadhālika","kānū","yu'fakūna",null],"verseTiming":[[1,0,920],[2,920,1760],[3,1760,2820],[4,2820,3620],[5,3620,5130],[6,5130,5540],[7,5540,6300],[8,6300,6880],[9,6880,8120],[10,8120,9070],[11,9070,9920],[12,9920,12985]]}}