{"name":"30:54","price":"اللہ تعالیٰ وه ہے جس نے تمہیں کمزوری کی حالت(1) میں پیدا کیا پھر اس کمزوری کے بعد توانائی(2) دی، پھر اس توانائی کے بعد کمزوری اور بڑھاپا دیا(3) جو چاہتا ہے پیدا کرتا ہے(4)، وه سب سے پورا واقف اور سب پر پورا قادر ہے.","arabic":"۞ ٱللَّهُ ٱلَّذِي خَلَقَكُم مِّن ضَعۡفٖ ثُمَّ جَعَلَ مِنۢ بَعۡدِ ضَعۡفٖ قُوَّةٗ ثُمَّ جَعَلَ مِنۢ بَعۡدِ قُوَّةٖ ضَعۡفٗا وَشَيۡبَةٗۚ يَخۡلُقُ مَا يَشَآءُۚ وَهُوَ ٱلۡعَلِيمُ ٱلۡقَدِيرُ","category":["30 (Ar-Rum)","Ar-Rum","Surah Ar-Rum","Chapter Ar-Rum","Rum","Surah Rum","Chapter Rum","Ar Rum","Surah Ar Rum","Chapter Ar Rum","Surah 30","Chapter 30","The Romans","الرُّوم"],"ayahNumber":3463,"juzNumber":21,"footnotes":"(1) یہاں سے اللہ تعالیٰ اپنی قدرت کا ایک اور کمال بیان فرما رہا ہے اور وہ ہے مختلف اطوار سےانسان کی تخلیق۔ ضعف (کمزوری کی حالت) سےمراد نطفہ یعنی قطرۂ آب ہے یا عالم طفولیت۔\n(2) یعنی جوانی، جس میں قوائے عقلی وجسمانی تکمیل ہو جاتی ہے۔\n(3) کمزوری سے مراد کہولت کی عمر ہے جس میں عقلی وجسمانی قوتوں میں نقصان کا آغاز ہو جاتا ہے اور بڑھاپے سے مراد شیخوخت کا وہ دور ہے جس میں ضعف بڑھ جاتا ہے۔ ہمت پست، ہاتھ پیروں کی حرکت وگرفت کمزور،بال سفید اور تمام ظاہری وباطنی صفات متغیر ہو جاتی ہیں۔ قرآن نے انسان کے یہ چار بڑےاطوار بیان کیے ہیں،بعض علما نے دیگر چھوٹے چھوٹے اطوار بھی شمار کر کے انہیں قدرے تفصیل سے بیان کیا ہے جو قرآن کےاجمال کی توضیح اور اس کے اعجاز بیان کی شرح ہے مثلاً امام ابن کثیر فرماتے ہیں کہ انسان یکے بعد دیگرے ان حالات واطوار سےگزرتا ہے۔ اس کی اصل مٹی ہے۔ یعنی اس کے باپ آدم (عليه السلام) کی تخلیق مٹی سے ہوئی تھی۔ یا انسان جو کچھ کھاتا ہے، جس سے وہ منی پیدا ہوتی ہے جو رحم مادر میں جاکر اس کے وجود وتخلیق کا باعث بنتی ہے، وہ سب مٹی ہی کی پیداوار ہے پھر وہ نطفہ، نطفہ سے علقہ، پھر مضغہ، پھر ہڈیاں، جنہیں گوشت کا لباس پہنایا جاتا ہے۔ پھر اس میں روح پھونکی جاتی ہے۔ پھر ماں کے پیٹ سے اس حال میں نکلتا ہے کہ نحیف ونزار اور نہایت نرم ونازک ہوتا ہے۔ پھر بتدریج نشوونما پاتا، بچپن، بلوغت اور جوانی کو پہنچتا ہے اور پھر بتدریج رجعت قہقریٰ کا عمل شروع ہو جاتا ہے، کہولت، شیخوخت اور پھر کبر سنی (بڑھاپا) تا آنکہ موت اسے اپنی آغوش میں لے لیتی ہے۔\n(4) انہی اشیاء میں ضعف وقوت بھی ہے۔ جس سے انسان گزرتا ہے جیسا کہ ابھی تفصیل بیان ہوئی ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"al-lahu alladhī khalaqakum min ḍaʿfin thumma jaʿala min baʿdi ḍaʿfin quwwatan thumma jaʿala min baʿdi quwwatin ḍaʿfan washaybatan yakhluqu mā yashāu wahuwa al-ʿalīmu al-qadīru ","translations":["Allah","(is) the One Who","created you","from","weakness","then","made","after","after","weakness","strength","then","made","after","after","strength","weakness","and gray hair","He creates","what","He wills","and He","(is) the All-Knower","the All-Powerful","(54)"],"transliterationArr":["al-lahu","alladhī","khalaqakum","min","ḍaʿfin","thumma","jaʿala","min","baʿdi","ḍaʿfin","quwwatan","thumma","jaʿala","min","baʿdi","quwwatin","ḍaʿfan","washaybatan","yakhluqu","mā","yashāu","wahuwa","al-ʿalīmu","al-qadīru",null],"verseTiming":[[1,0,1160],[2,1160,1960],[3,1960,2930],[4,2930,4710],[5,4710,6490],[6,6490,7560],[7,7560,8250],[8,8250,9070],[9,9070,9670],[10,9670,11400],[11,11400,13000],[12,13000,14450],[13,14450,15140],[14,15140,16090],[15,16090,16750],[16,16750,18580],[17,18580,20170],[18,20170,21660],[19,21660,22510],[20,22510,22920],[21,22920,26100],[22,26100,27060],[23,27060,28080],[24,28080,30925]]}}