{"name":"31:13","price":"اور جب کہ لقمان نے وعﻆ کہتے ہوئے اپنے لڑکے سے فرمایا کہ میرے پیارے بچے! اللہ کے ساتھ شریک نہ کرنا(1) بیشک شرک بڑا بھاری ﻇلم ہے.(2)","arabic":"وَإِذۡ قَالَ لُقۡمَٰنُ لِٱبۡنِهِۦ وَهُوَ يَعِظُهُۥ يَٰبُنَيَّ لَا تُشۡرِكۡ بِٱللَّهِۖ إِنَّ ٱلشِّرۡكَ لَظُلۡمٌ عَظِيمٞ","category":["31 (Luqman)","Luqman","Surah Luqman","Chapter Luqman","Surah 31","Chapter 31","Luqman","لقمَان"],"ayahNumber":3482,"juzNumber":21,"footnotes":"(1) اللہ تعالیٰ نے حضرت لقمان کی سب سے پہلی وصیت یہ نقل فرمائی کہ انہوں نے اپنے بیٹے کو شرک سے منع فرمایا، جس سے یہ واضح ہوا کہ والدین کے لئے ضروری ہے کہ وہ اپنی اولاد کو شرک سے بچانے کی سب سے زیادہ کوشش کریں۔\n(2) یہ بعض کے نزدیک حضرت لقمان ہی کا قول ہے اور بعض نے اسے اللہ کا قول قرار دیا ہے اور اس کی تائید میں وہ حدیث پیش کی ہے جو «الَّذِينَ آمَنُوا وَلَمْ يَلْبِسُوا إِيمَانَهُمْ بِظُلْمٍ» کے نزول کے تعلق سے وارد ہے جس میں آپ (صلى الله عليه وسلم) نے فرمایا تھا کہ یہاں ظلم سے مراد عظیم ہے اور آیت «إِنَّ الشِّرْكَ لَظُلْمٌ عَظِيمٌ» کا حوالہ دیا۔ (صحیح بخاری نمبر 4776) مگر درحقیقت اس سے اللہ کا قول ہونے کی نہ تائید ہوتی ہے نہ تردید۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-idh qāla luq'mānu li-ib'nihi wahuwa yaʿiẓuhu yābunayya lā tush'rik bil-lahi inna al-shir'ka laẓul'mun ʿaẓīmun ","translations":["And when","said","Luqman","to his son","while he","(was) instructing him","O my son","(Do) not","associate partners","with Allah","Indeed","associating partners","(is) surely an injustice","great","(13)"],"transliterationArr":["wa-idh","qāla","luq'mānu","li-ib'nihi","wahuwa","yaʿiẓuhu","yābunayya","lā","tush'rik","bil-lahi","inna","al-shir'ka","laẓul'mun","ʿaẓīmun",null],"verseTiming":[[1,0,650],[2,650,1210],[3,1210,2090],[4,2090,3080],[5,3080,3660],[6,3660,4690],[7,4690,5950],[8,5950,6270],[9,6270,7070],[10,7070,9890],[11,9890,11040],[12,11040,11860],[13,11860,12810],[14,12810,15855]]}}