{"name":"31:10","price":"اسی نے آسمانوں کو بغیر ستون کے پیدا کیا ہے تم انہیں دیکھ رہے(1) ہو اور اس نے زمین میں پہاڑوں کو ڈال دیا تاکہ وه تمہیں جنبش نہ دے(2) سکے اور ہر طرح کے جاندار زمین میں پھیلا دیئے(3)۔ اور ہم نے آسمان سے پانی برسا کر زمین میں ہر قسم کے نفیس جوڑے اگا دیئے.(4)","arabic":"خَلَقَ ٱلسَّمَٰوَٰتِ بِغَيۡرِ عَمَدٖ تَرَوۡنَهَاۖ وَأَلۡقَىٰ فِي ٱلۡأَرۡضِ رَوَٰسِيَ أَن تَمِيدَ بِكُمۡ وَبَثَّ فِيهَا مِن كُلِّ دَآبَّةٖۚ وَأَنزَلۡنَا مِنَ ٱلسَّمَآءِ مَآءٗ فَأَنۢبَتۡنَا فِيهَا مِن كُلِّ زَوۡجٖ كَرِيمٍ","category":["31 (Luqman)","Luqman","Surah Luqman","Chapter Luqman","Surah 31","Chapter 31","Luqman","لقمَان"],"ayahNumber":3479,"juzNumber":21,"footnotes":"(1) تَرَوْنَها، اگر عَمَدٌ کی صفت ہو تو معنی ہوں گے ایسے ستونوں کے بغیر جنہیں تم دیکھ سکو۔ یعنی آسمان کے ستون ہیں لیکن ایسے کہ تم انہیں دیکھ نہیں سکتے۔\n(2) رَوَاسِيَ، رَاسِيَة کی جمع ہے جس کے معنی ثَابِتَةٌ کے ہیں۔ یعنی پہاڑوں کو زمین پر اس طرح بھاری بوجھ بنا کر رکھ دیا کہ جن سے زمین ثابت رہے یعنی حرکت نہ کرے۔ اسی لئے آگے فرمایا، أَنْ تَمِيدَ بِكُم يَعْنِي كَرَاهَةَ أَنْ تَمِيدَ (تَمِيلَ) بِكُمْ أَوْ لِئَلا تَمِيدَ یعنی اس بات کی ناپسندیدگی سے کہ زمین تمہارے ساتھ ادھر ادھر ڈولے، یا اس لئے کہ زمین ادھر ادھر نہ ڈولے۔ جس طرح ساحل پر کھڑے بحری جہازوں میں بڑے بڑے لنگر ڈال دیئے جاتے ہیں تاکہ جہاز نہ ڈولے زمین کے لئے پہاڑوں کی بھی یہی حیثیت ہے۔\n(3) یعنی انواع واقسام کے جانور زمین میں ہر طرف پھیلا دیئے جنہیں انسان کھاتا بھی ہے، سواری اور بار برداری کے لئے بھی استعمال کرتا ہے اور بطور زینت اور آرائش کے بھی اپنے پاس رکھتا ہے۔\n(4) زَوْجٍ یہاں صِنْفٍ کے معنی میں ہے یعنی ہرقسم کے غلے اور میوے پیدا کیے۔ ان کی صفت کریم، ان کے حسن لون اور کثرت منافع کی طرف اشارہ کرتی ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"khalaqa al-samāwāti bighayri ʿamadin tarawnahā wa-alqā fī al-arḍi rawāsiya an tamīda bikum wabatha fīhā min kulli dābbatin wa-anzalnā mina al-samāi māan fa-anbatnā fīhā min kulli zawjin karīmin ","translations":["He created","the heavens","without","pillars","that you see","and has cast","in","the earth","firm mountains","lest","it (might) shake","with you","and He dispersed","in it","from","every","creature","And We sent down","from","the sky","water","then We caused to grow","therein","of","every","kind","noble","(10)"],"transliterationArr":["khalaqa","al-samāwāti","bighayri","ʿamadin","tarawnahā","wa-alqā","fī","al-arḍi","rawāsiya","an","tamīda","bikum","wabatha","fīhā","min","kulli","dābbatin","wa-anzalnā","mina","al-samāi","māan","fa-anbatnā","fīhā","min","kulli","zawjin","karīmin",null],"verseTiming":[[1,0,570],[2,570,1930],[3,1930,2620],[4,2620,4220],[5,4220,5460],[6,5460,6870],[7,6870,7090],[8,7090,7820],[9,7820,8850],[10,8850,9880],[11,9880,10670],[12,10670,11300],[13,11300,12050],[14,12050,12880],[15,12880,13950],[16,13950,14480],[17,14480,17180],[18,17180,17330],[19,17330,20180],[20,20180,22530],[21,22530,25269],[22,25269,27189],[23,27189,28059],[24,28059,29089],[25,29089,29609],[26,29609,31299],[27,31299,33754]]}}