{"name":"31:12","price":"اور ہم نے یقیناً لقمان کو حکمت دی(1) تھی کہ تو اللہ تعالیٰ کا شکر کر(2) ہر شکر کرنے واﻻ اپنے ہی نفع کے لئے شکر کرتا ہے جو بھی ناشکری کرے وه جان لے کہ اللہ تعالیٰ بے نیاز اور تعریفوں واﻻ ہے.","arabic":"وَلَقَدۡ ءَاتَيۡنَا لُقۡمَٰنَ ٱلۡحِكۡمَةَ أَنِ ٱشۡكُرۡ لِلَّهِۚ وَمَن يَشۡكُرۡ فَإِنَّمَا يَشۡكُرُ لِنَفۡسِهِۦۖ وَمَن كَفَرَ فَإِنَّ ٱللَّهَ غَنِيٌّ حَمِيدٞ","category":["31 (Luqman)","Luqman","Surah Luqman","Chapter Luqman","Surah 31","Chapter 31","Luqman","لقمَان"],"ayahNumber":3481,"juzNumber":21,"footnotes":"(1) حضرت لقمان، اللہ کے نیک بندے تھے جنہیں اللہ تعالیٰ نے حکمت یعنی عقل وفہم اور دینی بصیرت میں ممتاز مقام عطا فرمایا تھا۔ ان سے کسی نےپوچھا تمہیں یہ فہم وشعور کس طرح حاصل ہوا؟ انہوں نے فرمایا، راست بازی، امانت کے اختیار کرنے اور بے فائدہ باتوں سے اجتناب اور خاموشی کی وجہ سے۔ ان کا حکمت ودانش پر مبنی ایک واقعہ یہ بھی مشہور ہے کہ یہ غلام تھے، ان کے آقا نے کہا کہ بکری ذبح کرکے اس کے سب سے بہترین دو حصے لاؤ، چنانچہ وہ زبان اور دل نکال کر لے گئے۔ ایک دوسرے موقعے پر آقا نے ان سے کہا کہ بکری ذبح کرکے اس کے سب سے بدترین حصے لاؤ۔ وہ پھر وہی زبان اور دل لے کر چلے گئے۔ پوچھنے پر انہوں نے بتلایا کہ زبان اور دل، اگر صحیح ہوں تو یہ سب سے بہتر ہیں اور اگر یہ بگڑ جائیں تو ان سے بدتر کوئی چیز نہیں۔ (ابن کثیر)۔\n(2) شکر کا مطلب ہے، اللہ کی نعمتوں پر اس کی حمد وثنا اور اس کے احکام کی فرماں برداری۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walaqad ātaynā luq'māna al-ḥik'mata ani ush'kur lillahi waman yashkur fa-innamā yashkuru linafsihi waman kafara fa-inna al-laha ghaniyyun ḥamīdun ","translations":["And verily","We gave","Luqman","the wisdom","that","Be grateful","to Allah","And whoever","(is) grateful","then only","he is grateful","for himself","And whoever","(is) ungrateful","then indeed","Allah","(is) Free of need","Praiseworthy","(12)"],"transliterationArr":["walaqad","ātaynā","luq'māna","al-ḥik'mata","ani","ush'kur","lillahi","waman","yashkur","fa-innamā","yashkuru","linafsihi","waman","kafara","fa-inna","al-laha","ghaniyyun","ḥamīdun",null],"verseTiming":[[1,0,820],[2,820,1990],[3,1990,2900],[4,2900,3840],[5,3840,4160],[6,4160,4650],[7,4650,7770],[8,7770,8770],[9,8770,9650],[10,9650,11610],[11,11610,12220],[12,12220,13140],[13,13140,14670],[14,14670,15260],[15,15260,16630],[16,16630,17510],[17,17510,18450],[18,18450,21475]]}}