{"name":"31:18","price":"لوگوں کے سامنے اپنے گال نہ پھلا(1) اور زمین پر اترا کر نہ چل(2) کسی تکبر کرنے والے شیخی خورے کو اللہ تعالیٰ پسند نہیں فرماتا.","arabic":"وَلَا تُصَعِّرۡ خَدَّكَ لِلنَّاسِ وَلَا تَمۡشِ فِي ٱلۡأَرۡضِ مَرَحًاۖ إِنَّ ٱللَّهَ لَا يُحِبُّ كُلَّ مُخۡتَالٖ فَخُورٖ","category":["31 (Luqman)","Luqman","Surah Luqman","Chapter Luqman","Surah 31","Chapter 31","Luqman","لقمَان"],"ayahNumber":3487,"juzNumber":21,"footnotes":"(1) یعنی تکبر نہ کر کہ لوگوں کو حقیر سمجھے اور جب وہ تجھ سے ہم کلام ہوں تو تو ان سے منہ پھیر لے۔ یا گفتگو کے وقت اپنا منہ پھیرے رکھے۔ صعر ایک بیماری ہے جو اونٹ کے سریا گردن میں ہوتی ہے۔ جس سےاس کی گردن مڑ جاتی ہے۔ یہاں بطور تکبر منہ پھیر لینے کے معنی میں یہ لفظ استعمال ہوا ہے۔ (ابن کثیر)۔\n(2) یعنی ایسی چال یا رویہ، جس سے مال ودولت یا جاہ ومنصب یا قوت وطاقت کی وجہ سے فخر وغرور کا اظہار ہوتا ہو، یہ اللہ کو ناپسند ہے، اس لئے کہ انسان ایک بندۂ عاجز وحقیر ہے، اللہ تعالیٰ کو یہی پسند ہے کہ وہ اپنی حیثیت کے مطابق عاجزی وانکساری ہی اختیار کیے رکھے اس سےتجاوز کرکے بڑائی کا اظہار نہ کرے کہ بڑائی صرف اللہ ہی کےلئے زیبا ہے جو تمام اختیارات کا مالک اور تمام خوبیوں کا منبع ہے۔ اسی لئے حدیث میں فرمایا گیا ہے کہ ”وہ شخص جنت میں نہیں جائے گا، جس کے دل میں ایک رائی کے دانے کے برابر بھی کبر ہوگا“۔ (مسند أحمد: 1/412، ترمذي، أبواب البر، ما جاء في الكبر) ”جو تکبر کے طور پر اپنے کپڑے کو کھینچتے (گھسیٹتے) ہوئے چلے گا، اللہ اس کی طرف (قیامت والے دن) نہیں دیکھے گا“۔(مسند أحمد 5 / 9، 10 وانظر البخاري، كتاب اللباس) تاہم تکبر کا اظہار کیے بغیر اللہ کے انعامات کا ذکر یا اچھا لباس اور خوراک وغیرہ کا استعمال جائز ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walā tuṣaʿʿir khaddaka lilnnāsi walā tamshi fī al-arḍi maraḥan inna al-laha lā yuḥibbu kulla mukh'tālin fakhūrin ","translations":["And (do) not","turn","your cheek","from men","and (do) not","walk","in","the earth","exultantly","Indeed","Allah","(does) not","like","every","self-conceited","boaster","(18)"],"transliterationArr":["walā","tuṣaʿʿir","khaddaka","lilnnāsi","walā","tamshi","fī","al-arḍi","maraḥan","inna","al-laha","lā","yuḥibbu","kulla","mukh'tālin","fakhūrin",null],"verseTiming":[[1,0,620],[2,620,1600],[3,1600,2420],[4,2420,4010],[5,4010,4520],[6,4520,5170],[7,5170,5380],[8,5380,6090],[9,6090,7010],[10,7010,8770],[11,8770,9520],[12,9520,9900],[13,9900,10760],[14,10760,11340],[15,11340,13240],[16,13240,15755]]}}