{"name":"31:29","price":"کیا آپ نہیں دیکھتے کہ اللہ تعالیٰ رات کو دن میں اور دن کو رات میں کھپا دیتا ہے(1) ، سورج چاند کو اسی نے فرماں بردار کر رکھا ہے ہر ایک مقرره وقت تک چلتا رہے(2)، اللہ تعالیٰ ہر اس چیز سے جو تم کرتے ہو خبردار ہے.","arabic":"أَلَمۡ تَرَ أَنَّ ٱللَّهَ يُولِجُ ٱلَّيۡلَ فِي ٱلنَّهَارِ وَيُولِجُ ٱلنَّهَارَ فِي ٱلَّيۡلِ وَسَخَّرَ ٱلشَّمۡسَ وَٱلۡقَمَرَۖ كُلّٞ يَجۡرِيٓ إِلَىٰٓ أَجَلٖ مُّسَمّٗى وَأَنَّ ٱللَّهَ بِمَا تَعۡمَلُونَ خَبِيرٞ","category":["31 (Luqman)","Luqman","Surah Luqman","Chapter Luqman","Surah 31","Chapter 31","Luqman","لقمَان"],"ayahNumber":3498,"juzNumber":21,"footnotes":"(1) یعنی رات کا کچھ حصہ لے کر دن میں شامل کر دیتا ہے، جس سے دن بڑا اور رات چھوٹی ہو جاتی ہے۔ جیسے گرمیوں میں ہوتا ہے، اور پھر دن کا کچھ حصہ لے کر رات میں شامل کر دیتا ہے، جس سے رات بڑی اور دن چھوٹا ہو جاتا ہے۔ جیسے سردیوں میں ہوتا ہے۔\n(2) مقررہ وقت تک سے مراد قیامت تک ہے یعنی سورج اور چاند کے طلوع وغروب کا یہ نظام، جس کا اللہ نے ان کو پابند کیا ہوا ہے، قیامت تک یوں ہی قائم رہے گا دوسرا مطلب ہے ایک متعینہ منزل تک یعنی اللہ نے ان کی گردش کے لئے ایک منزل اور ایک دائرہ متعین کیا ہوا ہے جہاں ان کا سفر ختم ہوتا ہے اور دوسرے روز پھر وہاں سے شروع ہو کر پہلی منزل پر آکر ٹھہر جاتا ہے۔ ایک حدیث سے بھی اس مفہوم کی تائید ہوتی ہے۔ نبی (صلى الله عليه وسلم) نے حضرت ابوذر (رضي الله عنه) سے فرمایا: جانتے ہو، یہ سورج کہاں جاتا (غروب ہوتا) ہے؟ ابوذر (رضي الله عنه) کہتے ہیں، میں نے کہا اللہ اور اس کے رسول (صلى الله عليه وسلم) خوب جانتے ہیں فرمایا: اس کی آخری منزل عرش الٰہی ہے یہ وہاں جاتا ہے اور زیر عرش سجدہ ریز ہوتا ہے پھر (وہاں سے نکلنے کی) اپنے رب سے اجازت مانگتا ہے۔ ایک وقت آئے گا کہ اس کو کہا جائے گا۔ ارجعي من حيث جئت تو جہاں سے آیا ہے وہیں لوٹ جا تو وہ مشرق سے طلوع ہونے کے بجائے مغرب سے طلوع ہوگا۔ جیسا کہ قرب قیامت کی علامت میں آتا ہے۔ (صحيح بخاري ، كتاب التوحيد ـ ومسلم، كتاب التوحيد، ومسلم، كتاب الإيمان، باب بيان الزمن الذي لا يقبل فيه الإيمان) حضرت ابن عباس (رضي الله عنهما) فرماتے ہیں سورج رہٹ کی طرح ہے، دن کو آسمان پر اپنے مدار پر چلتا رہتا ہے، جب غروب ہو جاتا ہے، تو رات کو زمین کے نیچے اپنے مدار پر چلتا رہتا ہے یہاں تک کہ مشرق سے طلوع ہو جاتا ہے۔ اسی طرح چاند کا معاملہ ہے۔ (ابن کثیر)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"alam tara anna al-laha yūliju al-layla fī al-nahāri wayūliju al-nahāra fī al-layli wasakhara al-shamsa wal-qamara kullun yajrī ilā ajalin musamman wa-anna al-laha bimā taʿmalūna khabīrun ","translations":["Do not","you see","that","Allah","causes to enter","the night","into","the day","and causes to enter","the day","into","the night","and has subjected","the sun","and the moon","each","moving","for","a term","appointed","and that","Allah","of what","you do","(is) All-Aware","(29)"],"transliterationArr":["alam","tara","anna","al-laha","yūliju","al-layla","fī","al-nahāri","wayūliju","al-nahāra","fī","al-layli","wasakhara","al-shamsa","wal-qamara","kullun","yajrī","ilā","ajalin","musamman","wa-anna","al-laha","bimā","taʿmalūna","khabīrun",null],"verseTiming":[[1,0,460],[2,460,870],[3,870,1870],[4,1870,2650],[5,2650,3340],[6,3340,4110],[7,4110,4320],[8,4320,5780],[9,5780,6710],[10,6710,8150],[11,8150,8350],[12,8350,9070],[13,9070,9970],[14,9970,10770],[15,10770,11930],[16,11930,12800],[17,12800,13570],[18,13570,14480],[19,14480,15030],[20,15030,15840],[21,15840,17400],[22,17400,19200],[23,19200,19770],[24,19770,21990],[25,21990,23860],[26,23860,24630],[27,24630,25170],[28,25170,26280],[29,26280,28245]]}}