{"name":"31:34","price":"بے شک اللہ تعالیٰ ہی کے پاس قیامت کا علم ہے وہی بارش نازل فرماتا ہے اور ماں کے پیٹ میں جو ہے اسے جانتا ہے۔ کوئی (بھی) نہیں جانتا کہ کل کیا (کچھ) کرے گا؟ نہ کسی کو یہ معلوم ہے کہ کس زمین میں مرے گا(1) ۔ (یاد رکھو) اللہ تعالیٰ ہی پورے علم واﻻ اور صحیح خبروں واﻻ ہے.","arabic":"إِنَّ ٱللَّهَ عِندَهُۥ عِلۡمُ ٱلسَّاعَةِ وَيُنَزِّلُ ٱلۡغَيۡثَ وَيَعۡلَمُ مَا فِي ٱلۡأَرۡحَامِۖ وَمَا تَدۡرِي نَفۡسٞ مَّاذَا تَكۡسِبُ غَدٗاۖ وَمَا تَدۡرِي نَفۡسُۢ بِأَيِّ أَرۡضٖ تَمُوتُۚ إِنَّ ٱللَّهَ عَلِيمٌ خَبِيرُۢ","category":["31 (Luqman)","Luqman","Surah Luqman","Chapter Luqman","Surah 31","Chapter 31","Luqman","لقمَان"],"ayahNumber":3503,"juzNumber":21,"footnotes":"(1) حدیث میں بھی آتا ہے کہ ”پانچ چیزیں مفاتیح الغیب ہیں، جنہیں اللہ کے سوا کوئی نہیں جانتا“۔ (صحيح بخاري، تفسير سورة لقمان وكتاب الاستسقاء باب لا يدري متى يجيء المطر إلا لله) 1 قرب قیامت کی علامت تو نبی (صلى الله عليه وسلم) نے بیان فرمائی ہے لیکن قیامت کے وقوع کا یقینی علم اللہ کے سوا کسی کو نہیں، کسی فرشتے کو، نہ کسی نبی مرسل کو۔ 2 بارش کا معاملہ بھی ایسا ہی ہے۔ آثار وعلائم سے تخمینہ تو لگایا جاتا اور لگایا جا سکتا ہے لیکن یہ بات ہر شخص کے تجربہ ومشاہدے کا حصہ ہے کہ یہ تخمینے کبھی صحیح نکلتے ہیں اور کبھی غلط۔ حتیٰ کہ محکمہ موسمیات کے اعلانات بھی بعض دفعہ صحیح ثابت نہیں ہوتے۔ جس سے صاف واضح ہے کہ بارش کا بھی یقینی علم اللہ کے سوا کسی کو نہیں۔ 3 رحم مادر میں مشینی ذرائع سے جنسیت کا ناقص اندازہ تو شاید ممکن ہے کہ بچہ ہے یابچی؟ لیکن ماں کے پیٹ، میں نشوونما پانے والا یہ بچہ نیک بخت ہے یا بدبخت ناقص ہوگا یا کامل۔ خوب رو ہوگا کہ بدشکل، کالا ہوگا یا گورا، وغیرہ باتوں کا علم اللہ کے سوا کسی کے پاس نہیں۔ 4 انسان کل کیا کرے گا؟ وہ دین کا معاملہ ہو یا دنیا کا؟ کسی کو آنے والے کل کے بارے میں علم نہیں ہے کہ وہ اس کی زندگی میں آئے گا بھی یا نہیں؟ اور اگر آئے گا تووہ اس کیا کچھ کرے گا؟ 5 موت کہاں آئے گی؟ گھر میں یا گھر سے باہر، اپنے وطن میں یا دیار غیر میں، جوانی میں آئے گی یا بڑھاپے میں، اپنی آرزوؤں اور خواہشات کی تکمیل کے بعد آئے گی یا اس سے پہلے؟ کسی کومعلوم نہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"inna al-laha ʿindahu ʿil'mu al-sāʿati wayunazzilu al-ghaytha wayaʿlamu mā fī al-arḥāmi wamā tadrī nafsun mādhā taksibu ghadan wamā tadrī nafsun bi-ayyi arḍin tamūtu inna al-laha ʿalīmun khabīrun ","translations":["Indeed","Allah","with Him","(is the) knowledge","(of) the Hour","and He sends down","the rain","and knows","what","(is) in","the wombs","And not","knows","any soul","what","it will earn","tomorrow","and not","knows","any soul","in what","land","it will die","Indeed","Allah","(is) All-Knower","All-Aware","(34)"],"transliterationArr":["inna","al-laha","ʿindahu","ʿil'mu","al-sāʿati","wayunazzilu","al-ghaytha","wayaʿlamu","mā","fī","al-arḥāmi","wamā","tadrī","nafsun","mādhā","taksibu","ghadan","wamā","tadrī","nafsun","bi-ayyi","arḍin","tamūtu","inna","al-laha","ʿalīmun","khabīrun",null],"verseTiming":[[1,0,1300],[2,1300,2090],[3,2090,3650],[4,3650,4230],[5,4230,5230],[6,5230,6310],[7,6310,7180],[8,7180,8090],[9,8090,8490],[10,8490,8720],[11,8720,11709],[12,11709,12729],[13,12729,13539],[14,13539,14159],[15,14159,15729],[16,15729,16579],[17,16579,17279],[18,17279,18199],[19,18199,19039],[20,19039,20559],[21,20559,21369],[22,21369,22669],[23,22669,25529],[24,25529,26989],[25,26989,27959],[26,27959,28939],[27,28939,32924]]}}