{"name":"31:30","price":"یہ سب (انتظامات) اس وجہ سے ہیں کہ اللہ تعالیٰ حق ہے اور اس کے سوا جن جن کو لوگ پکارتے ہیں(1) سب باطل ہیں اور یقیناً اللہ تعالیٰ بہت بلندیوں واﻻ اور بڑی شان واﻻ ہے.(2)","arabic":"ذَٰلِكَ بِأَنَّ ٱللَّهَ هُوَ ٱلۡحَقُّ وَأَنَّ مَا يَدۡعُونَ مِن دُونِهِ ٱلۡبَٰطِلُ وَأَنَّ ٱللَّهَ هُوَ ٱلۡعَلِيُّ ٱلۡكَبِيرُ","category":["31 (Luqman)","Luqman","Surah Luqman","Chapter Luqman","Surah 31","Chapter 31","Luqman","لقمَان"],"ayahNumber":3499,"juzNumber":21,"footnotes":"(1) یعنی یہ انتظامات یا نشانیاں، اللہ تعالیٰ تمہارے لئے ظاہر کرتا ہے تاکہ تم سمجھ لو کہ کائنات کا نظام چلانے والا صرف ایک اللہ ہے، جس کے حکم اور مشیت سے یہ سب کچھ ہو رہا ہے، اور اس کے سوا سب باطل ہے یعنی کسی کے پاس کوئی اختیار نہیں ہے بلکہ سب اس کے محتاج ہیں کیونکہ سب اس کی مخلوق اور اس کے ماتحت ہیں، ان میں سے کوئی بھی ایک ذرے کو بھی ہلانے کی قدرت نہیں رکھتا۔\n(2) اس سے برتر شان والا کوئی ہے نہ اس سے بڑا کوئی۔ اس کی عظمت شان، علوم مرتبت اور بڑائی کے سامنے ہر چیز حقیر اور پست ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"dhālika bi-anna al-laha huwa al-ḥaqu wa-anna mā yadʿūna min dūnihi al-bāṭilu wa-anna al-laha huwa al-ʿaliyu al-kabīru ","translations":["That","(is) because","Allah","He","(is) the Truth","and that","what","they call","besides Him","besides Him","(is) [the] falsehood","and that","Allah","He","(is) the Most High","the Most Great","(30)"],"transliterationArr":["dhālika","bi-anna","al-laha","huwa","al-ḥaqu","wa-anna","mā","yadʿūna","min","dūnihi","al-bāṭilu","wa-anna","al-laha","huwa","al-ʿaliyu","al-kabīru",null],"verseTiming":[[1,0,830],[2,830,2130],[3,2130,2910],[4,2910,3260],[5,3260,4120],[6,4120,5390],[7,5390,5730],[8,5730,6600],[9,6600,7540],[10,7540,8310],[11,8310,9200],[12,9200,10330],[13,10330,11140],[14,11140,11430],[15,11430,12380],[16,12380,14815]]}}