{"name":"31:6","price":"اور بعض لوگ ایسے بھی ہیں جو لغو باتوں کو مول لیتے ہیں(1) کہ بےعلمی کے ساتھ لوگوں کو اللہ کی راه سے بہکائیں اور اسے ہنسی بنائیں(2)، یہی وه لوگ ہیں جن کے لئے رسوا کرنے واﻻ عذاب ہے.(3)","arabic":"وَمِنَ ٱلنَّاسِ مَن يَشۡتَرِي لَهۡوَ ٱلۡحَدِيثِ لِيُضِلَّ عَن سَبِيلِ ٱللَّهِ بِغَيۡرِ عِلۡمٖ وَيَتَّخِذَهَا هُزُوًاۚ أُوْلَٰٓئِكَ لَهُمۡ عَذَابٞ مُّهِينٞ","category":["31 (Luqman)","Luqman","Surah Luqman","Chapter Luqman","Surah 31","Chapter 31","Luqman","لقمَان"],"ayahNumber":3475,"juzNumber":21,"footnotes":"(1) اہل سعادت، جو کتاب الٰہی سے راہ یاب اور اس کے سماع سے فیض یاب ہوتے ہیں، ان کے ذکر کے بعد ان اہل شقاوت کا بیان ہو رہا ہے جو کلام الٰہی کے سننے سے تو اعراض کرتے ہیں، البتہ ساز وموسیقی، نغمہ وسرور اور گانے وغیرہ خوب شوق سے سنتے اور ان میں دلچسپی لیتے ہیں۔ خریدنے سے مراد یہی ہے کہ آلات طرب شوق سے اپنے گھروں میں لاتے اور پھر ان سے لذت اندوز ہوتے ہیں۔ لَهْوَ الْحَدِيثِ سے مراد گانا بجانا، اس کا ساز وسامان اور آلات، سازو موسیقی اور ہر وہ چیز ہے جو انسانوں کو خیر اور معروف سے غافل کر دے۔ اس میں قصے، کہانیاں، افسانے، ڈرامے، ناول اور جنسی اور سنسنی خیز لٹریچر، رسالے اور بے حیائی کے پرچارک اخبارات سب ہی آجاتے ہیں اور جدید ترین ایجادات ریڈیو، ٹی وی، وی سی آر، ویڈیو فلمیں وغیرہ بھی۔ عہد رسالت میں بعض لوگوں نے گانے بجانے والی لونڈیاں بھی اسی مقصد کے لئے خریدی تھیں کہ وہ لوگوں کا دل گانے سنا کر بہلاتی رہیں تاکہ قرآن واسلام سے وہ دور رہیں۔ اس اعتبار سے اس میں گلوکارائیں بھی آجاتی ہیں جو آج کل فن کار، فلمی ستارہ اور ثقافتی سفیر اور پتہ نہیں کیسے کیسے مہذب، خوش نما اور دل فریب ناموں سے پکاری جاتی ہیں۔\n(2) ان تمام چیزوں سے یقیناً انسان اللہ کے راستے سےگمراہ ہو جاتے ہیں اور دین کو استہزا وتمسخر کا نشانہ بھی بناتے ہیں۔\n(3) ان کی سرپرستی اور حوصلہ افزائی کرنے والے ارباب حکومت، ادارے، اخبارات کے مالکان، اہل قلم اور فیچر نگار بھی اسی عذاب مہین کے مستحق ہوں گے۔ أَعَاذَنَا اللهُ مِنْهُ.","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wamina al-nāsi man yashtarī lahwa al-ḥadīthi liyuḍilla ʿan sabīli al-lahi bighayri ʿil'min wayattakhidhahā huzuwan ulāika lahum ʿadhābun muhīnun ","translations":["And of","the mankind","(is he) who","purchases","idle tales","idle tales","to mislead","from","(the) path","(of) Allah","without","knowledge","and takes it","(in) ridicule","Those","for them","(is) a punishment","humiliating","(6)"],"transliterationArr":["wamina","al-nāsi","man","yashtarī","lahwa","al-ḥadīthi","liyuḍilla","ʿan","sabīli","al-lahi","bighayri","ʿil'min","wayattakhidhahā","huzuwan","ulāika","lahum","ʿadhābun","muhīnun",null],"verseTiming":[[1,0,450],[2,450,2040],[3,2040,2170],[4,2170,3940],[5,3940,4500],[6,4500,5520],[7,5520,6370],[8,6370,7290],[9,7290,8360],[10,8360,8920],[11,8920,9660],[12,9660,10940],[13,10940,12380],[14,12380,13310],[15,13310,16520],[16,16520,17020],[17,17020,17960],[18,17960,21635]]}}