{"name":"32:24","price":"اور جب ان لوگوں نے صبر کیا تو ہم نے ان میں سے ایسے پیشوا بنائے جو ہمارے حکم سے لوگوں کو ہدایت کرتے تھے، اور وه ہماری آیتوں پر یقین رکھتے تھے.(1)","arabic":"وَجَعَلۡنَا مِنۡهُمۡ أَئِمَّةٗ يَهۡدُونَ بِأَمۡرِنَا لَمَّا صَبَرُواْۖ وَكَانُواْ بِـَٔايَٰتِنَا يُوقِنُونَ","category":["32 (As-Sajda)","As-Sajda","Surah As-Sajda","Chapter As-Sajda","Sajda","Surah Sajda","Chapter Sajda","As Sajda","Surah As Sajda","Chapter As Sajda","Surah 32","Chapter 32","The Prostration","السَّجدَة"],"ayahNumber":3527,"juzNumber":21,"footnotes":"(1) اس آیت سے صبر کی فضیلت واضح ہے۔ صبر کا مطلب ہے اللہ کے اوامر کے بجا لانے اور ترک زواجر میں اور اللہ کے رسولوں کی تصدیق اور ان کے اتباع میں جو تکلیفیں آئیں، انہیں خندہ پیشانی سے جھیلنا۔ اللہ نے فرمایا، ان کے صبر کرنے اور آیات الٰہی پر یقین رکھنے کی وجہ سے ہم نے ان کو دینی امامت اور پیشوائی کے منصب پر فائز کیا۔ لیکن جب انہوں نے اس کے برعکس تبدیل وتحریف کا ارتکاب شروع کر دیا، تو ان سے یہ مقام سلب کر لیا گیا۔ چنانچہ اس کے بعد ان کے دل سخت ہوگئے، پھر ان کا عمل صالح رہا اور نہ ان کا اعتقاد صحیح۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wajaʿalnā min'hum a-immatan yahdūna bi-amrinā lammā ṣabarū wakānū biāyātinā yūqinūna ","translations":["And We made","from them","leaders","guiding","by Our Command","when","they were patient","and they were","of Our Verses","certain","(24)"],"transliterationArr":["wajaʿalnā","min'hum","a-immatan","yahdūna","bi-amrinā","lammā","ṣabarū","wakānū","biāyātinā","yūqinūna",null],"verseTiming":[[1,0,1240],[2,1240,1940],[3,1940,3440],[4,3440,5090],[5,5090,6240],[6,6240,7430],[7,7430,8370],[8,8370,9600],[9,9600,11220],[10,11220,14135]]}}