{"name":"33:19","price":"تمہاری مدد میں (پورے) بخیل ہیں(1) ، پھر جب خوف ودہشت کا موقعہ آجائے تو آپ انہیں دیکھیں گے کہ آپ کی طرف نظریں جما دیتے ہیں اور ان کی انکھیں اس طرح گھومتی ہیں جیسے اس شخص کی جس پر موت کی غشی طاری ہو(2)۔ پھر جب خوف جاتا رہتا ہے تو تم پر اپنی تیز زبانوں سے بڑی باتیں بناتے ہیں(3) مال کے بڑے ہی حریص ہیں(4)، یہ ایمان ﻻئے ہی نہیں ہیں(5) اللہ تعالیٰ نے ان کے تمام اعمال نابود کر دیئے ہیں(6)، اور اللہ تعالیٰ پر یہ بہت ہی آسان ہے.(7)","arabic":"أَشِحَّةً عَلَيۡكُمۡۖ فَإِذَا جَآءَ ٱلۡخَوۡفُ رَأَيۡتَهُمۡ يَنظُرُونَ إِلَيۡكَ تَدُورُ أَعۡيُنُهُمۡ كَٱلَّذِي يُغۡشَىٰ عَلَيۡهِ مِنَ ٱلۡمَوۡتِۖ فَإِذَا ذَهَبَ ٱلۡخَوۡفُ سَلَقُوكُم بِأَلۡسِنَةٍ حِدَادٍ أَشِحَّةً عَلَى ٱلۡخَيۡرِۚ أُوْلَٰٓئِكَ لَمۡ يُؤۡمِنُواْ فَأَحۡبَطَ ٱللَّهُ أَعۡمَٰلَهُمۡۚ وَكَانَ ذَٰلِكَ عَلَى ٱللَّهِ يَسِيرٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab","Chapter Al-Ahzab","Ahzab","Surah Ahzab","Chapter Ahzab","Al Ahzab","Surah Al Ahzab","Chapter Al Ahzab","Surah 33","Chapter 33","The Combined Forces","الأحزَاب"],"ayahNumber":3552,"juzNumber":21,"footnotes":"(1) یعنی تمہارے ساتھ خندق کھود کر تم سے تعاون کرنے میں یا اللہ کی راہ میں خرچ کرنے میں یا تمہارے ساتھ مل کرلڑنے میں بخیل ہیں۔\n(2) یہ ان کی بزدلی اور پست ہمتی کی کیفیت کا بیان ہے۔\n(3) یعنی اپنی شجاعت ومردانگی کی بابت ڈینگیں مارتے ہیں، جو سراسر جھوٹ پر مبنی ہوتی ہیں، یا غنیمت کی تقسیم کے وقت اپنی زبان کی تیزی وطراری سے لوگوں کو متاثر کرکے زیادہ سے زیادہ مال حاصل کرنے کی کوشش کرتے ہیں۔ حضرت قتادہ (رضي الله عنه) فرماتے ہیں، غنیمت کی تقسیم کے وقت یہ سب سے زیادہ بخیل اور سب سے زیادہ برا حصہ لینے والے اور لڑائی کے وقت سب سے زیادہ بزدل اور ساتھیوں کو بےیارو مددگار چھوڑ کر بھاگ جانے والے ہیں۔\n(4) یادوسرا مفہوم ہے کہ خیر کا جذبہ بھی ان کےاندر نہیں ہے۔ یعنی مذکورہ خرابیوں اور کوتاہیوں کے ساتھ خیر اور بھلائی سے بھی وہ محروم ہیں۔\n(5) یعنی دل سے، بلکہ یہ منافق ہیں، کیوں کہ ان کے دل کفر وعناد سے بھرے ہوئے ہیں۔\n(6) اس لئے کہ وہ مشرک اور کافر ہیں اور کافر ومشرک کے اعمال باطل ہیں، جن پر کوئی اجر وثواب نہیں۔ یا أَحْبَطَ أَظْهَرَ کے معنی میں ہے، یعنی ان کے عملوں کے بطلان کو ظاہر کر دیا، اس لیے کہ ان کے اعمال ایسے ہیں ہی نہیں کہ وہ ثواب کے مقتضی ہوں اور اللہ ان کو باطل کر دے۔ (فتح القدیر)۔\n(7) ان کے اعمال کا برباد کر دینا، یا ان کا نفاق۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"ashiḥḥatan ʿalaykum fa-idhā jāa al-khawfu ra-aytahum yanẓurūna ilayka tadūru aʿyunuhum ka-alladhī yugh'shā ʿalayhi mina al-mawti fa-idhā dhahaba al-khawfu salaqūkum bi-alsinatin ḥidādin ashiḥḥatan ʿalā al-khayri ulāika lam yu'minū fa-aḥbaṭa al-lahu aʿmālahum wakāna dhālika ʿalā al-lahi yasīran ","translations":["Miserly","towards you","But when","comes","the fear","you see them","looking","at you","revolving","their eyes","like one who","faints","faints","from","[the] death","But when","departs","the fear","they smite you","with tongues","sharp","miserly","towards","the good","Those ","not","they have believed","so Allah made worthless","so Allah made worthless","their deeds","And is","that","for","Allah","easy","(19)"],"transliterationArr":["ashiḥḥatan","ʿalaykum","fa-idhā","jāa","al-khawfu","ra-aytahum","yanẓurūna","ilayka","tadūru","aʿyunuhum","ka-alladhī","yugh'shā","ʿalayhi","mina","al-mawti","fa-idhā","dhahaba","al-khawfu","salaqūkum","bi-alsinatin","ḥidādin","ashiḥḥatan","ʿalā","al-khayri","ulāika","lam","yu'minū","fa-aḥbaṭa","al-lahu","aʿmālahum","wakāna","dhālika","ʿalā","al-lahi","yasīran",null],"verseTiming":[[1,0,1180],[2,1180,2500],[3,2500,3220],[4,3220,4840],[5,4840,5650],[6,5650,6890],[7,6890,8520],[8,8520,9300],[9,9300,10070],[10,10070,11510],[11,11510,12250],[12,12250,13380],[13,13380,14370],[14,14370,15090],[15,15090,15910],[16,15910,16220],[17,16220,18250],[18,18250,19430],[19,19430,19940],[20,19940,20720],[21,20720,22760],[22,22760,24010],[23,24010,24980],[24,24980,26010],[25,26010,26410],[26,26410,28610],[27,28610,30810],[28,30810,31110],[29,31110,32040],[30,32040,32960],[31,32960,33780],[32,33780,35440],[33,35440,36130],[34,36130,36880],[35,36880,37260],[36,37260,38100],[37,38100,39405]]}}