{"name":"33:29","price":"اور اگر تمہاری مراد اللہ اور اس کا رسول اور آخرت کا گھر ہے تو (یقین مانو کہ) تم میں سے نیک کام کرنے والیوں کے لئے اللہ تعالیٰ نے بہت زبردست اجر رکھ چھوڑے ہیں.(1)","arabic":"وَإِن كُنتُنَّ تُرِدۡنَ ٱللَّهَ وَرَسُولَهُۥ وَٱلدَّارَ ٱلۡأٓخِرَةَ فَإِنَّ ٱللَّهَ أَعَدَّ لِلۡمُحۡسِنَٰتِ مِنكُنَّ أَجۡرًا عَظِيمٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab","Chapter Al-Ahzab","Ahzab","Surah Ahzab","Chapter Ahzab","Al Ahzab","Surah Al Ahzab","Chapter Al Ahzab","Surah 33","Chapter 33","The Combined Forces","الأحزَاب"],"ayahNumber":3562,"juzNumber":21,"footnotes":"(1) فتوحات کے نتیجے میں جب مسلمانوں کی حالت پہلے کی نسبت کچھ بہتر ہوگئی تو انصار ومہاجرین کی عورتوں کو دیکھ کر ازواج مطہرات نے بھی نان نفقہ میں اضافہ کا مطالبہ کر دیا۔ نبی (صلى الله عليه وسلم) چونکہ نہایت سادگی پسند تھے، اس لئے ازواج مطہرات کے اس مطالبے پر سخت کبیدہ خاطر ہوئے اور بیویوں سے علیحدگی اختیار کر لی جو ایک مہینے تک جاری رہی بالآخر اللہ تعالیٰ نے یہ آیت نازل فرما دی۔ اس کے بعد سب سے پہلے آپ نے حضرت عائشہ (رضی الله عنها) کو یہ آیت سنا کر انہیں اختیار دیا تاہم انہیں کہا کہ اپنے طور پر فیصلہ کرنے کے بجائے اپنے والدین سے مشورے کے بعد کوئی اقدام کرنا۔ حضرت عائشہ (رضی الله عنها) نے فرمایا۔ یہ کیسے ہو سکتا ہے کہ میں آپ کے بارے میں مشورہ کروں؟ بلکہ میں اللہ اور رسول (صلى الله عليه وسلم) کو پسند کرتی ہوں . یہی بات دیگر ازواج مطہرات (رضي الله عنه) ن نے بھی کہی اور کسی نے بھی رسول اللہ (صلى الله عليه وسلم) کو چھوڑ کر دنیا کی عیش وآرام کو ترجیح نہیں دی (صحیح بخاری، تفسیر سورۃ الاحزاب) اس وقت آپ (صلى الله عليه وسلم) کے حبالۂ عقد میں 9 بیویاں تھیں، پانچ قریش میں سے تھیں۔ حضرت عائشہ، حفصہ، ام حبیبہ، سودہ اور ام سلمہ۔ (رضي الله عنه) ن اور چار ان کے علاوہ، یعنی حضرت صفیہ، میمونہ، زینب اور جویریہ تھیں۔ (رضي الله عنهن)۔ بعض لوگ مرد کی طرف سے اختیار علیحدگی کو طلاق قرار دیتے ہیں، لیکن یہ بات صحیح نہیں۔ صحیح بات یہ ہے کہ اختیار علیحدگی کے بعد اگر عورت علیحدگی کو پسند کر لے، پھر تو یقیناً طلاق ہوجائے گی (اور یہ طلاق بھی رجعی ہوگی نہ کہ بائنہ، جیسا کہ بعض علما کا مسلک ہے) تاہم اگر عورت علیحدگی کو اختیار نہیں کرتی تو پھر طلاق نہیں ہوگی، جیسے ازواج مطہرات (رضي الله عنه) ن نے علیحدگی کے بجائے حرم رسول (صلى الله عليه وسلم) میں ہی رہنا پسند کیا تو اس اختیار کو طلاق شمار نہیں کیا گیا۔ (صحيح بخاري ، كتاب الطلاق ، باب من خير نساءه ، مسلم باب بيان أن تخيير امرأته لا يكون طلاقا إلا بالنية)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-in kuntunna turid'na al-laha warasūlahu wal-dāra al-ākhirata fa-inna al-laha aʿadda lil'muḥ'sināti minkunna ajran ʿaẓīman ","translations":["But if","you","desire","Allah","and His Messenger","and the Home","(of) the Hereafter","then indeed","Allah","has prepared","for the good-doers","among you","a reward","great","(29)"],"transliterationArr":["wa-in","kuntunna","turid'na","al-laha","warasūlahu","wal-dāra","al-ākhirata","fa-inna","al-laha","aʿadda","lil'muḥ'sināti","minkunna","ajran","ʿaẓīman",null],"verseTiming":[[1,0,1340],[2,1340,3370],[3,3370,4030],[4,4030,4880],[5,4880,6290],[6,6290,7160],[7,7160,8370],[8,8370,9530],[9,9530,10360],[10,10360,11070],[11,11070,12630],[12,12630,14530],[13,14530,15210],[14,15210,16795]]}}