{"name":"33:21","price":"یقیناً تمہارے لئے رسول اللہ میں عمده نمونہ (موجود) ہے(1) ، ہر اس شخص کے لئے جو اللہ تعالیٰ کی اور قیامت کے دن کی توقع رکھتا ہے اور بکثرت اللہ تعالیٰ کی یاد کرتا ہے.(2)","arabic":"لَّقَدۡ كَانَ لَكُمۡ فِي رَسُولِ ٱللَّهِ أُسۡوَةٌ حَسَنَةٞ لِّمَن كَانَ يَرۡجُواْ ٱللَّهَ وَٱلۡيَوۡمَ ٱلۡأٓخِرَ وَذَكَرَ ٱللَّهَ كَثِيرٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab","Chapter Al-Ahzab","Ahzab","Surah Ahzab","Chapter Ahzab","Al Ahzab","Surah Al Ahzab","Chapter Al Ahzab","Surah 33","Chapter 33","The Combined Forces","الأحزَاب"],"ayahNumber":3554,"juzNumber":21,"footnotes":"(1) یعنی اے مسلمانو ! اور منافقو ! تم سب کے لئے رسول اللہ (صلى الله عليه وسلم) کی ذات کے اندر بہترین نمونہ ہے، پس تم جہاد میں اور صبر وثبات میں اسی کی پیروی کرو۔ ہمارا یہ پیغمبر جہاد میں بھوکا رہا حتیٰ کہ اسے پیٹ پر پتھر باندھنے پڑے، اس کا چہرہ زخمی ہو گیا، اس کا رباعی دانت ٹوٹ گیا، خندق اپنے ہاتھوں سے کھودی اور تقریباً ایک مہینہ دشمن کے سامنے سینہ سپر رہا۔ یہ آیت اگرچہ جنگ احزاب کے ضمن میں نازل ہوئی ہے جس میں جنگ کے موقعے پر بطور خاص رسول اللہ (صلى الله عليه وسلم) کے اسوۂ حسنہ کو سامنے رکھنے اور اس کی اقتدا کرنے کا حکم دیا گیا ہے۔ لیکن یہ حکم عام ہے یعنی آپ (صلى الله عليه وسلم) کے تمام اقوال، افعال اور احوال میں مسلمانوں کے لئے آپ (صلى الله عليه وسلم) کی اقتدا ضروری ہے چاہے ان کا تعلق عبادات سے ہو یا معاشرت سے، معیشت سے، یا سیاست سے، زندگی کے ہر شعبے میں آپ کی ہدایات واجب الاتباع ہیں۔ وَمَا آتَاكُمُ الرَّسُولُ فَخُذُوهُ الآية (الحشر) اور إِنْ كُنْتُمْ تُحِبُّونَ اللَّهَ الآية (آل عمران: 31) کا مفاد بھی یہی ہے۔\n(2) اس سے یہ واضح ہوگیا کہ اسوۂ رسول (صلى الله عليه وسلم) کو وہی اپنائے گا جو آخرت میں اللہ کی ملاقات پر یقین رکھتا اور کثرت سے اللہ کا ذکر کرتا ہے۔ آج مسلمان بھی بالعموم ان دونوں وصفوں سے محروم ہیں، اس لئے اسوۂ رسول (صلى الله عليه وسلم) کی بھی کوئی اہمیت ان کے دلوں میں نہیں ہے۔ ان میں جو اہل دین ہیں ان کے پیشوا، پیر اور مشائخ ہیں اور جو اہل دنیا واہل سیاست ہیں ان کے مرشد ورہنما آقایان مغرب ہیں۔ رسول اللہ (صلى الله عليه وسلم) سےعقیدت کے زبانی دعوے بڑے ہیں، لیکن آپ (صلى الله عليه وسلم) کو مرشد اور پیشوا ماننے کے لئے ان میں سے کوئی بھی آمادہ نہیں ہے۔ فَإِلَى اللهِ الْمُشْتَكَى۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"laqad kāna lakum fī rasūli al-lahi us'watun ḥasanatun liman kāna yarjū al-laha wal-yawma al-ākhira wadhakara al-laha kathīran ","translations":["Certainly","is","for you","in","(the) Messenger","(of) Allah","an excellent example","an excellent example","for (one) who","has","hope","(in) Allah","and the Day","the Last","and remembers","Allah","much","(21)"],"transliterationArr":["laqad","kāna","lakum","fī","rasūli","al-lahi","us'watun","ḥasanatun","liman","kāna","yarjū","al-laha","wal-yawma","al-ākhira","wadhakara","al-laha","kathīran",null],"verseTiming":[[1,0,600],[2,600,1140],[3,1140,1700],[4,1700,2090],[5,2090,2870],[6,2870,3590],[7,3590,4470],[8,4470,5260],[9,5260,6660],[10,6660,7240],[11,7240,8020],[12,8020,9890],[13,9890,11480],[14,11480,12050],[15,12050,12690],[16,12690,13500],[17,13500,14390],[18,14390,15440],[19,15440,16150],[20,16150,16870],[21,16870,18605]]}}