{"name":"33:27","price":"اور اس نے تمہیں ان کی زمینوں کا اور ان کے گھر بار کا اور ان کے مال کا وارث کر دیا(1) اور اس زمین کا بھی جس کو تمہارے قدموں نے روندا نہیں(2)، اللہ تعالیٰ ہر چیز پر قادر ہے.","arabic":"وَأَوۡرَثَكُمۡ أَرۡضَهُمۡ وَدِيَٰرَهُمۡ وَأَمۡوَٰلَهُمۡ وَأَرۡضٗا لَّمۡ تَطَـُٔوهَاۚ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab","Chapter Al-Ahzab","Ahzab","Surah Ahzab","Chapter Ahzab","Al Ahzab","Surah Al Ahzab","Chapter Al Ahzab","Surah 33","Chapter 33","The Combined Forces","الأحزَاب"],"ayahNumber":3560,"juzNumber":21,"footnotes":"(1) اس میں غزوۂ بنی قریظہ کا ذکر ہے جیسا کہ پہلے گزرا کہ اس قبیلے نے نقض عہد کرکے جنگ احزاب میں مشرکوں اور دوسرے یہودیوں کا ساتھ دیا تھا۔ چنانچہ جنگ احزاب سے واپس آکر رسول اللہ (صلى الله عليه وسلم) ابھی غسل ہی فرما سکے تھے کہ حضرت جبرائیل (عليه السلام) آگئے اور کہا کہ آپ (صلى الله عليه وسلم) نے ہتھیار رکھ دیے؟ ہم فرشتوں نے تو نہیں رکھے ہیں۔ چلئے، اب بنو قریظہ کے ساتھ نمٹنا ہے، مجھے اللہ نے اسی لئے آپ (صلى الله عليه وسلم) کی طرف بھیجا ہے۔ چنانچہ آپ نے مسلمانوں میں اعلان فرما دیا بلکہ ان کو تاکید کر دی کہ عصر کی نماز وہاں جا کر پڑھنی ہے۔ ان کی آبادی مدینے سے چند میل کے فاصلے پر تھی۔ یہ اپنے قلعوں میں بند ہو گئے، باہر سے مسلمانوں نے ان کا محاصرہ کر لیا جو کم وبیش پچیس روز جاری رہا۔ بالآخر انہوں نے سعد بن معاذ (رضي الله عنه) کو اپنا حکم (ثالث) تسلیم کر لیا کہ وہ جو فیصلہ بابت دیں گے، ہمیں منظور ہوگا۔ چنانچہ انہوں نے یہ فیصلہ دیا کہ ان سے لڑنے والے لوگوں کو قتل اور بچوں، عورتوں کو قیدی بنا لیا جائے اور ان کا مال مسلمانوں میں تقسیم کر دیا جائے۔ نبی (صلى الله عليه وسلم) نے یہ فیصلہ سن کر فرمایا کہ یہی فیصلہ آسمانوں کے اوپر االلہ تعالیٰ کا بھی ہے۔ اس کے مطابق ان کے جنگ جو افراد کی گردنیں اڑا دی گئیں۔ اور مدینے کو ان کے ناپاک وجود سے پاک کر دیا گیا۔ (دیکھئے صحیح بخاری، باب غزوۂ خندق) أَنْزَلَ قلعوں سے نیچے اتار دیا، ظَاهَرُوهُمْ کافروں کی انہوں نے مدد کی۔\n(2) بعض نے اس سے خیبر کی زمین مراد لی ہے کیونکہ اس کے بعد ہی 6 ہجری میں صلح حدیبیہ کے بعد مسلمانوں نے خیبر فتح کیا ہے۔ بعض نے کہا کہ مکہ ہے اور بعض نے ارض فارس وروم کو اس کا مصداق قرار دیا ہے اور بعض کے نزدیک تمام وہ زمینیں ہیں جو قیامت تک مسلمان فتح کریں گے۔ (فتح القدیر)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-awrathakum arḍahum wadiyārahum wa-amwālahum wa-arḍan lam taṭaūhā wakāna al-lahu ʿalā kulli shayin qadīran ","translations":["And He caused you to inherit","their land","and their houses","and their properties","and a land","not","you (had) trodden","And Allah is","And Allah is","on","every","thing","All-Powerful","(27)"],"transliterationArr":["wa-awrathakum","arḍahum","wadiyārahum","wa-amwālahum","wa-arḍan","lam","taṭaūhā","wakāna","al-lahu","ʿalā","kulli","shayin","qadīran",null],"verseTiming":[[1,0,1380],[2,1380,2360],[3,2360,3810],[4,3810,5280],[5,5280,6250],[6,6250,6600],[7,6600,7860],[8,7860,8940],[9,8940,9840],[10,9840,10440],[11,10440,11080],[12,11080,12610],[13,12610,14595]]}}