{"name":"33:37","price":"(یاد کرو) جب کہ تو اس شخص سے کہہ رہا تھا جس پر اللہ نے بھی انعام کیا اور تو نے بھی کہ تو اپنی بیوی کو اپنے پاس رکھ اور اللہ سے ڈر اور تو اپنے دل میں وه بات چھپائے ہوئے تھا جسے اللہ ﻇاہر کرنے واﻻ تھا اور تو لوگوں سے خوف کھاتا تھا، حاﻻنکہ اللہ تعالیٰ اس کا زیاده حق دار تھا کہ تو اس سے ڈرے(1) ، پس جب کہ زید نے اس عورت سے اپنی غرض پوری کرلی(2) ہم نے اسے تیرے نکاح میں دے دیا(3) تاکہ مسلمانوں پر اپنے لے پالکوں کی بیویوں کے بارے میں کسی طرح کی تنگی نہ رہے جب کہ وه اپنی غرض ان سے پوری کرلیں(4)، اللہ کا (یہ) حکم تو ہو کر ہی رہنے واﻻ تھا.(5)","arabic":"وَإِذۡ تَقُولُ لِلَّذِيٓ أَنۡعَمَ ٱللَّهُ عَلَيۡهِ وَأَنۡعَمۡتَ عَلَيۡهِ أَمۡسِكۡ عَلَيۡكَ زَوۡجَكَ وَٱتَّقِ ٱللَّهَ وَتُخۡفِي فِي نَفۡسِكَ مَا ٱللَّهُ مُبۡدِيهِ وَتَخۡشَى ٱلنَّاسَ وَٱللَّهُ أَحَقُّ أَن تَخۡشَىٰهُۖ فَلَمَّا قَضَىٰ زَيۡدٞ مِّنۡهَا وَطَرٗا زَوَّجۡنَٰكَهَا لِكَيۡ لَا يَكُونَ عَلَى ٱلۡمُؤۡمِنِينَ حَرَجٞ فِيٓ أَزۡوَٰجِ أَدۡعِيَآئِهِمۡ إِذَا قَضَوۡاْ مِنۡهُنَّ وَطَرٗاۚ وَكَانَ أَمۡرُ ٱللَّهِ مَفۡعُولٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab","Chapter Al-Ahzab","Ahzab","Surah Ahzab","Chapter Ahzab","Al Ahzab","Surah Al Ahzab","Chapter Al Ahzab","Surah 33","Chapter 33","The Combined Forces","الأحزَاب"],"ayahNumber":3570,"juzNumber":22,"footnotes":"(1) لیکن چونکہ ان کے مزاج میں فرق تھا، بیوی کے مزاج میں خاندانی نسب وشرف رچا ہوا تھا، جب کہ زید (رضي الله عنه) کے دامن پر غلامی کا داغ تھا، ان کی آپس میں ان بن رہتی تھی جس کا تذکرہ حضرت زید (رضي الله عنه) نبی کریم (صلى الله عليه وسلم) سے کرتے رہتے تھے اور طلاق کا عندیہ بھی ظاہر کرتے۔ لیکن نبی کریم (صلى الله عليه وسلم) ان کو طلاق دینے سے روکتے اور نباہ کرنے کی تلقین فرماتے۔ علاوہ ازیں اللہ تعالیٰ نے آپ (صلى الله عليه وسلم) کو اس پیش گوئی سے بھی آگاہ فرما دیا تھا کہ زید (رضي الله عنه) کی طرف سےطلاق واقع ہو کر رہے گی اور اس کے بعد زینب (رضی الله عنها) کا نکاح آپ سے کردیا جائے گا تاکہ جاہلیت کی اس رسم تبنیت پر ا یک کاری ضرب لگا کر واضح کردیا جائے کہ منہ بولا بیٹا، احکام شرعیہ میں حقیقی بیٹے کی طرح نہیں ہے اور اس کی مطلقہ سے نکاح جائز ہے۔ اس آیت میں ان ہی باتوں کی طرف اشارہ کیا گیا ہے۔ حضرت زید (رضي الله عنه) پر اللہ کا انعام یہ تھا کہ انہیں قبول اسلام کی توفیق دی اور غلامی سے نجات دلائی، نبی کریم (صلى الله عليه وسلم) کا احسان ان پر یہ تھا کہ ان کی دینی تربیت کی۔ ان کو آزاد کرکے اپنا بیٹا قرار دیا اور اپنی پھوپھی امیمہ بنت عبدالمطلب کی لڑکی سے ان کا نکاح کرادیا۔ دل میں چھپانے والی بات یہی تھی جو آپ کو حضرت زینب (رضی الله عنها) سے نکاح کی بابت بذریعہ وحی بتلائی گئی تھی، آپ (صلى الله عليه وسلم) ڈرتے اس بات سے تھے کہ لوگ کہیں گے اپنی بہو سے نکاح کرلیا۔ حالانکہ جب اللہ کو آپ کے ذریعے سے اس رسم کا خاتمہ کرنا تھا تو پھر لوگوں سے ڈرنے کی ضرورت نہیں تھی۔ آپ (صلى الله عليه وسلم) کا یہ خوف اگرچہ فطری تھا، اس کے باوجود آپ (صلى الله عليه وسلم) کو تنبیہ فرمائی گئی۔ ظاہر کرنے سے مراد یہی ہے کہ یہ نکاح ہوگیا، جس سے یہ بات سب کے ہی علم میں آجائے گی۔\n(2) یعنی نکاح کے بعد طلاق دی اور حضرت زینب (رضی الله عنها) عدت سے فارغ ہوگئیں۔\n(3) یعنی یہ نکاح معروف طریقے کے برعکس صرف اللہ کے حکم سے نکاح قرار پاگیا، نکاح خوانی، ولایت، حق مہر اور گواہوں کے بغیر ہی۔\n(4) یہ حضرت زینب (رضی الله عنها) سے، نبی کریم (صلى الله عليه وسلم) کے نکاح کی علت ہے کہ آئندہ کوئی مسلمان اس بارے میں تنگی محسوس نہ کرے اور حسب ضرورت اقتضا لےپالک بیٹے کی مطلقہ بیوی سے نکاح کیا جاسکے۔\n(5) یعنی پہلے سے ہی تقدیر الٰہی میں تھا جو بہرصورت ہو کر رہنا تھا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-idh taqūlu lilladhī anʿama al-lahu ʿalayhi wa-anʿamta ʿalayhi amsik ʿalayka zawjaka wa-ittaqi al-laha watukh'fī fī nafsika mā al-lahu mub'dīhi watakhshā al-nāsa wal-lahu aḥaqqu an takhshāhu falammā qaḍā zaydun min'hā waṭaran zawwajnākahā likay lā yakūna ʿalā al-mu'minīna ḥarajun fī azwāji adʿiyāihim idhā qaḍaw min'hunna waṭaran wakāna amru al-lahi mafʿūlan ","translations":["And when","you said","to the one","Allah bestowed favor","Allah bestowed favor","on him","and you bestowed favor","on him","Keep","to yourself","your wife","and fear","Allah","But you concealed","within","yourself","what","Allah","(was to) disclose","And you fear","the people","while Allah","has more right","that","you (should) fear Him","So when","ended","Zaid","from her","necessary (formalities)","We married her to you","so that","not","there be","on","the believers","any discomfort","concerning","the wives","(of) their adopted sons","when","they have ended","from them","necessary (formalities)","And is","(the) Command","(of) Allah","accomplished","(37)"],"transliterationArr":["wa-idh","taqūlu","lilladhī","anʿama","al-lahu","ʿalayhi","wa-anʿamta","ʿalayhi","amsik","ʿalayka","zawjaka","wa-ittaqi","al-laha","watukh'fī","fī","nafsika","mā","al-lahu","mub'dīhi","watakhshā","al-nāsa","wal-lahu","aḥaqqu","an","takhshāhu","falammā","qaḍā","zaydun","min'hā","waṭaran","zawwajnākahā","likay","lā","yakūna","ʿalā","al-mu'minīna","ḥarajun","fī","azwāji","adʿiyāihim","idhā","qaḍaw","min'hunna","waṭaran","wakāna","amru","al-lahi","mafʿūlan",null],"verseTiming":[[1,0,600],[2,600,1360],[3,1360,3450],[4,3450,4100],[5,4100,4900],[6,4900,5720],[7,5720,6790],[8,6790,7590],[9,7590,8210],[10,8210,9110],[11,9110,9910],[12,9910,10620],[13,10620,12410],[14,12410,13780],[15,13780,14570],[16,14570,15420],[17,15420,16150],[18,16150,16930],[19,16930,17870],[20,17870,18310],[21,18310,19070],[22,19070,19200],[23,19200,19980],[24,19980,20870],[25,20870,21590],[26,21590,24660],[27,24660,25400],[28,25400,27020],[29,27020,27960],[30,27960,28650],[31,28650,29480],[32,29480,32310],[33,32310,34330],[34,34330,34920],[35,34920,35540],[36,35540,37190],[37,37190,38340],[38,38340,40170],[39,40170,40500],[40,40500,41050],[41,41050,41770],[42,41770,42230],[43,42230,43490],[44,43490,44180],[45,44180,45080],[46,45080,45630],[47,45630,46410],[48,46410,46790],[49,46790,48170],[50,48170,49540],[51,49540,51290],[52,51290,52240],[53,52240,55030],[54,55030,55550],[55,55550,56180],[56,56180,57740],[57,57740,59010],[58,59010,59680],[59,59680,60280],[60,60280,61020],[61,61020,62625]]}}