{"name":"33:32","price":"اے نبی کی بیویو! تم عام عورتوں کی طرح نہیں ہو(1) ، اگر تم پرہیزگاری اختیار کرو تو نرم لہجے سے بات نہ کرو کہ جس کے دل میں روگ ہو وه کوئی برا خیال کرے(2) اور ہاں قاعدے کے مطابق کلام کرو.(3)","arabic":"يَٰنِسَآءَ ٱلنَّبِيِّ لَسۡتُنَّ كَأَحَدٖ مِّنَ ٱلنِّسَآءِ إِنِ ٱتَّقَيۡتُنَّۚ فَلَا تَخۡضَعۡنَ بِٱلۡقَوۡلِ فَيَطۡمَعَ ٱلَّذِي فِي قَلۡبِهِۦ مَرَضٞ وَقُلۡنَ قَوۡلٗا مَّعۡرُوفٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab","Chapter Al-Ahzab","Ahzab","Surah Ahzab","Chapter Ahzab","Al Ahzab","Surah Al Ahzab","Chapter Al Ahzab","Surah 33","Chapter 33","The Combined Forces","الأحزَاب"],"ayahNumber":3565,"juzNumber":22,"footnotes":"(1) یعنی تمہاری حیثیت اور مرتبہ عام عورتوں کا سا نہیں ہے۔ بلکہ اللہ نے تمہیں رسول اللہ (صلى الله عليه وسلم) کی زوجیت کا جو شرف عطا فرمایا ہے، اس کی وجہ سے تمہیں ایک امتیازی مقام حاصل ہے اور رسول (صلى الله عليه وسلم) کی طرح تمہیں بھی امت کے لئے ایک نمونہ بننا ہے چنانچہ انہیں ان کے مقام و مرتبے سے آگاہ کرکے انہیں کچھ ہدایات دی جا رہی ہیں۔ اس کی مخاطب اگرچہ ازواج مطہرات ہیں جنہیں امہات المومنین قرار دیا گیا ہے، لیکن انداز بیان سے صاف ظاہر ہے کہ مقصد پوری امت مسلمہ کی عورتوں کو سمجھانا اور متنبہ کرنا ہے۔ اس لئے یہ ہدایات تمام مسلمان عورتوں کے لئے ہیں۔\n(2) اللہ تعالیٰ نے جس طرح عورت کے وجود کے اندر مرد کے لئے جنسی کشش رکھی ہے (جس کی حفاظت کے لئے بھی خصوصی ہدایات دی گئی ہیں تاکہ عورت مرد کے لئے فتنے کا باعث نہ بنے) اسی طرح اللہ تعالیٰ نے عورتوں کی آواز میں بھی فطری طور پر دلکشی، نرمی اور نزاکت رکھی ہے جو مرد کو اپنی طرف کھیچنتی ہے۔ بنابریں اس آواز کے لئے بھی یہ ہدایت دی گئی کہ مردوں سے گفتگو کرتے وقت قصداً ایسا لب و لہجہ اختیار کرو کہ نرمی اور لطافت کی جگہ قدرے سختی اور روکھا پن ہو۔ تاکہ کوئی بدباطن تمہاری طرف مائل نہ ہو اور اس کے دل میں برا خیال پیدا نہ ہو۔\n(3) یعنی یہ روکھاپن، صرف لہجے کی حد تک ہی ہو، زبان سے ایسا لفظ نہ نکالنا جو معروف قاعدے اور اخلاق کے منافی ہو۔ إِنِ اتَّقَيْتُنَّ کہہ کر اشارہ کردیا کہ یہ بات اور دیگر ہدایات، جو آگے آ رہی ہیں، متقی عورتوں کے لئے ہیں، کیونکہ انہیں ہی یہ فکر ہوتی ہے کہ ان کی آخرت برباد نہ ہوجائے۔ جن کے دل خوف الٰہی سے عاری ہیں، انہیں ان ہدایات سے کیا تعلق؟ اور وہ کب ان ہدایات کی پروا کرتی ہیں؟","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yānisāa al-nabiyi lastunna ka-aḥadin mina al-nisāi ini ittaqaytunna falā takhḍaʿna bil-qawli fayaṭmaʿa alladhī fī qalbihi maraḍun waqul'na qawlan maʿrūfan ","translations":["O wives","(of) the Prophet","You are not","like anyone","among","the women","If","you fear (Allah)","then (do) not","be soft","in speech","lest should be moved with desire","he who","in","his heart","(is) a disease","but say","a word","appropriate","(32)"],"transliterationArr":["yānisāa","al-nabiyi","lastunna","ka-aḥadin","mina","al-nisāi","ini","ittaqaytunna","falā","takhḍaʿna","bil-qawli","fayaṭmaʿa","alladhī","fī","qalbihi","maraḍun","waqul'na","qawlan","maʿrūfan",null],"verseTiming":[[1,0,2800],[2,2800,4550],[3,4550,5970],[4,5970,6650],[5,6650,7620],[6,7620,11200],[7,11200,11600],[8,11600,13380],[9,13380,13940],[10,13940,14970],[11,14970,15910],[12,15910,16860],[13,16860,17630],[14,17630,18020],[15,18020,19000],[16,19000,20410],[17,20410,21120],[18,21120,21750],[19,21750,24245]]}}