{"name":"33:40","price":"(لوگو) تمہارے مردوں میں سے کسی کے باپ محمد ﴿صلی اللہ علیہ وسلم﴾ نہیں(1) لیکن آپ اللہ تعالیٰ کے رسول ہیں اور تمام نبیوں کے ختم کرنے والے(2)، اور اللہ تعالی ہر چیز کا (بخوبی) جاننے واﻻ ہے.","arabic":"مَّا كَانَ مُحَمَّدٌ أَبَآ أَحَدٖ مِّن رِّجَالِكُمۡ وَلَٰكِن رَّسُولَ ٱللَّهِ وَخَاتَمَ ٱلنَّبِيِّـۧنَۗ وَكَانَ ٱللَّهُ بِكُلِّ شَيۡءٍ عَلِيمٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab","Chapter Al-Ahzab","Ahzab","Surah Ahzab","Chapter Ahzab","Al Ahzab","Surah Al Ahzab","Chapter Al Ahzab","Surah 33","Chapter 33","The Combined Forces","الأحزَاب"],"ayahNumber":3573,"juzNumber":22,"footnotes":"(1) اس لئے وہ زید بن حارثہ (رضي الله عنه) کے بھی باپ نہیں ہیں، جس پر انہیں مورد طعن بنایا جاسکے کہ انہوں نے اپنی بہو سے نکاح کیوں کرلیا؟ ایک زید (رضي الله عنه) ہی کیا، وہ تو کسی بھی مرد کے باپ نہیں ہیں۔ کیونکہ زید (رضي الله عنه) تو حارثہ کے بیٹے تھے، آپ (صلى الله عليه وسلم) نے تو انہیں منہ بولا بیٹا بنایا ہوا تھا اور جاہلی دستور کے مطابق انہیں زید بن محمد کہا جاتا تھا، حقیقتاً وہ آپ (صلى الله عليه وسلم) کے صلبی بیٹے نہیں تھے۔ اس لئے ادْعُوهُمْ لآبَائِهِمْ کے نزول کے بعد انہیں زید بن حارثہ (رضي الله عنه) ہی کہا جاتا تھا، علاوہ ازیں حضرت خدیجہ (رضی الله عنها) سے آپ (صلى الله عليه وسلم) کے تین بیٹے، قاسم، طاہر، طیب ہوئے اور ایک ابراہیم بچہ ماریہ قبطیہ (رضی الله عنها) کے بطن سے ہوا۔ لیکن یہ سب کے سب بچپن میں ہی فوت ہوگئے، ان میں سے کوئی بھی عمر رجولیت کو نہیں پہنچا۔ بنابریں آپ (صلى الله عليه وسلم) کی صلبی اولاد میں سے بھی کوئی مرد نہیں بنا کہ جس کے آپ باپ ہوں (ابن کثیر)۔\n(2) خَاتَمٌ مہر کو کہتے ہیں اور مہر آخری عمل ہی کو کہا جاتا ہے۔ یعنی آپ (صلى الله عليه وسلم) پر نبوت ورسالت کا خاتمہ کردیا گیا، آپ (صلى الله عليه وسلم) کے بعد جو بھی نبوت کا دعویٰ کرے گا، وہ نبی نہیں کذاب و دجال ہوگا۔ احادیث میں اس مضمون کو تفصیل سے بیان کیا گیا ہے اور اس پر پوری امت کا اجماع واتفاق ہے۔ قیامت کے قریب حضرت عیسیٰ (عليه السلام) کا نزول ہوگا، جو صحیح اور متواتر روایات سے ثابت ہے، تو وہ نبی کی حیثیت سے نہیں آئیں گے بلکہ نبی کریم (صلى الله عليه وسلم) کے امتی بن کر آئیں گے، اس لئے ان کا نزول عقیدہ آخرت نبوت کے منافی نہیں ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"mā kāna muḥammadun abā aḥadin min rijālikum walākin rasūla al-lahi wakhātama al-nabiyīna wakāna al-lahu bikulli shayin ʿalīman ","translations":["Not","is","Muhammad","(the) father","(of) anyone","of","your men","but","(he is the) Messenger","(of) Allah","and Seal","(of) the Prophets","And Allah is","And Allah is","of every","thing","All-Knower","(40)"],"transliterationArr":["mā","kāna","muḥammadun","abā","aḥadin","min","rijālikum","walākin","rasūla","al-lahi","wakhātama","al-nabiyīna","wakāna","al-lahu","bikulli","shayin","ʿalīman",null],"verseTiming":[[1,0,390],[2,390,940],[3,940,2720],[4,2720,4460],[5,4460,5050],[6,5050,5950],[7,5950,7290],[8,7290,8200],[9,8200,9000],[10,9000,11400],[11,11400,12140],[12,12140,12950],[13,12950,13790],[14,13790,14900],[15,14900,18150],[16,18150,18800],[17,18800,19630],[18,19630,20350],[19,20350,21090],[20,21090,22675]]}}