{"name":"33:5","price":"لے پالکوں کو ان کے (حقیقی) باپوں کی طرف نسبت کر کے بلاؤ اللہ کے نزدیک پورا انصاف یہی(1) ہے۔ پھر اگر تمہیں ان کے (حقیقی) باپوں کا علم ہی نہ ہو تو وه تمہارے دینی بھائی اور دوست ہیں(2)، تم سے بھول چوک میں جو کچھ ہو جائے اس میں تم پر کوئی گناه نہیں(3)، البتہ گناه وه ہے جس کا تم اراده دل سے کرو(4)۔ اللہ تعالیٰ بڑا ہی بخشنے واﻻ مہربان ہے.","arabic":"ٱدۡعُوهُمۡ لِأٓبَآئِهِمۡ هُوَ أَقۡسَطُ عِندَ ٱللَّهِۚ فَإِن لَّمۡ تَعۡلَمُوٓاْ ءَابَآءَهُمۡ فَإِخۡوَٰنُكُمۡ فِي ٱلدِّينِ وَمَوَٰلِيكُمۡۚ وَلَيۡسَ عَلَيۡكُمۡ جُنَاحٞ فِيمَآ أَخۡطَأۡتُم بِهِۦ وَلَٰكِن مَّا تَعَمَّدَتۡ قُلُوبُكُمۡۚ وَكَانَ ٱللَّهُ غَفُورٗا رَّحِيمًا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab","Chapter Al-Ahzab","Ahzab","Surah Ahzab","Chapter Ahzab","Al Ahzab","Surah Al Ahzab","Chapter Al Ahzab","Surah 33","Chapter 33","The Combined Forces","الأحزَاب"],"ayahNumber":3538,"juzNumber":21,"footnotes":"(1) اس حکم سے اس رواج کی ممانعت کر دی گئی جو زمانۂ جاہلیت سے چلا آرہا تھا اور ابتدائے اسلام میں بھی رائج تھا کہ لے پالک بیٹوں کو حقیقی بیٹا سمجھا جاتا تھا۔ صحابہ کرام (رضي الله عنهم) بیان فرماتے ہیں کہ ہم زید بن حارثہ ! کو (جنہیں رسول اللہ (صلى الله عليه وسلم) ) نے آزاد کرکے بیٹا بنا لیا تھا) زید بن محمد ( (صلى الله عليه وسلم) ) کہہ کر پکارﺗے تھے، حتیٰ کہ قرآن کریم کی آیت ادْعُوهُمْ لآبَائِهِمْ نازل ہوگئی۔ (صحیح بخاری، تفسیر سورۃ الاحزاب) اس آیت کے نزول کے بعد حضرت ابو حذیفہ ! کے گھر میں بھی ایک مسئلہ پیدا ہو گیا، جنہوں نے سالم کو بیٹا بنایا ہوا تھا جب منہ بولے بیٹوں کو حقیقی بیٹا سمجھنے سے روک دیا گیا تو اس سے پردہ کرنا ضروری ہوگیا نبی (صلى الله عليه وسلم) نے حضرت ابو حذیفہ ! کی بیوی کو کہا کہ اسےدودھ پلا کر اپنا رضاعی بیٹا بنالو کیونکہ اس طرح تم اس پر حرام ہو جاؤ گی۔ چنانچہ انہوں نے ایسا ہی کیا۔ (صحيح مسلم، كتاب الرضاع، باب رضاعة الكبير ، أبو داود، كتاب النكاح، باب فيمن حرم به)۔\n(2) یعنی جن کے حقیقی باپوں کا علم ہے، اب دوسری نسبت ختم کرکے انہیں کی طرف انہیں منسوب کرو، البتہ جن کے باپوں کا علم نہ ہو سکے تو تم انہیں اپنا بھائی اور دوست سمجھو، بیٹا مت سمجھو۔\n(3) اس لئے کہ خطا ونسیان معاف ہے، جیسا کہ حدیث میں بھی صراحت ہے۔\n(4) یعنی جو جان بوجھ کر غلط انتساب کرے گا، وہ سخت گناہ گار ہوگا۔ حدیث میں آتاہے۔ جس نے جانتے بوجھتے اپنے کو غیر باپ کی طرف منسوب کیا۔ اس نے کفر کا ارتکاب کیا۔ (صحيح بخاري، كتاب المناقب ، باب ، نسبة اليمن إلى إسماعيل عليه السلام)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"id'ʿūhum liābāihim huwa aqsaṭu ʿinda al-lahi fa-in lam taʿlamū ābāahum fa-ikh'wānukum fī al-dīni wamawālīkum walaysa ʿalaykum junāḥun fīmā akhṭatum bihi walākin mā taʿammadat qulūbukum wakāna al-lahu ghafūran raḥīman ","translations":["Call them","by their fathers","it","(is) more just","near","Allah","But if","not","you know","their fathers ","then (they are) your brothers","in","[the] religion","and your friends","But not is","upon you","any blame","in what","you made a mistake","in it","but","what","intended","your hearts","And Allah","And Allah","(is) Oft-Forgiving","Most Merciful","(5)"],"transliterationArr":["id'ʿūhum","liābāihim","huwa","aqsaṭu","ʿinda","al-lahi","fa-in","lam","taʿlamū","ābāahum","fa-ikh'wānukum","fī","al-dīni","wamawālīkum","walaysa","ʿalaykum","junāḥun","fīmā","akhṭatum","bihi","walākin","mā","taʿammadat","qulūbukum","wakāna","al-lahu","ghafūran","raḥīman",null],"verseTiming":[[1,0,1170],[2,1170,4290],[3,4290,4610],[4,4610,5480],[5,5480,6990],[6,6990,9090],[7,9090,9500],[8,9500,10050],[9,10050,12190],[10,12190,14950],[11,14950,16430],[12,16430,16710],[13,16710,17440],[14,17440,19460],[15,19460,20150],[16,20150,21060],[17,21060,22590],[18,22590,24510],[19,24510,25960],[20,25960,26780],[21,26780,27700],[22,27700,28530],[23,28530,30360],[24,30360,31490],[25,31490,32640],[26,32640,33570],[27,33570,34290],[28,34290,35945]]}}