{"name":"33:59","price":"اے نبی! اپنی بیویوں سے اور اپنی صاحبزادیوں سے اور مسلمانوں کی عورتیں سے کہہ دو کہ وه اپنے اوپر اپنی چادریں لٹکا لیا کریں(1) ، اس سے بہت جلد ان کی شناخت ہو جایا کرے گی پھر نہ ستائی جائیں گی(2)، اور اللہ تعالیٰ بخشنے واﻻ مہربان ہے.","arabic":"يَٰٓأَيُّهَا ٱلنَّبِيُّ قُل لِّأَزۡوَٰجِكَ وَبَنَاتِكَ وَنِسَآءِ ٱلۡمُؤۡمِنِينَ يُدۡنِينَ عَلَيۡهِنَّ مِن جَلَٰبِيبِهِنَّۚ ذَٰلِكَ أَدۡنَىٰٓ أَن يُعۡرَفۡنَ فَلَا يُؤۡذَيۡنَۗ وَكَانَ ٱللَّهُ غَفُورٗا رَّحِيمٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab","Chapter Al-Ahzab","Ahzab","Surah Ahzab","Chapter Ahzab","Al Ahzab","Surah Al Ahzab","Chapter Al Ahzab","Surah 33","Chapter 33","The Combined Forces","الأحزَاب"],"ayahNumber":3592,"juzNumber":22,"footnotes":"(1) جَلابِيبُ، جِلْبَابٌ کی جمع ہے، جو ایسی بڑی چادر کو کہتے ہیں جس سے پورا بدن ڈھک جائے۔ اپنے اوپر چادر لٹکانے سے مراد اپنے چہرے پر اس طرح گھونگٹ نکالنا ہے کہ جس سے چہرے کا بیشتر حصہ بھی چھپ جائے اور نظر جھکا کر چلنے سے راستہ بھی نظر آتا جائے۔ پاک وہند یا دیگر اسلامی ممالک میں برقعے کی جو مختلف صورتیں ہیں، عہد رسالت میں یہ برقعے عام نہیں تھے، پھربعد میں معاشرت میں وہ سادگی نہ رہی جو عہد رسالت اور صحابہ و تابعین کے دور میں تھی، عورتیں نہایت سادہ لباس پہنتی تھیں، بناؤ سنگھار اور زیب وزینت کاکوئی جذبہ ان کے اندر نہیں ہوتا تھا۔ اس لئے ایک بڑی چادر سے بھی پردے کے تقاضے پورے ہو جاتے تھے۔ لیکن بعد میں یہ سادگی نہ رہی، اس کی جگہ تجمل اور زینت لے لی اور عورتوں کے اندر زرق برق لباس اور زیورات کی نمائش عام ہو گئی، جس کی وجہ سے چادر سے پردہ کرنا مشکل ہوگیا اور اس کی جگہ مختلف انداز کے برقعے عام ہو گئے۔ گو اس سے بعض دفعہ عورت کو، بالخصوص سخت گرمی میں، کچھ دقت بھی محسوس ہوتی ہے۔ لیکن یہ ذرا سی تکلیف شریعت کے تقاضوں کے مقابلے میں کوئی اہمیت نہیں رکھتی۔ تاہم جو عورت برقعے کے بجائے پردے کے لئے بڑی چادر استعمال کرتی ہے اور پورے بدن کو ڈھانپتی اور چہرے پر صحیح معنوں میں گھونگٹ نکالتی ہے، وہ یقیناً پردے کے حکم کو بجا لاتی ہے، کیونکہ برقعہ ایسی لازمی شئی نہیں ہے جسے شریعت نے پردے کے لئے لازمی قرار دیا ہو۔ لیکن آج کل عورتوں نے چادر کو بےپردگی اختیار کرنے کا ذریعے بنا لیا ہے۔ پہلے وہ برقعے کی جگہ چادر اوڑھنا شروع کرتی ہیں۔ پھر چادر بھی غائب ہوجاتی ہے، صرف دوپٹہ رہ جاتا ہے اور بعض عورتوں کے لئے اس کا لینا بھی گراں ہوتا ہے۔ اس صورت حال کو دیکھتے ہوئے کہنا پڑتا ہے کہ اب برقع کا استعمال ہی صحیح ہے کیوں کہ جب سے برقعے کی جگہ چادر نے لی ہے، بےپردگی عام ہوگئی ہے بلکہ عورتیں نیم برہنگی پر بھی فخر کرنے لگی ہیں فَإِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ، بہرحال اس آیت میں نبی کریم (صلى الله عليه وسلم) کی بیویوں، بیٹیوں اور عام مومن عورتوں کو گھر سے باہر نکلتے وقت پردے کا حکم دیا گیا ہے، جس سے واضح ہے کہ پردے کا حکم علما کا ایجاد کردہ نہیں ہے، جیسا کہ آج کل بعض لوگ باور کراتے ہیں، یا اس کو قرار واقعی اہمیت نہیں دیتے، بلکہ یہ اللہ کا حکم ہے جو قرآن کی نص سے ثابت ہے، اس سے اعراض، انکار اور بےپردگی پر اصرار کفر تک پہنچا سکتا ہے۔ دوسری بات اس سے یہ معلوم ہوئی کہ نبی کریم (صلى الله عليه وسلم) کی ایک بیٹی نہیں تھی جیسا کہ رافضیوں کا عقیدہ ہے، بلکہ آپ (صلى الله عليه وسلم) کی ایک سے زائد بیٹیاں تھیں جیسا کہ نص قرآنی سے واضح ہے اور یہ چار تھیں جیسا کہ تاریخ وسیر اور احادیث کی کتابوں سے ثابت ہے۔\n(2) یہ پردے کی حکمت اور اس کے فائدے کا بیان ہے کہ اس سے ایک شریف زادی اور باحیا عورت اور بےشرم اور بدکار عورت کے درمیان پہچان ہوگی۔ پردے سے معلوم ہوگا کہ یہ خاندانی عورت ہے جس سے چھیڑ چھاڑ کی جرات کسی کو نہیں ہوگی، اس کے برعکس بےپردہ عورت اوباشوں کی نگاہوں کا مرکز اور ان کی بوالہوسی کا نشانہ بنے گی۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāayyuhā al-nabiyu qul li-azwājika wabanātika wanisāi al-mu'minīna yud'nīna ʿalayhinna min jalābībihinna dhālika adnā an yuʿ'rafna falā yu'dhayna wakāna al-lahu ghafūran raḥīman ","translations":["O Prophet","O Prophet","Say","to your wives","and your daughters","and (the) women","(of) the believers","to draw","over themselves","[of]","their outer garments","That","(is) more suitable","that","they should be known","and not","harmed","And is","Allah","Oft-Forgiving","Most Merciful","(59)"],"transliterationArr":["yāayyuhā","al-nabiyu","qul","li-azwājika","wabanātika","wanisāi","al-mu'minīna","yud'nīna","ʿalayhinna","min","jalābībihinna","dhālika","adnā","an","yuʿ'rafna","falā","yu'dhayna","wakāna","al-lahu","ghafūran","raḥīman",null],"verseTiming":[[1,0,2540],[2,2540,4090],[3,4090,4390],[4,4390,5850],[5,5850,7040],[6,7040,9240],[7,9240,10490],[8,10490,11510],[9,11510,13300],[10,13300,14370],[11,14370,16610],[12,16610,17860],[13,17860,19930],[14,19930,20200],[15,20200,21750],[16,21750,22320],[17,22320,24560],[18,24560,25640],[19,25640,26530],[20,26530,27280],[21,27280,28575]]}}