{"name":"33:56","price":"اللہ تعالیٰ اور اس کے فرشتے اس نبی پر رحمت بھیجتے ہیں۔ اے ایمان والو! تم (بھی) ان پر درود بھیجو اور خوب سلام (بھی) بھیجتے رہا کرو.(1)","arabic":"إِنَّ ٱللَّهَ وَمَلَٰٓئِكَتَهُۥ يُصَلُّونَ عَلَى ٱلنَّبِيِّۚ يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ صَلُّواْ عَلَيۡهِ وَسَلِّمُواْ تَسۡلِيمًا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab","Chapter Al-Ahzab","Ahzab","Surah Ahzab","Chapter Ahzab","Al Ahzab","Surah Al Ahzab","Chapter Al Ahzab","Surah 33","Chapter 33","The Combined Forces","الأحزَاب"],"ayahNumber":3589,"juzNumber":22,"footnotes":"(1) اس آیت میں نبی کریم (صلى الله عليه وسلم) کے اس مرتبہ و منزلت کا بیان ہے جو ملأ اعلیٰ (آسمانوں) میں آپ (صلى الله عليه وسلم) کو حاصل ہے اور وہ یہ کہ اللہ تبارک تعالیٰ فرشتوں میں آپ (صلى الله عليه وسلم) کی ثناو تعریف کرتا اور آپ (صلى الله عليه وسلم) پر رحمتیں بھیجتا ہے اور فرشتے بھی آپ (صلى الله عليه وسلم) کی بلندی درجات کی دعا کرتے ہیں۔ اس کے ساتھ ہی اللہ تعالیٰ نے عالم سفلی (اہل زمین) کو حکم دیا کہ وہ بھی آپ (صلى الله عليه وسلم) پر صلوٰۃ وسلام بھیجیں تاکہ آپ (صلى الله عليه وسلم) کی تعریف میں علوی اورسفلی دونوں عالم متحد ہوجائیں۔ حدیث میں آتا ہے، صحابہ کرام (رضي الله عنهم) نے عرض کیا، یا رسول اللہ ! سلام کا طریقہ تو ہم جانتے ہیں (یعنی التحیات میں السَّلامُ عَلَيْكَ أَيُّهَا النَّبِيُّ ! پڑھتے ہیں) ہم درود کس طرح پڑھیں؟ اس پر آپ (صلى الله عليه وسلم) نے وہ درود ابراہیمی بیان فرمایا جو نمازمیں پڑھا جاتا ہے۔ (صحيح بخاري، تفسير سورة الأحزاب) علاوہ ازیں احادیث میں درود کے اور بھی صیغے آتے ہیں، جو پڑھے جاسکتے ہیں۔ نیز مختصراً صلی اللہ علیٰ رسول اللہ وسلم بھی پڑھا جاسکتا ہے تاہم الصَّلاةُ وَالسَّلامُ عَلَيْكَ يَا رَسُولَ اللهِ ! پڑھنا اس لئے صحیح نہیں کہ اس میں نبی کریم (صلى الله عليه وسلم) سے خطاب ہے اور یہ صیغہ نبی کریم سے عام درود کے وقت منقول نہیں ہے اور تحیات میں السَّلامُ عَلَيْكَ أَيُّهَا النَّبِيُّ ! چونکہ آپ (صلى الله عليه وسلم) سے منقول ہے اس وجہ سے اس وقت میں پڑھنے میں کوئی قباحت نہیں مزید برآں اس کا پڑھنے والا اس فاسد عقیدے سے پڑھتا ہے کہ آپ (صلى الله عليه وسلم) اسے براہ راست سنتے ہیں۔ یہ عقیدہ فاسدہ قرآن و حدیث کے خلاف ہے اور اس عقیدے سے مذکورہ خانہ ساز درود پڑھنا بھی غیر صحیح ہے۔ اسی طرح اذان سے قبل اسے پڑھنا بھی بدعت ہے، جو ثواب نہیں، گناہ ہے۔ احادیث میں درود کی بڑی فضیلت وارد ہے۔ نماز میں اس کا پڑھنا واجب ہے یا سنت؟ جمہور علما اسے سنت سمجھتے ہیں اور امام شافعی اور بہت سے علما واجب۔ اور احادیث سے اس کے وجوب ہی کی تائید ہوتی ہے۔ اسی طرح احادیث سے یہ بھی معلوم ہوتا ہے کہ جس طرح آخری تشہد میں درود پڑھنا واجب ہے، پہلے تشہد میں بھی درود پڑھنے کی وہی حیثیت ہے۔ اس لئے نماز کے دونوں تشہد میں درود پڑھنا ضروری ہے۔\nاس کے دلائل مختصراً حسب ذیل ہیں۔\nایک دلیل یہ ہے کہ مسند احمد میں صحیح سند سے مروی ہے کہ ایک شخص نے نبی کریم (صلى الله عليه وسلم) سے سوال کیا، یا رسول اللہ (صلى الله عليه وسلم) آپ (صلى الله عليه وسلم) پر سلام کس طرح پڑھنا ہے، یہ تو ہم نے جان لیا (کہ ہم تشہد میں السَّلامُ عَلَيْكَ پڑھتے ہیں) لیکن جب ہم نماز میں ہوں تو آپ (صلى الله عليه وسلم) پر درود کس طرح پڑھیں؟ تو آپ (صلى الله عليه وسلم) نے درود ابراہیمی کی تلقین فرمائی (الفتح الربانی، ج 4، ص 20۔21) مسند احمد کے علاوہ یہ روایت صحیح ابن حبان، سنن کبری بیہقی، مستدرک حاکم اور ابن خزیمہ میں بھی ہے۔ اس میں صراحت ہے کہ جس طرح سلام نماز میں پڑھا جاتا ہے یعنی تشہد میں، اسی طرح یہ سوال بھی نماز کے اندر درود پڑھنے سے متعلق تھا، نبی (صلى الله عليه وسلم) نے درود ابراہیمی پڑھنے کا حکم فرمایا۔ جس سے معلوم ہوا کہ نماز میں سلام کے ساتھ درود بھی پڑھنا چاہیئے، اور اس کا مقام تشہد ہے۔ اور حدیث میں یہ عام ہے، اسے پہلے یا دوسرے تشہد کے ساتھ خاص نہیں کیا گیا ہے جس سے یہ استدلال کرنا صحیح ہے کہ (پہلے اور دوسرے) دونوں تشہد میں سلام اور درود پڑھا جائے۔ اور جن روایات میں تشہد اول کا بغیر درود کے ذکر ہے، انہیں سورۂ احزاب کی آیت صَلُّوا عَلَيْهِ وَسَلِّمُوا کے نزول سے پہلے پر محمول کیا جائے گا۔ لیکن اس آیت کے نزول یعنی 5 ہجری کے بعد جب نبی (صلى الله عليه وسلم) نے صحابہ (رضي الله عنهم) کے استفسار پر درود کے الفاظ بھی بیان فرما دیئے تو اب نماز میں سلام کے ساتھ صلوٰۃ (درود شریف) کا پڑھنا بھی ضروری ہوگیا، چاہے وہ پہلا تشہد ہو یا دوسرا۔ اس کی ایک اور دلیل یہ ہے کہ حضرت عائشہ (رضی الله عنها) نے بیان فرمایا کہ نبی (صلى الله عليه وسلم) (بعض دفعہ) رات کو 9 رکعات ادا فرماتے، آٹھویں رکعت میں تشہد بیٹھتے تو اس میں اپنے رب سے دعا کرتے اور اس کے پیغمبر (صلى الله عليه وسلم) پر درود پڑھتے، پھر سلام پھیرے بغیر کھڑے ہوجاتے اور نویں رکعت پوری کرکے تشہد میں بیٹھتےتو اپنے رب سے دعا کرتے اور اس کے پیغمبر پر درود پڑھتے اور پھر دعا کرتے، پھر سلام پھیر دیتے (السنن الكبرى للبيهقي، ج2 ص704 طبع جديد سنن النسائي، مع التعليقات السلفية، كتاب قيام الليل، ج1 ص202۔ مزید ملاحظہ ہو، صفة صلاة النبي صلى الله عليه وسلم للألباني صفحة 145) اس میں بالکل صراحت ہے کہ نبی (صلى الله عليه وسلم) نے اپنی رات کی نماز میں پہلے اور آخری دونوں تشہد میں درود پڑھا ہے۔ یہ اگرچہ نفلی نماز کا واقعہ ہے لیکن مذکورہ عمومی دلائل کی آپ (صلى الله عليه وسلم) کے اس عمل سے تائید ہوجاتی ہے، اس لئے اسے صرف نفلی نماز تک محدود کردینا صحیح نہیں ہوگا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"inna al-laha wamalāikatahu yuṣallūna ʿalā al-nabiyi yāayyuhā alladhīna āmanū ṣallū ʿalayhi wasallimū taslīman ","translations":["Indeed","Allah","and His Angels","send blessings","upon","the Prophet","O you who believe","O you who believe","O you who believe","Send blessings","on him","and greet him","(with) greetings","(56)"],"transliterationArr":["inna","al-laha","wamalāikatahu","yuṣallūna","ʿalā","al-nabiyi","yāayyuhā","alladhīna","āmanū","ṣallū","ʿalayhi","wasallimū","taslīman",null],"verseTiming":[[1,0,1080],[2,1080,2000],[3,2000,5120],[4,5120,6350],[5,6350,6720],[6,6720,8440],[7,8440,11770],[8,11770,12740],[9,12740,13750],[10,13750,14590],[11,14590,15360],[12,15360,16510],[13,16510,18415]]}}