{"name":"33:51","price":"ان میں سے جسے تو چاہے دور رکھ دے اور جسے چاہے اپنے پاس رکھ لے(1) ، اور اگر تو نے ان میں سے بھی کسی کو اپنے پاس بلالے جنہیں تو نے الگ کر رکھا تھا تو تجھ پر کوئی گناه نہیں(2)، اس میں اس بات کی زیاده توقع ہے کہ ان عورتوں کی آنکھیں ٹھنڈی رہیں اور وه رنجیده نہ ہوں اور جو کچھ بھی تو انہیں دے دے اس پر سب کی سب راضی رہیں(3)۔ تمہارے دلوں میں جو کچھ ہے اسے اللہ (خوب) جانتا ہے(4)۔ اللہ تعالیٰ بڑا ہی علم اور حلم واﻻ ہے.","arabic":"۞ تُرۡجِي مَن تَشَآءُ مِنۡهُنَّ وَتُـٔۡوِيٓ إِلَيۡكَ مَن تَشَآءُۖ وَمَنِ ٱبۡتَغَيۡتَ مِمَّنۡ عَزَلۡتَ فَلَا جُنَاحَ عَلَيۡكَۚ ذَٰلِكَ أَدۡنَىٰٓ أَن تَقَرَّ أَعۡيُنُهُنَّ وَلَا يَحۡزَنَّ وَيَرۡضَيۡنَ بِمَآ ءَاتَيۡتَهُنَّ كُلُّهُنَّۚ وَٱللَّهُ يَعۡلَمُ مَا فِي قُلُوبِكُمۡۚ وَكَانَ ٱللَّهُ عَلِيمًا حَلِيمٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab","Chapter Al-Ahzab","Ahzab","Surah Ahzab","Chapter Ahzab","Al Ahzab","Surah Al Ahzab","Chapter Al Ahzab","Surah 33","Chapter 33","The Combined Forces","الأحزَاب"],"ayahNumber":3584,"juzNumber":22,"footnotes":"(1) اس کا تعلق إِنَّا أَحْلَلْنَا سے ہے یعنی مذکورہ تمام عورتوں کی آپ (صلى الله عليه وسلم) کے لئے حلت اس لئے ہے تاکہ آپ (صلى الله عليه وسلم) کو تنگی محسوس نہ ہو اور آپ (صلى الله عليه وسلم) ان میں سے کسی کے ساتھ نکاح میں گناہ نہ سمجھیں۔\n(2) یعنی جن بیویوں کی باریاں موقوف کر رکھی تھیں اگر آپ (صلى الله عليه وسلم) چاہیں کہ ان سے بھی مباشرت کا تعلق قائم کیا جائے، تو یہ اجازت بھی آپ (صلى الله عليه وسلم) کو حاصل ہے۔\n(3) یعنی باری موقوف ہونے اور ایک کو دوسری پر ترجیح دینے کے باوجود وہ خوش ہوں گی، غمگین نہیں ہوں گی اور جتنا کچھ آپ (صلى الله عليه وسلم) کی طرف سے انہیں مل جائے گا، اس پر مطمئن رہیں گی۔ کیوں؟ اس لئے کہ انہیں معلوم ہے کہ پیغمبر (صلى الله عليه وسلم) یہ سب کچھ اللہ کے حکم اور اجازت سے کر رہے ہیں اور یہ ازواج مطہرات اللہ کے فیصلہ پر راضی اور مطمئن ہیں۔ بعض کہتے ہیں کہ نبی کریم (صلى الله عليه وسلم) کو یہ اختیار ملنے کے باوجود آپ (صلى الله عليه وسلم) نے اسے استعمال نہیں کیا اور سوائے حضرت سودہ (رضی الله عنها) کے (کہ انہوں نے اپنی باری خود ہی حضرت عائشہ (رضی الله عنها) کے لئے ہبہ کردی تھی) آپ (صلى الله عليه وسلم) نے تمام ازواج مطہرات کی باریاں برابر برابر مقرر کر رکھی تھیں، اس لئے آپ (صلى الله عليه وسلم) نے مرض الموت میں ازواج مطہرات سے اجازت لے کر بیماری کے ایام حضرت عائشہ (رضی الله عنها) کے پاس گزارے ”أَنْ تَقَرَّ أَعْيُنُهُنَّ“ کا تعلق آپ (صلى الله عليه وسلم) کے اسی طرز عمل سے ہے کہ آپ (صلى الله عليه وسلم) پر تقسیم اگرچہ (دوسرے لوگوں کی طرح) واجب نہیں تھی، اس کے باوجود آپ (صلى الله عليه وسلم) نے تقسیم کو اختیار فرمایا، تاکہ آپ (صلى الله عليه وسلم) کی بیویوں کی آنکھیں ٹھنڈی ہوجائیں اور آپ (صلى الله عليه وسلم) کے اس حسن سلوک اور عدل وانصاف سے خوش ہوجائیں کہ آپ (صلى الله عليه وسلم) نے خصوصی اختیار استعمال کرنے کے بجائے ان کی دلجوئی اور دلداری کا اہتمام فرمایا۔\n(4) یعنی تمہارے دلوں میں جو کچھ ہے، ان میں یہ بات بھی یقیناً ہے کہ سب بیویوں کی محبت دل میں یکساں نہیں ہے۔ کیوں کہ دل پر انسان کا اختیار ہی نہیں ہے۔ اس لئے بیویوں کے درمیان مساوات باری میں، نان و نفقہ اور دیگر ضروریات زندگی اور آسائشوں میں ضروری ہے، جس کا اہتمام انسان کرسکتا ہے۔ دلوں کے میلان میں مساوات چونکہ اختیار ہی میں نہیں ہے۔ اس لئے اللہ تعالیٰ اس پر گرفت بھی نہیں فرمائے گا بشرطیکہ دلی محبت کسی ایک بیوی سے امتیازی سلوک کا باعث نہ ہو۔ اسی لئے نبی کریم (صلى الله عليه وسلم) فرمایا کرتے تھے یااللہ یہ میری تقسیم ہے جو میرے اختیار میں ہے، لیکن جس چیز پر تیرا اختیار ہے، میں اس پر اختیار نہیں رکھتا، اس میں مجھے ملامت نہ کرنا۔ (أبو داود، باب القسم في النساء، ترمذي، نسائي، ابن ماجه، مسند أحمد 6 / 144)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"tur'jī man tashāu min'hunna watu'wī ilayka man tashāu wamani ib'taghayta mimman ʿazalta falā junāḥa ʿalayka dhālika adnā an taqarra aʿyunuhunna walā yaḥzanna wayarḍayna bimā ātaytahunna kulluhunna wal-lahu yaʿlamu mā fī qulūbikum wakāna al-lahu ʿalīman ḥalīman ","translations":["You may defer","whom","you will","of them","or you may take","to yourself","whom","you will","And whoever","you desire","of those whom","you (had) set aside ","then (there is) no","blame","upon you","That","(is) more suitable","that","may be cooled","their eyes","and not","they grieve","and they may be pleased","with what","you have given them ","all of them","And Allah","knows","what","(is) in","your hearts","And Allah is","And Allah is","All-Knower","Most Forbearing","(51)"],"transliterationArr":["tur'jī","man","tashāu","min'hunna","watu'wī","ilayka","man","tashāu","wamani","ib'taghayta","mimman","ʿazalta","falā","junāḥa","ʿalayka","dhālika","adnā","an","taqarra","aʿyunuhunna","walā","yaḥzanna","wayarḍayna","bimā","ātaytahunna","kulluhunna","wal-lahu","yaʿlamu","mā","fī","qulūbikum","wakāna","al-lahu","ʿalīman","ḥalīman",null],"verseTiming":[[1,0,820],[2,820,1610],[3,1610,3690],[4,3690,5080],[5,5080,7400],[6,7400,8120],[7,8120,9070],[8,9070,9920],[9,9920,11890],[10,11890,12390],[11,12390,13340],[12,13340,14430],[13,14430,15250],[14,15250,15770],[15,15770,16530],[16,16530,18240],[17,18240,19430],[18,19430,21030],[19,21030,21840],[20,21840,22650],[21,22650,24370],[22,24370,24850],[23,24850,26230],[24,26230,27220],[25,27220,28880],[26,28880,30900],[27,30900,32620],[28,32620,33940],[29,33940,34700],[30,34700,35030],[31,35030,35390],[32,35390,36870],[33,36870,37550],[34,37550,38290],[35,38290,39130],[36,39130,40735]]}}