{"name":"33:57","price":"جو لوگ اللہ اور اس کے رسول کو ایذا دیتے ہیں ان پر دنیا اور آخرت میں اللہ کی پھٹکار ہے اور ان کے لئے نہایت رسوا کن عذاب ہے.(1)","arabic":"إِنَّ ٱلَّذِينَ يُؤۡذُونَ ٱللَّهَ وَرَسُولَهُۥ لَعَنَهُمُ ٱللَّهُ فِي ٱلدُّنۡيَا وَٱلۡأٓخِرَةِ وَأَعَدَّ لَهُمۡ عَذَابٗا مُّهِينٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab","Chapter Al-Ahzab","Ahzab","Surah Ahzab","Chapter Ahzab","Al Ahzab","Surah Al Ahzab","Chapter Al Ahzab","Surah 33","Chapter 33","The Combined Forces","الأحزَاب"],"ayahNumber":3590,"juzNumber":22,"footnotes":"(1) اللہ کا ایذا دینے کا مطلب ان افعال کا ارتکاب ہے جسے وہ ناپسند فرماتا ہے۔ ورنہ اللہ کو ایذا پہنچانے پر کون قادر ہے؟ جیسے مشرکین، یہود اور نصاریٰ وغیرہ اللہ کے لئے اولاد ثابت کرتے ہیں۔ یا جس طرح حدیث قدسی میں ہے، اللہ تعالیٰ فرماتا ہے ابن آدم مجھے ایذا دیتا ہے، زمانے کو گالی دیتا ہے، حالانکہ میں ہی زمانہ ہوں اس کے رات اور دن کی گردش میرے ہی حکم سے ہوتی ہے۔ (صحيح بخاري، تفسير سورة الجاثية ومسلم، كتاب الألفاظ من الأدب، باب النهي عن سب الدهر) یعنی یہ کہنا کہ زمانے نے یا فلک کج رفتار نے ایسا کردیا، یہ صحیح نہیں، اس لئے کہ افعال اللہ کے ہیں، زمانے یا فلک کے نہیں۔ اللہ کے رسول (صلى الله عليه وسلم) کو ایذا پہنچانا، آپ (صلى الله عليه وسلم) کی تکذیب، آپ (صلى الله عليه وسلم) کو شاعر، کذاب، ساحر وغیرہ کہنا ہے۔ علاوہ ازیں بعض احادیث میں صحابہ کرام (رضي الله عنهم) کو ایذا پہنچانے اور ان کی تنقیص واہانت کو بھی آپ (صلى الله عليه وسلم) نے ایذا قرار دیا ہے۔ لعنت کا مطلب، اللہ کی رحمت سے دوری اور محرومی ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"inna alladhīna yu'dhūna al-laha warasūlahu laʿanahumu al-lahu fī al-dun'yā wal-ākhirati wa-aʿadda lahum ʿadhāban muhīnan ","translations":["Indeed","those who","annoy","Allah","and His Messenger","Allah has cursed them","Allah has cursed them","in","the world","and the Hereafter","and prepared","for them","a punishment","humiliating","(57)"],"transliterationArr":["inna","alladhīna","yu'dhūna","al-laha","warasūlahu","laʿanahumu","al-lahu","fī","al-dun'yā","wal-ākhirati","wa-aʿadda","lahum","ʿadhāban","muhīnan",null],"verseTiming":[[1,0,1010],[2,1010,1960],[3,1960,2940],[4,2940,3830],[5,3830,5090],[6,5090,6160],[7,6160,6970],[8,6970,7200],[9,7200,8250],[10,8250,9630],[11,9630,10670],[12,10670,11160],[13,11160,12120],[14,12120,14215]]}}