{"name":"33:6","price":"پیغمبر مومنوں پر خود ان سے بھی زیاده حق رکھنے والے(1) ہیں اور پیغمبر کی بیویاں مومنوں کی مائیں ہیں(2)، اور رشتے دار کتاب اللہ کی رو سے بہ نسبت دوسرے مومنوں اور مہاجروں کے آپس میں زیاده حق دار ہیں(3) (ہاں) مگر یہ کہ تم اپنے دوستوں کے ساتھ حسن سلوک کرنا چاہو(4)۔ یہ حکم کتاب (الٰہی) میں لکھا ہوا ہے.(5)","arabic":"ٱلنَّبِيُّ أَوۡلَىٰ بِٱلۡمُؤۡمِنِينَ مِنۡ أَنفُسِهِمۡۖ وَأَزۡوَٰجُهُۥٓ أُمَّهَٰتُهُمۡۗ وَأُوْلُواْ ٱلۡأَرۡحَامِ بَعۡضُهُمۡ أَوۡلَىٰ بِبَعۡضٖ فِي كِتَٰبِ ٱللَّهِ مِنَ ٱلۡمُؤۡمِنِينَ وَٱلۡمُهَٰجِرِينَ إِلَّآ أَن تَفۡعَلُوٓاْ إِلَىٰٓ أَوۡلِيَآئِكُم مَّعۡرُوفٗاۚ كَانَ ذَٰلِكَ فِي ٱلۡكِتَٰبِ مَسۡطُورٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab","Chapter Al-Ahzab","Ahzab","Surah Ahzab","Chapter Ahzab","Al Ahzab","Surah Al Ahzab","Chapter Al Ahzab","Surah 33","Chapter 33","The Combined Forces","الأحزَاب"],"ayahNumber":3539,"juzNumber":21,"footnotes":"(1) نبی (صلى الله عليه وسلم) اپنی امت کے لئے جتنے شفیق اور خیر خواہ تھے، محتاج وضاحت نہیں۔ اللہ تعالیٰ نے آپ (صلى الله عليه وسلم) کی اس شفقت اور خیر خواہی کو دیکھتے ہوئے اس آیت میں آپ (صلى الله عليه وسلم) کو مومنوں کے اپنے نفسوں سے بھی زیادہ حق دار، آپ (صلى الله عليه وسلم) کی محبت کو دیگر تمام محبتوں سے فائق تر اور آپ (صلى الله عليه وسلم) کے حکم کو اپنی تمام خواہشات سے اہم تر قرار دیا ہے۔ اس لئے مومنوں کے لئے ضروری ہے کہ آپ (صلى الله عليه وسلم) ان کے جن مالوں کا مطالبہ۔ اللہ کے لئے کریں، وہ آپ (صلى الله عليه وسلم) پر نچھاور کر دیں چاہے انہیں خود کتنی ہی ضرورت ہو، آپ (صلى الله عليه وسلم) سے اپنے نفسوں سے بھی زیادہ محبت کریں۔ (جیسے حضرت عمر ! کا واقعہ ہے) آپ (صلى الله عليه وسلم) کے حکم کو سب پر مقدم اور آپ (صلى الله عليه وسلم) کی اطاعت کو سب سے اہم سمجھیں۔ جب تک یہ خود سپردگی نہیں ہوگی «فَلا وَرَبِّكَ لا يُؤْمِنُونَ» (النساء: 65) کے مطابق آدمی مومن نہیں ہوگا۔ اسی طرح جب تک آپ کی محبت تمام محبتوں پر غالب نہیں ہوگی «لا يُؤْمِنُ أَحَدُكُمْ حَتَّى أَكُونَ أَحَبَّ إِلَيْهِ مِنْ وَالِدِهِ وَوَلَدِه».. کی رو سے مومن نہیں، ٹھیک اسی طرح اطاعت رسول (صلى الله عليه وسلم) میں کوتاہی بھی «لا يُؤْمِنُ أَحَدُكُمْ حَتَّى يَكُونَ هَوَاهُ تَبَعًا لِمَا جِئْتُ بِهِ ..» کا مصداق بنا دے گی۔\n(2) یعنی احترام وتکریم میں اور ان سے نکاح نہ کرنے میں۔ مومن مردوں اور مومن عورتوں کی مائیں بھی ہیں۔\n(3) یعنی اب مہاجرت، اخوت اور موالات کی وجہ سے وراثت نہیں ہوگی۔ اب وراثت صرف قریبی رشتہ کی بنیاد پر ہوگی۔\n(4) ہاں تم غیر رشتے داروں کے لئے احسان اور بر وصلہ کا معاملہ کر سکتے ہو، نیز ان کے لئے ایک تہائی مال میں سے وصیت بھی کر سکتے ہو۔\n(5) یعنی لوح محفوظ میں اصل حکم یہی ہے، گو عارضی طور پر مصلحتاً دوسروں کو بھی وارث قرار دے دیا گیا تھا، لیکن اللہ کے علم میں تھا کہ یہ منسوخ کر دیا جائے گا۔ چنانچہ اسے منسوخ کرکے پہلا حکم بحال کر دیا گیا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"al-nabiyu awlā bil-mu'minīna min anfusihim wa-azwājuhu ummahātuhum wa-ulū al-arḥāmi baʿḍuhum awlā bibaʿḍin fī kitābi al-lahi mina al-mu'minīna wal-muhājirīna illā an tafʿalū ilā awliyāikum maʿrūfan kāna dhālika fī al-kitābi masṭūran ","translations":["The Prophet","(is) closer","to the believers","than","their own selves","and his wives","(are) their mothers","And possessors","(of) relationships","some of them","(are) closer","to another","in","(the) Decree","(of) Allah","than","the believers","and the emigrants","except","that","you do","to","your friends","a kindness","That is","That is","in","the Book","written","(6)"],"transliterationArr":["al-nabiyu","awlā","bil-mu'minīna","min","anfusihim","wa-azwājuhu","ummahātuhum","wa-ulū","al-arḥāmi","baʿḍuhum","awlā","bibaʿḍin","fī","kitābi","al-lahi","mina","al-mu'minīna","wal-muhājirīna","illā","an","tafʿalū","ilā","awliyāikum","maʿrūfan","kāna","dhālika","fī","al-kitābi","masṭūran",null],"verseTiming":[[1,0,1880],[2,1880,2660],[3,2660,4220],[4,4220,4540],[5,4540,7180],[6,7180,10130],[7,10130,12740],[8,12740,13320],[9,13320,14510],[10,14510,15420],[11,15420,16160],[12,16160,17230],[13,17230,18300],[14,18300,19170],[15,19170,19910],[16,19910,20240],[17,20240,21660],[18,21660,23290],[19,23290,24260],[20,24260,26870],[21,26870,27870],[22,27870,30660],[23,30660,32610],[24,32610,35810],[25,35810,37960],[26,37960,38510],[27,38510,39310],[28,39310,39530],[29,39530,40500],[30,40500,42235]]}}