{"name":"33:69","price":"اے ایمان والو! ان لوگوں جیسے نہ بن جاؤ جنہوں نے موسیٰ کو تکلیف دی پس جو بات انہوں نے کہی تھی اللہ نے انہیں اس سے بری فرما دیا(1) ، اور وه اللہ کے نزدیک باعزت تھے.","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَكُونُواْ كَٱلَّذِينَ ءَاذَوۡاْ مُوسَىٰ فَبَرَّأَهُ ٱللَّهُ مِمَّا قَالُواْۚ وَكَانَ عِندَ ٱللَّهِ وَجِيهٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab","Chapter Al-Ahzab","Ahzab","Surah Ahzab","Chapter Ahzab","Al Ahzab","Surah Al Ahzab","Chapter Al Ahzab","Surah 33","Chapter 33","The Combined Forces","الأحزَاب"],"ayahNumber":3602,"juzNumber":22,"footnotes":"(1) اس کی تفسیر حدیث میں اس طرح آئی ہے کہ حضرت موسیٰ (عليه السلام) نہایت باحیا تھے، چنانچہ اپنا جسم انہوں نے کبھی لوگوں کے سامنے ننگا نہیں کیا۔ بنی اسرائیل کہنے لگے کہ شاید موسیٰ (عليه السلام) کے جسم میں برص کے داغ یا کوئی اس قسم کی آفت ہے جس کی وجہ سے یہ ہر وقت لباس میں ڈھکا چھپا رہتا ہے۔ ایک مرتبہ حضرت موسیٰ (عليه السلام) تنہائی میں غسل کرنے لگے، کپڑے اتار کر ایک پتھر پر رکھ دیئے، پتھر (اللہ کے حکم سے) کپڑے لے بھاگ کھڑا ہوا۔ حضرت موسی (عليه السلام) اس کے پیچھے پیچھے دوڑے، حتیٰ کہ بنی اسرائیل کی ایک مجلس میں پہنچ گئے، انہوں نے حضرت موسیٰ (عليه السلام) کو ننگا دیکھا تو ان کے سارے شبہات دور ہوگئے۔ موسیٰ (عليه السلام) نہایت حسین وجمیل اور ہر قسم کے داغ اور عیب سے پاک تھے۔ یوں اللہ تبارک وتعالیٰ نے معجزانہ طور پر پتھر کے ذریعے سے ان کی اس الزام اور شبہے سے براءت کردی جو بنی اسرائیل کی طرف سے ان پر کیا جاتا تھا (صحيح بخاري كتاب الأنبياء) حضرت موسیٰ (عليه السلام) کے حوالے سے اہل ایمان کو سمجھایا جا رہا ہے کہ تم ہمارے پیغمبر آخر الزمان حضرت محمد (صلى الله عليه وسلم) کو بنی اسرائیل کی طرح ایذا مت پہنچاؤ اور آپ (صلى الله عليه وسلم) کی بابت ایسی بات مت کرو جسے سن کر آپ (صلى الله عليه وسلم) قلق اور اضطراب محسوس کریں، جیسے ایک موقعے پر مال غنیمت کی تقسیم میں ایک شخص نے کہا کہ اس میں عدل وانصاف سے کام نہیں لیا گیا۔ جب آپ (صلى الله عليه وسلم) تک یہ الفاظ پہنچے تو غضب ناک ہوئے حتیٰ کہ آپ (صلى الله عليه وسلم) کا چہرۂ مبارک سرخ ہوگیا آپ (صلى الله عليه وسلم) نے فرمایا ”موسیٰ (عليه السلام) پر اللہ کی رحمت ہو، انہیں اس سے کہیں زیادہ ایذا پہنچائی گئی، لیکن انہوں نے صبر کیا“۔ (بخاري كتاب الأنبياء، مسلم، كتاب الزكاة، باب إعطاء المؤلفة قلوبهم على الإسلام..)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāayyuhā alladhīna āmanū lā takūnū ka-alladhīna ādhaw mūsā fabarra-ahu al-lahu mimmā qālū wakāna ʿinda al-lahi wajīhan ","translations":["O you who believe","O you who believe","O you who believe","(Do) not","be","like those who","abused","Musa","then Allah cleared him","then Allah cleared him","of what","they said","And he was","near","Allah","honorable","(69)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","lā","takūnū","ka-alladhīna","ādhaw","mūsā","fabarra-ahu","al-lahu","mimmā","qālū","wakāna","ʿinda","al-lahi","wajīhan",null],"verseTiming":[[1,0,2440],[2,2440,3380],[3,3380,4380],[4,4380,4760],[5,4760,5710],[6,5710,6930],[7,6930,7660],[8,7660,8380],[9,8380,9560],[10,9560,10340],[11,10340,11450],[12,11450,12440],[13,12440,13580],[14,13580,14770],[15,14770,15620],[16,15620,16695]]}}