{"name":"33:72","price":"ہم نے اپنی امانت کو آسمانوں پر زمین پر اور پہاڑوں پر پیش کیا لیکن سب نے اس کے اٹھانے سے انکار کردیا اور اس سے ڈر گئے (مگر) انسان نے اسے اٹھا لیا(1) ، وه بڑا ہی ﻇالم جاہل ہے.(2)","arabic":"إِنَّا عَرَضۡنَا ٱلۡأَمَانَةَ عَلَى ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَٱلۡجِبَالِ فَأَبَيۡنَ أَن يَحۡمِلۡنَهَا وَأَشۡفَقۡنَ مِنۡهَا وَحَمَلَهَا ٱلۡإِنسَٰنُۖ إِنَّهُۥ كَانَ ظَلُومٗا جَهُولٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab","Chapter Al-Ahzab","Ahzab","Surah Ahzab","Chapter Ahzab","Al Ahzab","Surah Al Ahzab","Chapter Al Ahzab","Surah 33","Chapter 33","The Combined Forces","الأحزَاب"],"ayahNumber":3605,"juzNumber":22,"footnotes":"(1) جب اللہ تعالیٰ نے اہل اطاعت کا اجر وثواب اور اہل معصیت کا وبال اور عذاب بیان کردیا تو اب شرعی احکام اور اس کی صعوبت کا تذکرہ فرما رہا ہے۔ امانت سے وہ احکام شرعیہ اور فرائض وواجبات مراد ہیں جن کی ادائیگی پر ثواب اور ان سے اعراض وانکار پر عذاب ہوگا۔ جب یہ تکالیف شرعیہ آسمان وزمین اور پہاڑوں پر پیش کی گئیں تو وہ ان کے اٹھانے سے ڈر گئے۔ لیکن جب انسان پر یہ چیز پیش کی گئی تو وہ اطاعت الٰہی (امانت) کے اجر وثواب اور اس کی فضیلت کو دیکھ کر اس بار گراں کو اٹھانے پر آمادہ ہوگیا۔ احکام شرعیہ کو امانت سے تعبیر کرکے اشارہ فرما دیا کہ ان کی ادائیگی انسانوں پر اسی طرح واجب ہے، جس طرح امانت کی ادائیگی ضروری ہوتی ہے۔ پیش کرنے کا مطلب کیا ہے؟ اور آسمان وزمین اور پہاڑوں نے کس طرح اس کا جواب دیا؟ اور انسان نے اسے کس وقت قبول کیا؟ اس کی پوری کیفیت نہ ہم جان سکتے ہیں نہ اسے بیان کرسکتے ہیں۔ ہمیں یقین رکھنا چاہیے کہ اللہ نے اپنی ہر مخلوق میں ایک خاص قسم کا احساس وشعور رکھا ہے، گو ہم اس کی حقیقت سے آگاہ نہیں ہیں، لیکن اللہ تعالیٰ تو ان کی بات سمجھنے پر قادر ہے، اس نے ضرور اس امانت کو ان پر پیش کیا ہوگا جسے قبول کرنے سے انہوں نے انکار کردیا۔ اور یہ ا نکار انہوں نے سرکشی وبغاوت کی بنا پر نہیں کیا بلکہ اس میں یہ خوف کار فرما تھا کہ اگر ہم اس امانت کے تقاضے پورے نہ کرسکے تو اس کی سخت سزا ہمیں بھگتنی ہوگی۔ انسان چونکہ جلد باز ہے، اس نے عقوبت وتعزیر کے پہلو پر زیادہ غور نہیں کیا اور حصول فضیلت کے شوق میں اس ذمے داری کو قبول کرلیا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"innā ʿaraḍnā al-amānata ʿalā al-samāwāti wal-arḍi wal-jibāli fa-abayna an yaḥmil'nahā wa-ashfaqna min'hā waḥamalahā al-insānu innahu kāna ẓalūman jahūlan ","translations":["Indeed, We","[We] offered","the Trust","to","the heavens","and the earth","and the mountains","but they refused","to","bear it","and they feared","from it","but bore it","the man","Indeed, he","was","unjust","ignorant","(72)"],"transliterationArr":["innā","ʿaraḍnā","al-amānata","ʿalā","al-samāwāti","wal-arḍi","wal-jibāli","fa-abayna","an","yaḥmil'nahā","wa-ashfaqna","min'hā","waḥamalahā","al-insānu","innahu","kāna","ẓalūman","jahūlan",null],"verseTiming":[[1,0,1500],[2,1500,2290],[3,2290,3490],[4,3490,3870],[5,3870,5270],[6,5270,6230],[7,6230,7340],[8,7340,8260],[9,8260,8620],[10,8620,10600],[11,10600,12070],[12,12070,12360],[13,12360,14330],[14,14330,15490],[15,15490,16230],[16,16230,17180],[17,17180,21270],[18,21270,22740],[19,22740,23390],[20,23390,24470],[21,24470,26585]]}}