{"name":"33:7","price":"جب کہ ہم نے تمام نبیوں سے عہد لیا اور (بالخصوص) آپ سے اور نوح سے اور ابراہیم سے اور موسیٰ سے اور مریم کے بیٹے عیسیٰ سے، اور ہم نے ان سے (پکا اور) پختہ عہد لیا.(1)","arabic":"وَإِذۡ أَخَذۡنَا مِنَ ٱلنَّبِيِّـۧنَ مِيثَٰقَهُمۡ وَمِنكَ وَمِن نُّوحٖ وَإِبۡرَٰهِيمَ وَمُوسَىٰ وَعِيسَى ٱبۡنِ مَرۡيَمَۖ وَأَخَذۡنَا مِنۡهُم مِّيثَٰقًا غَلِيظٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab","Chapter Al-Ahzab","Ahzab","Surah Ahzab","Chapter Ahzab","Al Ahzab","Surah Al Ahzab","Chapter Al Ahzab","Surah 33","Chapter 33","The Combined Forces","الأحزَاب"],"ayahNumber":3540,"juzNumber":21,"footnotes":"(1) اس عہد سے کیا مراد ہے؟ بعض کے نزدیک یہ وہ عہد ہے جو ایک دوسرے کی مدد اور تصدیق کا انبیا علیہم السلام سے لیا گیا تھا جیسا کہ سورۂ آل عمران کی آیت 81 میں ہے۔ بعض کے نزدیک یہ وہ عہد ہے، جس کا ذکر شوریٰ کی ایت 13 میں ہے کہ دین قائم کرنا اور اس میں تفرقہ مت ڈالنا۔ یہ عہد اگرچہ تمام انبیا علیہم السلام سے لیا گیا تھا لیکن یہاں بطور خاص پانچ انبیا علیہم السلام کا نام لیا گیا ہے جن سے ان کی اہمیت وعظمت واضح ہے اور ان میں بھی نبی (صلى الله عليه وسلم) کا ذکر سب سے پہلے ہے دراں حالیکہ نبوت کے لحاظ سے آپ (صلى الله عليه وسلم) سب سے متاخر ہیں، اس سے آپ (صلى الله عليه وسلم) کی عظمت اور شرف کا جس طرح اظہار ہو رہا ہے، محتاج وضاحت نہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-idh akhadhnā mina al-nabiyīna mīthāqahum waminka wamin nūḥin wa-ib'rāhīma wamūsā waʿīsā ib'ni maryama wa-akhadhnā min'hum mīthāqan ghalīẓan ","translations":["And when","We took","from","the Prophets","their Covenant","and from you","and from","Nuh","and Ibrahim","and Musa","and Isa","son","(of) Maryam","And We took","from them","a covenant","strong","(7)"],"transliterationArr":["wa-idh","akhadhnā","mina","al-nabiyīna","mīthāqahum","waminka","wamin","nūḥin","wa-ib'rāhīma","wamūsā","waʿīsā","ib'ni","maryama","wa-akhadhnā","min'hum","mīthāqan","ghalīẓan",null],"verseTiming":[[1,0,550],[2,550,1530],[3,1530,1830],[4,1830,3950],[5,3950,5290],[6,5290,6640],[7,6640,7050],[8,7050,8930],[9,8930,10390],[10,10390,11360],[11,11360,12120],[12,12120,12570],[13,12570,13260],[14,13260,14930],[15,14930,16580],[16,16580,17740],[17,17740,18825]]}}