{"name":"33:9","price":"اے ایمان والو! اللہ تعالیٰ نے جو احسان تم پر کیا اسے یاد کرو جبکہ تمہارے مقابلے کو فوجوں پر فوجیں آئیں پھر ہم نے ان پر تیز وتند آندھی اور ایسے لشکر بھیجے جنہیں تم نے دیکھا ہی نہیں(1) ، اور جو کچھ تم کرتے ہو اللہ تعالیٰ سب کچھ دیکھتا ہے.","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱذۡكُرُواْ نِعۡمَةَ ٱللَّهِ عَلَيۡكُمۡ إِذۡ جَآءَتۡكُمۡ جُنُودٞ فَأَرۡسَلۡنَا عَلَيۡهِمۡ رِيحٗا وَجُنُودٗا لَّمۡ تَرَوۡهَاۚ وَكَانَ ٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرًا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab","Chapter Al-Ahzab","Ahzab","Surah Ahzab","Chapter Ahzab","Al Ahzab","Surah Al Ahzab","Chapter Al Ahzab","Surah 33","Chapter 33","The Combined Forces","الأحزَاب"],"ayahNumber":3542,"juzNumber":21,"footnotes":"(1) ان آیات میں غزوۂ احزاب کی کچھ تفصیل ہے جو 5 ہجری میں پیش آیا اسے احزاب اس لئے کہتے ہیں کہ اس موقعے پر تمام اسلام دشمن گروہ جمع ہو کر مسلمانوں کے مرکز مدینہ پر حملہ آور ہوئے تھے۔ احزاب حزب (گروہ) کی جمع ہے۔ اسے جنگ خندق بھی کہتے ہیں، اس لئے کہ مسلمانوں نے اپنے بچاؤ کے لئے مدینے کے اطراف میں خندق کھودی تھی تاکہ دشمن مدینے کے اندر نہ آسکیں۔ اس کی مختصر تفصیل اس طرح ہے کہ یہودیوں کے قبیلے بنو نضیر، جس کو رسول اللہ (صلى الله عليه وسلم) نے اس کی مسلسل بدعہدی کی وجہ سے مدینہ سے جلا وطن کردیا تھا، یہ قبیلہ خیبر میں جا آباد ہوا، اس نے کفار مکہ کو مسلمانوں پر حملہ آور ہونے کے لئے تیار کیا،اسی طرح غطفان وغیرہ قبائل نجد کو بھی امداد کا یقین دلا کر آمادۂ قتال کیا اور یوں یہ یہودی اسلام اور مسلمانوں کے تمام دشمنوں کو اکھٹا کرکے مدینے پر حملہ آور ہونے میں کامیاب ہوگئے۔ مشرکین مکہ کی قیادت ابوسفیان کے پاس تھی، انہوں نے احد کے آس پاس پڑاؤ ڈال کر تقریباً مدینے کا محاصرہ کر لیا، ان کی مجموعی تعداد 10 ہزار تھی، جب کہ مسلمان تین ہزار تھے۔ علاوہ ازیں جنوبی رخ پر یہودیوں کا تیسرا قبیلہ بنو قریظہ آباد تھا، جس سے ابھی تک مسلمانوں کا معاہدہ قائم اور وہ مسلمانوں کی مدد کرنے کا پابند تھا۔ لیکن اسے بھی بنو نضیر کے یہودی سردار حیی بن اخطب نےورغلا کر مسلمانوں پر کاری ضرب لگانے کے حوالے سے، اپنے ساتھ ملا لیا، یوں مسلمان چاروں طرف سے دشمن کے نرغے میں گھر گئے۔ اس موقع پر حضرت سلمان فارسی ! کے مشورے سے خندق کھودی گئی، جس کی وجہ سے دشمن کا لشکر مدینے سے اندر نہیں آسکا اور مدینے کے باہر قیام پذیر رہا۔ تاہم مسلمان اس محاصرے اور دشمن کی متحدہ یلغارسے سخت خوفزدہ تھے۔ کم وبیش ایک مہینے تک یہ محاصرہ قائم رہا اور مسلمان سخت خوف اور اضطراب کے عالم میں مبتلا۔ بالآخر اللہ تعالیٰ نے پردۂ غیب سے مسلمانوں کی مدد فرمائی ان آیات میں ان ہی سراسیمہ حالات اور امداد غیبی کا تذکرہ فرمایا گیا ہے۔ پہلے جُنُودٌ سے مراد کفار کی فوجیں ہیں، جو جمع ہو کر آئی تھیں۔ تیز وتند ہوا سے مراد وہ ہوا ہے جو سخت طوفان اور آندھی کی شکل میں آئی، جس نے ان کے خیموں کو اکھاڑ پھینکا، جانور رسیاں تڑا کر بھاگ کھڑے ہوئے، ہانڈیاں الٹ گئیں اور سب بھاگنے پر مجبور ہوگئے۔ یہ وہی ہوا تھی جس کی بابت حدیث میں آتا ہے، نُصِرْتُ بِالصَّبَا وَأُهْلِكَتْ عَادٌ بِالدَّبُورِ (صحيح بخاري ، كتاب الاستسقاء، باب نصرت بالصبا مسلم، باب في ريح الصبا والدبور) میری مدد صبا (مشرقی ہوا) سےکی گئی اور عاد دبور (پچھمی) ہوا سے ہلاک کیے گئے۔ وَجُنُودًا لَمْ تَرَوْهَا سے مراد فرشتے ہیں، جو مسلمانوں کی مدد کے لئے آئے۔ انہوں نے دشمن کےدلوں پر ایسا خوف اور دہشت طاری کر دی کہ انہوں نے وہاں سے جلد بھاگ جانے میں ہی اپنی عافیت سمجھی۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāayyuhā alladhīna āmanū udh'kurū niʿ'mata al-lahi ʿalaykum idh jāatkum junūdun fa-arsalnā ʿalayhim rīḥan wajunūdan lam tarawhā wakāna al-lahu bimā taʿmalūna baṣīran ","translations":["O you","who","believe","Remember","(the) Favor","(of) Allah","upon you","when","came to you","(the) hosts","and We sent","upon them","a wind","and hosts","not","you (could) see them","And Allah is","And Allah is","of what","you do","All-Seer","(9)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","udh'kurū","niʿ'mata","al-lahi","ʿalaykum","idh","jāatkum","junūdun","fa-arsalnā","ʿalayhim","rīḥan","wajunūdan","lam","tarawhā","wakāna","al-lahu","bimā","taʿmalūna","baṣīran",null],"verseTiming":[[1,0,2500],[2,2500,3460],[3,3460,4270],[4,4270,4990],[5,4990,5740],[6,5740,6570],[7,6570,7550],[8,7550,7890],[9,7890,10640],[10,10640,12020],[11,12020,13380],[12,13380,14350],[13,14350,14900],[14,14900,16570],[15,16570,17080],[16,17080,18080],[17,18080,19280],[18,19280,20140],[19,20140,20670],[20,20670,21820],[21,21820,23305]]}}