{"name":"34:11","price":"کہ تو پوری پوری زرہیں بنا(1) اور جوڑوں میں اندازه رکھ(2) تم سب نیک کام کیا کرو(3)۔ (یقین مانو) کہ میں تمہارے اعمال دیکھ رہا ہوں.","arabic":"أَنِ ٱعۡمَلۡ سَٰبِغَٰتٖ وَقَدِّرۡ فِي ٱلسَّرۡدِۖ وَٱعۡمَلُواْ صَٰلِحًاۖ إِنِّي بِمَا تَعۡمَلُونَ بَصِيرٞ","category":["34 (Saba)","Saba","Surah Saba","Chapter Saba","Surah 34","Chapter 34","Sheba","سَبَأ"],"ayahNumber":3617,"juzNumber":22,"footnotes":"(1) سَابِغَاتٍ محذوف موصوف کی صفت ہے دُرُوعًا سَابِغَاتٍ یعنی پوری لمبی زرہیں، جو لڑنے والے کے پورے جسم کو صحیح طریقے سے ڈھانک لیں اور اسے دشمن کے وار سے محفوظ رکھیں۔\n(2) تاکہ چھوٹی بڑی نہ ہوں، یا سخت یا نرم نہ ہوں یعنی کڑیوں کے جوڑنے میں کیل اتنے باریک نہ ہوں کہ جوڑ حرکت کرتے رہیں اور ان میں قرار وثبات نہ آئے اور نہ اتنے موٹے ہوں کہ اسے توڑ ہی ڈالیں یا جس سے حلقہ تنگ ہو جائے اور اسے پہنا نہ جاسکے۔ زرہ بافی کی صنعت کے بارے میں حضرت داود (عليه السلام) کو ہدایات دی گئیں۔\n(3) یعنی ان نعمتوں کے بدلےمیں عمل صالح کا اہتمام کرو تاکہ میرا عملی شکر بھی ہوتا رہے۔ اس سےمعلوم ہوا کہ جس کو اللہ تعالیٰ دنیوی نعمتوں سے سرفراز فرمائے، اسے اسی حساب سے اللہ کا شکر بھی ادا کرنا چاہیئے اور شکر میں بنیادی چیز یہی ہے کہ منعم کو راضی رکھنے کی بھرپور سعی کی جائے یعنی اس کی اطاعت کی جائے۔ اور نافرمانی سے بچا جائے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"ani iʿ'mal sābighātin waqaddir fī al-sardi wa-iʿ'malū ṣāliḥan innī bimā taʿmalūna baṣīrun ","translations":["That","make","full coats of mail","and measure precisely","[of]","the links (of armor)","and work","righteousness","Indeed, I Am","of what","you do","All-Seer","(11)"],"transliterationArr":["ani","iʿ'mal","sābighātin","waqaddir","fī","al-sardi","wa-iʿ'malū","ṣāliḥan","innī","bimā","taʿmalūna","baṣīrun",null],"verseTiming":[[1,0,430],[2,430,940],[3,940,3090],[4,3090,3890],[5,3890,4150],[6,4150,4890],[7,4890,5710],[8,5710,6660],[9,6660,7850],[10,7850,8350],[11,8350,9480],[12,9480,12015]]}}