{"name":"34:18","price":"اور ہم نے ان کے اور ان بستیوں کے درمیان جن میں ہم نے برکت دے رکھی تھی(1) چند بستیاں اور (آباد) رکھی تھیں جو برسرراه ﻇاہر تھیں، اور ان میں چلنے کی منزلیں مقرر کردی تھیں(2) ان میں راتوں اور دنوں کو بہ امن وامان چلتے پھرتے رہو.(3)","arabic":"وَجَعَلۡنَا بَيۡنَهُمۡ وَبَيۡنَ ٱلۡقُرَى ٱلَّتِي بَٰرَكۡنَا فِيهَا قُرٗى ظَٰهِرَةٗ وَقَدَّرۡنَا فِيهَا ٱلسَّيۡرَۖ سِيرُواْ فِيهَا لَيَالِيَ وَأَيَّامًا ءَامِنِينَ","category":["34 (Saba)","Saba","Surah Saba","Chapter Saba","Surah 34","Chapter 34","Sheba","سَبَأ"],"ayahNumber":3624,"juzNumber":22,"footnotes":"(1) برکت والی بستیوں سے مراد شام کی بستیاں ہیں۔ یعنی ہم نے ملک سبا (یمن) اور شام کے درمیان لب سڑک بستیاں آباد کی ہوئی تھیں، بعض نے ظَاهِرَةً کے معنی مُتَوَاصِلَةً، ایک دوسرے سے پیوست اور مسلسل کے کئے ہیں۔ مفسرین نے ان بستیوں کی تعداد 4 ہزار سات سو بتلائی ہے۔ یہ ان کی تجارتی شاہراہ تھی جو مسلسل آباد تھی، جس کی وجہ سے ایک تو ان کے کھانے پینے اور آرام کرنے کے لئے زاد راہ ساتھ لینے کی ضرورت نہیں پڑتی تھی۔ دوسرے، ویرانی کی وجہ سے لوٹ مار اور قتل وغارت کا جو اندیشہ ہوتا ہے، وہ نہیں ہوتا تھا۔\n(2) یعنی ایک آبادی سے دوسری آبادی کا فاصلہ متعین اور معلوم تھا، اور اس کے حساب سے وہ بہ آسانی اپنا سفر طے کرلیتے تھے۔ مثلاً صبح سفر کا آغاز کرتے تو دوپہر تک کسی آبادی اور قریے تک پہنچ جاتے، وہاں کھا پی کر قیلولہ کرتے اور پھر سرگرم سفر ہوجاتے تو رات کو کسی آبادی میں جاپہنچتے۔\n(3) یہ ہر قسم کے خطرے سے محفوظ اور زاد راہ کی مشقت سے بےنیاز ہونے کا بیان ہے کہ رات اور دن کی جس گھڑی میں تم سفر کرنا چاہو، کرو، نہ جان ومال کا کوئی اندیشہ نہ راستے کے لئے سامان سفر ساتھ لینے کی ضرورت۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wajaʿalnā baynahum wabayna al-qurā allatī bāraknā fīhā quran ẓāhiratan waqaddarnā fīhā al-sayra sīrū fīhā layāliya wa-ayyāman āminīna ","translations":["And We made","between them","and between","the towns","which","We had blessed","in it","towns","visible","And We determined","between them","the journey","Travel","between them","(by) night","and (by) day","safely","(18)"],"transliterationArr":["wajaʿalnā","baynahum","wabayna","al-qurā","allatī","bāraknā","fīhā","quran","ẓāhiratan","waqaddarnā","fīhā","al-sayra","sīrū","fīhā","layāliya","wa-ayyāman","āminīna",null],"verseTiming":[[1,0,1120],[2,1120,2030],[3,2030,2700],[4,2700,3190],[5,3190,4070],[6,4070,5120],[7,5120,5790],[8,5790,6940],[9,6940,8220],[10,8220,9830],[11,9830,10390],[12,10390,10860],[13,10860,12699],[14,12699,14690],[15,14690,15600],[16,15600,16780],[17,16780,19015]]}}