{"name":"34:10","price":"اور ہم نے داؤد پر اپنا فضل کیا(1) ، اے پہاڑو! اس کے ساتھ رغبت سے تسبیح پڑھا کرو اور پرندوں کو بھی(2) (یہی حکم ہے) اور ہم نے اس کے لئے لوہا نرم کردیا.(3)","arabic":"۞ وَلَقَدۡ ءَاتَيۡنَا دَاوُۥدَ مِنَّا فَضۡلٗاۖ يَٰجِبَالُ أَوِّبِي مَعَهُۥ وَٱلطَّيۡرَۖ وَأَلَنَّا لَهُ ٱلۡحَدِيدَ","category":["34 (Saba)","Saba","Surah Saba","Chapter Saba","Surah 34","Chapter 34","Sheba","سَبَأ"],"ayahNumber":3616,"juzNumber":22,"footnotes":"(1) یعنی نبوت کے ساتھ بادشاہت اور کئی امتیازی خوبیوں سے نوازا۔\n(2) ان میں سے ایک حسن صوت کی نعمت تھی، جب وہ اللہ کی تسبیح پڑھتے تو پتھر کے ٹھوس پہاڑ بھی تسبیح خوانی میں مصروف ہو جاتے، اڑتے پرندے ٹھہرجاتے اور زمزمہ خواں ہوجاتے اوّبی کے معنی ہیں تسبیح دہراؤ۔ یعنی پہاڑوں اور پرندوں کو ہم نے کہا، چنانچہ یہ بھی داود (عليه السلام) کے ساتھ مصروف تسبیح ہوجاتے وَالطَّيْرَ کا عطف یا جبال کے محل پر ہے۔ اس لئے کہ جبال تقدیراً منصوب ہے۔ اصل عبارت اسی طرح ہے نَادَيْنَا الْجِبَالَ وَالطِّيْرَ(ہم نے پہاڑوں اور پرندوں کو پکارا) یا پھر اس کا عطف فضلاً پر ہے اور معنی ہوں گے وَسَخَّرْنَا لَهُ الطَّيْر َ (اور ہم نے پرندے ان کے تابع کردیئے)۔ (فتح القدیر)۔\n(3) یعنی لوہے کو آگ میں تپائے اور ہتھوڑی سے کوٹے بغیر، اسے موم، گوندھے ہوئے آٹے اور گیلی مٹی کی طرح، جس طرح چاہتے موڑ لیتے، بٹ لیتے اور جو چاہتے بنا لیتے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walaqad ātaynā dāwūda minnā faḍlan yājibālu awwibī maʿahu wal-ṭayra wa-alannā lahu al-ḥadīda ","translations":["And certainly","We gave","Dawood","from Us","Bounty","O mountains","Repeat praises","with him","and the birds","And We made pliable","for him","[the] iron","(10)"],"transliterationArr":["walaqad","ātaynā","dāwūda","minnā","faḍlan","yājibālu","awwibī","maʿahu","wal-ṭayra","wa-alannā","lahu","al-ḥadīda",null],"verseTiming":[[1,0,740],[2,740,1820],[3,1820,2760],[4,2760,3990],[5,3990,5330],[6,5330,6360],[7,6360,7320],[8,7320,8120],[9,8120,10110],[10,10110,12190],[11,12190,12530],[12,12530,15105]]}}