{"name":"34:1","price":"تمام تعریفیں اس اللہ کے لئے سزاوار ہیں جس کی ملکیت میں وه سب کچھ ہے جو آسمانوں اور زمین میں ہے(1) آخرت میں بھی تعریف اسی کے لئے ہے(2)، وه (بڑی) حکمتوں واﻻ اور (پورا) خبردار ہے.","arabic":"ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِي لَهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِ وَلَهُ ٱلۡحَمۡدُ فِي ٱلۡأٓخِرَةِۚ وَهُوَ ٱلۡحَكِيمُ ٱلۡخَبِيرُ","category":["34 (Saba)","Saba","Surah Saba","Chapter Saba","Surah 34","Chapter 34","Sheba","سَبَأ"],"ayahNumber":3607,"juzNumber":22,"footnotes":"(1) یعنی اسی کی ملکیت اور تصرف میں ہے، اسی کا ارادہ اور فیصلہ اس میں نافذ ہوتا ہے۔ انسان کو جو نعمت بھی ملتی ہے، وہ اسی کی پیدا کردہ ہے اور اسی کا احسان ہے، اسی لئے آسمان وزمین کی ہر چیز کی تعریف دراصل ان نعمتوں پر اللہ ہی کی حمدوتعریف ہے جن سے اس نے اپنی مخلوق کو نوازا ہے۔\n(2) یہ تعریف قیامت والے دن اہل ایمان کریں گے مثلاً «الْحَمْدُ لِلَّهِ الَّذِي صَدَقَنَا وَعْدَهُ» (سورة الزمر:74) «الْحَمْدُ لِلَّهِ الَّذِي هَدَانَا لِهَذَا» (سورة الأعرا: 43) «الْحَمْدُ لِلَّهِ الَّذِي أَذْهَبَ عَنَّا الْحَزَنَ» (فاطر: 34) وَغَيْرهَا مِنَ الآيَاتِ تاہم دنیا میں اللہ کی حمد وتعریف، عبادت ہے جس کا مکلف انسان کو بنایا گیا ہے اور آخرت میں یہ اہل ایمان کی روحانی خوراک ہوگی، جس سے انہیں لذت وفرحت محسوس ہوا کرے گی۔ (فتح القدیر)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"al-ḥamdu lillahi alladhī lahu mā fī al-samāwāti wamā fī al-arḍi walahu al-ḥamdu fī al-ākhirati wahuwa al-ḥakīmu al-khabīru ","translations":["All praises","(be) to Allah","the One to Whom belongs","the One to Whom belongs","whatever","(is) in","the heavens","and whatever","(is) in","the earth","and for Him","(are) all praises","in","the Hereafter","And He","(is) the All-Wise","the All-Aware","(1)"],"transliterationArr":["al-ḥamdu","lillahi","alladhī","lahu","mā","fī","al-samāwāti","wamā","fī","al-arḍi","walahu","al-ḥamdu","fī","al-ākhirati","wahuwa","al-ḥakīmu","al-khabīru",null],"verseTiming":[[1,0,830],[2,830,1720],[3,1720,2360],[4,2360,2830],[5,2830,3150],[6,3150,3330],[7,3330,4560],[8,4560,5030],[9,5030,5240],[10,5240,5980],[11,5980,6440],[12,6440,7140],[13,7140,7370],[14,7370,9110],[15,9110,9580],[16,9580,10500],[17,10500,13055]]}}