{"name":"34:15","price":"قوم سبا کے لئے اپنی بستیوں میں (قدرت الٰہی کی) نشانی تھی(1) ان کے دائیں بائیں دو باغ تھے(2) (ہم نے ان کو حکم دیا تھا کہ) اپنے رب کی دی ہوئی روزی کھاؤ(3) اور اس کا شکر ادا کرو(4)، یہ عمده شہر(5) اور وه بخشنے واﻻ رب ہے.(6)","arabic":"لَقَدۡ كَانَ لِسَبَإٖ فِي مَسۡكَنِهِمۡ ءَايَةٞۖ جَنَّتَانِ عَن يَمِينٖ وَشِمَالٖۖ كُلُواْ مِن رِّزۡقِ رَبِّكُمۡ وَٱشۡكُرُواْ لَهُۥۚ بَلۡدَةٞ طَيِّبَةٞ وَرَبٌّ غَفُورٞ","category":["34 (Saba)","Saba","Surah Saba","Chapter Saba","Surah 34","Chapter 34","Sheba","سَبَأ"],"ayahNumber":3621,"juzNumber":22,"footnotes":"(1) سَبَأ وہی قوم تھی، جس کی ملکہ سبا مشہور ہے جو حضرت سلیمان (عليه السلام) کے زمانے میں مسلمان ہوگئی تھی۔ قوم ہی کے نام پر ملک نام بھی سبا تھا، آج کل یمن کے نام سے یہ علاقہ معروف ہے۔ یہ بڑا خوش حال ملک تھا، یہ ملک بری وبحری تجارت میں بھی ممتاز تھا اور زراعت وباغبانی میں بھی نمایاں۔ اور یہ دونوں ہی چیزیں کسی ملک اور قوم کی خوش حالی کا باعث ہوتی ہیں۔ اسی مال ودولت کی فراوانی کو یہاں قدرت الٰہی کی نشانی سے تعبیر کیا گیا ہے۔\n(2) کہتے ہیں کہ شہر کے دونوں طرف پہاڑ تھے، جن سے چشموں اور نالوں کا پانی بہہ بہہ کر شہر میں آتا تھا، ان کے حکمرانوں نے پہاڑوں کے درمیان پشتے تعمیر کرادیئے اور ان کے ساتھ باغات لگا دیئےگئے، جس سے پانی کا رخ بھی متعین ہوگیا اور باغوں کو بھی سیرابی کا ایک قدرتی ذریعہ میسر آگیا۔ ان ہی باغات کو، دائیں بائیں دو باغوں، سے تعبیر کیا گیا ہے۔ بعض کہتے ہیں، جَنَّتَيْنِ سے دو باغ نہیں، بلکہ دائیں بائیں کی دو جہتیں مراد ہیں اور مطلب باغوں کی کثرت ہے کہ جدھر نظر اٹھا کر دیکھیں، باغات، ہریالی اور شادابی ہی نظر آتی تھی۔ (فتح القدیر)۔\n(3) یہ ان کے پیغمبروں کے ذریعے سے کہلوایا گیا یا مطلب ان نعمتوں کا بیان ہے، جن سے ان کو نوازا گیا تھا۔\n(4) یعنی منعم و محسن کی اطاعت کرو اور اس کی نافرمانی سے اجتناب۔\n(5) یعنی باغوں کی کثرت اور پھلوں کی فراوانی کی وجہ سے یہ شہر عمدہ ہے۔ کہتے ہیں کہ آب وہوا کی عمدگی کی وجہ سے یہ شہر مکھی، مچھر اور اس قسم کے دیگر موذی جانوروں سے بھی پاک تھا، واللہ اعلم۔\n(6) یعنی اگر تم رب کا شکر کرتے رہو گے تو وہ تمہارے گناہ بھی معاف فرما دے گا۔ اس کا مطلب یہ بھی ہوا کہ انسان توبہ کرتے رہیں تو پھر گناہ ہلاکت عام اور سلب انعام کا سبب نہیں بنتے، بلکہ اللہ تعالیٰ عفوودرگزر سے کام لیتا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"laqad kāna lisaba-in fī maskanihim āyatun jannatāni ʿan yamīnin washimālin kulū min riz'qi rabbikum wa-ush'kurū lahu baldatun ṭayyibatun warabbun ghafūrun ","translations":["Certainly","(there) was","for Saba","in","their dwelling place","a sign:","Two gardens","on","(the) right","and (on the) left","Eat","from","(the) provision","(of) your Lord","and be grateful","to Him","A land","good","and a Lord","Oft-Forgiving","(15)"],"transliterationArr":["laqad","kāna","lisaba-in","fī","maskanihim","āyatun","jannatāni","ʿan","yamīnin","washimālin","kulū","min","riz'qi","rabbikum","wa-ush'kurū","lahu","baldatun","ṭayyibatun","warabbun","ghafūrun",null],"verseTiming":[[1,0,570],[2,570,1080],[3,1080,2460],[4,2460,3130],[5,3130,4190],[6,4190,5420],[7,5420,7170],[8,7170,7560],[9,7560,9640],[10,9640,12340],[11,12340,12880],[12,12880,13040],[13,13040,13750],[14,13750,14710],[15,14710,15550],[16,15550,16280],[17,16280,17970],[18,17970,19750],[19,19750,20650],[20,20650,23045]]}}