{"name":"34:39","price":"کہہ دیجیئے! کہ میرا رب اپنے بندوں میں جس کے لئے چاہے روزی کشاده کرتا ہے اور جس کے لئے چاہے تنگ کردیتا ہے(1) ، تم جو کچھ بھی اللہ کی راه میں خرچ کرو گے اللہ اس کا (پورا پورا) بدلہ دے گا(2) اور وه سب سے بہتر روزی دینے واﻻ ہے.(3)","arabic":"قُلۡ إِنَّ رَبِّي يَبۡسُطُ ٱلرِّزۡقَ لِمَن يَشَآءُ مِنۡ عِبَادِهِۦ وَيَقۡدِرُ لَهُۥۚ وَمَآ أَنفَقۡتُم مِّن شَيۡءٖ فَهُوَ يُخۡلِفُهُۥۖ وَهُوَ خَيۡرُ ٱلرَّٰزِقِينَ","category":["34 (Saba)","Saba","Surah Saba","Chapter Saba","Surah 34","Chapter 34","Sheba","سَبَأ"],"ayahNumber":3645,"juzNumber":22,"footnotes":"(1) پس وہ کبھی کافر کو بھی خوب مال دیتا ہے، لیکن کس لئے؟ استدراج کے طور پر، اور کبھی مومن کو تنگ دست رکھتا ہے، کس لئے؟ اس کے اجروثواب میں اضافے کے لئے۔ اس لئے مجردمال کی فراوانی اس کی رضا کی اور اس کی کمی، اس کی ناراضی کی دلیل نہیں ہے۔ یہ تکرار بطور تاکید کے ہے۔\n(2) إِخْلافٌ کے معنی ہیں، عوض اور بدلہ دینا۔ یہ بدلہ دنیا میں بھی ممکن ہے اور آخرت میں تو یقینی ہے۔ حدیث قدسی میں آتا ہے۔ اللہ تعالیٰ فرماتا ہے۔ «أَنْفِقْ أُنْفِقْ عَلَيْكَ» (صحيح بخاري سورة هود) ”تو خرچ کر، میں تجھ پر خرچ کروں گا“ (یعنی بدلہ دوں گا) دو فرشتے ہر روز اعلان کرتے ہیں، ایک کہتا ہے «اللَّهُمَّ أَعْطِ مُمْسِكًا تَلَفًا» ”اے اللہ! نہ خرچ کرنے والے کے مال کو ضائع کردے“ دوسرا کہتا ہے، «اللَّهُمَّ أَعْطِ مُنْفِقًا خَلَفًا» ”اے اللہ! خرچ کرنے والے کو بدلہ عطا فرما۔ (البخاري، كتاب الزكاة، باب ، فأما من أعطى واتقى)۔\n(3) کیونکہ ایک بندہ اگر کسی کو کچھ دیتا ہے تو اس کا یہ دینا اللہ تعالیٰ کی توفیق وتیسیر اور اس کی تقدیر سے ہی ہے۔ حقیقت میں دینے والا اس کا رازق نہیں ہے، جس طرح بچوں کا باپ، بچوں کا، یا بادشاہ اپنے لشکر کا کفیل کہلاتا ہے حالانکہ امیر اور مامور بچے اور بڑے سب کا رازق حقیقت میں اللہ تعالیٰ ہی ہے جو سب کا خالق بھی ہے۔ اس لئے جو شخص اللہ کے دیئے ہوئے مال میں سے کسی کو کچھ دیتا ہے تو وہ ایسے مال میں تصرف کرتا ہے جو اللہ ہی نے اسے دیا ہے، پس درحقیقت رازق بھی اللہ ہی ہوا۔ تاہم یہ اس کا مزید فضل وکرم ہے کہ اس کے دیئے ہوئے مال میں اس کی مرضی کے مطابق تصرف (خرچ کرنے) پر وہ اجر وثواب بھی عطا فرماتا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qul inna rabbī yabsuṭu al-riz'qa liman yashāu min ʿibādihi wayaqdiru lahu wamā anfaqtum min shayin fahuwa yukh'lifuhu wahuwa khayru al-rāziqīna ","translations":["Say","Indeed","my Lord","extends","the provision","for whom","He wills","of","His slaves","and restricts","for him","But what","you spend","of","anything","then He","will compensate it","and He","(is the) Best","(of) the Providers","(39)"],"transliterationArr":["qul","inna","rabbī","yabsuṭu","al-riz'qa","liman","yashāu","min","ʿibādihi","wayaqdiru","lahu","wamā","anfaqtum","min","shayin","fahuwa","yukh'lifuhu","wahuwa","khayru","al-rāziqīna",null],"verseTiming":[[1,0,430],[2,430,1660],[3,1660,2510],[4,2510,3210],[5,3210,3990],[6,3990,4420],[7,4420,7330],[8,7330,7700],[9,7700,8840],[10,8840,9840],[11,9840,10780],[12,10780,12580],[13,12580,14300],[14,14300,15520],[15,15520,16850],[16,16850,17990],[17,17990,19450],[18,19450,19990],[19,19990,20510],[20,20510,24005]]}}