{"name":"34:50","price":"کہہ دیجیئے کہ اگر میں بہک جاؤں تو میرے بہکنے (کا وبال) مجھ پر ہی ہے اور اگر میں راه ہدایت پر ہوں تو بہ سبب اس وحی کے جو میرا پروردگار مجھے کرتا(1) ہے وه بڑا ہی سننے واﻻ اور بہت ہی قریب ہے.(2)","arabic":"قُلۡ إِن ضَلَلۡتُ فَإِنَّمَآ أَضِلُّ عَلَىٰ نَفۡسِيۖ وَإِنِ ٱهۡتَدَيۡتُ فَبِمَا يُوحِيٓ إِلَيَّ رَبِّيٓۚ إِنَّهُۥ سَمِيعٞ قَرِيبٞ","category":["34 (Saba)","Saba","Surah Saba","Chapter Saba","Surah 34","Chapter 34","Sheba","سَبَأ"],"ayahNumber":3656,"juzNumber":22,"footnotes":"(1) یعنی بھلائی سب اللہ کی طرف سے ہے، اور اللہ تعالیٰ نے جو وحی اور حق مبین نازل فرمایا ہے، اس میں رشد وہدایت ہے، صحیح راستہ لوگوں کو اسی سے ملتا ہے۔ پس جو گمراہ ہوتا ہے، تو اس میں انسان کی اپنی ہی کوتاہی اور ہوائے نفس کا دخل ہوتا ہے۔ اس لئے اس کا وبال بھی اسی پر ہوگا۔ حضرت عبداللہ بن مسعود (رضي الله عنه) جب کسی سائل کے جواب میں اپنی طرف سے کچھ بیان فرماتے تو ساتھ کہتے ”أَقُولُ فِيهَا بِرَأْيي، فَإِنْ يَكُنْ صَوَابًا فَمِنَ اللهِ ، وَإِنْ يَكُنْ خَطَأً فَمِنِّي وَمِنَ الشَّيْطَانِ، وَاللهُ وَرَسُولُهُ بَرِيئَانِ مِنْهُ“ (ابن كثير)۔\n(2) جس طرح حدیث میں فرمایا «إِنَّكُمْ لا تَدْعُونَ أَصَمَّ وَلا غَائِبًا ، إِنَّمَا تَدْعُونَ سَمِيعًا قَرِيبًا مُجِيبًا» (بخاري كتاب الدعاء ، باب الدعاء إذا علا عقبة)” تم بہری اور غائب ذات کو نہیں پکار رہے ہو بلکہ اس کو پکار رہے ہو جو سننے والا، قریب اور قبول کرنے والا ہے“۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qul in ḍalaltu fa-innamā aḍillu ʿalā nafsī wa-ini ih'tadaytu fabimā yūḥī ilayya rabbī innahu samīʿun qarībun ","translations":["Say","If","I err","then only","I will err","against","myself","But if","I am guided","then it is by what","reveals","to me","my Lord","Indeed, He","(is) All-Hearer","Ever-Near","(50)"],"transliterationArr":["qul","in","ḍalaltu","fa-innamā","aḍillu","ʿalā","nafsī","wa-ini","ih'tadaytu","fabimā","yūḥī","ilayya","rabbī","innahu","samīʿun","qarībun",null],"verseTiming":[[1,0,420],[2,420,660],[3,660,2290],[4,2290,5420],[5,5420,6230],[6,6230,6750],[7,6750,7890],[8,7890,8410],[9,8410,9340],[10,9340,9980],[11,9980,12160],[12,12160,12940],[13,12940,14020],[14,14020,15440],[15,15440,17400],[16,17400,19715]]}}