{"name":"34:9","price":"کیا پس وه اپنے آگے پیچھے آسمان وزمین کو دیکھ نہیں رہے ہیں(1) ؟ اگر ہم چاہیں تو انہیں زمین میں دھنسا دیں یا ان پر آسمان کے ٹکڑے گرادیں(2)، یقیناً اس میں پوری دلیل ہے ہر اس بندے کے لئے جو (دل سے) متوجہ ہو.","arabic":"أَفَلَمۡ يَرَوۡاْ إِلَىٰ مَا بَيۡنَ أَيۡدِيهِمۡ وَمَا خَلۡفَهُم مِّنَ ٱلسَّمَآءِ وَٱلۡأَرۡضِۚ إِن نَّشَأۡ نَخۡسِفۡ بِهِمُ ٱلۡأَرۡضَ أَوۡ نُسۡقِطۡ عَلَيۡهِمۡ كِسَفٗا مِّنَ ٱلسَّمَآءِۚ إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ لِّكُلِّ عَبۡدٖ مُّنِيبٖ","category":["34 (Saba)","Saba","Surah Saba","Chapter Saba","Surah 34","Chapter 34","Sheba","سَبَأ"],"ayahNumber":3615,"juzNumber":22,"footnotes":"(1) یعنی اس پر غور وفکر نہیں کرتے؟ اللہ تعالیٰ ان کی زجر وتوبیخ کرتے ہوئے فرما رہا ہےکہ آخرت کا یہ انکار، آسمان وزمین کی پیدائش میں غوروفکر نہ کرنے کا نتیجہ ہے، ورنہ جو ذات آسمان جیسی چیز، جس کی بلندی اور وسعت ناقابل بیان ہے اور زمین جیسی چیز، جس کا طول وعرض بھی ناقابل فہم ہے، پیدا کرسکتا ہے۔ اس کے لئے اپنی ہی پیدا کردہ چیز کا دوبارہ پیدا کردینا اور اسے دوبارہ اسی حالت میں لے آنا، جس میں وہ پہلے تھی، کیوں کر ناممکن ہے؟\n(2) یعنی یہ آیت دو باتوں پر مشتمل ہے، ایک اللہ کے کمال قدرت کا بیان جو ابھی مذکور ہوا، دوسری، کفار کے لئے تنبیہ وتہدید، کہ جو اللہ آسمان وزمین کی تخلیق پر اس طرح قادر ہے کہ ان پر اور ان کے مابین ہر چیز پر اس کا تصرف اور غلبہ ہے، وہ جب چاہے ان پر اپنا عذاب بھیج کر ان کو تباہ کرسکتا ہے۔ زمین میں دھنسا کر بھی، جس طرح قارون کو دھنسایا یا آسمان کے ٹکڑے گرا کر، جس طرح اصحاب الایکہ کو ہلاک کیا گیا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"afalam yaraw ilā mā bayna aydīhim wamā khalfahum mina al-samāi wal-arḍi in nasha nakhsif bihimu al-arḍa aw nus'qiṭ ʿalayhim kisafan mina al-samāi inna fī dhālika laāyatan likulli ʿabdin munībin ","translations":["Then, do not","they see","towards","what","(is) before them","(is) before them","and what","(is) behind them","of","the heaven","and the earth","If","We will","We (could) cause to swallow them","We (could) cause to swallow them","the earth","or","cause to fall","upon them","fragments","from","the sky","Indeed","in","that","surely, is a Sign","for every","slave","who turns (to Allah)","(9)"],"transliterationArr":["afalam","yaraw","ilā","mā","bayna","aydīhim","wamā","khalfahum","mina","al-samāi","wal-arḍi","in","nasha","nakhsif","bihimu","al-arḍa","aw","nus'qiṭ","ʿalayhim","kisafan","mina","al-samāi","inna","fī","dhālika","laāyatan","likulli","ʿabdin","munībin",null],"verseTiming":[[1,0,710],[2,710,1250],[3,1250,1770],[4,1770,2100],[5,2100,2580],[6,2580,3700],[7,3700,4160],[8,4160,5120],[9,5120,6120],[10,6120,8480],[11,8480,9800],[12,9800,10230],[13,10230,11500],[14,11500,12260],[15,12260,12790],[16,12790,13580],[17,13580,13870],[18,13870,14570],[19,14570,15520],[20,15520,16120],[21,16120,17390],[22,17390,20280],[23,20280,21530],[24,21530,21950],[25,21950,22710],[26,22710,23620],[27,23620,24630],[28,24630,25390],[29,25390,29695]]}}