{"name":"35:10","price":"جو شخص عزت حاصل کرنا چاہتا ہو تو اللہ تعالیٰ ہی کی ساری عزت ہے(1) ، تمام تر ستھرے کلمات اسی کی طرف چڑھتے ہیں(2) اور نیک عمل ان کو بلند کرتا ہے(3)، جو لوگ برائیوں کے داؤں گھات میں لگے رہتے ہیں(4) ان کے لئے سخت تر عذاب ہے، اور ان کا یہ مکر برباد ہوجائے گا.(5)","arabic":"مَن كَانَ يُرِيدُ ٱلۡعِزَّةَ فَلِلَّهِ ٱلۡعِزَّةُ جَمِيعًاۚ إِلَيۡهِ يَصۡعَدُ ٱلۡكَلِمُ ٱلطَّيِّبُ وَٱلۡعَمَلُ ٱلصَّٰلِحُ يَرۡفَعُهُۥۚ وَٱلَّذِينَ يَمۡكُرُونَ ٱلسَّيِّـَٔاتِ لَهُمۡ عَذَابٞ شَدِيدٞۖ وَمَكۡرُ أُوْلَٰٓئِكَ هُوَ يَبُورُ","category":["35 (Fatir)","Fatir","Surah Fatir","Chapter Fatir","Surah 35","Chapter 35","The Originator","فَاطِر"],"ayahNumber":3670,"juzNumber":22,"footnotes":"(1) یعنی جو چاہتا ہے کہ اسے دنیا اور آخرت میں عزت ملے، تو وہ اللہ کی اطاعت کرے، اس سے اسے یہ مقصود حاصل ہوجائے گا۔ اس لئے کہ دنیا وآخرت کا مالک اللہ ہی ہے، ساری عزتیں اسی کے پاس ہیں وہ جس کو عزت دے، وہی عزیز ہوگا، جس کو وہ ذلیل کردے، اسے دنیا کی کوئی طاقت عزت نہیں دے سکتی۔ دوسرے مقام پر فرمایا۔ «الَّذِينَ يَتَّخِذُونَ الْكَافِرِينَ أَوْلِيَاءَ مِنْ دُونِ الْمُؤْمِنِينَ أَيَبْتَغُونَ عِنْدَهُمُ الْعِزَّةَ فَإِنَّ الْعِزَّةَ لِلَّهِ جَمِيعًا» (النساء: 139)۔\n(2) الْكَلِمُ، كَلِمَةٌ کی جمع ہے، ستھرے کلمات سے مراد اللہ کی تسبیح وتحمید، تلاوت، امر بالمعروف ونہی عن المنکر ہے۔ چڑھتے ہیں کا مطلب، قبول کرنا ہے۔ یا فرشتوں کا انہیں لے کر آسمانوں پر چڑھنا ہے تاکہ اللہ ان کی جزا دے۔\n(3) يَرْفَعُهُ، میں ضمیر کا مرجع کون ہے؟ بعض کہتے ہیں الْكَلِمُ الطَّيِّبُ ہے، یعنی عمل صالح کلمات طیبات کو اللہ کی طرف سے بلند کرتا ہے۔ یعنی محض زبان سے اللہ کا ذکر (تسبیح وتحمید) کچھ نہیں، جب تک اس کے ساتھ عمل صالح یعنی احکام وفرائض کی ادائیگی بھی نہ ہو۔ بعض کہتے ہیں يَرْفَعُه ُ میں فاعل کی ضمیر اللہ کی طرف راجع ہے۔ مطلب ہے کہ اللہ تعالیٰ عمل صالح کو کلمات طیبات پر بلند فرماتا ہے اس لئے کہ عمل صالح سے ہی اس بات کا تحقق ہوتا ہے کہ اس کا مرتکب فی الواقع اللہ کی تسبیح وتحمید میں مخلص ہے (فتح القدیر) گویا قول، عمل کے بغیر، اللہ کے ہاں بےحیثیت ہے۔\n(4) خفیہ طریقے سے کسی کو نقصان پہنچانے کی تدبیر کو مکر کہتے ہیں کفروشرک کا ارتکاب بھی مکر ہے کہ اس طرح اللہ کے راستہ کو نقصان پہنچایا جاتا ہے۔ نبی کریم (صلى الله عليه وسلم) کے خلاف قتل وغیرہ کی جو سازشیں کفار مکہ کرتے رہے، وہ بھی مکر ہے، ریاکاری بھی مکر ہے۔ یہاں یہ لفظ عام ہے، مکر کی تمام صورتوں کو شامل ہے۔\n(5) یعنی ان کا مکر بھی برباد ہوگا اور اس کا وبال بھی ان ہی پر پڑے گا جو اس کا ارتکاب کرتے ہیں، جیسے فرمایا۔ «وَلا يَحِيقُ الْمَكْرُ السَّيِّئُ إِلا بِأَهْلِهِ» (فاطر: 43)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"man kāna yurīdu al-ʿizata falillahi al-ʿizatu jamīʿan ilayhi yaṣʿadu al-kalimu al-ṭayibu wal-ʿamalu al-ṣāliḥu yarfaʿuhu wa-alladhīna yamkurūna al-sayiāti lahum ʿadhābun shadīdun wamakru ulāika huwa yabūru ","translations":["Whoever","[is] desires","[is] desires","the honor","then for Allah","(is) the Honor","all","To Him","ascends","the words","good","and the deed","righteous","raises it","But those who","plot","the evil","for them","(is) a punishment","severe","and (the) plotting","(of) those ","it","(will) perish","(10)"],"transliterationArr":["man","kāna","yurīdu","al-ʿizata","falillahi","al-ʿizatu","jamīʿan","ilayhi","yaṣʿadu","al-kalimu","al-ṭayibu","wal-ʿamalu","al-ṣāliḥu","yarfaʿuhu","wa-alladhīna","yamkurūna","al-sayiāti","lahum","ʿadhābun","shadīdun","wamakru","ulāika","huwa","yabūru",null],"verseTiming":[[1,0,1340],[2,1340,1860],[3,1860,2620],[4,2620,3650],[5,3650,4820],[6,4820,5760],[7,5760,7380],[8,7380,8280],[9,8280,9050],[10,9050,9820],[11,9820,10840],[12,10840,11790],[13,11790,12830],[14,12830,14390],[15,14390,15520],[16,15520,16600],[17,16600,18050],[18,18050,18530],[19,18530,19600],[20,19600,23150],[21,23150,23950],[22,23950,26160],[23,26160,26460],[24,26460,29155]]}}