{"name":"35:18","price":"کوئی بھی بوجھ اٹھانے واﻻ دوسرے کا بوجھ نہیں اٹھائے گا(1) ، اگر کوئی گراں بار دوسرے کو اپنا بوجھ اٹھانے کے لئے بلائے گا تو وه اس میں سے کچھ بھی نہ اٹھائے گا گو قرابت دار ہی ہو(2)۔ تو صرف ان ہی کو آگاه کرسکتا ہے جو غائبانہ طور پر اپنے رب سے ڈرتے ہیں اور نمازوں کی پابندی کرتے ہیں(3) اور جو بھی پاک ہوجائے وه اپنے ہی نفع کے لئے پاک ہوگا(4)۔ لوٹنا اللہ ہی کی طرف ہے.","arabic":"وَلَا تَزِرُ وَازِرَةٞ وِزۡرَ أُخۡرَىٰۚ وَإِن تَدۡعُ مُثۡقَلَةٌ إِلَىٰ حِمۡلِهَا لَا يُحۡمَلۡ مِنۡهُ شَيۡءٞ وَلَوۡ كَانَ ذَا قُرۡبَىٰٓۗ إِنَّمَا تُنذِرُ ٱلَّذِينَ يَخۡشَوۡنَ رَبَّهُم بِٱلۡغَيۡبِ وَأَقَامُواْ ٱلصَّلَوٰةَۚ وَمَن تَزَكَّىٰ فَإِنَّمَا يَتَزَكَّىٰ لِنَفۡسِهِۦۚ وَإِلَى ٱللَّهِ ٱلۡمَصِيرُ","category":["35 (Fatir)","Fatir","Surah Fatir","Chapter Fatir","Surah 35","Chapter 35","The Originator","فَاطِر"],"ayahNumber":3678,"juzNumber":22,"footnotes":"(1) ہاں جس نے دوسروں کو گمراہ کیا ہوگا، وہ اپنے گناہوں کے بوجھ کے ساتھ ان کے گناہوں کا بوجھ بھی اٹھائے گا، جیسا کہ آیت «وَلَيَحْمِلُنَّ أَثْقَالَهُمْ وَأَثْقَالا مَعَ أَثْقَالِهِمْ» (العنكبوت: 13) اور حدیث «مَنْ سَنَّ سُنّةً سَيِّئَةً كَانَ عَلَيْهِ وِزْرُهَا وَوِزْرُ مَنْ عَمِلَ بِهَا مِنْ بَعْدِهِ» (صحيح مسلم ، كتاب الزكاة ، باب الحث على الصدقة) سے واضح ہے لیکن یہ دوسروں کا بوجھ بھی درحقیقت ان کا اپنا ہی بوجھ ہے کہ ان ہی نے ان دوسروں کو گمراہ کیا تھا۔\n(2) مُثْقَلَةٌ أَيْ نَفْسٌ مُثْقَلَةٌ، ایسا شخص جو گناہوں کے بوجھ سے لدا ہوگا، وہ اپنا بوجھ اٹھانے کے لئے اپنے رشتے دار کو بھی بلائے گا تو وہ آمادہ نہیں ہوگا۔\n(3) یعنی تیرے انذاروتبلیغ کا فائدہ ان ہی لوگوں کو ہوسکتا ہے، گویا تو ان ہی کو ڈراتا ہے، ان کو نہیں جن کوانذار سے کوئی فائدہ نہیں ہوتا۔ جس طرح دوسرے مقام پر فرمایا، «إِنَّمَا أَنْتَ مُنْذِرُ مَنْ يَخْشَاهَا» (النازعات: 45) اور «إِنَّمَا تُنْذِرُ مَنِ اتَّبَعَ الذِّكْرَ وَخَشِيَ الرَّحْمَنَ بِالْغَيْبِ» (يٰس: 11)۔\n(4) تَطَهُّرٌ اور تَزَكِّي کے معنی ہیں شرک اور فواحش کی آلودگیوں سے پاک ہونا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walā taziru wāziratun wiz'ra ukh'rā wa-in tadʿu muth'qalatun ilā ḥim'lihā lā yuḥ'mal min'hu shayon walaw kāna dhā qur'bā innamā tundhiru alladhīna yakhshawna rabbahum bil-ghaybi wa-aqāmū al-ṣalata waman tazakkā fa-innamā yatazakkā linafsihi wa-ilā al-lahi al-maṣīru ","translations":["And not","will bear","bearer of burdens","burden","(of) another","And if","calls","a heavily laden","to","(carry) its load","not","will be carried","of it","anything","even if","he be","near of kin","near of kin","Only","you can warn","those who","fear","their Lord ","unseen","and establish","the prayer","And whoever","purifies himself","then only","he purifies","for his own self","And to","Allah","(is) the destination","(18)"],"transliterationArr":["walā","taziru","wāziratun","wiz'ra","ukh'rā","wa-in","tadʿu","muth'qalatun","ilā","ḥim'lihā","lā","yuḥ'mal","min'hu","shayon","walaw","kāna","dhā","qur'bā","innamā","tundhiru","alladhīna","yakhshawna","rabbahum","bil-ghaybi","wa-aqāmū","al-ṣalata","waman","tazakkā","fa-innamā","yatazakkā","linafsihi","wa-ilā","al-lahi","al-maṣīru",null],"verseTiming":[[1,0,650],[2,650,1320],[3,1320,3080],[4,3080,3720],[5,3720,5150],[6,5150,5780],[7,5780,6900],[8,6900,8020],[9,8020,8580],[10,8580,9580],[11,9580,9980],[12,9980,10740],[13,10740,11240],[14,11240,12580],[15,12580,13030],[16,13030,13640],[17,13640,13910],[18,13910,14960],[19,14960,17100],[20,17100,18550],[21,18550,19530],[22,19530,20460],[23,20460,21950],[24,21950,22960],[25,22960,23890],[26,23890,26200],[27,26200,27820],[28,27820,28790],[29,28790,30650],[30,30650,31790],[31,31790,32750],[32,32750,33700],[33,33700,34460],[34,34460,36335]]}}