{"name":"35:14","price":"اگر تم انہیں پکارو تو وه تمہاری پکار سنتے ہی نہیں(1) اور اگر (بالفرض) سن بھی لیں تو فریاد رسی نہیں کریں گے(2)، بلکہ قیامت کے دن تمہارے اس شرک کا صاف انکار کرجائیں گے(3)۔ آپ کو کوئی حق تعالیٰ جیسا خبردار خبریں نہ دے گا.(4)","arabic":"إِن تَدۡعُوهُمۡ لَا يَسۡمَعُواْ دُعَآءَكُمۡ وَلَوۡ سَمِعُواْ مَا ٱسۡتَجَابُواْ لَكُمۡۖ وَيَوۡمَ ٱلۡقِيَٰمَةِ يَكۡفُرُونَ بِشِرۡكِكُمۡۚ وَلَا يُنَبِّئُكَ مِثۡلُ خَبِيرٖ","category":["35 (Fatir)","Fatir","Surah Fatir","Chapter Fatir","Surah 35","Chapter 35","The Originator","فَاطِر"],"ayahNumber":3674,"juzNumber":22,"footnotes":"(1) یعنی اگر تم انہیں مصائب میں پکارو تو وہ تمہاری پکار سنتے ہی نہیں ہیں، کیونکہ وہ جمادات ہیں یامنوں مٹی کے نیچے مدفون۔\n(2) یعنی اگر بالفرض وہ سن بھی لیں تو بےفائدہ، اس لئے کہ وہ تمہاری التجاؤں کے مطابق تمہارا کام نہیں کرسکتے۔\n(3) اور کہیں گے «مَا كُنْتُمْ إِيَّانَا تَعْبُدُونَ» (يونس: 28) ”تم ہماری عبادت نہیں کرتے تھے“۔ «إِنْ كُنَّا عَنْ عِبَادَتِكُمْ لَغَافِلِينَ» (يونس: 29) ”ہم تو تمہاری عبادت سے بےخبر تھے“۔ اس آیت سے یہ بھی معلوم ہوتا ہے کہ جن کی اللہ کے سوا عبادت کی جاتی ہے، وہ سب پتھر کی مورتیاں ہی نہیں ہوں گی، بلکہ ان میں عاقل (ملائکہ، جن، شیاطین اور صالحین) بھی ہوں گے۔ تب ہی تو یہ انکار کریں گے۔ اور یہ بھی معلوم ہوا کہ ان کی حاجت براری کے لئے پکارنا شرک ہے۔\n(4) اس لئے کہ اس جیسا کامل علم کسی کے پاس بھی نہیں ہے۔ وہی تمام امور کی کنہ اور حقیقت سے پوری طرح باخبر ہے جس میں ان پکارﮮ جانے والوں کی بےاختیاری، پکار کو نہ سننا اور قیامت کے دن اس کا انکار کرنا بھی شامل ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"in tadʿūhum lā yasmaʿū duʿāakum walaw samiʿū mā is'tajābū lakum wayawma al-qiyāmati yakfurūna bishir'kikum walā yunabbi-uka mith'lu khabīrin ","translations":["If","you invoke them","not","they hear","your call","and if","they heard","not","they (would) respond","to you","And (on the) Day","(of) the Resurrection","they will deny","your association","And none","can inform you","like","(the) All-Aware","(14)"],"transliterationArr":["in","tadʿūhum","lā","yasmaʿū","duʿāakum","walaw","samiʿū","mā","is'tajābū","lakum","wayawma","al-qiyāmati","yakfurūna","bishir'kikum","walā","yunabbi-uka","mith'lu","khabīrin",null],"verseTiming":[[1,0,380],[2,380,2470],[3,2470,2950],[4,2950,3800],[5,3800,6420],[6,6420,6860],[7,6860,7700],[8,7700,7830],[9,7830,9000],[10,9000,10080],[11,10080,10770],[12,10770,12030],[13,12030,13070],[14,13070,14670],[15,14670,15220],[16,15220,16400],[17,16400,16920],[18,16920,19695]]}}