{"name":"35:38","price":"بےشک اللہ تعالیٰ جاننے واﻻ ہے آسمانوں اور زمین کی پوشیده چیزوں کا(1) ، بےشک وہی جاننے واﻻ ہے سینوں کی باتوں کا.(2)","arabic":"إِنَّ ٱللَّهَ عَٰلِمُ غَيۡبِ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ إِنَّهُۥ عَلِيمُۢ بِذَاتِ ٱلصُّدُورِ","category":["35 (Fatir)","Fatir","Surah Fatir","Chapter Fatir","Surah 35","Chapter 35","The Originator","فَاطِر"],"ayahNumber":3698,"juzNumber":22,"footnotes":"(1) یہاں یہ بیان کرنے کا مقصد یہ بھی ہوسکتا ہے کہ تم دوبارہ دنیا میں جانے کی آرزو کر رہے ہو اور دعویٰ کر رہے ہو کہ اب نافرمانی کی جگہ اطاعت اور شرک کی جگہ توحید اختیار کرو گے۔ لیکن ہمیں علم ہے کہ تم ایسا نہیں کرو گے۔ تمہیں اگر دنیا میں دوبارہ بھیج بھی دیا جائے، تو تم وہی کچھ کرو گے جو پہلے کرتے رہے ہو۔ جیسے دوسرے مقام پر اللہ نے فرمایا «وَلَوْ رُدُّوا لَعَادُوا لِمَا نُهُوا عَنْهُ» (الأنعام: 28) ”اگر انہیں دوبارہ دنیا میں بھیج دیا جائے تو وہی کام کریں گے جن سے انہیں منع کیا گیا تھا“۔\n(2) یہ پچھلی بات کی تعلیل ہے۔ یعنی اللہ تعالیٰ کو آسمان اور زمین کی پوشیدہ باتوں کا علم کیوں نہ ہو، جب کہ وہ سینوں کی باتوں اور رازوں سے بھی واقف ہے جو سب سے زیادہ مخفی ہوتے ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"inna al-laha ʿālimu ghaybi al-samāwāti wal-arḍi innahu ʿalīmun bidhāti al-ṣudūri ","translations":["Indeed","Allah","(is the) Knower","(of the) unseen","(of) the heavens","and the earth","Indeed, He","(is the) All-Knower","of what (is) in the breasts","of what (is) in the breasts","(38)"],"transliterationArr":["inna","al-laha","ʿālimu","ghaybi","al-samāwāti","wal-arḍi","innahu","ʿalīmun","bidhāti","al-ṣudūri",null],"verseTiming":[[1,0,1300],[2,1300,2100],[3,2100,2920],[4,2920,3480],[5,3480,4940],[6,4940,6440],[7,6440,8100],[8,8100,9990],[9,9990,10720],[10,10720,13475]]}}