{"name":"35:41","price":"یقینی بات ہے کہ اللہ تعالیٰ آسمانوں اور زمین کو تھامے ہوئے ہے کہ وه ٹل نہ جائیں(1) اور اگر وه ٹل جائیں تو پھر اللہ کے سوا اور کوئی ان کو تھام بھی نہیں سکتا(2)۔ وه حلیم غفور ہے.(3)","arabic":"۞ إِنَّ ٱللَّهَ يُمۡسِكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ أَن تَزُولَاۚ وَلَئِن زَالَتَآ إِنۡ أَمۡسَكَهُمَا مِنۡ أَحَدٖ مِّنۢ بَعۡدِهِۦٓۚ إِنَّهُۥ كَانَ حَلِيمًا غَفُورٗا","category":["35 (Fatir)","Fatir","Surah Fatir","Chapter Fatir","Surah 35","Chapter 35","The Originator","فَاطِر"],"ayahNumber":3701,"juzNumber":22,"footnotes":"(1) كَرَاهَةَ أَنْ تَزُولا لِئَلا تَزُولا یہ اللہ تعالیٰ کے کمال قدرت وصنعت کا بیان ہے۔ بعض نے کہا، مطلب یہ ہے کہ ان کے شرک کا اقتضا ہے کہ آسمان وزمین اپنی حالت پر برقرار نہ رہیں بلکہ ٹوٹ پھوٹ کا شکار ہوجائیں۔ جیسے آیت۔ «تَكَادُ السَّمَاوَاتُ يَتَفَطَّرْنَ مِنْهُ وَتَنْشَقُّ الأَرْضُ وَتَخِرُّ الْجِبَالُ هَدًّا، أَنْ دَعَوْا لِلرَّحْمَنِ وَلَدًا» (مريم: 90 - 91) کا مفہوم ہے۔\n(2) یعنی یہ اللہ کے کمال قدرت کے ساتھ اس کی کمال مہربانی بھی ہے کہ وہ آسمان وزمین کو تھامے ہوئے ہے اور انہیں اپنی جگہ سے ہلنے اور ڈولنے نہیں دیتا ہے، ورنہ پلک جھپکتے میں دنیا کا نظام تباہ ہوجائے۔ کیونکہ اگر وہ ا نہیں تھامے نہ رکھے اور انہیں اپنی جگہ سے پھیر دے تو اللہ کے سوا کوئی ایسی ہستی نہیں ہے جو ان کو تھام لے إِنْ أَمْسَكَهُمَا میں إِنْ نافیہ ہے۔ اللہ نے اپنے اس احسان اور نشانی کا تذکرہ دوسرے مقامات پر بھی فرمایا ہے مثلاً «وَيُمْسِكُ السَّمَاءَ أَنْ تَقَعَ عَلَى الأَرْضِ إِلا بِإِذْنِهِ» (الحج: 65) اور «وَمِنْ آيَاتِهِ أَنْ تَقُومَ السَّمَاءُ وَالأَرْضُ بِأَمْرِهِ» (الروم: 25) ”اسی نے آسمان کو زمین پر گرنے سے روکا ہوا ہے، مگر جب اس کا حکم ہوگا“۔ ”اس کی نشانیوں میں سے ہے کہ آسمان وزمین اس کے حکم سے قائم ہیں“۔\n(3) اتنی قدرتوں کے باوجود وہ حلیم ہے۔ اپنے بندوں کو دیکھتا ہے کہ وہ کفر وشرک اور نافرمانی کر رہے ہیں، پھر بھی وہ ان کی گرفت میں جلدی نہیں کرتا، بلکہ ڈھیل دیتا ہے اور غفور بھی ہے، کوئی تائب ہو کر اس کی بارگاہ میں جھک جاتا ہے، توبہ واستغفار وندامت کا اظہار کرتا ہے تو وہ معاف فرما دیتا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"inna al-laha yum'siku al-samāwāti wal-arḍa an tazūlā wala-in zālatā in amsakahumā min aḥadin min baʿdihi innahu kāna ḥalīman ghafūran ","translations":["Indeed","Allah","upholds","the heavens","and the earth","lest","they cease","And if","they should cease","not","can uphold them","any","one","after Him","after Him","Indeed, He","is","Most Forbearing","Oft-Forgiving","(41)"],"transliterationArr":["inna","al-laha","yum'siku","al-samāwāti","wal-arḍa","an","tazūlā","wala-in","zālatā","in","amsakahumā","min","aḥadin","min","baʿdihi","innahu","kāna","ḥalīman","ghafūran",null],"verseTiming":[[1,0,1350],[2,1350,2150],[3,2150,3060],[4,3060,4540],[5,4540,5550],[6,5550,6650],[7,6650,7740],[8,7740,9350],[9,9350,12110],[10,12110,12520],[11,12520,13910],[12,13910,14300],[13,14300,14910],[14,14910,16370],[15,16370,17160],[16,17160,18440],[17,18440,20130],[18,20130,20760],[19,20760,21830],[20,21830,23625]]}}