{"name":"35:43","price":"دنیا میں اپنے کو بڑا سمجھنے کی وجہ سے(1) ، اور ان کی بری تدبیروں کی وجہ سے(2) اور بری تدبیروں کا وبال ان تدبیر والوں ہی پر پڑتا ہے(3)، سو کیا یہ اسی دستور کے منتظر ہیں جو اگلے لوگوں کے ساتھ ہوتا رہا ہے(4)۔ سو آپ اللہ کے دستور کو کبھی بدلتا ہوا نہ پائیں گے(5)، اور آپ اللہ کے دستور کو کبھی منتقل ہوتا ہوا نہ پائیں گے.(6)","arabic":"ٱسۡتِكۡبَارٗا فِي ٱلۡأَرۡضِ وَمَكۡرَ ٱلسَّيِّيِٕۚ وَلَا يَحِيقُ ٱلۡمَكۡرُ ٱلسَّيِّئُ إِلَّا بِأَهۡلِهِۦۚ فَهَلۡ يَنظُرُونَ إِلَّا سُنَّتَ ٱلۡأَوَّلِينَۚ فَلَن تَجِدَ لِسُنَّتِ ٱللَّهِ تَبۡدِيلٗاۖ وَلَن تَجِدَ لِسُنَّتِ ٱللَّهِ تَحۡوِيلًا","category":["35 (Fatir)","Fatir","Surah Fatir","Chapter Fatir","Surah 35","Chapter 35","The Originator","فَاطِر"],"ayahNumber":3703,"juzNumber":22,"footnotes":"(1) یعنی آپ (صلی اللہ علیہ وسلم) کی نبوت پر ایمان لانے کے بجائے انکار و مخالفت کا راستہ محض استکبار اور سرکشی کی وجہ سے اختیار کیا۔\n(2) اور بری تدبیر یعنی حیلہ، دھوکہ اور عمل قبیح کی وجہ سے کیا۔\n(3) یعنی لوگ مکر وحیلہ کرتے ہیں لیکن یہ نہیں جانتے کہ بری تدبیر کا انجام برا ہی ہوتا ہے اور اس کا وبال بالآخر مکر وحیلہ کرنے والوں پر ہی پڑتا ہے۔\n(4) یعنی کیا یہ اپنے کفروشرک، رسول (صلى الله عليه وسلم) کی مخالفت اور مومنوں کو ایذائیں پہنچانے پر مصر رہ کر اس بات کے منتظر ہیں کہ انہیں بھی اس طرح ہلاک کیا جائے، جس طرح پچھلی قومیں ہلاکت سے دوچار ہوئیں؟\n(5) بلکہ یہ اسی طرح جاری ہے اور ہر مکذب (جھٹلانے والے) کا مقدر ہلاکت ہے یا بدلنے کا مطلب یہ ہے کہ کوئی شخص اللہ کے عذاب کو رحمت سے بدلنے پر قادر نہیں ہے۔\n(6) یعنی کوئی اللہ کے عذاب کو دور کرنے والا یا اس کا رخ پھیرنے والا نہیں ہے یعنی جس قوم کو اللہ عذاب سے دوچار کرنا چاہے، کوئی اس کا رخ کسی اور قوم کی طرف پھیر دے، کسی میں یہ طاقت نہیں ہے۔ مطلب اس سنت اللہ کی وضاحت سے مشرکین عرب کو ڈرانا ہے کہ ابھی بھی وقت ہے، وہ کفروشرک چھوڑ کر ایمان لے آئیں، ورنہ وہ اس سنت الٰہی سے بچ نہیں سکتے، دیر سویر اس کی زد میں آکر رہیں گے، کوئی اس قانون الٰہی کو بدلنے پر قادر ہے اور نہ عذاب الٰہی کو پھیرنے پر۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"is'tik'bāran fī al-arḍi wamakra al-sayi-i walā yaḥīqu al-makru al-sayi-u illā bi-ahlihi fahal yanẓurūna illā sunnata al-awalīna falan tajida lisunnati al-lahi tabdīlan walan tajida lisunnati al-lahi taḥwīlan ","translations":["(Due to) arrogance","in","the land","and plotting","(of) the evil","but not","encompasses","the plot","(of) the evil","except","its own people","Then do","they wait","except","(the) way","(of) the former (people)","But never","you will find","in (the) way","(of) Allah","any change","and never","you will find","in (the) way","(of) Allah","any alteration","(43)"],"transliterationArr":["is'tik'bāran","fī","al-arḍi","wamakra","al-sayi-i","walā","yaḥīqu","al-makru","al-sayi-u","illā","bi-ahlihi","fahal","yanẓurūna","illā","sunnata","al-awalīna","falan","tajida","lisunnati","al-lahi","tabdīlan","walan","tajida","lisunnati","al-lahi","taḥwīlan",null],"verseTiming":[[1,0,2380],[2,2380,2620],[3,2620,3490],[4,3490,4260],[5,4260,5190],[6,5190,6430],[7,6430,7220],[8,7220,8070],[9,8070,9150],[10,9150,9970],[11,9970,11480],[12,11480,11940],[13,11940,13670],[14,13670,14450],[15,14450,15960],[16,15960,19490],[17,19490,20530],[18,20530,21140],[19,21140,22570],[20,22570,23390],[21,23390,24740],[22,24740,26150],[23,26150,26940],[24,26940,28460],[25,28460,29330],[26,29330,31395]]}}