{"name":"35:8","price":"کیا پس وه شخص جس کے لئے اس کے برے اعمال مزین کردیئے گئے ہیں پس وه انہیں اچھاسمجھتا(1) ہے (کیا وه ہدایت یافتہ شخص جیسا ہے)، (یقین مانو) کہ اللہ جسے چاہے گمراه کرتا ہے اور جسے چاہے راه راست دکھاتا ہے(2)۔ پس آپ کو ان پر غم کھا کھا کر اپنی جان ہلاکت میں نہ ڈالنی چاہیئے(3)، یہ جو کچھ کر رہے ہیں اس سے یقیناً اللہ تعالیٰ بخوبی واقف ہے.(4)","arabic":"أَفَمَن زُيِّنَ لَهُۥ سُوٓءُ عَمَلِهِۦ فَرَءَاهُ حَسَنٗاۖ فَإِنَّ ٱللَّهَ يُضِلُّ مَن يَشَآءُ وَيَهۡدِي مَن يَشَآءُۖ فَلَا تَذۡهَبۡ نَفۡسُكَ عَلَيۡهِمۡ حَسَرَٰتٍۚ إِنَّ ٱللَّهَ عَلِيمُۢ بِمَا يَصۡنَعُونَ","category":["35 (Fatir)","Fatir","Surah Fatir","Chapter Fatir","Surah 35","Chapter 35","The Originator","فَاطِر"],"ayahNumber":3668,"juzNumber":22,"footnotes":"(1) جس طرح کفار وفجار ہیں، وہ کفر وشرک اور فسق وفجور کرتے ہیں اور سمجھتے یہ ہیں کہ وہ اچھا کر رہے ہیں۔ پس ایسا شخص، جس کو اللہ نے گمراہ کردیا ہو، اس کے بچاؤ کے لئے آپ کے پاس کوئی حیلہ ہے؟ یا یہ اس شخص کے برابر ہے جسے اللہ نے ہدایت سے نوازا ہے؟ جواب نفی میں ہی ہے، نہیں یقیناً نہیں۔\n(2) اللہ تعالیٰ اپنے عدل کی رو سے، اپنی سنت کے مطابق اس کو گمراہ کرتا ہےجو مسلسل اپنے کرتوتوں سے اپنے کو اس کا مستحق ٹھہرا چکتا ہے اور ہدایت اپنے فضل وکرم سے اسے دیتا ہے جو اس کا طالب ہوتا ہے۔\n(3) کیونکہ اللہ تعالیٰ کا ہر کام حکمت اور علم تام پر مبنی ہے، اس لئے کسی کی گمراہی پر اتنا افسوس نہ کریں کہ اپنی جان کو خطرے میں ڈال لیں۔\n(4) یعنی اس سے ان کا کوئی قول یا فعل مخفی نہیں، مطلب یہ ہے کہ اللہ کا ان کے ساتھ معاملہ ایک علیم وخبیر اور ایک حکیم کی طرح کا ہے۔ عام بادشاہوں کی طرح نہیں ہے جو اپنے اختیارات کا الل ٹپ استعمال کرتے ہیں، کبھی سلام کرنے سے بھی ناراض ہوجاتے ہیں اور کبھی دشنام پر ہی خلعتوں سے نواز دیتے ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"afaman zuyyina lahu sūu ʿamalihi faraāhu ḥasanan fa-inna al-laha yuḍillu man yashāu wayahdī man yashāu falā tadhhab nafsuka ʿalayhim ḥasarātin inna al-laha ʿalīmun bimā yaṣnaʿūna ","translations":["Then is (he) who ","is made fair-seeming","to him","(the) evil","(of) his deed ","so that he sees it","(as) good","For indeed","Allah","lets go astray","whom","He wills","and guides","whom","He wills","So (let) not","go out","your soul","for them","(in) regrets","Indeed","Allah","(is) All-Knower","of what","they do","(8)"],"transliterationArr":["afaman","zuyyina","lahu","sūu","ʿamalihi","faraāhu","ḥasanan","fa-inna","al-laha","yuḍillu","man","yashāu","wayahdī","man","yashāu","falā","tadhhab","nafsuka","ʿalayhim","ḥasarātin","inna","al-laha","ʿalīmun","bimā","yaṣnaʿūna",null],"verseTiming":[[1,0,1440],[2,1440,2180],[3,2180,2770],[4,2770,4380],[5,4380,5480],[6,5480,6410],[7,6410,7310],[8,7310,8990],[9,8990,9750],[10,9750,10520],[11,10520,10920],[12,10920,13529],[13,13529,14449],[14,14449,14609],[15,14609,17639],[16,17639,18718],[17,18718,19558],[18,19558,20258],[19,20258,21158],[20,21158,24248],[21,24248,25688],[22,25688,26518],[23,26518,28328],[24,28328,28928],[25,28928,31993]]}}