{"name":"36:12","price":"بےشک ہم مُردوں کو زنده کریں گے(1) ، اور ہم لکھتے جاتے ہیں وه اعمال بھی جن کو لوگ آگے بھیجتے ہیں(2) اور ان کے وه اعمال بھی جن کو پیچھے چھوڑ جاتے ہیں، اور ہم نے ہر چیز کو ایک واضح کتاب میں ضبط کر رکھا ہے.(3)","arabic":"إِنَّا نَحۡنُ نُحۡيِ ٱلۡمَوۡتَىٰ وَنَكۡتُبُ مَا قَدَّمُواْ وَءَاثَٰرَهُمۡۚ وَكُلَّ شَيۡءٍ أَحۡصَيۡنَٰهُ فِيٓ إِمَامٖ مُّبِينٖ","category":["36 (Ya-Sin)","Ya-Sin","Surah Ya-Sin","Chapter Ya-Sin","Sin","Surah Sin","Chapter Sin","Ya Sin","Surah Ya Sin","Chapter Ya Sin","Surah 36","Chapter 36","Ya-Sin","يس"],"ayahNumber":3717,"juzNumber":22,"footnotes":"(1) یعنی قیامت والے دن۔ یہاں احیائے موتی کے ذکر سے یہ اشارہ کرنا بھی مقصود ہے کہ اللہ تعالیٰ کافروں میں سے جس کا دل چاہتا ہے، زندہ کردیتا ہے جو کفروضلالت کی وجہ سے مردہ ہوچکے ہوتے ہیں۔ پس وہ ہدایت اور ایمان کو اپنا لیتے ہیں۔\n(2) مَا قَدَّمُوا سے وہ اعمال مراد ہیں جو انسان خود اپنی زندگی میں کرتا ہے اور آثَارَهُمْ سے وہ اعمال جن کے عملی نمونے (اچھے یا برے) وہ دنیا میں چھوڑ جاتا ہے اور اس کے مرنے کے بعد اس کی اقتدا میں لوگ وہ اعمال بجا لاتے ہیں۔ جس طرح حدیث میں ہے ”جس نےاسلام میں کوئی نیک طریقہ جاری کیا، اس کے لئے اس کا اجر بھی ہے اور اس کا بھی ہے جو اس کے بعد اس پر عمل کرے گا۔ بغیر اس کے کہ ان میں سے کسی کے اجر میں کمی ہو اور جس نے کوئی برا طریقہ جاری کیا، اس پر اس کے اپنے گناہ کا بھی بوجھ ہوگا اور اس کا بھی جو اس کے بعد اس پر عمل کرے گا، بغیر اس کے کہ ان میں کسی کے بوجھ میں کمی ہو“۔ (صحيح مسلم، كتاب الزكاة ، باب الحث على الصدقة ولو بشق تمرة) اسی طرح یہ حدیث ہے ”جب انسان مر جاتا ہے تو اس کے عمل کا سلسلہ ختم ہوجاتا ہے۔ سوائے تین چیزوں کے۔ ایک علم، جس سے لوگ فائدہ اٹھائیں (2) نیک اولاد جو مرنے والے کے لئے دعا کرے (3) یا صدقہ جاریہ، جس سے اس کے مرنے کے بعد بھی لوگ فیض یاب ہوں“۔ (صحيح مسلم، كتاب الوصية، باب ما يلحق الإنسان من الثواب بعد وفاته) دوسرا مطلب آثَارَهُمْ کا نشانات قدم ہے۔ یعنی انسان نیکی یا بدی کے لئے جو سفر کرتا اور ایک جگہ سے دوسری جگہ جاتا ہے تو قدموں کے یہ نشانات بھی لکھے جاتے ہیں۔ جیسے عہد رسالت میں مسجد نبوی کے قریب کچھ جگہ خالی تھی تو بنوسلمہ نے ادھر منتقل ہونے کا ارادہ کیا، جب نبی کریم (صلى الله عليه وسلم) کے علم میں یہ بات آئی تو آپ (صلى الله عليه وسلم) نے انہیں مسجد کے قریب منتقل ہونے سے روک دیا اور فرمایا : «دَيَاركُمْ تُكْتَبْ آثَارُكُمْ» (دو مرتبہ فرمایا) یعنی تمہارے گھر اگرچہ دور ہیں، لیکن وہیں رہو، جتنے قدم تم چل کر آتے ہو، وہ لکھے جاتے ہیں۔ (صحيح مسلم، كتاب المساجد، باب فضل كثرة الخطى إلى المساجد) امام ابن کثیر فرماتے ہیں۔ دونوں مفہوم اپنی جگہ صحیح ہیں، ان کے درمیان منافات نہیں ہے۔ بلکہ اس دوسرے مفہوم میں سخت تنبیہ ہے، اس لئے کہ جب قدموں کے نشانات تک لکھے جاتے ہیں، تو انسان جو اچھا یا برا نمونہ چھوڑ جائے جس کی لوگ بعد میں پیروی کریں تو وہ بطریق ادنیٰ لکھے جائیں گے۔\n(3) اس سے مراد لوح محفوظ ہے اور بعض نے صحائف اعمال مراد لئے ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"innā naḥnu nuḥ'yī al-mawtā wanaktubu mā qaddamū waāthārahum wakulla shayin aḥṣaynāhu fī imāmin mubīnin ","translations":["Indeed, We","[We]","[We] give life","(to) the dead","and We record","what","they have sent before","and their footprints","and every","thing","We have enumerated it","in","a Register","clear","(12)"],"transliterationArr":["innā","naḥnu","nuḥ'yī","al-mawtā","wanaktubu","mā","qaddamū","waāthārahum","wakulla","shayin","aḥṣaynāhu","fī","imāmin","mubīnin",null],"verseTiming":[[1,0,1470],[2,1470,2030],[3,2030,2670],[4,2670,3710],[5,3710,4760],[6,4760,5060],[7,5060,6200],[8,6200,7800],[9,7800,9000],[10,9000,9950],[11,9950,11320],[12,11320,12890],[13,12890,13750],[14,13750,17255]]}}