{"name":"36:38","price":"اور سورج کے لئے جو مقرره راه ہے وه اسی پر چلتا رہتا ہے(1) ۔ یہ ہے مقرر کرده غالب، باعلم اللہ تعالیٰ کا.","arabic":"وَٱلشَّمۡسُ تَجۡرِي لِمُسۡتَقَرّٖ لَّهَاۚ ذَٰلِكَ تَقۡدِيرُ ٱلۡعَزِيزِ ٱلۡعَلِيمِ","category":["36 (Ya-Sin)","Ya-Sin","Surah Ya-Sin","Chapter Ya-Sin","Sin","Surah Sin","Chapter Sin","Ya Sin","Surah Ya Sin","Chapter Ya Sin","Surah 36","Chapter 36","Ya-Sin","يس"],"ayahNumber":3743,"juzNumber":23,"footnotes":"(1) یعنی اپنے اس مدار (فلک) پر چلتا رہتاہے، جو اللہ نے اس کے لئے مقرر کر دیا ہے، اسی سے اپنی سیر کا آغاز کرتا ہے اور وہیں پر ختم کرتا ہے۔ علاوہ ازیں اس سے ذرا ادھر ادھر نہیں ہوتا، کہ کسی دوسرے سیارے سے ٹکرا جائے۔ دوسرے معنی ہیں (اپنے ٹھہرنے کی جگہ تک) اور اس کا یہ مقام قرار عرش کے نیچے ہے، جیسا کہ حدیث میں ہے جو صفحہ 916 (سورۃ الحج، آیت 18 کا حاشیہ) پر گزر چکی ہے کہ سورج روزانہ غروب کے بعد عرش کے نیچے جا کر سجدہ کرتا ہے اور پھر وہاں سے طلوع ہونے کی اجازت طلب کرتا ہے (صحیح بخاری، تفسیر سورۂ یسں) دونوں مفہوم کے اعتبار سے لِمُسْتقَرٍّ میں لام، علت کے لئے ہے۔ أي: لأجل مُسْتقَرٍّ لَّهَا بعض کہتے ہیں کہ لام، الٰی کے معنی میں ہے، پھر مستقر یوم قیامت ہوگا۔ یعنی سورج کا یہ چلنا قیامت کے دن تک ہے، قیامت والے دن اس کی حرکت ختم ہو جائے گی۔ یہ تینوں مفہوم اپنی اپنی جگہ صحیح ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wal-shamsu tajrī limus'taqarrin lahā dhālika taqdīru al-ʿazīzi al-ʿalīmi ","translations":["And the sun","runs","to a term appointed","for it","That","(is the) Decree","(of) the All-Mighty","the All-Knowing","(38)"],"transliterationArr":["wal-shamsu","tajrī","limus'taqarrin","lahā","dhālika","taqdīru","al-ʿazīzi","al-ʿalīmi",null],"verseTiming":[[1,0,1050],[2,1050,1830],[3,1830,3310],[4,3310,4230],[5,4230,4380],[6,4380,5460],[7,5460,6340],[8,6340,7560],[9,7560,10835]]}}