{"name":"36:69","price":"نہ تو ہم نے اس پیغمبر کو شعر سکھائے اور نہ یہ اس کے ﻻئق ہے۔ وه تو صرف نصیحت اور واضح قرآن ہے.(1)","arabic":"وَمَا عَلَّمۡنَٰهُ ٱلشِّعۡرَ وَمَا يَنۢبَغِي لَهُۥٓۚ إِنۡ هُوَ إِلَّا ذِكۡرٞ وَقُرۡءَانٞ مُّبِينٞ","category":["36 (Ya-Sin)","Ya-Sin","Surah Ya-Sin","Chapter Ya-Sin","Sin","Surah Sin","Chapter Sin","Ya Sin","Surah Ya Sin","Chapter Ya Sin","Surah 36","Chapter 36","Ya-Sin","يس"],"ayahNumber":3774,"juzNumber":23,"footnotes":"(1) مشرکین مکہ نبی (صلى الله عليه وسلم) کی تکذیب کے لئے مختلف قسم کی باتیں کہتے رہتے تھے، ان میں ایک بات یہ بھی تھی کہ آپ شاعر ہیں اور یہ قرآن پاک آپ کی شاعرانہ تک بندی ہی ہے۔ اللہ تعالیٰ نے اس کی نفی فرمائی۔ کہ آپ شاعر ہیں اور نہ قرآن شعری کلام کا مجموعہ ہے بلکہ یہ تو صرف نصیحت اور موعظت ہے۔ شاعری میں بالعموم مبالغہ، افراط وتفریط اور محض تخیلات کی ندرت کاری ہوتی ہے، یوں گویا اس کی بنیاد جھوٹ پر ہوتی ہے۔ علاوہ ازیں شاعر محض گفتار کے غازی ہوتے ہیں، کردار کے نہیں۔ اس لئے اللہ تعالیٰ نے فرمایا کہ ہم نے نہ صرف یہ کہ اپنے پیغمبر کو شعر نہیں سکھلائے، نہ اشعار کی اس پر وحی کی، بلکہ اس کے مزاج وطبیعت کو ایسا بنایا کہ شعر سے اس کو کوئی مناسبت ہی نہیں ہے۔ یہی وجہ ہے کہ آپ (صلى الله عليه وسلم) کبھی کسی کا شعر پڑھتے تو اکثر صحیح نہ پڑھ پاتے اور اس کا وزن ٹوٹ جاتا۔ جس کی مثالیں احادیث میں موجود ہیں۔ یہ احتیاط اس لئے کی گئی کہ منکرین پر اتمام حجت اور ان کے شبہات کا خاتمہ کر دیا جائے۔ اور وہ یہ نہ کہہ سکیں کہ یہ قرآن اس کی شاعرانہ تک بندی کا نتیجہ ہے، جس طرح آپ کی امیت بھی قطع شبہات کے لئے تھی تاکہ لوگ قرآن کی بابت یہ نہ کہہ سکیں کہ یہ تو اس نےفلاں سے سیکھ پڑھ کر اس کو مرتب کر لیا ہے۔ البتہ بعض مواقع پر آپ کی زبان مبارک سے ایسے الفاظ کا نکل جانا، جو دو مصرعوں کی طرح ہوتے اور شعری اوزان وبحور کے بھی مطابق ہوتے، آپ کے شاعر ہونے کی دلیل نہیں بن سکتے۔ کیونکہ ایسا آپ کے قصد وارادہ کے بغیر ہوا اور ان کا شعری قالب میں ڈھل جانا ایک اتفاق تھا، جس طرح حنین والے دن آپ کی زبان پر بے اختیار یہ رجز جاری ہوگیا:\nأَنَا النَّبِيَّ لا كَذِبْ\nأَنَا ابْنُ عَبْدِ الْمُطَّلِب\nایک اور موقع پر آپ (صلى الله عليه وسلم) کی انگلی زخمی ہوگئی تو آپ (صلى الله عليه وسلم) نے فرمایا: هَلْ أَنْتِ إِلا إِصْبَعٌ دَمِيتِ\nوَفِي سَبِيلِ اللهِ مَا لَقِيتِ (صحيح بخاري ومسلم ، كتاب الجهاد)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wamā ʿallamnāhu al-shiʿ'ra wamā yanbaghī lahu in huwa illā dhik'run waqur'ānun mubīnun ","translations":["And not","We taught him","[the] poetry","and not","it is befitting","for him","Not","it","(is) except","a Reminder","and a Quran","clear","(69)"],"transliterationArr":["wamā","ʿallamnāhu","al-shiʿ'ra","wamā","yanbaghī","lahu","in","huwa","illā","dhik'run","waqur'ānun","mubīnun",null],"verseTiming":[[1,0,680],[2,680,2140],[3,2140,3060],[4,3060,3620],[5,3620,5350],[6,5350,6390],[7,6390,6850],[8,6850,7060],[9,7060,7950],[10,7950,9540],[11,9540,11030],[12,11030,14775]]}}