{"name":"36:65","price":"ہم آج کے دن ان کے منھ پر مہریں لگا دیں گے اور ان کے ہاتھ ہم سے باتیں کریں گے اور ان کے پاؤں گواہیاں دیں گے، ان کاموں کی جو وه کرتے(1) تھے.","arabic":"ٱلۡيَوۡمَ نَخۡتِمُ عَلَىٰٓ أَفۡوَٰهِهِمۡ وَتُكَلِّمُنَآ أَيۡدِيهِمۡ وَتَشۡهَدُ أَرۡجُلُهُم بِمَا كَانُواْ يَكۡسِبُونَ","category":["36 (Ya-Sin)","Ya-Sin","Surah Ya-Sin","Chapter Ya-Sin","Sin","Surah Sin","Chapter Sin","Ya Sin","Surah Ya Sin","Chapter Ya Sin","Surah 36","Chapter 36","Ya-Sin","يس"],"ayahNumber":3770,"juzNumber":23,"footnotes":"(1) یہ مہر لگانے کی ضرورت اس لئے پیش آئے گی کہ ابتداﺀً مشرکین قیامت والے دن بھی جھوٹ بولیں گے اور کہیں گے «وَاللَّهِ رَبِّنَا مَا كُنَّا مُشْرِكِينَ» (الأنعام: 23) ”اللہ کی قسم، جو ہمارا رب ہے، ہم مشرک نہیں تھے“۔ چنانچہ اللہ تعالیٰ ان کے مونہوں پر مہر لگا دے گا، جس سے وہ خود توبولنے کی طاقت سے محروم ہو جائیں گے، البتہ اللہ تعالیٰ اعضائے انسانی کو قوت گویائی عطا فرمائے گا، ہاتھ بولیں گے کہ ہم سے اس نے فلاں فلاں کام کیا تھا اور پاؤں اس پر گواہی دیں گے۔ یوں گویا اقرار اور شہادت، دونوں مرحلے طے ہو جائیں گے۔ علاوہ ازیں ناطق کے مقابلے میں غیر ناطق چیزوں کا بول کر گواہی دینا، حجت واستدلال میں زیادہ بلیغ ہے کہ اس میں ایک اعجازی شان پائی جاتی ہے۔ (فتح القدیر) اس مضمون کو احادیث میں بھی بیان کیا گیا ہے۔ (ملاحظہ ہو صحیح مسلم، کتاب الزھد)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"al-yawma nakhtimu ʿalā afwāhihim watukallimunā aydīhim watashhadu arjuluhum bimā kānū yaksibūna ","translations":["This Day","We will seal","[on]","their mouths","and will speak to Us","their hands","and will bear witness","their feet","about what","they used to","earn","(65)"],"transliterationArr":["al-yawma","nakhtimu","ʿalā","afwāhihim","watukallimunā","aydīhim","watashhadu","arjuluhum","bimā","kānū","yaksibūna",null],"verseTiming":[[1,0,1210],[2,1210,1960],[3,1960,4260],[4,4260,5750],[5,5750,8699],[6,8699,9949],[7,9949,11029],[8,11029,12839],[9,12839,13359],[10,13359,14229],[11,14229,17094]]}}