{"name":"37:142","price":"تو پھر انہیں مچھلی نے نگل لیا اور وه خود اپنے آپ کو ملامت(1) کرنے لگ گئے.","arabic":"فَٱلۡتَقَمَهُ ٱلۡحُوتُ وَهُوَ مُلِيمٞ","category":["37 (As-Saffat)","As-Saffat","Surah As-Saffat","Chapter As-Saffat","Saffat","Surah Saffat","Chapter Saffat","As Saffat","Surah As Saffat","Chapter As Saffat","Surah 37","Chapter 37","Those Who Set The Ranks","الصَّافَات"],"ayahNumber":3930,"juzNumber":23,"footnotes":"(1) حضرت یونس (عليه السلام) عراق کے علاقے نینوی (موجودہ موصل) میں نبی بنا کر بھیجے گئے تھے، یہ آشوریوں کا پایۂ تخت تھا، انہوں نے ایک لاکھ بنو اسرائیلیوں کو قیدی بنایا ہوا تھا، چنانچہ ان کی ہدایت ورہنمائی کے لئے اللہ تعالیٰ نے ان کی طرف حضرت یونس (عليه السلام) کو بھیجا، لیکن یہ قوم آپ پر ایمان نہیں لائی۔ بالآخر اپنی قوم کو ڈرایا کہ عنقریب تم عذاب الٰہی کی گرفت میں آجاؤ گے۔ عذاب میں تاخیر ہوئی تو اللہ کی اجازت کے بغیر ہی اپنے طور پر وہاں سے نکل گئے اور سمندر پر جا کر ایک کشتی میں سوار ہوگئے۔ اپنے علاقے سے نکل کر جانے کو ایسے لفظ سے تعبیر کیا جس طرح ایک غلام اپنے آقا سے بھاگ کر چلا جاتا ہے۔ کیونکہ آپ بھی اللہ کی اجازت کے بغیر ہی اپنی قوم کو چھوڑ کر چلے گئے تھے۔ کشتی سواروں اور سامانوں سے بھری ہوئی تھی۔ کشتی سمندر کی موجوں میں گھر گئی اور کھڑی ہوگئی۔ چنانچہ اس کا وزن کم کرنے کے لئے ایک آدھ آدمی کو کشتی سے سمندر میں پھینکنے کی تجویزسامنے آئی تاکہ کشتی میں سوار دیگر انسانوں کی جانیں بچ جائیں۔ لیکن یہ قربانی دینے کے لئے کوئی تیار نہیں تھا۔ اس لئے قرعہ اندازی کرنی پڑی، جس میں حضرت یونس (عليه السلام) کا نام آیا۔ اور وہ مغلوبین میں سے ہو گئے، یعنی طوعاً وکرھاً اپنے کو بھاگے ہوئے غلام کی طرح سمندر کی موجوں کے سپرد کرنا پڑا۔ ادھر اللہ تعالیٰ نے مچھلی کو حکم دیا کہ وہ انہیں ثابت نگل لے اور یوں حضرت یونس (عليه السلام) اللہ کے حکم سے مچھلی کے پیٹ میں چلے گئے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"fal-taqamahu al-ḥūtu wahuwa mulīmun ","translations":["Then swallowed him","the fish","while he","(was) blameworthy","(142)"],"transliterationArr":["fal-taqamahu","al-ḥūtu","wahuwa","mulīmun",null],"verseTiming":[[1,0,1280],[2,1280,2210],[3,2210,2750],[4,2750,5555]]}}