{"name":"37:158","price":"اور ان لوگوں نے تو اللہ کے اور جنات کے درمیان بھی قرابت داری ٹھہرائی(1) ہے، اور حاﻻنکہ خود جنات کو معلوم ہے کہ وه (اس عقیده کے لوگ عذاب کے سامنے) پیش کیے جائیں گے.(2)","arabic":"وَجَعَلُواْ بَيۡنَهُۥ وَبَيۡنَ ٱلۡجِنَّةِ نَسَبٗاۚ وَلَقَدۡ عَلِمَتِ ٱلۡجِنَّةُ إِنَّهُمۡ لَمُحۡضَرُونَ","category":["37 (As-Saffat)","As-Saffat","Surah As-Saffat","Chapter As-Saffat","Saffat","Surah Saffat","Chapter Saffat","As Saffat","Surah As Saffat","Chapter As Saffat","Surah 37","Chapter 37","Those Who Set The Ranks","الصَّافَات"],"ayahNumber":3946,"juzNumber":23,"footnotes":"(1) یہ اشارہ ہے مشرکین کے اس عقیدے کی طرف کہ اللہ نےجنات کے ساتھ رشتہ ازدواج قائم کیا، جس سے لڑکیاں پیدا ہوئیں۔ یہی بنات اللہ، فرشتے ہیں۔ یوں اللہ تعالیٰ اور جنوں کے درمیان قرابت داری (سسرالی رشتہ) قائم ہوگیا۔\n(2) حالانکہ یہ بات کیوں کر صحیح ہو سکتی ہے؟ اگر ایسا ہوتا تو اللہ تعالیٰ جنات کو عذاب میں کیوں ڈالتا؟ کیا وہ اپنی قرابت داری کا لحاظ نہ کرتا؟ اور اگر ایسا نہیں ہے بلکہ خود جنات بھی جانتے ہیں کہ انہیں عقاب وعذاب الٰہی بھگتنے کے لئے ضرور جہنم میں جانا ہوگا، تو پھر اللہ اور جنوں کے درمیان قرابت داری کس طرح ہو سکتی ہے؟","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wajaʿalū baynahu wabayna al-jinati nasaban walaqad ʿalimati al-jinatu innahum lamuḥ'ḍarūna ","translations":["And they have made","between Him","and between","the jinn","a relationship","but certainly","know","the jinn","that they","(will) surely be brought","(158)"],"transliterationArr":["wajaʿalū","baynahu","wabayna","al-jinati","nasaban","walaqad","ʿalimati","al-jinatu","innahum","lamuḥ'ḍarūna",null],"verseTiming":[[1,0,1090],[2,1090,2150],[3,2150,2830],[4,2830,4780],[5,4780,5680],[6,5680,6840],[7,6840,7730],[8,7730,9230],[9,9230,10630],[10,10630,14175]]}}