{"name":"37:113","price":"اور ہم نے ابراہیم واسحاق (علیہ السلام) پر برکتیں نازل فرمائیں(1) ، اور ان دونوں کی اوﻻد میں بعضے تو نیک بخت ہیں اور بعض اپنے نفس پر صریح ﻇلم کرنے والے ہیں.(2)","arabic":"وَبَٰرَكۡنَا عَلَيۡهِ وَعَلَىٰٓ إِسۡحَٰقَۚ وَمِن ذُرِّيَّتِهِمَا مُحۡسِنٞ وَظَالِمٞ لِّنَفۡسِهِۦ مُبِينٞ","category":["37 (As-Saffat)","As-Saffat","Surah As-Saffat","Chapter As-Saffat","Saffat","Surah Saffat","Chapter Saffat","As Saffat","Surah As Saffat","Chapter As Saffat","Surah 37","Chapter 37","Those Who Set The Ranks","الصَّافَات"],"ayahNumber":3901,"juzNumber":23,"footnotes":"(1) یعنی ان دونوں کی اولاد کو بہت پھیلایا اور انبیا ورسل کی زیادہ تعداد انہی کی نسل سے ہوئی۔ حضرت اسحاق (عليه السلام) کے بیٹے یعقوب (عليه السلام) ہوئے، جن کے بارہ بیٹوں سے بنی اسرائیل کے 12 قبیلے بنے اور ان سے بنی اسرائیل کی قوم بڑھی اور پھیلی اور اکثر انبیا ان ہی میں سے ہوئے۔ حضرت ابراہیم (عليه السلام) کے دوسرے بیٹے اسماعیل (عليه السلام) سے عربوں کی نسل چلی اور ان میں آخری پیغمبر حضرت محمد رسول اللہ (صلى الله عليه وسلم) ہوئے۔\n(2) شرک ومعصیت اور ظلم وفساد کا ارتکاب کرکے۔ خاندان ابراہیمی میں برکت کے باوجود نیک وبد کے ذکر سے اس طرف اشارہ کر دیا کہ خاندان اور آبا کی نسبت، اللہ کے ہاں کوئی حیثیت نہیں رکھتی۔ وہاں تو ایمان اور عمل صالح کی اہمیت ہے۔ یہود ونصاریٰ اگرچہ حضرت اسحاق (عليه السلام) کی اولاد سے ہیں۔ اسی طرح مشرکین عرب حضرت اسماعیل (عليه السلام) کی اولاد سے ہیں۔ لیکن ان کے جو اعمال ہیں وہ کھلی گمراہی یا شرک ومعصیت پر مبنی ہیں۔ اس لئے یہ اونچی نسبتیں ان کے لئے عمل کا بدل نہیں ہو سکتیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wabāraknā ʿalayhi waʿalā is'ḥāqa wamin dhurriyyatihimā muḥ'sinun waẓālimun linafsihi mubīnun ","translations":["And We blessed","him","and [on]","Isaac","And of","their offspring","(are) good-doers","and unjust","to himself","clear","(113)"],"transliterationArr":["wabāraknā","ʿalayhi","waʿalā","is'ḥāqa","wamin","dhurriyyatihimā","muḥ'sinun","waẓālimun","linafsihi","mubīnun",null],"verseTiming":[[1,0,1500],[2,1500,2360],[3,2360,4590],[4,4590,8340],[5,8340,9820],[6,9820,11670],[7,11670,12520],[8,12520,14390],[9,14390,15910],[10,15910,19015]]}}