{"name":"37:89","price":"اور کہا میں تو بیمار ہوں.(1)","arabic":"فَقَالَ إِنِّي سَقِيمٞ","category":["37 (As-Saffat)","As-Saffat","Surah As-Saffat","Chapter As-Saffat","Saffat","Surah Saffat","Chapter Saffat","As Saffat","Surah As Saffat","Chapter As Saffat","Surah 37","Chapter 37","Those Who Set The Ranks","الصَّافَات"],"ayahNumber":3877,"juzNumber":23,"footnotes":"(1) آسمان پر غور وفکر کے لئے دیکھا جیسا کہ بعض لوگ ایسا کرتے ہیں۔ یا اپنی قوم کے لوگوں کو مغالطے میں ڈالنے کے لئے ایسا کیا، جو کہ ستاروں کی گردش کو حوادث زمانہ میں موثر مانتے تھے۔ یہ واقعہ اس وقت کا ہے کہ جب ان کی قوم کا وہ دن آیا، جسے وہ باہر جا کر بطور عید اور قومی تہوار منایا کرتی تھی۔ قوم نے حضرت ابراہیم (عليه السلام) کو بھی ساتھ چلنے کی دعوت دی۔ لیکن ابراہیم (عليه السلام) تنہائی اور موقعے کی تلاش میں تھے، تاکہ ان کے بتوں کا تیاپانچہ کیا جا سکے۔ چنانچہ انہوں نے یہ موقع غنیمت جانا کہ کل ساری قوم باہر میلے میں چلی جائے گی تو میں اپنا منصوبہ بروئے کار لے آؤں گا۔ اور کہہ دیا کہ میں بیمار ہوں یا آسمانوں کی گردش بتلاتی ہے کہ میں بیمار ہونے والا ہوں۔ یہ بات بالکل جھوٹی تو نہیں تھی، ہر انسان کچھ نہ کچھ بیمار ہوتا ہی ہے، علاوہ ازیں قوم کا شرک حضرت ابراہیم (عليه السلام) کے دل کا ایک مستقل روگ تھا، جسے دیکھ کر وہ کڑھتے رہتے تھے۔ یوں حضرت ابراہیم (عليه السلام) نے تعریض اور توریے کا اظہار فرمایا جو اگرچہ جھوٹ نہیں ہوتا لیکن مخاطب اس کے متبادر مفہوم سے مغالطے کا شکار ہو جاتا ہے۔ اس لئے حدیث ثلاث کذبات میں اسے جھوٹ سے تعبیر کیا گیا ہے، جیسا کہ اس کی ضروری تفصیل سورۂ انبیاء: 63 میں گزر چکی ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"faqāla innī saqīmun ","translations":["And he said","Indeed, I am","sick","(89)"],"transliterationArr":["faqāla","innī","saqīmun",null],"verseTiming":[[1,0,820],[2,820,2280],[3,2280,5455]]}}