{"name":"38:25","price":"پس ہم نے بھی ان کا وه (قصور) معاف کر دیا(1) ، یقیناً وه ہمارے نزدیک بڑے مرتبہ والے اور بہت اچھے ٹھکانے والے ہیں.","arabic":"فَغَفَرۡنَا لَهُۥ ذَٰلِكَۖ وَإِنَّ لَهُۥ عِندَنَا لَزُلۡفَىٰ وَحُسۡنَ مَـَٔابٖ","category":["38 (Sad)","Sad","Surah Sad","Chapter Sad","Surah 38","Chapter 38","Saad","ص"],"ayahNumber":3995,"juzNumber":23,"footnotes":"(1) حضرت داود (عليه السلام) کا یہ کام کیا تھا جس پر انہیں کوتاہی کا اور توبہ وندامت کا اظہار کا احساس ہوا، اور اللہ نے اسے معاف فرما دیا۔ قرآن کریم میں اس اجمال کی تفصیل نہیں ہے اور کسی مستند حدیث میں بھی اس کی بابت کوئی وضاحت نہیں ہے۔ اس لئے بعض مفسرین نے تو اسرائیلی روایات کو بنیاد بنا کر ایسی باتیں بھی لکھ دی ہیں، جو ایک نبی کی شان سے فروتر ہیں۔ بعض مفسرین مثلاً ابن کثیر نے یہ موقف اختیار کیا کہ جب قرآن وحدیث اس معاملے میں خاموش ہیں تو ہمیں بھی اس کی تفصیلات کی کرید میں پڑنے کی ضرورت نہیں ہے۔ مفسرین کا ایک تیسرا گروہ ہےجو اس واقعے کی بعض جزئیات اور تفصیلات بیان کرتا ہے تاکہ قرآن کے اجمال کی کچھ توضیح ہو جائے۔ تاہم یہ کسی ایک بیان پر متفق نہیں ہیں۔ بعض کہتے ہیں کہ حضرت داود (عليه السلام) نے ایک فوجی کو حکم دیا تھا کہ وہ اپنی بیوی کو طلاق دے دے اور یہ اس زمانے کے عرف میں معیوب بات نہیں تھی۔ حضرت داود (عليه السلام) کو اس عورت کی خوبیوں اور کمالات کا علم ہوا تھا جس بنا پر ان کے اندر یہ خواہش پیدا ہوئی کہ اس عورت کو تو ملکہ ہونا چاہئیے نہ کہ ایک عام سی عورت۔ تاکہ اس کی خوبیوں اور کمالات سے پورا ملک فیض یاب ہو۔ یہ خواہش کتنے بھی اچھے جذبے کی بنیاد پر ہو، لیکن ایک تو متعدد بیویوں کی موجودگی میں یہ نامناسب سی بات لگتی ہے۔ دوسرے بادشاہ وقت کی طرف سے اس کے اظہار میں جبر کا پہلو بھی شامل ہو جاتا ہے۔ اس لئے حضرت داود (عليه السلام) کو ایک تمثیلی واقعے سے اس کے نامناسب ہونے کا احساس دلایا گیا اور انہیں فی الواقع اس پر تنبہ ہوگیا۔ بعض کہتے ہیں کہ آنے والے یہ دو شخص فرشتے تھے جو ایک فرضی مقدمہ لے کر حاضر ہوئے، حضرت داود (عليه السلام) سے کوتاہی یہ ہوئی کہ مدعی کا بیان سن کر ہی اپنی رائے کا اظہار کر دیا اور مدعا علیہ کی بات سننے کی ضرورت ہی محسوس نہیں کی۔ اللہ تعالیٰ نے رفع درجات کے لئے اس آزمائش میں انہیں ڈالا، اس غلطی کا احساس ہوتے ہی وہ سمجھ گئے کہ یہ آزمائش تھی جو اللہ کی طرف سے ان پر آئی اور بارگاہ الٰہی میں جھک گئے۔ بعض کہتے ہیں کہ آنے والے فرشتے نہیں تھے، انسان ہی تھے اور یہ فرضی واقعہ نہیں، ایک حقیقی جھگڑا تھا، جس کے فیصلے کے لئے وہ آئے تھے اور اس طرح ان کے صبر وتحمل کا امتحان لیا گیا، کیونکہ اس واقعے میں ناگواری اور اشتعال طبع کے کئی پہلو تھے، ایک تو بلا اجازت دیوار پھاند کر آنا۔ دوسرے، عبادت کے مخصوص اوقات میں آکر مخل ہونا۔ تیسرے، ان کا طرز تکلﻢ بھی آپ کی حاکمانہ شان سے فروتر تھا (کہ زیادتی نہ کرنا وغیرہ) لیکن اللہ نے آپ کو توفیق دی کہ مشتعل نہیں ہوئے اور کمال صبر وتحمل کا مظاہرہ کیا۔ لیکن دل میں جو طبعی ناگواری کا ہلکا سا احساس پیدا ہوا، اس کو بھی اپنی کوتاہی پر محمول کیا، یعنی یہ اللہ کی طرف سے آزمائش تھی، اس لئے یہ طبعی انقباض بھی نہیں ہونا چاہئے تھا، جس پر انہوں نے توبہ واستغفار کا اہتمام کیا۔ وَاللهُ أَعْلَمُ بِالصَّوَابِ۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"faghafarnā lahu dhālika wa-inna lahu ʿindanā lazul'fā waḥus'na maābin ","translations":["So We forgave","for him","that","And indeed","for him","with Us","surely is a near access","and a good","place of return","(25)"],"transliterationArr":["faghafarnā","lahu","dhālika","wa-inna","lahu","ʿindanā","lazul'fā","waḥus'na","maābin",null],"verseTiming":[[1,0,1310],[2,1310,1850],[3,1850,3230],[4,3230,4440],[5,4440,5050],[6,5050,6950],[7,6950,7940],[8,7940,8820],[9,8820,11005]]}}