{"name":"38:33","price":"ان (گھوڑوں) کو دوباره میرے سامنے ﻻؤ! پھر تو پنڈلیوں اور گردنوں پر ہاتھ پھیرنا شروع کر دیا.(1)","arabic":"رُدُّوهَا عَلَيَّۖ فَطَفِقَ مَسۡحَۢا بِٱلسُّوقِ وَٱلۡأَعۡنَاقِ","category":["38 (Sad)","Sad","Surah Sad","Chapter Sad","Surah 38","Chapter 38","Saad","ص"],"ayahNumber":4003,"juzNumber":23,"footnotes":"(1) اس ترجمے کی رو سے أَحْبَبْتُ، بمعنی آثَرْتُ (ترجیح دینا) اور عَنْ بمعنی عَلَى ہے۔ اور تَوَارَتْ کا مرجع شَمْسٌ ہے جو آیت میں پہلے مذکور نہیں ہے، لیکن قرینہ اس پر دال ہے۔ اس تفسیر کی رو سے اگلی آیت میں۔ مَسْحًا بِالسُّوقِ وَالأَعْنَاقِ کا ترجمہ بھی ذبح کرنا ہوگا یعنی مَسْحًا بِالسَّيْف ِ کا مفہوم۔ مطلب ہوگا کہ گھوڑوں کے معاینہ میں حضرت سلیمان (عليه السلام) کی عصر کی نماز یا وظیفہ خاص رہ گیا جو اس وقت وہ کرتے تھے۔ جس پر انہیں سخت صدمہ ہوا اور کہنے لگے کہ میں گھوڑوں کی محبت میں اتنا وارفتہ اور گم ہو گیا کہ سورج پردۂ مغرب میں چھپ گیا اور اللہ کی یاد، نماز یا وظیفے سے غافل رہا۔ چنانچہ اس کی تلافی اور ازالے کے لئے انہوں نےسارےگھوڑے اللہ کی راہ میں قتل کر ڈالے۔ امام شوکانی اور ابن کثیر وغیرہ نے اس تفسیر کو ترجیح دی ہے۔ دیگر بعض مفسرین نے اس کی دوسری تفسیر کی ہے۔ اس کی رو سے عَنْ، أَجْلٌ کے معنی میں ہے أَيْ : لأَجْلِ ذِكْرِ رَبِّي، یعنی رب کی یاد کی وجہ سے میں ان گھوڑوں سے محبت رکھتا ہوں۔ یعنی اس کے ذریعے سے اللہ کی راہ میں جہاد ہوتا ہے۔ پھر ان گھوڑوں کو دوڑایا حتیٰ کہ وہ نظروں سے اوجھل ہوگئے۔ انہیں دوبارہ طلب کیا اور پیار ومحبت سے ان کی پندلیوں اور گردنوں پر ہاتھ پھیرنا شروع کر دیا خَيْرٌ، قرآن میں مال کے معنی میں استعمال ہوا ہے۔ یہاں یہ لفظ گھوڑو ں کے لئے آیا ہے۔ تَوَارَتْ کا مرجع گھوڑے ہیں۔ امام ابن جریر طبری نے اس دوسری تفسیر کو ترجیح دی ہے اور یہی تفسیر متعدد وجوہ سےصحیح لگتی ہے۔ واللهُ أَعْلَمُ۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"ruddūhā ʿalayya faṭafiqa masḥan bil-sūqi wal-aʿnāqi ","translations":["Return them","to me","Then he began","(to) pass (his hand)","over the legs","and the necks","(33)"],"transliterationArr":["ruddūhā","ʿalayya","faṭafiqa","masḥan","bil-sūqi","wal-aʿnāqi",null],"verseTiming":[[1,0,1260],[2,1260,2030],[3,2030,3450],[4,3450,5060],[5,5060,6160],[6,6160,9525]]}}