{"name":"38:34","price":"اور ہم نے سلیمان (علیہ السلام) کی آزمائش کی اور ان کے تخت پر ایک جسم ڈال دیا پھر(1) اس نے رجوع کیا.","arabic":"وَلَقَدۡ فَتَنَّا سُلَيۡمَٰنَ وَأَلۡقَيۡنَا عَلَىٰ كُرۡسِيِّهِۦ جَسَدٗا ثُمَّ أَنَابَ","category":["38 (Sad)","Sad","Surah Sad","Chapter Sad","Surah 38","Chapter 38","Saad","ص"],"ayahNumber":4004,"juzNumber":23,"footnotes":"(1) یہ آزمائش کیا تھی، کرسی پر ڈالا گیا جسم کس چیز کا تھا؟ اور اس کا مطلب کیا ہے؟ اس کی بھی کوئی تفصیل قرآن کریم یا حدیث میں نہیں ملتی۔ البتہ بعض مفسرین نے صحیح حدیث سے ثابت ایک واقعے کو اس پر چسپاں کیا ہے اور وہ یہ ہے کہ حضرت سلیمان (عليه السلام) نے ایک مرتبہ کہا کہ میں آج کی رات اپنی تمام بیویوں سے (جن کی تعداد 70 یا 90 تھی) ہمبستری کروں گا تاکہ ان سے شاہ سوار پیدا ہوں جو اللہ کی راہ میں جہاد کریں۔ اور اس پر ان شاء اللہ نہیں کہا (یعنی صرف اپنی ہی تدبیر پر سارا اعتماد کیا) نتیجہ یہ ہوا کہ سوائے ایک بیوی کے کوئی بیوی حاملہ نہیں ہوئی۔ اور حاملہ بیوی نے بھی جو بچہ جنا، وہ ناقص یعنی آدھا تھا۔ نبی (صلى الله عليه وسلم) نے فرمایا اگر سلیمان (عليه السلام) ان شاء اللہ کہہ لیتے تو سب سے مجاہد پیدا ہوتے۔ (صحيح بخاري ، كتاب الأنبياء ، صحيح مسلم، كتاب الإيمان، باب الاستثناء) ان مفسرین کے خیال میں شاید ان شاء اللہ نہ کہنا یا صرف اپنی تدبیر پر اعتماد کرنا یہی فتنہ ہو، جس میں حضرت سلیمان (عليه السلام) مبتلا ہوئے اور کرسی پر ڈالا جانے والا جسم یہی ناقص الخلقت بچہ ہو۔ واللهُ أَعْلَمُ۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walaqad fatannā sulaymāna wa-alqaynā ʿalā kur'siyyihi jasadan thumma anāba ","translations":["And certainly","We tried","Sulaiman","and We placed","on","his throne","a body","then","he turned","(34)"],"transliterationArr":["walaqad","fatannā","sulaymāna","wa-alqaynā","ʿalā","kur'siyyihi","jasadan","thumma","anāba",null],"verseTiming":[[1,0,860],[2,860,2370],[3,2370,3670],[4,3670,4940],[5,4940,5650],[6,5650,7150],[7,7150,8770],[8,8770,10240],[9,10240,13685]]}}