{"name":"38:41","price":"اور ہمارے بندے ایوب (علیہ السلام) کا (بھی) ذکر کر، جبکہ اس نے اپنے رب کو پکارا کہ مجھے شیطان نے رنج اور دکھ پہنچایا ہے.(1)","arabic":"وَٱذۡكُرۡ عَبۡدَنَآ أَيُّوبَ إِذۡ نَادَىٰ رَبَّهُۥٓ أَنِّي مَسَّنِيَ ٱلشَّيۡطَٰنُ بِنُصۡبٖ وَعَذَابٍ","category":["38 (Sad)","Sad","Surah Sad","Chapter Sad","Surah 38","Chapter 38","Saad","ص"],"ayahNumber":4011,"juzNumber":23,"footnotes":"(1) حضرت ایوب (عليه السلام) کی بیماری اور اس میں ان کا صبر مشہور ہے۔ جس کےمطابق اللہ تعالیٰ نے اہل ومال کی تباہی اور بیماری کے ذریعے سے ان کی آزمائش کی، جس میں وہ کئی سال مبتلا رہے۔ حتیٰ کہ صرف ایک بیوی ان کے ساتھ رہ گئی جو صبح وشام ان کی خدمت بھی کرتی اور ان کو کہیں کام کاﺝ کرکے بقدر کفاف رزق کا انتظام بھی کرتی۔ یہاں پر متعدد تفسیری روایات کا ذکر کیا جاتا ہے، مگر اس میں سے کتنا کچھ صحیح ہے اور کتنا نہیں، اسے معلوم کرنے کا کوئی مستند ذریعہ نہیں۔ نُصْبٍ سے جسمانی تکالیف اور عذاب سے مالی ابتلا مراد ہے۔ اس کی نسبت شیطان کی طرف اس لئے کی گئی ہے دراں حالیکہ سب کچھ کرنے والا صرف اللہ ہی ہے، کہ ممکن ہے شیطان کے وسوسے ہی کسی ایسے عمل کا سبب بنے ہوں جس پر یہ آزمائش آئی یا پھر بطور ادب کے ہے کہ خیر کو اللہ تعالیٰ کی طرف اور شر کو اپنی یا شیطان کی طرف منسوب کیا جاتا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-udh'kur ʿabdanā ayyūba idh nādā rabbahu annī massaniya al-shayṭānu binuṣ'bin waʿadhābin ","translations":["And remember","Our slave","Ayyub","when","he called","his Lord","That [I]","(has) touched me","Shaitaan","with distress","and suffering","(41)"],"transliterationArr":["wa-udh'kur","ʿabdanā","ayyūba","idh","nādā","rabbahu","annī","massaniya","al-shayṭānu","binuṣ'bin","waʿadhābin",null],"verseTiming":[[1,0,840],[2,840,3390],[3,3390,4300],[4,4300,4670],[5,4670,5570],[6,5570,8340],[7,8340,9630],[8,9630,10610],[9,10610,11940],[10,11940,13010],[11,13010,16595]]}}