{"name":"38:86","price":"کہہ دیجئے کہ میں تم سے اس پر کوئی بدلہ طلب نہیں کرتا(1) اور نہ میں تکلف کرنے والوں میں سے ہوں.(2)","arabic":"قُلۡ مَآ أَسۡـَٔلُكُمۡ عَلَيۡهِ مِنۡ أَجۡرٖ وَمَآ أَنَا۠ مِنَ ٱلۡمُتَكَلِّفِينَ","category":["38 (Sad)","Sad","Surah Sad","Chapter Sad","Surah 38","Chapter 38","Saad","ص"],"ayahNumber":4056,"juzNumber":23,"footnotes":"(1) یعنی اس دعوت وتبلیغ سے میرا مقصد صرف امتثال امر الٰہی ہے، دنیا کمانا نہیں۔\n(2) یعنی اپنی طرف سے گھڑ کر اللہ کی طرف ایسی بات منسوب کر دوں جو اس نے نہ کہی ہو یا میں تمہیں ایسی بات کی طرف دعوت دوں جس کا حکم اللہ نے مجھے نہ دیا ہو۔ بلکہ کوئی کمی بیشی کیے بغیر اللہ کے احکام تم تک پہنچا رہا ہوں۔ حضرت عبداللہ ابن مسعود ! فرماتے تھے، جس کو کسی بات کا علم نہ ہو، اس کی بابت اسے کہہ دینا چاہئیے، اللہ اعلم یہ کہنا بھی علم ہی ہے، اس لئے کہ اللہ نے اپنے پیغمبر کو کہا، فرما دیجئے «وَمَا أَنَا مِنَ الْمُتَكَلِّفِينَ» (ابن کثیر) علاوہ ازیں اس سے عام معاملات زندگی میں بھی تکلف وتصنع سے اجتناب کا حکم معلوم ہوتا ہے۔ جیسے نبی (صلى الله عليه وسلم) نے فرمایا «نُهِينَا عَنِ التَّكَلُّفِ» (صحيح بخاري، نمبر 7293) ہمیں تکلف سے منع کیا گیا ہے۔ حضرت سلمان (رضي الله عنه) کہتے ہیں «نَهَانَا رَسُولُ اللهِ (صلى الله عليه وسلم) أَنَّ نَتَكَلَّفَ لِلضَّيْفِ» (صحيح الجامع الصغير 9871) ہمیں رسول اللہ (صلى الله عليه وسلم) نے مہمان کے لئے تکلف کرنے سے منع فرمایا ہے۔ اس سے معلوم ہوا کہ لباس، خوراک، رہائش اور دیگر معاملات میں تکلﻔات، جو آج کل معیار زندگی بلند کرنے کے عنوان سے، اصحاب حیثیت کا شعار اور وطیرہ بن چکا ہے، اسلامی تعلیمات کے خلاف ہے۔ اسلام میں سادگی اور بے تکلﻔی اختیار کرنے کی تلقین وترغیب ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qul mā asalukum ʿalayhi min ajrin wamā anā mina al-mutakalifīna ","translations":["Say","Not","I ask of you","for it","any","payment","and not","I am","of","the ones who pretend","(86)"],"transliterationArr":["qul","mā","asalukum","ʿalayhi","min","ajrin","wamā","anā","mina","al-mutakalifīna",null],"verseTiming":[[1,0,410],[2,410,2170],[3,2170,3390],[4,3390,4290],[5,4290,4660],[6,4660,6150],[7,6150,8200],[8,8200,8650],[9,8650,8960],[10,8960,13125]]}}