{"name":"38:8","price":"کیا ہم سب میں سے اسی پر کلام الٰہی نازل کیا گیا ہے(1) ؟ دراصل یہ لوگ میری وحی کی طرف سے شک میں ہیں(2)، بلکہ (صحیح یہ ہے کہ) انہوں نے اب تک میرا عذاب چکھا ہی نہیں.(3)","arabic":"أَءُنزِلَ عَلَيۡهِ ٱلذِّكۡرُ مِنۢ بَيۡنِنَاۚ بَلۡ هُمۡ فِي شَكّٖ مِّن ذِكۡرِيۚ بَل لَّمَّا يَذُوقُواْ عَذَابِ","category":["38 (Sad)","Sad","Surah Sad","Chapter Sad","Surah 38","Chapter 38","Saad","ص"],"ayahNumber":3978,"juzNumber":23,"footnotes":"(1) یعنی مکے میں بڑے بڑے چودہری اور رئیس ہیں، اگر اللہ کسی کو نبی بنانا ہی چاہتا تو ان میں سے کسی کو بناتا۔ ان سب کو چھوڑ کر وحی ورسالت کے لئے محمد ( (صلى الله عليه وسلم) ) کا انتخاب بھی عجیب ہے؟ یہ گویا انہوں نے اللہ کے انتخاب میں کیڑے نکالے۔ سچ ہےخوئے بدر ابہانہ بسیار۔ دوسرے مقام پر بھی یہ مضمون بیان کیا گیا ہے۔ مثلاً سورۂ زخرف: 32-31۔\n(2) یعنی ان کا انکاراس لئے نہیں ہے کہ انہیں محمد (صلى الله عليه وسلم) کی صداقت کا علم نہیں ہے یا آپ کی سلامت عقل سے انہیں انکار ہے بلکہ یہ اس وحی کے بارے میں ہی ریب وشک میں مبتلا ہیں جو آپ پر نازل ہوئی، جس میں سب سے نمایاں توحید کی دعوت ہے۔\n(3) کیونکہ عذاب کا مزہ چکھ لیتے تو اتنی واضح چیز کی تکذیب نہ کرتے۔ اور جب یہ اس تکذیب کا واقعی مزہ چکھیں گے تو وہ وقت ایسا ہوگا کہ پھر نہ تصدیق کام آئے گی، نہ ایمان ہی فائدہ دے گا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"a-unzila ʿalayhi al-dhik'ru min bayninā bal hum fī shakkin min dhik'rī bal lammā yadhūqū ʿadhābi ","translations":["Has been revealed","to him","the Message","from","among us","Nay","They","(are) in","doubt","about","My Message","Nay","not yet","they have tasted","My punishment","(8)"],"transliterationArr":["a-unzila","ʿalayhi","al-dhik'ru","min","bayninā","bal","hum","fī","shakkin","min","dhik'rī","bal","lammā","yadhūqū","ʿadhābi",null],"verseTiming":[[1,0,2030],[2,2030,2930],[3,2930,3760],[4,3760,4940],[5,4940,5800],[6,5800,6920],[7,6920,7320],[8,7320,7730],[9,7730,8480],[10,8480,9990],[11,9990,11050],[12,11050,11350],[13,11350,12990],[14,12990,14130],[15,14130,16515]]}}