{"name":"39:10","price":"کہہ دو کہ اے میرے ایمان والے بندو! اپنے رب سے ڈرتے رہو(1) ، جو اس دنیا میں نیکی کرتے ہیں ان کے لئے نیک بدلہ ہے(2) اور اللہ تعالیٰ کی زمین بہت کشاده ہے(3) صبر کرنے والوں ہی کو ان کا پورا پورا بےشمار اجر دیا جاتا ہے.(4)","arabic":"قُلۡ يَٰعِبَادِ ٱلَّذِينَ ءَامَنُواْ ٱتَّقُواْ رَبَّكُمۡۚ لِلَّذِينَ أَحۡسَنُواْ فِي هَٰذِهِ ٱلدُّنۡيَا حَسَنَةٞۗ وَأَرۡضُ ٱللَّهِ وَٰسِعَةٌۗ إِنَّمَا يُوَفَّى ٱلصَّٰبِرُونَ أَجۡرَهُم بِغَيۡرِ حِسَابٖ","category":["39 (Az-Zumar)","Az-Zumar","Surah Az-Zumar","Chapter Az-Zumar","Zumar","Surah Zumar","Chapter Zumar","Az Zumar","Surah Az Zumar","Chapter Az Zumar","Surah 39","Chapter 39","The Troops","الزُّمَر"],"ayahNumber":4068,"juzNumber":23,"footnotes":"(1) اس کی اطاعت کرکے، معاصی سے اجتناب کرکے اور عبادت واطاعت کو اس کے لئے خالص کرکے۔\n(2) یہ تقویٰ کے فوائد ہیں۔ نیک بدلے سے مراد جنت اور اس کی ابدی نعمتیں ہیں۔ بعض فِي هَذِهِ الدُّنْيَا کو حَسَنَةٌ سے متعلق مان کر ترجمہ کرتے ہیں جو نیکی کرتے ہیں، ان کے لئے دنیا میں نیک بدلہ ہے یعنی اللہ انہیں دنیا میں صحت وعافیت، کامیابی اور غنیمت وغیرہ عطا فرماتا ہے۔ لیکن پہلا مفہوم ہی زیادہ صحیح ہے۔\n(3) یہ اشارہ ہے اس بات کی طرف کہ اگر اپنے وطن میں ایمان وتقویٰ پر عمل مشکل ہو، تو وہاں رہنا پسندیدہ نہیں، بلکہ وہاں سے ہجرت اختیار کرکے ایسے علاقے میں چلا جانا چاہئیے جہاں انسان احکام الٰہی کے مطابق زندگی گزار سکے اور جہاں ایمان وتقویٰ کی راہ میں رکاوٹ نہ ہو۔\n(4) اسی طرح ایمان وتقویٰ کی راہ میں مشکلات بھی ناگزیر اور شہوات ولذات نفس کی قربانی بھی لابدی ہے، جس کے لئے صبر کی ضرورت ہے۔ اس لئے صابرین کی فضیلت بھی بیان کر دی گئی ہے، کہ ان کو ان کے صبر کے بدلے میں اس طرح پورا پورا اجر دیا جائے گا کہ اسے حساب کے پیمانوں سے ناپنا ممکن ہی نہیں ہوگا۔ یعنی ان کا اجر غیر متناہی ہوگا۔ کیوں کہ جس چیز کا حساب ممکن ہو، اس کی تو ایک حد ہوتی ہے اور جس کی کوئی حد اور انتہا نہ ہو، وہ وہی ہوتی ہے جس کو شمار کرنا ممکن نہ ہو۔ صبر کی یہ وہ عظیم فضیلت ہے جو ہر مسلمان کو حاصل کرنے کی کوشش کرنی چاہئیے۔ اس لئے کہ جزع فزع اور بے صبری سے نازل شدہ مصیبت ٹل نہیں جاتی، جس خیر اور فائدے سے محرومی ہوگئی ہے، وہ حاصل نہیں ہو جاتا اور جو ناگوار صورت حال پیش آچکی ہوتی ہے، اس کا اندفاع ممکن نہیں۔ جب یہ بات ہے تو انسان صبر کرکے وہ اجر عظیم کیوں نہ حاصل کرے جو صابرین کے لئے اللہ تعالیٰ نے رکھا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qul yāʿibādi alladhīna āmanū ittaqū rabbakum lilladhīna aḥsanū fī hādhihi al-dun'yā ḥasanatun wa-arḍu al-lahi wāsiʿatun innamā yuwaffā al-ṣābirūna ajrahum bighayri ḥisābin ","translations":["Say","O My slaves","[those] who","believe","Fear","your Lord","For those who","do good","in","this","world","(is) good","and the earth","(of) Allah","(is) spacious","Only","will be paid back in full","the patient ones","their reward","without","account","(10)"],"transliterationArr":["qul","yāʿibādi","alladhīna","āmanū","ittaqū","rabbakum","lilladhīna","aḥsanū","fī","hādhihi","al-dun'yā","ḥasanatun","wa-arḍu","al-lahi","wāsiʿatun","innamā","yuwaffā","al-ṣābirūna","ajrahum","bighayri","ḥisābin",null],"verseTiming":[[1,0,470],[2,470,1750],[3,1750,2770],[4,2770,3630],[5,3630,4530],[6,4530,5960],[7,5960,7130],[8,7130,8180],[9,8180,8650],[10,8650,9500],[11,9500,10430],[12,10430,11750],[13,11750,12740],[14,12740,13380],[15,13380,14860],[16,14860,16690],[17,16690,17580],[18,17580,19090],[19,19090,20660],[20,20660,21540],[21,21540,23925]]}}