{"name":"39:21","price":"کیا آپ نے نہیں دیکھا کہ اللہ تعالیٰ آسمان سے پانی اتارتا ہے اور اسے زمین کی سوتوں میں پہنچاتا(1) ہے، پھر اسی کے ذریعہ سے مختلف قسم کی کھیتیاں اگاتا(2) ہے پھر وه خشک ہو جاتی ہیں اور آپ انہیں زرد رنگ دیکھتے ہیں پھر انہیں ریزه ریزه کر دیتا ہے(3)، اس میں عقل مندوں کے لئے بہت زیاده نصیحت ہے.(4)","arabic":"أَلَمۡ تَرَ أَنَّ ٱللَّهَ أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗ فَسَلَكَهُۥ يَنَٰبِيعَ فِي ٱلۡأَرۡضِ ثُمَّ يُخۡرِجُ بِهِۦ زَرۡعٗا مُّخۡتَلِفًا أَلۡوَٰنُهُۥ ثُمَّ يَهِيجُ فَتَرَىٰهُ مُصۡفَرّٗا ثُمَّ يَجۡعَلُهُۥ حُطَٰمًاۚ إِنَّ فِي ذَٰلِكَ لَذِكۡرَىٰ لِأُوْلِي ٱلۡأَلۡبَٰبِ","category":["39 (Az-Zumar)","Az-Zumar","Surah Az-Zumar","Chapter Az-Zumar","Zumar","Surah Zumar","Chapter Zumar","Az Zumar","Surah Az Zumar","Chapter Az Zumar","Surah 39","Chapter 39","The Troops","الزُّمَر"],"ayahNumber":4079,"juzNumber":23,"footnotes":"(1) يَنَابِيعُ يَنْبُوعٌ کی جمع ہے، سوتے، چشمے، یعنی بارش کے ذریعے سےپانی آسمان سےاترتا ہے، پھر وہ زمین میں جذب ہو جاتا ہے اور پھر چشموں کی صورت میں نکلتا ہے یا تالابوں اور نہروں میں جمع ہو جاتا ہے۔\n(2) یعنی اس پانی سے، جو ایک ہوتا ہے، انواع واقسام کی چیزیں پیدا فرماتا ہے، جن کا رنگ، ذائقہ، خوشبو ایک دوسرے سے مختلف ہوتی ہے۔\n(3) یعنی شادابی اور تروتازگی کے بعد وہ کھیتیاں سوکھ جاتی اور زرد ہو جاتی ہیں اور پھر ریزہ ریزہ ہو جاتی ہیں۔ جس طرح لکڑی کی ٹہنیاں خشک ہو کر ٹوٹ پھوٹ کا شکار ہو جاتی ہیں۔\n(4) یعنی اہل دانش اس سے سمجھ لیتے ہیں کہ دنیا کی مثال بھی اسی طرح ہے، وہ بہت جلد زوال وفنا سے ہمکنار ہو جائے گی۔ اس کی رونق وبہجت، اس کی شادابی وزینت اور اس کی لذتیں اور آسائشیں عارضی ہیں، جن سے انسان کو دل نہیں لگانا چاہئیے۔ بلکہ اس موت کی تیاری میں مشغول رہنا چاہئیے جس کے بعد کی زندگی دائمی ہے، جسے زوال نہیں۔ بعض کہتے ہیں کہ یہ قرآن اور اہل ایمان کے سینوں کی مثال ہے اور مطلب ہے کہ اللہ تعالیٰ نے آسمان سے قرآن اتارا، جسے وہ مومنوں کے دلوں میں داخل فرماتا ہے، پھر اس کے ذریعے سے دین باہر نکلتا ہے جو ایک دوسرے سے بہتر ہوتا ہے، پس مومن تو ایمان ویقین میں زیادہ ہو جاتا ہے اور جس کے دل میں روگ ہوتا ہے، وہ اس طرح خشک ہو جاتا ہے جس طرح کھیتی خشک ہو جاتی ہے۔(فتح القدیر)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"alam tara anna al-laha anzala mina al-samāi māan fasalakahu yanābīʿa fī al-arḍi thumma yukh'riju bihi zarʿan mukh'talifan alwānuhu thumma yahīju fatarāhu muṣ'farran thumma yajʿaluhu ḥuṭāman inna fī dhālika ladhik'rā li-ulī al-albābi ","translations":["Do not","you see","that","Allah","sends down","from","the sky","water","and He makes it flow","(as) springs","in","the earth","then","He produces","with it","crops","(of) different","colors","then","they wither","and you see it","turn yellow","then","He makes them","debris","Indeed","in","that","surely, (is) a reminder","for those of understanding","for those of understanding","(21)"],"transliterationArr":["alam","tara","anna","al-laha","anzala","mina","al-samāi","māan","fasalakahu","yanābīʿa","fī","al-arḍi","thumma","yukh'riju","bihi","zarʿan","mukh'talifan","alwānuhu","thumma","yahīju","fatarāhu","muṣ'farran","thumma","yajʿaluhu","ḥuṭāman","inna","fī","dhālika","ladhik'rā","li-ulī","al-albābi",null],"verseTiming":[[1,0,630],[2,630,1110],[3,1110,2240],[4,2240,3010],[5,3010,4510],[6,4510,4890],[7,4890,5500],[8,5500,7120],[9,7120,10590],[10,10590,11860],[11,11860,13120],[12,13120,13350],[13,13350,14250],[14,14250,15420],[15,15420,16680],[16,16680,16910],[17,16910,17730],[18,17730,18780],[19,18780,19630],[20,19630,20190],[21,20190,20830],[22,20830,22560],[23,22560,24040],[24,24040,25240],[25,25240,26100],[26,26100,27110],[27,27110,28920],[28,28920,29870],[29,29870,31020],[30,31020,32220],[31,32220,33710],[32,33710,34200],[33,34200,35010],[34,35010,36020],[35,36020,36570],[36,36570,39265]]}}