{"name":"39:2","price":"یقیناً ہم نے اس کتاب کو آپ کی طرف حق کے ساتھ(1) نازل فرمایا ہے پس آپ اللہ ہی کی عبادت کریں، اسی کے لئے دین کو خالص کرتے ہوئے.(2)","arabic":"إِنَّآ أَنزَلۡنَآ إِلَيۡكَ ٱلۡكِتَٰبَ بِٱلۡحَقِّ فَٱعۡبُدِ ٱللَّهَ مُخۡلِصٗا لَّهُ ٱلدِّينَ","category":["39 (Az-Zumar)","Az-Zumar","Surah Az-Zumar","Chapter Az-Zumar","Zumar","Surah Zumar","Chapter Zumar","Az Zumar","Surah Az Zumar","Chapter Az Zumar","Surah 39","Chapter 39","The Troops","الزُّمَر"],"ayahNumber":4060,"juzNumber":23,"footnotes":"(1) یعنی اس میں توحید ورسالت، معاد اور احکام وفرائض کا جو اثبات کیا گیا ہے، وہ سب حق ہے اور انہی کے ماننے اور اختیار کرنے میں انسان کی نجات ہے۔\n(2) دین کے معنی یہاں عبادت اور اطاعت کے ہیں اور اخلاص کا مطلب ہے صرف اللہ کی رضا کی نیت سے نیک عمل کرنا۔ آیت، نیت کے وجوب اور اس کے اخلاص پر دلیل ہے۔ حدیث میں بھی اخلاص نیت کی اہمیت یہ کہہ کر واضح کر دی گئی ہے کہ إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ عملوں کا دارومدار نیتوں پر ہے یعنی جو عمل خیر اللہ کی رضا کے لئے کیا جائے گا، (بشرطیکہ وہ سنت کے مطابق ہو) وہ مقبول اور جس عمل میں کسی اور جذبے کی آمیزش ہوگی، وہ نامقبول ہوگا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"innā anzalnā ilayka al-kitāba bil-ḥaqi fa-uʿ'budi al-laha mukh'liṣan lahu al-dīna ","translations":["Indeed, We","[We] have revealed","to you","the Book","in truth","so worship","Allah","(being) sincere","to Him","(in) the religion","(2)"],"transliterationArr":["innā","anzalnā","ilayka","al-kitāba","bil-ḥaqi","fa-uʿ'budi","al-laha","mukh'liṣan","lahu","al-dīna",null],"verseTiming":[[1,0,3080],[2,3080,6870],[3,6870,7650],[4,7650,8840],[5,8840,9860],[6,9860,10750],[7,10750,11570],[8,11570,12430],[9,12430,13060],[10,13060,15775]]}}