{"name":"39:23","price":"اللہ تعالیٰ نے بہترین کلام نازل فرمایا ہے جو ایسی کتاب ہے کہ آپس میں ملتی جلتی اور بار بار دہرائی ہوئی آیتوں کی ہے(1) ، جس سے ان لوگوں کے رونگٹے کھڑے ہو جاتے ہیں جو اپنے رب کا خوف رکھتے ہیں(2) آخر میں ان کے جسم اور دل اللہ تعالیٰ کے ذکر کی طرف نرم ہو جاتے ہیں(3)، یہ ہے اللہ تعالیٰ کی ہدایت جس کے ذریعہ جسے چاہے راه راست پر لگا دیتا ہے۔ اور جسے اللہ تعالیٰ ہی راه بھلا دے اس کا ہادی کوئی نہیں.","arabic":"ٱللَّهُ نَزَّلَ أَحۡسَنَ ٱلۡحَدِيثِ كِتَٰبٗا مُّتَشَٰبِهٗا مَّثَانِيَ تَقۡشَعِرُّ مِنۡهُ جُلُودُ ٱلَّذِينَ يَخۡشَوۡنَ رَبَّهُمۡ ثُمَّ تَلِينُ جُلُودُهُمۡ وَقُلُوبُهُمۡ إِلَىٰ ذِكۡرِ ٱللَّهِۚ ذَٰلِكَ هُدَى ٱللَّهِ يَهۡدِي بِهِۦ مَن يَشَآءُۚ وَمَن يُضۡلِلِ ٱللَّهُ فَمَا لَهُۥ مِنۡ هَادٍ","category":["39 (Az-Zumar)","Az-Zumar","Surah Az-Zumar","Chapter Az-Zumar","Zumar","Surah Zumar","Chapter Zumar","Az Zumar","Surah Az Zumar","Chapter Az Zumar","Surah 39","Chapter 39","The Troops","الزُّمَر"],"ayahNumber":4081,"juzNumber":23,"footnotes":"(1) أَحْسَنُ الْحَدِيثِ سے مراد قرآن مجید ہے، ملتی جلتی کا مطلب، اس کے سارے حصےحسن کلام، اعجازوبلاغت، صحت معانی وغیرہ خوبیوں میں ایک دوسرے سے ملتے ہیں۔ یا یہ بھی سابقہ کتب آسمانی سے ملتا ہے یعنی ان کی مشابہ ہے۔ مثانی، جس میں قصص وواقعات اور مواعظ واحکام کو بار بار دہرایا گیا ہے۔\n(2) کیونکہ وہ ان وعیدوں کو اور تخویف وتہدید کو سمجھتے ہیں جو نافرمانوں کے لئے اس میں ہے۔\n(3) یعنی جب اللہ کی رحمت اور اس کے لطف وکرم کی امید ان کے دلوں میں پیدا ہوتی ہے تو ان کے اندر سوز وگداز پیدا ہو جاتا ہے اور وہ اللہ کے ذکر میں مصروف ہو جاتے ہیں۔ حضرت قتادہ (رضي الله عنه) فرماتے ہیں کہ اس میں اولیاء اللہ کی صفت بیان کی گئی ہے کہ اللہ کے خوف سے ان کے دل کانﭗ اٹھتے، ان کی آنکھوں سے آنسو رواں ہو جاتے ہیں اور ان کے دلوں کو اللہ کے ذکر سے اطمینان نصیب ہوتا ہے۔ یہ نہیں ہوتا کہ وہ مدہوش اور حواس باختہ ہو جائیں اور عقل و ہوش باقی نہ رہے، کیونکہ یہ بدعتیوں کی صفت ہے اور اس میں شیطان کا دخل ہوتا ہے۔ (ابن کثیر) جیسے آج بھی بدعتیوں کی قوالی میں اس طرح کی شیطانی حرکتیں عام ہیں، جسے وہ وجد وحال یا سکر ومستی سے تعبیر کرتے ہیں۔ امام ابن کثیر فرماتے ہیں، اہل ایمان کا معاملہ اس بارے میں کافروں سے بوجوہ مختلف ہے۔ ایک یہ کہ اہل ایمان کا سماع، قرآن کریم کی تلاوت ہے، جب کہ کفار کا سماع، بے حیا مغنیات کی آوازوں میں گانا بجانا، سننا ہے۔ (جیسے اہل بدعت کا سماع مشرکانہ غلو پر مبنی قوالیاں اور نعتیں ہیں) دوسرے، یہ کہ اہل ایمان قرآن سن کر ادب وخشیت سے رجا ومحبت سے اور علم وفہم سے رو پڑتے ہیں اور سجدہ ریز ہو جاتے ہیں، جب کہ کفار شور کرتے اور کھیل کود میں مصروف رہتے ہیں۔ تیسرے، اہل ایمان سماع قرآن کے وقت ادب وتواضع اختیار کرتے ہیں، جیسے صحابہ کرام کی عادت مبارکہ تھی، جس سے ان کے رونگٹے کھڑے ہو جاتے اور ان کے دل اللہ کی طرف جھک جاتے تھے۔ (ابن کثیر)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"al-lahu nazzala aḥsana al-ḥadīthi kitāban mutashābihan mathāniya taqshaʿirru min'hu julūdu alladhīna yakhshawna rabbahum thumma talīnu julūduhum waqulūbuhum ilā dhik'ri al-lahi dhālika hudā al-lahi yahdī bihi man yashāu waman yuḍ'lili al-lahu famā lahu min hādin ","translations":["Allah","has revealed","(the) best","(of) [the] statement ","a Book","(its parts) resembling each other","oft-repeated","Shiver","from it","(the) skins","(of) those who","fear","their Lord","then","relax","their skins","and their hearts","at","(the) remembrance","(of) Allah","That","(is the) guidance","(of) Allah","He guides","with it","whom","He wills","And whoever","Allah lets go astray","Allah lets go astray","then not","for him","any","guide","(23)"],"transliterationArr":["al-lahu","nazzala","aḥsana","al-ḥadīthi","kitāban","mutashābihan","mathāniya","taqshaʿirru","min'hu","julūdu","alladhīna","yakhshawna","rabbahum","thumma","talīnu","julūduhum","waqulūbuhum","ilā","dhik'ri","al-lahi","dhālika","hudā","al-lahi","yahdī","bihi","man","yashāu","waman","yuḍ'lili","al-lahu","famā","lahu","min","hādin",null],"verseTiming":[[1,0,1080],[2,1080,1890],[3,1890,2590],[4,2590,3680],[5,3680,4550],[6,4550,6630],[7,6630,8450],[8,8450,9740],[9,9740,10340],[10,10340,11140],[11,11140,12120],[12,12120,13160],[13,13160,14220],[14,14220,15660],[15,15660,16420],[16,16420,17660],[17,17660,19160],[18,19160,19740],[19,19740,20380],[20,20380,22560],[21,22560,24050],[22,24050,24480],[23,24480,25340],[24,25340,26100],[25,26100,26710],[26,26710,26850],[27,26850,28130],[28,28130,31300],[29,31300,31740],[30,31740,32690],[31,32690,33590],[32,33590,34230],[33,34230,34940],[34,34940,35530],[35,35530,36040],[36,36040,38165]]}}