{"name":"39:31","price":"پھر تم سب کے سب قیامت والے دن اپنے رب کے سامنے جھگڑو گے.(1)","arabic":"ثُمَّ إِنَّكُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ عِندَ رَبِّكُمۡ تَخۡتَصِمُونَ","category":["39 (Az-Zumar)","Az-Zumar","Surah Az-Zumar","Chapter Az-Zumar","Zumar","Surah Zumar","Chapter Zumar","Az Zumar","Surah Az Zumar","Chapter Az Zumar","Surah 39","Chapter 39","The Troops","الزُّمَر"],"ayahNumber":4089,"juzNumber":23,"footnotes":"(1) یعنی اے پیغمبر صلی اللہ علیہ وسلم آپ بھی اور آپ کے مخالف بھی، سب موت سے ہم کنار ہوکر اس دنیا سے ہمارےپاس آخرت میں آئیں گے۔ دنیا میں تو توحید اور شرک کا فیصلہ تمہارے درمیان نہیں ہو سکا اور تم اس بارے میں جھگڑتے ہی رہے۔ لیکن یہاں میں اس کا فیصلہ کروں گا اور مخلص موحدین کو جنت میں اور مشرکین وجاحدین اور مکذبین کو جہنم میں داخل کروں گا۔ اس آیت سے بھی وفات النبی صلی اللہ علیہ وسلم کا اثبات ہوتا ہے، جس طرح کہ سورۃ آل عمران کی آیت 144 سے بھی ہوتا ہے اور انہی آیات سے استدلال کرتے ہوئے حضرت ابوبکر صدیق (رضي الله عنه) نے بھی لوگوں میں آپ ﹲ کی موت کا تحقق فرمایا تھا۔ اس لئے نبی صلی اللہ علیہ وسلم کی بابت یہ عقیدہ رکھنا کہ آپ کو برزخ میں بالکل اسی طرح زندگی حاصل ہےجس طرح دنیا میں حاصل تھی، قرآن کی نصوص کے خلاف ہے۔ آپ صلی اللہ علیہ وسلم پر بھی دیگر انسانوں ہی کی طرح موت طاری ہوئی، اسی لئے آپ کو دفن کیا گیا، قبر میں آپ کو برزخی زندگی تو یقیناً حاصل ہے، جس کی کیفیت کا ہمیں علم نہیں، لیکن دوبارہ قبر میں آپ کودنیوی زندگی عطا نہیں کی گئی۔ ﹲ۔صلیٰ اللہ علیہ و سلم","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"thumma innakum yawma al-qiyāmati ʿinda rabbikum takhtaṣimūna ","translations":["Then","indeed you","(on the) Day","(of) the Resurrection","before","your Lord","will dispute","(31)"],"transliterationArr":["thumma","innakum","yawma","al-qiyāmati","ʿinda","rabbikum","takhtaṣimūna",null],"verseTiming":[[1,0,1380],[2,1380,3120],[3,3120,3680],[4,3680,5030],[5,5030,6470],[6,6470,7520],[7,7520,11075]]}}