{"name":"39:34","price":"ان کے لیے ان کے رب کے پاس (ہر) وه چیز ہے جو یہ چاہیں(1) ، نیک لوگوں کا یہی بدلہ ہے.(2)","arabic":"لَهُم مَّا يَشَآءُونَ عِندَ رَبِّهِمۡۚ ذَٰلِكَ جَزَآءُ ٱلۡمُحۡسِنِينَ","category":["39 (Az-Zumar)","Az-Zumar","Surah Az-Zumar","Chapter Az-Zumar","Zumar","Surah Zumar","Chapter Zumar","Az Zumar","Surah Az Zumar","Chapter Az Zumar","Surah 39","Chapter 39","The Troops","الزُّمَر"],"ayahNumber":4092,"juzNumber":24,"footnotes":"(1) یعنی اللہ تعالیٰ ان کےگناہ بھی معاف فرما دے گا، ان کے درجے بھی بلند فرمائے گا، کیونکہ ہر مسلمان کی اللہ سے یہی خواہش ہوتی ہے علاوہ ازیں جنت میں جانے کے بعد ہرمطلوب چیز بھی ملے گی۔\n(2) محسنین 'کا ایک مفہوم تو یہ ہے جو نیکیاں کرنے والے ہیں ،دوسرا وہ جو اخلاص کے ساتھ اللہ کی عبادت کرتے ہیں، جیسے حدیث میں\"احسان \"کی تعریف کی گئی ہے'أَنْ تَعْبُدَ اللَّهَ كَأَنَّكَ تَرَاهُ فَإِنْ لَمْ تَكُنْ تَرَاهُ فَإِنَّهُ يَرَاكَ\"تم اللہ کی عبادت اس طرح کرو گویا تم اسے دیکھ رہے ہو ”اگر یہ تصور ممکن نہ ہو تو یہ ضرور ذہن میں رہے کہ وہ تمہیں دیکھ رہا ہے“ تیسرا جو لوگوں کو ساتھ حسن سلوک اور اچھا برتاؤ کرتے ہیں چوتھا ہر نیک عمل کو اچھے طریقے سے خشوع و خزوع سے اور سنت نبوی (صلى الله عليه وسلم) کے مطابق کرتے ہیں ۔کثرت کے بجائے اس میں ”حسن“ کا خیال رکھتے ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"lahum mā yashāūna ʿinda rabbihim dhālika jazāu al-muḥ'sinīna ","translations":["For them","(is) what","they wish","with","their Lord","That","(is the) reward","(of) the good-doers","(34)"],"transliterationArr":["lahum","mā","yashāūna","ʿinda","rabbihim","dhālika","jazāu","al-muḥ'sinīna",null],"verseTiming":[[1,0,900],[2,900,2010],[3,2010,4920],[4,4920,6090],[5,6090,7670],[6,7670,8480],[7,8480,10610],[8,10610,14085]]}}