{"name":"39:53","price":"(میری جانب سے) کہہ دو کہ اے میرے بندو! جنہوں نے اپنی جانوں پر زیادتی کی ہے تم اللہ کی رحمت سے ناامید نہ ہو جاؤ، بالیقین اللہ تعالیٰ سارے گناہوں کو بخش دیتا ہے، واقعی وه بڑی بخشش بڑی رحمت واﻻ ہے.(1)","arabic":"۞ قُلۡ يَٰعِبَادِيَ ٱلَّذِينَ أَسۡرَفُواْ عَلَىٰٓ أَنفُسِهِمۡ لَا تَقۡنَطُواْ مِن رَّحۡمَةِ ٱللَّهِۚ إِنَّ ٱللَّهَ يَغۡفِرُ ٱلذُّنُوبَ جَمِيعًاۚ إِنَّهُۥ هُوَ ٱلۡغَفُورُ ٱلرَّحِيمُ","category":["39 (Az-Zumar)","Az-Zumar","Surah Az-Zumar","Chapter Az-Zumar","Zumar","Surah Zumar","Chapter Zumar","Az Zumar","Surah Az Zumar","Chapter Az Zumar","Surah 39","Chapter 39","The Troops","الزُّمَر"],"ayahNumber":4111,"juzNumber":24,"footnotes":"(1) اس آیت میں اللہ تعالیٰ کی مغفرت کی وسعت کا بیان ہے۔ اسراف کے معنی ہیں گناہوں کی کثرت اور اس میں افراط۔ ”اللہ کی رحمت سے ناامید نہ ہو“ کا مطلب ہے کہ ایمان لانے سے قبل یا تو استغفار کا احساس پیدا ہونے سے پہلے کتنے بھی گناہ کیے ہوں، انسان یہ نہ سمجھے کہ میں تو بہت زیادہ گناہ گار ہوں، مجھے اللہ تعالیٰ کیونکر معاف کرے گا؟ بلکہ سچےدل سے اگر ایمان قبول کرلے گا یا توبہ النصوح کرلے گا تو اللہ تعالیٰ تمام گناہ معاف فرمادے گا۔ شان نزول کی روایت سے بھی یہی مفہوم ثابت ہوتا ہے۔ کچھ کافر و مشرک تھے جنہوں نے کثرت سے قتل اور زناکاری کا ارتکاب کیا تھا، یہ نبی ﹲ کی خدمت میں حاضر ہوئے اور کہا کہ آپ ﹲ کی دعوت، صحیح ہے لیکن ہم لوگ بہت زیادہ خطاکار ہیں، اگر ہم ایمان لے آئے تو کیا وہ سب معاف ہو جائیں گے، جس پر اس آیت کا نزول ہوا۔ (صحیح بخاری،تفسیر سورۂ زمر) اس کا یہ مطلب نہیں ہے کہ اللہ کی رحمت و مغفرت کی امید پر خوب گناہ کیے جاؤ، اس کے احکام و فرائض کی مطلق پرواہ نہ کرو اور اس کے حدود اور ضابطوں کو بے دردی سے پامال کرو۔ اس طرح اس کے غضب و انتقام کو دعوت دے کر اس کی رحمت و مغفرت کی امید رکھنا نہایت نادانش مندی اور خام خیالی ہے۔ یہ تخم حنظل بو کر ثمرات و فواکہ کی امید رکھنے کے مترادف ہے۔ ایسے لوگوں کو یہ یاد رکھنا چاہیے کہ وہ جہاں اپنے بندوں کے لیے غَفُورٌ رَحِيمٌ ہے، وہاں وہ نافرمانوں کے لیے عَزِيزٌ ذُو انْتِقَامٍ بھی ہے۔ چنانچہ قرآن کریم میں متعدد جگہ ان دونوں پہلوؤں کو ساتھ ساتھ بیان کیا گیا، مثلاً نَبِّئْ عِبَادِي أَنِّي أَنَا الْغَفُورُ الرَّحِيمُ ، وَأَنَّ عَذَابِي هُوَ الْعَذَابُ الأَلِيمُ (الحجر:50،49) غالباً یہی وجہ ہے کہ یہاں آیت کا آغاز يَا عِبَادِي (میرے بندوں) سےفرمایا، جس سے یہی معلوم ہوتاہے کہ جو ایمان لاکر یا سچی توبہ کرکے صحیح معنوں میں اس کا بندہ بن جائے گا، اس کے گناہ اگر سمندر کے جھاگ کے برابر ہوں گے تو وہ معاف فرما دے گا، وہ اپنے بندوں کے لیے یقیناً غفور رحیم ہے۔ جیسے حدیث میں سو آدمیوں کے قاتل کے توبہ کا واقعہ ہے، (صحيح بخاري، كتاب الأنبياء - مسلم ، كتاب التوبة ، باب قبول توبة القاتل وإن كثر قتله)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qul yāʿibādiya alladhīna asrafū ʿalā anfusihim lā taqnaṭū min raḥmati al-lahi inna al-laha yaghfiru al-dhunūba jamīʿan innahu huwa al-ghafūru al-raḥīmu ","translations":["Say","O My slaves","Those who","have transgressed","against","themselves","(do) not","despair","of","(the) Mercy","(of) Allah","Indeed","Allah","forgives","the sins","all","Indeed He","He","(is) the Oft-Forgiving","the Most Merciful","(53)"],"transliterationArr":["qul","yāʿibādiya","alladhīna","asrafū","ʿalā","anfusihim","lā","taqnaṭū","min","raḥmati","al-lahi","inna","al-laha","yaghfiru","al-dhunūba","jamīʿan","innahu","huwa","al-ghafūru","al-raḥīmu",null],"verseTiming":[[1,0,510],[2,510,2240],[3,2240,3420],[4,3420,4620],[5,4620,6800],[6,6800,8770],[7,8770,9200],[8,9200,10450],[9,10450,10640],[10,10640,11760],[11,11760,12640],[12,12640,15210],[13,15210,16750],[14,16750,17700],[15,17700,18720],[16,18720,19890],[17,19890,21650],[18,21650,23600],[19,23600,23900],[20,23900,25450],[21,25450,28735]]}}