{"name":"39:67","price":"اور ان لوگوں نے جیسی قدر اللہ تعالیٰ کی کرنی چاہئے تھی نہیں کی(1) ، ساری زمین قیامت کے دن اس کی مٹھی میں ہوگی اور تمام آسمان اس کے داہنے ہاتھ میں لپیٹے ہوئے ہوں گے(2)، وه پاک اور برتر ہے ہر اس چیز سے جسے لوگ اس کا شریک بنائیں.","arabic":"وَمَا قَدَرُواْ ٱللَّهَ حَقَّ قَدۡرِهِۦ وَٱلۡأَرۡضُ جَمِيعٗا قَبۡضَتُهُۥ يَوۡمَ ٱلۡقِيَٰمَةِ وَٱلسَّمَٰوَٰتُ مَطۡوِيَّٰتُۢ بِيَمِينِهِۦۚ سُبۡحَٰنَهُۥ وَتَعَٰلَىٰ عَمَّا يُشۡرِكُونَ","category":["39 (Az-Zumar)","Az-Zumar","Surah Az-Zumar","Chapter Az-Zumar","Zumar","Surah Zumar","Chapter Zumar","Az Zumar","Surah Az Zumar","Chapter Az Zumar","Surah 39","Chapter 39","The Troops","الزُّمَر"],"ayahNumber":4125,"juzNumber":24,"footnotes":"(1) کیونکہ اس کی بات بھی نہیں مانی ، جو اس نے پیغمبروں کے ذریعے ان تک پہنچائی تھی اور عبادت بھی اس کے لیے خالص نہیں کی بلکہ دوسروں کو بھی اس میں شریک کرلیا۔ حدیث میں آتا ہے کہ ایک یہودی عالم نبی ﹲ کی خدمت میں آیا اور کہا کہ ہم اللہ کی بابت (کتابوں میں) یہ بات پاتے ہیں کہ وہ (قیامت والے دن) آسمانوں کو ایک انگلی پر،زمینوں کو ایک انگلی پر، درختوں کو ایک انگلی پر، پانی اور ثری (تری) کو ایک انگلی پر اور تمام مخلوقات کو ایک انگلی پر رکھ لے گا اور فرمائے گا، میں بادشاہ ہوں)۔ آپ ﹲ نے مسکرا کراس کی تصدیق فرمائی اور آیت وَمَا قَدَرُوا اللهَ کی تلاوت فرمائی۔ (صحیح بخاری تفسیر سورۂ زمر) محدثین اور سلف کا عقیدہ ہے کہ اللہ کی جن صفات کا ذکرقرآن او احادیث صحیحہ میں ہے، (جس طرح اس آیت میں ہاتھ اور حدیث میں انگلیوں کا اثبات ہے) ان پر بلاکیف و تشبیہ اور بغیر تاویل و تحریف کے ایمان رکھنا ضروری ہے۔ اس لیے یہاں بیان کردہ حقیقت کو مجرد غلبہ وقوت کے مفہوم میں لینا صحیح نہیں ہے۔\n(2) اس کی بابت بھی حدیث میں آتا ہے کہ پھر اللہ تعالیٰ فرمائے گا کہ أَنَا الْمَلِكُ أَيْنَ مُلُوكُ الأَرْض ِ (میں بادشاہ ہوں۔ زمین کے بادشاہ (آج) کہاں ہیں؟ (حوالۂ مذکورہ)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wamā qadarū al-laha ḥaqqa qadrihi wal-arḍu jamīʿan qabḍatuhu yawma al-qiyāmati wal-samāwātu maṭwiyyātun biyamīnihi sub'ḥānahu wataʿālā ʿammā yush'rikūna ","translations":["And not","they appraised","Allah","(with) true","appraisal","while the earth","entirely","(will be) in His Grip","(on the) Day","(of) the Resurrection","and the heavens","(will be) folded","in His Right Hand","Glory be to Him","And High is He","above what","they associate (with Him)","(67)"],"transliterationArr":["wamā","qadarū","al-laha","ḥaqqa","qadrihi","wal-arḍu","jamīʿan","qabḍatuhu","yawma","al-qiyāmati","wal-samāwātu","maṭwiyyātun","biyamīnihi","sub'ḥānahu","wataʿālā","ʿammā","yush'rikūna",null],"verseTiming":[[1,0,650],[2,650,1560],[3,1560,2230],[4,2230,2940],[5,2940,3980],[6,3980,5070],[7,5070,6940],[8,6940,8130],[9,8130,8800],[10,8800,10250],[11,10250,12070],[12,12070,14840],[13,14840,16080],[14,16080,18240],[15,18240,19500],[16,19500,21330],[17,21330,25305]]}}