{"name":"39:6","price":"اس نے تم سب کو ایک ہی جان سے پیدا کیا ہے(1) ، پھر اسی سے اس کا جوڑا پیدا کیا(2) اور تمہارے لئے چوپایوں میں سے (آٹھ نر وماده) اتارے(3) وه تمہیں تمہاری ماؤں کے پیٹوں میں ایک بناوٹ کے بعد دوسری بناوٹ پر بناتا(4) ہے تین تین اندھیروں(5) میں، یہی اللہ تعالیٰ تمہارا رب ہے اسی کے لئے بادشاہت ہے، اس کے سوا کوئی معبود نہیں، پھر تم کہاں بہک رہے ہو.(6)","arabic":"خَلَقَكُم مِّن نَّفۡسٖ وَٰحِدَةٖ ثُمَّ جَعَلَ مِنۡهَا زَوۡجَهَا وَأَنزَلَ لَكُم مِّنَ ٱلۡأَنۡعَٰمِ ثَمَٰنِيَةَ أَزۡوَٰجٖۚ يَخۡلُقُكُمۡ فِي بُطُونِ أُمَّهَٰتِكُمۡ خَلۡقٗا مِّنۢ بَعۡدِ خَلۡقٖ فِي ظُلُمَٰتٖ ثَلَٰثٖۚ ذَٰلِكُمُ ٱللَّهُ رَبُّكُمۡ لَهُ ٱلۡمُلۡكُۖ لَآ إِلَٰهَ إِلَّا هُوَۖ فَأَنَّىٰ تُصۡرَفُونَ","category":["39 (Az-Zumar)","Az-Zumar","Surah Az-Zumar","Chapter Az-Zumar","Zumar","Surah Zumar","Chapter Zumar","Az Zumar","Surah Az Zumar","Chapter Az Zumar","Surah 39","Chapter 39","The Troops","الزُّمَر"],"ayahNumber":4064,"juzNumber":23,"footnotes":"(1) یعنی حضرت آدم (عليه السلام) سے، جن کو اللہ نے اپنے ہاتھ سے بنایا تھا اور اپنی طرف سے اس میں روح پھونکی تھی۔\n(2) یعنی حضرت حوا کو حضرت آدم (عليه السلام) کی بائیں پسلی سے پیدا فرمایا اور یہ بھی اس کا کمال قدرت ہے کیونکہ حضرت حوا کے علاوہ کسی بھی عورت کی تخلیق، کسی آدمی کی پسلی سے نہیں ہوئی۔ یوں یہ تخلیق امر عادی کے خلاف اور اللہ کی قدرت کی نشانیوں میں سے ہے۔\n(3) یہ وہی چار قسم کے جانوروں کا بیان ہے بھیڑ، بکری، اونٹ، گائے جو نر اور مادہ مل کر آٹھ ہو جاتے ہیں، جن کا ذکر سورۂ انعام: آیت 143-144 میں گزر چکا ہے۔ أَنْزَلَ بِمَعْنَى خَلَقَ ہے یا ایک روایت کے مطابق، پہلے اللہ نے انہیں جنت میں پیدا فرمایا اور پھر انہیں نازل کیا، پس یہ انزال حقیقی ہوگا۔ یا أَنْزَلَ کا اطلاق مجازاً ہے اس لئے کہ یہ جانور چارے کے بغیر نہیں رہ سکتے اور چارہ کی روئیدگی کے لئے پانی ناگزیر ہے۔ جو آسمان سے ہی بارش کے ذریعے سے اترتا ہے۔ یوں گویا یہ چوپائے آسمان سے اتارے ہوئے ہیں، (فتح القدیر)۔\n(4) یعنی رحم مادر میں مختلف اطوار سے گزارتا ہے، پہلے نطفہ، پھر عَلَقَةً پھر مُضْغَةً، پھر ہڈیوں کا ڈھانچہ، جس کے اوپر گوشت کا لباس۔ ان تمام مراحل سے گزرنے کے بعد انسان کامل تیار ہوتا ہے۔\n(5) ایک ماں کے پیٹ کا اندھیرا، دوسرا رحم مادر کا اندھیرا اور تیسرا مشیمہ کا اندھیرا، وہ جھلی یا پردہ جس کے اندر بچہ لیٹا ہوا ہوتا ہے۔\n(6) یا کیوں تم حق سے باطل کی طرف اور ہدایت سے گمراہی کی طرف پھر رہے ہو؟","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"khalaqakum min nafsin wāḥidatin thumma jaʿala min'hā zawjahā wa-anzala lakum mina al-anʿāmi thamāniyata azwājin yakhluqukum fī buṭūni ummahātikum khalqan min baʿdi khalqin fī ẓulumātin thalāthin dhālikumu al-lahu rabbukum lahu al-mul'ku lā ilāha illā huwa fa-annā tuṣ'rafūna ","translations":["He created you","from","a soul","single","Then","He made","from it","its mate","And He sent down","for you","of","the cattle","eight","kinds","He creates you","in","(the) wombs","(of) your mothers","creation","after","after","creation","in","darkness[es]","three","That","(is) Allah","your Lord","for Him","(is) the dominion","(There is) no","god","except","He","Then how","are you turning away","(6)"],"transliterationArr":["khalaqakum","min","nafsin","wāḥidatin","thumma","jaʿala","min'hā","zawjahā","wa-anzala","lakum","mina","al-anʿāmi","thamāniyata","azwājin","yakhluqukum","fī","buṭūni","ummahātikum","khalqan","min","baʿdi","khalqin","fī","ẓulumātin","thalāthin","dhālikumu","al-lahu","rabbukum","lahu","al-mul'ku","lā","ilāha","illā","huwa","fa-annā","tuṣ'rafūna",null],"verseTiming":[[1,0,1200],[2,1200,2280],[3,2280,4400],[4,4400,5960],[5,5960,7580],[6,7580,8280],[7,8280,9110],[8,9110,10210],[9,10210,12020],[10,12020,12540],[11,12540,13570],[12,13570,14890],[13,14890,16270],[14,16270,18140],[15,18140,19920],[16,19920,20340],[17,20340,21280],[18,21280,23440],[19,23440,24200],[20,24200,26550],[21,26550,27190],[22,27190,28510],[23,28510,29410],[24,29410,31290],[25,31290,33700],[26,33700,35309],[27,35309,36189],[28,36189,37139],[29,37139,37559],[30,37559,38459],[31,38459,40779],[32,40779,41579],[33,41579,42389],[34,42389,42959],[35,42959,45349],[36,45349,48724]]}}