{"name":"39:73","price":"اور جو لوگ اپنے رب سے ڈرتے تھے ان کے گروه کے گروه جنت کی طرف روانہ کیے جائیں(1) گے یہاں تک کہ جب اس کے پاس آ جائیں گے(2) اور دروازے کھول دیے جائیں گے اور وہاں کے نگہبان ان سے کہیں گے تم پر سلام ہو، تم خوش حال رہو تم اس میں ہمیشہ کے لیے چلے جاؤ.","arabic":"وَسِيقَ ٱلَّذِينَ ٱتَّقَوۡاْ رَبَّهُمۡ إِلَى ٱلۡجَنَّةِ زُمَرًاۖ حَتَّىٰٓ إِذَا جَآءُوهَا وَفُتِحَتۡ أَبۡوَٰبُهَا وَقَالَ لَهُمۡ خَزَنَتُهَا سَلَٰمٌ عَلَيۡكُمۡ طِبۡتُمۡ فَٱدۡخُلُوهَا خَٰلِدِينَ","category":["39 (Az-Zumar)","Az-Zumar","Surah Az-Zumar","Chapter Az-Zumar","Zumar","Surah Zumar","Chapter Zumar","Az Zumar","Surah Az Zumar","Chapter Az Zumar","Surah 39","Chapter 39","The Troops","الزُّمَر"],"ayahNumber":4131,"juzNumber":24,"footnotes":"(1) اہل ایمان و تقویٰ بھی گروہوں کی شکل میں جنت کی طرف لے جائے جائیں گے، پہلے مقربین، پھر ابرار، اس طرح درجہ بدرجہ، ہر گروہ ہم مرتبہ لوگوں پر مشتمل ہوگا۔ مثلاً انبیاء علیہم السلام، انبیاء علیہم السلام کےساتھ صدیقین شہداء اپنے ہم جنسوں کے ساتھ، علماء اپنے اقران کے ساتھ، یعنی ہر صنف اپنی ہی صنف یا اس کی مثل کے ساتھ ہوگی۔ (ابن کثیر)\n(2) حدیث میں آتا ہے، جنت کے آٹھ دروازے ہیں، ان میں سے ایک ریان ہے، جس سے صرف روزے دار داخل ہوں گے۔ (صحیح بخاری، نمبر 2257۔ مسلم، نمبر 808) اسی طرح دوسرے دروازوں کے نام بھی ہوں گے، جیسے باب الصلوٰۃ، باب الصدقہ، باب الجھاد وغیرہ (صحيح بخاري، كتاب الصيام، مسلم، كتاب الزكاة) ہر دروازے کی چوڑائی چالیس سال کی مسافت کے برابرہوگی، اس کے باوجود یہ بھرے ہوئے ہوں گے۔ (صحيح مسلم كتاب الزهد) سب سے پہلے جنت کا دروازہ کھٹکھٹانے والے نبی صلی اللہ علیہ وسلم ہوں گے۔ (مسلم كتاب الإيمان، باب أنا أول الناس يشفع) جنت میں سب سےپہلے جانے والے گروہ کے چہرے پر چودھویں رات کے چاند کی طرح اور دوسرے گروہ کےچہرے پر آسمان پر چمکنے والے ستاروں میں سے روشن ترین ستارے کی طرح چمکتےہوں گے۔ جنت میں وہ بول و براز اور تھوک، بلغم سے پاک ہوں گے، ان کی کنگھیاں سونے کی اور پسینہ کستوری ہوگا، ان کی انگیٹھیوں میں خوشبودار لکڑی ہو گی، ان کی بیویاں الحور العین ہوں گی، ان کا قد آدم (عليه السلام) کی طرح ساٹھ ہاتھ ہوگا۔ (صحيح بخاري، أول كتاب الأنبياء) صحیح بخاری ہی کی ایک دوسری روایت سے معلوم ہوتا ہے کہ ہر مومن کو دو بیویاں ملیں گی، ان کے حسن و جمال کایہ حال ہوگا کہ ان کی پندلی کا گودا گوشت کے پیچھے سے نظر آئے گا۔ (كتاب بدء الخلق ، باب ما جاء في صفة الجنة) بعض نے کہا یہ دو بیویاں حوروں کے علاوہ، دنیاکی عورتوں میں سے ہوں گی۔ لیکن چونکہ 72 حوروں والی روایت سنداً صحیح نہیں۔ اس لیے بظاہر یہی بات صحیح معلوم ہوتی ہے کہ ہر جنتی کی کم از کم حور سمیت دو بیویاں ہوگی۔ تاہم وَلَهُمْ فِيهَا مَا يَشْتَهُونَ کے تحت زیادہ بھی ممکن ہیں۔ واللہ اعلم (مزید دیکھئے فتح الباری۔ باب مذکور)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wasīqa alladhīna ittaqaw rabbahum ilā al-janati zumaran ḥattā idhā jāūhā wafutiḥat abwābuhā waqāla lahum khazanatuhā salāmun ʿalaykum ṭib'tum fa-ud'khulūhā khālidīna ","translations":["And (will) be driven","those who","feared","their Lord","to","Paradise","(in) groups","until","when","they reach it","and (will) be opened","its gates","and (will) say","to them","its keepers","Peace be","upon you","you have done well","so enter it","(to) abide eternally","(73)"],"transliterationArr":["wasīqa","alladhīna","ittaqaw","rabbahum","ilā","al-janati","zumaran","ḥattā","idhā","jāūhā","wafutiḥat","abwābuhā","waqāla","lahum","khazanatuhā","salāmun","ʿalaykum","ṭib'tum","fa-ud'khulūhā","khālidīna",null],"verseTiming":[[1,0,920],[2,920,1990],[3,1990,2990],[4,2990,4080],[5,4080,4440],[6,4440,6430],[7,6430,8030],[8,8030,10500],[9,10500,11170],[10,11170,14180],[11,14180,15370],[12,15370,16890],[13,16890,17880],[14,17880,18450],[15,18450,19830],[16,19830,20950],[17,20950,22160],[18,22160,23000],[19,23000,24540],[20,24540,28055]]}}