{"name":"3:105","price":"تم ان لوگوں کی طرح نہ ہو جانا جنہوں نے اپنے پاس روشن دلیلیں آ جانے کے بعد بھی تفرقہ ڈاﻻ(1) ، اور اختلاف کیا، انہیں لوگوں کے لئے بڑا عذاب ہے.","arabic":"وَلَا تَكُونُواْ كَٱلَّذِينَ تَفَرَّقُواْ وَٱخۡتَلَفُواْ مِنۢ بَعۡدِ مَا جَآءَهُمُ ٱلۡبَيِّنَٰتُۚ وَأُوْلَٰٓئِكَ لَهُمۡ عَذَابٌ عَظِيمٞ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":398,"juzNumber":4,"footnotes":"(1) روشن دلیلیں آجا نے کے بعد تفرقہ ڈالا۔ اس سے معلوم ہوا کہ یہود ونصاریٰ کے باہمی اختلاف وتفرقہ کی وجہ یہ نہ تھی کہ انہیں حق کا پتہ نہ تھا۔ اور وہ اس کے دلائل سے بے خبر تھے۔ بلکہ حقیقت یہ ہے کہ انہوں نے سب کچھ جانتے ہوئے محض اپنے دنیاوی مفاد اور نفسانی اغراض کے لئے اختلاف وتفرقہ کی راہ پکڑی تھی اور اس پر جمے ہوئے تھے۔ قرآن مجید نے مختلف اسلوب اور پیرائے سے بار بار اس حقیقت کی نشاندہی کی ہے اور اس سے دور رہنے کی تاکید فرمائی ہے۔ مگر افسوس کہ اس امت کے تفرقہ بازوں نے بھی ٹھیک یہی روش اختیار کی کہ حق اور اس کی روشن دلیلیں انہیں خوب اچھی طرح معلوم ہیں۔ مگر وہ اپنی فرقہ بندیوں پر جمے ہوئے ہیں اور پنی عقل وذہانت کا سارا جوہر ہر سابقہ امتوں کی طرح تاویل وتحریف کے مکروہ شغل میں ضائع کر رہے ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walā takūnū ka-alladhīna tafarraqū wa-ikh'talafū min baʿdi mā jāahumu al-bayinātu wa-ulāika lahum ʿadhābun ʿaẓīmun ","translations":["And (do) not","be","like those who","became divided","and differed","from","after","what","came to them ","the clear proofs","And those","for them","(is) a punishment","great","(105)"],"transliterationArr":["walā","takūnū","ka-alladhīna","tafarraqū","wa-ikh'talafū","min","baʿdi","mā","jāahumu","al-bayinātu","wa-ulāika","lahum","ʿadhābun","ʿaẓīmun",null],"verseTiming":[[1,0,750],[2,750,1950],[3,1950,3270],[4,3270,4820],[5,4820,6100],[6,6100,6980],[7,6980,7720],[8,7720,8120],[9,8120,10789],[10,10789,13990],[11,13990,16630],[12,16630,17090],[13,17090,18290],[14,18290,20775]]}}