{"name":"3:103","price":"اللہ تعالیٰ کی رسی کو سب مل کر مضبوط تھام لو(1) اور پھوٹ نہ ڈالو(2)، اور اللہ تعالیٰ کی اس وقت کی نعمت کو یاد کرو جب تم ایک دوسرے کے دشمن تھے، تو اس نے تمہارے دلوں میں الفت ڈال دی، پس تم اس کی مہربانی سے بھائی بھائی ہوگئے، اور تم آگ کے گڑھے کے کنارے پہنچ چکے تھے تو اس نے تمہیں بچا لیا۔ اللہ تعالیٰ اسی طرح تمہارے لئے اپنی نشانیاں بیان کرتا ہے تاکہ تم ہدایت پاؤ.","arabic":"وَٱعۡتَصِمُواْ بِحَبۡلِ ٱللَّهِ جَمِيعٗا وَلَا تَفَرَّقُواْۚ وَٱذۡكُرُواْ نِعۡمَتَ ٱللَّهِ عَلَيۡكُمۡ إِذۡ كُنتُمۡ أَعۡدَآءٗ فَأَلَّفَ بَيۡنَ قُلُوبِكُمۡ فَأَصۡبَحۡتُم بِنِعۡمَتِهِۦٓ إِخۡوَٰنٗا وَكُنتُمۡ عَلَىٰ شَفَا حُفۡرَةٖ مِّنَ ٱلنَّارِ فَأَنقَذَكُم مِّنۡهَاۗ كَذَٰلِكَ يُبَيِّنُ ٱللَّهُ لَكُمۡ ءَايَٰتِهِۦ لَعَلَّكُمۡ تَهۡتَدُونَ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":396,"juzNumber":4,"footnotes":"(1) تقویٰ کے بعد اعْتِصَام بِحَبْلِ اللهِ جَمِيعًا ”سب مل کر اللہ کی رسی کو مضبوطی سے تھام لیں“ کا درس دے کر واضح کر دیا کہ نجات بھی انہی دو اصولوں میں ہے اور اتحاد بھی انہی پر قائم ہو سکتا اور رہ سکتا ہے۔\n(2) وَلا تَفَرَّقُوا (اور پھوٹ نہ ڈالو) کے ذریعے فرقہ بندی سے روک دیا گیا ہے۔ اس کا مطلب یہ ہے کہ اگر مذکورہ دو اصولوں سے انحراف کرو گے تو تمہارے درمیان پھوٹ پڑ جائے گی اور تم الگ الگ فرقوں میں بٹ جاؤ گے،چنانچہ فرقہ بندی کے تاریخ دیکھ لیجئے، یہی چیز نمایاں ہو کر سامنے آئے گی، قرآن وحدیث کے فہم اور اس کی توضیح وتعبیر میں کچھ باہم اختلاف، فرقہ بندی کا سبب نہیں ہے۔ یہ اختلاف تو صحابہ کرام (رضي الله عنهم) وتابعین کے عہد میں بھی تھا لیکن مسلمان فرقوں اور گروہوں میں تقسیم نہیں ہوئے۔ کیونکہ اس اختلاف کے باوجود سب کا مرکز اطاعت اور محور عقیدت ایک ہی تھا قرآن اور حدیث رسول (صلى الله عليه وسلم) لیکن جب شخصیات کے نام پر دبستان فکر معرض وجود میں آئے تو اطاعت وعقیدت کے یہ مرکز ومحور تبدیل ہوگئے۔ اپنی اپنی شخصیات اور ان کے اقوال وافکاراولین حیثیت کے اور اللہ رسول اور ان کے فرمودات ثانوی حیثیت کے حامل قرار پائے۔ اور یہیں سے امت مسلمہ کے افتراق کے المیئے کا آغاز ہوا جو دن بدن بڑھتا ہی چلاگیا اورنہایت مستحکم ہوگیا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-iʿ'taṣimū biḥabli al-lahi jamīʿan walā tafarraqū wa-udh'kurū niʿ'mata al-lahi ʿalaykum idh kuntum aʿdāan fa-allafa bayna qulūbikum fa-aṣbaḥtum biniʿ'matihi ikh'wānan wakuntum ʿalā shafā ḥuf'ratin mina al-nāri fa-anqadhakum min'hā kadhālika yubayyinu al-lahu lakum āyātihi laʿallakum tahtadūna ","translations":["And hold firmly","to (the) rope","(of) Allah","all together","and (do) not","be divided","And remember","(the) Favor","(of) Allah","on you","when","you were","enemies","then He made friendship","between","your hearts","then you became","by His Favor","brothers","And you were","on","(the) brink","(of) pit","of","the Fire","then He saved you","from it","Thus","makes clear","Allah","for you","His Verses","so that you may","(be) guided","(103)"],"transliterationArr":["wa-iʿ'taṣimū","biḥabli","al-lahi","jamīʿan","walā","tafarraqū","wa-udh'kurū","niʿ'mata","al-lahi","ʿalaykum","idh","kuntum","aʿdāan","fa-allafa","bayna","qulūbikum","fa-aṣbaḥtum","biniʿ'matihi","ikh'wānan","wakuntum","ʿalā","shafā","ḥuf'ratin","mina","al-nāri","fa-anqadhakum","min'hā","kadhālika","yubayyinu","al-lahu","lakum","āyātihi","laʿallakum","tahtadūna",null],"verseTiming":[[1,0,1430],[2,1430,2310],[3,2310,3160],[4,3160,5080],[5,5080,5640],[6,5640,7210],[7,7210,8830],[8,8830,9650],[9,9650,10530],[10,10530,11710],[11,11710,12050],[12,12050,13950],[13,13950,17460],[14,17460,18740],[15,18740,19330],[16,19330,20760],[17,20760,23040],[18,23040,25960],[19,25960,27600],[20,27600,29630],[21,29630,32810],[22,32810,34600],[23,34600,36340],[24,36340,37000],[25,37000,37730],[26,37730,38800],[27,38800,39890],[28,39890,41240],[29,41240,43830],[30,43830,45210],[31,45210,46930],[32,46930,48090],[33,48090,48990],[34,48990,49540],[35,49540,51450],[36,51450,52880],[37,52880,56565]]}}