{"name":"3:100","price":"اے ایمان والو! اگر تم اہل کتاب کی کسی جماعت کی باتیں مانو گے تو وه تمہیں تمہارے ایمان ﻻنے کے بعد مرتد کافر بنا دیں(1) گے.","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِن تُطِيعُواْ فَرِيقٗا مِّنَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ يَرُدُّوكُم بَعۡدَ إِيمَٰنِكُمۡ كَٰفِرِينَ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":393,"juzNumber":4,"footnotes":"(1) یہودیوں کے مکر وفریب اور ان کی طرف سے مسلمانوں کو گمراہ کرنے کی مذموم کوششوں کا ذکر کرنے کے بعد مسلمانوں کو تنبیہ کی جا رہی ہے کہ تم بھی ان کی سازشوں سے ہوشیار رہو اور قرآن کی تلاوت کرنے اور رسول اللہ (صلى الله عليه وسلم) کے موجود ہونے کے باوجود کہیں یہود کے جال میں نہ پھنس جاؤ۔ اس کا پس منظر تفسیری روایات میں اس طرح بیان کیا گیا ہے کہ انصار کے دونوں قبیلے اوس اور خزرج ایک مجلس میں اکھٹے بیٹھے باہم گفتگو کر رہے تھے کہ شاس بن قیس یہودی ان کے پاس سے گزرا اور ان کا باہمی پیار دیکھ کر جل بھن گیا کہ پہلے ایک دوسرے کے سخت دشمن تھےاور اب اسلام کی برکت سے باہم شیروشکر ہوگئے ہیں۔ اس نے ایک نوجوان کے ذمے یہ کام لگایا کہ وہ ان کے درمیان جاکر جنگ بعاث کا تذکرہ کرے جو ہجرت سے ذرا پہلے ان کے درمیان برپا ہوئی تھی اور انہوں نے ایک دوسرے کے خلاف جو رزمیہ اشعار کہے تھے وہ ان کو سنائے۔ چنانچہ اس نے ایسا ہی کیا، جس پر ان دونوں قبیلوں کےپرانے جذبات پھربھڑک اٹھے اور ایک دوسرے کو گالی گلوچ دینے لگے یہاں تک کہ ہتھیار اٹھانے کے لئے للکار اور پکار شروع ہوگئی۔ اور قریب تھا کہ ان میں باہم قتال بھی شروع ہو جائے کہ اتنے میں نبی (صلى الله عليه وسلم) تشریف لے آئے اور انہیں سمجھایا اور وہ باز آگئے اس پر یہ آیت بھی اور جو آگے آرہی ہے وہ بھی نازل ہوئیں۔ (تفسير ابن كثير، فتح القدير وغيره)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāayyuhā alladhīna āmanū in tuṭīʿū farīqan mina alladhīna ūtū al-kitāba yaruddūkum baʿda īmānikum kāfirīna ","translations":["O you","who","believe[d]","If","you obey","a group","from","those who","were given","the Book","they will turn you back","after","your belief","(as) disbelievers","(100)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","in","tuṭīʿū","farīqan","mina","alladhīna","ūtū","al-kitāba","yaruddūkum","baʿda","īmānikum","kāfirīna",null],"verseTiming":[[1,0,2890],[2,2890,3920],[3,3920,6150],[4,6150,6550],[5,6550,8200],[6,8200,9140],[7,9140,10010],[8,10010,11200],[9,11200,11740],[10,11740,12930],[11,12930,15160],[12,15160,15750],[13,15750,17340],[14,17340,20035]]}}