{"name":"3:102","price":"اے ایمان والو! اللہ تعالیٰ سے اتنا ڈرو جتنا اس سے ڈرنا چاہئیے(1) اور دیکھو مرتے دم تک مسلمان ہی رہنا.","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱتَّقُواْ ٱللَّهَ حَقَّ تُقَاتِهِۦ وَلَا تَمُوتُنَّ إِلَّا وَأَنتُم مُّسۡلِمُونَ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":395,"juzNumber":4,"footnotes":"(1) اس کا مطلب ہے کہ اسلام کے احکام وفرائض پورے طور پر بجا لائے جائیں اور منہیات کے قریب نہ جایا جائے۔ بعض کہتے ہیں کہ اس آیت سے صحابہ (رضي الله عنهم) پریشان ہوئے تو اللہ تعالیٰ نے آیت «فَاتَّقُوا اللَّهَ مَا اسْتَطَعْتُمْ» ”اللہ سے اپنی طاقت کے مطابق ڈرو نازل فرما دی“۔ لیکن اسے ناسخ کی بجائے اس کی مُبَيّنٌ (بیان وتوضیح کرنے والی) قرار دیا جائے تو زیادہ صحیح ہے، کیونکہ نسخ وہیں ماننا چاہئے جہاں دونوں آیتوں میں جمع وتطبیق ممکن نہ ہو اور یہاں تطبیق ممکن ہے۔ معنی یہ ہوں گے «اتَّقُوا اللهَ حَقَّ تُقَاتِهِ مَا اسْتَطَعْتُمْ» ”اللہ سے اس طرح ڈرو جس طرح اپنی طاقت کے مطابق ڈرنے کا حق ہے“ (فتح القدير)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāayyuhā alladhīna āmanū ittaqū al-laha ḥaqqa tuqātihi walā tamūtunna illā wa-antum mus'limūna ","translations":["O you","who","believe[d]","Fear","Allah","(as is His) right","(that) He (should) be feared","and (do) not","die","except","[while you]","(as) Muslims","(102)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","ittaqū","al-laha","ḥaqqa","tuqātihi","walā","tamūtunna","illā","wa-antum","mus'limūna",null],"verseTiming":[[1,0,3070],[2,3070,4080],[3,4080,4940],[4,4940,5580],[5,5580,6480],[6,6480,7030],[7,7030,8380],[8,8380,9010],[9,9010,10920],[10,10920,11890],[11,11890,13750],[12,13750,17505]]}}