{"name":"3:115","price":"یہ جو کچھ بھی بھلائیاں کریں ان کی ناقدری نہ کی جائے گی اور اللہ تعالیٰ پرہیزگاروں کو خوب جانتا ہے.(1)","arabic":"وَمَا يَفۡعَلُواْ مِنۡ خَيۡرٖ فَلَن يُكۡفَرُوهُۗ وَٱللَّهُ عَلِيمُۢ بِٱلۡمُتَّقِينَ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":408,"juzNumber":4,"footnotes":"(1) یعنی سارے اہل کتاب ایسے نہیں جن کی مذمت پچھلی آیات میں بیان کی گئی ہے، بلکہ ان میں کچھ اچھے لوگ بھی ہیں، جیسےعبد الله بن سلام، أسد بن عبيد، ثَعلبة بن سعيةاورأسيد بن سعيةوغیرہ جنہیں اللہ تعالیٰ نے شرف اسلام سے نوازا اور ان میں اہل ایمان وتقویٰ والی خوبیاں پائی جاتی ہیں رَضِيَ اللهُ عَنْهُمْ وَرَضُوا عَنْهُ- قَائِمَةٌکے معنی ہیں، شریعت کی اطاعت اور نبی کریم (صلى الله عليه وسلم) کا اتباع کرنے والی يَسْجُدُونَ کا مطلب، رات کو قیام کرتے یعنی تہجد پڑھتے اور نمازوں میں تلاوت کرتے۔ اس مقام پر امر بالمعروف۔۔۔۔۔۔ کے معنی بعض نے یہ کئے ہیں کہ وہ نبی (صلى الله عليه وسلم) پر ایمان لانے کا حکم دیتے اور آپ (صلى الله عليه وسلم) کی مخالفت کرنے سے روکتے ہیں۔ اسی گروہ کا ذکر آگے بھی کیا گیا ہے۔«وَإِنَّ مِنْ أَهْلِ الْكِتَابِ لَمَنْ يُؤْمِنُ بِاللَّهِ وَمَا أُنْزِلَ إِلَيْكُمْ وَمَا أُنْزِلَ إِلَيْهِمْ خَاشِعِينَ لِلَّهِ» (آل عمران: 199)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wamā yafʿalū min khayrin falan yuk'farūhu wal-lahu ʿalīmun bil-mutaqīna ","translations":["And whatever","they do","of","a good","then never","will they be denied it","And Allah","(is) All-Knowing","of the God-fearing","(115)"],"transliterationArr":["wamā","yafʿalū","min","khayrin","falan","yuk'farūhu","wal-lahu","ʿalīmun","bil-mutaqīna",null],"verseTiming":[[1,0,760],[2,760,1820],[3,1820,2120],[4,2120,3100],[5,3100,4410],[6,4410,8280],[7,8280,9370],[8,9370,11070],[9,11070,14785]]}}