{"name":"3:110","price":"تم بہترین امت ہو جو لوگوں کے لئے پیدا کی گئی ہے کہ تم نیک باتوں کا حکم کرتے ہو اور بری باتوں سے روکتے ہو، اور اللہ تعالیٰ پر ایمان رکھتے ہو(1) ، اگر اہل کتاب بھی ایمان ﻻتے تو ان کے لئے بہتر تھا، ان میں ایمان والے بھی ہیں(2) لیکن اکثر تو فاسق ہیں.","arabic":"كُنتُمۡ خَيۡرَ أُمَّةٍ أُخۡرِجَتۡ لِلنَّاسِ تَأۡمُرُونَ بِٱلۡمَعۡرُوفِ وَتَنۡهَوۡنَ عَنِ ٱلۡمُنكَرِ وَتُؤۡمِنُونَ بِٱللَّهِۗ وَلَوۡ ءَامَنَ أَهۡلُ ٱلۡكِتَٰبِ لَكَانَ خَيۡرٗا لَّهُمۚ مِّنۡهُمُ ٱلۡمُؤۡمِنُونَ وَأَكۡثَرُهُمُ ٱلۡفَٰسِقُونَ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":403,"juzNumber":4,"footnotes":"(1) اس آیت میں امت مسلمہ کو (خیرامت) قرار دیا گیا ہے اور اس کی علت بھی بیان کر دی گئی ہے جو امر بالمعروف ونہی عن المنکر اور ایمان باللہ ہے۔ گویا یہ امت اگر ان امتیازی خصوصیات سے متصف رہے گی تو (خیرامت) ہے، بصورت دیگر اس امتیاز سے محروم قرار پا سکتی ہے۔ اس کے بعد اہل کتاب کی مذمت سے بھی اس نکتے کی وضاحت مقصود معلوم ہوتی ہے کہ جو امربالمعروف ونہی المنکر نہیں کرے گا، وہ بھی اہل کتاب کے مشابہ قرار پائے گا۔ ان کی صفت بیان کی گئی ہے كَانُوا لا يَتَنَاهَوْنَ عَنْ مُنْكَرٍ فَعَلُوهُ ( المائدۃ: 79 ) ”وہ ایک دوسرے کو برائی سے نہیں روکتے تھے“ اور یہاں اسی آیت میں ان کی اکثریت کو فاسق کہا گیا ہے امر بالمعروف یہ فرض عین ہے یا فرض کفایہ؟ اکثر علما کے خیال میں یہ فرض کفایہ ہے یعنی علما کے ذمے داری ہے کہ وہ یہ فرض ادا کرتے رہیں کیونکہ معروف ومنکر شرعی کا صحیح علم وہی رکھتے ہیں۔ ان کے فریضئہ تبلیغ ودعوت کی ادائیگی سے دیگر افراد امت کی طرف سے یہ فرض ساقط ہو جائے گا۔ جیسے جہاد بھی عام حالات میں فرض کفایہ ہے یعنی ایک گروہ کی طرف سے ادائیگی سے اس فرض کی ادائیگی ہو جائے گی۔\n(2) جیسے عبداللہ بن سلام ! وغیرہ جو مسلمان ہو گئے تھے۔ تاہم ان کی تعداد نہایت قلیل تھی۔ اس لئے ”مِنْهُمْ“ میں مِنْ، تَبْعِيض کے لئے ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"kuntum khayra ummatin ukh'rijat lilnnāsi tamurūna bil-maʿrūfi watanhawna ʿani al-munkari watu'minūna bil-lahi walaw āmana ahlu al-kitābi lakāna khayran lahum min'humu al-mu'minūna wa-aktharuhumu al-fāsiqūna ","translations":["You are","(the) best","(of) people","raised","for the mankind ","enjoining","the right","and forbidding","[from]","the wrong","and believing","in Allah","And if","believed","(the) People","(of) the Book","surely would have been","good","for them","Among them","(are) [the] believers","but most of them","(are) defiantly disobedient","(110)"],"transliterationArr":["kuntum","khayra","ummatin","ukh'rijat","lilnnāsi","tamurūna","bil-maʿrūfi","watanhawna","ʿani","al-munkari","watu'minūna","bil-lahi","walaw","āmana","ahlu","al-kitābi","lakāna","khayran","lahum","min'humu","al-mu'minūna","wa-aktharuhumu","al-fāsiqūna",null],"verseTiming":[[1,0,1870],[2,1870,2450],[3,2450,4330],[4,4330,5380],[5,5380,7360],[6,7360,8570],[7,8570,10300],[8,10300,11620],[9,11620,12100],[10,12100,13820],[11,13820,15470],[12,15470,17580],[13,17580,18890],[14,18890,19800],[15,19800,20470],[16,20470,21690],[17,21690,22540],[18,22540,23550],[19,23550,24610],[20,24610,25420],[21,25420,27130],[22,27130,28660],[23,28660,31775]]}}