{"name":"3:118","price":"اے ایمان والو! تم اپنا دلی دوست ایمان والوں کے سوا اور کسی کو نہ بناؤ(1) ۔ (تم تو) نہیں دیکھتے دوسرے لوگ تمہاری تباہی میں کوئی کسر اٹھا نہیں رکھتے، وه تو چاہتے ہیں کہ تم دکھ میں پڑو(2) ان کی عداوت تو خود ان کی زبان سے بھی ﻇاہر ہو چکی ہے اور جو ان کے سینوں میں پوشیده ہے وه بہت زیاده ہے، ہم نے تمہارے لئے آیتیں بیان کر دیں اگر عقلمند ہو (تو غور کرو).","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَّخِذُواْ بِطَانَةٗ مِّن دُونِكُمۡ لَا يَأۡلُونَكُمۡ خَبَالٗا وَدُّواْ مَا عَنِتُّمۡ قَدۡ بَدَتِ ٱلۡبَغۡضَآءُ مِنۡ أَفۡوَٰهِهِمۡ وَمَا تُخۡفِي صُدُورُهُمۡ أَكۡبَرُۚ قَدۡ بَيَّنَّا لَكُمُ ٱلۡأٓيَٰتِۖ إِن كُنتُمۡ تَعۡقِلُونَ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":411,"juzNumber":4,"footnotes":"(1) یہ مضمون پہلے بھی گزرچکا ہے - یہاں اس کی اہمیت کے پیش نظر پھر دہرایا جا رہا ہے۔ بطانہ، دلی دوست اور راز دار کو کہا جاتا ہے۔ کافر اور مشرک مسلمانوں کے بارے میں جو جذبات وعزائم رکھتے ہیں، ان میں سے جن کا وہ اظہار کرتے اور جنہیں اپنے سینوں میں مخفی رکھتے ہیں، اللہ تعالیٰ نے ان سب کی نشاندہی فرما دی ہے یہ اور اس قسم کی دیگر آیات کے پیش نظر ہی علما وفقہا نے تحریر کیا ہے کہ ایک اسلامی مملکت میں غیر مسلموں کو کلیدی مناصب پر فائز کرنا جائز نہیں ہے۔ مروی ہے کہ حضرت ابو موسیٰ اشعری (رضي الله عنه) نے ایک ذمی (غیر مسلم) کو کاتب (سیکرٹری) رکھ لیا، حضرت عمر (رضي الله عنه) کے علم میں یہ بات آئی تو آپ نے انہیں سختی سے ڈانٹا اور فرمایا کہ (تم انہیں اپنے قریب نہ کرو جب کہ اللہ نے انہیں دور کر دیا ہے، ان کو عزت نہ بخشو جب کہ اللہ نے انہیں ذلیل کر دیا ہے اور انہیں امین ورازدار مت بناؤ جب کہ اللہ نے انہیں خائن قراردیا ہے )۔ حضرت عمر (رضي الله عنه) نے اسی آیت سے استدلال کرتے ہوئے یہ ارشاد فرمایا۔ امام قرطبی فرماتے ہیں۔ (اس زمانے میں اہل کتاب کو سیکرٹری اور امین بنانے کی وجہ سے احوال بدل گئے ہیں اور اسی وجہ سے غبی لوگ سردار اور امرا بن گئے ہیں) (تفسیر قرطبی )۔ بدقسمتی سے آج کے اسلامی ممالک میں بھی قرآن کریم کے اس نہایت اہم حکم کو اہمیت نہیں دی جا رہی ہے اور اس کے برعکس غیر مسلم بڑے بڑے اہم عہدوں اور کلیدی مناصب پر فائز ہیں جن کے نقصانات واضح ہیں۔ اگر اسلامی ممالک اپنی داخلی اور خارجی دونوں پالیسیوں میں اس حکم کی رعایت کریں تو یقیناً بہت سے مفاسد اور نقصانات سے محفوظ رہ سکتے ہیں۔\n(2) لا يَأْلُونَ کوتاہی اور کمی نہیں کریں گےخَبَالاکے معنی فساد اور ہلاکت کے ہیں مَا عَنِتُّمْ (جس سے تم مشقت اور تکلیف میں پڑو )عَنَتٌ بمعنی مَشَقّةٍ","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāayyuhā alladhīna āmanū lā tattakhidhū biṭānatan min dūnikum lā yalūnakum khabālan waddū mā ʿanittum qad badati al-baghḍāu min afwāhihim wamā tukh'fī ṣudūruhum akbaru qad bayyannā lakumu al-āyāti in kuntum taʿqilūna ","translations":["O you","who","believe[d]","(Do) not","take","(as) intimates","from","other than yourselves","not","they will spare you","(any) ruin","They wish","what","distresses you","Indeed","(has become) apparent","the hatred","from","their mouths","and what","conceals","their breasts","(is) greater","Certainly","We made clear","for you","the Verses","if","you were","(to use) reason","(118)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","lā","tattakhidhū","biṭānatan","min","dūnikum","lā","yalūnakum","khabālan","waddū","mā","ʿanittum","qad","badati","al-baghḍāu","min","afwāhihim","wamā","tukh'fī","ṣudūruhum","akbaru","qad","bayyannā","lakumu","al-āyāti","in","kuntum","taʿqilūna",null],"verseTiming":[[1,0,3160],[2,3160,4350],[3,4350,5400],[4,5400,5870],[5,5870,7190],[6,7190,8420],[7,8420,10220],[8,10220,11300],[9,11300,11820],[10,11820,13320],[11,13320,15240],[12,15240,15740],[13,15740,17320],[14,17320,19210],[15,19210,20020],[16,20020,20490],[17,20490,21680],[18,21680,22070],[19,22070,22720],[20,22720,25540],[21,25540,25960],[22,25960,27410],[23,27410,28090],[24,28090,28960],[25,28960,30390],[26,30390,31730],[27,31730,32140],[28,32140,33840],[29,33840,34510],[30,34510,36010],[31,36010,36940],[32,36940,38540],[33,38540,41445]]}}