{"name":"3:121","price":"اے نبی! اس وقت کو بھی یاد کرو جب صبح ہی صبح آپ اپنے گھر سے نکل کر مسلمانوں کو میدان جنگ میں لڑائی کے مورچوں پر باقاعده(1) بٹھا رہے تھے اللہ تعالیٰ سننے جاننے واﻻ ہے.","arabic":"وَإِذۡ غَدَوۡتَ مِنۡ أَهۡلِكَ تُبَوِّئُ ٱلۡمُؤۡمِنِينَ مَقَٰعِدَ لِلۡقِتَالِۗ وَٱللَّهُ سَمِيعٌ عَلِيمٌ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":414,"juzNumber":4,"footnotes":"(1) جمہور مفسرین کے نزدیک اس سے مراد جنگ احد کا واقعہ ہے جو شوال ہجری میں پیش آیا۔ اس کا پس منظر مختصراً یہ ہے کہ جب جنگ بدر ہجری میں کفار کو عبرت ناک شکست ہوئی، ان کے ستر آدمی مارے گئے اور ستر قید ہوئے تو ان کفار کے لئے یہ بڑی بدنامی کا باعث اور ڈوب مرنے کا مقام تھا۔ چنانچہ انہوں نے مسلمانوں کے خلاف ایک زبردست انتقامی جنگ کی تیاری کی جس میں عورتیں بھی شریک ہوئیں۔ ادھر مسلمانوں کو جب اس کا علم ہوا کہ کافر تین ہزار کی تعداد میں احد پہاڑ کے قریب خیمہ زن ہوگئے تو نبی کریم (صلى الله عليه وسلم) نے صحابہ (رضي الله عنهم) سے مشورہ کیا کہ وہ مدینہ میں ہی رہ کر لڑیں یا مدینہ سے باہر نکل کرمقابلہ کریں، بعض صحابہ (رضي الله عنهم) نے اندر رہ کر ہی مقابلہ کا مشورہ دیا اور رئیس المنافقین عبداللہ بن ابی نے بھی اسی رائے کا اظہار کیا۔ لیکن اس کے برعکس بعض پرجوش صحابہ (رضي الله عنهم) نے جنہیں جنگ بدر میں حصہ لینے کی سعادت حاصل نہیں ہوئی تھی، مدینہ سے باہر جاکر لڑنے کی حمایت کی۔ آپ (صلى الله عليه وسلم) اندر حجرے میں تشریف ہتھیار پہن کرباہر آئے، دوسری رائے والوں کوندامت ہوئی کہ شاید ہم نے رسول اللہ (صلى الله عليه وسلم) کو آپ کی خواہش کے برعکس باہر نکلنے پر مجبور کرکے ٹھیک نہیں کیا چنانچہ انہوں نے کہا یا رسول اللہ! (صلى الله عليه وسلم) آپ اگر اندر رہ کر مقابلہ کرنا پسند فرمائیں تو اندر ہی رہیں۔ آپ (صلى الله عليه وسلم) نے فرمایا کہ لباس حرب پہن لینے کے بعد کسی نبی کے لائق نہیں ہے کہ وہ اللہ کے فیصلے کے بغیر واپس ہو یا لباس اتارے۔ چنانچہ مسلمان ایک ہزار کی تعداد میں روانہ ہوگئے مگر صبح دم جب مقام شوط پر پہنچے توعبداللہ بن ابی اپنے تین سوساتھیوں سمیت یہ کہہ کر واپس آگیا کہ اس کی رائے نہیں مانی گئی۔ خواہ مخواہ جان دینے کا کیا فائدہ؟ اس کے اس فیصلے سے وقتی طور پر بعض مسلمان بھی متاثر ہوگئے اور انہوں نے بھی کمزوری کا مظاہرہ کیا۔ (ابن کثیر )","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-idh ghadawta min ahlika tubawwi-u al-mu'minīna maqāʿida lil'qitāli wal-lahu samīʿun ʿalīmun ","translations":["And when","you left early morning","from","your household","to post","the believers","(to take) positions","for the battle","And Allah","(is) All-Hearing","All-Knowing","(121)"],"transliterationArr":["wa-idh","ghadawta","min","ahlika","tubawwi-u","al-mu'minīna","maqāʿida","lil'qitāli","wal-lahu","samīʿun","ʿalīmun",null],"verseTiming":[[1,0,720],[2,720,1640],[3,1640,2010],[4,2010,2860],[5,2860,3890],[6,3890,5420],[7,5420,6630],[8,6630,9040],[9,9040,10360],[10,10360,11500],[11,11500,13745]]}}