{"name":"3:128","price":"اے پیغمبر! آپ کے اختیار میں کچھ نہیں(1) ، اللہ تعالیٰ چاہے تو ان کی توبہ قبول کرے(2) یا عذاب دے، کیونکہ وه ﻇالم ہیں.","arabic":"لَيۡسَ لَكَ مِنَ ٱلۡأَمۡرِ شَيۡءٌ أَوۡ يَتُوبَ عَلَيۡهِمۡ أَوۡ يُعَذِّبَهُمۡ فَإِنَّهُمۡ ظَٰلِمُونَ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":421,"juzNumber":4,"footnotes":"(1) یعنی ان کافروں کو ہدایت دینا یا ان کے معاملے میں کسی بھی قسم کا فیصلہ کرنا سب اللہ کے اختیار میں ہے۔ احادیث میں آتا ہے کہ جنگ احد میں نبی کریم (صلى الله عليه وسلم) کے دندان مبارک بھی شہید ہوگئے اور چہرہ مبارک بھی زخمی ہوا تو آپ (صلى الله عليه وسلم) نے فرمایا ”وہ قوم کس طرح فلاح یاب ہوگی جس نے اپنے نبی کو زخمی کر دیا“، گویا آپ (صلى الله عليه وسلم) نے ان کی ہدایت سے ناامیدی ظاہر فرمائی۔ اس پر یہ آیت نازل ہوئی۔ اسی طرح بعض روایات میں آتا ہے کہ آپ (صلى الله عليه وسلم) نے بعض کفار کے لئے قنوت نازلہ کا بھی اہتمام فرمایا جس میں ان کے لئے بددعا فرمائی جس پر اللہ تعالیٰ نے یہ آیت نازل فرمائی،چنانچہ آپ (صلى الله عليه وسلم) نے بددعا کا سلسلہ بند فرما دیا۔ (ابن کثیر وفتح القدیر) اس آیت سے ان لوگوں کو عبرت پکڑنی چاہیئے جو نبی کریم (صلى الله عليه وسلم) کو مختار کل قراردیتے ہیں کہ آپ (صلى الله عليه وسلم) کو تو اتنا اختیار بھی نہ تھا کہ کسی کو راہ راست پر لگا دیں حالانکہ آپ (صلى الله عليه وسلم) اسی راستے کی طرف بلانے کے لئے بھیجے گئے تھے۔\n(2) یہ قبیلےجن کے لئے بددعا فرماتے رہے اللہ کی توفیق سے سب مسلمان ہوگئے۔ جن سے معلوم ہوا کہ مختار کل اور عالم الغیب صرف اللہ تعالیٰ ہی ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"laysa laka mina al-amri shayon aw yatūba ʿalayhim aw yuʿadhibahum fa-innahum ẓālimūna ","translations":["Not","for you","of","the decision","(of) anything","whether","He turns","to them","or","punishes them","for indeed, they","(are) wrongdoers","(128)"],"transliterationArr":["laysa","laka","mina","al-amri","shayon","aw","yatūba","ʿalayhim","aw","yuʿadhibahum","fa-innahum","ẓālimūna",null],"verseTiming":[[1,0,830],[2,830,1260],[3,1260,1600],[4,1600,2520],[5,2520,3390],[6,3390,3780],[7,3780,4690],[8,4690,5860],[9,5860,6190],[10,6190,7780],[11,7780,9660],[12,9660,13295]]}}