{"name":"3:120","price":"تمہیں اگر بھلائی ملے تو یہ ناخوش ہوتے ہیں ہاں! اگر برائی پہنچے تو خوش ہوتے ہیں(1) ، تم اگر صبر کرو اور پرہیزگاری کرو تو ان کا مکر تمہیں کچھ نقصان نہ دے گا(2)۔ اللہ تعالیٰ نے انکے اعمال کا احاطہ کر رکھا ہے.","arabic":"إِن تَمۡسَسۡكُمۡ حَسَنَةٞ تَسُؤۡهُمۡ وَإِن تُصِبۡكُمۡ سَيِّئَةٞ يَفۡرَحُواْ بِهَاۖ وَإِن تَصۡبِرُواْ وَتَتَّقُواْ لَا يَضُرُّكُمۡ كَيۡدُهُمۡ شَيۡـًٔاۗ إِنَّ ٱللَّهَ بِمَا يَعۡمَلُونَ مُحِيطٞ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":413,"juzNumber":4,"footnotes":"(1) اس میں منافقین کی اس شدید عداوت کا ذکر ہے جو انہیں مومنوں کے ساتھ تھی اور وہ یہ کہ جب مسلمانوں کو خوش حالی میسر آتی،اللہ تعالیٰ کی طرف سے ان کو تائید ونصرت ملتی اورمسلمانوں کی تعداد وقوت میں اضافہ ہوتا تومنافقین کو بہت برا لگتا اور اگر مسلمان قحط سالی یا تنگدستی میں مبتلا ہوتے، یا اللہ کی مشیت ومصلحت سے دشمن، وقتی طور پرمسلمانوں پر غالب آجاتے (جیسے جنگ احد میں ہوا) تو بڑے خوش ہوتے۔ مقصدبتلانے کا یہ ہے کہ جن لوگوں کا یہ حال ہو، کیا وہ اس لائق ہو سکتے ہیں کہ مسلمان ان سے محبت کی پینگیں بڑھائیں اور انہیں اپنا رازدان اوردوست بنائیں ؟ اسی لئے اللہ تعالیٰ نے یہود ونصاریٰ سے بھی دوستی رکھنے سے منع فرمایا ہے (جیسا کہ قرآن کریم کے دوسرے مقامات پر ہے) اسی لئے وہ بھی مسلمانوں سے نفرت وعداوت رکھتے، ان کی کامیابیوں سے ناخوش اور ان کی ناکامیوں سے خوش ہوتے ہیں۔\n(2) یہ ان کے مکروفریب سے بچنے کا طریقہ اور علاج ہے۔ گویامنافقین اور دیگر اعدائے اسلام ومسلمین کی سازشوں سے بچنے کے لئے صبر اور تقویٰ نہایت ضروری ہے۔ اس صبر اور تقویٰ کے فقدان نے غیر مسلموں کی سازشوں کو کامیاب بنا رکھا ہے۔ لوگ سمجھتے ہیں کہ کافروں کی یہ کامیابی مادی اسباب ووسائل کی فراوانی اور سائنس وٹیکنالوجی میں ان کی ترقی کا نتیجہ ہے۔ حالانکہ واقعہ یہ ہے کہ مسلمانوں کی پستی وزوال کا اصل سبب یہی ہے کہ وہ اپنے دین پر استقامت (جو صبر کا متقاضی ہے) سے محروم اور تقویٰ سے عاری ہوگئے ہیں جو مسلمان کی کامیابی کی کلید اور تائید الٰہی کے حصول کا ذریعہ ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"in tamsaskum ḥasanatun tasu'hum wa-in tuṣib'kum sayyi-atun yafraḥū bihā wa-in taṣbirū watattaqū lā yaḍurrukum kayduhum shayan inna al-laha bimā yaʿmalūna muḥīṭun ","translations":["If","touches you","a good","it grieves them","and if","strikes you","misfortune","they rejoice","at it","And if","you are patient","and fear (Allah)","not","will harm you","their plot","(in) anything","Indeed","Allah","of what","they do","(is) All-Encompassing","(120)"],"transliterationArr":["in","tamsaskum","ḥasanatun","tasu'hum","wa-in","tuṣib'kum","sayyi-atun","yafraḥū","bihā","wa-in","taṣbirū","watattaqū","lā","yaḍurrukum","kayduhum","shayan","inna","al-laha","bimā","yaʿmalūna","muḥīṭun",null],"verseTiming":[[1,0,1180],[2,1180,2550],[3,2550,4470],[4,4470,5660],[5,5660,6460],[6,6460,7730],[7,7730,8950],[8,8950,10990],[9,10990,11760],[10,11760,13400],[11,13400,14600],[12,14600,15930],[13,15930,16380],[14,16380,17760],[15,17760,18870],[16,18870,19910],[17,19910,21360],[18,21360,22280],[19,22280,23090],[20,23090,24420],[21,24420,26985]]}}