{"name":"3:127","price":"(اس امداد الٰہی کا مقصد یہ تھا کہ اللہ) کافروں کی ایک جماعت کو کاٹ دے یا انہیں ذلیل کر ڈالے اور (سارے کے سارے) نامراد ہو کر واپس چلے جائیں.(1)","arabic":"لِيَقۡطَعَ طَرَفٗا مِّنَ ٱلَّذِينَ كَفَرُوٓاْ أَوۡ يَكۡبِتَهُمۡ فَيَنقَلِبُواْ خَآئِبِينَ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":420,"juzNumber":4,"footnotes":"(1) یہ اللہ غالب وکار فرما کی مدد کا نتیجہ بتلایا جا رہا ہے۔ سورۂ انفال میں فرشتوں کی تعداد ایک ہزار بتلائی گئی ہے - «إِذْ تَسْتَغِيثُونَ رَبَّكُمْ فَاسْتَجَابَ لَكُمْ أَنِّي مُمِدُّكُمْ بِأَلْفٍ مِنَ الْمَلائِكَةِ»( الانفال: 9) ”جب تم اپنے رب سے مدد طلب کر رہے تھے، اللہ تعالیٰ نے تمہاری فریاد سنتے ہوئے کہا کہ میں ایک ہزار فرشتوں سے تمہاری مدد کروں گا“، ان الفاظ سے معلوم ہوتا ہے کہ فرشتے واقعتاً ایک ہزار ہی نازل ہوئے اور مسلمانوں کے حوصلے اور تسلی کے لئے تین ہزار کا اور پھر پانچ ہزار کا مزید مشروط وعدہ کیا گیا۔ پھر حسب حالات مسلمانوں کی تسلی کے نقطہ نظر سے بھی ان کی ضرورت نہیں سمجھی گئی۔ اس لئے بعض مفسرین کے نزدیک یہ تین ہزار پانچ ہزار فرشتوں کا نزول نہیں ہوا کیونکہ مقصد تو مسلمانوں کے حوصلوں میں اضافہ کرنا تھا، ورنہ اصل مددگار تو اللہ تعالیٰ ہی تھا اور وہ اپنی مدد کے لئے فرشتوں کا یا کسی اور کامحتاج ہی نہیں ہے۔ چنانچہ اس نے مسلمانوں کی مدد فرمائی اور جنگ بدر میں مسلمانوں کو تاریخی کامیابی حاصل ہوئی، کفر کی طاقت کمزور ہوئی اور کافروں کا گھمند خاک میں مل گیا۔ (ایسر التفاسیر)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"liyaqṭaʿa ṭarafan mina alladhīna kafarū aw yakbitahum fayanqalibū khāibīna ","translations":["That He may cut off","a part","of","those who","disbelieved","or","suppress them","so (that) they turn back","disappointed","(127)"],"transliterationArr":["liyaqṭaʿa","ṭarafan","mina","alladhīna","kafarū","aw","yakbitahum","fayanqalibū","khāibīna",null],"verseTiming":[[1,0,1220],[2,1220,1870],[3,1870,2870],[4,2870,3990],[5,3990,6130],[6,6130,6510],[7,6510,7920],[8,7920,9840],[9,9840,14325]]}}