{"name":"3:13","price":"یقیناً تمہارے لئے عبرت کی نشانی تھی ان دو جماعتوں میں جو گتھ گئی تھیں، ایک جماعت تو اللہ تعالیٰ کی راه میں لڑ رہی تھی اور دوسرا گروه کافروں کا تھا وه انہیں اپنی آنکھوں سے اپنے سے دگنا دیکھتے تھے(1) اور اللہ تعالیٰ جسے چاہے اپنی مدد سے قوی کرتا ہے۔ یقیناً اس میں آنکھوں والوں کے لئے بڑی عبرت ہے۔","arabic":"قَدۡ كَانَ لَكُمۡ ءَايَةٞ فِي فِئَتَيۡنِ ٱلۡتَقَتَاۖ فِئَةٞ تُقَٰتِلُ فِي سَبِيلِ ٱللَّهِ وَأُخۡرَىٰ كَافِرَةٞ يَرَوۡنَهُم مِّثۡلَيۡهِمۡ رَأۡيَ ٱلۡعَيۡنِۚ وَٱللَّهُ يُؤَيِّدُ بِنَصۡرِهِۦ مَن يَشَآءُۚ إِنَّ فِي ذَٰلِكَ لَعِبۡرَةٗ لِّأُوْلِي ٱلۡأَبۡصَٰرِ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":306,"juzNumber":3,"footnotes":"(1) یعنی ہر فریق، دوسرے فریق کو اپنے سے دوگنا دیکھتا تھا۔ کافروں کی تعداد ایک ہزار کے قریب تھی، انہیں مسلمان دو ہزار کے قریب دکھائی دیتے تھے۔ مقصد اس سے ان کے دلوں میں مسلمانوں کی دھاک بٹھانا تھا۔ اور مسلمانوں کی تعداد تین سو سے کچھ اوپر (یا 313 ) تھی، انہیں کافر 600 اور 700 کے درمیان نظر آتے تھے۔ دراں حالیکہ ان کی اصل تعداد ہزار کے قریب (تین گنا) تھی مقصد اس سے مسلمانوں کے عزم وحوصلہ میں اضافہ کرنا تھا۔ اپنے سے تین گنا دیکھ کر ممکن تھا مسلمان مرعوب ہو جاتے۔ جب وہ تین گنا کے بجائے دو گنا نظر آئےتو ان کا حوصلہ پست نہیں ہوا۔ لیکن یہ دگنا دیکھنے کی کیفیت ابتدا میں تھی، پھر جب دونوں گروہ آمنے سامنے صف آرا ہو گئے تو اللہ تعالیٰ نے اس کے برعکس دونوں کو ایک دوسرے کی نظروں میں کم کرکے دکھایا تاکہ کوئی بھی فریق لڑائی سے گریز نہ کرے بلکہ ہر ایک پیش قدمی کی کوشش کرے (ابن کثیر) یہ تفصیل سورۃ الانفال۔ آیت 44 میں بیان کی گئی ہے۔ یہ جنگ بدر کا واقعہ ہے جو ہجرت کے بعد دوسرے سال مسلمانوں اور کافروں کے درمیان پیش آیا۔ یہ کئی لحاظ سے نہایت اہم جنگ تھی۔ ایک تو اس لیے کہ یہ پہلی جنگ تھی۔ دوسرے، یہ جنگی منصوبہ بندی کے بغیر ہوئی۔ مسلما ن ابو سفیان کے قافلے کے لئے نکلے تھے جو شام سے سامان تجارت لے کر مکہ جا رہا تھا، مگر اطلاع مل جانے کی وجہ سے وہ اپنا قافلہ تو بچا کر لے گیا، لیکن کفار مکہ اپنی طاقت وکثرت کے گھمنڈ میں مسلمانوں پر چڑھ دوڑے اور مقام بدر میں یہ پہلا معرکہ برپا ہوا۔ تیسرے، اس میں مسلمانوں کو اللہ تعالیٰ کی خصوصی مدد حاصل ہوئی، چوتھے، اس میں کافروں کو عبرت ناک شکست ہوئی، جس سے آئندہ کے لئے کافروں کے حوصلے پست ہوگئے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qad kāna lakum āyatun fī fi-atayni al-taqatā fi-atun tuqātilu fī sabīli al-lahi wa-ukh'rā kāfiratun yarawnahum mith'layhim raya al-ʿayni wal-lahu yu-ayyidu binaṣrihi man yashāu inna fī dhālika laʿib'ratan li-ulī al-abṣāri ","translations":["Surely","it was","for you","a sign","in","(the) two hosts","which met ","one group","fighting","in","(the) way","(of) Allah","and another","disbelievers","They were seeing them","twice of them","with the sight","(of) their eyes","And Allah","supports","with His help","whom","He wills","Indeed","in","that","surely (is) a lesson","for the owners","(of) vision","(13)"],"transliterationArr":["qad","kāna","lakum","āyatun","fī","fi-atayni","al-taqatā","fi-atun","tuqātilu","fī","sabīli","al-lahi","wa-ukh'rā","kāfiratun","yarawnahum","mith'layhim","raya","al-ʿayni","wal-lahu","yu-ayyidu","binaṣrihi","man","yashāu","inna","fī","dhālika","laʿib'ratan","li-ulī","al-abṣāri",null],"verseTiming":[[1,0,430],[2,430,990],[3,990,1670],[4,1670,2830],[5,2830,3780],[6,3780,4850],[7,4850,6030],[8,6030,7890],[9,7890,9080],[10,9080,9420],[11,9420,10570],[12,10570,11160],[13,11160,12190],[14,12190,13320],[15,13320,15080],[16,15080,16830],[17,16830,17460],[18,17460,19910],[19,19910,20940],[20,20940,22020],[21,22020,23220],[22,23220,23840],[23,23840,27390],[24,27390,28270],[25,28270,28710],[26,28710,29560],[27,29560,30550],[28,30550,31360],[29,31360,34715]]}}