{"name":"3:137","price":"تم سے پہلے بھی ایسے واقعات گزر چکے ہیں، سو زمین میں چل پھر کر دیکھ لو کہ (آسمانی تعلیم کے) جھٹلانے والوں کا کیا انجام ہوا؟(1)","arabic":"قَدۡ خَلَتۡ مِن قَبۡلِكُمۡ سُنَنٞ فَسِيرُواْ فِي ٱلۡأَرۡضِ فَٱنظُرُواْ كَيۡفَ كَانَ عَٰقِبَةُ ٱلۡمُكَذِّبِينَ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":430,"juzNumber":4,"footnotes":"(1) جنگ احد میں مسلمانوں کا لشکر سات سو افراد پر مشتمل تھا، جس میں سے تیر اندازوں کا ایک دستہ آپ نے عبداللہ ابن جبیر (رضي الله عنه) کی قیادت میں ایک پہاڑی پر مقرر فرما دیا اور انہیں تاکید کر دی کہ چاہے ہمیں فتح ہو یا شکست، تم یہاں سے نہ ہلنا اور تمہارا کام یہ ہے کہ جو گھڑ سوار تمہاری طرف آئے تیروں سے اسے پیچھے دھکیل دینا۔ لیکن جب مسلمان فتح یاب ہوگئے اور مال واسباب سمیٹنے لگے تو اس دستے میں اختلاف ہوگیا۔ کچھ کہنے لگے کہ نبی (صلى الله عليه وسلم) کے فرمان کا مقصد تو یہ تھا کہ جب تک جنگ جاری رہے یہیں جمے رہنا، لیکن جب یہ جنگ ختم ہوگئی ہے اور کفار بھاگ رہے ہیں تو یہاں رہنا ضروری نہیں۔ چنانچہ انہوں نے بھی وہاں سے ہٹ کر مال واسباب جمع کرنا شروع کر دیا اور وہاں نبی کریم (صلى الله عليه وسلم) کے فرمان کی اطاعت میں صرف دس آدمی باقی رہ گئے۔ جس سے کافروں نے فائدہ اٹھایا اور ان کے گھڑ سوار پلٹ کر وہیں سے مسلمانوں کے عقب میں جا پہنچے اور ان پر اچانک حملہ کر دیا جس سے مسلمانوں میں افراتفری مچ گئی اور وہ غیر متوقع حملے سے سخت سراسیمہ ہوگئے جس سے مسلمانوں کو قدرتی طور پر بہت تکلیف ہوئی۔ ان آیات میں اللہ تعالیٰ مسلمانوں کو تسلی دے رہا ہے کہ تمہارے ساتھ جو کچھ ہوا ہے، کوئی نئی بات نہیں ہے۔ پہلے بھی ایسا ہوتا آیا ہے۔ تاہم بالآخر تباہی وبربادی اللہ ورسول کی تکذیب کرنے والوں کا ہی مقدر بنی ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qad khalat min qablikum sunanun fasīrū fī al-arḍi fa-unẓurū kayfa kāna ʿāqibatu al-mukadhibīna ","translations":["Verily","passed","from","before you","situations","then travel","in","the earth","and see","how","was","(the) end","(of) the deniers","(137)"],"transliterationArr":["qad","khalat","min","qablikum","sunanun","fasīrū","fī","al-arḍi","fa-unẓurū","kayfa","kāna","ʿāqibatu","al-mukadhibīna",null],"verseTiming":[[1,0,520],[2,520,1270],[3,1270,2340],[4,2340,3300],[5,3300,4880],[6,4880,6000],[7,6000,6260],[8,6260,7150],[9,7150,8880],[10,8880,9620],[11,9620,10190],[12,10190,11290],[13,11290,14575]]}}