{"name":"3:130","price":"اے ایمان والو! بڑھا چڑھا کر سود نہ کھاؤ(1) ، اور اللہ تعالیٰ سے ڈرو تاکہ تمہیں نجات ملے.","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَأۡكُلُواْ ٱلرِّبَوٰٓاْ أَضۡعَٰفٗا مُّضَٰعَفَةٗۖ وَٱتَّقُواْ ٱللَّهَ لَعَلَّكُمۡ تُفۡلِحُونَ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":423,"juzNumber":4,"footnotes":"(1) چونکہ غزوہ احد میں ناکامی رسول (صلى الله عليه وسلم) کی نافرمانی اور مال دنیا کے لالچ کے سبب ہوئی تھی اس لئے اب طمع دنیا کی سب سے زیادہ بھیانک اور مستقل شکل سود سے منع کیا جا رہا ہے اور اطاعت کیشی کی تاکید کی جا رہی ہےاور بڑھا چڑھا کر سود نہ کھاؤکا یہ مطلب نہیں بڑھا چڑھا کر نہ ہو تو مطلق سود جائز ہے۔ بلکہ سود کم ہو یا زیادہ مفرد ہو یا مرکب، مطلقاً حرام ہے جیسا کہ پہلے گزر چکا ہے۔ یہ قید نہی (حرمت) کے لئے بطور شرط نہیں ہے بلکہ واقعے کی رعایت کے طور پر یعنی سود کی اس وقت جو صورتحال تھی، اس کا بیان واظہار ہے۔ زمانہ جاہلیت میں سود کا یہ رواج عام تھا کہ جب ادائیگی کی مدت آجاتی اور ادائیگی ممکن نہ ہوتی تو مزید مدت میں اضافے کے ساتھ سود میں بھی اضافہ ہوتا چلا جاتا جس کی وجہ سے تھوڑی سی رقم بڑھ چڑھ کر کہیں پہنچ جاتی اور ایک عام آدمی کے لئے اس کی ادائیگی ناممکن ہو جاتی۔ اللہ تعالیٰ نے فرمایا کہ اللہ سے درو اور اس آگ سے درو جو کافروں کے لئے تیار کی گئی ہے جس سے تنبیہ بھی مقصود ہے کہ سود خوری سے باز نہ آئے تو یہ فعل حرام تمہیں کفر تک پہنچا سکتاہے،کیونکہ یہ اللہ ورسول سے محاربہ ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāayyuhā alladhīna āmanū lā takulū al-riba aḍʿāfan muḍāʿafatan wa-ittaqū al-laha laʿallakum tuf'liḥūna ","translations":["O you","who","believe","(Do) not","eat","the usury","doubled","multiplied","And fear","Allah","so that you may","(be) successful","(130)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","lā","takulū","al-riba","aḍʿāfan","muḍāʿafatan","wa-ittaqū","al-laha","laʿallakum","tuf'liḥūna",null],"verseTiming":[[1,0,3150],[2,3150,4070],[3,4070,5170],[4,5170,5570],[5,5570,6410],[6,6410,8530],[7,8530,9650],[8,9650,12380],[9,12380,13070],[10,13070,13860],[11,13860,15150],[12,15150,17915]]}}