{"name":"3:143","price":"جنگ سے پہلے تو تم شہادت کی آرزو میں تھے(1) اب اسے اپنی آنکھوں سے اپنے سامنے دیکھ لیا.(2)","arabic":"وَلَقَدۡ كُنتُمۡ تَمَنَّوۡنَ ٱلۡمَوۡتَ مِن قَبۡلِ أَن تَلۡقَوۡهُ فَقَدۡ رَأَيۡتُمُوهُ وَأَنتُمۡ تَنظُرُونَ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":436,"juzNumber":4,"footnotes":"(1) یہ اشارہ ان صحابہ (رضي الله عنهم) کی طرف ہے جو جنگ بدر میں شریک نہ ہونے کی وجہ سے ایک احساس محرومی رکھتے تھے اور چاہتے تھے کہ میدان کار زار گرم ہو تو وہ بھی کافروں کی سرکوبی کرکے جہاد کی فضیلت حاصل کریں۔ انہی صحابہ (رضي الله عنهم) نے جنگ احد میں جوش جہاد سے کام لیتے ہوئے مدینہ سے باہر نکلنے کا مشورہ دیا تھا۔ لیکن جب مسلمانوں کی فتح، کافروں کے اچانک حملے سے شکست میں تبدیل ہو گئی (جس کی تفصیل پہلے گزر چکی) تو یہ پرجوش مجاہدین بھی سراسیمگی کا شکار ہوگئے اور بعض نے راہ فرار اختیار کی۔ (جیسا کہ آگے تفصیل آئے گی) اور بہت تھوڑے لوگ ہی ثابت قدم رہے۔ (فتح القدیر) اسی لئے حدیث میں آتا ہے کہ تم دشمن سے مدھ بھیڑ کی آرزو مت کرو اللہ سے عافیت طلب کیا کرو تاہم جب ازخود حالات ایسے بن جائیں کہ تمہیں دشمن سے لڑنا پڑ جائے تو پھر ثابت قدم رہو اور یہ بات جان لو کہ جنت تلواروں کے سائے تلے ہے (صحیحین بحوالہ ابن کثیر )\n(2) رَأَيْتُمُوهُ اور تَنْظُرُونَ۔ دونوں کے ایک ہی معنی یعنی دیکھنے کے ہیں۔ تاکید اور مبالغے کے لئے دو لفظ لائے گئے ہیں۔ یعنی تلواروں کی چمک، نیزوں کی تیزی، تیروں کی یلغار اور جاں بازوں کی صف آرائی میں تم نے موت کا خوب مشاہدہ کر لیا۔ (ابن كثير وفتح القدير)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walaqad kuntum tamannawna al-mawta min qabli an talqawhu faqad ra-aytumūhu wa-antum tanẓurūna ","translations":["And certainly","you used to","wish","(for) death","from","before","[that]","you met it","then indeed","you have seen it","while you (were)","looking on","(143)"],"transliterationArr":["walaqad","kuntum","tamannawna","al-mawta","min","qabli","an","talqawhu","faqad","ra-aytumūhu","wa-antum","tanẓurūna",null],"verseTiming":[[1,0,950],[2,950,2620],[3,2620,4740],[4,4740,5760],[5,5760,7020],[6,7020,7660],[7,7660,8710],[8,8710,9930],[9,9930,10520],[10,10520,13750],[11,13750,14790],[12,14790,16570],[13,16570,18210],[14,18210,21815]]}}