{"name":"3:14","price":"مرغوب چیزوں کی محبت لوگوں کے لئے مزین کر دی گئی ہے، جیسے عورتیں اور بیٹے اور سونے اور چاندی کے جمع کئے ہوئے خزانے اور نشاندار گھوڑے اور چوپائے اور کھیتی(1) ، یہ دنیا کی زندگی کا سامان ہے اور لوٹنے کا اچھا ٹھکانا تو اللہ تعالیٰ ہی کے پاس ہے۔","arabic":"زُيِّنَ لِلنَّاسِ حُبُّ ٱلشَّهَوَٰتِ مِنَ ٱلنِّسَآءِ وَٱلۡبَنِينَ وَٱلۡقَنَٰطِيرِ ٱلۡمُقَنطَرَةِ مِنَ ٱلذَّهَبِ وَٱلۡفِضَّةِ وَٱلۡخَيۡلِ ٱلۡمُسَوَّمَةِ وَٱلۡأَنۡعَٰمِ وَٱلۡحَرۡثِۗ ذَٰلِكَ مَتَٰعُ ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۖ وَٱللَّهُ عِندَهُۥ حُسۡنُ ٱلۡمَـَٔابِ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":307,"juzNumber":3,"footnotes":"(1) شَهَوَاتٌ سے مراد یہاں مُشْتَهَيَاتٌ ہیں یعنی وہ چیزیں جوطبعی طور پر انسان کو مرغوب اورپسندیدہ ہیں۔ اسی لئے ان میں رغبت اور ان کی محبت ناپسندیدہ نہیں ہے۔ بشرطیکہ اعتدال کے اندر اور شریعت کے دائرے میں رہے۔ ان کی تزیین بھی اللہ کی طرف سے بطور آزمائش ہے۔ «إِنَّا جَعَلْنَا مَا عَلَى الأَرْضِ زِينَةً لَهَا لِنَبْلُوَهُمْ» (الكهف: 7) ”ہم نے زمین پر جو کچھ ہے، اسے زمین کی زینت بنایاہے تاکہ ہم لوگوں کو آزمائیں“ سب سے پہلے عورت کا ذکر کیا ہے کیونکہ یہ ہر بالغ انسان کی سب سے بڑی ضرورت بھی ہے اور سب سے زیادہ مرغوب بھی۔ خود نبی (صلى الله عليه وسلم) کا فرمان ہے: ”حُبِّبَ إِلَيَّ النِّسَاءُ وَالطِّيبُ“ (مسند احمد) ”عورت اور خوشبو مجھے محبوب ہیں“۔ اسی طرح نبی (صلى الله عليه وسلم) نے نیک عورت کو ”دنیا کی سب سے بہتر متاع“ قرار دیا ہے ”خَيْرُ مَتَاعِ الدُّنْيَا الْمَرْأَةُ الصَّالِحَةُ“ اس لئے اس کی محبت شریعت کے دائرے سے تجاوز نہ کرے تو یہ بہترین رفیق زندگی بھی ہے اور زاد آخرت بھی۔ ورنہ یہی عورت مرد کے لئے سب سے بڑا فتنہ ہے۔ فرمان رسول (صلى الله عليه وسلم) ہے: ”مَا تَرَكْتُ بَعْدِي فِتْنَةً أَضَرَّ عَلَى الرِّجِالِ مِنَ النِّسَاءِ“ (صحيح بخاري كتاب النكاح، باب ما يتقى من شؤم المرأة)(میرے بعد جو فتنے رونما ہوں گے، ان میں مردوں کے لئے سب سے بڑا فتنہ عورتوں کا ہے۔) اسی طرح بیٹوں کی محبت ہے۔ اگر اس سے مقصد مسلمانوں کی قوت میں اضافہ اور بقا وتکثیر نسل ہے تو محمود ہے ورنہ مذموم۔ نبی (صلى الله عليه وسلم) کا فرمان ہے ”تَزَوَّجُوا الوَدُودَ الْوَلُودَ؛ فَإِنِّي مُكَاثِرٌ بِكُمُ الأُمَمَ يَوْمَ الْقِيَامَةِ“ (بہت محبت کرنے والی اور زیادہ بچے جننے والی عورت سے شادی کرو، اس لئے کہ میں قیامت والے دن دوسری امتوں کے مقابلے میں اپنی امت کی کثرت پر فخر کروں گا) اس آیت سے رھبانیت کی تردیداور تحریک خاندانی منصوبہ بندی کی تردید بھی ثابت ہوتی ہے کیونکہ بَنِينٌ جمع ہے۔ مال ودولت سے بھی مقصود قیام معیشت، صلۂ رحمی، صدقہ وخیرات اور اسے امور خیر میں خرچ کرنا اور سوال سے بچنا ہے تاکہ اللہ کی رضا حاصل ہو، تو اس کی محبت بھی عین مطلوب ہے ورنہ مذموم۔ گھوڑوں سے مقصد جہاد کی تیاری، دیگر جانوروں سے کھیتی باڑی اور باربرداری کا کام لینا اور زمین سےاس کی پیداوار حاصل کرنا ہو تو یہ سب پسندیدہ ہیں اور اگر مقصود محض دنیا کمانا اور پھر اس پرفخر وغرور کا اظہار کرنا اور یاد الٰہی سے غافل ہو کر عیش وعشرت سے زندگی گزارنا ہے تو یہ سب مفید چیزیں اس کے لئے وبال جان ثابت ہوں گی۔ قَنَاطِيرُ قِنْطَارٌ (خزانہ) کی جمع ہے۔ مراد ہے خزانے یعنی سونے چاندی اورمال ودولت کی فراوانی اور کثرت۔ االمُسَوَّمَةِ وہ گھوڑے جو چراگاہ میں چرنے کے لئے چھوڑے گئے ہوں۔ یاجہاد کےلئے تیار کئے گئے ہوں یا نشان زدہ، جن پر امتیاز کے لئے کوئی نشان یانمبرلگادیا جائے (فتح القدیر وابن کثیر)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"zuyyina lilnnāsi ḥubbu al-shahawāti mina al-nisāi wal-banīna wal-qanāṭīri al-muqanṭarati mina al-dhahabi wal-fiḍati wal-khayli al-musawamati wal-anʿāmi wal-ḥarthi dhālika matāʿu al-ḥayati al-dun'yā wal-lahu ʿindahu ḥus'nu al-maābi ","translations":["Beautified","for mankind","(is) love","(of) the (things they) desire ","of","[the] women","and [the] sons","and [the] heaps","[the] stored up","of","[the] gold","and [the] silver","and [the] horses","[the] branded","and [the] cattle","and [the] tilled land","That","(is) provision","(of) life","(of) the world","but Allah ","with Him","(is an) excellent","[the] abode to return","(14)"],"transliterationArr":["zuyyina","lilnnāsi","ḥubbu","al-shahawāti","mina","al-nisāi","wal-banīna","wal-qanāṭīri","al-muqanṭarati","mina","al-dhahabi","wal-fiḍati","wal-khayli","al-musawamati","wal-anʿāmi","wal-ḥarthi","dhālika","matāʿu","al-ḥayati","al-dun'yā","wal-lahu","ʿindahu","ḥus'nu","al-maābi",null],"verseTiming":[[1,0,1020],[2,1020,2490],[3,2490,3080],[4,3080,4410],[5,4410,4670],[6,4670,8040],[7,8040,9240],[8,9240,10880],[9,10880,13050],[10,13050,13350],[11,13350,14250],[12,14250,15460],[13,15460,16530],[14,16530,17950],[15,17950,19390],[16,19390,20460],[17,20460,21870],[18,21870,22720],[19,22720,23830],[20,23830,25000],[21,25000,26340],[22,26340,27940],[23,27940,28690],[24,28690,31035]]}}