{"name":"3:144","price":"(حضرت) محمد ﴿صلی اللہ علیہ وسلم﴾ صرف رسول ہی ہیں(1) ، ان سے پہلے بہت سے رسول ہو چکے ہیں، کیا اگر ان کا انتقال ہو جائے یا یہ شہید ہو جائیں، تو تم اسلام سے اپنی ایڑیوں کے بل پھر جاؤ گے؟ اور جو کوئی پھر جائے اپنی ایڑیوں پر تو ہرگز اللہ تعالیٰ کا کچھ نہ بگاڑے گا(2)، عنقریب اللہ تعالیٰ شکر گزاروں کو نیک بدلہ دے گا.(3)","arabic":"وَمَا مُحَمَّدٌ إِلَّا رَسُولٞ قَدۡ خَلَتۡ مِن قَبۡلِهِ ٱلرُّسُلُۚ أَفَإِيْن مَّاتَ أَوۡ قُتِلَ ٱنقَلَبۡتُمۡ عَلَىٰٓ أَعۡقَٰبِكُمۡۚ وَمَن يَنقَلِبۡ عَلَىٰ عَقِبَيۡهِ فَلَن يَضُرَّ ٱللَّهَ شَيۡـٔٗاۚ وَسَيَجۡزِي ٱللَّهُ ٱلشَّٰكِرِينَ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":437,"juzNumber":4,"footnotes":"(1) محمد (صلى الله عليه وسلم) صرف رسول ہی ہیں (یعنی ان کا امتیاز بھی وصف رسالت ہی ہے۔ یہ نہیں کہ وہ بشری خصائص سے بالاتر اور خدائی صفات سے متصف ہوں کہ انہیں موت سے دوچار نہ ہونا پڑے۔\n(2) جنگ احد میں شکست کے اسباب میں سے ایک سبب یہ بھی تھا کہ رسول اللہ (صلى الله عليه وسلم) کے بارے میں کافروں نے یہ افواہ اڑا دی کہ محمد (صلى الله عليه وسلم) قتل کر دیئے گئے۔ مسلمانوں میں جب یہ خبر پھیلی تو اس سے بعض مسلمانوں کے حوصلے پست ہوگئے اور لڑائی سے پیچھے ہٹ گئے۔ جس پر یہ آیت نازل ہوئی کہ نبی (صلى الله عليه وسلم) کا کافروں کے ہاتھوں قتل ہو جانا یا اس پر موت کا وارد ہو جانا، کوئی نئی بات تو نہیں ہے۔ پچھلے انبیا (عليه السلام) بھی قتل اور موت سے ہمکنار ہو چکے ہیں۔ اگر آپ (صلى الله عليه وسلم) بھی (بالفرض) اس سے دوچار ہو جائیں تو کیا تم اس دین سے ہی پھر جاؤ گے۔ یاد رکھو جو پھر جائے گا وہ اپنا ہی نقصان کرے گا، اللہ کا کچھ نہیں بگاڑ سکے گا۔ نبی کریم (صلى الله عليه وسلم) کے سانحہ وفات کے وقت جب حضرت عمر (رضي الله عنه) شدت جذبات میں وفات نبوی کا انکار کر رہے تھے، ابوبکر صدیق (رضي الله عنه) نے نہایت حکمت سے کام لیتے ہوئے منبر رسول (صلى الله عليه وسلم) کے پہلو میں کھڑے ہو کر انہی آیات کی تلاوت کی،جس سے حضرت عمر (رضي الله عنه) بھی متاثر ہوئے اور انہیں محسوس ہوا کہ یہ آیات ابھی ابھی اتری ہیں۔\n(3) یعنی ثابت قدم رہنے والوں کو جنہوں نے صبر واستقامت کا مظاہرہ کرکے اللہ کی نعمتوں کا عملی شکر ادا کیا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wamā muḥammadun illā rasūlun qad khalat min qablihi al-rusulu afa-in māta aw qutila inqalabtum ʿalā aʿqābikum waman yanqalib ʿalā ʿaqibayhi falan yaḍurra al-laha shayan wasayajzī al-lahu al-shākirīna ","translations":["And not","(is) Muhammad ","except","a Messenger","certainly","passed away","from","before him","[the] (other) Messengers","So if","he died","or","is slain","will you turn back","on","your heels","And whoever","turns back","on","his heels","then never","will he harm","Allah","(in) anything","And will reward","Allah","the grateful ones","(144)"],"transliterationArr":["wamā","muḥammadun","illā","rasūlun","qad","khalat","min","qablihi","al-rusulu","afa-in","māta","aw","qutila","inqalabtum","ʿalā","aʿqābikum","waman","yanqalib","ʿalā","ʿaqibayhi","falan","yaḍurra","al-laha","shayan","wasayajzī","al-lahu","al-shākirīna",null],"verseTiming":[[1,0,830],[2,830,2760],[3,2760,3540],[4,3540,5350],[5,5350,5780],[6,5780,6510],[7,6510,7410],[8,7410,8290],[9,8290,9200],[10,9200,10320],[11,10320,11810],[12,11810,12200],[13,12200,12890],[14,12890,14920],[15,14920,16960],[16,16960,18610],[17,18610,20248],[18,20248,21892],[19,21892,22655],[20,22655,23804],[21,23804,25393],[22,25393,26660],[23,26660,27160],[24,27160,28276],[25,28276,29669],[26,29669,30420],[27,30420,33125]]}}