{"name":"3:154","price":"پھر اس نے اس غم کے بعد تم پر امن نازل فرمایا اور تم میں سے ایک جماعت کو امن کی نیند آنے لگی(1) ۔ ہاں کچھ وه لوگ بھی تھے کہ انہیں اپنی جانوں کی پڑی ہوئی تھی(2)، وه اللہ تعالیٰ کے ساتھ ناحق جہالت بھری بدگمانیاں کر رہے تھے(3) اور کہتے تھے کیا ہمیں بھی کسی چیز کا اختیار ہے(4)؟ آپ کہہ دیجئے کہ کام کل کا کل اللہ کے اختیار میں ہے(5)، یہ لوگ اپنے دلوں کے بھید آپ کو نہیں بتاتے(6)، کہتے ہیں کہ اگر ہمیں کچھ بھی اختیار ہوتا تو یہاں قتل نہ کئے جاتے(7)۔ آپ کہہ دیجئے کہ گو تم اپنے گھروں میں ہوتے پھر بھی جن کی قسمت میں قتل ہونا تھا وه تو مقتل کی طرف چل کھڑے ہوتے(8)، اللہ تعالیٰ کو تمہارے سینوں کے اندر کی چیز کا آزمانا اور جو کچھ تمہارے دلوں میں ہے، اس کو پاک کرنا تھا(9)، اور اللہ تعالی سینوں کے بھید سے آگاه ہے.(10)","arabic":"ثُمَّ أَنزَلَ عَلَيۡكُم مِّنۢ بَعۡدِ ٱلۡغَمِّ أَمَنَةٗ نُّعَاسٗا يَغۡشَىٰ طَآئِفَةٗ مِّنكُمۡۖ وَطَآئِفَةٞ قَدۡ أَهَمَّتۡهُمۡ أَنفُسُهُمۡ يَظُنُّونَ بِٱللَّهِ غَيۡرَ ٱلۡحَقِّ ظَنَّ ٱلۡجَٰهِلِيَّةِۖ يَقُولُونَ هَل لَّنَا مِنَ ٱلۡأَمۡرِ مِن شَيۡءٖۗ قُلۡ إِنَّ ٱلۡأَمۡرَ كُلَّهُۥ لِلَّهِۗ يُخۡفُونَ فِيٓ أَنفُسِهِم مَّا لَا يُبۡدُونَ لَكَۖ يَقُولُونَ لَوۡ كَانَ لَنَا مِنَ ٱلۡأَمۡرِ شَيۡءٞ مَّا قُتِلۡنَا هَٰهُنَاۗ قُل لَّوۡ كُنتُمۡ فِي بُيُوتِكُمۡ لَبَرَزَ ٱلَّذِينَ كُتِبَ عَلَيۡهِمُ ٱلۡقَتۡلُ إِلَىٰ مَضَاجِعِهِمۡۖ وَلِيَبۡتَلِيَ ٱللَّهُ مَا فِي صُدُورِكُمۡ وَلِيُمَحِّصَ مَا فِي قُلُوبِكُمۡۚ وَٱللَّهُ عَلِيمُۢ بِذَاتِ ٱلصُّدُورِ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":447,"juzNumber":4,"footnotes":"(1) مذکورہ سراسیمگی کے بعد اللہ تعالیٰ نے پھر مسلمانوں پر اپنا فضل فرمایا اور میدان جنگ میں باقی رہ جانے والے مسلمانوں پر اونگھ مسلط کر دی۔ یہ اونگھ اللہ کی طرف سے سکینت اور نصرت کی دلیل تھی۔ حضرت ابو طلحہ (رضي الله عنه) فرماتے ہیں کہ میں بھی ان لوگوں میں سے تھا جن پر احد کے دن اونگھ چھائی جا رہی تھی حتیٰ کہ میری تلوار کئی مرتبہ میری ہاتھ سے گری میں اسے پکڑتا، وہ پھر گر جاتی، پھر پکڑتا اور پھر گر جاتی، (صحیح بخاری) نُعَاسًا أَمَنَةً سے بدل ہے۔ طائفہ، واحد اور جمع دونوں کے لئے مستعمل ہے (فتح القدیر )\n(2) اس سے مراد منافقین ہیں۔ ظاہر ہے کہ ایسے حالات میں ان کو تو اپنی جانوں ہی کی فکر تھی۔\n(3) وہ یہ تھیں کہ نبی کریم (صلى الله عليه وسلم) کا معاملہ باطل ہے، یہ جس دین کی دعوت دیتے ہیں، اس کا مستقبل مخدوش ہے، انہیں اللہ کی مدد ہی حاصل نہیں ہے وغیرہ وغیرہ۔\n(4) یعنی کیا اب ہمارے لئے اللہ تعالیٰ کی طرف سے کسی فتح ونصرت کا امکان ہے؟ یا یہ کہ کیا ہماری بھی کوئی بات چل سکتی ہے اور مانی جا سکتی ہے؟\n(5) تمہارے یا دشمن کے اختیار میں نہیں ہے، مدداسی کی طرف سے آئے گی اور کامیابی بھی اس کے حکم سے ہوگی اور رامرونہی بھی اسی کا ہوگا۔\n(6) اپنے دلوں میں نفاق چھپائے ہوئے ہیں ظاہر یہ کرتے ہیں کہ وہ رہنمائی کے طالب ہیں۔\n(7) یہ وہ آپس میں کہتے یا اپنے دل میں کہتے تھے۔\n(8) اللہ تعالیٰ نے فرمایا، اس قسم کی باتوں کا کیا فائدہ؟ موت تو ہر صورت میں آنی ہے اور اسی جگہ پر آنی ہے جہاں اللہ کی طرف سے لکھ دی گئی ہے۔ اگر تم گھروں میں بیٹھے ہوتے اور تمہاری موت کسی مقتل میں لکھی ہوتی تو تمہیں قضا ضروروہاں کھینچ لے جاتی؟۔\n(9) یہ جو کچھ ہوا اس سے ایک مقصد یہ بھی تھا کہ تمہارے سینوں کے اندر جو کچھ ہے یعنی ایمان، اسے آزمائے (تاکہ منافق الگ ہو جائیں) اور پھر تمہارے دلوں کو شیطانی وساوس سے پاک کر دے۔\n(10) یعنی اس کو تو علم ہے کہ مخلص مسلمان کون ہے اورنفاق کا لبادہ کس نے اوڑھ رکھا ہے ؟ جہاد کی متعدد حکمتوں میں سے ایک حکمت یہ ہے کہ اس سے مومن اور منافق کھل کر سامنے آجاتے ہیں جنہیں عام لوگ بھی پھر دیکھ اور پہچان لیتے ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"thumma anzala ʿalaykum min baʿdi al-ghami amanatan nuʿāsan yaghshā ṭāifatan minkum waṭāifatun qad ahammathum anfusuhum yaẓunnūna bil-lahi ghayra al-ḥaqi ẓanna al-jāhiliyati yaqūlūna hal lanā mina al-amri min shayin qul inna al-amra kullahu lillahi yukh'fūna fī anfusihim mā lā yub'dūna laka yaqūlūna law kāna lanā mina al-amri shayon mā qutil'nā hāhunā qul law kuntum fī buyūtikum labaraza alladhīna kutiba ʿalayhimu al-qatlu ilā maḍājiʿihim waliyabtaliya al-lahu mā fī ṣudūrikum waliyumaḥḥiṣa mā fī qulūbikum wal-lahu ʿalīmun bidhāti al-ṣudūri ","translations":["Then","He sent down","upon you","from","after","the distress","security ","slumber","overcoming","a group","of you","while a group","certainly","worried [them]","(about) themselves","thinking","about Allah","other than","the truth ","(the) thought","(of) [the] ignorance","saying","Is (there)","for us","from","the matter","any","thing","Say","Indeed","the matter","all (of) it","(is) for Allah","They hide","in","themselves","what","not","they reveal","to you","They say","If","was","for us","from","the matter","anything","not","we would have been killed","here","Say","If","you were","in","your houses","surely (would have) come out","those who ","was decreed","upon them","[the] death","towards","their places of death","And that might test","Allah","what","(is) in","your breasts","and that He may purge","what","(is) in","your hearts","And Allah","(is) All-Aware","of what","(is in) the breasts","(154)"],"transliterationArr":["thumma","anzala","ʿalaykum","min","baʿdi","al-ghami","amanatan","nuʿāsan","yaghshā","ṭāifatan","minkum","waṭāifatun","qad","ahammathum","anfusuhum","yaẓunnūna","bil-lahi","ghayra","al-ḥaqi","ẓanna","al-jāhiliyati","yaqūlūna","hal","lanā","mina","al-amri","min","shayin","qul","inna","al-amra","kullahu","lillahi","yukh'fūna","fī","anfusihim","mā","lā","yub'dūna","laka","yaqūlūna","law","kāna","lanā","mina","al-amri","shayon","mā","qutil'nā","hāhunā","qul","law","kuntum","fī","buyūtikum","labaraza","alladhīna","kutiba","ʿalayhimu","al-qatlu","ilā","maḍājiʿihim","waliyabtaliya","al-lahu","mā","fī","ṣudūrikum","waliyumaḥḥiṣa","mā","fī","qulūbikum","wal-lahu","ʿalīmun","bidhāti","al-ṣudūri",null],"verseTiming":[[1,0,1630],[2,1630,3440],[3,3440,4350],[4,4350,5930],[5,5930,6610],[6,6610,8030],[7,8030,9030],[8,9030,10460],[9,10460,12060],[10,12060,14660],[11,14660,17300],[12,17300,21560],[13,21560,21990],[14,21990,24190],[15,24190,25950],[16,25950,27680],[17,27680,28870],[18,28870,29530],[19,29530,30470],[20,30470,31750],[21,31750,34140],[22,34140,35460],[23,35460,35860],[24,35860,36700],[25,36700,37010],[26,37010,37990],[27,37990,38550],[28,38550,41890],[29,41890,42320],[30,42320,43550],[31,43550,44460],[32,44460,45590],[33,45590,49030],[34,49030,50160],[35,50160,51630],[36,51630,53660],[37,53660,55040],[38,55040,55430],[39,55430,56680],[40,56680,57340],[41,57340,58660],[42,58660,59140],[43,59140,59740],[44,59740,60580],[45,60580,60930],[46,60930,61860],[47,61860,62480],[48,62480,64020],[49,64020,65230],[50,65230,66560],[51,66560,67430],[52,67430,67800],[53,67800,69660],[54,69660,70110],[55,70110,71480],[56,71480,72400],[57,72400,73540],[58,73540,74180],[59,74180,75280],[60,75280,76280],[61,76280,76900],[62,76900,78960],[63,78960,80470],[64,80470,81440],[65,81440,81830],[66,81830,82190],[67,82190,83670],[68,83670,85220],[69,85220,85610],[70,85610,85970],[71,85970,87790],[72,87790,88940],[73,88940,90940],[74,90940,91730],[75,91730,94415]]}}