{"name":"3:151","price":"ہم عنقریب کافروں کے دلوں میں رعب ڈال دیں گے، اس وجہ سے کہ یہ اللہ کے ساتھ ان چیزوں کو شریک کرتے ہیں جس کی کوئی دلیل اللہ نے نہیں اتاری(1) ، ان کا ٹھکانہ جہنم ہے، اور ان ﻇالموں کی بری جگہ ہے.","arabic":"سَنُلۡقِي فِي قُلُوبِ ٱلَّذِينَ كَفَرُواْ ٱلرُّعۡبَ بِمَآ أَشۡرَكُواْ بِٱللَّهِ مَا لَمۡ يُنَزِّلۡ بِهِۦ سُلۡطَٰنٗاۖ وَمَأۡوَىٰهُمُ ٱلنَّارُۖ وَبِئۡسَ مَثۡوَى ٱلظَّٰلِمِينَ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":444,"juzNumber":4,"footnotes":"(1) مسلمانوں کی شکست دیکھتے ہوئے بعض کافروں کے دل میں یہ خیال آیا کہ یہ موقع مسلمانوں کے بالکلیہ خاتمہ کے لئے بڑا اچھا ہے اس موقع پر اللہ تعالیٰ نے ان کے دلوں میں مسلمانوں کا رعب ڈال دیا۔ پھر انہیں اپنے اس خیال کو عملی جامہ پہنانے کا حوصلہ نہ ہوا (فتح القدیر) صحیحین کی حدیث میں ہے کہ نبی (صلى الله عليه وسلم) نے فرمایا کہ مجھے پانچ چیزیں ایسی عطا کی گئی ہے جو مجھ سے قبل کسی نبی کو نہیں دی گئیں۔ ان میں ایک یہ ہے کہ«نُصِرْتُ بِالرُّعْبِ مَسِيرَةَ شَهْرٍ»، ”دشمن کے دل میں ایک مہینے کی مسافت پر میرا رعب ڈال کر میری مدد کی گئی ہے“۔ اس حدیث سے معلوم ہوا کہ آپ (صلى الله عليه وسلم) کا رعب مستقل طور پر دشمن کے دل میں ڈال دیا گیا تھا۔ اور اس آیت سے معلوم ہوتا ہے کہ آپ (صلى الله عليه وسلم) کے ساتھ آپ (صلى الله عليه وسلم) کی امت یعنی مسلمانوں کا رعب بھی مشرکوں پر ڈال دیا گیا ہے اور اس کی وجہ ان کا شرک ہے۔ گویا شرک کرنے والوں کا دل دوسروں کی ہیبت سے لرزاں وترساں رہتا ہے۔ غالباً یہی وجہ ہے کہ جب مسلمانوں کی ایک بڑی تعداد مشرکانہ عقائد واعمال میں مبتلا ہوئی ہے، دشمن ان سے مرعوب ہونے کے بجائے، وہ دشمنوں سے مرعوب ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"sanul'qī fī qulūbi alladhīna kafarū al-ruʿ'ba bimā ashrakū bil-lahi mā lam yunazzil bihi sul'ṭānan wamawāhumu al-nāru wabi'sa mathwā al-ẓālimīna ","translations":["We will cast","in","(the) hearts","(of) those who","disbelieve","[the] terror","because","they associated partners","with Allah","what","not","He sent down","about it","any authority","and their refuge","(will be) the Fire","and wretched","(is the) abode","[of] the wrongdoers","(151)"],"transliterationArr":["sanul'qī","fī","qulūbi","alladhīna","kafarū","al-ruʿ'ba","bimā","ashrakū","bil-lahi","mā","lam","yunazzil","bihi","sul'ṭānan","wamawāhumu","al-nāru","wabi'sa","mathwā","al-ẓālimīna",null],"verseTiming":[[1,0,1140],[2,1140,1500],[3,1500,2420],[4,2420,3430],[5,3430,3920],[6,3920,4860],[7,4860,6840],[8,6840,7850],[9,7850,8940],[10,8940,9370],[11,9370,9800],[12,9800,10840],[13,10840,11460],[14,11460,13360],[15,13360,14760],[16,14760,17770],[17,17770,18990],[18,18990,19650],[19,19650,22285]]}}