{"name":"3:152","price":"اللہ تعالیٰ نے تم سے اپنا وعده سچا کر دکھایا جبکہ تم اس کے حکم سے انہیں کاٹ رہے تھے(1) ۔ یہاں تک کہ جب تم نے پست ہمتی اختیار کی اور کام میں جھگڑنے لگے اور نافرمانی کی(2)، اس کے بعد کہ اس نے تمہاری چاہت کی چیز تمہیں دکھا دی(3)، تم میں سے بعض دنیا چاہتے تھے(4) اور بعض کا اراده آخرت کا تھا(5) تو پھر اس نے تمہیں ان سے پھیر دیا تاکہ تم کو آزمائے(6) اور یقیناً اس نے تمہاری لغزش سے درگزر فرما دیا اور ایمان والوں پر اللہ تعالیٰ بڑے فضل واﻻ ہے.(7)","arabic":"وَلَقَدۡ صَدَقَكُمُ ٱللَّهُ وَعۡدَهُۥٓ إِذۡ تَحُسُّونَهُم بِإِذۡنِهِۦۖ حَتَّىٰٓ إِذَا فَشِلۡتُمۡ وَتَنَٰزَعۡتُمۡ فِي ٱلۡأَمۡرِ وَعَصَيۡتُم مِّنۢ بَعۡدِ مَآ أَرَىٰكُم مَّا تُحِبُّونَۚ مِنكُم مَّن يُرِيدُ ٱلدُّنۡيَا وَمِنكُم مَّن يُرِيدُ ٱلۡأٓخِرَةَۚ ثُمَّ صَرَفَكُمۡ عَنۡهُمۡ لِيَبۡتَلِيَكُمۡۖ وَلَقَدۡ عَفَا عَنكُمۡۗ وَٱللَّهُ ذُو فَضۡلٍ عَلَى ٱلۡمُؤۡمِنِينَ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":445,"juzNumber":4,"footnotes":"(1) اس وعدے سے بعض مفسرین نے تین ہزار اور ہزار فرشتوں کا نزول مراد لیا ہے لیکن یہ رائے سرے سے صحیح نہیں بلکہ صحیح یہ ہے کہ فرشتوں کا یہ نزول صرف جنگ بدر کے ساتھ مخصوص تھا۔ باقی رہا وہ وعدہ جو اس آیت میں مذکورہے تو اس سے مراد فتح ونصرت کا وہ عام وعدہ ہے جو اہل اسلام کے لئے اور اس کے رسول کی طرف سے بہت پہلے سے کیا جا چکا تھا۔ حتیٰ کہ بعض آیتیں مکہ میں نازل ہو چکی تھیں۔ اور اس کے مطابق ابتدائے جنگ میں مسلمان غالب وفاتح رہے جس کی طرف «إِذْ تَحُسُّونَهُمْ بِإِذْنِهِ» سے اشارہ کیا گیا ہے۔\n(2) اس تنازع اور عصیان سے مراد تیر اندازوں کاوہ اختلاف ہے جو فتح وغلبہ دیکھ کر ان کے اندر واقع ہوا اور جس کی وجہ سے کافروں کو پلٹ کر دوبارہ حملہ آور ہونے کا موقع ملا۔\n(3) اس سے مراد وہ فتح ہے جو ابتدا میں مسلمانوں کو حاصل ہوئی۔\n(4) یعنی مال غنیمت، جس کے لئے انہوں نے وہ پہاڑی چھوڑ دی جس کے نہ چھوڑنے کی انہیں تاکید کی گئی تھی۔\n(5) وہ لوگ ہیں جنہوں نے مورچہ چھوڑنے سے منع کیا اور نبی کریم (صلى الله عليه وسلم) کے فرمان کے مطابق اسی جگہ ڈٹے رہنے کا عزم ظاہر کیا۔\n(6) یعنی غلبہ عطا کرنے کے بعد پھر تمہیں شکست دے کر ان کافروں سے پھیر دیا تاکہ تمہیں آزمائے۔\n(7) اس میں صحابہ کرام (رضي الله عنهم) کے اس شرف وفعل کا اظہار ہے جو ان کی کوتاہیوں کے باوجود اللہ نے ان پر فرمایا۔ یعنی ان کی غلطیوں کی وضاحت کرکے آئندہ اس کا اعادہ نہ کریں، اللہ نے ان کے لئے معافی کا اعلان کر دیا تاکہ کوئی بد باطن ان پر زبان طعن دراز نہ کرے۔ جب اللہ تعالیٰ نے ہی قرآن کریم میں ان کے لئے عفو عام کا اعلان فرما دیا تو اب کسی کے لئے طعن وتشنیع کی گنجائش کہاں رہ گئی؟ صحیح بخاری میں ایک واقعہ مذکور ہے کہ ایک حج کے موقعے پر ایک شخص نے حضرت عثمان (رضي الله عنه) پر بعض اعتراضات کئے کہ وہ جنگ بدر میں، بیعت رضوان میں شریک نہیں ہوئے، نیز یوم احد میں فرار ہوگئے تھے۔ حضرت ابن عمر (رضي الله عنه) نے فرمایا کہ جنگ بدر میں تو ان کی اہلیہ (بنت رسول ج) بیمار تھیں، بیعت رضوان کے موقع پر آپ رسول (صلى الله عليه وسلم) کے سفیر بن کر مکہ گئے ہوئے تھے اور یوم احد کے فرار کو اللہ نے معاف فرما دیا ہے۔ (ملخصا۔ صحیح بخاری، غزوۂ احد)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walaqad ṣadaqakumu al-lahu waʿdahu idh taḥussūnahum bi-idh'nihi ḥattā idhā fashil'tum watanāzaʿtum fī al-amri waʿaṣaytum min baʿdi mā arākum mā tuḥibbūna minkum man yurīdu al-dun'yā waminkum man yurīdu al-ākhirata thumma ṣarafakum ʿanhum liyabtaliyakum walaqad ʿafā ʿankum wal-lahu dhū faḍlin ʿalā al-mu'minīna ","translations":["And certainly","fulfilled to you","Allah","His promise","when","you were killing them","by His permission","until","when","you lost courage","and you fell into dispute","concerning","the order","and you disobeyed","from","after","[what]","He (had) shown you","what","you love","Among you","(are some) who","desire","the world","and among you","(are some) who","desire","the Hereafter","Then","He diverted you","from them","so that He may test you","And surely","He forgave","you","And Allah","(is the) Possessor","(of) Bounty","for","the believers","(152)"],"transliterationArr":["walaqad","ṣadaqakumu","al-lahu","waʿdahu","idh","taḥussūnahum","bi-idh'nihi","ḥattā","idhā","fashil'tum","watanāzaʿtum","fī","al-amri","waʿaṣaytum","min","baʿdi","mā","arākum","mā","tuḥibbūna","minkum","man","yurīdu","al-dun'yā","waminkum","man","yurīdu","al-ākhirata","thumma","ṣarafakum","ʿanhum","liyabtaliyakum","walaqad","ʿafā","ʿankum","wal-lahu","dhū","faḍlin","ʿalā","al-mu'minīna",null],"verseTiming":[[1,0,810],[2,810,1800],[3,1800,2850],[4,2850,5080],[5,5080,5400],[6,5400,7660],[7,7660,8760],[8,8760,11440],[9,11440,11980],[10,11980,13230],[11,13230,14900],[12,14900,15150],[13,15150,15940],[14,15940,17160],[15,17160,18780],[16,18780,19480],[17,19480,21250],[18,21250,22290],[19,22290,23290],[20,23290,26740],[21,26740,28380],[22,28380,28890],[23,28890,30320],[24,30320,31420],[25,31420,33230],[26,33230,34200],[27,34200,35410],[28,35410,37170],[29,37170,38130],[30,38130,39340],[31,39340,40200],[32,40200,42410],[33,42410,43170],[34,43170,44000],[35,44000,45790],[36,45790,46890],[37,46890,47260],[38,47260,48150],[39,48150,48590],[40,48590,51325]]}}