{"name":"3:159","price":"اللہ تعالیٰ کی رحمت کے باعﺚ آپ ان پر نرم دل ہیں اور اگر آپ بد زبان اور سخت دل ہوتے تو یہ سب آپ کے پاس سے چھٹ جاتے، سو آپ ان سے درگزر کریں اور ان(1) کے لئے استغفار کریں اور کام کا مشوره ان سے کیا کریں(2)، پھر جب آپ کا پختہ اراده ہو جائے تو اللہ تعالیٰ پر بھروسہ کریں(3)، بے شک اللہ تعالیٰ توکل کرنے والوں سے محبت کرتا ہے.","arabic":"فَبِمَا رَحۡمَةٖ مِّنَ ٱللَّهِ لِنتَ لَهُمۡۖ وَلَوۡ كُنتَ فَظًّا غَلِيظَ ٱلۡقَلۡبِ لَٱنفَضُّواْ مِنۡ حَوۡلِكَۖ فَٱعۡفُ عَنۡهُمۡ وَٱسۡتَغۡفِرۡ لَهُمۡ وَشَاوِرۡهُمۡ فِي ٱلۡأَمۡرِۖ فَإِذَا عَزَمۡتَ فَتَوَكَّلۡ عَلَى ٱللَّهِۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُتَوَكِّلِينَ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":452,"juzNumber":4,"footnotes":"(1) نبی (صلى الله عليه وسلم) جو صاحب خلق عظیم تھے، اللہ تعالیٰ اپنے اس پیغمبر پر ایک احسان کا ذکر فرما رہا ہے کہ آپ (صلى الله عليه وسلم) کے اندر جو نرمی اور ملائمت ہے یہ اللہ تعالیٰ کی خاص مہربانی کا نتیجہ ہے اور یہ نرمی دعوت وتبلیغ کے لئے نہایت ضروری ہے۔ اگر آپ (صلى الله عليه وسلم) کے اندر یہ نہ ہوتی بلکہ اس کے برعکس آپ (صلى الله عليه وسلم) تند خو اور سخت دل ہوتے تو لوگ آپ کے قریب ہونے کے بجائے، آپ (صلى الله عليه وسلم) سے دور بھاگتے۔ اس لئے آپ درگزر سے ہی کام لیتے رہئیے۔\n(2) یعنی مسلمانوں کی طیب خاطر کے لئے مشورہ کر لیا کریں۔ اس آیت سے مشاورت کی اہمیت، افادیت اور اس کی ضرورت مشروعیت ثابت ہوتی ہے۔ مشاورت کا یہ حکم بعض کے نزدیک وجوب کے لئے اور بعض کے نزدیک استحباب کے لئے ہے (ابن كثير)۔ امام شوکانی لکھتے ہیں (حکمرانوں کے لئے ضروری ہے کہ وہ علما سے ایسے معاملات میں مشورہ کریں جن کا انہیں علم نہیں ہے۔ یا ان کے بارے میں انہیں اشکال ہیں۔ فوج کے سربراہوں سے فوجی معاملات میں، سربر آوردہ لوگوں سے عوام کے مصالح کے بارے میں اور ماتحت حکام ودالیان سے ان کے علاقوں کی ضروریات وترجیحات کے سلسلے میں مشورہ کریں۔ ابن عطیہ کہتے ہیں کہ ایسے حکمران کے وجوب پر کوئی اختلاف نہیں ہے جو اہل علم واہل دین سے مشورہ نہیں کرتا۔ یہ مشورہ صرف ان معاملات تک محدود ہوگا جن کی بابت شریعت خاموش ہے یا جن کا تعلق انتظامی امور سے ہے۔ (فتح القدير)\n(3) یعنی مشاورت کے بعد جس پر آپ کی رائے پختہ ہو جائے، پھر اللہ پر توکل کرکے اسے کر گزرئیے۔ اس سے ایک تو یہ بات معلوم ہوئی کہ مشاورت کے بعد بھی آخری فیصلہ حکمران ہی کا ہوگا نہ کہ ارباب مشاورت یا ان کی اکثریت کا جیسا کہ جمہوریت میں ہے۔ دوسری یہ کہ سارا اعتماد وتوکل اللہ کی ذات پر ہو نہ کہ مشورہ دینے والوں کی عقل وفہم پر۔ اگلی آیت میں بھی توکل علی اللہ کی مزید تاکید ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"fabimā raḥmatin mina al-lahi linta lahum walaw kunta faẓẓan ghalīẓa al-qalbi la-infaḍḍū min ḥawlika fa-uʿ'fu ʿanhum wa-is'taghfir lahum washāwir'hum fī al-amri fa-idhā ʿazamta fatawakkal ʿalā al-lahi inna al-laha yuḥibbu al-mutawakilīna ","translations":["So because","(of) Mercy","from","Allah","you dealt gently","with them","And if","you had been","rude","(and) harsh","(at) [the] heart","surely they (would have) dispersed","from","around you","Then pardon","[from] them","and ask forgiveness","for them","and consult them","in","the matter","Then when","you have decided","then put trust","on","Allah","Indeed","Allah","loves","the ones who put trust (in Him)","(159)"],"transliterationArr":["fabimā","raḥmatin","mina","al-lahi","linta","lahum","walaw","kunta","faẓẓan","ghalīẓa","al-qalbi","la-infaḍḍū","min","ḥawlika","fa-uʿ'fu","ʿanhum","wa-is'taghfir","lahum","washāwir'hum","fī","al-amri","fa-idhā","ʿazamta","fatawakkal","ʿalā","al-lahi","inna","al-laha","yuḥibbu","al-mutawakilīna",null],"verseTiming":[[1,0,950],[2,950,1830],[3,1830,2740],[4,2740,3690],[5,3690,5180],[6,5180,6340],[7,6340,6870],[8,6870,8230],[9,8230,9060],[10,9060,9700],[11,9700,10880],[12,10880,12690],[13,12690,13120],[14,13120,14390],[15,14390,14930],[16,14930,15890],[17,15890,17090],[18,17090,17770],[19,17770,19280],[20,19280,19490],[21,19490,20220],[22,20220,21470],[23,21470,22340],[24,22340,23560],[25,23560,23950],[26,23950,26980],[27,26980,27970],[28,27970,28800],[29,28800,29690],[30,29690,33095]]}}