{"name":"3:169","price":"جو لوگ اللہ کی راه میں شہید کئے گئے ہیں ان کو ہرگز مرده نہ سمجھیں، بلکہ وه زنده ہیں اپنے رب کے پاس روزیاں دیئے جاتے ہیں.(1)","arabic":"وَلَا تَحۡسَبَنَّ ٱلَّذِينَ قُتِلُواْ فِي سَبِيلِ ٱللَّهِ أَمۡوَٰتَۢاۚ بَلۡ أَحۡيَآءٌ عِندَ رَبِّهِمۡ يُرۡزَقُونَ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":462,"juzNumber":4,"footnotes":"(1) شہدا کی یہ زندگی حقیقی ہے یا مجازی، یقیناً حقیقی ہے لیکن اس کا شعور اہل دنیا کو نہیں جیسا کہ قرآن نے وضاحت کر دی ہے۔ ملاحظہ ہو (سورۂ بقرۃ آیت نمبر 154) پھر اس زندگی کا مطلب کیا ہے ؟ بعض کہتے ہیں قبروں میں ان کی روحیں لوٹا دی جاتی ہیں اور وہاں اللہ کی نعمتوں سے لطف اندوز ہوتے ہیں۔ بعض کہتے ہیں کہ جنت کے پھلوں کی خوشبوئیں انہیں آتی ہیں۔ جس سے ان کے مشام جان معطر رہتے ہیں۔ لیکن حدیث سے ایک تیسری شکل معلوم ہوتی ہے اس لئے وہی صحیح ہے، وہ یہ کہ اس کی روحیں سبز پرندوں کے جوف یا سینوں میں داخل کر دی جاتی ہیں اور وہ جنت میں کھاتی پھرتی اور اس کی نعمتوں سے متمتع ہوتی ہیں (فتح القدیر بحوالہ صحیح مسلم، کتاب الامارۃ)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walā taḥsabanna alladhīna qutilū fī sabīli al-lahi amwātan bal aḥyāon ʿinda rabbihim yur'zaqūna ","translations":["And (do) not","think","(of) those who","are killed","in","(the) way","(of) Allah","(as) dead","Nay","They are alive","near","their Lord","they are given provision","(169)"],"transliterationArr":["walā","taḥsabanna","alladhīna","qutilū","fī","sabīli","al-lahi","amwātan","bal","aḥyāon","ʿinda","rabbihim","yur'zaqūna",null],"verseTiming":[[1,0,720],[2,720,2850],[3,2850,3980],[4,3980,4830],[5,4830,5300],[6,5300,6470],[7,6470,7140],[8,7140,8630],[9,8630,9580],[10,9580,12150],[11,12150,13560],[12,13560,14640],[13,14640,17765]]}}