{"name":"3:179","price":"جس حال میں تم ہو اسی پر اللہ ایمان والوں کو نہ چھوڑ دے گا جب تک کہ پاک اور ناپاک کو الگ الگ نہ کر دے(1) ، اور نہ اللہ تعالیٰ ایسا ہے کہ تمہیں غیب سے آگاه کردے(2)، بلکہ اللہ تعالیٰ اپنے رسولوں میں سے جس کا چاہے انتخاب کر لیتا ہے(3)، اس لئے تم اللہ تعالیٰ پر اور اس کے رسولوں پر ایمان رکھو، اگر تم ایمان ﻻؤ اور تقویٰ کرو تو تمہارے لئے بڑا بھاری اجر ہے.","arabic":"مَّا كَانَ ٱللَّهُ لِيَذَرَ ٱلۡمُؤۡمِنِينَ عَلَىٰ مَآ أَنتُمۡ عَلَيۡهِ حَتَّىٰ يَمِيزَ ٱلۡخَبِيثَ مِنَ ٱلطَّيِّبِۗ وَمَا كَانَ ٱللَّهُ لِيُطۡلِعَكُمۡ عَلَى ٱلۡغَيۡبِ وَلَٰكِنَّ ٱللَّهَ يَجۡتَبِي مِن رُّسُلِهِۦ مَن يَشَآءُۖ فَـَٔامِنُواْ بِٱللَّهِ وَرُسُلِهِۦۚ وَإِن تُؤۡمِنُواْ وَتَتَّقُواْ فَلَكُمۡ أَجۡرٌ عَظِيمٞ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":472,"juzNumber":4,"footnotes":"(1) اس لئے اللہ تعالیٰ ابتلا کی بھٹی سے ضرور گزارتا ہے تاکہ اس کے دوست واضح اور دشمن ذلیل ہو جائیں۔ مومن صابر، منافق سے الگ ہو جائیں جس طرح احد میں اللہ تعالیٰ نے اہل ایمان کو آزمایا جس سے ان کے ایمان، صبر وثبات اور جذبہ اطاعت کا اظہار ہوا اور منافقین نے اپنے اوپر جو نفاق کا پردہ ڈال رکھا تھا وہ بے نقاب ہوگیا۔\n(2) یعنی اگر اللہ تعالیٰ اس طرح ابتلا کے ذریعےسے لوگوں کے حالات اور ان کے ظاہر وباطن کو نمایاں نہ کرے تو تمہارے پاس کوئی غیب کا علم تو ہے نہیں کہ جس سے تم پر یہ چیزیں منکشف ہو جائیں اور تم جان سکو کہ کون منافق ہے اور کون مومن خالص؟۔\n(3) ہاں البتہ اللہ تعالیٰ اپنے رسولوں میں سے جس کو چاہتا ہے غیب کا علم عطا فرماتا ہے جس سے بعض دفعہ ان پر منافقین کا اور ان کے حالات اور ان کی سازشوں کا راز فاش ہو جاتا ہے۔ یعنی یہ بھی کسی کسی وقت اور کسی کسی نبی پر ہی ظاہر کیا جاتا ہے۔ ورنہ عام طور پر نبی بھی (جب تک اللہ تعالیٰ نہ چاہے) منافقین کے اندرونی نفاق اور ان کے مکروکید سے بے خبر ہی رہتا ہے (جس طرح کہ سورۂ توبہ کی آیت نمبر میں اللہ تعالیٰ نے فرمایا کہ اعراب اور اہل مدینہ میں جو منافق ہیں اے پیغمبر! آپ ان کو نہیں جانتے، ہم انہیں جانتے ہیں) اس کا دوسرا مفہوم یہ بھی ہو سکتا ہے کہ غیب کا علم ہم صرف اپنے رسولوں کو ہی عطا کرتے ہیں کیونکہ یہ ان کی منصبی ضرورت ہے۔ اس وحی الٰہی اور امور غیبیہ کے ذریعے سے ہی وہ لوگوں کو اللہ تعالیٰ کی طرف بلاتے اور اپنے کو اللہ کا رسول ثابت کرتے ہیں ؟ اس مضمون کو دوسرے مقام پر اس طرح بیان کیا گیا ہے«عَالِمُ الْغَيْبِ فَلا يُظْهِرُ عَلَى غَيْبِهِ أَحَدًا، إِلا مَنِ ارْتَضَى مِنْ رَسُولٍ» ( الجن:26-27) ”عالم الغیب اللہ تعالیٰ ہے، اور وہ اپنے غیب سے پسندیدہ رسولوں کو ہی خبردار کرتا ہے“ ظاہر بات ہے یہ امور غیبیہ وہی ہوتے ہیں جن کا تعلق منصب وفرائض رسالت کی ادائیگی سے ہوتا ہے نہ کہ مَا كَانَ وَمَا يَكُونُ جو کچھ ہو چکا اور آئندہ قیامت تک جو ہونے والے ہے کاعلم۔ جیسا کہ بعض اہل باطل اس طرح کا علم غیب انبیاء ﻹ کے لئے اور کچھ اپنے ”آئمہ معصومین“ کے لئے باور کراتے ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"mā kāna al-lahu liyadhara al-mu'minīna ʿalā mā antum ʿalayhi ḥattā yamīza al-khabītha mina al-ṭayibi wamā kāna al-lahu liyuṭ'liʿakum ʿalā al-ghaybi walākinna al-laha yajtabī min rusulihi man yashāu faāminū bil-lahi warusulihi wa-in tu'minū watattaqū falakum ajrun ʿaẓīmun ","translations":["Not","is","Allah","to leave","the believers","on","what","you (are)","in [it]","until","He separates","the evil","from","the good","And not","is","Allah","to inform you","about","the unseen","[and] but","Allah","chooses","from","His Messengers","whom","He wills","so believe","in Allah","and His Messengers","and if","you believe","and fear (Allah)","then for you","(is a) reward","great","(179)"],"transliterationArr":["mā","kāna","al-lahu","liyadhara","al-mu'minīna","ʿalā","mā","antum","ʿalayhi","ḥattā","yamīza","al-khabītha","mina","al-ṭayibi","wamā","kāna","al-lahu","liyuṭ'liʿakum","ʿalā","al-ghaybi","walākinna","al-laha","yajtabī","min","rusulihi","man","yashāu","faāminū","bil-lahi","warusulihi","wa-in","tu'minū","watattaqū","falakum","ajrun","ʿaẓīmun",null],"verseTiming":[[1,0,590],[2,590,1210],[3,1210,2240],[4,2240,2940],[5,2940,4560],[6,4560,7290],[7,7290,7370],[8,7370,8800],[9,8800,9760],[10,9760,10700],[11,10700,11590],[12,11590,12820],[13,12820,13150],[14,13150,14370],[15,14370,15210],[16,15210,16030],[17,16030,17050],[18,17050,18610],[19,18610,19030],[20,19030,19970],[21,19970,21770],[22,21770,22790],[23,22790,23910],[24,23910,24060],[25,24060,25470],[26,25470,25640],[27,25640,29210],[28,29210,31070],[29,31070,32180],[30,32180,33630],[31,33630,34730],[32,34730,35610],[33,35610,37140],[34,37140,38180],[35,38180,38770],[36,38770,41585]]}}