{"name":"3:172","price":"جن لوگوں نے اللہ اور رسول کے حکم کو قبول کیا اس کے بعد کہ انہیں پورے زخم لگ چکے تھے، ان میں سے جنہوں نے نیکی کی اور پرہیزگاری برتی ان کے لئے بہت زیاده اجر ہے.(1)","arabic":"ٱلَّذِينَ ٱسۡتَجَابُواْ لِلَّهِ وَٱلرَّسُولِ مِنۢ بَعۡدِ مَآ أَصَابَهُمُ ٱلۡقَرۡحُۚ لِلَّذِينَ أَحۡسَنُواْ مِنۡهُمۡ وَٱتَّقَوۡاْ أَجۡرٌ عَظِيمٌ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":465,"juzNumber":4,"footnotes":"(1) جب مشرکین جنگ احد سے واپس ہوئے تو راستے میں انہیں خیال آیا کہ ہم نے تو ایک نہایت سنہری موقع ضائع کر دیا۔ مسلمان شکست خوردگی کی وجہ سے بے حوصلہ اور خوف زدہ تھے۔ ہمیں اس سے فائدہ اٹھا کر مدینہ پر بھرپور حملہ کر دینا چاہئے تھا تاکہ اسلام کا یہ پودا اپنی سرزمین (مدینہ) سے ہی نیست ونابود ہو جائے۔ ادھر مدینہ پہنچ کر نبی کریم (صلى الله عليه وسلم) کو بھی اندیشہ ہوا کہ شاید وہ پھر پلٹ آئیں لہٰذا آپ (صلى الله عليه وسلم) نے صحابہ کو لڑنے پر آمادہ کیا آپ (صلى الله عليه وسلم) کے کہنے پر صحابہ باوجود اس بات کے کہ وہ اپنے مقتولین ومجروحین کی وجہ سے دل گرفتہ اور محزون ومغموم تھے، تیار ہوگئے۔ مسلمانوں کا یہ قافلہ جب مدینہ سے میل کے فاصلے پر واقع (حمراء الاسد) پر پہنچا تو مشرکین کو خوف محسوس ہوا۔ چنانچہ ان کا ارادہ بدل گیا اور وہ مدینہ پر حملہ آور ہونے کے بجائے مکہ واپس چلے گئے۔ اس کے بعد نبی (صلى الله عليه وسلم) اور آپ (صلى الله عليه وسلم) کے رفقا بھی مدینہ واپس آگئے۔ آیت میں مسلمانوں کے اسی جذبہ اطاعت اللہ ورسول کی تعریف کی گئی ہے بعض نے اس کا سبب نزول حضرت ابوسفیان کی اس دھمکی کو بتلایا ہے کہ آئندہ سال بدر صغریٰ میں ہمارا تمہارا مقابلہ ہوگا۔ (ابوسفیان ابھی تک مسلمان نہیں ہوئے تھے) جس پر مسلمانوں نے بھی اللہ ورسول کی اطاعت کے جذبے کا مظاہرہ کرتے ہوئے، جہاد میں بھرپور حصہ لینے کا عزم کر لیا۔ (ملخص از فتح القدیر وابن کثیر مگر یہ آخری قول سیاق سے میل نہیں کھاتا )","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"alladhīna is'tajābū lillahi wal-rasūli min baʿdi mā aṣābahumu al-qarḥu lilladhīna aḥsanū min'hum wa-ittaqaw ajrun ʿaẓīmun ","translations":["Those who","responded","to Allah","and the Messenger","from","after","what","befell them ","the injury ","for those who","did good","among them","and feared Allah","(is) a reward ","great","(172)"],"transliterationArr":["alladhīna","is'tajābū","lillahi","wal-rasūli","min","baʿdi","mā","aṣābahumu","al-qarḥu","lilladhīna","aḥsanū","min'hum","wa-ittaqaw","ajrun","ʿaẓīmun",null],"verseTiming":[[1,0,1320],[2,1320,2780],[3,2780,3860],[4,3860,5270],[5,5270,6490],[6,6490,7220],[7,7220,8700],[8,8700,10050],[9,10050,10740],[10,10740,12680],[11,12680,13770],[12,13770,14750],[13,14750,15800],[14,15800,16630],[15,16630,19455]]}}