{"name":"3:178","price":"کافر لوگ ہماری دی ہوئی مہلت کو اپنے حق میں بہتر نہ سمجھیں، یہ مہلت تو اس لئے ہے کہ وه گناہوں میں اور بڑھ جائیں(1) ، ان ہی کے لئے ذلیل کرنے واﻻ عذاب ہے.","arabic":"وَلَا يَحۡسَبَنَّ ٱلَّذِينَ كَفَرُوٓاْ أَنَّمَا نُمۡلِي لَهُمۡ خَيۡرٞ لِّأَنفُسِهِمۡۚ إِنَّمَا نُمۡلِي لَهُمۡ لِيَزۡدَادُوٓاْ إِثۡمٗاۖ وَلَهُمۡ عَذَابٞ مُّهِينٞ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":471,"juzNumber":4,"footnotes":"(1) اس میں اللہ کے قانون امہال (مہلت دینے) کا بیان ہے۔ یعنی اللہ تعالیٰ اپنی حکمت ومشیت کے مطابق کافروں کو مہلت عطا فرماتا ہے، وقتی طور پر انہیں دنیا کی فراغت وخوش حالی سے، فتوحات سے اور مال واولاد سے نوازتا ہے، لوگ سمجھتے ہیں کہ ان پر اللہ کا فضل ہو رہا ہے لیکن اگر اللہ کی نعمتوں سے فیض یاب ہونے والی نیکی اور اطاعت الٰہی کا راستہ اختیار نہیں کرتے تو یہ دینوی نعمتیں، فضل الٰہی نہیں مہلت الٰہی ہے، جس سے ان کے کفر وفسوق میں اضافہ ہی ہوتا ہے، بالآخر وہ جہنم کے دائمی عذاب کے مستحق قرار پا جاتے ہیں، اس مضمون کو اللہ تعالیٰ نے اور بھی کئی مقامات پر بیان کیا ہے۔ مثلاً «أَيَحْسَبُونَ أَنَّمَا نُمِدُّهُمْ بِهِ مِنْ مَالٍ وَبَنِينَ»(1) «نُسَارِعُ لَهُمْ فِي الْخَيْرَاتِ بَلْ لا يَشْعُرُونَ» (المؤمنون: 55-56) ”کیا وہ یہ گمان کرتے ہیں کہ ہم ان کے مال واولاد میں اضافہ کرتے ہیں۔ یہ ہم ان کے لئے بھلائیوں میں جلدی کررہے ہیں ؟ نہیں بلکہ وہ سمجھتے نہیں ہیں“۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walā yaḥsabanna alladhīna kafarū annamā num'lī lahum khayrun li-anfusihim innamā num'lī lahum liyazdādū ith'man walahum ʿadhābun muhīnun ","translations":["And (let) not","think","those who","disbelieved","that","We give respite","to them","(is) good","for themselves","Only","We give respite","to them","so that they may increase","(in) sins","and for them","(is) a punishment","humiliating","(178)"],"transliterationArr":["walā","yaḥsabanna","alladhīna","kafarū","annamā","num'lī","lahum","khayrun","li-anfusihim","innamā","num'lī","lahum","liyazdādū","ith'man","walahum","ʿadhābun","muhīnun",null],"verseTiming":[[1,0,810],[2,810,2770],[3,2770,3880],[4,3880,5920],[5,5920,7310],[6,7310,8190],[7,8190,8810],[8,8810,9560],[9,9560,12650],[10,12650,14130],[11,14130,15020],[12,15020,15540],[13,15540,18580],[14,18580,20180],[15,20180,20960],[16,20960,21990],[17,21990,25115]]}}