{"name":"3:188","price":"وه لوگ جو اپنے کرتوتوں پر خوش ہیں اور چاہتے ہیں کہ جو انہوں نے نہیں کیا اس پر بھی ان کی تعریفیں کی جائیں آپ انہیں عذاب سے چھٹکارا میں نہ سمجھئے ان کے لئے تو دردناک عذاب ہے.(1)","arabic":"لَا تَحۡسَبَنَّ ٱلَّذِينَ يَفۡرَحُونَ بِمَآ أَتَواْ وَّيُحِبُّونَ أَن يُحۡمَدُواْ بِمَا لَمۡ يَفۡعَلُواْ فَلَا تَحۡسَبَنَّهُم بِمَفَازَةٖ مِّنَ ٱلۡعَذَابِۖ وَلَهُمۡ عَذَابٌ أَلِيمٞ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":481,"juzNumber":4,"footnotes":"(1) اس میں ایسے لوگوں کے لئے سخت وعید ہے جو صرف اپنے واقعی کارناموں پر ہی خوش نہیں ہوتے بلکہ چاہتے ہیں کہ ان کے کھاتے میں وہ کارنامے بھی درج یا ظاہر کئے جائیں جو انہوں نے نہیں کئے ہوتے۔ یہ بیماری جس طرح عہدرسالت کے بعض لوگوں میں تھی جس کے پیش نظر آیات کا نزول ہوا۔ اسی طرح آج بھی جاہ پسند قسم کے لوگوں اور پروپیگنڈے اور دیگر ہتھکنڈوں کے ذریعے سے بننے والے لیڈروں میں یہ بیماری عام ہے۔أَعَاذَنَا اللهُ۔\nآیت کے سباق سے یہ بھی معلوم ہوتا ہے کہ یہودی کتاب الٰہی میں تحریف وکتمان کے مجرم تھے، مگر وہ اپنے ان کرتوتوں پر خوش ہوتے تھے، یہی حال آج کے باطل گروہوں کا بھی ہے، وہ بھی لوگوں کو گمراہ کرکے ، غلط رہنمائی کرکے آیات الٰہی میں معنوی تحریف وتلبیس کرکے بڑے خوش ہوتے ہیں اور دعویٰ یہ کرتے ہیں کہ وہ اہل حق ہیں اور یہ کہ ان کے دجل وفریب کاری کی انہیں داد دی جائے۔قَاتَلَهُمُ اللهُ أَنَّى يُؤْفَكُونَ","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"lā taḥsabanna alladhīna yafraḥūna bimā ataw wayuḥibbūna an yuḥ'madū bimā lam yafʿalū falā taḥsabannahum bimafāzatin mina al-ʿadhābi walahum ʿadhābun alīmun ","translations":["(Do) not","think","(that) those who","rejoice","in what","(they have) brought","and they love","that","they be praised","for what","not","they do ","so (do) not","think (that) they","(will) escape","from","the punishment","and for them","(is a) punishment","painful","(188)"],"transliterationArr":["lā","taḥsabanna","alladhīna","yafraḥūna","bimā","ataw","wayuḥibbūna","an","yuḥ'madū","bimā","lam","yafʿalū","falā","taḥsabannahum","bimafāzatin","mina","al-ʿadhābi","walahum","ʿadhābun","alīmun",null],"verseTiming":[[1,0,510],[2,510,2480],[3,2480,3560],[4,3560,4860],[5,4860,6950],[6,6950,7550],[7,7550,9040],[8,9040,9430],[9,9430,11110],[10,11110,11890],[11,11890,12240],[12,12240,13280],[13,13280,13980],[14,13980,16800],[15,16800,18170],[16,18170,19340],[17,19340,22340],[18,22340,23470],[19,23470,24600],[20,24600,26825]]}}