{"name":"3:186","price":"یقیناً تمہارے مالوں اور جانوں سے تمہاری آزمائش کی جائے گی(1) اور یہ بھی یقین ہے کہ تمہیں ان لوگوں کی جو تم سے پہلے کتاب دیئے گئے اور مشرکوں کی بہت سی دکھ دینے والی باتیں بھی سننی پڑیں گی اور اگر تم صبر کر لو اور پرہیزگاری اختیار کرو تو یقیناً یہ بہت بڑی ہمت کا کام ہے.(2)","arabic":"۞ لَتُبۡلَوُنَّ فِيٓ أَمۡوَٰلِكُمۡ وَأَنفُسِكُمۡ وَلَتَسۡمَعُنَّ مِنَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ مِن قَبۡلِكُمۡ وَمِنَ ٱلَّذِينَ أَشۡرَكُوٓاْ أَذٗى كَثِيرٗاۚ وَإِن تَصۡبِرُواْ وَتَتَّقُواْ فَإِنَّ ذَٰلِكَ مِنۡ عَزۡمِ ٱلۡأُمُورِ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":479,"juzNumber":4,"footnotes":"(1) اہل ایمان کو ان کے ایمان کے مطابق آزمانے کا بیان ہے۔ جیسا کہ سورۃ البقرۃ کی آیت میں گزر چکا ہے۔ اس آیت کی تفسیر میں ایک واقعہ بھی آتا ہے کہ رئیس المنافقین عبداللہ بن ابی نے ابھی اسلام کا اظہار نہیں کیا تھا اور جنگ بدر بھی نہیں ہوئی تھی کہ نبی (صلى الله عليه وسلم) حضرت سعد بن عبادۃ (رضي الله عنه) کی عیادت کے لئے بنی حارث بن خزرج میں تشریف لے گئے۔ راستے میں ایک مجلس میں مشرکین، یہود اور عبداللہ بن ابی وغیرہ بیٹھے ہوئے تھے۔ آپ (صلى الله عليه وسلم) کی سواری سے جو گرد اٹھی، اس نے اس پر بھی ناگواری کا اظہار کیا اور آپ (صلى الله عليه وسلم) نے انہیں ٹھہر کر قبول اسلام کی دعوت بھی دی جس پر عبداللہ بن ابی نے گستاخانہ کلمات بھی کہے۔ وہاں بعض مسلمان بھی تھے، انہوں نے اس کے برعکس آپ (صلى الله عليه وسلم) کی تحسین فرمائی، قریب تھا کہ ان کے مابین جھگڑا ہو جائے، آپ (صلى الله عليه وسلم) نے ان سب کو خاموش کرایا، پھر آپ (صلى الله عليه وسلم) حضرت سعد (رضي الله عنه) کے پاس پہنچے تو انہیں بھی یہ واقعہ سنایا جس پر انہوں نے فرمایا کہ عبداللہ بن ابی یہ باتیں اس لئے کرتا ہے کہ آپ (صلى الله عليه وسلم) کے مدینہ آنے سے قبل، یہاں کے باشندگان کو اس کی تاج پوشی کرنی تھی، آپ (صلى الله عليه وسلم) کے آنے سے اس کی سرداری کا یہ حسین خواب ادھورا رہ گیا جس کا اسے سخت صدمہ ہے اور اس کی یہ باتیں اس کے اس بغض وعناد کا مظہر ہیں۔ اس لئے آپ۔ درگزر ہی سے کام لیں۔ (صحيح البخاري كتاب التفسير ملخصًا)\n(2) اہل کتاب سے مراد یہود ونصاریٰ ہیں۔ یہ نبی (صلى الله عليه وسلم) ، اسلام اور مسلمانوں کے خلاف مختلف انداز سے طعن وتشنیع کرتے رہتے تھے۔ اسی طرح مشرکین عرب کا حال تھا۔ علاوہ ازیں مدینہ میں آنے کے بعد منافقین بالخصوص ان کا رئیس عبداللہ بن ابی بھی آپ (صلى الله عليه وسلم) کی شان میں استخفاف کرتا رہتا تھا۔ آپ کے مدینہ آنے سے قبل اہل مدینہ اپنا سردار بنانے لگے تھے اور اس کے سر پر تاج سیادت رکھنے کی تیاری مکمل ہو چکی تھی کہ آپ (صلى الله عليه وسلم) کے آنے سے اس کا یہ سارا خواب بکھر کر رہ گیا، جس کا اسے شدید صدمہ تھا چنانچہ انتقام کے طور پر بھی یہ شخص آپ کے خلاف سب وشتم کا کوئی موقعہ ہاتھ سے نہیں جانے دیتا تھا (جیسا کہ صحیح بخاری کے حوالے سے اس کی ضرورت تفصیل گزشتہ حاشیہ میں ہی بیان کی گئی ہے) ان حالات میں مسلمانوں کو عفوو درگزر اور صبر اور تقویٰ اختیار کرنے کی تلقین کی جا رہی ہے۔ جس سے معلوم ہوا کہ داعیان حق کا اذیتوں اور مشکلات سے دوچار ہونا اس راہ حق کے ناگزیر مرحلوں میں سے ہے اور اس کا علاج صبر فی اللہ، استعانت باللہ اور رجوع الی اللہ کے سوا کچھ نہیں (ابن کثیر)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"latub'lawunna fī amwālikum wa-anfusikum walatasmaʿunna mina alladhīna ūtū al-kitāba min qablikum wamina alladhīna ashrakū adhan kathīran wa-in taṣbirū watattaqū fa-inna dhālika min ʿazmi al-umūri ","translations":["You will certainly be tested","in","your wealth","and yourselves","And you will certainly hear","from","those who","were given","the Book","from","before you","and from","those who","associate partners with Allah ","hurtful things","many","and if","you are patient","and fear (Allah)","then indeed","that","(is) of","the matters","(of) determination","(186)"],"transliterationArr":["latub'lawunna","fī","amwālikum","wa-anfusikum","walatasmaʿunna","mina","alladhīna","ūtū","al-kitāba","min","qablikum","wamina","alladhīna","ashrakū","adhan","kathīran","wa-in","taṣbirū","watattaqū","fa-inna","dhālika","min","ʿazmi","al-umūri",null],"verseTiming":[[1,0,2480],[2,2480,4600],[3,4600,6060],[4,6060,8300],[5,8300,10880],[6,10880,11210],[7,11210,12360],[8,12360,13070],[9,13070,14240],[10,14240,15250],[11,15250,16500],[12,16500,17080],[13,17080,18160],[14,18160,20580],[15,20580,21130],[16,21130,23790],[17,23790,24990],[18,24990,26140],[19,26140,27330],[20,27330,29030],[21,29030,29920],[22,29920,30330],[23,30330,31010],[24,31010,33645]]}}