{"name":"3:199","price":"یقیناً اہل کتاب میں سے بعض ایسے بھی ہیں جو اللہ تعالیٰ پر ایمان ﻻتے ہیں اور تمہاری طرف جو اتارا گیا ہے اور ان کی جانب جو نازل ہوا اس پر بھی، اللہ تعالیٰ سے ڈرتے ہیں اور اللہ تعالیٰ کی آیتوں کو تھوڑی تھوڑی قیمت پر بیچتے بھی نہیں(1) ، ان کا بدلہ ان کے رب کے پاس ہے، یقیناً اللہ تعالیٰ جلد حساب لینے واﻻ ہے.","arabic":"وَإِنَّ مِنۡ أَهۡلِ ٱلۡكِتَٰبِ لَمَن يُؤۡمِنُ بِٱللَّهِ وَمَآ أُنزِلَ إِلَيۡكُمۡ وَمَآ أُنزِلَ إِلَيۡهِمۡ خَٰشِعِينَ لِلَّهِ لَا يَشۡتَرُونَ بِـَٔايَٰتِ ٱللَّهِ ثَمَنٗا قَلِيلًاۚ أُوْلَٰٓئِكَ لَهُمۡ أَجۡرُهُمۡ عِندَ رَبِّهِمۡۗ إِنَّ ٱللَّهَ سَرِيعُ ٱلۡحِسَابِ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":492,"juzNumber":4,"footnotes":"(1) اس آیت میں اہل کتاب کے اس گروہ کا ذکر ہے جسے رسول کریم (صلى الله عليه وسلم) کی رسالت پر ایمان لانے کا شرف حاصل ہوا۔ ان کے ایمان اور ایمانی صفات کا تذکرہ فرما کر اللہ تعالیٰ نے انہیں دوسرے اہل کتاب سے ممتاز کر دیا، جن کا مشن ہی اسلام، پیغمبر اسلام اور مسلمانوں کے خلاف سازشیں کرنا، آیات الٰہی میں تحریف تلبیس کرنا اور دنیا کے عارضی اور فانی مفادات کے لئے کتمان علم کرنا تھا۔ اللہ تعالیٰ نے فرمایا یہ مومنین اہل کتاب ایسے نہیں ہیں، بلکہ یہ اللہ سے ڈرنے والے ہیں، اللہ کی آیتوں کو تھوڑی تھوڑی قیمت پر بیچنے والے نہیں ہیں، اس کا مطلب یہ ہوا کہ جو علما ومشائخ دنیوی اغراض کے لئے آیات الٰہی میں تحریف یا ان کے مفہوم کے بیان میں دجل وتلبیس سے کام لیتے ہیں، وہ ایمان وتقویٰ سے محروم ہیں۔ حافظ ابن کثیر نے لکھا ہے کہ آیت میں جن مومنین اہل کتاب کا ذکر ہے، یہود میں سے ان کی تعداد دس تک بھی نہیں پہنچتی البتہ عیسائی بڑی تعداد میں مسلمان ہوئے اور انہوں نے دین حق کو اپنایا۔ (تفسیر ابن کثیر)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-inna min ahli al-kitābi laman yu'minu bil-lahi wamā unzila ilaykum wamā unzila ilayhim khāshiʿīna lillahi lā yashtarūna biāyāti al-lahi thamanan qalīlan ulāika lahum ajruhum ʿinda rabbihim inna al-laha sarīʿu al-ḥisābi ","translations":["And indeed","among","(the) People","(of) the Book","(are those) who","believe","in Allah","and what","was revealed","to you","and what","was revealed","to them ","humbly submissive","to Allah","Not","(do) they exchange","[with] (the) Verses","(of) Allah","(for) a price","little","Those","for them","their reward","(is) with","their Lord","Indeed","Allah","(is) swift","(in taking) the account","(199)"],"transliterationArr":["wa-inna","min","ahli","al-kitābi","laman","yu'minu","bil-lahi","wamā","unzila","ilaykum","wamā","unzila","ilayhim","khāshiʿīna","lillahi","lā","yashtarūna","biāyāti","al-lahi","thamanan","qalīlan","ulāika","lahum","ajruhum","ʿinda","rabbihim","inna","al-laha","sarīʿu","al-ḥisābi",null],"verseTiming":[[1,0,1710],[2,1710,2130],[3,2130,2740],[4,2740,3770],[5,3770,4220],[6,4220,5830],[7,5830,6880],[8,6880,8800],[9,8800,9990],[10,9990,11100],[11,11100,12940],[12,12940,14230],[13,14230,15330],[14,15330,18170],[15,18170,19580],[16,19580,20680],[17,20680,21150],[18,21150,22470],[19,22470,23790],[20,23790,24660],[21,24660,26160],[22,26160,27830],[23,27830,30010],[24,30010,30600],[25,30600,31690],[26,31690,32990],[27,32990,34440],[28,34440,35480],[29,35480,36370],[30,36370,37280],[31,37280,40714]]}}