{"name":"3:196","price":"تجھے کافروں کا شہروں میں چلنا پھرنا فریب میں نہ ڈال دے.(1)","arabic":"لَا يَغُرَّنَّكَ تَقَلُّبُ ٱلَّذِينَ كَفَرُواْ فِي ٱلۡبِلَٰدِ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":489,"juzNumber":4,"footnotes":"(1) خطاب اگرچہ نبی (صلى الله عليه وسلم) سے ہے لیکن مخاطب پوری امت ہے شہر میں چلنے پھرنے سے مراد تجارت وکاروبار کے لئے ایک شہر سے دوسرے شہر یا ایک ملک سے دوسرے ملک جانا ہے۔ یہ تجارتی سفر وسائل دنیا کی فراوانی اور کاروبار کے وسعت وفروغ کی دلیل ہوتا ہے۔ اللہ تعالیٰ فرماتا ہے، یہ سب کچھ عارضی اور چند روزہ فائدہ ہے، اس سے اہل ایمان کو دھوکہ میں مبتلا نہیں ہو چاہئے، اصل انجام پر نظر رکھنی چاہئے، جو ایمان سے محرومی کی صورت میں جہنم کا دائمی عذاب ہے جس میں دولت دنیا سے مالا مال یہ کافر مبتلا ہوں گے۔ یہ مضمون اور بھی متعدد مقامات پر بیان کیا گیا ہے۔ مثلاً «مَا يُجَادِلُ فِي آيَاتِ اللَّهِ إِلا الَّذِينَ كَفَرُوا فَلا يَغْرُرْكَ تَقَلُّبُهُمْ فِي الْبِلادِ» ( سورۃ المومن: 4) ”اللہ کی آیتوں میں وہی لوگ جھگڑتے ہیں جو کافر ہیں، پس ان کا شہروں میں چلنا پھرنا آپ کو دھوکے میں نہ ڈالے“۔ «إِنَّ الَّذِينَ يَفْتَرُونَ عَلَى اللَّهِ الْكَذِبَ لا يُفْلِحُونَ، مَتَاعٌ فِي الدُّنْيَا ثُمَّ إِلَيْنَا مَرْجِعُهُمْ» (سورۂ یونس: 69-70) «نُمَتِّعُهُمْ قَلِيلا ثُمَّ نَضْطَرُّهُمْ إِلَى عَذَابٍ غَلِيظٍ» ( سورۂ لقمان:24)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"lā yaghurrannaka taqallubu alladhīna kafarū fī al-bilādi ","translations":["(Let) not","deceive you","(the) movement","(of) those who","disbelieved","in","the land","(196)"],"transliterationArr":["lā","yaghurrannaka","taqallubu","alladhīna","kafarū","fī","al-bilādi",null],"verseTiming":[[1,0,480],[2,480,2750],[3,2750,3800],[4,3800,4870],[5,4870,5790],[6,5790,6040],[7,6040,8905]]}}