{"name":"3:191","price":"جو اللہ تعالیٰ کا ذکر کھڑے اور بیٹھے اور اپنی کروٹوں پر لیٹے ہوئے کرتے ہیں اور آسمانوں وزمین کی پیدائش میں غوروفکر کرتے ہیں اور کہتے ہیں اے ہمارے پروردگار! تو نے یہ بے فائده نہیں بنایا، تو پاک ہے پس ہمیں آگ کے عذاب سے بچا لے.(1)","arabic":"ٱلَّذِينَ يَذۡكُرُونَ ٱللَّهَ قِيَٰمٗا وَقُعُودٗا وَعَلَىٰ جُنُوبِهِمۡ وَيَتَفَكَّرُونَ فِي خَلۡقِ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ رَبَّنَا مَا خَلَقۡتَ هَٰذَا بَٰطِلٗا سُبۡحَٰنَكَ فَقِنَا عَذَابَ ٱلنَّارِ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":484,"juzNumber":4,"footnotes":"(1) ان دس آیات میں سے پہلی آیت میں اللہ تبارک وتعالیٰ نے اپنی قدرت وطاقت کی چند نشانیاں بیان فرمائی ہیں اور فرمایا ہے کہ یہ نشانیاں ضرور ہیں لیکن کن کے لئے؟ اہل عقل ودانش کے لئے اس کا مطلب یہ ہوا کہ ان عجائبات تخلیق اور قدرت الٰہیہ کو دیکھ کر بھی جس شخص کو باری تعالیٰ کا عرفان حاصل نہ ہو، وہ اہل دانش ہی نہیں۔ لیکن یہ المیہ بھی بڑا عجیب ہے کہ عالم اسلام میں (دانش ور) سمجھا ہی اس کو جاتا ہے جو اللہ تعالیٰ کے بارے میں تشکیک کا شکار ہو۔فَإِنَّا للهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ دوسری آیت میں اہل دانش کے ذوق ذکر الٰہی اور ان کا آسمان وزمین کی تخلیق میں غوروفکر کرنے کا بیان ہے۔ جیسا کہ حدیث میں بھی آتا ہے نبی (صلى الله عليه وسلم) نے فرمایا ”کھڑے ہو کر نماز پڑھو۔ اگر کھڑے ہو کر نہیں پڑھ سکتے تو بیٹھ کر اور بیٹھ کر نہیں پڑھ سکتے تو کروٹ کے بل لیٹے لیٹے ہی نماز پڑھ لو“ (صحیح بخاری کتاب الصلٰوۃ) ایسے لوگ جو ہر وقت اللہ کو یاد کرتے اور رکھتے ہیں اور آسمان وزمین کی تخلیق اور اس کی حکمتوں پر غور کرتے ہیں جن سے خالق کائنات کی عظمت وقدرت،اس کا علم واختیار اور اس کی رحمت وربوبیت کی صحیح معرفت انہیں حاصل ہوتی ہے تو وہ بے اختیار پکار اٹھتے ہیں کہ رب کائنات نے یہ کائنات یوں ہی بے مقصد نہیں بنائی ہے بلکہ اس سے مقصد بندوں کا امتحان ہے۔ جو امتحان میں کامیاب ہوگیا، اس کے لئے ابدالاباد تک جنت کی نعمتیں ہیں اور جو ناکام ہوا اس کے لئے عذاب نار ہے۔ اس لئے وہ عذاب نار سے بچنے کی دعا بھی کرتے ہیں۔ اس کے بعد والی تین آیات میں بھی مغفرت اور قیامت کے دن کی رسوائی سے بچنے کی دعائیں ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"alladhīna yadhkurūna al-laha qiyāman waquʿūdan waʿalā junūbihim wayatafakkarūna fī khalqi al-samāwāti wal-arḍi rabbanā mā khalaqta hādhā bāṭilan sub'ḥānaka faqinā ʿadhāba al-nāri ","translations":["Those who","remember","Allah","standing","and sitting","and on","their sides","and they reflect","on","(the) creation","(of) the heavens","and the earth","Our Lord","not","You have created","this","(in) vain","Glory be to You","so save us","(from the) punishment","(of) the Fire","(191)"],"transliterationArr":["alladhīna","yadhkurūna","al-laha","qiyāman","waquʿūdan","waʿalā","junūbihim","wayatafakkarūna","fī","khalqi","al-samāwāti","wal-arḍi","rabbanā","mā","khalaqta","hādhā","bāṭilan","sub'ḥānaka","faqinā","ʿadhāba","al-nāri",null],"verseTiming":[[1,0,1240],[2,1240,2510],[3,2510,3380],[4,3380,4380],[5,4380,6010],[6,6010,7410],[7,7410,8660],[8,8660,12280],[9,12280,14040],[10,14040,14450],[11,14450,15110],[12,15110,16620],[13,16620,17600],[14,17600,18760],[15,18760,19090],[16,19090,20070],[17,20070,20890],[18,20890,22240],[19,22240,24220],[20,24220,25300],[21,25300,25730],[22,25730,26610],[23,26610,27550],[24,27550,29340],[25,29340,30720],[26,30720,31530],[27,31530,32450],[28,32450,35525]]}}