{"name":"3:19","price":"بے شک اللہ تعالیٰ کے نزدیک دین اسلام ہی ہے(1) ، اور اہل کتاب نے اپنے پاس علم آجانے کے بعد آپس کی سرکشی اور حسد کی بنا پر ہی اختلاف کیا ہے(2) اور اللہ تعالیٰ کی آیتوں کے ساتھ جو بھی کفر کرے(3) اللہ تعالیٰ اس کا جلد حساب لینے واﻻ ہے۔","arabic":"إِنَّ ٱلدِّينَ عِندَ ٱللَّهِ ٱلۡإِسۡلَٰمُۗ وَمَا ٱخۡتَلَفَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ إِلَّا مِنۢ بَعۡدِ مَا جَآءَهُمُ ٱلۡعِلۡمُ بَغۡيَۢا بَيۡنَهُمۡۗ وَمَن يَكۡفُرۡ بِـَٔايَٰتِ ٱللَّهِ فَإِنَّ ٱللَّهَ سَرِيعُ ٱلۡحِسَابِ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":312,"juzNumber":3,"footnotes":"(1) اسلام وہی دین ہے جس کی دعوت وتعلیم ہر پیغمبر اپنے اپنے دور میں دیتے رہے ہیں اور اب اس کی کامل ترین شکل وہ ہے جسے نبی آخرالزمان حضرت محمد (صلى الله عليه وسلم) نے دنیا کے سامنے پیش کیا، جس میں توحید ورسالت اور آخرت پر اس طرح یقین وایمان رکھنا ہے جس طرح نبی کریم (صلى الله عليه وسلم) نے بتلایا ہے۔ اب محض یہ عقیدہ رکھ لینا کہ اللہ ایک ہے یا کچھ اچھے عمل کر لینا، یہ اسلام نہیں نہ اس سے نجات آخرت ہی ملے گی۔ ایمان واسلام اوردین یہ ہے کہ اللہ کوایک مانا جائے اور صرف اسی ایک معبود کی عبادت کی جائے، محمد رسول اللہ (صلى الله عليه وسلم) سمیت تمام انبیاء پر ایمان لایا جائے۔ اور نبی (صلى الله عليه وسلم) کی ذات پر رسالت کا خاتمہ تسلیم کیاجائے اورایمانیات کے ساتھ ساتھ وہ عقائد واعمال اختیار کئے جائیں جو قرآن کریم میں یا حدیث رسول (صلى الله عليه وسلم) میں بیان کئے گئے ہیں۔ اب اس دین اسلام کے سوا کوئی اور دین عنداللہ قبول نہیں ہو گا۔ «وَمَنْ يَبْتَغِ غَيْرَ الإِسْلامِ دِينًا فَلَنْ يُقْبَلَ مِنْهُ وَهُوَ فِي الآخِرَةِ مِنَ الْخَاسِرِينَ» (آل عمران: 85) نبی (صلى الله عليه وسلم) کی رسالت پوری انسانیت کے لئے ہے۔ «قُلْ يَا أَيُّهَا النَّاسُ إِنِّي رَسُولُ اللَّهِ إِلَيْكُمْ جَمِيعًا» (الأعراف: 158) ”کہہ دیجئے! اے لوگو! میں تم سب کی طرف اللہ کا رسول ہوں“، «تَبَارَكَ الَّذِي نَزَّلَ الْفُرْقَانَ عَلَى عَبْدِهِ لِيَكُونَ لِلْعَالَمِينَ نَذِيرًا» (الفرقان: 1) ”برکتوں والی ہے وہ ذات جس نے اپنے بندے پر فرقان نازل کیا تاکہ وہ جہانوں کا ڈرانے والا ہو“ اور حدیث میں ہے، نبی (صلى الله عليه وسلم) نے فرمایا ”قسم ہے اس ذات کی جس کے ہاتھ میں میری جان ہے، جو یہودی یا نصرانی مجھ پرایمان لائے بغیر فوت ہوگیا، وہ جہنمی ہے۔“ (صحیح مسلم) مزید فرمایا ”بُعِثْتُ إِلَى الأَحْمَرِ وَالأَسْوَدِ“ ”میں احمرواسود (یعنی تمام انسانوں کے لئے نبی بناکربھیجا گیاہوں“ اسی لئے آپ (صلى الله عليه وسلم) نے اپنے وقت کے تمام سلاطین اور بادشاہوں کوخطوط تحریر فرمائے جن میں انہیں اسلام قبول کرنے کی دعوت دی (صحیحین۔ بحوالہ ابن کثیر )\n(2) ان کے اس باہمی اختلاف سے مراد وہ اختلاف ہے جو ایک ہی دین کے ماننے والوں نے آپس میں برپا کر رکھا تھا مثلاً یہودیوں کے باہمی اختلافات اور فرقہ بندیاں۔ اسی طرح عیسائیوں کے باہمی اختلافات اور فرقہ بندیاں، پھر وہ اختلاف بھی مراد ہے جواہل کتاب کے درمیان آپس میں تھا۔ اور جس کی بناپر یہودی نصرانیوں کو اورنصرانی یہودیوں کوکہاکرتے تھے (تم کسی چیز پر نہیں ہو۔) نبوت محمدی (صلى الله عليه وسلم) اور نبوت عیسیٰ (عليه السلام) کے بارے میں اختلاف بھی اسی ضمن میں آتا ہے۔ علاوہ ازیں یہ سارے اختلافات دلائل کی بنیاد پر نہیں تھے، محض حسد اوربغض وعناد کی وجہ سے تھے یعنی وہ لوگ حق کو جاننے اورپہچاننے کے باوجود محض اپنے خیالی دنیاوی مفاد کے چکر میں غلط بات پر جمے رہتے اور اس کو دین باور کراتے تھے۔ تاکہ ان کی ناک بھی اونچی رہے اور ان کاعوامی حلقۂ ارادت بھی قائم رہے۔ افسوس آج مسلمان علما کی ایک بڑی تعداد ٹھیک انہی غلط مقاصد کے لئے ٹھیک اسی غلط ڈگر پر چل رہی ہے۔ -هَدَاهُمُ اللهُ وَإِيَّانَا-\n(3) یہاں ان آیتوں سے مراد وہ آیات ہیں جو اسلام کے دین الٰہی ہونے پر دلالت کرتی ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"inna al-dīna ʿinda al-lahi al-is'lāmu wamā ikh'talafa alladhīna ūtū al-kitāba illā min baʿdi mā jāahumu al-ʿil'mu baghyan baynahum waman yakfur biāyāti al-lahi fa-inna al-laha sarīʿu al-ḥisābi ","translations":["Indeed","the religion","near","Allah","(is) Islam","And not","differed","those who","were given","the Book","except","from","after","[what]","came to them","[the] knowledge","out of envy","among them","And whoever","disbelieves","in (the) Verses","(of) Allah","then indeed","Allah","(is) swift","(in taking) account","(19)"],"transliterationArr":["inna","al-dīna","ʿinda","al-lahi","al-is'lāmu","wamā","ikh'talafa","alladhīna","ūtū","al-kitāba","illā","min","baʿdi","mā","jāahumu","al-ʿil'mu","baghyan","baynahum","waman","yakfur","biāyāti","al-lahi","fa-inna","al-laha","sarīʿu","al-ḥisābi",null],"verseTiming":[[1,0,1190],[2,1190,2020],[3,2020,3280],[4,3280,4160],[5,4160,7160],[6,7160,7930],[7,7930,8790],[8,8790,9820],[9,9820,10500],[10,10500,11590],[11,11590,12410],[12,12410,13450],[13,13450,14120],[14,14120,14510],[15,14510,16740],[16,16740,17590],[17,17590,18990],[18,18990,20420],[19,20420,21510],[20,21510,22370],[21,22370,23750],[22,23750,24570],[23,24570,25820],[24,25820,26720],[25,26720,27590],[26,27590,30035]]}}