{"name":"3:2","price":"اللہ تعالیٰ وه ہے جس کے سوا کوئی معبود نہیں، جو زنده اور سب کا نگہبان ہے۔(1)","arabic":"ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡحَيُّ ٱلۡقَيُّومُ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":295,"juzNumber":3,"footnotes":"(1) حَيّ اور قَيُّومٌ اللہ تعالیٰ کی خاص صفات ہیں حی کا مطلب وہ ازل سے ہے اور ابد تک رہے گا، اسے موت اور فنا نہیں۔ قیوم کا مطلب ساری کائنات کا قائم رکھنے والا، محافظ اور نگران، ساری کائنات اس کی محتاج وہ کسی کا محتاج نہیں۔ عیسائی حضرت عیسیٰ کو اللہ یا ابن اللہ یا تین میں سے ایک مانتےتھے۔ گویا ان کو کہا جا رہا ہے کہ جب حضرت عیسیٰ (عليه السلام) بھی اللہ کی مخلوق ہیں، وہ ماں کے پیٹ سے پیدا ہوئے اور ان کا زمانۂ ولادت بھی تخلیق کائنات سے بہت عرصے بعد کا ہے تو پھر وہ اللہ، یا اللہ کا بیٹا کس طرح ہو سکتے ہیں؟ اگر تمہارا عقیدہ صحیح ہوتا تو انہیں مخلوق کے بجائے الوہی صفات کا حامل اور قدیم ہونا چاہیےتھا۔ نیز ان پر موت بھی نہیں آنی چاہیے لیکن ایک وقت آئے گا کہ وہ موت سے بھی ہمکنار ہوں گے۔ اور عیسائیوں کے بقول ہمکنار ہو چکے۔ احادیث میں آتا ہے کہ تین آیتوں میں اللہ کا اسم اعظم ہے جس کے ذریعے سے دعا کی جائے تو وہ رد نہیں ہوتی۔ ایک یہی آل عمران کی آیت، دوسری آیت الکرسی میں «اللَّهُ لا إِلَهَ إِلا هُوَ الْحَيُّ الْقَيُّومُ» اور تیسری سورء طٰہ میں «وَعَنَتِ الْوُجُوهُ لِلْحَيِّ الْقَيُّومِ» (ابن کثیر۔ تفسیر آیت الکرسی )","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"al-lahu lā ilāha illā huwa al-ḥayu al-qayūmu ","translations":["Allah ","(there is) no","God","except","Him","the Ever-Living","the Sustainer of all that exists","(2)"],"transliterationArr":["al-lahu","lā","ilāha","illā","huwa","al-ḥayu","al-qayūmu",null],"verseTiming":[[1,0,1060],[2,1060,2940],[3,2940,3790],[4,3790,4610],[5,4610,4980],[6,4980,5910],[7,5910,9575]]}}