{"name":"3:200","price":"اے ایمان والو! تم ﺛابت قدم رہو(1) اور ایک دوسرے کو تھامے رکھو اور جہاد کے لئے تیار رہو اور اللہ تعالیٰ سے ڈرتے رہو تاکہ تم مراد کو پہنچو۔","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱصۡبِرُواْ وَصَابِرُواْ وَرَابِطُواْ وَٱتَّقُواْ ٱللَّهَ لَعَلَّكُمۡ تُفۡلِحُونَ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":493,"juzNumber":4,"footnotes":"(1) صبر کرو یعنی طاعات کے اختیار کرنے اور شہوات ولذات کے ترک کرنے میں اپنے نفس کو مضبوط اور ثابت قدم رکھو۔ مصابرۃ (صابروا) جنگ کی شدتوں میں دشمن کے مقابلے میں ڈٹے رہنا، یہ صبر کی سخت ترین صورت ہے۔ اس لئے اسے علیحدہ بیان فرمایا۔ رابطوا میدان جنگ یا محاذ جنگ میں مورچہ بند ہو کر ہمہ وقت چوکنا اور جہاد کے لئے تیار رہنا مرابطہ ہے۔ یہ بھی بڑےعزم وحوصلہ کا کام ہے۔ اسی لئے حدیث میں اس کی یہ فضیلت بیان کی گئی ہے۔ «رِبَاطُ يَوْمٍ فِي سَبِيلِ اللهِ خَيْرٌ مِنَ الدُّنْيَا وَمَا عَلَيْهَا» (صحیح بخاری، باب فضل رباط یوم فی سبیل اللہ) ”اللہ کے راستے (جہاد) میں ایک دن پڑاؤ ڈالنا (یعنی مورچہ بند ہونا) دنیا ومافیہا سے بہتر ہے“، علاوہ ازیں حدیث میں مکارہ (یعنی ناگواری کے حالات میں) مکمل وضو کرنے، مسجدوں میں زیادہ دور سے چل کر جانے اور نماز کے بعد دوسری نماز کے انتظار کرنے کو بھی رباط کہا گیا ہے۔ (صحیح مسلم،کتاب الطہارۃ )","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāayyuhā alladhīna āmanū iṣ'birū waṣābirū warābiṭū wa-ittaqū al-laha laʿallakum tuf'liḥūna ","translations":["O you","who","believe[d]","Be steadfast","and [be] patient","and [be] constant","and fear","Allah","so that you may","(be) successful","(200)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","iṣ'birū","waṣābirū","warābiṭū","wa-ittaqū","al-laha","laʿallakum","tuf'liḥūna",null],"verseTiming":[[1,0,2733],[2,2733,3880],[3,3880,4772],[4,4772,5674],[5,5674,6705],[6,6705,8145],[7,8145,9715],[8,9715,11105],[9,11105,12655],[10,12655,13485],[11,13485,14475],[12,14475,15885],[13,15885,21120]]}}