{"name":"3:27","price":"تو ہی رات کو دن میں داخل کرتا ہے اور دن کو رات میں لے جاتا ہے(1) ، تو ہی بے جان سے جاندار پیدا کرتا ہے اور تو ہی جاندار سے بے جان پیدا کرتا ہے(2)، تو ہی ہے کہ جسے چاہتا ہے بے شمار روزی دیتا ہے۔","arabic":"تُولِجُ ٱلَّيۡلَ فِي ٱلنَّهَارِ وَتُولِجُ ٱلنَّهَارَ فِي ٱلَّيۡلِۖ وَتُخۡرِجُ ٱلۡحَيَّ مِنَ ٱلۡمَيِّتِ وَتُخۡرِجُ ٱلۡمَيِّتَ مِنَ ٱلۡحَيِّۖ وَتَرۡزُقُ مَن تَشَآءُ بِغَيۡرِ حِسَابٖ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":320,"juzNumber":3,"footnotes":"(1) رات کو دن میں اور دن کو رات میں داخل کرنے کا مطلب موسمی تغیرات ہیں۔ رات لمبی ہوتی ہے تو دن چھوٹا ہو جاتا ہے اور دوسرے موسم میں اس کے برعکس دن لمبا اور رات چھوٹی ہو جاتی ہے۔ یعنی کبھی رات کا حصہ دن میں اور کبھی دن کا حصہ رات میں داخل کردیتا ہے جس سے رات اور دن چھوٹے یا بڑے ہوجاتے ہیں۔\n(2) جیسے نطفہ (مردہ) پہلے زندہ انسان سے نکالتا ہے پھر اس مردہ (نطفہ) سے انسان۔ اسی طرح مردہ انڈے سے پہلے مرغی اور پھر زندہ مرغی سے انڈہ (مردہ) یا کافر سے مومن اور مومن سے کافر پیدا فرماتا ہے۔ بعض روایات میں ہے کہ حضرت معاذ (رضي الله عنه) نے نبی (صلى الله عليه وسلم) سے اپنے اوپر قرض کی شکایت کی تو آپ (صلى الله عليه وسلم) نے فرمایا کہ ”تم آیت «قُلِ اللَّهُمَّ مَالِكَ الْمُلْكِ» (آل عمران) پڑھ کر یہ دعا کرو ”رَحْمَنَ الدُّنْيَا وَالآخِرَةِ وَرَحِيمَهُمَا تُعْطِي مَنْ تَشَاءُ مِنْهُمَا وَتَمْنَعُ مَنْ تَشَاءُ، ارْحَمْنِي رَحْمَةً تُغْنِينِي بِهَا عَنْ رَحْمَةِ مَنْ سِوَاكَ، اللَّهُمَّ أغْنِنِي مِنَ الْفَقْرِ، وَاقْضِ عَنِّي الدَّيْنَ“ ایک دوسری روایت میں ہے کہ ”یہ ایسی دعا ہے کہ تم پر احد پہاڑ جتنا قرض بھی ہو تواللہ تعالیٰ اس کی ادائیگی کا تمہارے لئے انتظام فرما دے گا۔“ (مجمع الزوائد: 10/186- رجاله ثقات)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"tūliju al-layla fī al-nahāri watūliju al-nahāra fī al-layli watukh'riju al-ḥaya mina al-mayiti watukh'riju al-mayita mina al-ḥayi watarzuqu man tashāu bighayri ḥisābin ","translations":["You cause to enter","the night","in","the day","and You cause to enter","the day","in","the night","and You bring forth","the living","from","the dead","and You bring forth","the dead","from","the living","and You give provision","(to) whom","You will","without","measure","(27)"],"transliterationArr":["tūliju","al-layla","fī","al-nahāri","watūliju","al-nahāra","fī","al-layli","watukh'riju","al-ḥaya","mina","al-mayiti","watukh'riju","al-mayita","mina","al-ḥayi","watarzuqu","man","tashāu","bighayri","ḥisābin",null],"verseTiming":[[1,0,970],[2,970,1880],[3,1880,2060],[4,2060,3340],[5,3340,4390],[6,4390,6020],[7,6020,6250],[8,6250,8900],[9,8900,9880],[10,9880,10730],[11,10730,11100],[12,11100,12260],[13,12260,13220],[14,13220,14340],[15,14340,14760],[16,14760,15300],[17,15300,17000],[18,17000,17810],[19,17810,20180],[20,20180,20990],[21,20990,23235]]}}