{"name":"3:28","price":"مومنوں کو چاہئے کہ ایمان والوں کو چھوڑ کر کافروں کو اپنا دوست نہ بنائیں(1) اور جوایسا کرے گا وه اللہ تعالیٰ کی کسی حمایت میں نہیں مگر یہ کہ ان کے شر سے کسی طرح بچاؤ مقصود ہو(2)، اور اللہ تعالیٰ خود تمہیں اپنی ذات سے ڈرا رہا ہے اور اللہ تعالیٰ ہی کی طرف لوٹ جانا ہے۔","arabic":"لَّا يَتَّخِذِ ٱلۡمُؤۡمِنُونَ ٱلۡكَٰفِرِينَ أَوۡلِيَآءَ مِن دُونِ ٱلۡمُؤۡمِنِينَۖ وَمَن يَفۡعَلۡ ذَٰلِكَ فَلَيۡسَ مِنَ ٱللَّهِ فِي شَيۡءٍ إِلَّآ أَن تَتَّقُواْ مِنۡهُمۡ تُقَىٰةٗۗ وَيُحَذِّرُكُمُ ٱللَّهُ نَفۡسَهُۥۗ وَإِلَى ٱللَّهِ ٱلۡمَصِيرُ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":321,"juzNumber":3,"footnotes":"(1) اولیا ولی کی جمع ہے۔ ولی ایسے دوست کو کہتے ہیں جس سے ولی محبت اورخصوصی تعلق ہو۔ جیسے اللہ تعالیٰ نے اپنے آپ کو اہل ایمان کا ولی قرار دیا ہے۔ «للَّهُ وَلِيُّ الَّذِينَ آمَنُوا» ( البقرۃ: 257) یعنی ”اللہ اہل ایمان کا ولی ہے“۔ مطلب یہ ہوا کہ اہل ایمان کو ایک دوسرے سے محبت اور خصوصی تعلق ہے اور وہ آپس میں ایک دوسرے کے ولی (دوست) ہیں۔ اللہ تعالیٰ نے یہاں اہل ایمان کو اس بات سے سختی کے ساتھ منع فرمایا ہے کہ وہ کافروں کو اپنا دوست بنائیں۔ کیونکہ کافر اللہ کے بھی دشمن ہیں اور اہل ایمان کے بھی دشمن ہیں۔ تو پھر ان کو دوست بنانے کا جواز کس طرح ہو سکتا ہے؟ اس لئے اللہ تعالیٰ نے اس مضمون کو قرآن کریم میں کئی جگہ بڑی وضاحت کے ساتھ بیان فرمایا ہے تاکہ اہل ایمان کافروں کی موالات (دوستی) اور ان سے خصوصی تعلق قائم کرنے سے گریز کریں۔ البتہ حسب ضرورت ومصلحت ان سے صلح ومعاہدہ بھی ہو سکتا ہے اور تجارتی لین دین بھی۔ اسی طرح جو کافر، مسلمانوں کے دشمن نہ ہوں، ان سے حسن سلوک اور مدارات کا معاملہ بھی جائز ہے (جس کی تفصیل سورۂ ممتحنہ میں ہے) کیونکہ یہ سارے معاملات، موالات (دوستی ومحبت) سے مختلف ہے۔\n(2) یہ اجازت ان مسلمانوں کے لئے ہے جو کسی کافر حکومت میں رہتے ہوں کہ ان کے لئے اگر کسی وقت اظہار دوستی کے بغیر ان کے شر سے بچنا ممکن نہ ہو تو وہ زبان سے ظاہری طور پر دوستی کا اظہار کرسکتے ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"lā yattakhidhi al-mu'minūna al-kāfirīna awliyāa min dūni al-mu'minīna waman yafʿal dhālika falaysa mina al-lahi fī shayin illā an tattaqū min'hum tuqātan wayuḥadhirukumu al-lahu nafsahu wa-ilā al-lahi al-maṣīru ","translations":["(Let) not","take","the believers","the disbelievers","(as) allies","from","instead of","the believers","And whoever","does","that","then not he (has)","from","Allah","in","anything","except","that","you fear","from them","(as) a precaution","And warns you","Allah","(of) Himself","and to","Allah","(is) the final return","(28)"],"transliterationArr":["lā","yattakhidhi","al-mu'minūna","al-kāfirīna","awliyāa","min","dūni","al-mu'minīna","waman","yafʿal","dhālika","falaysa","mina","al-lahi","fī","shayin","illā","an","tattaqū","min'hum","tuqātan","wayuḥadhirukumu","al-lahu","nafsahu","wa-ilā","al-lahi","al-maṣīru",null],"verseTiming":[[1,0,720],[2,720,1740],[3,1740,3100],[4,3100,4570],[5,4570,7310],[6,7310,8130],[7,8130,8770],[8,8770,11940],[9,11940,12600],[10,12600,14100],[11,14100,14860],[12,14860,15750],[13,15750,16060],[14,16060,17000],[15,17000,17400],[16,17400,18250],[17,18250,20560],[18,20560,21430],[19,21430,22570],[20,22570,23380],[21,23380,26130],[22,26130,28250],[23,28250,29140],[24,29140,30370],[25,30370,30940],[26,30940,31850],[27,31850,35045]]}}