{"name":"3:37","price":"پس اسے اس کے پروردگار نے اچھی طرح قبول فرمایا اور اسے بہترین پرورش دی۔ اس کی خیر خبر لینے واﻻ زکریا (علیہ السلام) کو بنایا(1) ، جب کبھی زکریا (علیہ السلام) ان کے حجرے میں جاتے ان کے پاس روزی رکھی ہوئی پاتے(2)، وه پوچھتے اے مریم! یہ روزی تمہارے پاس کہاں سے آئی؟ وه جواب دیتیں کہ یہ اللہ تعالیٰ کے پاس سے ہے، بے شک اللہ تعالیٰ جسے چاہے بے شمار روزی دے۔","arabic":"فَتَقَبَّلَهَا رَبُّهَا بِقَبُولٍ حَسَنٖ وَأَنۢبَتَهَا نَبَاتًا حَسَنٗا وَكَفَّلَهَا زَكَرِيَّاۖ كُلَّمَا دَخَلَ عَلَيۡهَا زَكَرِيَّا ٱلۡمِحۡرَابَ وَجَدَ عِندَهَا رِزۡقٗاۖ قَالَ يَٰمَرۡيَمُ أَنَّىٰ لَكِ هَٰذَاۖ قَالَتۡ هُوَ مِنۡ عِندِ ٱللَّهِۖ إِنَّ ٱللَّهَ يَرۡزُقُ مَن يَشَآءُ بِغَيۡرِ حِسَابٍ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":330,"juzNumber":3,"footnotes":"(1) حضرت زکریا (عليه السلام) ، حضرت مریم علیہا السلام کے خالو بھی تھے، اس لئے بھی، علاوہ ازیں اپنے وقت کے پیغمبر ہونے کے لحاظ سے بھی وہی سب سے بہتر کفیل بن سکتے تھے جو حضرت مریم علیہاالسلام کی مادی ضروریات اور علمی واخلاقی تربیت کے تقاضوں کا صحیح اہتمام کر سکتے تھے۔\n(2) مِحْرَابٌ سے مراد حجرہ ہے جس میں حضرت مریم علیہا السلام رہائش پذیر تھیں۔ رزق سے مراد پھل۔ یہ پھل ایک تو غیر موسمی ہوتے، گرمی کے پھل سردی کے موسم میں اور سردی کے گرمی کے موسم میں ان کے کمرے میں موجود ہوتے، دوسرے حضرت زکریا (عليه السلام) یا کوئی اور شخص لا کر دینے والا نہیں تھا۔ اس لئے حضرت زکریا (عليه السلام) نے از راہ تعجب وحیرت پوچھا کہ یہ کہاں سے آئے؟ انہوں نے کہا اللہ کی طرف سے۔ یہ گویا حضرت مریم علیہا السلام کی کرامت تھی۔ معجزہ اور کرامت خرق عادت امور کو کہا جاتا ہے یعنی جو ظاہری اور عادی اسباب کے خلاف ہو۔ یہ کسی نبی کے ہاتھ پر ظاہر ہو تو اسے معجزہ اور کسی ولی کے ہاتھ پر ظاہر ہو تو اسے کرامت کہا جاتا ہے۔ یہ دونوں برحق ہیں۔ تاہم ان کا صدور اللہ کے حکم اور اس کی مشیت سے ہوتا ہے۔ نبی یا ولی کے اختیار میں یہ بات نہیں کہ وہ معجزہ اور کرامت، جب چاہے صادر کر دے۔ اس لئے معجزہ اور کرامت اس بات کی تو دلیل ہوتی ہے کہ یہ حضرات اللہ کی بارگاہ میں خاص مقام رکھتے ہیں لیکن اس سے یہ امر ثابت نہیں ہوتا کہ ان مقبولین بارگاہ کے پاس کائنات میں تصرف کرنے کا اختیار ہے، جیسا کہ اہل بدعت اولیا کی کرامتوں سے عوام کو یہی کچھ باور کرا کے انہیں شرکیہ عقیدوں میں مبتلا کر دیتے ہیں اس کی مزید وضاحت بعض معجزات کے ضمن میں آئے گی۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"fataqabbalahā rabbuhā biqabūlin ḥasanin wa-anbatahā nabātan ḥasanan wakaffalahā zakariyyā kullamā dakhala ʿalayhā zakariyyā al-miḥ'rāba wajada ʿindahā riz'qan qāla yāmaryamu annā laki hādhā qālat huwa min ʿindi al-lahi inna al-laha yarzuqu man yashāu bighayri ḥisābin ","translations":["So accepted her","her Lord","with acceptance","good","and reared her ","a rearing","good","and put her in (the) care","(of) Zakariya","Whenever","entered","upon her","Zakariya","[the] prayer chamber","he found","with her","provision","He said","O Maryam","From where","for you","(is) this","She said","This","(is)","from","Allah","Indeed","Allah","gives provision","(to) whom","He wills","without","measure","(37)"],"transliterationArr":["fataqabbalahā","rabbuhā","biqabūlin","ḥasanin","wa-anbatahā","nabātan","ḥasanan","wakaffalahā","zakariyyā","kullamā","dakhala","ʿalayhā","zakariyyā","al-miḥ'rāba","wajada","ʿindahā","riz'qan","qāla","yāmaryamu","annā","laki","hādhā","qālat","huwa","min","ʿindi","al-lahi","inna","al-laha","yarzuqu","man","yashāu","bighayri","ḥisābin",null],"verseTiming":[[1,0,2020],[2,2020,3250],[3,3250,4510],[4,4510,6000],[5,6000,8150],[6,8150,9220],[7,9220,11049],[8,11049,12482],[9,12482,14314],[10,14314,16320],[11,16320,17710],[12,17710,18920],[13,18920,19670],[14,19670,20840],[15,20840,21970],[16,21970,23410],[17,23410,24010],[18,24010,25970],[19,25970,27640],[20,27640,28260],[21,28260,29710],[22,29710,30920],[23,30920,31720],[24,31720,32740],[25,32740,34040],[26,34040,34540],[27,34540,34930],[28,34930,36300],[29,36300,38610],[30,38610,39710],[31,39710,40560],[32,40560,41640],[33,41640,41820],[34,41820,45090],[35,45090,45950],[36,45950,48845]]}}