{"name":"3:42","price":"اور جب فرشتوں نے کہا، اے مریم! اللہ تعالیٰ نے تجھے برگزیده کر لیا اور تجھے پاک کر دیا اور سارے جہان کی عورتوں میں سے تیرا انتخاب کر لیا۔(1)","arabic":"وَإِذۡ قَالَتِ ٱلۡمَلَٰٓئِكَةُ يَٰمَرۡيَمُ إِنَّ ٱللَّهَ ٱصۡطَفَىٰكِ وَطَهَّرَكِ وَٱصۡطَفَىٰكِ عَلَىٰ نِسَآءِ ٱلۡعَٰلَمِينَ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":335,"juzNumber":3,"footnotes":"(1) حضرت مریم علیہا السلام کا یہ شرف وفضل ان کے اپنے زمانے کے اعتبار سے ہے کیونکہ صحیح احادیث میں حضرت مریم علیہا السلام کے ساتھ حضرت خدیجہ (رضی الله عنها) کو بھی خَيْرُ نِسَائِهَا (سب عورتوں میں بہتر) کہا گیا ہے۔ اور بعض احادیث میں چار عورتوں کو کامل قراردیا گیا ہے۔ حضرت مریم، حضرت آسیہ (فرعون کی بیوی)، حضرت خدیجہ اور حضرت عائشہ (رضي الله عنهن)۔ اور حضرت عائشہ (رضی الله عنها) کی بابت کہا گیا ہے کہ انکی فضیلت دیگر تمام عورتوں پر ایسے ہے جیسے ثرید کو تمام کھانوں پر فوقیت حاصل ہے۔ (ابن کثیر) اور ترمذی کی روایت میں حضرت فاطمہ (رضی الله عنها) بنت محمد (صلى الله عليه وسلم) کو بھی فضیلت والی عورتوں میں شامل کیا گیا ہے (ابن کثیر) اس کا یہ مطلب بھی ہو سکتا ہے کہ مذکورہ خواتین ان چند عورتوں میں سے ہیں جنہیں اللہ تعالیٰ نے دیگر عورتوں پر فضیلت اور بزرگی عطا فرمائی یا یہ کہ اپنے اپنے زمانے میں فضیلت رکھتی ہیں۔ واللہ اعلم۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-idh qālati al-malāikatu yāmaryamu inna al-laha iṣ'ṭafāki waṭahharaki wa-iṣ'ṭafāki ʿalā nisāi al-ʿālamīna ","translations":["And when","said","the Angels","O Maryam","Indeed","Allah","(has) chosen you","and purified you","and chosen you","over","(the) women","(of) the worlds","(42)"],"transliterationArr":["wa-idh","qālati","al-malāikatu","yāmaryamu","inna","al-laha","iṣ'ṭafāki","waṭahharaki","wa-iṣ'ṭafāki","ʿalā","nisāi","al-ʿālamīna",null],"verseTiming":[[1,0,610],[2,610,1520],[3,1520,4390],[4,4390,5580],[5,5580,6500],[6,6500,7390],[7,7390,8460],[8,8460,9640],[9,9640,10890],[10,10890,11520],[11,11520,13540],[12,13540,16115]]}}