{"name":"3:45","price":"جب فرشتوں نے کہا اے مریم اللہ تعالیٰ تجھے اپنے ایک کلمے(1) کی خوشخبری دیتا ہے جس کا نام مسیح عیسیٰ بن(2) مریم ہے جو دنیا اور آخرت میں ذیعزت ہے اور وه میرے مقربین میں سے ہے۔","arabic":"إِذۡ قَالَتِ ٱلۡمَلَٰٓئِكَةُ يَٰمَرۡيَمُ إِنَّ ٱللَّهَ يُبَشِّرُكِ بِكَلِمَةٖ مِّنۡهُ ٱسۡمُهُ ٱلۡمَسِيحُ عِيسَى ٱبۡنُ مَرۡيَمَ وَجِيهٗا فِي ٱلدُّنۡيَا وَٱلۡأٓخِرَةِ وَمِنَ ٱلۡمُقَرَّبِينَ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":338,"juzNumber":3,"footnotes":"(1) حضرت عیسیٰ (عليه السلام) کو کلمہ یعنی کلمہ اللہ اس اعتبار سے کہا گیا ہے کہ ان کی ولادت اعجازی شان کی مظہر اور عام انسانی اصول کے برعکس، باپ کے بغیر، اللہ کی خاص قدرت اوراسکے کلمہ کن کی تخلیق ہے۔\n(2) مَسِيحٌ مسح سے ہےأي: مَسَحَ الأَرْضَ یعنی کثرت سے زمین کی سیاحت کرنے والا، یا اس کے معنی ہاتھ پھیرنے والا ہے، کیونکہ آپ ہاتھ پھیر کر مریضوں کو باذن اللہ شفایاب فرماتے تھے۔ ان دونوں معنوں کے اعتبار سے یہ فَعِيلٌ بمعنی فاعل ہے اور قیامت کے قریب ظاہر ہونے والے دجال کو جو مسیح کہا جاتا ہے وہ یا تو بمعنی مفعول یعنی مَمْسُوحُ الْعَينِ( اس کی ایک آنکھ کانی ہوگی) کے اعتبار سے ہے یا وہ بھی چونکہ کثرت سے دنیا میں پھرے گا اور مکہ اور مدینہ کے سوا ہر جگہ پہنچے گا، (بخاری ومسلم) اور بعض روایات میں بیت المقدس کا بھی ذکر ہے اس لئے اسے بھی الْمَسِيحُ الدَّجَّالُ کہا جاتا ہے۔ عام اہل تفسیر نے عموماً یہی بات درج کی ہے۔ کچھ اور محققین کہتے ہیں کہ مسیح یہود ونصاریٰ کی اصطلاح میں بڑے مامور من اللہ پیغمبر کو کہتے ہیں، یعنی ان کی یہ اصطلاح تقریباً اولوالعزم پیغمبر کے ہم معنی ہے۔ دجال کو مسیح اس لئے کہا گیا ہے کہ یہود کو جس انقلاب آفریں مسیح کی بشارت دی گئی ہے۔ اور جس کے وہ غلط طور پر اب بھی منتظر ہیں، دجال اسی مسیح کے نام پر آئے گا یعنی اپنے آپ کو وہی مسیح قرار دے گا۔ مگر وہ اپنے اس دعویٰ سمیت تمام دعوؤں میں دجل وفریب کا اتنا بڑا پیکر ہوگا کہ اولین وآخرین میں اس کی کوئی مثال نہ ہوگی اس لئے وہ الدجال کہلائے گا۔ اور عیسیٰ عجمی زبان کا لفظ ہے۔ بعض کے نزدیک یہ عربی اورعَاسَ يَعُوسُ سے مشتق ہے جس کے معنی سیاست وقیادت کے ہیں (قرطبی وفتح القدیر)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"idh qālati al-malāikatu yāmaryamu inna al-laha yubashiruki bikalimatin min'hu us'muhu al-masīḥu ʿīsā ub'nu maryama wajīhan fī al-dun'yā wal-ākhirati wamina al-muqarabīna ","translations":["When","said","the Angels","O Maryam","Indeed","Allah","gives you glad tidings","of a word","from Him","his name","(is) the Messiah","Isa","son","(of) Maryam","honored","in","the world","and (in) the Hereafter","and of","those brought near (to Allah)","(45)"],"transliterationArr":["idh","qālati","al-malāikatu","yāmaryamu","inna","al-laha","yubashiruki","bikalimatin","min'hu","us'muhu","al-masīḥu","ʿīsā","ub'nu","maryama","wajīhan","fī","al-dun'yā","wal-ākhirati","wamina","al-muqarabīna",null],"verseTiming":[[1,0,640],[2,640,1460],[3,1460,4240],[4,4240,5470],[5,5470,6390],[6,6390,7300],[7,7300,8570],[8,8570,9650],[9,9650,10840],[10,10840,11460],[11,11460,12540],[12,12540,13100],[13,13100,13590],[14,13590,14370],[15,14370,16010],[16,16010,17590],[17,17590,17810],[18,17810,18870],[19,18870,20440],[20,20440,20920],[21,20920,23725]]}}