{"name":"3:46","price":"وه لوگوں سے اپنے گہوارے میں باتیں کرے گا اور ادھیڑ عمر میں بھی(1) اور وه نیک لوگوں میں سے ہوگا۔","arabic":"وَيُكَلِّمُ ٱلنَّاسَ فِي ٱلۡمَهۡدِ وَكَهۡلٗا وَمِنَ ٱلصَّٰلِحِينَ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":339,"juzNumber":3,"footnotes":"(1) حضرت عیسیٰ (عليه السلام) کےمَهْدٌ( گہوارے) میں گفتگو کرنے کا ذکر خود قرآن کریم کی سورۂ مریم میں موجود ہے۔ اس کے علاوہ صحیح حدیث میں دو بچوں کا ذکر اور ہے۔ ایک صاحب جریج اور ایک اسرائیلی عورت کا بچہ (صحیح بخاری، کتاب الانبیاء، باب واذکرفی الکتاب مریم) اس روایت میں جن تین بچوں کا ذکر ہے، ان سب کا تعلق بنو اسرائیل سے ہے، کیونکہ ان کے علاوہ صحیح مسلم میں اصحاب الاخدود کے قصے میں بھی شیر خوار بچے کے بولنے کا ذکر ہے۔ اور حضرت یوسف کی بابت فیصلہ کرنے والے شاہد کے بارے میں جو مشہور ہے کہ وہ بچہ تھا، صحیح نہیں ہے۔ بلکہ وہ ذُو لِحْيَةٍ( داڑھی والا) تھا (الضعیفہ۔ رقم 881) كَهْلٌ (ادھیڑ عمر) میں کلام کرنے کا مطلب بعض نے یہ بیان کیا ہے کہ جب وہ بڑے ہو کر وحی اور رسالت سے سرفراز کئے جائیں گے اور بعض نے کہا ہے کہ آپ کا قیامت کے قریب جب آسمان سے نزول ہوگا جیسا کہ اہل سنت کا عقیدہ ہے جو صحیح اور متواتر احادیث سے ثابت ہے، تو اس وقت جو وہ اسلام کی تبلیغ کریں گے، وہ کلام مراد ہے۔ (تفسیر ابن کثیر وقرطبی)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wayukallimu al-nāsa fī al-mahdi wakahlan wamina al-ṣāliḥīna ","translations":["And he will speak","(to) the people","in","the cradle","and (in) maturity","and (he will be) of","the righteous","(46)"],"transliterationArr":["wayukallimu","al-nāsa","fī","al-mahdi","wakahlan","wamina","al-ṣāliḥīna",null],"verseTiming":[[1,0,1220],[2,1220,2560],[3,2560,2800],[4,2800,3630],[5,3630,5190],[6,5190,5820],[7,5820,8805]]}}