{"name":"3:52","price":"مگر جب حضرت عیسیٰ علیہ السلام نے ان کا کفر محسوس کر لیا(1) تو کہنے لگے اللہ تعالیٰ کی راه میں میری مدد کرنے واﻻ کون کون ہے؟(2) حواریوں(3) نے جواب دیا کہ ہم اللہ تعالیٰ کی راه کے مددگار ہیں، ہم اللہ تعالیٰ پر ایمان ﻻئے اور آپ گواه رہئے کہ ہم تابعدار ہیں۔","arabic":"۞ فَلَمَّآ أَحَسَّ عِيسَىٰ مِنۡهُمُ ٱلۡكُفۡرَ قَالَ مَنۡ أَنصَارِيٓ إِلَى ٱللَّهِۖ قَالَ ٱلۡحَوَارِيُّونَ نَحۡنُ أَنصَارُ ٱللَّهِ ءَامَنَّا بِٱللَّهِ وَٱشۡهَدۡ بِأَنَّا مُسۡلِمُونَ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":345,"juzNumber":3,"footnotes":"(1) یعنی ایسی گہری سازشیں اور مشکوک حرکتیں جو کفر یعنی حضرت مسیح کی رسالت کے انکار پر مبنی تھیں۔\n(2) بہت سے نبیوں نے اپنی قوم کے ہاتھوں تنگ آکر ظاہری اسباب کے مطابق اپنی قوم کے باشعورلوگوں سے مدد طلب کی ہے۔ جس طرح خود نبی (صلى الله عليه وسلم) نے بھی ابتدا میں، جب قریش آپ کی دعوت کی راہ میں رکاوٹ بنے ہوئے تھے، تو آپ موسم حج میں لوگوں کو اپنا ساتھی اور مددگاربننے پر آمادہ کرتے تھے تاکہ آپ رب کا کلام لوگوں تک پہنچا سکیں، جس پر انصار نے لبیک کہا اور نبی (صلى الله عليه وسلم) کی انہوں نے قبل ہجرت اور بعد ہجرت مدد کی۔ اسی طرح یہاں حضرت عیسیٰ (عليه السلام) نے مدد طلب فرمائی۔ یہ وہ مدد نہیں ہے جو مافوق الاسباب طریقے سے طلب کی جاتی ہے کیونکہ وہ تو شرک ہے اور ہر نبی شرک کے سدباب ہی کے لئے آتا رہا ہے، پھر وہ خود شرک کا ارتکاب کس طرح کر سکتے تھے؟ لیکن قبر پرستوں کی غلط روش قابل ماتم ہے کہ وہ فوت شدہ اشخاص سے مدد مانگنے کے جواز کے لئے حضرت عیسیٰ (عليه السلام) کے قول من انصاری الی اللہ سے استدلال کرتے ہیں؟ فَإِنَّا للهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ اللہ تعالیٰ ان کو ہدایت نصیب فرمائے۔\n(3) حواریون، حواری کی جمع ہے بمعنی انصار (مددگار) جس طرح نبی (صلى الله عليه وسلم) کا فرمان ہے ”إِنَّ لِكُلِّ نَبِيٍّ حَوَارِيًّا وَحَوَارِيِّ الزُّبَيْرُ“ (صحيح بخاري كتاب الجهاد، باب فضل الطليعة) ”ہر نبی کا کوئی مددگار خاص ہوتا ہے اور میرا مددگار زبیر (رضي الله عنه) ہے۔“","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"falammā aḥassa ʿīsā min'humu al-kuf'ra qāla man anṣārī ilā al-lahi qāla al-ḥawāriyūna naḥnu anṣāru al-lahi āmannā bil-lahi wa-ish'had bi-annā mus'limūna ","translations":["Then when","perceived","Isa","from them","[the] disbelief","he said","Who","(will be) my helpers","to","Allah","Said","the disciples","We","(will be the) helpers","(of) Allah","we believe[d]","in Allah","and bear witness","that we","(are) Muslims","(52)"],"transliterationArr":["falammā","aḥassa","ʿīsā","min'humu","al-kuf'ra","qāla","man","anṣārī","ilā","al-lahi","qāla","al-ḥawāriyūna","naḥnu","anṣāru","al-lahi","āmannā","bil-lahi","wa-ish'had","bi-annā","mus'limūna",null],"verseTiming":[[1,0,3060],[2,3060,3920],[3,3920,4750],[4,4750,5580],[5,5580,6550],[6,6550,7180],[7,7180,7550],[8,7550,10720],[9,10720,11220],[10,11220,13860],[11,13860,14330],[12,14330,16240],[13,16240,16920],[14,16920,18650],[15,18650,19570],[16,19570,21280],[17,21280,22290],[18,22290,23140],[19,23140,24670],[20,24670,27425]]}}