{"name":"3:54","price":"اور کافروں نے مکر کیا اور اللہ تعالیٰ نے بھی (مکر) خفیہ تدبیر کی اور اللہ تعالیٰ سب خفیہ تدبیر کرنے والوں سے بہتر ہے۔(1)","arabic":"وَمَكَرُواْ وَمَكَرَ ٱللَّهُۖ وَٱللَّهُ خَيۡرُ ٱلۡمَٰكِرِينَ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":347,"juzNumber":3,"footnotes":"(1) حضرت عیسیٰ (عليه السلام) کے زمانے میں شام کا علاقہ رومیوں کے زیر نگیں تھا، یہاں ان کی طرف سے جو حکمران مقرر تھا،وہ کافر تھا۔ یہودیوں نے حضرت عیسیٰ (عليه السلام) کے خلاف اس حکمراں کے کان بھر دیئے کہ یہ نَعُوذُ بِاللهِ بغیر باپ کے اور فسادی ہے وغیرہ وغیرہ۔ حکمران نے ان کے مطالبے پر حضرت عیسیٰ (عليه السلام) کو سولی دینے کا فیصلہ کر لیا۔ لیکن اللہ نے حضرت عیسیٰ (عليه السلام) کو بحفاظت آسمان پر اٹھا لیا اور ان کی جگہ ان کے ہم شکل ایک آدمی کو انہوں نے سولی دے دی، اور سمجھتے رہے کہ ہم نے حضرت عیسیٰ (عليه السلام) کو سولی دی ہےمَكْرٌعربی زبان میں لطیف اور خفیہ تدبیر کو کہتے ہیں اور اس معنی میں یہاں اللہ تعالیٰ خَيْرُ الْمَاكِرِينَ کہا گیا ہے۔ گویا یہ مکر، سئی (برا) بھی ہو سکتا ہے، اگر غلط مقصد کے لئے ہو اور خیر (اچھا) بھی ہو سکتا ہے اگر اچھے مقصد کے لئے ہو۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wamakarū wamakara al-lahu wal-lahu khayru al-mākirīna ","translations":["And they schemed","and planned","Allah","And Allah","(is the) best","(of) the planners","(54)"],"transliterationArr":["wamakarū","wamakara","al-lahu","wal-lahu","khayru","al-mākirīna",null],"verseTiming":[[1,0,1200],[2,1200,1960],[3,1960,4910],[4,4910,5950],[5,5950,6580],[6,6580,10075]]}}