{"name":"3:61","price":"اس لئے جو شخص آپ کے پاس اس علم کے آجانے کے بعد بھی آپ سے اس میں جھگڑے تو آپ کہہ دیں کہ آو ہم تم اپنے اپنے فرزندوں کو اور ہم تم اپنی اپنی عورتوں کواور ہم تم خاص اپنی اپنی جانوں کو بلالیں، پھر ہم عاجزی کے ساتھ التجا کریں اور جھوٹوں پر اللہ کی لعنت کریں۔(1)","arabic":"فَمَنۡ حَآجَّكَ فِيهِ مِنۢ بَعۡدِ مَا جَآءَكَ مِنَ ٱلۡعِلۡمِ فَقُلۡ تَعَالَوۡاْ نَدۡعُ أَبۡنَآءَنَا وَأَبۡنَآءَكُمۡ وَنِسَآءَنَا وَنِسَآءَكُمۡ وَأَنفُسَنَا وَأَنفُسَكُمۡ ثُمَّ نَبۡتَهِلۡ فَنَجۡعَل لَّعۡنَتَ ٱللَّهِ عَلَى ٱلۡكَٰذِبِينَ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":354,"juzNumber":3,"footnotes":"(1) یہ آیت مباہلہ کہلاتی ہے۔ مباہلہ کے معنی ہیں دو فریق کا ایک دوسرے پر لعنت یعنی بددعا کرنا۔ مطلب یہ ہے کہ جب دو فریقوں میں کسی معاملے کے حق یا باطل ہونے میں اختلاف ونزاع ہو اور دلائل سے وہ ختم ہوتا نظر نہ آتا ہو تو دونوں بارگاہ الہیٰ میں یہ دعا کریں کہ یااللہ ہم دونوں میں سے جو جھوٹا ہے، اس پر لعنت فرما۔ اس کا مختصر پس منظر یہ ہے کہ ہجری میں نجران سے عیسائیوں کا ایک وفد نبی (صلى الله عليه وسلم) کی خدمت میں حاضر ہوا اور حضرت عیسیٰ (عليه السلام) کے بارے میں وہ جو غلو آمیز عقائد رکھتے تھے اس پر بحث ومناظرہ کرنے لگا۔ بالآخر یہ آیت نازل ہوئی اور نبی (صلى الله عليه وسلم) نے انہیں مباہلہ کی دعوت دی۔ حضرت علی س، حضرت فاطمہ اور حضرت حسن وحسین (رضي الله عنهم) کو بھی ساتھ لیا، اور عیسائیوں سے کہا کہ تم بھی اپنے اہل وعیال کو بلالو اور پھر مل کر جھوٹے پر لعنت کی بددعا کریں۔ عیسائیوں نے باہم مشورہ کے بعد مباہلہ کرنے سے گریز کیا اور پیش کش کی کہ آپ ہم سے جو چاہتے ہیں ہم دینے کے لئے تیار ہیں، چنانچہ نبی (صلى الله عليه وسلم) نے ان پر جزیہ مقرر فرما دیا جس کی وصولی کے لئے آپ (صلى الله عليه وسلم) نے حضرت ابوعبیدہ بن جراح (رضي الله عنه) کو، جنہیں آپ (صلى الله عليه وسلم) نے امین امت کا خطاب عنایت فرمایا تھا، ان کے ساتھ بھیجا (ملخص از تفسیر ابن کثیر وفتح القدیر وغیرہ) اس سے اگلی آیت میں اہل کتاب (یہودیوں اور عیسائیوں) کو دعوت توحید دی جا رہی ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"faman ḥājjaka fīhi min baʿdi mā jāaka mina al-ʿil'mi faqul taʿālaw nadʿu abnāanā wa-abnāakum wanisāanā wanisāakum wa-anfusanā wa-anfusakum thumma nabtahil fanajʿal laʿnata al-lahi ʿalā al-kādhibīna ","translations":["Then whoever","argues (with) you","concerning it","from","after","what","came to you","of","the knowledge","then say","Come","let us call","our sons","and your sons","and our women","and your women","and ourselves","and yourselves","then","let us pray humbly","and [we] invoke","the curse","(of) Allah","on","the liars","(61)"],"transliterationArr":["faman","ḥājjaka","fīhi","min","baʿdi","mā","jāaka","mina","al-ʿil'mi","faqul","taʿālaw","nadʿu","abnāanā","wa-abnāakum","wanisāanā","wanisāakum","wa-anfusanā","wa-anfusakum","thumma","nabtahil","fanajʿal","laʿnata","al-lahi","ʿalā","al-kādhibīna",null],"verseTiming":[[1,0,770],[2,770,4150],[3,4150,4810],[4,4810,5790],[5,5790,6460],[6,6460,6900],[7,6900,9050],[8,9050,9380],[9,9380,10340],[10,10340,10910],[11,10910,11980],[12,11980,13390],[13,13390,14450],[14,14450,15110],[15,15110,18050],[16,18050,21000],[17,21000,23739],[18,23739,26459],[19,26459,28369],[20,28369,30359],[21,30359,31659],[22,31659,32929],[23,32929,34869],[24,34869,35899],[25,35899,36899],[26,36899,37799],[27,37799,38749],[28,38749,39139],[29,39139,42114]]}}