{"name":"3:7","price":"وہی اللہ تعالیٰ ہے جس نے تجھ پر کتاب اتاری جس میں واضح مضبوط آیتیں ہیں جو اصل کتاب ہیں اوربعض متشابہ آیتیں ہیں(1) ۔ پس جن کے دلوں میں کجی ہے وه تواس کی متشابہ آیتوں کے پیچھے لگ جاتے ہیں، فتنے کی طلب اور ان کی مراد کی جستجو کے لئے، حاﻻنکہ ان کے حقیقی مراد کو سوائے اللہ تعالیٰ کے کوئی نہیں جانتا(2) اور پختہ ومضبوط علم والے یہی کہتے ہیں کہ ہم تو ان پر ایمان ﻻچکے، یہ ہمارے رب کی طرف سے ہیں اور نصیحت تو صرف عقلمند حاصل کرتے ہیں۔","arabic":"هُوَ ٱلَّذِيٓ أَنزَلَ عَلَيۡكَ ٱلۡكِتَٰبَ مِنۡهُ ءَايَٰتٞ مُّحۡكَمَٰتٌ هُنَّ أُمُّ ٱلۡكِتَٰبِ وَأُخَرُ مُتَشَٰبِهَٰتٞۖ فَأَمَّا ٱلَّذِينَ فِي قُلُوبِهِمۡ زَيۡغٞ فَيَتَّبِعُونَ مَا تَشَٰبَهَ مِنۡهُ ٱبۡتِغَآءَ ٱلۡفِتۡنَةِ وَٱبۡتِغَآءَ تَأۡوِيلِهِۦۖ وَمَا يَعۡلَمُ تَأۡوِيلَهُۥٓ إِلَّا ٱللَّهُۗ وَٱلرَّٰسِخُونَ فِي ٱلۡعِلۡمِ يَقُولُونَ ءَامَنَّا بِهِۦ كُلّٞ مِّنۡ عِندِ رَبِّنَاۗ وَمَا يَذَّكَّرُ إِلَّآ أُوْلُواْ ٱلۡأَلۡبَٰبِ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":300,"juzNumber":3,"footnotes":"(1) مُحْكَمَاتٌ سے مراد وہ آیات ہیں جن میں اوا مر ونواہی، احکام ومسائل اور قصص وحکایات ہیں جن کا مفہوم واضح اور اٹل ہے، اور ان کے سمجھنے میں کسی کو اشکال پیش نہیں آتا۔ اس کے برعکس آيَاتٌ مُتَشَابِهَاتٌ ہیں مثلاً اللہ کی ہستی، قضا وقدر کے مسائل، جنت دوزخ، ملائکہ وغیرہ یعنی ماورا عقل حقائق جن کی حقیقت سمجھنے سے عقل انسانی قاصر ہو یا ان میں ایسی تاویل کی گنجائش ہو یا کم از کم ایسا ابہام ہو جس سے عوام کو گمراہی میں ڈالنا ممکن ہو۔ اسی لئے آگے کہا جا رہا ہے کہ جن کے دلوں میں کجی ہوتی ہے وہ آیات متشابہات کے پیچھے پڑے رہتے ہیں اور ان کے ذریعے سے (فتنے) برپا کرتے ہیں۔ جیسے عیسائی ہیں۔ قرآن نےحضرت عیسیٰ (عليه السلام) کو عبداللہ اور نبی کہا ہے یہ واضح اور محکم بات ہے۔ لیکن عیسائی اسے چھوڑ کر قرآن کریم سے حضرت عیسیٰ (عليه السلام) کو روح اللہ اور کلمۃ اللہ جوکہا گیا ہے، اس سے اپنے گمراہ کن عقائد پر غلط استدلال کرتے ہیں۔ یہی حال اہل بدعت کاہے۔ قرآن کے واضح عقائد کے برعکس اہل بدعت نے جو غلط عقائد گھڑ رکھے ہیں، وہ انہی مُتَشَابِهَاتٌ کو بنیاد بناتے ہیں۔ اور بسا اوقات مُحْكَمَاتٌ کوبھی اپنے فلسفیانہ استدلال کے گورکھ دھندے سے مُتَشَابِهَاتٌ بناتے ہیں۔ أَعَاذَنَا اللهُ مِنْهم نہ ان کے برعکس صحیح العقیدہ مسلمان محکمات پرعمل کرتا ہے اورمُتَشَابِهَاتٌ کے مفہوم کو بھی (اگر اس میں اشتباہ ہو) محکمات کی روشنی میں سمجھنے کی کوشش کرتا ہے کیونکہ قرآن نے انہی کو (اصل کتاب) قرار دیا ہے۔ جس سے وہ فتنے سے بھی محفوظ رہتا ہے اور عقائد کی گمراہی سے بھی۔جَعَلَنَا اللهُ منْهُمْ\n(2) تاویل کے ایک معنی تو ہیں (کسی چیز کی اصل حقیقت) اس معنی کے اعتبار سےإِلا اللهُ پر وقف ضروری ہے۔ کیونکہ ہر چیز کی اصل حقیقت واضح طورپرصرف اللہ تعالیٰ ہی جانتا ہے۔ تاویل کے دوسرے معنی ہیں ”کسی چیزکی تفسیر وتعبیر اوربیان وتوضیح“ اس اعتبار سے الا اللہ پر وقف کے بجائے «وَالرَّاسِخُونَ فِي الْعِلْمِ» پر بھی وقف کیا جاسکتاہے کیونکہ مضبوط علم والے بھی صحیح تفسیر وتوضیح کا علم رکھتے ہیں۔ ”تاویل“ کے یہ دونوں معنی قرآن کریم کے استعمال سے ثابت ہیں۔ (ملخص ازابن کثیر)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"huwa alladhī anzala ʿalayka al-kitāba min'hu āyātun muḥ'kamātun hunna ummu al-kitābi wa-ukharu mutashābihātun fa-ammā alladhīna fī qulūbihim zayghun fayattabiʿūna mā tashābaha min'hu ib'tighāa al-fit'nati wa-ib'tighāa tawīlihi wamā yaʿlamu tawīlahu illā al-lahu wal-rāsikhūna fī al-ʿil'mi yaqūlūna āmannā bihi kullun min ʿindi rabbinā wamā yadhakkaru illā ulū al-albābi ","translations":["He","(is) the One Who","revealed","to you","the Book","of it","(are) Verses","absolutely clear ","they (are)","the foundation","(of) the Book","and others","(are) allegorical","Then as for","those","in","their hearts","(is) perversity ","[so] they follow","what","(is) allegorical","of it","seeking","[the] discord","and seeking","its interpretation","And not","knows","its interpretation","except","Allah","And those firm","in","[the] knowledge","they say","We believe","in it","All","(is)","from","our Lord","And not","will take heed","except","men","(of) understanding","(7)"],"transliterationArr":["huwa","alladhī","anzala","ʿalayka","al-kitāba","min'hu","āyātun","muḥ'kamātun","hunna","ummu","al-kitābi","wa-ukharu","mutashābihātun","fa-ammā","alladhīna","fī","qulūbihim","zayghun","fayattabiʿūna","mā","tashābaha","min'hu","ib'tighāa","al-fit'nati","wa-ib'tighāa","tawīlihi","wamā","yaʿlamu","tawīlahu","illā","al-lahu","wal-rāsikhūna","fī","al-ʿil'mi","yaqūlūna","āmannā","bihi","kullun","min","ʿindi","rabbinā","wamā","yadhakkaru","illā","ulū","al-albābi",null],"verseTiming":[[1,0,410],[2,410,2870],[3,2870,4280],[4,4280,5110],[5,5110,6220],[6,6220,6830],[7,6830,7940],[8,7940,10090],[9,10090,11150],[10,11150,12190],[11,12190,13240],[12,13240,14100],[13,14100,16910],[14,16910,18920],[15,18920,19940],[16,19940,20210],[17,20210,21680],[18,21680,22930],[19,22930,24850],[20,24850,25300],[21,25300,26450],[22,26450,27040],[23,27040,29210],[24,29210,30310],[25,30310,33060],[26,33060,34640],[27,34640,35510],[28,35510,36350],[29,36350,39180],[30,39180,39720],[31,39720,42410],[32,42410,44000],[33,44000,44230],[34,44230,44990],[35,44990,46310],[36,46310,48040],[37,48040,48690],[38,48690,49360],[39,49360,50450],[40,50450,51850],[41,51850,53110],[42,53110,54110],[43,54110,55330],[44,55330,57620],[45,57620,57990],[46,57990,60565]]}}