{"name":"3:80","price":"اور یہ نہیں (ہو سکتا) کہ وه تمہیں فرشتوں اورنبیوں کو رب بنا لینے کا حکم کرے، کیا وه تمہارے مسلمان ہونے کے بعد بھی تمہیں کفر کا حکم دے گا۔(1)","arabic":"وَلَا يَأۡمُرَكُمۡ أَن تَتَّخِذُواْ ٱلۡمَلَٰٓئِكَةَ وَٱلنَّبِيِّـۧنَ أَرۡبَابًاۚ أَيَأۡمُرُكُم بِٱلۡكُفۡرِ بَعۡدَ إِذۡ أَنتُم مُّسۡلِمُونَ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":373,"juzNumber":3,"footnotes":"(1) یعنی نبیوں اور فرشتوں (یا کسی اور کو) رب والی صفات کا حامل باور کرانا یہ کفر ہے۔ تمہارے مسلمان ہو جانے کے بعد ایک نبی یہ کام بھلا کس طرح کر سکتا ہے؟ کیونکہ نبی کا کام تو ایمان کی دعوت دینا ہے جو اللہ وحدہ لا شریک کی عبادت کا نام ہے۔ بعض مفسرین نے اس کی شان نزول میں یہ بات بیان کی ہے کہ بعض مسلمانوں نے نبی (صلى الله عليه وسلم) سے اس بات کی اجازت مانگی کہ وہ آپ کو سجدہ کریں۔ جس پر یہ آیت نازل ہوئی۔ (فتح القدیر) اوربعض نے اس کی شان نزول میں یہ کہا ہے کہ یہودیوں اور عیسائیوں نے جمع ہو کر نبی (صلى الله عليه وسلم) سے کہا کہ کیا آپ یہ چاہتے ہیں کہ ہم آپ کی اس طرح عبادت وپرستش کریں جس طرح عیسائی حضرت عیسیٰ (عليه السلام) کی کرتے ہیں آپ (صلى الله عليه وسلم) نے فرمایا۔ اللہ کی پناہ، اس بات سے کہ ہم اللہ کو چھوڑ کر کسی اور کی عبادت کریں یا کسی کو اس کا حکم دیں، اللہ نے مجھے نہ اس لئے بھیجا ہے نہ اس کا حکم ہی دیا ہے۔ اس پر یہ آیت نازل ہوئی۔ (ابن کثیر۔ بحوالہ سیرۃ ابن ہشام)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walā yamurakum an tattakhidhū al-malāikata wal-nabiyīna arbāban ayamurukum bil-kuf'ri baʿda idh antum mus'limūna ","translations":["And not","he will order you","that","you take","the Angels","and the Prophets","(as) lords","Would he order you","to [the] disbelief","after","[when]","you (have become)","Muslims","(80)"],"transliterationArr":["walā","yamurakum","an","tattakhidhū","al-malāikata","wal-nabiyīna","arbāban","ayamurukum","bil-kuf'ri","baʿda","idh","antum","mus'limūna",null],"verseTiming":[[1,0,780],[2,780,2070],[3,2070,2950],[4,2950,4030],[5,4030,6890],[6,6890,8810],[7,8810,10360],[8,10360,13200],[9,13200,14230],[10,14230,14900],[11,14900,15270],[12,15270,16750],[13,16750,21365]]}}