{"name":"3:90","price":"بے شک جو لوگ(1) اپنے ایمان ﻻنے کے بعد کفر کریں پھر کفر میں بڑھ جائیں، ان کی توبہ ہرگز ہرگز قبول نہ کی جائے گی(2)، یہی گمراه لوگ ہیں.","arabic":"إِنَّ ٱلَّذِينَ كَفَرُواْ بَعۡدَ إِيمَٰنِهِمۡ ثُمَّ ٱزۡدَادُواْ كُفۡرٗا لَّن تُقۡبَلَ تَوۡبَتُهُمۡ وَأُوْلَٰٓئِكَ هُمُ ٱلضَّآلُّونَ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":383,"juzNumber":3,"footnotes":"(1) اس آیت میں ان کی سزا بیان کی جا رہی ہے جو مرتد ہونے کے بعد توبہ کی توفیق سے محروم رہیں اور کفر پر ان کا انتقال ہو۔\n(2) اس سے وہ توبہ مراد ہے جو موت کے وقت ہو۔ ورنہ توبہ کا دروازہ تو ہر ایک کے لئے ہر وقت کھلا ہے۔ اس سے پہلی آیت میں بھی قبولیت توبہ کا اثبات ہے۔ علاوہ ازیں قرآن میں اللہ تعالیٰ نے بار بار توبہ کی اہمیت اور قبولیت کوبیان فرمایا ہے«وَهُوَ الَّذِي يَقْبَلُ التَّوْبَةَ عَنْ عِبَادِهِ» (الشوریٰ: 25)۔ «أَلَمْ يَعْلَمُوا أَنَّ اللَّهَ هُوَ يَقْبَلُ التَّوْبَةَ عَنْ عِبَادِهِ» (التوبہ:104)۔ ”کیا انہوں نے نہیں جانا کہ اللہ تعالیٰ اپنے بندوں کی توبہ قبول فرماتا ہے“، اور احادیث میں بھی یہ مضمون بڑی وضاحت سے بیان ہوا ہے۔ اس لئے اس آیت سے مراد آخری سانس کی توبہ ہے جو نامقبول ہے۔ جیسا کہ قرآن کریم کے ایک اور مقام پر ہے«وَلَيْسَتِ التَّوْبَةُ لِلَّذِينَ يَعْمَلُونَ السَّيِّئَاتِ حَتَّى إِذَا حَضَرَ أَحَدَهُمُ الْمَوْتُ قَالَ إِنِّي تُبْتُ الآنَ» (النساء:18)۔ ”ان کی توبہ (قبول) نہیں ہے جو برائی کرتے رہتے ہیں، یہاں تک کہ جب ان میں سے ایک کو موت آنے لگتی ہے تو کہتا ہے میری توبہ“۔ حدیث میں بھی ہے «إنَّ اللهَ يَقْبَلُ تَوْبَةَ الْعبْدِ مَا لَمْ يُغَرْغِرْ» (مسنداحمد،ترمذی،بحوالہ فیض القدیر شرح الجامع الصغیر) ”اللہ تعالیٰ بندے کی توبہ اس وقت تک قبول کرتاہے جب تک اسے موت کا اچھو نہ لگے“، یعنی جان کنی کے وقت کی توبہ قبول نہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"inna alladhīna kafarū baʿda īmānihim thumma iz'dādū kuf'ran lan tuq'bala tawbatuhum wa-ulāika humu al-ḍālūna ","translations":["Indeed","those who","disbelieved","after","their belief","then","they increased","(in) disbelief","never","will be accepted","their repentance","and those ","they","(are) those who have gone astray","(90)"],"transliterationArr":["inna","alladhīna","kafarū","baʿda","īmānihim","thumma","iz'dādū","kuf'ran","lan","tuq'bala","tawbatuhum","wa-ulāika","humu","al-ḍālūna",null],"verseTiming":[[1,0,1450],[2,1450,2550],[3,2550,3560],[4,3560,4110],[5,4110,5780],[6,5780,6870],[7,6870,8100],[8,8100,8820],[9,8820,10330],[10,10330,11330],[11,11330,13100],[12,13100,14370],[13,14370,15380],[14,15380,16780],[15,16780,19479],[16,19479,19929],[17,19929,26014]]}}