{"name":"3:91","price":"ہاں جو لوگ کفر کریں اور مرتے دم تک کافر رہیں ان میں سے کوئی اگر زمین بھر سونا دے، گو فدیئے میں ہی ہو تو بھی ہرگز قبول نہ کیا جائے گا۔ یہی لوگ ہیں جن کے لئے تکلیف دینے واﻻ عذاب ہے اور جن کا کوئی مددگار نہیں.(1)","arabic":"إِنَّ ٱلَّذِينَ كَفَرُواْ وَمَاتُواْ وَهُمۡ كُفَّارٞ فَلَن يُقۡبَلَ مِنۡ أَحَدِهِم مِّلۡءُ ٱلۡأَرۡضِ ذَهَبٗا وَلَوِ ٱفۡتَدَىٰ بِهِۦٓۗ أُوْلَٰٓئِكَ لَهُمۡ عَذَابٌ أَلِيمٞ وَمَا لَهُم مِّن نَّٰصِرِينَ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":384,"juzNumber":3,"footnotes":"(1) حدیث میں آتا ہے کہ اللہ تعالیٰ قیامت والے دن ایک جہنمی سے کہے گا کہ اگر تیرے پاس دنیا بھر کا سامان ہو تو کیا تو اس عذاب نار کے بدلے اسے دینا پسند کرے گا ؟ وہ کہے گا (ہاں) اللہ تعالیٰ فرمائے گا میں نے دنیا میں تجھ سے اس سے کہیں زیادہ آسان بات کا مطالبہ کیا تھا کہ میرے ساتھ شرک نہ کرنا، مگر تو شرک سے باز نہیں آیا۔ (مسند احمد وھکذا اخرجہ البخاری ومسلم، ابن کثیر) اس سے معلوم ہوا کہ کافر کے لئے جہنم کا دائمی عذاب ہے۔ اس نے اگر دنیا میں کچھ کام بھی کئے ہوں گے تو کفر کی وجہ سے وہ بھی ضائع ہی جائیں گے جیسا کہ حدیث میں ہے کہ عبداللہ بن جدعان کی بابت پوچھا گیا کہ وہ مہمان نواز، غریب پرور تھا اور غلاموں کو آزاد کرنے والا تھا، کیا یہ اعمال اسے نفع دیں گے۔ نبی (صلى الله عليه وسلم) نے فرمایا (نہیں) کیونکہ اس نے ایک دن بھی اپنے رب سے اپنے گناہوں کی معافی نہیں مانگی (صحیح مسلم، کتاب الایمان )۔ اسی طرح اگر کوئی شخص وہاں زمین بھر سونا بطور فدیہ دے کر یہ چاہے کہ وہ عذاب جہنم سے بچ جائے، تو یہ ممکن نہیں ہو گا۔ اول تو وہاں کسی کے پاس ہوگا ہی کیا ؟ اور اگر بالفرض اس کے پاس دنیا بھر کے خزانے ہوں اور انہیں دے کر عذاب سے چھوٹ جانا چاہے تو یہ بھی نہیں ہوگا، کیونکہ اس سے وہ معاوضہ یا فدیہ قبول ہی نہیں کیا جائے گا۔ جس طرح دوسرے مقام پر فرمایا «وَلا يُقْبَلُ مِنْهَا عَدْلٌ وَلا تَنْفَعُهَا شَفَاعَةٌ» ( البقرۃ: 123) ”اس سے کوئی معاوضہ قبول کیا جائے گا اور نہ کوئی سفارش اسے فائدہ پہنچائے گی“۔ «لا بَيْعٌ فِيهِ وَلا خِلالٌ» ( سورۂ ابراہیم: 31) ”اس دن میں کوئی خرید وفروخت ہوگی نہ کوئی دوستی (ہی کام آئے گی)“۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"inna alladhīna kafarū wamātū wahum kuffārun falan yuq'bala min aḥadihim mil'u al-arḍi dhahaban walawi if'tadā bihi ulāika lahum ʿadhābun alīmun wamā lahum min nāṣirīna ","translations":["Indeed","those who","disbelieve[d]","and died","while they","(are) disbelievers","then never","will be accepted","from","any one of them","full","earth","(of) gold","[and] (even) if","he offered as ransom","it","Those ","for them","(is) a punishment","painful","and not","(will be) for them","any","helpers","(91)"],"transliterationArr":["inna","alladhīna","kafarū","wamātū","wahum","kuffārun","falan","yuq'bala","min","aḥadihim","mil'u","al-arḍi","dhahaban","walawi","if'tadā","bihi","ulāika","lahum","ʿadhābun","alīmun","wamā","lahum","min","nāṣirīna",null],"verseTiming":[[1,0,1240],[2,1240,2430],[3,2430,3420],[4,3420,4570],[5,4570,5210],[6,5210,7060],[7,7060,7570],[8,7570,8480],[9,8480,8850],[10,8850,9900],[11,9900,11610],[12,11610,12560],[13,12560,14140],[14,14140,14740],[15,14740,15720],[16,15720,16060],[17,16060,19020],[18,19020,19610],[19,19610,20450],[20,20450,21660],[21,21660,23040],[22,23040,23630],[23,23630,24550],[24,24550,28535]]}}