{"name":"3:92","price":"جب تک تم اپنی پسندیده چیز سے اللہ تعالیٰ کی راه میں خرچ نہ کروگے ہرگز بھلائی نہ پاؤ گے(1) ، اور تم جو خرچ کرو اسے اللہ تعالیٰ بخوبی جانتا ہے.(2)","arabic":"لَن تَنَالُواْ ٱلۡبِرَّ حَتَّىٰ تُنفِقُواْ مِمَّا تُحِبُّونَۚ وَمَا تُنفِقُواْ مِن شَيۡءٖ فَإِنَّ ٱللَّهَ بِهِۦ عَلِيمٞ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":385,"juzNumber":3,"footnotes":"(1) بر (نیکی بھلائی) سے مراد یہاں عمل صالح یا جنت ہے (فتح القدیر) حدیث میں آتا ہے کہ جب یہ آیت نازل ہوئی حضرت ابو طلحہ انصاری (رضي الله عنه) جو مدینہ میں اصحاب حیثیت میں سے تھے نبی کریم (صلى الله عليه وسلم) کی خدمت میں حاضر ہوئے اور عرض کیا کہ یا رسول اللہ (صلى الله عليه وسلم) ! بیرحا باغ مجھے سب سے زیادہ محبوب ہے، میں اسے اللہ کی رضا کے لئے صدقہ کرتا ہوں۔ آپ (صلى الله عليه وسلم) نے فرمایا وہ تو بہت نفع بخش مال ہے، میری رائے یہ ہے کہ تم اسے اپنے رشتہ داروں میں تقسیم کر دو۔ چنانچہ آپ (صلى الله عليه وسلم) کے مشورے سے انہوں نے اسے اپنے اقارب اور عم زادوں میں تقسیم کر دیا (مسند أحمد) اسی طرح اور بھی متعدد صحابہ نے اپنی پسندیدہ چیزیں اللہ کی راہ میں خرچ کیں۔مِمَّا تُحِبُّونَ میں مِنْ تَبْعِيض کے لئے ہے یعنی ساری پسندیدہ چیزیں خرچ کرنے کا حکم نہیں دیا گیا۔ بلکہ پسندیدہ چیزوں میں سے کچھ۔ اس لئے کوشش یہی ہونی چاہیئے کہ اچھی چیز صدقہ کی جائے۔ یہ افضل اور اکمل درجہ حاصل کرنے کا طریقہ ہے جس کا مطلب یہ نہیں ہے کہ کمتر چیز یا اپنی ضرورت سے زائد فالتو چیز یا استعمال شدہ پرانی چیز کا صدقہ نہیں کیا جا سکتا یا اس کا اجر نہیں ملے گا۔\n(2) تم جو کچھ بھی خرچ کرو گے، اچھی یا بری چیز، اللہ اسے جانتا ہے، اس کے مطابق جزا سے نوازے گا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"lan tanālū al-bira ḥattā tunfiqū mimmā tuḥibbūna wamā tunfiqū min shayin fa-inna al-laha bihi ʿalīmun ","translations":["Never","will you attain","[the] righteousness","until","you spend","from what","you love","And whatever","you spend","of","a thing","then indeed","Allah","of it","(is) All-Knowing","(92)"],"transliterationArr":["lan","tanālū","al-bira","ḥattā","tunfiqū","mimmā","tuḥibbūna","wamā","tunfiqū","min","shayin","fa-inna","al-laha","bihi","ʿalīmun",null],"verseTiming":[[1,0,1570],[2,1570,2540],[3,2540,3460],[4,3460,4340],[5,4340,6140],[6,6140,7910],[7,7910,11240],[8,11240,11880],[9,11880,13530],[10,13530,13920],[11,13920,15840],[12,15840,17820],[13,17820,18930],[14,18930,19650],[15,19650,24975]]}}