{"name":"40:11","price":"وه کہیں گے اے ہمارے پروردگار! تو نے ہمیں دوبار مارا اور دو بار ہی جلایا(1) ، اب ہم اپنے گناہوں کے اقراری ہیں(2)، تو کیا اب کوئی راه نکلنے کی بھی ہے؟(3)","arabic":"قَالُواْ رَبَّنَآ أَمَتَّنَا ٱثۡنَتَيۡنِ وَأَحۡيَيۡتَنَا ٱثۡنَتَيۡنِ فَٱعۡتَرَفۡنَا بِذُنُوبِنَا فَهَلۡ إِلَىٰ خُرُوجٖ مِّن سَبِيلٖ","category":["40 (Ghafir)","Ghafir","Surah Ghafir","Chapter Ghafir","Surah 40","Chapter 40","The Forgiver","غافِر"],"ayahNumber":4144,"juzNumber":24,"footnotes":"(1) جمہور مفسرین کی تفسیر کے مطابق، دو موتوں میں سے پہلی موت تو وہ نطفہ ہے جو باپ کی پشت میں ہوتا ہے۔ یعنی اس کے وجود (ہست) سے پہلےاس کے عدم وجود (نیست) کو موت سے تعبیر کیا گیا ہے۔ اور دوسری موت وہ ہے جس سے انسان اپنی زندگی گزار کر ہمکنار ہوتا اور اس کے بعد قبر میں دفن ہوتا ہے اور دو زندگیوں میں سے پہلی زندگی، یہ دینوی زندگی ہے، جس کا آغاز ولادت سے اور اختتام، وفات پرہوتا ہے۔ اور دوسری زندگی وہ ہے جو قیامت والے دن قبروں سے اٹھنے کے بعد حاصل ہوگی۔ انہی دو موتوں اور دو زندگیوں کاتذکرہ، «وَكُنْتُمْ أَمْوَاتًا فَأَحْيَاكُمْ ثُمَّ يُمِيتُكُمْ ثُمَّ يُحْيِيكُمْ» (البقرة: 28) میں بھی کیا گیا ہے۔\n(2) یعنی جہنم میں اعتراف کریں گے، جہاں اعتراف کا کوئی فائدہ نہیں اور وہاں پشیمان ہوں گے جہاں پشیمانی کی کوئی حیثیت نہیں۔\n(3) یہ وہی خواہش ہے جس کا تذکرہ قرآن مجیدمیں متعدد مقامات پر کیا گیا ہے کہ ہمیں دوبارہ زمین پر بھیج دیا جائے، تاکہ ہم نیکیاں کما کر لائیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qālū rabbanā amattanā ith'natayni wa-aḥyaytanā ith'natayni fa-iʿ'tarafnā bidhunūbinā fahal ilā khurūjin min sabīlin ","translations":["They (will) say","Our Lord","You gave us death","twice","and You gave us life","twice","and we confess","our sins","So is (there)","to","get out","any","way","(11)"],"transliterationArr":["qālū","rabbanā","amattanā","ith'natayni","wa-aḥyaytanā","ith'natayni","fa-iʿ'tarafnā","bidhunūbinā","fahal","ilā","khurūjin","min","sabīlin",null],"verseTiming":[[1,0,880],[2,880,3370],[3,3370,4310],[4,4310,5340],[5,5340,6600],[6,6600,7600],[7,7600,9010],[8,9010,10510],[9,10510,12360],[10,12360,13650],[11,13650,14310],[12,14310,14860],[13,14860,15710],[14,15710,17310],[15,17310,19805]]}}