{"name":"40:26","price":"اور فرعون نے کہا مجھے چھوڑ دو کہ میں موسیٰ (علیہ السلام) کو مار ڈالوں اور(1) اسے چاہئے کہ اپنے رب کو پکارے(2)، مجھے تو ڈر ہے کہ یہ کہیں تمہارا دین نہ بدل ڈالے یا ملک میں کوئی (بہت بڑا) فساد برپا نہ کردے.(3)","arabic":"وَقَالَ فِرۡعَوۡنُ ذَرُونِيٓ أَقۡتُلۡ مُوسَىٰ وَلۡيَدۡعُ رَبَّهُۥٓۖ إِنِّيٓ أَخَافُ أَن يُبَدِّلَ دِينَكُمۡ أَوۡ أَن يُظۡهِرَ فِي ٱلۡأَرۡضِ ٱلۡفَسَادَ","category":["40 (Ghafir)","Ghafir","Surah Ghafir","Chapter Ghafir","Surah 40","Chapter 40","The Forgiver","غافِر"],"ayahNumber":4159,"juzNumber":24,"footnotes":"(1) یعنی اس سے جو مقصد وہ حاصل کرنا چاہتا تھا کہ بنی اسرائیل کی قوت میں اضافہ اور اس کی عزت میں کمی نہ ہو۔ یہ اسے حاصل نہیں ہوا، بلکہ اللہ نے فرعون اور اس کی قوم کو ہی غرق کر دیا اور بنی اسرائیل کو بابرکت زمین کا وارث بنا دیا۔\n(2) یہ غالباً فرعون نے ان لوگوں سے کہا جو اسے موسیٰ (عليه السلام) کوقتل کرنے سے منع کرتے تھے۔\n(3) یہ فرعون کی دیدہ دلیری کااظہارہے کہ میں دیکھوں گا، اس کارب اسے کیسے بچاتا ہے،اسے پکار کر دیکھ لے۔ یارب ہی کا انکار ہے کہ اس کا کون سا رب ہے جو بچالے گا، کیونکہ رب تو وہ اپنے آپ کو کہتا تھا۔\n(4) یعنی غیر اللہ کی عبادت سے ہٹا کر ایک اللہ کی عبادت پر نہ لگا دے یا اس کی وجہ سے فساد نہ پیدا ہوجائے۔ مطلب یہ تھا کہ اس کی دعوت اگر میری قوم کے کچھ لوگوں نے قبول کرلی، تو وہ نہ قبول کرنے والوں سے بحث و تکرار کریں گے جس سے ان کے درمیان لڑائی جھگڑا ہو گا جو فساد کا ذریعہ بنے گا یوں دعوت توحید کو اس نے فساد کا سبب اور اہل توحید کو فسادی قرار دیا۔ دراں حالیکہ فسادی وہ خودتھا اور غیر اللہ کی عبادت ہی فساد کی جڑ ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waqāla fir'ʿawnu dharūnī aqtul mūsā walyadʿu rabbahu innī akhāfu an yubaddila dīnakum aw an yuẓ'hira fī al-arḍi al-fasāda ","translations":["And said","Firaun","Leave me","(so that) I kill","Musa","and let him call","his Lord","Indeed, I","[I] fear","that","he will change","your religion","or","that","he may cause to appear","in","the land","the corruption","(26)"],"transliterationArr":["waqāla","fir'ʿawnu","dharūnī","aqtul","mūsā","walyadʿu","rabbahu","innī","akhāfu","an","yubaddila","dīnakum","aw","an","yuẓ'hira","fī","al-arḍi","al-fasāda",null],"verseTiming":[[1,0,750],[2,750,1770],[3,1770,4230],[4,4230,5050],[5,5050,5820],[6,5820,6880],[7,6880,8150],[8,8150,11350],[9,11350,12190],[10,12190,12490],[11,12490,13890],[12,13890,14850],[13,14850,15240],[14,15240,15890],[15,15890,17100],[16,17100,17330],[17,17330,18110],[18,18110,20455]]}}