{"name":"40:4","price":"اللہ تعالیٰ کی آیتوں میں وہی لوگ جھگڑتے ہیں(1) جو کافر ہیں پس ان لوگوں کا شہروں میں چلنا پھرنا آپ کو دھوکے میں نہ ڈالے.(2)","arabic":"مَا يُجَٰدِلُ فِيٓ ءَايَٰتِ ٱللَّهِ إِلَّا ٱلَّذِينَ كَفَرُواْ فَلَا يَغۡرُرۡكَ تَقَلُّبُهُمۡ فِي ٱلۡبِلَٰدِ","category":["40 (Ghafir)","Ghafir","Surah Ghafir","Chapter Ghafir","Surah 40","Chapter 40","The Forgiver","غافِر"],"ayahNumber":4137,"juzNumber":24,"footnotes":"(1) اس جھگڑے سےمراد ناجائز اور باطل جھگڑا (جدال) ہے جس کامقصد حق کی تکذیب اور اس کی تردید و تغلیظ ہے ورنہ جس جدال (بحث و مناظرہ) کامقصد ایضاح حق، ابطال باطل اور منکرین و معترضین کے شبہات کا ازالہ ہو، وہ مذموم نہیں نہایت محمود ومستحسن ہے۔ بلکہ اہل علم کو تو اس کی تاکید کی گئی ہے، لَتُبَيِّنُنَّهُ لِلنَّاسِ وَلا تَكْتُمُونَهُ (آل عمران: 187) ”تم اسے لوگوں کے سامنے ضرور بیان کرنا، اسے چھپانا نہیں“۔ بلکہ اللہ کی نازل کردہ کتاب کے دلائل و براہین کوچھپانا اتنا سخت جرم ہے کہ اس پرکائنات کی ہر چیز لعنت کرتی ہے، (البقرۃ: 159)۔\n(2) یعنی یہ کافر و مشرک جو تجارت کرتے ہیں، اس کے لیے مختلف شہروں میں آتے جاتے اور کثیر منافع حاصل کرتے ہیں، یہ اپنے کفر کی وجہ سے جلد ہی مواخذۂ الٰہی میں آجائیں گے، یہ مہلت ضروردیئے جارہےہیں لیکن انہیں مہمل نہیں چھوڑاجائے گا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"mā yujādilu fī āyāti al-lahi illā alladhīna kafarū falā yaghrur'ka taqallubuhum fī al-bilādi ","translations":["Not","dispute","concerning","(the) Verses","(of) Allah","except","those who","disbelieve","so (let) not","deceive you","their movement","in","the cities","(4)"],"transliterationArr":["mā","yujādilu","fī","āyāti","al-lahi","illā","alladhīna","kafarū","falā","yaghrur'ka","taqallubuhum","fī","al-bilādi",null],"verseTiming":[[1,0,510],[2,510,1540],[3,1540,3140],[4,3140,4190],[5,4190,4980],[6,4980,5490],[7,5490,6530],[8,6530,7340],[9,7340,7970],[10,7970,8980],[11,8980,10340],[12,10340,10610],[13,10610,13505]]}}