{"name":"40:46","price":"آگ ہے جس کے سامنے یہ ہر صبح شام ﻻئے جاتے ہیں(1) اور جس دن قیامت قائم ہوگی (فرمان ہوگا کہ) فرعونیوں کو سخت ترین عذاب میں ڈالو.(2)","arabic":"ٱلنَّارُ يُعۡرَضُونَ عَلَيۡهَا غُدُوّٗا وَعَشِيّٗاۚ وَيَوۡمَ تَقُومُ ٱلسَّاعَةُ أَدۡخِلُوٓاْ ءَالَ فِرۡعَوۡنَ أَشَدَّ ٱلۡعَذَابِ","category":["40 (Ghafir)","Ghafir","Surah Ghafir","Chapter Ghafir","Surah 40","Chapter 40","The Forgiver","غافِر"],"ayahNumber":4179,"juzNumber":24,"footnotes":"(1) اس آگ پر برزخ میں یعنی قبروں میں وہ لوگ روزانہ صبح و شام پیش کیے جاتے ہیں، جس سے عذاب قبرکا اثبات ہوتا ہے۔ جس کا بعض لوگ انکار کرتےہیں۔ احادیث میں تو بڑی وضاحت سے عذاب قبرپرروشنی ڈالی گئی ہے۔ مثلاً حضرت عائشہ (رضی الله عنها) کے سوال کےجواب میں نبی کریم (صلى الله عليه وسلم) نے فرمایا نَعَمْ عَذَابُ الْقَبْرِ حَقٌّ (صحيح بخاري ، كتاب الجنائز ، باب ما جاء في عذاب القبر) ہاں قبر کا عذاب حق ہے اسی طرح ایک اور حدیث میں فرمایا گیا جب تم میں سے کوئی مرتا ہے تو (قبر میں) اس پر صبح و شام اس کی جگہ پیش کی جاتی ہے یعنی اگر وہ جنتی ہے تو جنت اور جہنمی ہے تو جہنم اس کے سامنےپیش کی جاتی ہے اور کہا جاتا ہے کہ یہ تیری اصل جگہ ہے، جہاں قیامت والے دن اللہ تعالیٰ تجھے بھیجے گا۔ (صحيح بخاري، باب الميت يعرض عليه مقعده بالغداة والعشي - مسلم ، كتاب الجنة ، باب عرض مقعد الميت) اس کا مطلب ہے کہ منکرین عذاب قبر قرآن و حدیث دونوں کی صراحتوں کو تسلیم نہیں کرتے۔ (2) اس سے بالکل واضح ہے کہ عرض علی النار کا معاملہ،جو صبح و شام ہوتا ہے، قیامت سے پہلے کا ہے اور قیامت سے پہلے برزخ اور قبر ہی کی زندگی ہے۔ قیامت والے دن ان کو قبر سے نکال کر سخت ترین عذاب یعنی جہنم میں ڈال دیا جائے گا۔ آل فرعون سےمراد فرعون، اس کی قوم اور اس کےسارے پیروکار ہیں۔ یہ کہناکہ ہمیں تو قبر میں مردہ آرام سے پڑا نظر آتا ہے، اسے اگر عذاب ہو تو اس طرح نظر نہ آئے لغو ہے کیونکہ عذاب کے لیے یہ ضروری نہیں کہ ہمیں نظر بھی آئے۔ اللہ تعالیٰ ہرطرح عذاب دینےپر قادر ہے۔ کیا ہم دیکھتے نہیں کہ خواب میں ایک شخص نہایت المناک مناظر دیکھ کر سخت کرب و اذیت محسوس کرتا ہے لیکن دیکھنے والوں کوذرا محسوس نہیں ہوتا کہ یہ خوابیدہ شخص شدید تکلیف سے دوچار ہے۔ اس کے باوجود عذاب قبرکا انکار، محض ہٹ دھرمی اور بے جا تحکم ہے۔ بلکہ بیداری میں بھی انسان کو جو تکالیف ہوتی ہیں وہ خود ظاہر نہیں ہوتیں بلکہ صرف انسان کا تڑپنا اور تلملانا ظاہرہوتا ہے۔ اور وہ بھی اس صورت میں جبکہ وہ تڑپے اور تلملائے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"al-nāru yuʿ'raḍūna ʿalayhā ghuduwwan waʿashiyyan wayawma taqūmu al-sāʿatu adkhilū āla fir'ʿawna ashadda al-ʿadhābi ","translations":["The Fire","they are exposed","to it","morning","and evening","And (the) Day","(will be) established","the Hour","Cause to enter","(the) people","(of) Firaun","(in the) severest","punishment","(46)"],"transliterationArr":["al-nāru","yuʿ'raḍūna","ʿalayhā","ghuduwwan","waʿashiyyan","wayawma","taqūmu","al-sāʿatu","adkhilū","āla","fir'ʿawna","ashadda","al-ʿadhābi",null],"verseTiming":[[1,0,1760],[2,1760,2960],[3,2960,3980],[4,3980,4930],[5,4930,7680],[6,7680,8400],[7,8400,9240],[8,9240,10290],[9,10290,12660],[10,12660,13310],[11,13310,14180],[12,14180,15060],[13,15060,17615]]}}