{"name":"40:43","price":"یہ یقینی امر ہے(1) کہ تم مجھے جس کی طرف بلا رہے ہو وه تو نہ دنیا میں پکارے جانے کے قابل ہے(2) نہ آخرت میں(3)، اور یہ (بھی یقینی بات ہے) کہ ہم سب کا لوٹنا اللہ کی طرف ہے(4) اور حد سے گزر جانے والے ہی (یقیناً) اہل دوزخ ہیں.(5)","arabic":"لَا جَرَمَ أَنَّمَا تَدۡعُونَنِيٓ إِلَيۡهِ لَيۡسَ لَهُۥ دَعۡوَةٞ فِي ٱلدُّنۡيَا وَلَا فِي ٱلۡأٓخِرَةِ وَأَنَّ مَرَدَّنَآ إِلَى ٱللَّهِ وَأَنَّ ٱلۡمُسۡرِفِينَ هُمۡ أَصۡحَٰبُ ٱلنَّارِ","category":["40 (Ghafir)","Ghafir","Surah Ghafir","Chapter Ghafir","Surah 40","Chapter 40","The Forgiver","غافِر"],"ayahNumber":4176,"juzNumber":24,"footnotes":"(1) لا جَرَمَ یہ بات یقینی ہے، یا اس میں جھوٹ نہیں ہے۔\n(2) یعنی وہ کسی کی پکار سننے کی استعداد ہی نہیں رکھتے کہ کسی کونفع پہنچا سکیں یا الوہیت کا استحقاق انہیں حاصل ہو۔ اس کا تقریباً وہی مفہوم ہے جو اس آیت اور اس جیسی دیگر متعدد آیات میں بیان کیا گیا ہے، وَمَنْ أَضَلُّ مِمَّنْ يَدْعُو مِنْ دُونِ اللَّهِ مَنْ لا يَسْتَجِيبُ لَهُ إِلَى يَوْمِ الْقِيَامَةِ وَهُمْ عَنْ دُعَائِهِمْ غَافِلُونَ (الأحقاف: 5) إِنْ تَدْعُوهُمْ لا يَسْمَعُوا دُعَاءَكُمْ وَلَوْ سَمِعُوا مَا اسْتَجَابُوا لَكُمْ (فاطر: 14) اگر تم انہیں پکارو تو وہ تمہاری پکار سنتے ہی نہیں اور اگر بالفرض سن بھی لیں تو قبول نہیں کر سکتے۔\n(3) یعنی آخرت میں ہی وہ پکار سن کر کسی کو عذاب سے چھڑانے پر یا شفاعت ہی کرنے پر قادر ہوں؟ یہ بھی ممکن نہیں ہے۔ ایسی چیزیں بھلا اس لائق ہو سکتی ہیں کہ وہ معبود بنیں اور ان کی عبادت کی جائے؟\n(4) جہاں ہر ایک کا حساب ہوگا اور عمل کے مطابق اچھی یا بری جزا دی جائےگی۔\n(5) یعنی کافر و مشرک، جو اللہ کی نافرمانی میں ہرحد سے تجاوز کر جاتے ہیں، اس طرح جو بہت زیادہ گناہ گار مسلمان ہوں گے، جن کی نافرمانیاں اسراف کی حد تک پہنچی ہوئی ہوں گی، انہیں بھی کچھ عرصہ جہنم کی سزا بھگتنی ہوگی۔ تاہم بعدمیں شفاعت رسول صلی اللہ علیہ وسلم یا اللہ کی مشیت سے ان کو جہنم سے نکال کر جنت میں داخل کر دیا جائےگا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"lā jarama annamā tadʿūnanī ilayhi laysa lahu daʿwatun fī al-dun'yā walā fī al-ākhirati wa-anna maraddanā ilā al-lahi wa-anna al-mus'rifīna hum aṣḥābu al-nāri ","translations":["No","doubt","that what","you call me","to it","not","for it","a claim","in","the world","and not","in","the Hereafter","and that","our return","(is) to","Allah","and that","the transgressors ","they","(will be the) companions","(of) the Fire","(43)"],"transliterationArr":["lā","jarama","annamā","tadʿūnanī","ilayhi","laysa","lahu","daʿwatun","fī","al-dun'yā","walā","fī","al-ākhirati","wa-anna","maraddanā","ilā","al-lahi","wa-anna","al-mus'rifīna","hum","aṣḥābu","al-nāri",null],"verseTiming":[[1,0,490],[2,490,1070],[3,1070,2540],[4,2540,5270],[5,5270,6030],[6,6030,6650],[7,6650,7040],[8,7040,8790],[9,8790,9070],[10,9070,10070],[11,10070,10660],[12,10660,10930],[13,10930,12130],[14,12130,13460],[15,13460,16030],[16,16030,16380],[17,16380,19760],[18,19760,20990],[19,20990,21890],[20,21890,24000],[21,24000,24340],[22,24340,25210],[23,25210,26820],[24,26820,28300],[25,28300,28710],[26,28710,29710],[27,29710,33315]]}}