{"name":"40:51","price":"یقیناً ہم اپنے رسولوں کی اور ایمان والوں کی مدد زندگانیٴ دنیا میں بھی کریں گے(1) اور اس دن بھی جب گواہی دینے والے(2) کھڑے ہوں گے.","arabic":"إِنَّا لَنَنصُرُ رُسُلَنَا وَٱلَّذِينَ ءَامَنُواْ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَيَوۡمَ يَقُومُ ٱلۡأَشۡهَٰدُ","category":["40 (Ghafir)","Ghafir","Surah Ghafir","Chapter Ghafir","Surah 40","Chapter 40","The Forgiver","غافِر"],"ayahNumber":4184,"juzNumber":24,"footnotes":"(1) یعنی ان کےدشمن کو ذلیل اور ان کو غالب کریں گے۔ بعض لوگوں کے ذہنوں میں یہ اشکال پیدا ہو سکتا ہے کہ بعض نبی قتل کردیئے گئے، جیسے حضرت یحیٰی و زکریا علیہما السلام وغیر ھما ا ور بعض ہجرت پر مجبور ہو گئے، جیسے ابراہیم (عليه السلام) اور ہمارے پیغمبر ﹲ اور صحابہ کرام رضوان اللہ علہیم اجمعین، وعدہ امداد کے باوجود ایسا کیوں ہوا؟ دراصل وہ وعدہ غالب حالات اور اکثریت کے اعتبار سے ہے،اس لیے بعض حالتوں میں اور بعض اشخاص پر کافروں کا غلبہ اس کے منافی نہیں۔ یا مطلب یہ ہے کہ عارضی طور پر بعض دفعہ اللہ کی حکمت و مشیت کے تحت کافروں کو غلبہ عطا فرما دیا جاتا ہے۔ لیکن بالآخر اہل ایمان ہی غالب اور سرخ رو ہوتے ہیں۔ جیسے حضرت یحیٰی و زکریا علیہما السلام کے قاتلین پر بعد میں اللہ تعالی نے ان کے دشمنوں کو مسلط فرما دیا، جنہوں نے ان کے خون سے اپنی پیاس بجھائی اور انہیں ذلیل و خوار کیا، جن یہودیوں نے حضرت عیسیٰ (عليه السلام) کو سولی دےکر مارنا چاہا، اللہ نے ان یہودیوں پر رومیوں کو ایسا غلبہ دیا کہ انھوں نے یہودیوں کوخوب ذلت کا عذاب چکھایا۔ پیغمبر اسلام ﹲ اور ان کے رفقا یقیناً ہجرت پرمجبور ہوئے لیکن اس کےبعد جنگ بدر، احد، احزاب، غزوۂ خیبراور پھر فتح مکہ کے ذریعے سے اللہ تعالیٰ نے جس طرح مسلمانوں کی مدد فرمائی اور اپنے پیغمبر اور اہل ایمان کو جس طرح غلبہ عطا فرمایا،اس کے بعد اللہ کی مدد کرنےمیں کیا شبہ رہ جاتا ہے؟ (ابن کثیر)۔\n(2) أَشْهَادٌ، شَهِيدٌ (گواہ) کی جمع ہے۔ جیسے شریف کی جمع اشراف ہے۔ قیامت والے دن فرشتے اور انبیا علہیم السلام گواہی دیں گے۔ یا فرشتے اس بات کی گواہی دیں گے کہ یااللہ پیغمبروں نے تیرا پیغام پہنچا دیا تھا لیکن ان کی امتوں نے ان کی تکذیب کی۔ علاوہ ازیں امت محمدیہ اور نبی کریم ﹲ بھی گواہی دیں گے۔ جیساکہ پہلے بھی بیان ہوچکا ہے۔ اس لیے قیامت کو گواہوں کےکھڑا ہونے کاﺩن کہا گیاہے۔ اس دن اہل ایمان کی مدد کرنے کامطلب ہے ان کو ان کے اچھے اعمال کی جزا دی جائے گی اور انہیں جنت میں داخل کیا جائے گا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"innā lananṣuru rusulanā wa-alladhīna āmanū fī al-ḥayati al-dun'yā wayawma yaqūmu al-ashhādu ","translations":["Indeed We","We will surely help","Our Messengers","and those who","believe","in","the life","(of) the world","and (on the) Day","(when) will stand","the witnesses","(51)"],"transliterationArr":["innā","lananṣuru","rusulanā","wa-alladhīna","āmanū","fī","al-ḥayati","al-dun'yā","wayawma","yaqūmu","al-ashhādu",null],"verseTiming":[[1,0,1620],[2,1620,3360],[3,3360,4460],[4,4460,5580],[5,5580,6650],[6,6650,6890],[7,6890,7940],[8,7940,8980],[9,8980,9760],[10,9760,10590],[11,10590,14315]]}}