{"name":"40:60","price":"اور تمہارے رب کا فرمان (سرزد ہوچکا ہے) کہ مجھ سے دعا کرو میں تمہاری دعاؤں کو قبول کروں گا(1) یقین مانو کہ جو لوگ میری عبادت سے خودسری کرتے ہیں وه عنقريب ذلیل ہوکر جہنم میں پہنچ جائیں گے.(2)","arabic":"وَقَالَ رَبُّكُمُ ٱدۡعُونِيٓ أَسۡتَجِبۡ لَكُمۡۚ إِنَّ ٱلَّذِينَ يَسۡتَكۡبِرُونَ عَنۡ عِبَادَتِي سَيَدۡخُلُونَ جَهَنَّمَ دَاخِرِينَ","category":["40 (Ghafir)","Ghafir","Surah Ghafir","Chapter Ghafir","Surah 40","Chapter 40","The Forgiver","غافِر"],"ayahNumber":4193,"juzNumber":24,"footnotes":"(1) گزشتہ آیت میں جب اللہ نے وقوع قیامت کا تذکرہ فرمایا،تو اب اس آیت میں ایسی رہنمائی دی جارہی ہے، جسے اختیار کر کے انسان آخرت کی سعادتوں سے ہمکنار ہو سکے۔ اس آیت میں دعا سے اکثر مفسرین نے عبادت مراد لی ہے۔ یعنی صرف ایک اللہ کی عبادت کرو۔ جیسا کہ حدیث میں بھی دعا کو عبادت بلکہ عبادت کامﻐﺰ قرار دیا گیا ہے۔ الدُّعَاءُ هُوَ الْعِبَادَةُ اور الدَّعَاءُ مُخُّ الْعِبَادَةِ (مسند أحمد 4/271 مشكاة الدعوات) علاوہ ازیں اس کے بعد يَسْتَكْبِرُونَ عَنْ عِبَادَتِي کے الفاظ سے بھی واضح ہے کہ مراد عبادت ہے۔ بعض کہتے ہیں کہ دعا سے مراد دعا ہی ہے یعنی اللہ سے جلب نفع اور دفع ضرر کا سوال کرنا، کیونکہ دعا کے شرعی اورحقیقی معنی مطلب کرنے کے ہیں، دوسرےمفہوم میں اس کا استعمال مجازی ہے علاوہ ازیں دعا بھی اپنے حقیقی معنی کی اعتبار سے اور حدیث مذکور کی رو سے بھی عبادت ہی ہے، کیونکہ مافوق الاسباب طریقے سےکسی سے کوئی چیز مانگنا اور اس سے سوال کرنا، یہ اس کی عبادت ہی ہے۔ (فتح القدیر) مطلب دونوں صورتوں میں ایک ہی ہے کہ اللہ کے سوا کسی اور کو طلب حاجات اور مدد کے لیے پکارنا جائز نہیں ہے۔ کیونکہ اس طرح مافو ق الاسباب طریقے سے کسی کو حاجت روائی کے لیے پکارنا اس کی عبادت ہے اور عبادت اللہ کے سوا کسی کی جائز نہیں۔\n(2) یہ اللہ کی عبادت سے انکار و اعراض یا اس میں دوسروں کو بھی شریک کرنے والوں کا انجام ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waqāla rabbukumu id'ʿūnī astajib lakum inna alladhīna yastakbirūna ʿan ʿibādatī sayadkhulūna jahannama dākhirīna ","translations":["And said","your Lord","Call upon Me","I will respond","to you","Indeed","those who","(are) proud","to","worship Me","will enter","Hell","(in) humiliation","(60)"],"transliterationArr":["waqāla","rabbukumu","id'ʿūnī","astajib","lakum","inna","alladhīna","yastakbirūna","ʿan","ʿibādatī","sayadkhulūna","jahannama","dākhirīna",null],"verseTiming":[[1,0,900],[2,900,1920],[3,1920,4340],[4,4340,5320],[5,5320,6560],[6,6560,7750],[7,7750,8760],[8,8760,10300],[9,10300,10720],[10,10720,11890],[11,11890,13300],[12,13300,15130],[13,15130,18615]]}}