{"name":"40:78","price":"یقیناً ہم آپ سے پہلے بھی بہت سے رسول بھیج چکے ہیں جن میں سے بعض کے (واقعات) ہم آپ کو بیان کر چکے ہیں اور ان میں سے بعض کے (قصے) تو ہم نے آپ کو بیان ہی(1) نہیں کیے اور کسی رسول کا یہ (مقدور) نہ تھا کہ کوئی معجزه اللہ کی اجازت کے بغیر ﻻ سکے(2) پھر جس وقت اللہ کا حکم آئےگا(3) حق کے ساتھ فیصلہ کر دیا جائے گا(4) اور اس جگہ اہل باطل خسارے میں ره جائیں گے.","arabic":"وَلَقَدۡ أَرۡسَلۡنَا رُسُلٗا مِّن قَبۡلِكَ مِنۡهُم مَّن قَصَصۡنَا عَلَيۡكَ وَمِنۡهُم مَّن لَّمۡ نَقۡصُصۡ عَلَيۡكَۗ وَمَا كَانَ لِرَسُولٍ أَن يَأۡتِيَ بِـَٔايَةٍ إِلَّا بِإِذۡنِ ٱللَّهِۚ فَإِذَا جَآءَ أَمۡرُ ٱللَّهِ قُضِيَ بِٱلۡحَقِّ وَخَسِرَ هُنَالِكَ ٱلۡمُبۡطِلُونَ","category":["40 (Ghafir)","Ghafir","Surah Ghafir","Chapter Ghafir","Surah 40","Chapter 40","The Forgiver","غافِر"],"ayahNumber":4211,"juzNumber":24,"footnotes":"(1) اور یہ تعداد میں، بہ نسبت ان کے جن کے واقعات بیان کیے گئے ہیں۔ بہت زیادہ ہیں۔ اس لیے کہ قرآن کریم میں تو صرف 25 ، انبیا ورسل کا ذکر اور ان کی قوموں کے حالات بیان کیے گئے ہیں۔\n(2) آیت سے مراد یہاں معجزہ اور خرق عادت واقعہ ہے، جو پیغمبر کی صداقت پر دلالت کرے۔ کفار، پیغمبروں سے مطالبے کرتے رہے کہ ہمیں فلاں فلاں چیز دکھاؤ ، جیسے خود نبی کریم ﹲ سےکفار مکہ نے کئی چیزوں کا مطالبہ کیا، جس کی تفصیل سورۂ بنی اسرائیل 90- 93 میں موجود ہے۔ اللہ تعالیٰ فرما رہا ہے کہ کسی پیغمبر کے اختیار میں یہ نہیں تھا۔ کہ وہ اپنی قوموں کے مطالبے پر ان کوکوئی معجزہ صادر کر کے دکھلا دے۔ یہ صرف ہمارے اختیار میں تھا، بعض نبیوں کو تو ابتدا ہی سے معجزے دے دیے گئے تھے۔ بعض قوموں کو ان کے مطالبے پرمعجزہ دکھلاگیا گیا اور بعض کو مطالبے کے باوجود نہیں دکھلایا گیا۔ ہماری مشیت کے مطابق اس کا فیصلہ ہوتا تھا۔ کسی نبی کے ہاتھ میں یہ اختیار نہیں تھا کہ وہ جب چاہتا، معجزہ صادر کر کے دکھلا دیتا۔ اس سے ان لوگوں کی واضح تردید ہوتی ہے، جو بعض اولیا کی طرف یہ باتیں منسوب کرتےہیں کہ وہ جب چاہتے ہیں اور جس طرح چاہتے، خرق عادت امور (کرامات) کا اظہار کر دیتے تھے۔ جیسے شیخ عبدالقادر جیلانی کے لیے بیان کیا جاتا ہے۔ یہ سب من گھڑت قصے کہانیاں ہیں، جب اللہ نے پیغمبروں کو یہ اختیار نہیں دیا، جن کو اپنی صداقت کے ثبوت کےلیے، اس کی ضرورت بھی تھی تو کسی ولی کو یہ اختیار کیونکرمل سکتا ہے؟ بالخصوص جب کہ ولی کو اس کی ضرورت بھی نہیں ہے۔ کیونکہ نبی کی نبوت پر ایمان لانا ضروری ہوتا ہے، اس لیے معجزہ ان کی ضرورت تھی۔ لیکن اللہ کی حکمت و مشیت اس کی مقتضی نہ تھی، اس لیے یہ قوت کسی نبی کو نہیں دی گئی۔ ولی کی ولایت پر ایمان رکھنا ضروری نہیں ہے، اس لیے انہیں معجزے اور کرامات کی ضرورت ہی نہیں ہے۔ انہیں اللہ تعالیٰ یہ اختیار بلا ضرورت کیوں عطا کر سکتا ہے؟\n(3) یعنی دنیا یا آخرت میں جب ان کے عذاب کا وقت معین آ جائے گا۔\n(4) یعنی ان کے درمیان حق کے ساتھ فیصلہ کر دیا جائے گا۔ اہل حق کو نجات اور اہل باطل کو عذاب۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walaqad arsalnā rusulan min qablika min'hum man qaṣaṣnā ʿalayka wamin'hum man lam naqṣuṣ ʿalayka wamā kāna lirasūlin an yatiya biāyatin illā bi-idh'ni al-lahi fa-idhā jāa amru al-lahi quḍiya bil-ḥaqi wakhasira hunālika al-mub'ṭilūna ","translations":["And certainly","We have sent","Messengers","before you","before you","Among them","(are) who ","We have related","to you","and among them","(are) who ","not","We have related","to you","And not","is","for any Messenger","that","he brings","a Sign","except","by (the) permission","(of) Allah","So when","comes","(the) Command","(of) Allah","it will be decided","in truth","and will lose","there","the falsifiers","(78)"],"transliterationArr":["walaqad","arsalnā","rusulan","min","qablika","min'hum","man","qaṣaṣnā","ʿalayka","wamin'hum","man","lam","naqṣuṣ","ʿalayka","wamā","kāna","lirasūlin","an","yatiya","biāyatin","illā","bi-idh'ni","al-lahi","fa-idhā","jāa","amru","al-lahi","quḍiya","bil-ḥaqi","wakhasira","hunālika","al-mub'ṭilūna",null],"verseTiming":[[1,0,750],[2,750,1950],[3,1950,2890],[4,2890,3970],[5,3970,5220],[6,5220,5890],[7,5890,7410],[8,7410,8490],[9,8490,9350],[10,9350,10190],[11,10190,11000],[12,11000,11640],[13,11640,12480],[14,12480,14440],[15,14440,15490],[16,15490,16090],[17,16090,17310],[18,17310,17410],[19,17410,18600],[20,18600,20470],[21,20470,21200],[22,21200,21880],[23,21880,22260],[24,22260,24690],[25,24690,25540],[26,25540,27580],[27,27580,28100],[28,28100,28960],[29,28960,29630],[30,29630,30660],[31,30660,31470],[32,31470,32570],[33,32570,35695]]}}