{"name":"40:74","price":"جو اللہ کے سوا تھے(1) وه کہیں گے کہ وه تو ہم سے بہک گئے(2) بلکہ ہم تو اس سے پہلے کسی کو بھی پکارتے ہی نہ تھے(3)۔ اللہ تعالیٰ کافروں کو اسی طرح گمراه کرتا ہے.(4)","arabic":"مِن دُونِ ٱللَّهِۖ قَالُواْ ضَلُّواْ عَنَّا بَل لَّمۡ نَكُن نَّدۡعُواْ مِن قَبۡلُ شَيۡـٔٗاۚ كَذَٰلِكَ يُضِلُّ ٱللَّهُ ٱلۡكَٰفِرِينَ","category":["40 (Ghafir)","Ghafir","Surah Ghafir","Chapter Ghafir","Surah 40","Chapter 40","The Forgiver","غافِر"],"ayahNumber":4207,"juzNumber":24,"footnotes":"(1) کیا وہ آج تمہاری مدد کر سکتے ہیں؟\n(2) یعنی پتہ نہیں، کہاں چلے گئےہیں، وہ ہماری مددکیا کریں گے؟\n(3) اقرار کرنے کے بعد، پھر ان کی عبادت کا ہی انکار کردیں گے۔ جیسے دوسرے مقام پر فرمایا۔ وَاللَّهِ رَبِّنَا مَا كُنَّا مُشْرِكِينَ (الأنعام:23) ”اللہ کی قسم! ہم تو کسی کی شریک ٹھہراتے ہی نہیں تھے“۔ کہتے ہیں کہ یہ بتوں کے وجود اور ان کی عبادت کا انکار نہیں ہے بلکہ اس بات کا اعتراف ہے کہ ان کی عبادت باطل تھی کیونکہ وہاں ان پر واضح ہوجائے گا کہ وہ ایسی چیزوں کی عبادت کرتے رہے جو سن سکتی تھیں، نہ دیکھ سکتی تھیں اور نقصان پہنچا سکتی تھیں نہ نفع۔ (فتح القدیر) اور اس کا دوسرا معنی واضح ہے اور یہ کہ وہ شرک کا سرے سے انکار ہی کریں گے۔\n(4) یعنی ان مکذبین ہی کی طرح، اللہ تعالیٰ کافروں کو بھی گمراہ کرتا ہے۔ مطلب یہ ہے کہ مسلسل تکذیب اور کفر، یہ ایسی چیزیں ہیں کہ جن سے انسانوں کےدل سیاہ اور زنگ آلودہ ہو جاتےہیں اور پھر وہ ہمیشہ کے لیے قبول حق کی توفیق سےمحروم ہو جاتے ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"min dūni al-lahi qālū ḍallū ʿannā bal lam nakun nadʿū min qablu shayan kadhālika yuḍillu al-lahu al-kāfirīna ","translations":["Other than","Other than","Allah","They will say","They have departed","from us","Nay","Not","we used to","[we] call","before","before","anything","Thus","Allah lets go astray","Allah lets go astray","the disbelievers","(74)"],"transliterationArr":["min","dūni","al-lahi","qālū","ḍallū","ʿannā","bal","lam","nakun","nadʿū","min","qablu","shayan","kadhālika","yuḍillu","al-lahu","al-kāfirīna",null],"verseTiming":[[1,0,1360],[2,1360,2020],[3,2020,5730],[4,5730,6490],[5,6490,7340],[6,7340,8780],[7,8780,9210],[8,9210,9620],[9,9620,10170],[10,10170,11520],[11,11520,12740],[12,12740,13280],[13,13280,14940],[14,14940,15930],[15,15930,16690],[16,16690,17580],[17,17580,20875]]}}