{"name":"40:8","price":"اے ہمارے رب! تو انہیں ہمیشگی والی جنتوں میں لے جا جن کا تو نے ان سے وعده کیا ہے اور ان کے باپ دادوں اور بیویوں اور اوﻻد میں سے (بھی) ان (سب) کو جو نیک عمل ہیں(1) ۔ یقیناً تو تو غالب و باحکمت ہے.","arabic":"رَبَّنَا وَأَدۡخِلۡهُمۡ جَنَّٰتِ عَدۡنٍ ٱلَّتِي وَعَدتَّهُمۡ وَمَن صَلَحَ مِنۡ ءَابَآئِهِمۡ وَأَزۡوَٰجِهِمۡ وَذُرِّيَّٰتِهِمۡۚ إِنَّكَ أَنتَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","category":["40 (Ghafir)","Ghafir","Surah Ghafir","Chapter Ghafir","Surah 40","Chapter 40","The Forgiver","غافِر"],"ayahNumber":4141,"juzNumber":24,"footnotes":"(1) یعنی ان سب کو جنت میں جمع فرما دے تاکہ ایک دوسرےکو دیکھ کر ان کی آنکھیں ٹھنڈی ہوں۔ اس مضمون کو دوسرے مقام پر اس طرح بیان فرمایا گیا ہے «وَالَّذِينَ آمَنُوا وَاتَّبَعَتْهُمْ ذُرِّيَّتُهُمْ بِإِيمَانٍ أَلْحَقْنَا بِهِمْ ذُرِّيَّتَهُمْ وَمَا أَلَتْنَاهُمْ مِنْ عَمَلِهِمْ مِنْ شَيْءٍ» (الطور: 21) ”وہ لوگ جو ایمان لائےاور ان ہی کی پیروی ان کی اولاد نے ایمان کے ساتھ کی۔ ملا دیا ہم نے ان کے ساتھ ان کی اولاد کو اورہم نے ان کے عملوں میں سے کچھ کم نہیں کیا“۔ یعنی سب کو جنت میں اس طرح یکساں مرتبہ دے دیا کہ ادنیٰ کو بھی اعلیٰ مقام عطا کر دیا۔ یہ نہیں کیا کہ اعلیٰ مقام میں کمی کر کے انہیں ادنیٰ مقام پر لے آئے،بلکہ ادنیٰ کو اٹھا کر اعلیٰ کردیا اور اس کےعمل کی کمی کو اپنے فضل و کرم سے پورا کر دیا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"rabbanā wa-adkhil'hum jannāti ʿadnin allatī waʿadttahum waman ṣalaḥa min ābāihim wa-azwājihim wadhurriyyātihim innaka anta al-ʿazīzu al-ḥakīmu ","translations":["Our Lord","And admit them","(to) Gardens","(of) Eden","which","You have promised them","and whoever","(was) righteous","among","their fathers","and their spouses","and their offspring","Indeed You","You","(are) the All-Mighty","the All-Wise","(8)"],"transliterationArr":["rabbanā","wa-adkhil'hum","jannāti","ʿadnin","allatī","waʿadttahum","waman","ṣalaḥa","min","ābāihim","wa-azwājihim","wadhurriyyātihim","innaka","anta","al-ʿazīzu","al-ḥakīmu",null],"verseTiming":[[1,0,1120],[2,1120,2500],[3,2500,4150],[4,4150,5020],[5,5020,5730],[6,5730,6950],[7,6950,8000],[8,8000,8750],[9,8750,9080],[10,9080,11660],[11,11660,13310],[12,13310,15870],[13,15870,17440],[14,17440,18800],[15,18800,19910],[16,19910,22615]]}}