{"name":"40:9","price":"انہیں برائیوں سے بھی محفوظ رکھ(1) ، حق تو یہ ہے کہ اس دن تونے جسے برائیوں سے بچا لیا اس پر تو نے رحمت کر دی اور بہت بڑی کامیابی تو یہی ہے.(2)","arabic":"وَقِهِمُ ٱلسَّيِّـَٔاتِۚ وَمَن تَقِ ٱلسَّيِّـَٔاتِ يَوۡمَئِذٖ فَقَدۡ رَحِمۡتَهُۥۚ وَذَٰلِكَ هُوَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ","category":["40 (Ghafir)","Ghafir","Surah Ghafir","Chapter Ghafir","Surah 40","Chapter 40","The Forgiver","غافِر"],"ayahNumber":4142,"juzNumber":24,"footnotes":"(1) سیئات سے مرادیہاں عقوبات ہیں یا پھر جزا محذوف ہے یعنی انہیں آخرت کی سزاوں سے یا برائیوں سےبچانا۔\n(2) یعنی آخرت کے عذاب سے بچ جانا اور جنت میں داخل ہو جانا، یہی سب سے بڑی کامیابی ہے۔ اس لیے کہ اس جیسی کوئی کامیابی نہیں اور اس کے برابر کوئی نجات نہیں۔ ان آیات میں اہل ایمان کے لیے دو عظیم خوش خبریاں ہیں، ایک تویہ کہ فرشتے ان کے لیےغائبانہ دعاکرتے ہیں۔ (جس کی حدیث میں بڑی فضیلت واردہے) دوسری، یہ کہ اہل ایمان کے خاندان جنت میں اکٹھے ہو جائیں گے۔ جَعَلَنَا اللهُ مِنَ الَّذِينَ يُلْحِقُهُمُ اللهُ بِآبَائِهِمُ الصَّالِحِينَ۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waqihimu al-sayiāti waman taqi al-sayiāti yawma-idhin faqad raḥim'tahu wadhālika huwa al-fawzu al-ʿaẓīmu ","translations":["And protect them","(from) the evils","And whoever","you protect","(from) the evils","that Day","then verily","You have bestowed mercy on him","And that","[it]","(is) the success","the great","(9)"],"transliterationArr":["waqihimu","al-sayiāti","waman","taqi","al-sayiāti","yawma-idhin","faqad","raḥim'tahu","wadhālika","huwa","al-fawzu","al-ʿaẓīmu",null],"verseTiming":[[1,0,850],[2,850,4310],[3,4310,5430],[4,5430,5880],[5,5880,7370],[6,7370,9000],[7,9000,9780],[8,9780,11240],[9,11240,12250],[10,12250,12560],[11,12560,13420],[12,13420,15975]]}}