{"name":"41:10","price":"اور اس نے زمین میں اس کے اوپر سے پہاڑ گاڑ دیے(1) اوراس میں برکت رکھ دی(2) اوراس میں (رہنے والوں کی) غذاؤں کی تجویز بھی اسی میں کر دی(3) (صرف) چار دن میں(4)، ضرورت مندوں کے لیے یکساں طور پر.(5)","arabic":"وَجَعَلَ فِيهَا رَوَٰسِيَ مِن فَوۡقِهَا وَبَٰرَكَ فِيهَا وَقَدَّرَ فِيهَآ أَقۡوَٰتَهَا فِيٓ أَرۡبَعَةِ أَيَّامٖ سَوَآءٗ لِّلسَّآئِلِينَ","category":["41 (Fussilat)","Fussilat","Surah Fussilat","Chapter Fussilat","Surah 41","Chapter 41","Explained in Detail","فُصِّلَت"],"ayahNumber":4228,"juzNumber":24,"footnotes":"(1) یعنی پہاڑوں کو زمین میں سےہی پیدا کر کے ان کواس کے اوپر گاڑ دیا تاکہ زمین ادھر یا ادھر نہ ڈولے۔\n(2) یہ اشارہ ہے پانی کی کثرت، انواع و اقسام کے رزق، معدنیات اوردیگراسی قسم کی اشیا کی طرف یہ زمین کی برکت ہے، کثرت خیر کا نام ہی برکت ہے۔\n(3) أَقْوَاتٌ ، قُوتٌ (غذا، خوراک) کی جمع ہے یعنی زمین پر بسنے والی تمام مخلوقات کی خوراک اس میں مقدر کر دی ہے یا بند وبست کر دیا ہے۔ اور رب کی اس تقدیر یا بند وبست کا سلسلہ اتنا وسیع ہے کہ کوئی زبان اسے بیان نہیں کرسکتی، کوئی قلم اسے رقم نہیں کر سکتا اور کوئی کیلکولیٹر اسےگن نہیں سکتا۔ بعض نے اس کا مطلب یہ بیان کیا ہے کہ ہر زمین کے دوسرے حصوں میں پیدا نہیں ہو سکتیں۔ تاکہ ہر علاقے کی یہ یہ مخصوص پیداواران ان علاقوں کی تجارت و معیشت کی بنیادیں بن جائیں۔ چنانچہ یہ مفہوم بھی اپنی جگہ صحیح اوربالکل حقیقت ہے۔\n(4) یعنی تخلیق کے پہلے دو دن اوروحی کے دو دن سارے دن ملاکے یہ کل چار دن ہوئے، جن میں یہ سارا عمل تکمیل کو پہنچا۔\n(5) سَوَاءً کا مطلب ہے، ٹھیک چار دن میں۔ یعنی پوچھنے والوں کو بتلا دو کہ تخلیق اور دَحْوٌ کایہ عمل ٹھیک چار دن میں ہوا۔ یا پورا یا برابر جواب ہے سائلین کے لیے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wajaʿala fīhā rawāsiya min fawqihā wabāraka fīhā waqaddara fīhā aqwātahā fī arbaʿati ayyāmin sawāan lilssāilīna ","translations":["And He placed","therein","firmly-set mountains","above it","above it","and He blessed","therein","and determined","therein","its sustenance","in","four","periods","equal","for those who ask","(10)"],"transliterationArr":["wajaʿala","fīhā","rawāsiya","min","fawqihā","wabāraka","fīhā","waqaddara","fīhā","aqwātahā","fī","arbaʿati","ayyāmin","sawāan","lilssāilīna",null],"verseTiming":[[1,0,890],[2,890,1550],[3,1550,2530],[4,2530,3670],[5,3670,4680],[6,4680,5670],[7,5670,6460],[8,6460,7490],[9,7490,9770],[10,9770,11380],[11,11380,11440],[12,11440,12890],[13,12890,15280],[14,15280,16690],[15,16690,18740],[16,18740,19710],[17,19710,21530],[18,21530,23850],[19,23850,29615]]}}