{"name":"41:16","price":"بالﺂخر ہم نے ان پر ایک تیز و تند آندھی(1) منحوس دنوں میں(2) بھیج دی کہ انہیں دنیاوی زندگی میں ذلت کے عذاب کامزه چکھا دیں، اور (یقین مانو) کہ آخرت کا عذاب اس سے بہت زیاده رسوائی واﻻ ہے اور وه مدد نہیں کیے جائیں گے.","arabic":"فَأَرۡسَلۡنَا عَلَيۡهِمۡ رِيحٗا صَرۡصَرٗا فِيٓ أَيَّامٖ نَّحِسَاتٖ لِّنُذِيقَهُمۡ عَذَابَ ٱلۡخِزۡيِ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۖ وَلَعَذَابُ ٱلۡأٓخِرَةِ أَخۡزَىٰۖ وَهُمۡ لَا يُنصَرُونَ","category":["41 (Fussilat)","Fussilat","Surah Fussilat","Chapter Fussilat","Surah 41","Chapter 41","Explained in Detail","فُصِّلَت"],"ayahNumber":4234,"juzNumber":24,"footnotes":"(1) صَرْصَرٍ صُرَّةٌ (آواز) سے ہے یعنی ایسی ہوا جس میں سخت آواز تھی۔ یعنی نہایت تند اور تیز ہوا، جس میں آواز بھی ہوتی ہے۔ بعض کہتے ہیں یہ صرسے ہے، جس کے معنی برد (ٹھنڈک) کے ہیں۔ یعنی ایسی پالے والی ہوا جو آگ کی طرح جلا ڈالتی ہے۔ امام ابن کثیر فرماتےہیں وَالْحَقُّ أَنَّهَا مُتَّصِفَةٌ بِجَمِيعِ ذَلِكَ، وہ ہوا ان تمام ہی باتوں سے متصف تھی۔\n(2) نَحِسَاتٌ کا ترجمہ، بعض نے متواتر پے در پے کا کیا ہے۔ کیونکہ یہ ہوا سات راتیں اور آٹھ دن مسلسل چلتی رہی بعض نے سخت، بعض نے گرد وغبار والے اور بعض نے نحوست والے کیا ہے، آخری ترجمہ کا مطلب یہ ہوگا کہ یہ ایام جن میں ان پر سخت ہوا کا طوفان جاری رہا، ان کے لیے منحوس ثابت ہوئے۔ یہ نہیں کہ ایام ہی مطلقاً منحوس ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"fa-arsalnā ʿalayhim rīḥan ṣarṣaran fī ayyāmin naḥisātin linudhīqahum ʿadhāba al-khiz'yi fī al-ḥayati al-dun'yā walaʿadhābu al-ākhirati akhzā wahum lā yunṣarūna ","translations":["So We sent","upon them","a wind","furious","in","(the) days","(of) misfortune","that We may make them taste","(the) punishment","(of) disgrace","in","the life","(of) the world","And surely, (the) punishment","(of) the Hereafter","(is) more disgracing","and they","will not be helped","will not be helped","(16)"],"transliterationArr":["fa-arsalnā","ʿalayhim","rīḥan","ṣarṣaran","fī","ayyāmin","naḥisātin","linudhīqahum","ʿadhāba","al-khiz'yi","fī","al-ḥayati","al-dun'yā","walaʿadhābu","al-ākhirati","akhzā","wahum","lā","yunṣarūna",null],"verseTiming":[[1,0,1470],[2,1470,2490],[3,2490,3980],[4,3980,5570],[5,5570,7680],[6,7680,8800],[7,8800,10700],[8,10700,12960],[9,12960,14350],[10,14350,15230],[11,15230,16100],[12,16100,16310],[13,16310,17360],[14,17360,18360],[15,18360,20020],[16,20020,21320],[17,21320,22230],[18,22230,23360],[19,23360,23730],[20,23730,27425]]}}