{"name":"41:23","price":"تمہاری اسی بدگمانی نےجو تم نے اپنے رب سے کر رکھی تھی تمہیں ہلاک کر دیا(1) اور بالﺂخر تم زیاں کاروں میں ہو گئے.","arabic":"وَذَٰلِكُمۡ ظَنُّكُمُ ٱلَّذِي ظَنَنتُم بِرَبِّكُمۡ أَرۡدَىٰكُمۡ فَأَصۡبَحۡتُم مِّنَ ٱلۡخَٰسِرِينَ","category":["41 (Fussilat)","Fussilat","Surah Fussilat","Chapter Fussilat","Surah 41","Chapter 41","Explained in Detail","فُصِّلَت"],"ayahNumber":4241,"juzNumber":24,"footnotes":"(1) یعنی تمہارے اس اعتقاد فاسد اور گمان باطل نے کہ اللہ کوہمارے بہت سےعملوں کاﻋلﻢ نہیں ہوتا، تمہیں ہلاکت میں ڈال دیا، کیونکہ اس کی وجہ سے تم ہر قسم کا گناہ کرنےمیں دلیر اور بےخوف ہو گئے تھے۔ اس کی شان نزول میں ایک روایت ہے حضرت عبداللہ بن مسعود (رضي الله عنه) فرماتے ہیں کہ خانہ کعبہ کے پاس دو قرشی اور ایک ثقفی یا دو ثقفی اور ایک قرشی جمع ہوئے۔ فربہ بدن، قلیل الفہم۔ ان میں سے ایک نے کہا کیا تم سمجھتے ہو، ہماری باتیں اللہ سنتا ہے؟ دوسرے نے کہا ہماری جہری باتیں سنتا ہے اور سری باتیں نہیں سنتا ایک اور نے کہا اگر وہ ہماری جہری (اونچی) باتیں سنتا ہے توہماری سری (پوشیدہ) باتیں بھی یقیناً سنتا ہے جس پر اللہ تعالیٰ نے آیت وَمَا كُنْتُمْ تَسْتَتِرُونَ (نازل فرمائی،) صحیح بخاری، تفسیر سورۂ حم السجدۃ)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wadhālikum ẓannukumu alladhī ẓanantum birabbikum ardākum fa-aṣbaḥtum mina al-khāsirīna ","translations":["And that","(was) your assumption","which","you assumed","about your Lord","It has ruined you","and you have become","of","the losers","(23)"],"transliterationArr":["wadhālikum","ẓannukumu","alladhī","ẓanantum","birabbikum","ardākum","fa-aṣbaḥtum","mina","al-khāsirīna",null],"verseTiming":[[1,0,1450],[2,1450,3180],[3,3180,4040],[4,4040,6289],[5,6289,7929],[6,7929,9189],[7,9189,10839],[8,10839,11829],[9,11829,15754]]}}