{"name":"41:20","price":"یہاں تک کہ جب بالکل جہنم کےپاس آجائیں گے اور ان پر ان کے کان اور ان کی آنکھیں اور ان کی کھالیں ان کے اعمال کی گواہی دیں گی.(1)","arabic":"حَتَّىٰٓ إِذَا مَا جَآءُوهَا شَهِدَ عَلَيۡهِمۡ سَمۡعُهُمۡ وَأَبۡصَٰرُهُمۡ وَجُلُودُهُم بِمَا كَانُواْ يَعۡمَلُونَ","category":["41 (Fussilat)","Fussilat","Surah Fussilat","Chapter Fussilat","Surah 41","Chapter 41","Explained in Detail","فُصِّلَت"],"ayahNumber":4238,"juzNumber":24,"footnotes":"(1) یعنی جب وہ اس بات سے انکار کریں گے کہ انہوں نے شرک کا ارتکاب کیا، تو اللہ تعالیٰ ان کےمونہوں پر مہر لگا دے گا اور ان کے اعضاء بول کر گواہی دیں گے کہ یہ فلاں فلاں کام کرتے رہے إِذَا مَا جَاءُواهَا میں مَا زائد ہے تاکید کے لیے . انسان کے اندر پانچ حواس ہیں۔ یہاں دو کا ذکر ہے۔ تیسری جلد (کھال) کا ذکر ہے جو مس یا لمس کا آلہ ہے۔ یوں حواس کی تین قسمیں ہو گئیں۔ باقی دو حواس کا ذکر اس لیے نہیں کیا کہ ذوق (چکھنا) بوجوہ لمس میں داخل ہے، کیونکہ یہ چکھنا اس وقت تک ممکن نہیں ہے جب تک اس شے کو زبان کی جلد پر نہ رکھا جائے۔ اسی طرح سونگھنا (شم) اس وقت تک ممکن نہیں جب تک وہ شئے ناک کی جلد پر نہ گزرے۔ اس اعتبار سے جلود کے لفظ میں تین حواس آجاتے ہیں۔ (فتح القدیر)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"ḥattā idhā mā jāūhā shahida ʿalayhim samʿuhum wa-abṣāruhum wajulūduhum bimā kānū yaʿmalūna ","translations":["Until","when","when","they come to it","(will) testify","against them","their hearing","and their sight","and their skins","(as) to what","they used to","do","(20)"],"transliterationArr":["ḥattā","idhā","mā","jāūhā","shahida","ʿalayhim","samʿuhum","wa-abṣāruhum","wajulūduhum","bimā","kānū","yaʿmalūna",null],"verseTiming":[[1,0,2689],[2,2689,3349],[3,3349,3729],[4,3729,6699],[5,6699,7319],[6,7319,8369],[7,8369,9529],[8,9529,11149],[9,11149,13209],[10,13209,13689],[11,13689,14609],[12,14609,18004]]}}