{"name":"41:21","price":"یہ اپنی کھالوں سے کہیں گے کہ تم نے ہمارے خلاف شہادت کیوں دی(1) ، وه جواب دیں گی کہ ہمیں اس اللہ نے قوت گویائی عطا فرمائی جس نے ہر چیز کو بولنے کی طاقت بخشی ہے، اسی نے تمہیں اول مرتبہ پیدا کیا اور اسی کی طرف تم سب لوٹائے جاؤ گے.(2)","arabic":"وَقَالُواْ لِجُلُودِهِمۡ لِمَ شَهِدتُّمۡ عَلَيۡنَاۖ قَالُوٓاْ أَنطَقَنَا ٱللَّهُ ٱلَّذِيٓ أَنطَقَ كُلَّ شَيۡءٖۚ وَهُوَ خَلَقَكُمۡ أَوَّلَ مَرَّةٖ وَإِلَيۡهِ تُرۡجَعُونَ","category":["41 (Fussilat)","Fussilat","Surah Fussilat","Chapter Fussilat","Surah 41","Chapter 41","Explained in Detail","فُصِّلَت"],"ayahNumber":4239,"juzNumber":24,"footnotes":"(1) یعنی جب مشرکین اور کفار دیکھیں گے کہ خود ان کےاپنے اعضا ان کے خلاف گواہی دے رہے ہیں، تو ازراہ تعجب یا بطور عتاب اور ناراضی کے، ان سےیہ کہیں گے۔\n(2) بعض کےنزدیک وَهُوَ سے اللہ کا کلام مراد ہے۔ اس لحاظ سے یہ جملہ مستانفہ ہے۔ اور بعض کےنزدیک جلود انسانی ہی کا۔ اس اعتبار سے یہ انہی کے کلام کا تتمہ ہے۔ قیامت والے دن انسانی اعضا کے گواہی دینے کا ذکر اس سے قبل سورۂ نور، آیت 42، سورۂ یسٰین، آیت65 میں بھی گزر چکا ہے اورصحیح احادیث میں بھی اسے بیان کیا گیا ہے۔ مثلاً جب اللہ کے حکم سے انسانی اعضا بول کر بتلائیں گے تو بندہ کہے گا، بُعْدًا لَّكُنَّ وَسُحْقًا ؛ فَعَنْكُنَّ كُنْتُ أُنَاضِلُ (صحيح مسلم ، كتاب الزهد) تمہارے لیے ہلاکت اور دوری ہو، میں تو تمہاری ہی خاطر جھگڑ رہا اور مدافعت کررہا تھا اسی روایت میں یہ بھی بیان ہوا ہے کہ بندہ کہے گا کہ میں اپنے نفس کے سوا کسی کی گواہی نہیں مانوں گا۔ اللہ تعالیٰ فرمائے گا، کیا میں اور میرے فرشتے کراماً کاتبین گواہی کے لیے کافی نہیں۔ پھر اس کے منہ پر مہر لگا دی جائے گی اور اس کے اعضا کو بولنے کا حکم دیا جائے گا، (حوالہ مذکور)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waqālū lijulūdihim lima shahidttum ʿalaynā qālū anṭaqanā al-lahu alladhī anṭaqa kulla shayin wahuwa khalaqakum awwala marratin wa-ilayhi tur'jaʿūna ","translations":["And they will say","to their skins","Why do","you testify","against us","They will say","Allah made us speak","Allah made us speak","the One Who","makes speak","every","thing","and He","created you","(the) first","time","and to Him","you will be returned","(21)"],"transliterationArr":["waqālū","lijulūdihim","lima","shahidttum","ʿalaynā","qālū","anṭaqanā","al-lahu","alladhī","anṭaqa","kulla","shayin","wahuwa","khalaqakum","awwala","marratin","wa-ilayhi","tur'jaʿūna",null],"verseTiming":[[1,0,1130],[2,1130,2650],[3,2650,2990],[4,2990,4120],[5,4120,5450],[6,5450,8290],[7,8290,10050],[8,10050,10970],[9,10970,13330],[10,13330,14860],[11,14860,15440],[12,15440,16190],[13,16190,17410],[14,17410,18560],[15,18560,19480],[16,19480,21200],[17,21200,22260],[18,22260,25235]]}}