{"name":"41:37","price":"اور دن رات اور سورج چاند بھی (اسی کی) نشانیوں میں سے ہیں(1) ، تم سورج کو سجده نہ کرو نہ چاند کو(2) بلکہ سجده اس اللہ کے لیے کرو جس نے ان سب کو پیدا کیا ہے(3)، اگر تمہیں اس کی عبادت کرنی ہے تو.","arabic":"وَمِنۡ ءَايَٰتِهِ ٱلَّيۡلُ وَٱلنَّهَارُ وَٱلشَّمۡسُ وَٱلۡقَمَرُۚ لَا تَسۡجُدُواْ لِلشَّمۡسِ وَلَا لِلۡقَمَرِ وَٱسۡجُدُواْۤ لِلَّهِۤ ٱلَّذِي خَلَقَهُنَّ إِن كُنتُمۡ إِيَّاهُ تَعۡبُدُونَ","category":["41 (Fussilat)","Fussilat","Surah Fussilat","Chapter Fussilat","Surah 41","Chapter 41","Explained in Detail","فُصِّلَت"],"ayahNumber":4255,"juzNumber":24,"footnotes":"(1) یعنی رات کو تاریک بنانا تاکہ لوگ اس میں آرام کر سکیں، دن کو روشن بنانا تاکہ کسب معاش میں پریشانی نہ ہو، پھر یکے بعد دیگرے ایک دوسرے کا آنا جانا اور کبھی رات کا لمبا اور دن کاچھووٹا ہونا۔ اور کبھی اس کے برعکس دن کا لمبا اور رات کا چھوٹا ہونا۔ اسی طرح سورج اور چاندکا اپنے اپنے وقت پر طلوع و غروب ہونا اور اپنے اپنے مدار پراپنی منزلیں طے کرتے رہنا اور آپس میں باہمی تصادم سے محفوظ رہنا، یہ سب اس بات کی دلیلیں ہیں کہ ان کا یقیناً کوئی خالق اور مالک ہے۔ نیز وہ ایک اور صرف ایک ہے اورکائنات میں صرف اسی کا تصرف اور حکم چلتا ہے۔ اگر تدبیر و امرکا اختیار رکھنے والے، ایک سے زیادہ ہوتے تو یہ نظام کائنات ایسے مستحکم اور لگے بندھے طریقے سےکبھی نہیں چل سکتا تھا۔\n(2) اس لیے کہ یہ بھی تمہاری اللہ کی مخلوق ہیں، خدائی اختیارات سے بہرہ ور یا ان میں شریک نہیں ہیں۔\n(3) خَلَقَهُنَّ ، میں جمع مونث کی ضمیر اس لیے آئی ہے کہ یہ یا تو خَلَقَ هَذِهِ الأَرْبَعَةَ الْمَذْكُورَةَ کے مفہوم میں ہے، کیونکہ غیر عاقل کی جمع کا حکم مؤنث ہی کا ہے۔ یا اس کا مرجع شمس و قمرہی ہیں اور بعض ائمہ نحاۃ کے نزدیک تثنیہ بھی جمع ہے یا پھر مراد الآیات ہیں، (فتح القدیر)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wamin āyātihi al-laylu wal-nahāru wal-shamsu wal-qamaru lā tasjudū lilshamsi walā lil'qamari wa-us'judū lillahi alladhī khalaqahunna in kuntum iyyāhu taʿbudūna ","translations":["And of","His Signs","(are) the night","and the day","and the sun","and the moon","(Do) not","prostrate","to the sun","and not","to the moon","but prostrate","to Allah","the One Who","created them","if","you","Him alone","worship","(37)"],"transliterationArr":["wamin","āyātihi","al-laylu","wal-nahāru","wal-shamsu","wal-qamaru","lā","tasjudū","lilshamsi","walā","lil'qamari","wa-us'judū","lillahi","alladhī","khalaqahunna","in","kuntum","iyyāhu","taʿbudūna",null],"verseTiming":[[1,0,750],[2,750,2070],[3,2070,2930],[4,2930,4920],[5,4920,5980],[6,5980,7610],[7,7610,8020],[8,8020,9110],[9,9110,10290],[10,10290,10900],[11,10900,11970],[12,11970,13000],[13,13000,14120],[14,14120,14990],[15,14990,17080],[16,17080,18280],[17,18280,19810],[18,19810,20860],[19,20860,23845]]}}