{"name":"41:30","price":"(واقعی) جن لوگوں نے کہا کہ ہمارا پروردگار اللہ ہے(1) پھر اسی پر قائم رہے(2) ان کے پاس فرشتے (یہ کہتے ہوئے آتے ہیں(3) کہ تم کچھ بھی اندیشہ اور غم نہ کرو(4) (بلکہ) اس جنت کی بشارت سن لو جس کا تم وعده دیئے گئے ہو.(5)","arabic":"إِنَّ ٱلَّذِينَ قَالُواْ رَبُّنَا ٱللَّهُ ثُمَّ ٱسۡتَقَٰمُواْ تَتَنَزَّلُ عَلَيۡهِمُ ٱلۡمَلَٰٓئِكَةُ أَلَّا تَخَافُواْ وَلَا تَحۡزَنُواْ وَأَبۡشِرُواْ بِٱلۡجَنَّةِ ٱلَّتِي كُنتُمۡ تُوعَدُونَ","category":["41 (Fussilat)","Fussilat","Surah Fussilat","Chapter Fussilat","Surah 41","Chapter 41","Explained in Detail","فُصِّلَت"],"ayahNumber":4248,"juzNumber":24,"footnotes":"(1) یعنی ایک اللہ وحدہ لاشریک . رب بھی وہی اور معبود بھی وہی . یہ نہیں کہ ربوبیت کا تو اقرار ، لیکن الوہیت میں دوسروں کو بھی شریک کیا جارہا ہے۔\n(2) یعنی سخت سے سخت حالات میں بھی ایمان و توحید پر قائم رہے، اس سے انحراف نہیں کیا بعض نےاستقامت کے معنی اخلاص کیے ہیں۔ یعنی صرف ایک اللہ ہی کی عبادت واطاعت کی۔ جس طرح حدیث میں بھی آتا ہے، ایک شخص نے رسول (صلى الله عليه وسلم) سے کہا مجھےایسی بات بتلا دیں کہ آپ (صلى الله عليه وسلم) کے بعد کسی سے مجھے کچھ پوچھنے کی ضرورت نہ رہے۔ آپ (صلى الله عليه وسلم) نے فرمایا، ”قُلْ آمَنْتُ بِاللهِ ثُمَّ اسْتَقِمْ“ (صحيح مسلم- كتاب الإيمان، باب جامع أوصاف الإسلام) (کہہ، میں اللہ پر ایمان لایا، پھر اس پر استقامت اختیار کر)۔\n(3) یعنی موت کے وقت، بعض کہتےہیں، فرشتے یہ خوش خبری تین جگہوں پر دیتے ہیں، موت کے وقت، قبر میں اور قبر سے دوبارہ اٹھنے کے وقت۔\n(4) یعنی آخرت میں پیش آنے والے حالات کا اندیشہ اور دنیا میں مال و اولاد جو چھوڑ آئے ہو، ان کا غم نہ کرو۔\n(5) یعنی دنیامیں جس کا وعدہ تمہیں دیا گیا تھا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"inna alladhīna qālū rabbunā al-lahu thumma is'taqāmū tatanazzalu ʿalayhimu al-malāikatu allā takhāfū walā taḥzanū wa-abshirū bil-janati allatī kuntum tūʿadūna ","translations":["Indeed","those who","say","Our Lord","(is) Allah","then","stand firm ","will descend","on them","the Angels","(Do) not","fear","and (do) not","grieve","but receive the glad tidings","of Paradise","which","you were","promised","(30)"],"transliterationArr":["inna","alladhīna","qālū","rabbunā","al-lahu","thumma","is'taqāmū","tatanazzalu","ʿalayhimu","al-malāikatu","allā","takhāfū","walā","taḥzanū","wa-abshirū","bil-janati","allatī","kuntum","tūʿadūna",null],"verseTiming":[[1,0,1480],[2,1480,2550],[3,2550,3470],[4,3470,4220],[5,4220,5130],[6,5130,6460],[7,6460,7790],[8,7790,9130],[9,9130,10130],[10,10130,13210],[11,13210,14020],[12,14020,15250],[13,15250,15710],[14,15710,16980],[15,16980,18170],[16,18170,21120],[17,21120,22310],[18,22310,24550],[19,24550,25380],[20,25380,27290],[21,27290,30955]]}}