{"name":"41:43","price":"آپ سے وہی کہا جاتا ہے جو آپ سے پہلے کے رسولوں سے بھی کہا گیا ہے(1) ، یقیناً آپ کا رب معافی واﻻ(2) اور دردناک عذاب واﻻ ہے.(3)","arabic":"مَّا يُقَالُ لَكَ إِلَّا مَا قَدۡ قِيلَ لِلرُّسُلِ مِن قَبۡلِكَۚ إِنَّ رَبَّكَ لَذُو مَغۡفِرَةٖ وَذُو عِقَابٍ أَلِيمٖ","category":["41 (Fussilat)","Fussilat","Surah Fussilat","Chapter Fussilat","Surah 41","Chapter 41","Explained in Detail","فُصِّلَت"],"ayahNumber":4261,"juzNumber":24,"footnotes":"(1) یعنی پچھلی قوموں نے اپنے پیغمبروں کی تکذیب کے لیے جوکچھ کہا کہ یہ ساحر ہیں، مجنون ہیں، کذاب ہیں وغیرہ وغیرہ، وہی کچھ کفار مکہ نےبھی آپ (صلى الله عليه وسلم) کو کہا ہے۔ یہ گویا آپ (صلى الله عليه وسلم) کو تسلی دی جارہی ہے کہ آپ (صلى الله عليه وسلم) کی تکذیب اور آپ (صلى الله عليه وسلم) کی سحر، کذب اور جنون کی طرف نسبت، نئی بات نہیں ہے، ہر پیغمبر کے ساتھ یہی کچھ ہوتا آیا ہے جیسے دوسرے مقام پر فرمایا «مَا أَتَى الَّذِينَ مِنْ قَبْلِهِمْ مِنْ رَسُولٍ إِلا قَالُوا سَاحِرٌ أَوْ مَجْنُونٌ ، أَتَوَاصَوْا بِهِ بَلْ هُمْ قَوْمٌ طَاغُونَ» (الذاريات: 53،52) دوسرا مطلب اس کا یہ ہے کہ آپ (صلى الله عليه وسلم) کو توحید اور اخلاص کا جو حکم دیا گیا ہے، یہ وہی باتیں ہیں جو آپ (صلى الله عليه وسلم) سے پہلے رسولوں کو بھی کہی گئی تھیں۔ اس لیے کہ تمام شریعتیں ان باتوں پر متفق رہی ہیں بلکہ سب کی اولین دعوت ہی توحید و اخلاص تھی۔ (فتح القدیر)۔\n(2) یعنی ان اہل ایمان و توحید کے لیے جو مستحق مغفرت ہیں۔\n(3) ان کےلیے جوکافر اور اللہ کے پیغمبروں کےدشمن ہیں۔ یہ آ یت بھی سورۂ حجرکی آیت «نَبِّئْ عِبَادِي أَنِّي أَنَا الْغَفُورُ الرَّحِيمُ ، وَأَنَّ عَذَابِي هُوَ الْعَذَابُ الأَلِيمُ» کی طرح ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"mā yuqālu laka illā mā qad qīla lilrrusuli min qablika inna rabbaka ladhū maghfiratin wadhū ʿiqābin alīmin ","translations":["Not","is said","to you","except","what","was said","was said","to the Messengers","before you","before you","Indeed","your Lord","(is) Possessor","(of) forgiveness","and Possessor","(of) penalty","painful","(43)"],"transliterationArr":["mā","yuqālu","laka","illā","mā","qad","qīla","lilrrusuli","min","qablika","inna","rabbaka","ladhū","maghfiratin","wadhū","ʿiqābin","alīmin",null],"verseTiming":[[1,0,600],[2,600,1480],[3,1480,1930],[4,1930,2840],[5,2840,3220],[6,3220,3700],[7,3700,4430],[8,4430,5470],[9,5470,6950],[10,6950,8330],[11,8330,9530],[12,9530,10390],[13,10390,10960],[14,10960,13270],[15,13270,13850],[16,13850,14950],[17,14950,18155]]}}