{"name":"41:47","price":"قیامت کا علم اللہ ہی کی طرف لوٹایا جاتا ہے(1) اور جو جو پھل اپنے شگوفوں میں سے نکلتے ہیں اور جو ماده حمل سے ہوتی ہے اور جو بچے وه جنتی ہے سب کا علم اسے ہے(2) اور جس دن اللہ تعالیٰ ان (مشرکوں) کو بلا کر دریافت فرمائے گا میرے شریک کہاں ہیں، وه جواب دیں گے کہ ہم نے تو تجھے کہہ سنایا کہ ہم میں سے تو کوئی اس کا گواه نہیں.(3)","arabic":"۞ إِلَيۡهِ يُرَدُّ عِلۡمُ ٱلسَّاعَةِۚ وَمَا تَخۡرُجُ مِن ثَمَرَٰتٖ مِّنۡ أَكۡمَامِهَا وَمَا تَحۡمِلُ مِنۡ أُنثَىٰ وَلَا تَضَعُ إِلَّا بِعِلۡمِهِۦۚ وَيَوۡمَ يُنَادِيهِمۡ أَيۡنَ شُرَكَآءِي قَالُوٓاْ ءَاذَنَّٰكَ مَا مِنَّا مِن شَهِيدٖ","category":["41 (Fussilat)","Fussilat","Surah Fussilat","Chapter Fussilat","Surah 41","Chapter 41","Explained in Detail","فُصِّلَت"],"ayahNumber":4265,"juzNumber":25,"footnotes":"(1) یعنی اللہ کے سوا اس کے وقوع کا کسی کو علم نہیں۔ اسی لیے جب حضرت جبرائیل (عليه السلام) نےنبی کریم (صلى الله عليه وسلم) سے قیامت کے واقع ہونے کے بارے میں پوچھا تھا تو آپ (صلى الله عليه وسلم) نے فرمایا تھا «مَا الْمَسْئُولُ عَنْهَا بِأَعْلَمَ مِنَ السَّائِلِ»، (اس کی بابت مجھے بھی اتنا ہی علم ہے جتنا تجھے ہے، میں تجھ سے زیادہ نہیں جانتا۔ دوسرے مقامات پر اللہ تعالیٰ نے فرمایا: «إِلَى رَبِّكَ مُنْتَهَاهَا» (النازعات: 44) «لا يُجَلِّيهَا لِوَقْتِهَا إِلا هُوَ» (الأعراف: 187)۔\n(2) یہ اللہ کے علم کامل و محیط کا بیان ہے اور اس کی اس صفت علم میں کوئی اس کا شریک نہیں ہے۔ یعنی اس طرح کا علم کامل کسی کو حاصل نہیں۔ حتیٰ کہ انبیا علیہم السلام کو بھی نہیں۔ انہیں بھی اتنا ہی علم ہوتا ہے جتنا اللہ تعالیٰ انہیں وحی کے ذریعے سے بتلا دیتا ہے۔ اور اس علم و حی کا تعلق بھی منصب نبوت اور اس کے تقاضوں کی ادائیگی سے متعلق ہی ہوتا ہے نہ کہ دیگر فنون ومعاملات سے متعلق۔ اس لیےکسی بھی نبی اور رسول کو، چاہے وہ کتنی ہی عظمت شان کا حامل ہو، عَالِمُ مَا كَانَ وَمَا يَكُون ُ کہنا جائز نہیں۔ کیونکہ یہ صرف ایک اللہ کی شان اور اس کی صفت ہے۔ جس میں کسی اور کو شریک ماننا شرک ہوگا۔\n(3) یعنی آج ہم میں سے کوئی شخص یہ ماننے کے لیے تیار نہیں کہ تیرا کوئی شریک ہے؟","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"ilayhi yuraddu ʿil'mu al-sāʿati wamā takhruju min thamarātin min akmāmihā wamā taḥmilu min unthā walā taḍaʿu illā biʿil'mihi wayawma yunādīhim ayna shurakāī qālū ādhannāka mā minnā min shahīdin ","translations":["To Him","is referred","(the) knowledge","(of) the Hour","And not","comes out","any","fruits","from","their coverings","and not","bears","any","female","and not","gives birth","except","with His knowledge","And (the) Day","He will call them","Where (are)","My partners","They will say","We announce (to) You","not","among us","any","witness","(47)"],"transliterationArr":["ilayhi","yuraddu","ʿil'mu","al-sāʿati","wamā","takhruju","min","thamarātin","min","akmāmihā","wamā","taḥmilu","min","unthā","walā","taḍaʿu","illā","biʿil'mihi","wayawma","yunādīhim","ayna","shurakāī","qālū","ādhannāka","mā","minnā","min","shahīdin",null],"verseTiming":[[1,0,880],[2,880,1660],[3,1660,2290],[4,2290,3860],[5,3860,4450],[6,4450,5340],[7,5340,5760],[8,5760,7520],[9,7520,8480],[10,8480,9930],[11,9930,10550],[12,10550,11410],[13,11410,12980],[14,12980,13590],[15,13590,14220],[16,14220,14890],[17,14890,15680],[18,15680,16990],[19,16990,17910],[20,17910,19390],[21,19390,19960],[22,19960,22720],[23,22720,25170],[24,25170,27430],[25,27430,27830],[26,27830,29280],[27,29280,30570],[28,30570,33835]]}}