{"name":"41:53","price":"عنقریب ہم انہیں اپنی نشانیاں آفاق عالم میں بھی دکھائیں گے اور خود ان کی اپنی ذات میں بھی یہاں تک کہ ان پر کھل جائے کہ حق یہی ہے(1) ، کیا آپ کے رب کا ہر چیز سے واقف و آگاه ہونا کافی نہیں.(2)","arabic":"سَنُرِيهِمۡ ءَايَٰتِنَا فِي ٱلۡأٓفَاقِ وَفِيٓ أَنفُسِهِمۡ حَتَّىٰ يَتَبَيَّنَ لَهُمۡ أَنَّهُ ٱلۡحَقُّۗ أَوَلَمۡ يَكۡفِ بِرَبِّكَ أَنَّهُۥ عَلَىٰ كُلِّ شَيۡءٖ شَهِيدٌ","category":["41 (Fussilat)","Fussilat","Surah Fussilat","Chapter Fussilat","Surah 41","Chapter 41","Explained in Detail","فُصِّلَت"],"ayahNumber":4271,"juzNumber":25,"footnotes":"(1) جن سے قرآن کی صداقت اور اس کا من جانب اللہ ہونا واضح ہوجائے گا۔ یعنی أَنَّهُ میں ضمیر کا مرجع قرآن ہے۔ بعض نے اس کا مرجع اسلام یا رسول اللہ (صلى الله عليه وسلم) کو بتلایا ہے۔ مآل سب کا ایک ہی ہے۔ آفَاقٌ ، أُفُقٌ کی جمع ہے۔ کنارہ، مطلب ہے کہ ہم اپنی نشانیاں باہر کناروں میں بھی دکھائیں گے اور خود انسان کے اپنے نفسوں کے اندر بھی۔ چنانچہ آسمان و زمین کے کناروں میں بھی قدرت کی بڑی بڑی نشانیاں ہیں مثلاً سورج، چاند، ستارے، رات اور دن، ہوا اور بارش، گرج چمک، بجلی، کڑک، نباتات وجمادات، اشجار، پہاڑ، اور انہار وبحار وغیرہ۔ اور آیات انفس سے انسان کا وجود، جن اخلاط و مواد اور ہیئتوں پرمرکب ہے وہ مراد ہیں۔ جن کی تفصیلات طب و حکمت کا دلچسپ موضوع ہے۔ بعض کہتے ہیں، آفاق سے مراد شرق وغرب کے وہ دور دراز کے علاقے ہیں۔ جن کی فتح کو اللہ نے مسلمانوں کے لیے آسان فرما دیا اور انفس سے مراد خود عرب کی سرزمین پر مسلمانوں کی پیش قدمی ہے، جیسے جنگ بدر اور فتح مکہ وغیرہ فتوحات میں مسلمانوں کو عزت وسرفرازی عطا کی گئی۔\n(2) استفہام اقراری ہے کہ اللہ تعالیٰ اپنے بندوں کے اقوال وافعال کے دیکھنے کے لیے کافی ہے، اور وہی اس بات کی گواہی دے رہا ہے کہ قرآن اللہ کا کلام ہے جو اس کے سچے رسول حضرت محمد (صلى الله عليه وسلم) پر نازل ہوا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"sanurīhim āyātinā fī al-āfāqi wafī anfusihim ḥattā yatabayyana lahum annahu al-ḥaqu awalam yakfi birabbika annahu ʿalā kulli shayin shahīdun ","translations":["Soon We will show them","Our Signs","in","the horizons","and in","themselves","until","becomes clear","to them","that it","(is) the truth","Is (it) not","sufficient","concerning your Lord","that He","(is) over","all","things","a Witness","(53)"],"transliterationArr":["sanurīhim","āyātinā","fī","al-āfāqi","wafī","anfusihim","ḥattā","yatabayyana","lahum","annahu","al-ḥaqu","awalam","yakfi","birabbika","annahu","ʿalā","kulli","shayin","shahīdun",null],"verseTiming":[[1,0,1410],[2,1410,3030],[3,3030,3270],[4,3270,4540],[5,4540,6430],[6,6430,8360],[7,8360,9280],[8,9280,10440],[9,10440,11200],[10,11200,12790],[11,12790,14240],[12,14240,14990],[13,14990,15840],[14,15840,16830],[15,16830,18780],[16,18780,19420],[17,19420,20020],[18,20020,21740],[19,21740,24995]]}}