{"name":"42:17","price":"اللہ تعالیٰ نے حق کے ساتھ کتاب نازل فرمائی ہے اور ترازو بھی (اتاری ہے)(1) اور آپ کو کیا خبر شاید قیامت قریب(2) ہی ہو.","arabic":"ٱللَّهُ ٱلَّذِيٓ أَنزَلَ ٱلۡكِتَٰبَ بِٱلۡحَقِّ وَٱلۡمِيزَانَۗ وَمَا يُدۡرِيكَ لَعَلَّ ٱلسَّاعَةَ قَرِيبٞ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura","Chapter Ash-Shura","Shura","Surah Shura","Chapter Shura","Ash Shura","Surah Ash Shura","Chapter Ash Shura","Surah 42","Chapter 42","The Consultation","الشُّورىٰ"],"ayahNumber":4289,"juzNumber":25,"footnotes":"(1) الکتاب سے مراد جنس ہے یعنی تمام پیغمبروں پر جتنی کتابیں بھی نازل ہوئیں، وہ سب حق اور سچی تھیں۔ یا بطور خاص قرآن مجید مراد ہے اور اس کی صداقت کو واضح کیا جا رہا ہے ۔میزان سے مراد عدل و انصاف ہے۔ عدل کو ترازو سے اس لئے تعبیر فرمایا کہ یہ برابری اور انصاف کا آلہ ہے۔ اس کے ذریعے سے ہی لوگوں کے درمیان برابری ممکن ہے۔اسی کے ہم معنی یہ آیات بھی ہیں«لَقَدْ أَرْسَلْنَا رُسُلَنَا بِالْبَيِّنَاتِ وَأَنْزَلْنَا مَعَهُمُ الْكِتَابَ وَالْمِيزَانَ لِيَقُومَ النَّاسُ بِالْقِسْطِ» (الحديد:25) ”یقینا ہم نے پیغمبروں کو کھلی دلیلیں دے کر بھجوایا اور ان کے ساتھ کتاب اور انصاف نازل فرمایا تاکہ لوگ عدل پر قائم رہیں“ ۔«وَالسَّمَاءَ رَفَعَهَا وَوَضَعَ الْمِيزَانَ، أَلا تَطْغَوْا فِي الْمِيزَانِ، وَأَقِيمُوا الْوَزْنَ بِالْقِسْطِ وَلا تُخْسِرُوا الْمِيزَانَ» (سورة الرحمن: 7-9) اسی نے آسمان کو بلند کیا اور اسی نے ترازو رکھی تاکہ تم تولنے میں کمی بیشی نہ کرو ،انصاف کے ساتھ وزن کو ٹھیک رکھو اور تول میں جمی نہ کرو\"۔ (2) قريب، مذکر اور مونث دونوں کی صفت کے لیے آجاتا ہے۔ خصوصاً جب کہ موصوف مونث غیرحقیقی ہو۔ إِنَّ رَحْمَةَ اللَّهِ قَرِيبٌ مِنَ الْمُحْسِنِينَ ۔ (فتح القدير)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"al-lahu alladhī anzala al-kitāba bil-ḥaqi wal-mīzāna wamā yud'rīka laʿalla al-sāʿata qarībun ","translations":["Allah","(is) the One Who","(has) sent down","the Book","in truth","and the Balance","And what","will make you know","Perhaps","the Hour","(is) near","(17)"],"transliterationArr":["al-lahu","alladhī","anzala","al-kitāba","bil-ḥaqi","wal-mīzāna","wamā","yud'rīka","laʿalla","al-sāʿata","qarībun",null],"verseTiming":[[1,0,1170],[2,1170,3580],[3,3580,5060],[4,5060,6190],[5,6190,7190],[6,7190,10450],[7,10450,11060],[8,11060,12140],[9,12140,12880],[10,12880,14010],[11,14010,16665]]}}