{"name":"42:20","price":"جس کا اراده آخرت کی کھیتی کا ہو ہم اسے اس کی کھیتی میں ترقی دیں گے(1) اور جو دنیا کی کھیتی کی طلب رکھتا ہو ہم اسے اس میں سے ہی کچھ دے دیں گے(2)، ایسے شخص کا آخرت میں کوئی حصہ نہیں.(3)","arabic":"مَن كَانَ يُرِيدُ حَرۡثَ ٱلۡأٓخِرَةِ نَزِدۡ لَهُۥ فِي حَرۡثِهِۦۖ وَمَن كَانَ يُرِيدُ حَرۡثَ ٱلدُّنۡيَا نُؤۡتِهِۦ مِنۡهَا وَمَا لَهُۥ فِي ٱلۡأٓخِرَةِ مِن نَّصِيبٍ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura","Chapter Ash-Shura","Shura","Surah Shura","Chapter Shura","Ash Shura","Surah Ash Shura","Chapter Ash Shura","Surah 42","Chapter 42","The Consultation","الشُّورىٰ"],"ayahNumber":4292,"juzNumber":25,"footnotes":"(1) حَرَثٌ کے معنی تخم ریزی کے ہیں۔ یہاں یہ بہ طریق استعارہ اعمال کے ثمرات وفوائد پر بولا گیا ہے۔ مطلب یہ ہے کہ جو شخص دنیا میں اپنے اعمال ومحنت کے ذریعے سے آخرت کے اجر وثواب کا طالب ہے تو اللہ تعالیٰ اس کی آخرت کی کھیتی میں اضافہ فرمائے گا کہ ایک ایک نیکی کا اجر دس گنا سے لے کر سات سو گنا بلکہ اس سے زیادہ تک بھی عطا فرمائے گا۔\n(2) یعنی طالب دنیا کو دنیا تو ملتی ہے لیکن اتنی نہیں جتنی وہ چاہتا ہے بلکہ اتنی ہی ملتی ہے جتنی اللہ کی مشیت اور تقدیر کے مطابق ہوتی ہے۔\n(3) یہ وہی مضمون ہے جو سورۂ بنی اسرائیل: 18 میں بھی بیان ہوا ہے۔ مطلب یہ ہے کہ دنیا تو اللہ تعالیٰ ہر ایک کو اتنی ضرور دیتا ہے جتنی اس نے لکھ دی ہے، کیونکہ وہ سب کی روزی کا ذمہ لئے ہوئے ہے، طالب دنیا کو بھی اور طالب آخرت کو بھی۔ تاہم جو طالب آخرت ہوگا یعنی آخرت کے لیے کسب و محنت کرے گا تو قیامت والے دن اللہ تعالیٰ اسے أَضْعَافًا مُضَاعَفَةً اجر وثواب عطا فرمائے گا، جب کہ کے لئے آخرت میں سوائے جہنم کے عذاب کے کچھ نہیں ہوگا ۔اب یہ انسان کو خود سوچ لینا چاہیئے کہ اس کا فائدہ طالب دنیا بننے میں ہے یا طالب آخرت بننے میں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"man kāna yurīdu ḥartha al-ākhirati nazid lahu fī ḥarthihi waman kāna yurīdu ḥartha al-dun'yā nu'tihi min'hā wamā lahu fī al-ākhirati min naṣībin ","translations":["Whoever","is","desiring","(the) harvest","(of) the Hereafter ","We increase","for him","in","his harvest","And whoever","is","desiring","(the) harvest","(of) the world","We give him","of it","but not","for him","in","the Hereafter","any","share","(20)"],"transliterationArr":["man","kāna","yurīdu","ḥartha","al-ākhirati","nazid","lahu","fī","ḥarthihi","waman","kāna","yurīdu","ḥartha","al-dun'yā","nu'tihi","min'hā","wamā","lahu","fī","al-ākhirati","min","naṣībin",null],"verseTiming":[[1,0,1489],[2,1489,2099],[3,2099,2979],[4,2979,3599],[5,3599,4899],[6,4899,5539],[7,5539,6099],[8,6099,6539],[9,6539,7939],[10,7939,8989],[11,8989,9939],[12,9939,10819],[13,10819,11439],[14,11439,12599],[15,12599,13649],[16,13649,14509],[17,14509,15189],[18,15189,15789],[19,15789,16049],[20,16049,17339],[21,17339,17619],[22,17619,21494]]}}