{"name":"42:3","price":"اللہ تعالیٰ جو زبردست ہے اور حکمت واﻻ ہے اسی طرح تیری طرف اور تجھ سے اگلوں کی طرف وحی بھیجتا رہا.(1)","arabic":"كَذَٰلِكَ يُوحِيٓ إِلَيۡكَ وَإِلَى ٱلَّذِينَ مِن قَبۡلِكَ ٱللَّهُ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura","Chapter Ash-Shura","Shura","Surah Shura","Chapter Shura","Ash Shura","Surah Ash Shura","Chapter Ash Shura","Surah 42","Chapter 42","The Consultation","الشُّورىٰ"],"ayahNumber":4275,"juzNumber":25,"footnotes":"(1) یعنی جس طرح یہ قرآن تیری طرف نازل کیا گیا ہے اسی طرح تجھ سے پہلے انبیا پر صحیفے اور کتابیں نازل کی گئیں۔ وحی، اللہ کا وہ کلام ہے جو فرشتے کے ذریعے سے اللہ تعالیٰ اپنے پیغمبروں کے پاس بھیجتا رہا ہے۔ ایک صحابی نے رسول اللہ (صلى الله عليه وسلم) سے وحی کی کیفیت پوچھی تو آپ نے فرمایا کہ کبھی تو یہ میرے پاس گھنٹی کی آواز کی مثل آتی ہے اور یہ مجھ پر سب سے سخت ہوتی ہے، جب یہ ختم ہوجاتی ہے تو مجھے یاد ہوچکی ہوتی ہے اور کبھی فرشتہ انسانی شکل میں آتا ہے اور مجھ سے کلام کرتا ہے اور وہ جو کہتا ہے میں یاد کرلیتا ہوں۔ حضرت عائشہ (رضی الله عنها) فرماتی ہیں، میں نے سخت سردی میں مشاہدہ کیا جب وحی کی کیفیت ختم ہوتی تو آپ صلی اللہ علیہ وسلم پسینے میں شرابور ہوتے اور آپ کی پیشانی سے پسینے کے قطرے گر رہے ہوتے۔ (صحیح بخاری، باب بدء الوحی)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"kadhālika yūḥī ilayka wa-ilā alladhīna min qablika al-lahu al-ʿazīzu al-ḥakīmu ","translations":["Thus","reveals","to you","and to","those","before you ","before you ","Allah","the All-Mighty","the All-Wise","(3)"],"transliterationArr":["kadhālika","yūḥī","ilayka","wa-ilā","alladhīna","min","qablika","al-lahu","al-ʿazīzu","al-ḥakīmu",null],"verseTiming":[[1,0,1170],[2,1170,3470],[3,3470,4290],[4,4290,4790],[5,4790,5740],[6,5740,6750],[7,6750,7640],[8,7640,8460],[9,8460,9520],[10,9520,11915]]}}