{"name":"42:38","price":"اور اپنے رب کے فرمان کو قبول کرتے ہیں(1) اور نماز کی پابندی کرتے ہیں(2) اور ان کا (ہر) کام آپس کے مشورے سے ہوتا ہے(3)، اور جو ہم نے انہیں دے رکھا ہے اس میں سے (ہمارے نام پر) دیتے ہیں.","arabic":"وَٱلَّذِينَ ٱسۡتَجَابُواْ لِرَبِّهِمۡ وَأَقَامُواْ ٱلصَّلَوٰةَ وَأَمۡرُهُمۡ شُورَىٰ بَيۡنَهُمۡ وَمِمَّا رَزَقۡنَٰهُمۡ يُنفِقُونَ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura","Chapter Ash-Shura","Shura","Surah Shura","Chapter Shura","Ash Shura","Surah Ash Shura","Chapter Ash Shura","Surah 42","Chapter 42","The Consultation","الشُّورىٰ"],"ayahNumber":4310,"juzNumber":25,"footnotes":"(1) یعنی اس کے حکم کی اطاعت، اس کے رسول کا اتباع اور اس کے زواجر سے اجتناب کرتے ہیں۔\n(2) نماز کی پابندی اور اقامت کا بطور خاص ذکر کیا کہ عبادات میں اس کی اہمیت سب سے زیادہ ہے۔\n(3) شُورَى ٰ، کا لفظ ذِكْرَىٰ اور بُشْرَىٰ کی طرح باب مفاعلہ سے اسم مصدر ہے۔ یعنی اہل ایمان ہر اہم کام باہمی مشاورت سے کرتے ہیں، اپنی ہی رائے کو حرف آخر نہیں سمجھتے خود نبی (صلى الله عليه وسلم) کو بھی اللہ نے حکم دیا کہ مسلمانوں سے مشورہ کرو (آل عمران: 159) چنانچہ آپ جنگی معاملات اور دیگر اہم کاموں میں مشاورت کا اہتمام فرماتے تھے۔ جس سے مسلمانوں کی بھی حوصلہ افزائی ہوتی اور معاملے کے مختلف گوشے واضح ہوجاتے۔ حضرت عمر (رضي الله عنه) جب نیزے کے وار سے زخمی ہوگئے اور زندگی کی کوئی امید باقی نہ رہی تو امر خلافت میں مشاورت کے لیے چھ آدمی نامزد فرما دیے۔ عثمان، علی، طلحہ، زبیر، سعد اور عبدالرحمٰن بن عوف (رضي الله عنهم) ۔ انہوں نے باہم مشورہ کیا اور دیگر لوگوں سے بھی مشاورت کی اور اس کے بعد حضرت عثمان (رضي الله عنه) کو خلافت کے لیے مقرر فرمادیا۔ بعض لوگ مشاورت کے اس حکم اور تاکید سے ملوکیت کی تردید اور جمہوریت کا اثبات کرتے ہیں۔ حالانکہ مشاورت کا اہتمام ملوکیت میں بھی ہوتا ہے۔ بادشاہ کی بھی مجلس مشاورت ہوتی ہے، جس میں ہر اہم معاملے پر سوچ بچار ہوتا ہے اس لیے اس آیت سے ملوکیت کی نفی قطعاً نہیں ہوتی۔ علاوہ ازیں جمہوریت کو مشاورت کے ہم معنی سمجھنا یکسر غلط ہے۔ مشاورت ہر کہ و مہ سے نہیں ہوسکتی، نہ اس کی ضرورت ہی ہے۔ مشاورت کا مطلب ان لوگوں سے مشورہ کرنا ہے جو اس معاملے کی نزاکتوں اور ضرورتوں کو سمجھتے ہیں جس میں مشورہ درکار ہوتا ہے۔ جیسے بلڈنگ، پل وغیرہ بنانا ہو تو، کسی تانگہ بان، درزی یا رکشہ ڈرائیور سے نہیں، کسی انجینئر سے مشورہ کیا جائے گا، کسی مرض کے بارے میں مشورے کی ضرورت ہوگی تو طب و حکمت کے ماہرین کی طرف رجوع کیا جائے گا۔ جب کہ جمہوریت میں اس کے برعکس ہر بالغ شخص کو مشورے کا اہل سمجھا جاتا ہے، چاہے وہ کورا ان پڑھ، بےشعور اور امور سلطنت کی نزاکتوں سے یکسر بے خبر ہو۔ بنابریں مشاورت کے لفظ سے جمہوریت کا اثبات، تحکم اور دھاندلی کے سوا کچھ نہیں، اور جس طرح سوشلزم کے ساتھ اسلامی کا لفظ لگانے سے سوشلزم مشرف بہ اسلام نہیں ہوسکتا، اسی طرح جمہوریت میں اسلامی کی پیوند کاری سے مغربی جمہوریت پر خلافت کی قباراست نہیں آسکتی۔ مغرب کا یہ پودا اسلام کی سرزمین پر نہیں پنپ سکتا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-alladhīna is'tajābū lirabbihim wa-aqāmū al-ṣalata wa-amruhum shūrā baynahum wamimmā razaqnāhum yunfiqūna ","translations":["And those who","respond","to their Lord","and establish","prayer","and their affairs","(are conducted by) consultation","among them","and from what","We have provided them","they spend","(38)"],"transliterationArr":["wa-alladhīna","is'tajābū","lirabbihim","wa-aqāmū","al-ṣalata","wa-amruhum","shūrā","baynahum","wamimmā","razaqnāhum","yunfiqūna",null],"verseTiming":[[1,0,1240],[2,1240,2540],[3,2540,3820],[4,3820,4810],[5,4810,5980],[6,5980,7130],[7,7130,8030],[8,8030,9130],[9,9130,10770],[10,10770,12310],[11,12310,15985]]}}