{"name":"42:30","price":"تمہیں جو کچھ مصیبتیں پہنچتی ہیں وه تمہارے اپنے ہاتھوں کے کرتوت کابدلہ ہے، اور وه تو بہت سی باتوں سے درگزر فرما دیتا ہے.(1)","arabic":"وَمَآ أَصَٰبَكُم مِّن مُّصِيبَةٖ فَبِمَا كَسَبَتۡ أَيۡدِيكُمۡ وَيَعۡفُواْ عَن كَثِيرٖ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura","Chapter Ash-Shura","Shura","Surah Shura","Chapter Shura","Ash Shura","Surah Ash Shura","Chapter Ash Shura","Surah 42","Chapter 42","The Consultation","الشُّورىٰ"],"ayahNumber":4302,"juzNumber":25,"footnotes":"(1) اس کا خطاب اگر اہل ایمان سے ہو تو مطلب ہوگا کہ تمہارے بعض گناہوں کا کفارہ تو وہ مصائب بن جاتے ہیں جو تمہیں گناہوں کی پاداش میں پہنچتے ہیں اور کچھ گناہ وہ ہیں جو اللہ تعالیٰ یوں ہی معاف فرما دیتا ہے اور اللہ کی ذات بڑی کریم ہے، معاف کرنے کےبعد آخرت میں اس پر مواخذہ نہیں فرمائے گی۔\nحدیث میں بھی آتا ہے کہ مومن کو جو بھی تکلیف اور ہم وحزن پہنچتا ہے حتیٰ کہ اس کے پیر میں کانٹا بھی چبھتا ہے تو اللہ تعالیٰ اس کی وجہ سے اس کے گناہ معاف فرما دیتا ہے۔ (صحيح بخاري، كتاب المرضى ، باب ما جاء في كفارة المرض - مسلم ، كتاب البر، باب ثواب المؤمن فيما يصيبه من مرض) اگر خطاب عام ہو تو مطلب ہوگا کہ تمہیں جو مصائب دنیا پہنچتے ہیں، یہ تمہارے اپنے گناہوں کانتیجہ ہے حالانکہ اللہ تعالیٰ بہت سے گناہوں سے تو درگزر ہی فرما دیتا ہے یعنی یا تو ہمیشہ کے لیے معاف کردیتا ہے۔ یا ان پر فوری سزا نہیں دیتا۔ (اور عقوبت و تعزیر میں تاخیر، یہ بھی ایک گونہ معافی ہی ہے) جیسے دوسرے مقام پر فرمایا «وَلَوْ يُؤَاخِذُ اللَّهُ النَّاسَ بِمَا كَسَبُوا مَا تَرَكَ عَلَى ظَهْرِهَا مِنْ دَابَّةٍ» (فاطر: 45) ”اگر اللہ تعالیٰ لوگوں کے کرتوتوں پر فوراً مواخذہ فرما دے تو زمین پر کوئی چلنے والا ہی باقی نہ رہے“۔ اسی مفہوم کی آیت النحل 61 بھی ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wamā aṣābakum min muṣībatin fabimā kasabat aydīkum wayaʿfū ʿan kathīrin ","translations":["And whatever","befalls you","of","(the) misfortune","(is because) of what","have earned","your hands","But He pardons","[from]","much","(30)"],"transliterationArr":["wamā","aṣābakum","min","muṣībatin","fabimā","kasabat","aydīkum","wayaʿfū","ʿan","kathīrin",null],"verseTiming":[[1,0,1920],[2,1920,3460],[3,3460,4100],[4,4100,5890],[5,5890,7710],[6,7710,8690],[7,8690,9990],[8,9990,11130],[9,11130,12210],[10,12210,15105]]}}