{"name":"42:48","price":"اگر یہ منھ پھیرلیں تو ہم نے آپ کو ان پر نگہبان بنا کر نہیں بھیجا، آپ کے ذمہ تو صرف پیغام پہنچا دینا ہے(1) ، ہم جب کبھی انسان کو اپنی مہربانی کا مزه چکھاتے ہیں(2) تو وه اس پر اترا جاتا ہے(3) اور اگر انہیں ان کے اعمال کی وجہ سے کوئی مصیبت(4) پہنچتی ہے تو بےشک انسان بڑا ہی ناشکرا ہے.(5)","arabic":"فَإِنۡ أَعۡرَضُواْ فَمَآ أَرۡسَلۡنَٰكَ عَلَيۡهِمۡ حَفِيظًاۖ إِنۡ عَلَيۡكَ إِلَّا ٱلۡبَلَٰغُۗ وَإِنَّآ إِذَآ أَذَقۡنَا ٱلۡإِنسَٰنَ مِنَّا رَحۡمَةٗ فَرِحَ بِهَاۖ وَإِن تُصِبۡهُمۡ سَيِّئَةُۢ بِمَا قَدَّمَتۡ أَيۡدِيهِمۡ فَإِنَّ ٱلۡإِنسَٰنَ كَفُورٞ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura","Chapter Ash-Shura","Shura","Surah Shura","Chapter Shura","Ash Shura","Surah Ash Shura","Chapter Ash Shura","Surah 42","Chapter 42","The Consultation","الشُّورىٰ"],"ayahNumber":4320,"juzNumber":25,"footnotes":"(1) جیسے دوسرے مقام پر فرمایا «لَيْسَ عَلَيْكَ هُدَاهُمْ وَلَكِنَّ اللَّهَ يَهْدِي مَنْ يَشَاءُ» (البقرة: 272) اور «فَإِنَّمَا عَلَيْكَ الْبَلاغُ وَعَلَيْنَا الْحِسَابُ» (الرعد: 40) «فَذَكِّرْ إِنَّمَا أَنْتَ مُذَكِّرٌ ، لَسْتَ عَلَيْهِمْ بِمُسَيْطِرٍ» (الغاشية :21 -22) ان سب کا مطلب یہ ہے کہ آپ (صلى الله عليه وسلم) کی ذمہ داری صرف اور صرف یہ ہے کہ اللہ کا پیغام لوگوں تک پہنچادیں، مانیں نہ مانیں، آپ سے اس کی بازپرس نہیں ہوگی، کیونکہ ہدایت دینا آپ کے اختیار میں ہی نہیں ہے، یہ صرف اللہ کے اختیار میں ہے۔\n(2) یعنی وسائل رزق کی فراوانی، صحت وعافیت، اولاد کی کثرت، جاہ ومنصب وغیرہ۔\n(3) یعنی تکبر اور غرور کا اظہار کرتا ہے، ورنہ اللہ کی نعمتوں پر خوش ہونا یا اس کا اظہار ہونا، ناپسندیدہ امر نہیں، لیکن وہ تحدیث نعمت اور شکر کے طور پر ہو نہ کہ فخر وریا اور تکبر کے طور پر۔\n(4) مال کی کمی، بیماری، اولاد سے محرومی وغیرہ۔\n(5) یعنی فوراً نعمتوں کوبھی بھول جاتا ہے اور مُنْعِمٌ (نعمتیں دینے والے) کو بھی۔ یہ انسانوں کی غالب اکثریت کے اعتبار سے ہے جس میں ضعیف الایمان لوگ بھی شامل ہیں۔ لیکن اللہ کے نیک بندے اور کامل الایمان لوگوں کا حال ایسا نہیں ہوتا۔ وہ تکلیفوں پر صبر کرتے ہیں اور نعمتوں پر شکر۔ جیسا کہ رسول اللہ (صلى الله عليه وسلم) نے فرمایا ”إِنْ أَصَابَتْهُ سَرَّاءُ شَكَرَ فَكَانَ خَيْرًا لَهُ وَإِنْ أَصَابَتْهُ ضَرَّاءُ صَبَرَ فَكَانَ خَيْرًا لَهُ ، وَلَيْس ذَلِك لأَحَدٍ إٍلا لِلْمُؤْمِنِ“ (صحيح مسلم، كتاب الزهد ، باب أمر المؤمن أمره خير له)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"fa-in aʿraḍū famā arsalnāka ʿalayhim ḥafīẓan in ʿalayka illā al-balāghu wa-innā idhā adhaqnā al-insāna minnā raḥmatan fariḥa bihā wa-in tuṣib'hum sayyi-atun bimā qaddamat aydīhim fa-inna al-insāna kafūrun ","translations":["Then if","they turn away","then not","We have sent you","over them","(as) a guardian","Not","(is) on you","except","the conveyance","And indeed","when","We cause to taste","[the] man","from Us","Mercy","he rejoices","in it","But if","befalls them","evil","for what","have sent forth","their hands","then indeed","[the] man","(is) ungrateful","(48)"],"transliterationArr":["fa-in","aʿraḍū","famā","arsalnāka","ʿalayhim","ḥafīẓan","in","ʿalayka","illā","al-balāghu","wa-innā","idhā","adhaqnā","al-insāna","minnā","raḥmatan","fariḥa","bihā","wa-in","tuṣib'hum","sayyi-atun","bimā","qaddamat","aydīhim","fa-inna","al-insāna","kafūrun",null],"verseTiming":[[1,0,730],[2,730,1750],[3,1750,3700],[4,3700,5220],[5,5220,6270],[6,6270,7580],[7,7580,8430],[8,8430,9350],[9,9350,9930],[10,9930,12779],[11,12779,16269],[12,16269,18379],[13,18379,19199],[14,19199,21239],[15,21239,22559],[16,22559,24389],[17,24389,25269],[18,25269,25969],[19,25969,27459],[20,27459,29019],[21,29019,31239],[22,31239,31799],[23,31799,32919],[24,32919,34199],[25,34199,35749],[26,35749,37899],[27,37899,40744]]}}