{"name":"42:47","price":"اپنے رب کا حکم مان لو اس سے پہلے کہ اللہ کی جانب سے وه دن آجائے جس کا ہٹ جانا ناممکن(1) ہے، تمہیں اس روز نہ تو کوئی پناه کی جگہ ملے گی نہ چھﭗ کر انجان بن جانے کی.(2)","arabic":"ٱسۡتَجِيبُواْ لِرَبِّكُم مِّن قَبۡلِ أَن يَأۡتِيَ يَوۡمٞ لَّا مَرَدَّ لَهُۥ مِنَ ٱللَّهِۚ مَا لَكُم مِّن مَّلۡجَإٖ يَوۡمَئِذٖ وَمَا لَكُم مِّن نَّكِيرٖ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura","Chapter Ash-Shura","Shura","Surah Shura","Chapter Shura","Ash Shura","Surah Ash Shura","Chapter Ash Shura","Surah 42","Chapter 42","The Consultation","الشُّورىٰ"],"ayahNumber":4319,"juzNumber":25,"footnotes":"(1) یعنی جس کو رد کرنے اور ٹالنے کی کوئی طاقت نہیں رکھے گا۔ .\n(2) یعنی تمہارے لیے کوئی ایسی جگہ نہیں ہوگی، کہ جس میں تم چھپ کر انجان بن جاؤ اور پہچانے نہ جاسکو یا نظر میں نہ آسکو جیسے فرمایا: «يَقُولُ الإِنْسَانُ يَوْمَئِذٍ أَيْنَ الْمَفَرُّ ، كَلا لا وَزَرَ، إِلَى رَبِّكَ يَوْمَئِذٍ الْمُسْتَقَرُّ» (القيامة: 10۔ 12) ”اس دن انسان کہے گا، کہیں بھاگنے کی جگہ ہے، ہرگز نہیں، کوئی راہ فرار نہیں ہوگی، اس دن تیرے رب کے پاس ہی ٹھکانا ہو گا“۔ یا نکیر بمعنی انکار ہے کہ تم اپنے گناہوں کا انکار نہ کرسکو گے کیوں کہ ایک تو وہ سب لکھے ہوئے ہوں گے۔ دوسرے خود انسان کے اعضا بھی گواہی دیں گے۔ یا جو عذاب تمہیں تمہارے گناہوں کی وجہ سے دیا جائے گا تم اس عذاب کا انکار نہیں کرسکو گے، کیوں کہ اعتراف گناہ کے بغیر تمہیں چارہ نہیں ہوگا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"is'tajībū lirabbikum min qabli an yatiya yawmun lā maradda lahu mina al-lahi mā lakum min malja-in yawma-idhin wamā lakum min nakīrin ","translations":["Respond","to your Lord","before","before","[that]","comes","a Day","(there is) no","averting","for it","from","Allah","Not","(is) for you","any","refuge","(on) that Day","and not","for you","any","denial","(47)"],"transliterationArr":["is'tajībū","lirabbikum","min","qabli","an","yatiya","yawmun","lā","maradda","lahu","mina","al-lahi","mā","lakum","min","malja-in","yawma-idhin","wamā","lakum","min","nakīrin",null],"verseTiming":[[1,0,1520],[2,1520,2930],[3,2930,5180],[4,5180,5800],[5,5800,6000],[6,6000,7080],[7,7080,8500],[8,8500,9140],[9,9140,10060],[10,10060,10720],[11,10720,10990],[12,10990,13680],[13,13680,14160],[14,14160,14740],[15,14740,15720],[16,15720,17740],[17,17740,19430],[18,19430,20720],[19,20720,21310],[20,21310,22450],[21,22450,26195]]}}