{"name":"42:52","price":"اور اسی طرح ہم نے آپ کی طرف اپنے حکم سے روح کو اتارا ہے(1) ، آپ اس سے پہلے یہ بھی نہیں جانتے تھے کہ کتاب اور ایمان کیا چیز ہے(2)؟ لیکن ہم نے اسے نور بنایا، اس کے ذریعہ سے اپنے بندوں میں سے جسے چاہتے ہیں، ہدایت دیتے ہیں(3)، بیشک آپ راه راست کی رہنمائی کر رہے ہیں.","arabic":"وَكَذَٰلِكَ أَوۡحَيۡنَآ إِلَيۡكَ رُوحٗا مِّنۡ أَمۡرِنَاۚ مَا كُنتَ تَدۡرِي مَا ٱلۡكِتَٰبُ وَلَا ٱلۡإِيمَٰنُ وَلَٰكِن جَعَلۡنَٰهُ نُورٗا نَّهۡدِي بِهِۦ مَن نَّشَآءُ مِنۡ عِبَادِنَاۚ وَإِنَّكَ لَتَهۡدِيٓ إِلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura","Chapter Ash-Shura","Shura","Surah Shura","Chapter Shura","Ash Shura","Surah Ash Shura","Chapter Ash Shura","Surah 42","Chapter 42","The Consultation","الشُّورىٰ"],"ayahNumber":4324,"juzNumber":25,"footnotes":"(1) رُوحٌ سے مراد قرآن ہے۔ یعنی جس طرح آپ سے پہلے اور رسولوں پر ہم وحی کرتے رہے، اسی طرح ہم نے آپ پر قرآن کی وحی کی ہے۔ قرآن کو روح سے اس لیے تعبیر کیا ہے کہ قرآن سے دلوں کو زندگی حاصل ہوتی ہے جیسے روح میں انسانی زندگی کا راز مضمر ہے۔\n(2) کتاب سے مراد قرآن ہے، یعنی نبوت سے پہلے قرآن کا بھی کوئی علم آپ کو نہیں تھا اور اسی طرح ایمان کی ان تفصیلات سے بھی بے خبر تھے جو شریعت میں مطلوب ہیں۔\n(3) یعنی قرآن کو نور بنایا، اس کے ذریعے سے اپنے بندوں میں سے ہم جسے چاہتے ہیں، ہدایت سے نواز دیتے ہیں۔ مطلب یہ ہے کہ قرآن سے ہدایت و رہنمائی انہی کو ملتی ہے جن میں ایمان کی طلب اور تڑپ ہوتی ہے وہ اسے طلب ہدایت کی نیت سے پڑھتے، سنتے اور غور وفکر کرتے ہیں، چنانچہ اللہ ان کی مدد فرماتا ہے اور ہدایت کا راستہ ان کے لیے ہموار کر دیتا ہے جس پر وہ چل پڑتے ہیں ورنہ جو اپنی آنکھوں کو ہی بند کرلیں، کانوں میں ڈاٹ لگالیں اور عقل و فہم کو ہی بروئے کار نہ لائیں تو انہیں ہدایت کیوں کر نصیب ہوسکتی ہے، جیسے فرمایا۔ «قُلْ هُوَ لِلَّذِينَ آمَنُوا هُدًى وَشِفَاءٌ وَالَّذِينَ لا يُؤْمِنُونَ فِي آذَانِهِمْ وَقْرٌ وَهُوَ عَلَيْهِمْ عَمًى أُولَئِكَ يُنَادَوْنَ مِنْ مَكَانٍ بَعِيدٍ» (سورۃ حمٰ السجدۃ: 44)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wakadhālika awḥaynā ilayka rūḥan min amrinā mā kunta tadrī mā al-kitābu walā al-īmānu walākin jaʿalnāhu nūran nahdī bihi man nashāu min ʿibādinā wa-innaka latahdī ilā ṣirāṭin mus'taqīmin ","translations":["And thus","We have revealed","to you","an inspiration","by","Our Command","Not","(did) you","know","what","the Book (is)","and not","the faith","But","We have made it","a light","We guide","with it","whom","We will","of","Our slaves","And indeed, you","surely guide","to","(the) Path","Straight","(52)"],"transliterationArr":["wakadhālika","awḥaynā","ilayka","rūḥan","min","amrinā","mā","kunta","tadrī","mā","al-kitābu","walā","al-īmānu","walākin","jaʿalnāhu","nūran","nahdī","bihi","man","nashāu","min","ʿibādinā","wa-innaka","latahdī","ilā","ṣirāṭin","mus'taqīmin",null],"verseTiming":[[1,0,1430],[2,1430,4160],[3,4160,4990],[4,4990,5660],[5,5660,7130],[6,7130,8310],[7,8310,9320],[8,9320,10780],[9,10780,11640],[10,11640,11800],[11,11800,12900],[12,12900,13330],[13,13330,14810],[14,14810,16450],[15,16450,17750],[16,17750,18440],[17,18440,20220],[18,20220,20870],[19,20870,21150],[20,21150,24060],[21,24060,24450],[22,24450,25920],[23,25920,28000],[24,28000,30580],[25,30580,31120],[26,31120,32160],[27,32160,36495]]}}