{"name":"42:50","price":"یا انہیں جمع کردیتا ہے(1) بیٹے بھی اور بیٹیاں بھی اور جسے چاہے بانجھ کر دیتا ہے، وه بڑے علم واﻻ اور کامل قدرت واﻻ ہے.","arabic":"أَوۡ يُزَوِّجُهُمۡ ذُكۡرَانٗا وَإِنَٰثٗاۖ وَيَجۡعَلُ مَن يَشَآءُ عَقِيمًاۚ إِنَّهُۥ عَلِيمٞ قَدِيرٞ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura","Chapter Ash-Shura","Shura","Surah Shura","Chapter Shura","Ash Shura","Surah Ash Shura","Chapter Ash Shura","Surah 42","Chapter 42","The Consultation","الشُّورىٰ"],"ayahNumber":4322,"juzNumber":25,"footnotes":"(1) یعنی جس کو چاہتا ہے، مذکر اور مونث دونوں دیتا ہے۔ اس مقام پر اللہ نے لوگوں کی چار قسمیں بیان فرمائی ہیں۔ ایک وہ جن کو صرف بیٹے دیئے۔ دوسرے، وہ جن کو صرف بیٹیاں، تیسرے وہ جن کو بیٹے، بیٹیاں دونوں اور چوتھے، وہ جن کو بیٹا نہ بیٹی۔ لوگوں کے درمیان یہ فرق و تفاوت اللہ کی قدرت کی نشانیوں میں سے ہے، اس تفاوت الٰہی کو دنیا کی کوئی طاقت بدلنے پر قادر نہیں ہے۔ یہ تقسیم اولاد کے اعتبار سے ہے۔ باپوں کے اعتبار سے بھی انسانوں کی چار قسمیں ہیں۔ 1۔ آدم (عليه السلام) کو صرف مٹی سے پیدا کیا، ان کا باپ ہے نہ ماں۔ 2۔ حضرت حوا کو آدم (عليه السلام) سے یعنی مرد سے پیدا کیا، ان کی ماں نہیں ہے۔ 3۔ حضرت عیسیٰ (عليه السلام) کو صرف عورت کے بطن سے پیدا کیا، ان کا باپ نہیں ہے۔ 4۔ اور باقی تمام انسانوں کو مرد اور عورت کے ملاپ سے۔ ان کے باپ بھی ہیں اور مائیں بھی۔ فَسُبْحَانَ اللهِ الْعَلِيمِ الْقَدِيرِ(ابن کثیر)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"aw yuzawwijuhum dhuk'rānan wa-ināthan wayajʿalu man yashāu ʿaqīman innahu ʿalīmun qadīrun ","translations":["Or","He grants them","males","and females","and He makes","whom","He wills","barren","Indeed, He","(is) All-Knower","All-Powerful","(50)"],"transliterationArr":["aw","yuzawwijuhum","dhuk'rānan","wa-ināthan","wayajʿalu","man","yashāu","ʿaqīman","innahu","ʿalīmun","qadīrun",null],"verseTiming":[[1,0,410],[2,410,2060],[3,2060,4250],[4,4250,6310],[5,6310,7350],[6,7350,7810],[7,7810,10760],[8,10760,12410],[9,12410,14120],[10,14120,16180],[11,16180,18755]]}}