{"name":"43:20","price":"اور کہتے ہیں اگر اللہ چاہتا تو ہم ان کی عبادت نہ کرتے۔ انہیں اس کی کچھ خبر نہیں(1) ، یہ تو صرف اٹکل پچو (جھوٹ باتیں) کہتے ہیں۔.","arabic":"وَقَالُواْ لَوۡ شَآءَ ٱلرَّحۡمَٰنُ مَا عَبَدۡنَٰهُمۗ مَّا لَهُم بِذَٰلِكَ مِنۡ عِلۡمٍۖ إِنۡ هُمۡ إِلَّا يَخۡرُصُونَ","category":["43 (Az-Zukhruf)","Az-Zukhruf","Surah Az-Zukhruf","Chapter Az-Zukhruf","Zukhruf","Surah Zukhruf","Chapter Zukhruf","Az Zukhruf","Surah Az Zukhruf","Chapter Az Zukhruf","Surah 43","Chapter 43","The Gold Adornments","الزُّخْرُف"],"ayahNumber":4345,"juzNumber":25,"footnotes":"(1) یعنی اپنے طور پر اللہ کی مشیت کا سہارا، یہ ان کی ایک بڑی دلیل ہے کیونکہ ظاہراً یہ بات صحیح ہے کہ اللہ کی مشیت کے بغیر کوئی کام نہیں ہوتا، نہ ہوسکتا ہے۔ لیکن یہ اس بات سے بے خبر ہیں کہ اس کی مشیت، اس کی رضا سے مختلف چیز ہے۔ ہر کام یقیناً اس کی مشیت ہی سے ہوتا ہے لیکن راضی وہ انہی کاموں سے ہوتا ہے جن کا اس نے حکم دیا ہے نہ کہ ہر اس کام سے جو انسان اللہ کی مشیت سے کرتا ہے، انسان چوری، بدکاری، ظلم اور بڑے بڑے گناہ کرتا ہے، اگر اللہ تعالیٰ چاہے تو کسی کو یہ گناہ کرنے کی قدرت ہی نہ دے فوراً اس کا ہاتھ پکڑ لے، اس کے قدموں کو روک دے اس کی نظر سلب کرلے۔ لیکن یہ جبر کی صورتیں ہیں جب کہ اس نے انسان کو ارادہ و اختیار کی آزادی دی ہے تاکہ اسے آزمایا جائے، اسی لیے اس نے دونوں قسم کے کاموں کی وضاحت کردی ہے، جن سے وہ راضی ہوتا ہے ان کی بھی اور جن سے ناراض ہوتا ہے، ان کی بھی۔ انسان دونوں قسم کے کاموں میں سے جو کام بھی کرے گا، اللہ اس کا ہاتھ نہیں پکڑے گا، لیکن اگر وہ کام جرم ومعصیت کا ہوگا تو یقیناً وہ اس سے ناراض ہوگا کہ اس نے اللہ کے دیئے ہوئے اختیار کا استعمال غلط کیا۔ تاہم یہ اختیار اللہ دنیا میں اس سے واپس نہیں لے گا، البتہ اس کی سزا قیامت والے دن دے گا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waqālū law shāa al-raḥmānu mā ʿabadnāhum mā lahum bidhālika min ʿil'min in hum illā yakhruṣūna ","translations":["And they say","If","had willed","the Most Gracious","we would not have worshipped them","we would not have worshipped them","Not","they have","about that","any","knowledge","Nothing","they (do)","but","lie","(20)"],"transliterationArr":["waqālū","law","shāa","al-raḥmānu","mā","ʿabadnāhum","mā","lahum","bidhālika","min","ʿil'min","in","hum","illā","yakhruṣūna",null],"verseTiming":[[1,0,1160],[2,1160,1490],[3,1490,3719],[4,3719,4999],[5,4999,5409],[6,5409,7349],[7,7349,7779],[8,7779,8989],[9,8989,9989],[10,9989,10389],[11,10389,11289],[12,11289,11669],[13,11669,12099],[14,12099,12929],[15,12929,16364]]}}