{"name":"43:32","price":"کیا آپ کے رب کی رحمت کو یہ تقسیم کرتے ہیں(1) ؟ ہم نے ہی ان کی زندگانیٴ دنیا کی روزی ان میں تقسیم کی ہے اور ایک کو دوسرے سے بلند کیا ہے تاکہ ایک دوسرے کو ماتحت کر لے(2) جسے یہ لوگ سمیٹتے پھرتے ہیں اس سے آپ کے رب کی رحمت بہت ہی بہتر ہے.(3)","arabic":"أَهُمۡ يَقۡسِمُونَ رَحۡمَتَ رَبِّكَۚ نَحۡنُ قَسَمۡنَا بَيۡنَهُم مَّعِيشَتَهُمۡ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۚ وَرَفَعۡنَا بَعۡضَهُمۡ فَوۡقَ بَعۡضٖ دَرَجَٰتٖ لِّيَتَّخِذَ بَعۡضُهُم بَعۡضٗا سُخۡرِيّٗاۗ وَرَحۡمَتُ رَبِّكَ خَيۡرٞ مِّمَّا يَجۡمَعُونَ","category":["43 (Az-Zukhruf)","Az-Zukhruf","Surah Az-Zukhruf","Chapter Az-Zukhruf","Zukhruf","Surah Zukhruf","Chapter Zukhruf","Az Zukhruf","Surah Az Zukhruf","Chapter Az Zukhruf","Surah 43","Chapter 43","The Gold Adornments","الزُّخْرُف"],"ayahNumber":4357,"juzNumber":25,"footnotes":"(1) رحمت، نعمت کے معنی میں ہے، اور یہاں سب سے بڑی نعمت، نبوت، مراد ہے۔ استفہام انکار کے لیے ہے۔ یعنی یہ کام ان کا نہیں ہے کہ رب کی نعمتیں بالخصوص نعمت نبوت یہ اپنی مرضی سے تقسیم کریں، بلکہ یہ صرف رب کا کام ہے کیونکہ وہی ہر بات کا علم اور ہر شخص کے حالات سے پوری واقفیت رکھتا ہے، وہی بہتر سمجھتا ہے کہ انسانوں میں سے نبوت کا تاج کس کے سر پر رکھنا ہے اور اپنی وحی ورسالت سے کس کو نوازنا ہے۔\n(2) یعنی مال ودولت، جاہ ومنصب اور عقل وفہم میں ہم نے یہ فرق وتفاوت اس لیے رکھا ہے تاکہ زیادہ مال والا، کم مال والے سے، اونچے منصب والا چھوٹے منصب داروں سے، اور عقل وفہم میں حظ وافر رکھنے والا، اپنے سے کم تر عقل وشعور رکھنے والے سے کام لے سکے۔ اللہ تعالیٰ کی اس حکمت بالغہ سے کائنات کا نظام بحسن وخوبی چل رہا ہے۔ ورنہ اگر سب مال میں، منصب میں، علم وفہم میں، عقل وشعور میں اور دیگر اسباب دنیا میں برابر ہوتے تو کوئی کسی کا کام کرنے کے لیے تیار نہ ہوتا، اسی طرح کم تر اور حقیر سمجھے جانے والے کام بھی کوئی نہ کرتا۔ یہ احتیاج انسانی ہی ہے جو اللہ تعالیٰ نے فرق وتفاوت کے اندر رکھ دی ہے جس کی وجہ سے ہر انسان دوسرے انسان بلکہ انسانوں کا محتاج ہے، تمام حاجات وضروریات انسانی، کوئی ایک شخص، چاہے وہ ارب پتی ہی کیوں نہ ہو، دیگر انسانوں کی مدد حاصل کیے بغیر خود فراہم کر ہی نہیں سکتا۔\n(3) اس رحمت سے مراد آخرت کی وہ نعمتیں ہیں جو اللہ نے اپنے نیک بندوں کے لیے تیار کر رکھی ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"ahum yaqsimūna raḥmata rabbika naḥnu qasamnā baynahum maʿīshatahum fī al-ḥayati al-dun'yā warafaʿnā baʿḍahum fawqa baʿḍin darajātin liyattakhidha baʿḍuhum baʿḍan sukh'riyyan waraḥmatu rabbika khayrun mimmā yajmaʿūna ","translations":["Do they","distribute","(the) Mercy","(of) your Lord","We","[We] distribute","among them","their livelihood","in","the life","(of) the world","and We raise","some of them","above","others","(in) degrees","so that may take","some of them","others","(for) service","But (the) Mercy","(of) your Lord","(is) better","than what","they accumulate","(32)"],"transliterationArr":["ahum","yaqsimūna","raḥmata","rabbika","naḥnu","qasamnā","baynahum","maʿīshatahum","fī","al-ḥayati","al-dun'yā","warafaʿnā","baʿḍahum","fawqa","baʿḍin","darajātin","liyattakhidha","baʿḍuhum","baʿḍan","sukh'riyyan","waraḥmatu","rabbika","khayrun","mimmā","yajmaʿūna",null],"verseTiming":[[1,0,630],[2,630,1930],[3,1930,2660],[4,2660,3570],[5,3570,4610],[6,4610,5620],[7,5620,6540],[8,6540,8540],[9,8540,8770],[10,8770,9780],[11,9780,10870],[12,10870,12770],[13,12770,13750],[14,13750,14430],[15,14430,15950],[16,15950,17170],[17,17170,18400],[18,18400,19890],[19,19890,21650],[20,21650,23160],[21,23160,24850],[22,24850,25640],[23,25640,26320],[24,26320,28860],[25,28860,32155]]}}