{"name":"43:44","price":"اور یقیناً یہ (خود) آپ کے لیے اور آپ(1) کی قوم کے لیے نصیحت ہے اور عنقریب تم لوگ پوچھے جاؤ گے.","arabic":"وَإِنَّهُۥ لَذِكۡرٞ لَّكَ وَلِقَوۡمِكَۖ وَسَوۡفَ تُسۡـَٔلُونَ","category":["43 (Az-Zukhruf)","Az-Zukhruf","Surah Az-Zukhruf","Chapter Az-Zukhruf","Zukhruf","Surah Zukhruf","Chapter Zukhruf","Az Zukhruf","Surah Az Zukhruf","Chapter Az Zukhruf","Surah 43","Chapter 43","The Gold Adornments","الزُّخْرُف"],"ayahNumber":4369,"juzNumber":25,"footnotes":"(1) اس تخصیص کا یہ مطلب نہیں کہ دوسروں کے لیے نصیحت نہیں۔ بلکہ اولین مخاطب چونکہ قریش تھے، اس لیے ان کا ذکر فرمایا، ورنہ قرآن تو پورے جہان کے لیے نصیحت ہے۔ وَمَا هُوَ إِلا ذِكْرٌ لِلْعَالَمِينَ (سورة القلم : 52) جیسے آپ کو حکم دیا گیا کہ وَأَنْذِرْ عَشِيرَتَكَ الأَقْرَبِينَ (الشعراء: 214) (اپنے قریبی رشتہ داروں کو ڈرائیے) اس کا مطلب یہ نہیں کہ اللہ کا پیغام صرف رشتے داروں کو ہی پہنچانا ہے۔ بلکہ مطلب ہے تبلیغ کی ابتدا اپنے ہی خاندان سے کریں بعض نے یہاں ذکر بمعنی شرف لیا ہے۔ یعنی یہ قرآن تیرے لیے اور تیری قوم کے لیے شرف وعزت کا باعث ہے کہ یہ ان کی زبان میں اترا، اس کو وہ سب سے زیادہ سمجھنے والے ہیں اور اس کے ذریعے سے وہ پوری دنیا پر فضل وبرتری پاسکتے ہیں، اس لیے ان کو چاہیئے کہ اس کو اپنائیں اور اس کے مقتضا پر سب سے زیادہ عمل کریں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-innahu ladhik'run laka waliqawmika wasawfa tus'alūna ","translations":["And indeed, it","(is) surely, a Reminder","for you","and your people","and soon","you will be questioned","(44)"],"transliterationArr":["wa-innahu","ladhik'run","laka","waliqawmika","wasawfa","tus'alūna",null],"verseTiming":[[1,0,1970],[2,1970,2910],[3,2910,3520],[4,3520,5270],[5,5270,6150],[6,6150,9175]]}}