{"name":"43:46","price":"اور ہم نے موسیٰ (علیہ السلام) کو اپنی نشانیاں دے کر فرعون اور اس کے امراء کے پاس بھیجا تو (موسیٰ علیہ السلام نے جاکر) کہا کہ میں تمام جہانوں کے رب کا رسول ہوں.(1)","arabic":"وَلَقَدۡ أَرۡسَلۡنَا مُوسَىٰ بِـَٔايَٰتِنَآ إِلَىٰ فِرۡعَوۡنَ وَمَلَإِيْهِۦ فَقَالَ إِنِّي رَسُولُ رَبِّ ٱلۡعَٰلَمِينَ","category":["43 (Az-Zukhruf)","Az-Zukhruf","Surah Az-Zukhruf","Chapter Az-Zukhruf","Zukhruf","Surah Zukhruf","Chapter Zukhruf","Az Zukhruf","Surah Az Zukhruf","Chapter Az Zukhruf","Surah 43","Chapter 43","The Gold Adornments","الزُّخْرُف"],"ayahNumber":4371,"juzNumber":25,"footnotes":"(1) قریش مکہ نے کہا تھا کہ اگر اللہ کسی کو نبی بناکر بھیجتا ہی تو مکے اور طائف کے کسی ایسے شخص کو بھیجتا جو صاحب مال وجاہ ہوتا۔ جیسے فرعون نے بھی حضرت موسیٰ (عليه السلام) کے مقابلے میں کہا تھا کہ میں موسیٰ سے بہتر ہوں (اور یہ مجھ سے کمتر ہے، یہ تو صاف بول بھی نہیں سکتا) جیسا کہ آگے آرہا ہے۔ غالباً اسی مشابہت احوال کی وجہ سے یہاں حضرت موسیٰ (عليه السلام) وفرعون کا قصہ دہرایا جارہا ہے۔ علاوہ ازیں اس میں حضرت نبی کریم (عليه السلام) کے لیے بھی تسلی کا پہلو ہے کہ حضرت موسیٰ (عليه السلام) کو بھی بہت سی آزمائشوں سے گزرنا پڑا، انہوں نے صبر اور عزم سے کام لیا، اسی طرح آپ بھی کفار مکہ کی ایذاؤں اور ناروا رویوں سے دل برداشتہ نہ ہوں، صبر اور حوصلے سے کام لیں۔ حضرت موسیٰ (عليه السلام) ہی کی طرح بالآخر فتح وکامرانی آپ ہی کی ہے اور یہ اہل مکہ فرعون ہی کی طرح ناکام ونامراد ہوں گے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walaqad arsalnā mūsā biāyātinā ilā fir'ʿawna wamala-ihi faqāla innī rasūlu rabbi al-ʿālamīna ","translations":["And certainly","We sent","Musa","with Our Signs","to","Firaun","and his chiefs","and he said","Indeed, I am","a Messenger","(of the) Lord","(of) the worlds","(46)"],"transliterationArr":["walaqad","arsalnā","mūsā","biāyātinā","ilā","fir'ʿawna","wamala-ihi","faqāla","innī","rasūlu","rabbi","al-ʿālamīna",null],"verseTiming":[[1,0,770],[2,770,1910],[3,1910,2610],[4,2610,4010],[5,4010,5940],[6,5940,6490],[7,6490,7500],[8,7500,8570],[9,8570,9400],[10,9400,10690],[11,10690,11640],[12,11640,12080],[13,12080,14995]]}}