{"name":"43:49","price":"اور انہوں نے کہا اے جادوگر(1) ! ہمارے لیے اپنے رب سے(2) اس کی دعا کر جس کا اس نے تجھ سے وعده کر رکھا ہے(3)، یقین مان کہ ہم راه پر لگ جائیں گے.(4)","arabic":"وَقَالُواْ يَٰٓأَيُّهَ ٱلسَّاحِرُ ٱدۡعُ لَنَا رَبَّكَ بِمَا عَهِدَ عِندَكَ إِنَّنَا لَمُهۡتَدُونَ","category":["43 (Az-Zukhruf)","Az-Zukhruf","Surah Az-Zukhruf","Chapter Az-Zukhruf","Zukhruf","Surah Zukhruf","Chapter Zukhruf","Az Zukhruf","Surah Az Zukhruf","Chapter Az Zukhruf","Surah 43","Chapter 43","The Gold Adornments","الزُّخْرُف"],"ayahNumber":4374,"juzNumber":25,"footnotes":"(1) کہتے ہیں اس زمانے میں جادو مذموم چیز نہیں تھی اور عالم فاضل شخص کو جادوگر کے لفظ سے ہی بطور تعظیم خطاب کیا جاتا تھا۔ علاوہ ازیں معجزات اور نشانیوں کے بارے میں بھی ان کا خیال تھا کہ یہ موسیٰ (عليه السلام) کے فن جادوگری کا کمال ہے۔ اس لیے انہوں نے موسیٰ کو جادوگر کے لفظ سے مخاطب کیا۔\n(2) (اپنے رب سے) کے الفاظ اپنی مشرکانہ ذہنیت کی وجہ سے کہے کیونکہ مشرکوں میں مختلف رب اور الٰہ ہوتے تھے، موسیٰ (صلى الله عليه وسلم) اپنے رب سے یہ کام کر والو ! (3) یعنی ہمارے ایمان لانے پر عذاب ٹالنے کا وعدہ۔\n(4) اگر یہ عذاب ٹل گیا تو ہم تجھے اللہ کا سچا رسول مان لیں گے اور تیرے ہی رب کی عبادت کریں گے۔ لیکن ہر دفعہ وہ اپنا یہ عہد توڑ دیتے، جیسا کہ اگلی آیت میں ہے اور سورۂ اعراف میں بھی گزرا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waqālū yāayyuha al-sāḥiru ud'ʿu lanā rabbaka bimā ʿahida ʿindaka innanā lamuh'tadūna ","translations":["And they said","O","[the] magician","Invoke","for us","your Lord","by what","He has made covenant","with you","Indeed, we","(will) surely be guided","(49)"],"transliterationArr":["waqālū","yāayyuha","al-sāḥiru","ud'ʿu","lanā","rabbaka","bimā","ʿahida","ʿindaka","innanā","lamuh'tadūna",null],"verseTiming":[[1,0,1090],[2,1090,3750],[3,3750,4780],[4,4780,5170],[5,5170,5690],[6,5690,6590],[7,6590,7160],[8,7160,7750],[9,7750,9070],[10,9070,10710],[11,10710,14045]]}}