{"name":"43:61","price":"اور یقیناً عیسیٰ (علیہ السلام) قیامت کی علامت ہے(1) پس تم (قیامت) کے بارے میں شک نہ کرو اور میری تابعداری کرو، یہی سیدھی راه ہے.","arabic":"وَإِنَّهُۥ لَعِلۡمٞ لِّلسَّاعَةِ فَلَا تَمۡتَرُنَّ بِهَا وَٱتَّبِعُونِۚ هَٰذَا صِرَٰطٞ مُّسۡتَقِيمٞ","category":["43 (Az-Zukhruf)","Az-Zukhruf","Surah Az-Zukhruf","Chapter Az-Zukhruf","Zukhruf","Surah Zukhruf","Chapter Zukhruf","Az Zukhruf","Surah Az Zukhruf","Chapter Az Zukhruf","Surah 43","Chapter 43","The Gold Adornments","الزُّخْرُف"],"ayahNumber":4386,"juzNumber":25,"footnotes":"(1) عِلْمٌ بمعنی علامت ہے۔ اکثر مفسرین کے نزدیک اس کا مطلب یہ ہے کہ قیامت کے قریب ان کا آسمان سے نزول ہوگا، جیسا کہ صحیح اور متواتر احادیث سے ثابت ہے۔ یہ نزول اس بات کی علامت ہوگا کہ اب قیامت قریب ہے اسی لیے بعض نے اسے عین اور لام کے زبر کے ساتھ (عَلَمٌ) پڑھا ہے، جس کے معنی ہی نشانی اور علامت کے ہیں۔ اور بعض کے نزدیک انہیں قیامت کی نشانی قرار دینا، ان کی معجزانہ ولادت کی بنیاد پر ہے۔ یعنی جس طرح اللہ نے ان کو بغیر باپ کے پیدا کیا۔ ان کی یہ پیدائش اس بات کی علامت ہے کہ اللہ تعالیٰ قیامت والے دن تمام انسانوں کو دوبارہ زندہ فرما دےگا، اس لیے قدرت الٰہی کو دیکھتے ہوئے وقوع قیامت میں کوئی شک کی گنجائش نہیں ہے۔ إِنَّهُ میں ضمیر کا مرجع حضرت عیسیٰ (عليه السلام) ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-innahu laʿil'mun lilssāʿati falā tamtarunna bihā wa-ittabiʿūni hādhā ṣirāṭun mus'taqīmun ","translations":["And indeed, it","surely (is) a knowledge","of the Hour","So (do) not","(be) doubtful","about it","and follow Me","This","(is the) Path","Straight","(61)"],"transliterationArr":["wa-innahu","laʿil'mun","lilssāʿati","falā","tamtarunna","bihā","wa-ittabiʿūni","hādhā","ṣirāṭun","mus'taqīmun",null],"verseTiming":[[1,0,1760],[2,1760,2690],[3,2690,4060],[4,4060,4650],[5,4650,6530],[6,6530,7180],[7,7180,11000],[8,11000,11750],[9,11750,12690],[10,12690,16685]]}}