{"name":"43:86","price":"جنہیں یہ لوگ اللہ کے سوا پکارتے ہیں وه شفاعت کرنے کا اختیار نہیں رکھتے(1) ، ہاں (مستحق شفاعت وه ہیں) جو حق بات کا اقرار کریں اور انہیں علم بھی ہو.(2)","arabic":"وَلَا يَمۡلِكُ ٱلَّذِينَ يَدۡعُونَ مِن دُونِهِ ٱلشَّفَٰعَةَ إِلَّا مَن شَهِدَ بِٱلۡحَقِّ وَهُمۡ يَعۡلَمُونَ","category":["43 (Az-Zukhruf)","Az-Zukhruf","Surah Az-Zukhruf","Chapter Az-Zukhruf","Zukhruf","Surah Zukhruf","Chapter Zukhruf","Az Zukhruf","Surah Az Zukhruf","Chapter Az Zukhruf","Surah 43","Chapter 43","The Gold Adornments","الزُّخْرُف"],"ayahNumber":4411,"juzNumber":25,"footnotes":"(1) یعنی دنیا میں جن بتوں کی یہ عبادت کرتے ہیں، یہ سمجھتے ہوئے کہ یہ اللہ کے ہاں ہماری سفارش کریں گے۔ ان معبودوں کو شفاعت کا قطعاً کوئی اختیار نہیں ہوگا۔\n(2) حق بات سے مراد کلمہ توحید لاالٰہ الااللہ ہے اور یہ اقرار بھی علم و بصیرت کی بنیاد پر ہو، محض رسمی اور تقلیدی نہ ہو۔ یعنی زبان سے کلمۂ توحید ادا کرنے والے کو پتہ ہو کہ اس میں صرف ایک اللہ کا اثبات اور دیگر تمام معبودوں کی نفی ہے، پھر اس کے مطابق اس کا عمل ہو۔ ایسے لوگوں کے حق میں اہل شفاعت کی شفاعت مفید ہوگی۔ یا مطلب ہے کہ شفاعت کرنے کا حق صرف ایسے لوگوں کو ملے گا جو حق کا اقرار کرنے والے ہوں گے، یعنی انبیا وصالحین اور فرشتے۔ نہ کہ معبود ان باطل کو، جنہیں مشرکین اپنا شفاعت کنندہ خیال کرتے ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walā yamliku alladhīna yadʿūna min dūnihi al-shafāʿata illā man shahida bil-ḥaqi wahum yaʿlamūna ","translations":["And not","have power","those whom","they invoke","besides Him","besides Him","(for) the intercession","except","who","testifies","to the truth","and they","know","(86)"],"transliterationArr":["walā","yamliku","alladhīna","yadʿūna","min","dūnihi","al-shafāʿata","illā","man","shahida","bil-ḥaqi","wahum","yaʿlamūna",null],"verseTiming":[[1,0,660],[2,660,1450],[3,1450,2490],[4,2490,3400],[5,3400,4500],[6,4500,5340],[7,5340,6650],[8,6650,7430],[9,7430,8350],[10,8350,9260],[11,9260,10230],[12,10230,10880],[13,10880,13735]]}}