{"name":"44:10","price":"آپ اس دن کے منتظر رہیں جب کہ آسمان ﻇاہر دھواں ﻻئے گا.(1)","arabic":"فَٱرۡتَقِبۡ يَوۡمَ تَأۡتِي ٱلسَّمَآءُ بِدُخَانٖ مُّبِينٖ","category":["44 (Ad-Dukhan)","Ad-Dukhan","Surah Ad-Dukhan","Chapter Ad-Dukhan","Dukhan","Surah Dukhan","Chapter Dukhan","Ad Dukhan","Surah Ad Dukhan","Chapter Ad Dukhan","Surah 44","Chapter 44","The Smoke","الدُّخَان"],"ayahNumber":4424,"juzNumber":25,"footnotes":"(1) یہ ان کفار کے لیے تہدید ہے کہ اچھا آپ اس دن کا انتظار فرمائیں جب کہ آسمان پر دھوئیں کا ظہور ہوگا۔ اس کے سبب نزول میں بتلایا گیا ہے کہ اہل مکہ کے معاندانہ رویئے سے تنگ آکر نبی (صلى الله عليه وسلم) نے ان کے لیے قحط سالی کی بددعا فرمائی، جس کے نتیجے میں ان پر قحط کا عذاب نازل کردیا گیا حتیٰ کہ وہ ہڈیاں، کھالیں، اور مردار وغیرہ تک کھانے پر مجبور ہوگئے، آسمان کی طرف دیکھتے تو بھوک اور کمزوری کی شدت کی وجہ سے انہیں دھواں سا نظر آتا۔ بالآخر تنگ آکر نبی (صلى الله عليه وسلم) کی خدمت میں حاضر ہوئے اور عذاب ٹلنے پر ایمان لانے کا وعدہ کیا، لیکن یہ کیفیت دور ہوتے ہی ان کا کفر وعناد پھر اسی طرح عود کر آیا۔ چنانچہ پھر جنگ بدر میں ان کی سخت گرفت کی گئی۔ (صحیح بخاری کتاب التفسیر) بعض کہتے ہیں کہ قرب قیامت کی دس بڑی بڑی علامات میں سے ایک علامت دھواں بھی ہے جس سے کافر زیادہ متاثر ہوں گے اور مومن بہت کم۔ آیت میں اسی دھوئیں کا ذکر ہے۔ اس تفسیر کی رو سے یہ علامت قیامت کے قریب ظاہر ہوگی جب کہ پہلی تفسیر کی رو سے یہ ظاہر ہوچکی۔ امام شوکانی فرماتے ہیں، دونوں باتیں اپنی اپنی جگہ صحیح ہیں، اس کی شان نزول کے اعتبار سے یہ واقعہ ظہور پذیر ہوچکا ہے جو صحیح سند سے ثابت ہے۔ تاہم علامات قیامت میں بھی اس کا ذکر صحیح احادیث میں آیا ہے، اس لیے وہ بھی اس کے منافی نہیں ہے، اس وقت بھی اس کا ظہور ہوگا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"fa-ir'taqib yawma tatī al-samāu bidukhānin mubīnin ","translations":["Then watch","(for the) Day","(when) will bring","the sky","smoke","visible","(10)"],"transliterationArr":["fa-ir'taqib","yawma","tatī","al-samāu","bidukhānin","mubīnin",null],"verseTiming":[[1,0,1110],[2,1110,1630],[3,1630,2250],[4,2250,5020],[5,5020,6160],[6,6160,9655]]}}