{"name":"44:3","price":"یقیناً ہم نے اسے بابرکت رات(1) میں اتارا ہے بیشک ہم ڈرانے والے ہیں.(2)","arabic":"إِنَّآ أَنزَلۡنَٰهُ فِي لَيۡلَةٖ مُّبَٰرَكَةٍۚ إِنَّا كُنَّا مُنذِرِينَ","category":["44 (Ad-Dukhan)","Ad-Dukhan","Surah Ad-Dukhan","Chapter Ad-Dukhan","Dukhan","Surah Dukhan","Chapter Dukhan","Ad Dukhan","Surah Ad Dukhan","Chapter Ad Dukhan","Surah 44","Chapter 44","The Smoke","الدُّخَان"],"ayahNumber":4417,"juzNumber":25,"footnotes":"(1) بابرکت رات «لَيْلَةٌ مُبَارَكَةٌ» سے مراد شب قدر «لَيْلَةُ الْقَدْرِ» ہے۔ جیسا کہ دوسرے مقام پر صراحت ہے «شَهْرُ رَمَضَانَ الَّذِي أُنْزِلَ فِيهِ الْقُرْآنُ» (البقرة: 185) ”رمضان کے مہینے میں قرآن نازل کیا گیا“ «إِنَّا أَنْزَلْنَاهُ فِي لَيْلَةِ الْقَدْرِ» (سورة القدر) ”ہم نے یہ قرآن شب قدر میں نازل فرمایا“۔ یہ شب قدر رمضان کے عشرۂ اخیر کی طاق راتوں میں سے ہی کوئی ایک رات ہوتی ہے۔ یہاں قدر کی اس رات کو بابرکت رات قرار دیا گیا ہے۔ اس کے بابرکت ہو نے میں کیا شبہ ہوسکتا ہے کہ ایک تو اس میں قرآن کا نزول ہوا۔ دوسرے، اس میں فرشتوں اور روح الامین کا نزول ہوتا ہے۔ تیسرے اس میں سارے سال میں ہونے والے واقعات کا فیصلہ کیا جاتا ہے، (جیسا کہ آگے آرہا ہے) چوتھے، اس رات کی عبادت ہزار مہینے (یعنی 83 سال 4 ماہ) کی عبادت سے بہتر ہے شب قدر یا لیلۂ مبارکہ میں قرآن کے نزول کا مطلب یہ ہے کہ اسی رات سے نبی (صلى الله عليه وسلم) پر قرآن مجید کا نزول شروع ہوا۔ یعنی پہلے پہل اسی رات آپ پر قرآن نازل ہوا۔ یا یہ مطلب ہے کہ لوح محفوظ سے اسی رات قرآن بیت العزت میں اتارا گیا جو آسمان دنیا پر ہے۔ پھر وہاں سے حسب ضرورت و مصلحت 23 سالوں تک مختلف اوقات میں نبی (صلى الله عليه وسلم) پر اترتا رہا۔ بعض لوگوں نے لیلۂ مبارکہ سے شعبان کی پندرھویں رات مراد لی ہے۔ لیکن یہ صحیح نہیں ہے، جب قرآن کی نص صریح سے قرآن کا نزول شب قدر میں ثابت ہے تو اس سے شب براءت مراد لینا کسی طرح بھی صحیح نہیں۔ علاوہ ازیں شب براء ت (شعبان کی پندرھویں رات) کی بابت جتنی بھی روایات آتی ہیں، جن میں اس کی فضیلت کا بیان ہے یا ان میں اسے فیصلے کی رات کہا گیا ہے، تو یہ سب روایات سنداً ضعیف ہیں۔ یہ قرآن کی نص صریح کا مقابلہ کس طرح کر سکتی ہیں؟\n(2) یعنی نزول قرآن کا مقصد لوگوں کو نفع وضرر شرعی سے آگاہ کرنا ہے تاکہ ان پر حجت قائم ہوجائے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"innā anzalnāhu fī laylatin mubārakatin innā kunnā mundhirīna ","translations":["Indeed, We","revealed it","in","a Night","Blessed","Indeed, We","[We] are","(ever) warning","(3)"],"transliterationArr":["innā","anzalnāhu","fī","laylatin","mubārakatin","innā","kunnā","mundhirīna",null],"verseTiming":[[1,0,3200],[2,3200,5400],[3,5400,5930],[4,5930,6860],[5,6860,9560],[6,9560,11190],[7,11190,13090],[8,13090,17035]]}}