{"name":"45:12","price":"اللہ ہی ہے جس نے تمہارے لیے دریا(1) کو تابع بنادیا تاکہ اس کے حکم سے اس میں کشتیاں(2) چلیں اور تم اس کا فضل تلاش کرو اور تاکہ تم شکر بجاﻻؤ.(3)","arabic":"۞ ٱللَّهُ ٱلَّذِي سَخَّرَ لَكُمُ ٱلۡبَحۡرَ لِتَجۡرِيَ ٱلۡفُلۡكُ فِيهِ بِأَمۡرِهِۦ وَلِتَبۡتَغُواْ مِن فَضۡلِهِۦ وَلَعَلَّكُمۡ تَشۡكُرُونَ","category":["45 (Al-Jathiyah)","Al-Jathiyah","Surah Al-Jathiyah","Chapter Al-Jathiyah","Jathiyah","Surah Jathiyah","Chapter Jathiyah","Al Jathiyah","Surah Al Jathiyah","Chapter Al Jathiyah","Surah 45","Chapter 45","The Crouching","الجاثية"],"ayahNumber":4485,"juzNumber":25,"footnotes":"(1) یعنی اس کو ایسا بنادیا کہ تم کشتیوں اور جہازوں کے ذریعے سے اس پر سفر کرسکو۔\n(2) یعنی سمندروں میں کشتیوں اور جہازوں کا چلنا، یہ تمہارا کمال اور ہنر نہیں یہ اللہ کا حکم اور اس کی مشیت ہے۔ ورنہ اگر وہ چاہتا تو سمندروں کی موجوں کو اتنا سرکش بنادیتا کہ کوئی کشتی اور جہاز ان کے سامنے ٹھہر ہی نہ سکتا۔ جیسا کہ کبھی کبھی وہ اپنی قدرت کے اظہار کے لیےایسا کرتا ہے۔ اگر مستقل طور پر موجوں کی طغیانیوں کا یہی عالم رہتا تو تم کبھی بھی سمندر میں سفر کرنے کے قابل نہ ہوتے۔\n(3) یعنی تجارت کے ذریعے سے، اور اس میں غوطہ زنی کرکے موتی اور دیگر اشیا نکال کر اور دریائی جانوروں (مچھلی وغیرہ) کا شکار کرکے۔\n(4) یہ سب کچھ اس لیے کیا کہ تم ان نعمتوں پر اللہ کا شکر کرو جو اس تسخیر بحر کی وجہ سے تمہیں حاصل ہوتی ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"al-lahu alladhī sakhara lakumu al-baḥra litajriya al-ful'ku fīhi bi-amrihi walitabtaghū min faḍlihi walaʿallakum tashkurūna ","translations":["Allah","(is) the One Who","subjected","to you","the sea","that may sail","the ships","therein","by His Command","and that you may seek","of","His Bounty","and that you may","give thanks","(12)"],"transliterationArr":["al-lahu","alladhī","sakhara","lakumu","al-baḥra","litajriya","al-ful'ku","fīhi","bi-amrihi","walitabtaghū","min","faḍlihi","walaʿallakum","tashkurūna",null],"verseTiming":[[1,0,1050],[2,1050,1830],[3,1830,2730],[4,2730,3140],[5,3140,4140],[6,4140,5070],[7,5070,5880],[8,5880,6540],[9,6540,7600],[10,7600,9180],[11,9180,10930],[12,10930,11320],[13,11320,13000],[14,13000,14390],[15,14390,17095]]}}