{"name":"45:5","price":"اور رات دن کے بدلنے میں اور جو کچھ روزی اللہ تعالیٰ آسمان سے نازل فرما کر زمین کو اس کی موت کے بعد زنده کر دیتا ہے(1) ، (اس میں) اور ہواؤں کے بدلنے میں بھی ان لوگوں کے لیے جو عقل رکھتے ہیں نشانیاں ہیں.(2)","arabic":"وَٱخۡتِلَٰفِ ٱلَّيۡلِ وَٱلنَّهَارِ وَمَآ أَنزَلَ ٱللَّهُ مِنَ ٱلسَّمَآءِ مِن رِّزۡقٖ فَأَحۡيَا بِهِ ٱلۡأَرۡضَ بَعۡدَ مَوۡتِهَا وَتَصۡرِيفِ ٱلرِّيَٰحِ ءَايَٰتٞ لِّقَوۡمٖ يَعۡقِلُونَ","category":["45 (Al-Jathiyah)","Al-Jathiyah","Surah Al-Jathiyah","Chapter Al-Jathiyah","Jathiyah","Surah Jathiyah","Chapter Jathiyah","Al Jathiyah","Surah Al Jathiyah","Chapter Al Jathiyah","Surah 45","Chapter 45","The Crouching","الجاثية"],"ayahNumber":4478,"juzNumber":25,"footnotes":"(1) آسمان وزمین، انسانی تخلیق، جانوروں کی پیدائش، رات دن کے آنے جانے اور آسمانی بارش کے ذریعے سے مردہ زمین میں زندگی کی لہر کا دوڑ جانا وغیرہ، آفاق وانفس میں بے شمار نشانیاں ہیں جو اللہ کی وحدانیت اور ربوبیت پر ڈال ہیں۔\n(2) یعنی کبھی ہوا کا رخ شمال وجنوب کو، کبھی پورب پچھم (مشرق ومغرب) کو ہوتا ہے، کبھی بحری ہوائیں اور کبھی بری ہوائیں، کبھی رات کو، کبھی دن کو، بعض ہوائیں بارش خیز، بعض نتیجہ خیز، بعض ہوائیں روح کی غذا اور بعض سب کچھ جھلسا دینے والی اور محض گردو غبار کا طوفان۔ ہواؤں کی اتنی قسمیں بھی دلالت کرتی ہیں کہ اس کائنات کا کوئی چلانے والا ہے اور وہ ایک ہی ہے۔ دو یا دو سے زائد نہیں۔ تمام اختیارات کا مالک وہی ایک ہے، ان میں کوئی اس کا شریک نہیں۔ سارا اور ہر قسم کا تصرف صرف وہی کرتا ہے، کسی اور کے پاس ادنیٰ سا تصرف کرنے کا بھی اختیار نہیں۔ اسی مفہوم کی آیت سورۂ بقرہ کی آیت نمبر 164 بھی ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-ikh'tilāfi al-layli wal-nahāri wamā anzala al-lahu mina al-samāi min riz'qin fa-aḥyā bihi al-arḍa baʿda mawtihā wataṣrīfi al-riyāḥi āyātun liqawmin yaʿqilūna ","translations":["And (in the) alternation","(of) the night","and the day","and what","Allah sends down","Allah sends down","from","the sky","of","(the) provision","and gives life","thereby","(to) the earth","after","its death","and (in) directing","(the) winds","(are) Signs","for a people","who reason","(5)"],"transliterationArr":["wa-ikh'tilāfi","al-layli","wal-nahāri","wamā","anzala","al-lahu","mina","al-samāi","min","riz'qin","fa-aḥyā","bihi","al-arḍa","baʿda","mawtihā","wataṣrīfi","al-riyāḥi","āyātun","liqawmin","yaʿqilūna",null],"verseTiming":[[1,0,1260],[2,1260,1950],[3,1950,3510],[4,3510,5550],[5,5550,6770],[6,6770,7630],[7,7630,7980],[8,7980,10510],[9,10510,10750],[10,10750,11690],[11,11690,13160],[12,13160,13620],[13,13620,14360],[14,14360,14960],[15,14960,15900],[16,15900,17180],[17,17180,18160],[18,18160,19190],[19,19190,21110],[20,21110,24115]]}}