{"name":"46:11","price":"اور کافروں نے ایمان داروں کی نسبت کہا کہ اگر یہ (دین) بہتر ہوتا تو یہ لوگ اس کی طرف ہم سے سبقت کرنے نہ پاتے، اور چونکہ انہوں نے قرآن سے ہدایت نہیں پائی پس یہ کہہ دیں گے کہ قدیمی جھوٹ ہے.(1)","arabic":"وَقَالَ ٱلَّذِينَ كَفَرُواْ لِلَّذِينَ ءَامَنُواْ لَوۡ كَانَ خَيۡرٗا مَّا سَبَقُونَآ إِلَيۡهِۚ وَإِذۡ لَمۡ يَهۡتَدُواْ بِهِۦ فَسَيَقُولُونَ هَٰذَآ إِفۡكٞ قَدِيمٞ","category":["46 (Al-Ahqaf)","Al-Ahqaf","Surah Al-Ahqaf","Chapter Al-Ahqaf","Ahqaf","Surah Ahqaf","Chapter Ahqaf","Al Ahqaf","Surah Al Ahqaf","Chapter Al Ahqaf","Surah 46","Chapter 46","The Dunes","الأحقاف"],"ayahNumber":4521,"juzNumber":26,"footnotes":"(1) کفار مکہ، حضرت بلال، عمار، صہیب اور خباب (رضي الله عنهم) جیسے مسلمانوں کو، جو غریب وقلاش قسم کے لوگ تھے، لیکن اسلام قبول کرنے سے انہیں سابقیت کا شرف حاصل ہوا، دیکھ کر کہتے کہ اگر اس دین میں بہترین ہوتی تو ہم جیسے ذی عزت وذی مرتبہ لوگ سب سے پہلے اسے قبول کرتے نہ کہ یہ لوگ پہلے ایمان لاتے۔ یعنی اپنے طور پر انہوں نے اپنی بابت یہ فرض کر لیا کہ اللہ کے ہاں ان کا بڑا مقام ہے، اس لئے اگر یہ دین بھی اللہ کی طرف سے ہوتا تو اللہ تعالیٰ ہمیں اس کے قبول کرنے میں پیچھے نہ چھوڑتا، اور جب ہم نے اسے نہیں اپنایا تو اس کا مطلب یہ ہے کہ یہ ایک پرانا جھوٹ ہے۔ یعنی قرآن کو انہوں نے پرانا جھوٹ قرار دیا ہے۔ جیسے وہ اسے أَسَاِطِيرُ الأوَّلِينَ بھی کہتے تھے، حالانکہ دنیوی مال ودولت میں ممتاز ہونا، عند اللہ مقبولیت کی دلیل نہیں۔ ”جیسے ان کو مغالطہٰ ہوا یا شیطان نے مغالطے میں ڈالا“ عند اللہ مقبولیت کے لئے تو ایمان واخلاص کی ضرورت ہے۔ اور اس دولت ایمان واخلاص سے وہ جس کو چاہتا ہے، نوازتا ہے، جیسے وہ مال ودولت آزمائش کے طور پر جس کو چاہتا ہے، دیتا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waqāla alladhīna kafarū lilladhīna āmanū law kāna khayran mā sabaqūnā ilayhi wa-idh lam yahtadū bihi fasayaqūlūna hādhā if'kun qadīmun ","translations":["And say","those who","disbelieve","of those who","believe","If","it had been","good","not","they (would) have preceded us","to it","And when","not","they (are) guided","by it","they say","This","(is) a lie","ancient","(11)"],"transliterationArr":["waqāla","alladhīna","kafarū","lilladhīna","āmanū","law","kāna","khayran","mā","sabaqūnā","ilayhi","wa-idh","lam","yahtadū","bihi","fasayaqūlūna","hādhā","if'kun","qadīmun",null],"verseTiming":[[1,0,910],[2,910,1970],[3,1970,2950],[4,2950,4250],[5,4250,5410],[6,5410,5810],[7,5810,6470],[8,6470,7230],[9,7230,8510],[10,8510,10210],[11,10210,14010],[12,14010,14650],[13,14650,15060],[14,15060,16160],[15,16160,16860],[16,16860,19210],[17,19210,21070],[18,21070,22820],[19,22820,25535]]}}