{"name":"46:15","price":"اور ہم نے انسان کو اپنے ماں باپ کے ساتھ حسن سلوک کرنے کا حکم دیا ہے، اس کی ماں نے اسے تکلیف جھیل کر پیٹ میں رکھا اور تکلیف برداشت کرکے اسے جنا(1) ۔ اس کے حمل کا اور اس کے دودھ چھڑانے کا زمانہ تیس مہینے کا ہے(2)۔ یہاں تک کہ جب وه پختگی اور چالیس سال کی عمر کو پہنچا(3) تو کہنے لگا اے میرے پروردگار! مجھے توفیق دے(4) کہ میں تیری اس نعمت کا شکر بجا ﻻؤں جو تو نے مجھ پر اور میرے ماں باپ پر انعام کی ہے اور یہ کہ میں ایسے نیک عمل کروں جن سے تو خوش ہو جائے اور تو میری اوﻻد بھی صالح بنا، میں تیری طرف رجوع کرتا ہوں اور میں مسلمانوں میں سے ہوں.","arabic":"وَوَصَّيۡنَا ٱلۡإِنسَٰنَ بِوَٰلِدَيۡهِ إِحۡسَٰنًاۖ حَمَلَتۡهُ أُمُّهُۥ كُرۡهٗا وَوَضَعَتۡهُ كُرۡهٗاۖ وَحَمۡلُهُۥ وَفِصَٰلُهُۥ ثَلَٰثُونَ شَهۡرًاۚ حَتَّىٰٓ إِذَا بَلَغَ أَشُدَّهُۥ وَبَلَغَ أَرۡبَعِينَ سَنَةٗ قَالَ رَبِّ أَوۡزِعۡنِيٓ أَنۡ أَشۡكُرَ نِعۡمَتَكَ ٱلَّتِيٓ أَنۡعَمۡتَ عَلَيَّ وَعَلَىٰ وَٰلِدَيَّ وَأَنۡ أَعۡمَلَ صَٰلِحٗا تَرۡضَىٰهُ وَأَصۡلِحۡ لِي فِي ذُرِّيَّتِيٓۖ إِنِّي تُبۡتُ إِلَيۡكَ وَإِنِّي مِنَ ٱلۡمُسۡلِمِينَ","category":["46 (Al-Ahqaf)","Al-Ahqaf","Surah Al-Ahqaf","Chapter Al-Ahqaf","Ahqaf","Surah Ahqaf","Chapter Ahqaf","Al Ahqaf","Surah Al Ahqaf","Chapter Al Ahqaf","Surah 46","Chapter 46","The Dunes","الأحقاف"],"ayahNumber":4525,"juzNumber":26,"footnotes":"(1) اس مشقت وتکلیف کا ذکر، والدین کے ساتھ حسن سلوک کے حکم میں مزید تاکید کے لئے ہے۔ جس سے یہ بھی معلوم ہوتا ہے کہ ماں، اس حکم احسان میں، باپ سے مقدم ہے، کیونکہ نوماہ تک مسلسل حمل کی تکلیف اور پھر زچگی (وضح حمل) کی تکلیف، صرف تنہا ماں ہی اٹھاتی ہے، باپ کی اس میں شرکت نہیں، اسی لئے حدیث میں بھی ماں کے ساتھ حسن سلوک کو اولیت دی گئی ہے اور باپ کا درجہ اس کے بعد بتلایا گیا ہے۔ ایک صحابی (رضي الله عنه) نے نبی (صلى الله عليه وسلم) سے پوچھا میرے حسن سلوک کا سب سے زیادہ مستحق کون ہے؟ آپ (صلى الله عليه وسلم) نے فرمایا تمہاری ماں، اس نے پھر یہی پوچھا، آپ (صلى الله عليه وسلم) نے یہی جواب دیا، تیسری مرتبہ بھی یہی جواب دیا۔ چوتھی مرتبہ پوچھنے پر آپ (صلى الله عليه وسلم) نے فرمایا، پھر تمہارا باپ (صحيح مسلم، كتاب البر والصلة، باب أول)۔\n(2) فِصَالٌ کے معنی، دودھ چھڑانا ہیں۔ اس سے بعض صحابہ (رضي الله عنهم) نے استدلال کیا ہے کہ کم از کم مدت حمل چھ مہینے یعنی چھ مہینے کے بعد اگر کسی عورت کے ہاں بچہ پیدا ہو جائے تو وہ بچہ حلال ہی کا ہوگا، حرام کا نہیں۔ اس لئے کہ قرآن نے مدت رضاعت دو سال (24 مہینے) بتلائی ہے (سورۂ لقمان: 14، سورۂ بقرۃ: 233) اس حساب سے مدت حمل صرف چھ مہینے ہی باقی رہ جاتی ہے۔\n(3) کمال قدرت (أَشُدَّهُ) کے زمانے سے مراد جوانی ہے، بعض نے اسے 18 سال سے تعبیر کیا ہے، حتیٰ کہ پھر بڑھتے بڑھتے چالیس سال کی عمر کو پہنچ گیا۔ یہ عمر قوائے عقلی کے مکمل بلوغ کی عمر ہے۔ اسی لئے مفسرین کی رائے ہے کہ ہر نبی کو چالیس سال کے بعد ہی نبوت سے سرفراز کیا گیا (فتح القدیر)۔\n(4) أَوْزِعْنِي بمعنی أَلْهِمْنِي ہے ، مجھے توفیق دے، اس سے استدلال کرتے ہوئے علما نے کہا ہے کہ اس عمر کے بعد انسان کو یہ دعا کثرت سے پڑھتے رہنا چاہئے۔ یعنی رَبِّ أَوْزِعْنِي سے مِنَ الْمُسْلِمِينَ تک۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wawaṣṣaynā al-insāna biwālidayhi iḥ'sānan ḥamalathu ummuhu kur'han wawaḍaʿathu kur'han waḥamluhu wafiṣāluhu thalāthūna shahran ḥattā idhā balagha ashuddahu wabalagha arbaʿīna sanatan qāla rabbi awziʿ'nī an ashkura niʿ'mataka allatī anʿamta ʿalayya waʿalā wālidayya wa-an aʿmala ṣāliḥan tarḍāhu wa-aṣliḥ lī fī dhurriyyatī innī tub'tu ilayka wa-innī mina al-mus'limīna ","translations":["And We have enjoined","(on) man","to his parents","kindness","Carried him","his mother","(with) hardship","and gave birth to him","(with) hardship","And (the) bearing of him","and (the) weaning of him","(is) thirty","month(s)","until","when","he reaches","his maturity","and reaches","forty","year(s)","he says","My Lord","grant me (the) power","that","I may be grateful","(for) Your favor","which","You have bestowed","upon me","and upon","my parents","and that","I do","righteous (deeds)","which please You","and make righteous","for me","among","my offspring","indeed","I turn","to You","and indeed, I am","of","those who submit","(15)"],"transliterationArr":["wawaṣṣaynā","al-insāna","biwālidayhi","iḥ'sānan","ḥamalathu","ummuhu","kur'han","wawaḍaʿathu","kur'han","waḥamluhu","wafiṣāluhu","thalāthūna","shahran","ḥattā","idhā","balagha","ashuddahu","wabalagha","arbaʿīna","sanatan","qāla","rabbi","awziʿ'nī","an","ashkura","niʿ'mataka","allatī","anʿamta","ʿalayya","waʿalā","wālidayya","wa-an","aʿmala","ṣāliḥan","tarḍāhu","wa-aṣliḥ","lī","fī","dhurriyyatī","innī","tub'tu","ilayka","wa-innī","mina","al-mus'limīna",null],"verseTiming":[[1,0,1330],[2,1330,3520],[3,3520,5130],[4,5130,6600],[5,6600,8260],[6,8260,10030],[7,10030,11110],[8,11110,13010],[9,13010,14130],[10,14130,16070],[11,16070,17580],[12,17580,18970],[13,18970,20780],[14,20780,23360],[15,23360,24040],[16,24040,24780],[17,24780,26150],[18,26150,27090],[19,27090,28320],[20,28320,30090],[21,30090,30820],[22,30820,31480],[23,31480,33460],[24,33460,34190],[25,34190,34820],[26,34820,38300],[27,38300,38740],[28,38740,39670],[29,39670,40780],[30,40780,41990],[31,41990,42130],[32,42130,43180],[33,43180,44210],[34,44210,45250],[35,45250,46120],[36,46120,47540],[37,47540,48160],[38,48160,49000],[39,49000,50890],[40,50890,52150],[41,52150,53180],[42,53180,53660],[43,53660,54150],[44,54150,55920],[45,55920,58350],[46,58350,59070],[47,59070,60010],[48,60010,62130],[49,62130,62510],[50,62510,65625]]}}