{"name":"46:10","price":"آپ کہہ دیجئے! اگر یہ (قرآن) اللہ ہی کی طرف سے ہو اور تم نے اسے نہ مانا ہو اور بنی اسرائیل کا ایک گواه اس جیسی کی گواہی بھی دے چکا ہو اور وه ایمان بھی ﻻچکا ہو اور تم نے سرکشی کی ہو(1) ، تو بیشک اللہ تعالیٰ ﻇالموں کو راه نہیں دکھاتا.","arabic":"قُلۡ أَرَءَيۡتُمۡ إِن كَانَ مِنۡ عِندِ ٱللَّهِ وَكَفَرۡتُم بِهِۦ وَشَهِدَ شَاهِدٞ مِّنۢ بَنِيٓ إِسۡرَٰٓءِيلَ عَلَىٰ مِثۡلِهِۦ فَـَٔامَنَ وَٱسۡتَكۡبَرۡتُمۡۚ إِنَّ ٱللَّهَ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلظَّٰلِمِينَ","category":["46 (Al-Ahqaf)","Al-Ahqaf","Surah Al-Ahqaf","Chapter Al-Ahqaf","Ahqaf","Surah Ahqaf","Chapter Ahqaf","Al Ahqaf","Surah Al Ahqaf","Chapter Al Ahqaf","Surah 46","Chapter 46","The Dunes","الأحقاف"],"ayahNumber":4520,"juzNumber":26,"footnotes":"(1) اس شاہد بنی اسرائیل سے کون مراد ہے؟ بعض کہتے ہیں کہ یہ بطور جنس کے ہے۔ بنی اسرائیل میں سے ہر ایمان لانے والا اس کا مصداق ہے۔ بعض کہتے ہیں کہ مکے میں رہنے والا کوئی بنی اسرائیلی مراد ہے، کیونکہ یہ سورت مکی ہے۔ بعض کے نزدیک اس سے مراد عبداللہ بن سلام ہیں اور وہ اس آیت کو مدنی قرار دیتے ہیں۔ صحیحین کی روایت سے بھی اس کی تائید ہوتی ہے (صحيح بخاري، مناقب الأنصار ، باب مناقب عبد الله بن سلام - مسلم ، فضائل الصحابة) اسی لئے امام شوکانی نے اسی رائے کو ترجیح دی ہے۔ عَلَى مِثْلِهِ(اسی جیسی کتاب کی گواہی) کا مطلب ہے تورات کی گواہی جو قرآن کے منزل من اللہ ہونے کو مستلزم ہے۔ کیونکہ قرآن بھی توحید ومعاد کے اثبات میں تورات ہی کی مثل ہے۔ مطلب یہ ہے کہ اہل کتاب کی گواہی اور ان کے ایمان لانے کے بعد اس کے منزل من اللہ ہونے میں کوئی شک نہیں رہ جاتا ہے۔ اس لئے اس کے بعد تمہارے انکار واستکبار کا بھی کوئی جواز نہیں ہے۔ تمہیں اپنے اس رویے کا انجام سوچ لینا چاہئے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qul ara-aytum in kāna min ʿindi al-lahi wakafartum bihi washahida shāhidun min banī is'rāīla ʿalā mith'lihi faāmana wa-is'takbartum inna al-laha lā yahdī al-qawma al-ẓālimīna ","translations":["Say","Do you see","if","it is","from Allah","from Allah","from Allah","and you disbelieve","in it","and testifies","a witness","from","(the) Children of Israel","(the) Children of Israel","to","(the) like thereof","then he believed","while you are arrogant","Indeed","Allah","(does) not","guide","the people","the wrongdoers","(10)"],"transliterationArr":["qul","ara-aytum","in","kāna","min","ʿindi","al-lahi","wakafartum","bihi","washahida","shāhidun","min","banī","is'rāīla","ʿalā","mith'lihi","faāmana","wa-is'takbartum","inna","al-laha","lā","yahdī","al-qawma","al-ẓālimīna",null],"verseTiming":[[1,0,530],[2,530,1920],[3,1920,2990],[4,2990,3730],[5,3730,4100],[6,4100,5460],[7,5460,6310],[8,6310,7770],[9,7770,8460],[10,8460,9020],[11,9020,9900],[12,9900,10830],[13,10830,12050],[14,12050,12960],[15,12960,14950],[16,14950,17930],[17,17930,18610],[18,18610,19650],[19,19650,20860],[20,20860,23220],[21,23220,24550],[22,24550,25470],[23,25470,25970],[24,25970,26690],[25,26690,27550],[26,27550,31565]]}}