{"name":"46:24","price":"پھر جب انہوں نے عذاب کو بصورت بادل دیکھا اپنی وادیوں کی طرف آتے ہوئے تو کہنے لگے، یہ ابر ہم پر برسنے واﻻ ہے(1) ، (نہیں) بلکہ دراصل یہ ابر وه (عذاب) ہے جس کی تم جلدی کر رہے تھے(2)، ہوا ہے جس میں دردناک عذاب ہے.(3)","arabic":"فَلَمَّا رَأَوۡهُ عَارِضٗا مُّسۡتَقۡبِلَ أَوۡدِيَتِهِمۡ قَالُواْ هَٰذَا عَارِضٞ مُّمۡطِرُنَاۚ بَلۡ هُوَ مَا ٱسۡتَعۡجَلۡتُم بِهِۦۖ رِيحٞ فِيهَا عَذَابٌ أَلِيمٞ","category":["46 (Al-Ahqaf)","Al-Ahqaf","Surah Al-Ahqaf","Chapter Al-Ahqaf","Ahqaf","Surah Ahqaf","Chapter Ahqaf","Al Ahqaf","Surah Al Ahqaf","Chapter Al Ahqaf","Surah 46","Chapter 46","The Dunes","الأحقاف"],"ayahNumber":4534,"juzNumber":26,"footnotes":"(1) عرصہ دراز سے ان کے ہاں بارش نہیں ہوئی تھی، امنڈتے بادل دیکھ کر خوش ہوئے کہ اب بارش ہوگی۔ بادل کو عارض اس لئے کہا ہے کہ بادل عرض آسمان پر ظاہر ہوتا ہے۔\n(2) یہ حضرت ہود (عليه السلام) نے انہیں کہا کہ یہ محض بادل نہیں ہے، جیسے تم سمجھ رہے ہو۔ بلکہ یہ وہ عذاب ہے۔ جسے تم جلد لانے کا مطالبہ کر رہے تھے۔\n(3) یعنی وہ ہوا ، جس سے اس قوم کی ہلاکت ہوئی، ان بادلوں سے ہی اٹھی اور نکلی اور اللہ کی مشیت سے ان کو اور ان کی ہر چیز کو تباہ کر گئی۔ اسی لئے حدیث میں آتا ہے، حضرت عائشہ (رضی الله عنها) نے رسول اللہ (صلى الله عليه وسلم) سےپوچھا کہ لوگ تو بادل دیکھ کر خوش ہوتے ہیں کہ بارش ہوگی، لیکن آپ (صلى الله عليه وسلم) کے چہرے پر اس کے برعکس تشویش کے آثار نظر آتے ہیں؟ آپ (صلى الله عليه وسلم) نےفرمایا : عائشہ (رضی الله عنها) اس بات کی کیا ضمانت ہے کہ اس بادل میں عذاب نہیں ہوگا، جب کہ ایک قوم ہوا کے عذاب سے ہی ہلاک کر دی گئی، اس قوم نے بھی بادل دیکھ کر کہا تھا یہ بادل ہےجو ہم پر بارش برسائے گا۔ (البخاري، تفسير سورة الأحقاف، مسلم، كتاب صلاة الاستسقاء باب التعوذ عند رؤية الريح والغيم والفرح بالمطر) ایک دوسری روایت میں ہے کہ جب باد تند چلتی تو آپ (صلى الله عليه وسلم) یہ دعا پڑھتے «اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا، وَخَيْرَ مَا فِيهَا، وَخَيْرَ مَا أُرْسِلَتْ بِهِ، وَأَعُوذُ بِكَ مِنْ شَرِّهَا، وَشَرِّ مَا أُرْسِلَتْ بِهِ» اور جب آسمان پر بادل گہرے ہو جاتے تو آپ (صلى الله عليه وسلم) کا رنگ متغیر ہو جاتا اور خوف کی سی ایک کیفیت آپ (صلى الله عليه وسلم) پر طاری ہو جاتی جس سے آپ (صلى الله عليه وسلم) بے چین رہتے، کبھی باہر نکلتے، کبھی اندر داخل ہوتے، کبھی آگے ہوتے اور کبھی پیچھے پھر بارش ہو جاتی تو آپ (صلى الله عليه وسلم) اطمینان کا سانس لیتے۔ (صحیح مسلم، باب مذکور)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"falammā ra-awhu ʿāriḍan mus'taqbila awdiyatihim qālū hādhā ʿāriḍun mum'ṭirunā bal huwa mā is'taʿjaltum bihi rīḥun fīhā ʿadhābun alīmun ","translations":["Then when","they saw it","(as) a cloud","approaching","their valleys","they said","This","(is) a cloud","bringing us rain","Nay","it","(is) what","you were asking it to be hastened","you were asking it to be hastened","a wind","in it","(is) a punishment","painful","(24)"],"transliterationArr":["falammā","ra-awhu","ʿāriḍan","mus'taqbila","awdiyatihim","qālū","hādhā","ʿāriḍun","mum'ṭirunā","bal","huwa","mā","is'taʿjaltum","bihi","rīḥun","fīhā","ʿadhābun","alīmun",null],"verseTiming":[[1,0,1760],[2,1760,2720],[3,2720,3750],[4,3750,6010],[5,6010,7570],[6,7570,8520],[7,8520,9460],[8,9460,10340],[9,10340,12890],[10,12890,13840],[11,13840,14230],[12,14230,14450],[13,14450,17260],[14,17260,17890],[15,17890,19530],[16,19530,20490],[17,20490,21630],[18,21630,24335]]}}