{"name":"46:20","price":"اور جس دن کافر جہنم کے سرے پر ﻻئے جائیں گے(1) (کہا جائے گا) تم نے اپنی نیکیاں دنیا کی زندگی میں ہی برباد کر دیں اور ان سے فائدے اٹھا چکے، پس آج تمہیں ذلت کے عذاب کی سزا دی جائے گی(2)، اس باعﺚ کہ تم زمین میں ناحق تکبر کیا کرتے تھے اور اس باعﺚ بھی کہ تم حکم عدولی کیا کرتے تھے.(3)","arabic":"وَيَوۡمَ يُعۡرَضُ ٱلَّذِينَ كَفَرُواْ عَلَى ٱلنَّارِ أَذۡهَبۡتُمۡ طَيِّبَٰتِكُمۡ فِي حَيَاتِكُمُ ٱلدُّنۡيَا وَٱسۡتَمۡتَعۡتُم بِهَا فَٱلۡيَوۡمَ تُجۡزَوۡنَ عَذَابَ ٱلۡهُونِ بِمَا كُنتُمۡ تَسۡتَكۡبِرُونَ فِي ٱلۡأَرۡضِ بِغَيۡرِ ٱلۡحَقِّ وَبِمَا كُنتُمۡ تَفۡسُقُونَ","category":["46 (Al-Ahqaf)","Al-Ahqaf","Surah Al-Ahqaf","Chapter Al-Ahqaf","Ahqaf","Surah Ahqaf","Chapter Ahqaf","Al Ahqaf","Surah Al Ahqaf","Chapter Al Ahqaf","Surah 46","Chapter 46","The Dunes","الأحقاف"],"ayahNumber":4530,"juzNumber":26,"footnotes":"(1) یعنی اس وقت کو یاد کرو، جب کافروں کی آنکھوں سے پردے ہٹا دیئے جائیں گے اور وہ جہنم کی آگ دیکھ رہے یا اس کے قریب ہوں گے۔ بعض نے يُعْرَضُونَ کے معنی يُعَذَّبُونَ کے کیے ہیں۔ اور بعض کہتے ہیں کلام میں قلب ہے۔ مطلب ہے جب آگ ان پر پیش کی جائے گی تُعْرَضُ النَّارُ عَلَيْهِمْ (فتح القدير)۔\n(2) طَيِّبَاتٌ سے مراد وہ نعمتیں ہیں جو انسان ذوق وشوق سے کھاتے پیتے اور استعمال کرتے اور لذت وفرحت محسوس کرتے ہیں۔ لیکن آخرت کی فکر کے ساتھ ان کا استعمال ہو تو بات اور ہے، جیسے مومن کرتا ہے۔ وہ اس کے ساتھ ساتھ احکام الٰہی کی اطاعت کرکے شکر الٰہی کا بھی اہتمام کرتا رہتا ہے۔ لیکن فکر آخرت سے بے نیازی کےساتھ ان کا استعمال انسان کو سرکش اور باغی بنا دیتا ہے جیسے کافر کرتا ہے اور یوں وہ اللہ کی ناشکری کرتا ہے۔ چنانچہ مومن کو تو اس کے شکر واطاعت کی وجہ سے یہ نعمتیں بلکہ اس سے بدر جہا بہتر نعمتیں آخرت میں پھر مل جائیں گی۔ جب کہ کافروں کو وہی کچھ کہا جائے گا جو یہاں آیت میں مذکور ہے۔ أَذْهَبْتُمْ طَيِّبَاتِكُمْ . . . . کا دوسرا ترجمہ ہے دنیا کی زندگی میں تم نے اپنے مزے اڑا لیے اور خوب فائدہ اٹھا لیا۔\n(3) ان کے عذاب کے دو سبب بیان فرمائے، ناحق تکبر، جس کی بنیاد پر انسان حق کا اتباع کرنے سے گریز کرتا ہے اور دوسرا فسق۔ بے خوفی کے ساتھ معاصی کا ارتکاب۔ یہ دونوں باتیں تمام کافروں میں مشترکہ ہوتی ہیں۔ اہل ایمان کو ان دونوں باتوں سے اپنا دامن بچانا چاہئے۔ ملحوظة۔ بعض صحابہ کرام (رضي الله عنهم) کےبارے میں آتا ہے کہ ان کے سامنے عمدہ وغیرہ آتی تو یہ آیت انہیں یاد آجاتی اور وہ اسے ڈر سےاسے ترک کر دیتے کہ کہیں آخرت میں ہمیں بھی یہ نہ کہہ دیا جائے کہ تم نے اپنے مزے دنیا میں لوٹ لیے۔ تو یہ ا ن کی وہ کیفیت ہے جو غایت ورع اور زہد وتقویٰ کی مظہر ہے، اس کا یہ مطلب نہیں ہے کہ اچھی نعمتوں کا استعمال وہ جائز نہیں سمجھتے تھے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wayawma yuʿ'raḍu alladhīna kafarū ʿalā al-nāri adhhabtum ṭayyibātikum fī ḥayātikumu al-dun'yā wa-is'tamtaʿtum bihā fal-yawma tuj'zawna ʿadhāba al-hūni bimā kuntum tastakbirūna fī al-arḍi bighayri al-ḥaqi wabimā kuntum tafsuqūna ","translations":["And (the) Day","will be exposed","those who","disbelieved","to","the Fire","You exhausted","your good things","in","your life","(of) the world","and you took your pleasures","therein","So today","you will be recompensed","(with) a punishment","humiliating","because","you were","arrogant","in","the earth","without","[the] right","and because","you were","defiantly disobedient","(20)"],"transliterationArr":["wayawma","yuʿ'raḍu","alladhīna","kafarū","ʿalā","al-nāri","adhhabtum","ṭayyibātikum","fī","ḥayātikumu","al-dun'yā","wa-is'tamtaʿtum","bihā","fal-yawma","tuj'zawna","ʿadhāba","al-hūni","bimā","kuntum","tastakbirūna","fī","al-arḍi","bighayri","al-ḥaqi","wabimā","kuntum","tafsuqūna",null],"verseTiming":[[1,0,1030],[2,1030,1950],[3,1950,3040],[4,3040,3960],[5,3960,4360],[6,4360,6040],[7,6040,7430],[8,7430,9700],[9,9700,11240],[10,11240,13060],[11,13060,13490],[12,13490,14820],[13,14820,16020],[14,16020,17820],[15,17820,19020],[16,19020,20120],[17,20120,21280],[18,21280,22170],[19,22170,25540],[20,25540,26660],[21,26660,27740],[22,27740,28620],[23,28620,29610],[24,29610,30190],[25,30190,31810],[26,31810,33510],[27,33510,33840],[28,33840,34730],[29,34730,35590],[30,35590,36450],[31,36450,37270],[32,37270,38950],[33,38950,42115]]}}