{"name":"46:31","price":"اے ہماری قوم! اللہ کے بلانے والے کا کہا مانو، اس پر ایمان ﻻؤ(1) ، تو اللہ تمہارے گناه بخش دے گا اور تمہیں المناک عذاب سے پناه دےگا.(2)","arabic":"يَٰقَوۡمَنَآ أَجِيبُواْ دَاعِيَ ٱللَّهِ وَءَامِنُواْ بِهِۦ يَغۡفِرۡ لَكُم مِّن ذُنُوبِكُمۡ وَيُجِرۡكُم مِّنۡ عَذَابٍ أَلِيمٖ","category":["46 (Al-Ahqaf)","Al-Ahqaf","Surah Al-Ahqaf","Chapter Al-Ahqaf","Ahqaf","Surah Ahqaf","Chapter Ahqaf","Al Ahqaf","Surah Al Ahqaf","Chapter Al Ahqaf","Surah 46","Chapter 46","The Dunes","الأحقاف"],"ayahNumber":4541,"juzNumber":26,"footnotes":"(1) یہ جنوں نے اپنی قوم کو نبی (صلى الله عليه وسلم) کی رسالت پر ایمان لانے کی دعوت دی۔ اس سے قبل قرآن کریم کے متعلق بتلایا کہ یہ تورات کے بعد ایک اور آسمانی کتاب ہے جو سچے دین اور صراط مستقیم کی طرف رہنمائی کرتی ہے۔\n(2) یہ ایمان لانے کے وہ فائدے بتلائے جو آخرت میں انہیں حاصل ہوں گے۔ مِنْ ذُنُوبِكُمْ میں مِنْ تبعیض کے لئے ہے یعنی بعض گناہ معاف فرما دے گا اور یہ وہ گناہ ہوں گے جن کا تعلق حقوق اللہ سے ہوگا۔ کیوں کہ حقوق العباد معاف نہیں ہوں گے۔ یہ آیت اس بات کی دلیل ہے کہ ثواب وعقاب اور اوامر ونواہی میں جنات کے لئے بھی وہی حکم ہے جو انسانوں کے لئے ہے۔ اس امر میں اہل علم کے درمیان اختلاف ہے کہ اللہ تعالیٰ نے جنات میں جنوں میں سے رسول بھیجے یا نہیں؟ ظاہر آیات قرآنیہ سے یہی معلوم ہوتا ہے کہ جنات میں کوئی رسول نہیں ہوا، تمام انبیاء ورسل علیہم السلام انسان ہی ہوئے ہیں:«وَمَا أَرْسَلْنَا مِنْ قَبْلِكَ إِلا رِجَالا نُوحِي إِلَيْهِمْ» (النحل: 43) «وَمَا أَرْسَلْنَا قَبْلَكَ مِنَ الْمُرْسَلِينَ إِلا إِنَّهُمْ لَيَأْكُلُونَ الطَّعَامَ وَيَمْشُونَ فِي الأَسْوَاقِ» (سورة الفرقان: 20) ان آیات قرآنیہ سے واضح ہے کہ جتنے بھی رسول ہوئے، وہ انسان تھے۔ اسی لئے رسول اللہ (صلى الله عليه وسلم) جس طرح انسانوں کے لئے رسول تھے اور ہیں، اسی طرح جنات کے رسول بھی آپ (صلى الله عليه وسلم) ہی ہیں اور آپ (صلى الله عليه وسلم) کے پیغام کو بھی جنات تک پہنچانے کا انتظام کیا گیا ہے جیسا کہ قرآن کریم کے اس مقام سے ظاہر ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāqawmanā ajībū dāʿiya al-lahi waāminū bihi yaghfir lakum min dhunūbikum wayujir'kum min ʿadhābin alīmin ","translations":["O our people","Respond","(to the) caller","(of) Allah","and believe","in him","He will forgive","for you","of","your sins","and will protect you","from","a punishment","painful","(31)"],"transliterationArr":["yāqawmanā","ajībū","dāʿiya","al-lahi","waāminū","bihi","yaghfir","lakum","min","dhunūbikum","wayujir'kum","min","ʿadhābin","alīmin",null],"verseTiming":[[1,0,3570],[2,3570,4590],[3,4590,5450],[4,5450,9070],[5,9070,10100],[6,10100,10950],[7,10950,11950],[8,11950,13280],[9,13280,14050],[10,14050,14850],[11,14850,15480],[12,15480,17230],[13,17230,19130],[14,19130,19940],[15,19940,20580],[16,20580,21670],[17,21670,22480],[18,22480,23730],[19,23730,24960],[20,24960,26390],[21,26390,27610],[22,27610,31105]]}}