{"name":"46:6","price":"اور جب لوگوں کو جمع کیا جائے گا تو یہ ان کے دشمن ہو جائیں گے اور ان کی پرستش سے صاف انکار کر جائیں گے.(1)","arabic":"وَإِذَا حُشِرَ ٱلنَّاسُ كَانُواْ لَهُمۡ أَعۡدَآءٗ وَكَانُواْ بِعِبَادَتِهِمۡ كَٰفِرِينَ","category":["46 (Al-Ahqaf)","Al-Ahqaf","Surah Al-Ahqaf","Chapter Al-Ahqaf","Ahqaf","Surah Ahqaf","Chapter Ahqaf","Al Ahqaf","Surah Al Ahqaf","Chapter Al Ahqaf","Surah 46","Chapter 46","The Dunes","الأحقاف"],"ayahNumber":4516,"juzNumber":26,"footnotes":"(1) یہ مضمون قرآن کریم میں متعدد مقامات پر بیان کیا گیا ہے۔ مثلاً سورۂ یونس: 29۔ سورۂ مریم: 81۔ 82۔ سورۂ عنکبوت: ،25 وغیرھا من الآیات۔ دنیا میں ان معبودوں کی دو قسمیں ہیں۔ ایک تو غیر ذی روح جمادات ونباتات اور مظاہر قدرت (سورج، آگ وغیرہ) ہیں، اللہ تعالیٰ ان کو زندگی اور قوت گویائی عطا فرمائے گا، اور یہ چیزیں بول کر بتلائیں گی کہ ہمیں قطعاً اس بات کا علم نہیں ہے کہ یہ ہماری عبادت کرتے اور ہمیں تیری خدائی میں شریک گردانتے تھے۔ بعض کہتے ہیں کہ زبان قال سے نہیں، زبان حال سے وہ اپنے جذبات کا اظہار کریں گی۔ واللہ اعلم۔ معبودوں کی دوسری قسم وہ ہے جو انبیا علیہم السلام، ملائکہ اور صالحین میں سے ہیں۔ جیسے عیسیٰ، حضرت عزیر علیہما السلام اور دیگر عباد اللہ الصالحین ہیں، یہ اللہ کی بارگاہ میں اسی طرح کا جواب دیں گے جیسے حضرت عیسیٰ (عليه السلام) کا جواب قرآن کریم میں منقول ہے۔ علاوہ ازیں شیطان بھی انکار کریں گے۔ جیسے قرآن میں ان کا قول نقل کیا گیا ہے۔ «تَبَرَّأْنَا إِلَيْكَ مَا كَانُوا إِيَّانَا يَعْبُدُونَ» (القصص: 63) ”ہم تیرے سامنے (اپنے عابدین سے) اظہار براء ت کرتے ہیں، یہ ہماری عبادت نہیں کرتے تھے“۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-idhā ḥushira al-nāsu kānū lahum aʿdāan wakānū biʿibādatihim kāfirīna ","translations":["And when","are gathered","the people","they will be","for them","enemies","and they will be","of their worship","deniers","(6)"],"transliterationArr":["wa-idhā","ḥushira","al-nāsu","kānū","lahum","aʿdāan","wakānū","biʿibādatihim","kāfirīna",null],"verseTiming":[[1,0,1010],[2,1010,1670],[3,1670,3280],[4,3280,4200],[5,4200,4900],[6,4900,8259],[7,8259,9309],[8,9309,11089],[9,11089,14424]]}}