{"name":"47:19","price":"سو (اے نبی!) آپ یقین کر لیں کہ اللہ کے سوا کوئی معبود نہیں(1) اور اپنے گناہوں کی بخشش مانگا کریں اور مومن مردوں اور مومن عورتوں کے حق میں بھی(2)، اللہ تم لوگوں کی آمد ورفت کی اور رہنے سہنے کی جگہ کو خوب جانتا ہے.(3)","arabic":"فَٱعۡلَمۡ أَنَّهُۥ لَآ إِلَٰهَ إِلَّا ٱللَّهُ وَٱسۡتَغۡفِرۡ لِذَنۢبِكَ وَلِلۡمُؤۡمِنِينَ وَٱلۡمُؤۡمِنَٰتِۗ وَٱللَّهُ يَعۡلَمُ مُتَقَلَّبَكُمۡ وَمَثۡوَىٰكُمۡ","category":["47 (Muhammad)","Muhammad","Surah Muhammad","Chapter Muhammad","Surah 47","Chapter 47","Muhammad","مُحَمَّد"],"ayahNumber":4564,"juzNumber":26,"footnotes":"(1) یعنی اس عقیدےپر ثابت اور قائم رہیں، کیونکہ یہی توحید اور اطاعت الٰہی، مدار خیر ہے اور اس سے انحراف یعنی شرک اور معصیت، مدار شر ہے۔\n(2) اس میں نبی (صلى الله عليه وسلم) کو استغفار کا حکم دیا گیا ہے، اپنے لئے بھی اور مومنین کے لئے بھی۔ استغفار کی بڑی اہمیت اور فضیلت ہے۔ احادیث میں بھی اس پر بڑا زور دیا گیا ہے۔ ایک حدیث میں نبی ﹲ نے فرمایا «يَا أَيُّهَا النَّاسُ! تُوبُوا إِلَى رَبِّكُمْ فَإِنِّي أَسْتَغْفِرُ اللهَ وَأَتُوبُ إِلَيْهِ فِي الْيَوْمِ أَكْثَرَ مِنْ سَبْعِينَ مَرَّةً»(صحيح بخاري، كتاب الدعوات ، باب استغفار النبي في اليوم والليلة) ”لوگو ! بارگاہ الٰہی میں توبہ واستغفار کیا کرو، میں بھی اللہ کے حضور روزانہ ستر مرتبہ سے زیادہ توبہ واستغفار کرتا ہوں“۔\n(3) یعنی دن کو تم جہاں پھرتے اورجو کچھ کرتے ہو اور رات کو جہاں آرام کرتے اور استقرار پکڑتے ہو، اللہ تعالیٰ جانتاہے۔ مطلب ہے شب وروز کی کوئی سرگرمی اللہ سے مخفی نہیں ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"fa-iʿ'lam annahu lā ilāha illā al-lahu wa-is'taghfir lidhanbika walil'mu'minīna wal-mu'mināti wal-lahu yaʿlamu mutaqallabakum wamathwākum ","translations":["So know","that [He] ","(there is) no","god","but","Allah","and ask forgiveness","for your sin","and for the believing men","and the believing women","And Allah","knows","your movement","and your resting places","(19)"],"transliterationArr":["fa-iʿ'lam","annahu","lā","ilāha","illā","al-lahu","wa-is'taghfir","lidhanbika","walil'mu'minīna","wal-mu'mināti","wal-lahu","yaʿlamu","mutaqallabakum","wamathwākum",null],"verseTiming":[[1,0,960],[2,960,2580],[3,2580,4920],[4,4920,5750],[5,5750,6400],[6,6400,7420],[7,7420,8580],[8,8580,10510],[9,10510,12270],[10,12270,13710],[11,13710,15440],[12,15440,17160],[13,17160,18120],[14,18120,20150],[15,20150,22045]]}}