{"name":"47:15","price":"اس جنت کی صفت جس کا پرہیزگاروں سے وعده کیا گیا ہے، یہ ہے کہ اس میں پانی کی نہریں ہیں جو بدبو کرنے واﻻ نہیں(1) ، اور دودھ کی نہریں ہیں جن کا مزه نہیں بدﻻ(2) اور شراب کی نہریں ہیں جن میں پینے والوں کے لئے بڑی لذت ہے(3) اور نہریں ہیں شہد کی جو بہت صاف ہیں(4) اور ان کے لئے وہاں ہر قسم کے میوے ہیں اور ان کے رب کی طرف سے مغفرت ہے، کیا یہ مثل اس کے ہیں جو ہمیشہ آگ میں رہنے واﻻ ہے؟ اور جنہیں گرم کھولتا ہوا پانی پلایا جائے گا جو ان کی آنتوں کو ٹکڑے ٹکڑے کر دے گا.(5)","arabic":"مَّثَلُ ٱلۡجَنَّةِ ٱلَّتِي وُعِدَ ٱلۡمُتَّقُونَۖ فِيهَآ أَنۡهَٰرٞ مِّن مَّآءٍ غَيۡرِ ءَاسِنٖ وَأَنۡهَٰرٞ مِّن لَّبَنٖ لَّمۡ يَتَغَيَّرۡ طَعۡمُهُۥ وَأَنۡهَٰرٞ مِّنۡ خَمۡرٖ لَّذَّةٖ لِّلشَّٰرِبِينَ وَأَنۡهَٰرٞ مِّنۡ عَسَلٖ مُّصَفّٗىۖ وَلَهُمۡ فِيهَا مِن كُلِّ ٱلثَّمَرَٰتِ وَمَغۡفِرَةٞ مِّن رَّبِّهِمۡۖ كَمَنۡ هُوَ خَٰلِدٞ فِي ٱلنَّارِ وَسُقُواْ مَآءً حَمِيمٗا فَقَطَّعَ أَمۡعَآءَهُمۡ","category":["47 (Muhammad)","Muhammad","Surah Muhammad","Chapter Muhammad","Surah 47","Chapter 47","Muhammad","مُحَمَّد"],"ayahNumber":4560,"juzNumber":26,"footnotes":"(1) آسِنٍ کے معنی، متغیر۔ یعنی بدل جانے والا، غیر آسن نہ بدلنے والا۔ یعنی دنیا میں تو پانی کسی ایک جگہ کچھ دیر پڑا رہے تو اس کا رنگ متغیر ہو جاتا ہے اور اس کی بو اور ذائقے میں تبدیلی آجاتی ہے جس سے وہ مضر صحت ہو جاتا ہے۔ جنت کے پانی کی یہ خوبی ہوگی کہ اس میں کوئی تغیر نہیں ہوگا۔ یعنی اس کی بو اور ذائقے میں کوئی تبدیلی نہیں آئے گی۔ جب پیو، تازہ، مفرح اور صحت افزا جب دنیا کا پانی خراب ہو سکتا ہے تو شریعت نے اسی لئے پانی کی بابت کہا ہے کہ یہ پانی اس وقت تک پاک ہے، جب تک اس کا رنگ یا بو نہ بدلے، کیونکہ رنگ یا بو متغیر ہونے کی صورت میں پانی ناپاک ہو جائے گا۔\n(2) جس طرح دنیا میں وہ دودھ بعض دفعہ خراب ہو جاتا ہے جو گایوں، بھینسوں اور بکریوں وغیرہ کے تھنوں سے نکلتا ہے۔ جنت کا دودھ چونکہ اس طرح جانوروں کے تھنوں سے نہیں نکلے گا، بلکہ اس کی نہریں ہوں گی، اس لئے، جس طرح وہ نہایت لذیذ ہوگا، خراب ہونے سے بھی محفوظ ہوگا۔\n(3) دنیا میں جو شراب ملتی ہے، وہ عام طور پر تلخ، بدمزہ اور بدبو دار ہوتی ہے۔ علاوہ ازیں پی کر انسان بالعموم حواس باختہ ہو جاتا ہے، اول فول بکتا ہے اور اپنے جسم تک کا ہوش اسے نہیں رہتا۔ جنت کی شراب دیکھنے میں حسین، ذائقے میں اعلیٰ اور نہایت خوشبودار ہوگی اور اسے پی کر کوئی انسان بہکے گا، نہ کوئی گرانی محسوس کرے گا۔ بلکہ ایسی لذت وفرحت محسوس کرے گا جس کا تصور اس دنیا میں ممکن نہیں جیسے دوسرے مقام پر فرمایا: «لا فِيهَا غَوْلٌ وَلا هُمْ عَنْهَا يُنْزَفُونَ» (سورة الصافات: 47) نہ اسے چکر آئے گا نہ عقل جائے گی۔ مزید دیکھئے (سورة الواقعة: 19)۔\n(4) یعنی شہد میں بالعموم جن چیزوں کی آمیزش کا امکان رہتا ہے، جس کا مشاہدہ دنیا میں عام ہے جنت میں ایسا کوئی اندیشہ نہیں ہوگا۔ بالکل صاف شفاف ہوگا، کیونکہ یہ دنیا کی طرح مکھیوں سے حاصل کردہ نہیں ہوگا، بلکہ اس کی بھی نہریں ہوں گی۔ اسی لئے حدیث میں آتا ہے۔ نبی ﹲ نے فرمایا۔ جب بھی تم سوال کرو تو جنت الفردوس کی دعا کرو، اس لئے کہ وہ جنت کا درمیانہ اور اعلیٰ درجہ ہے اور وہیں سے جنت کی نہریں پھوٹتی ہیں اور اس کے اوپر رحمان کا عرش ہے (صحيح بخاري ، كتاب الجهاد، باب درجات المجاهدين في سبيل الله)۔\n(5) یعنی جن کو جنت میں وہ اعلیٰ درجے نصیب ہوں گے جو مذکور ہوئے کیا وہ ایسے جہنمیوں کے برابر ہیں جن کا یہ حال ہوگا؟ ظاہر بات ہے ایسا نہیں ہوگا۔ بلکہ ایک درجات میں ہوگا اور دوسرا درکات (جہنم) میں۔ ایک نعمتوں میں داد طرب وعیش دے رہاہوگا، دوسرا عذاب جہنم کی سختیاں جھیل رہا ہوگا۔ ایک اللہ کا مہمان ہوگا جہاں انواع واقسام کی چیزیں اس کی تواضع اور اکرام کے لئے ہوں گی اور دوسرا اللہ کا قیدی، جہاں اس کوکھانے کے زقوم جیسا تلخ وکسیلا کھانا اور پینے کے لئے کھولتا ہوا پانی ملے گا۔\nببی تفاوت ره\nاز کجا است تابه کجا","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"mathalu al-janati allatī wuʿida al-mutaqūna fīhā anhārun min māin ghayri āsinin wa-anhārun min labanin lam yataghayyar ṭaʿmuhu wa-anhārun min khamrin ladhatin lilshāribīna wa-anhārun min ʿasalin muṣaffan walahum fīhā min kulli al-thamarāti wamaghfiratun min rabbihim kaman huwa khālidun fī al-nāri wasuqū māan ḥamīman faqaṭṭaʿa amʿāahum ","translations":["A parable","(of) Paradise","which","is promised","(to) the righteous","Therein","(are) rivers","of","water","not","polluted","and rivers","of","milk","not","changes","its taste","and rivers","of","wine","delicious","for (the) drinkers","and rivers","of","honey","purified","and for them","therein","of","all","fruits","and forgiveness","from","their Lord","like he who","like he who","(will) abide forever","in","the Fire","and they will be given to drink","water","boiling","so it cuts into pieces","their intestines","(15)"],"transliterationArr":["mathalu","al-janati","allatī","wuʿida","al-mutaqūna","fīhā","anhārun","min","māin","ghayri","āsinin","wa-anhārun","min","labanin","lam","yataghayyar","ṭaʿmuhu","wa-anhārun","min","khamrin","ladhatin","lilshāribīna","wa-anhārun","min","ʿasalin","muṣaffan","walahum","fīhā","min","kulli","al-thamarāti","wamaghfiratun","min","rabbihim","kaman","huwa","khālidun","fī","al-nāri","wasuqū","māan","ḥamīman","faqaṭṭaʿa","amʿāahum",null],"verseTiming":[[1,0,730],[2,730,2690],[3,2690,3560],[4,3560,4240],[5,4240,8000],[6,8000,8690],[7,8690,11000],[8,11000,11990],[9,11990,12970],[10,12970,16190],[11,16190,16840],[12,16840,17800],[13,17800,18870],[14,18870,20060],[15,20060,20940],[16,20940,21840],[17,21840,22440],[18,22440,23850],[19,23850,24970],[20,24970,28260],[21,28260,29560],[22,29560,31080],[23,31080,31740],[24,31740,32840],[25,32840,34690],[26,34690,36190],[27,36190,37220],[28,37220,37960],[29,37960,41050],[30,41050,41850],[31,41850,42840],[32,42840,43740],[33,43740,44450],[34,44450,45980],[35,45980,47420],[36,47420,48550],[37,48550,50450],[38,50450,50880],[39,50880,51490],[40,51490,53160],[41,53160,53410],[42,53410,55220],[43,55220,56110],[44,56110,58430],[45,58430,59720],[46,59720,61520],[47,61520,65095]]}}