{"name":"47:2","price":"اور جو لوگ ایمان ﻻئے اور اچھے کام کیے اور اس پر بھی ایمان ﻻئے جو محمد ﴿صلی اللہ علیہ وسلم﴾ پر اتاری گئی(1) ہے اور دراصل ان کے رب کی طرف سے سچا (دین) بھی وہی ہے، اللہ نے ان کے گناه دور کر دیئے(2) اور ان کے حال کی اصلاح کر دی.(3)","arabic":"وَٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ وَءَامَنُواْ بِمَا نُزِّلَ عَلَىٰ مُحَمَّدٖ وَهُوَ ٱلۡحَقُّ مِن رَّبِّهِمۡ كَفَّرَ عَنۡهُمۡ سَيِّـَٔاتِهِمۡ وَأَصۡلَحَ بَالَهُمۡ","category":["47 (Muhammad)","Muhammad","Surah Muhammad","Chapter Muhammad","Surah 47","Chapter 47","Muhammad","مُحَمَّد"],"ayahNumber":4547,"juzNumber":26,"footnotes":"(1) ایمان میں اگرچہ وحی محمدی یعنی قرآن پاک پر ایمان لانا بھی شامل ہے لیکن اس کی اہمیت اور شرف کو مزید واضح اور نمایاں کرنے کے لئے اس کا علیحدہ بھی ذکر فرما دیا۔\n(2) یعنی ایمان لانے سے قبل کی غلطیاں اور کوتاہیاں معاف فرما دیں۔ جیسا کہ نبی (صلى الله عليه وسلم) کا بھی فرمان ہے کہ (اسلام ماقبل کے سارے گناہوں کو مٹا دیتا ہے)۔ (صحيح الجامع الصغير لألباني)۔\n(3) بَالَهُمْ : کے معنی أَمْرَهُمْ، شَاْنَهُمْ، حالھم، یہ سب متقارب المعنی ہیں۔ مطلب ہے کہ انہیں معاصی سے بچا کر رشد وخیر کی راہ پر لگا دیا، ایک مومن کے لئے اصلاح حال کی یہی سب سے بہتر صورت ہے۔ یہ مطلب نہیں ہے کہ مال ودولت کے ذریعے سے ان کی حالت درست کر دی۔ کیونکہ ہر مومن کو مال ملتا بھی نہیں، علاوہ ازیں محض دنیوی مال اصلاح واحوال کا یقینی ذریعہ بھی نہیں، بلکہ اس سے فساد احوال کا زیادہ امکان ہے۔ اسی لئے نبی (صلى الله عليه وسلم) نے کثرت مال کو پسند نہیں فرمایا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-alladhīna āmanū waʿamilū al-ṣāliḥāti waāmanū bimā nuzzila ʿalā muḥammadin wahuwa al-ḥaqu min rabbihim kaffara ʿanhum sayyiātihim wa-aṣlaḥa bālahum ","translations":["And those who","believe","and do","righteous deeds","and believe","in what","is revealed","to","Muhammad","and it","(is) the truth","from","their Lord","He will remove","from them","their misdeeds","and improve","their condition","(2)"],"transliterationArr":["wa-alladhīna","āmanū","waʿamilū","al-ṣāliḥāti","waāmanū","bimā","nuzzila","ʿalā","muḥammadin","wahuwa","al-ḥaqu","min","rabbihim","kaffara","ʿanhum","sayyiātihim","wa-aṣlaḥa","bālahum",null],"verseTiming":[[1,0,1290],[2,1290,2460],[3,2460,3180],[4,3180,4700],[5,4700,5880],[6,5880,6590],[7,6590,7430],[8,7430,8030],[9,8030,9960],[10,9960,11090],[11,11090,11990],[12,11990,12170],[13,12170,13440],[14,13440,14300],[15,14300,15080],[16,15080,16810],[17,16810,17950],[18,17950,19475]]}}