{"name":"47:21","price":"فرمان کا بجا ﻻنا اور اچھی بات کا کہنا(1) ۔ پھر جب کام مقرر ہو جائے(2)، تو اللہ کے ساتھ سچے رہیں(3) تو ان کے لئے بہتری ہے.(4)","arabic":"طَاعَةٞ وَقَوۡلٞ مَّعۡرُوفٞۚ فَإِذَا عَزَمَ ٱلۡأَمۡرُ فَلَوۡ صَدَقُواْ ٱللَّهَ لَكَانَ خَيۡرٗا لَّهُمۡ","category":["47 (Muhammad)","Muhammad","Surah Muhammad","Chapter Muhammad","Surah 47","Chapter 47","Muhammad","مُحَمَّد"],"ayahNumber":4566,"juzNumber":26,"footnotes":"(1) یعنی حکم جہاد سے گھبرانے کے بجائے ان کے لئے بہتر تھا کہ وہ سمع وطاعت کا مظاہرہ کرتے اور نبی (صلى الله عليه وسلم)کی بابت، گستاخی کے بجائے، اچھی بات کہتے۔ یہ أَوْلَى بمعنی أَجْدَرُ (بہتر) ہے، جسے ابن کثیرنے اختیار کیا ہے۔ بعض نے اولیٰ کو تہدید ووعید کا کلمہ یعنی بددعا قرار دیا ہے۔ مَعْنَاهُ قَارَبَهُ مَا يُهْلِكُهُ (ان کی ہلاکت قریب ہے) مطلب ہے، ان کی بزدلی اور نفاق ان کی ہلاکت کا سبب بنے گا۔ اس اعتبار سے طَاعَةٌ وَقَوْلٌ مَعْرُوفٌ جملہ مستانفہ ہوگا اور اس کی خبر محذوف ہوگی خَيْرٌ لَّكُمْ (فتح القدیر، ایسر التفاسیر)۔\n(2) یعنی جہاد کی تیاری مکمل ہو جائے اور وقت جہاد آجائے۔\n(3) یعنی اگر اب بھی نفاق چھوڑ کر، اپنی نیت اللہ کے لئے خالص کر لیں، یا رسول کے سامنے رسول (صلى الله عليه وسلم)کے ساتھ لڑنے کا جو عہد کرتے ہیں، اس میں اللہ سے سچے رہیں۔\n(4) یعنی نفاق اور مخالفت کے مقابلے میں توبہ واخلاص کا مظاہرہ بہتر ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"ṭāʿatun waqawlun maʿrūfun fa-idhā ʿazama al-amru falaw ṣadaqū al-laha lakāna khayran lahum ","translations":["(Is) obedience","and a word","kind","And when","(is) determined","the matter","then if","they had been true","(to) Allah","surely, it would have been","better","for them","(21)"],"transliterationArr":["ṭāʿatun","waqawlun","maʿrūfun","fa-idhā","ʿazama","al-amru","falaw","ṣadaqū","al-laha","lakāna","khayran","lahum",null],"verseTiming":[[1,0,1800],[2,1800,2620],[3,2620,7140],[4,7140,8020],[5,8020,8630],[6,8630,9540],[7,9540,10120],[8,10120,10860],[9,10860,11710],[10,11710,12650],[11,12650,13470],[12,13470,14815]]}}