{"name":"47:35","price":"پس تم بودے بن کر صلح کی درخواست پر نہ اتر آؤ جبکہ تم ہی بلند وغالب رہو گے(1) اور اللہ تمہارے ساتھ ہے(2)، ناممکن ہے کہ وه تمہارے اعمال ضائع کر دے.(3)","arabic":"فَلَا تَهِنُواْ وَتَدۡعُوٓاْ إِلَى ٱلسَّلۡمِ وَأَنتُمُ ٱلۡأَعۡلَوۡنَ وَٱللَّهُ مَعَكُمۡ وَلَن يَتِرَكُمۡ أَعۡمَٰلَكُمۡ","category":["47 (Muhammad)","Muhammad","Surah Muhammad","Chapter Muhammad","Surah 47","Chapter 47","Muhammad","مُحَمَّد"],"ayahNumber":4580,"juzNumber":26,"footnotes":"(1) مطلب یہ ہے کہ جب تم تعداد اور قوت وطاقت کے اعتبار سےدشمن پر غالب اور فائق تر ہو تو ایسی صورت میں کفار کے ساتھ صلح اور کمزوری کا مظاہرہ مت کرو، بلکہ کفر پر ایسی کاری ضرب لگاؤ کہ اللہ کا دین سر بلند ہو جائے۔ غالب وبرتر ہوتےہوئے کفر کےساتھ مصالحت کا مطلب، کفر کےاثر ونفوذ کے بڑھانے میں مدد دینا ہے۔ یہ ایک بڑا جرم ہے۔ اس کا یہ مطلب نہیں ہے کہ کافروں کے ساتھ صلح کرنے کی اجازت نہیں ہے۔ یہ اجازت یقیناً ہے، لیکن ہر وقت نہیں۔ صرف اس وقت ہےجب مسلمان تعداد میں کم اوروسائل کے لحاظ سے فروتر ہوں۔ ایسے حالات میں لڑائی کی بہ نسبت صلح میں زیادہ فائدہ ہے تاکہ مسلمان اس موقعے سےفائدہ اٹھا کر بھرپور تیاری کر لیں، جیسے خود نبی ﹲ نےکفار مکہ سے جنگ نہ کرنے کا دس سالہ معاہدہ کیا تھا۔\n(2) اس میں مسلمانوں کے لئے دشمن پر فتح ونصرت کی عظیم بشارت ہے۔ جس کے ساتھ اللہ ہو، اس کو کون شکست دے سکتاہے؟\n(3) بلکہ وہ اس پر پورا اجر دے گا اور اس میں کوئی کمی نہیں کرے گا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"falā tahinū watadʿū ilā al-salmi wa-antumu al-aʿlawna wal-lahu maʿakum walan yatirakum aʿmālakum ","translations":["So (do) not","weaken","and call","for","peace","while you","(are) superior","and Allah","(is) with you","and never","will deprive you","(of) your deeds","(35)"],"transliterationArr":["falā","tahinū","watadʿū","ilā","al-salmi","wa-antumu","al-aʿlawna","wal-lahu","maʿakum","walan","yatirakum","aʿmālakum",null],"verseTiming":[[1,0,680],[2,680,1630],[3,1630,4020],[4,4020,4360],[5,4360,5300],[6,5300,6850],[7,6850,8140],[8,8140,9290],[9,9290,10150],[10,10150,10530],[11,10530,12200],[12,12200,14215]]}}