{"name":"47:4","price":"تو جب کافروں سے تمہاری مڈبھیڑ ہوتو گردنوں پر وار مارو(1) ۔ جب ان کو اچھی طرح کچل ڈالو تو اب خوب مضبوط قید وبند سے گرفتار کرو(2)، (پھر اختیار ہے) کہ خواه احسان رکھ کر چھوڑ دو یا فدیہ(3) لے کر تاوقتیکہ لڑائی اپنے ہتھیار رکھ دے(4)۔ یہی حکم ہے(5) اور اللہ اگر چاہتا تو (خود) ہی ان سے بدلہ لے لیتا(6)، لیکن (اس کا منشا یہ ہے) کہ تم میں سے ایک کا امتحان دوسرے کے ذریعہ سے لے لے(7)، جو لوگ اللہ کی راه میں شہید کر دیے جاتے ہیں اللہ ان کے اعمال ہرگز ضائع نہ کرے گا.(8)","arabic":"فَإِذَا لَقِيتُمُ ٱلَّذِينَ كَفَرُواْ فَضَرۡبَ ٱلرِّقَابِ حَتَّىٰٓ إِذَآ أَثۡخَنتُمُوهُمۡ فَشُدُّواْ ٱلۡوَثَاقَ فَإِمَّا مَنَّۢا بَعۡدُ وَإِمَّا فِدَآءً حَتَّىٰ تَضَعَ ٱلۡحَرۡبُ أَوۡزَارَهَاۚ ذَٰلِكَۖ وَلَوۡ يَشَآءُ ٱللَّهُ لَٱنتَصَرَ مِنۡهُمۡ وَلَٰكِن لِّيَبۡلُوَاْ بَعۡضَكُم بِبَعۡضٖۗ وَٱلَّذِينَ قُتِلُواْ فِي سَبِيلِ ٱللَّهِ فَلَن يُضِلَّ أَعۡمَٰلَهُمۡ","category":["47 (Muhammad)","Muhammad","Surah Muhammad","Chapter Muhammad","Surah 47","Chapter 47","Muhammad","مُحَمَّد"],"ayahNumber":4549,"juzNumber":26,"footnotes":"(1) جب دونوں فریقوں کا ذکر کر دیا تو اب کافروں اور غیر معاہد اہل کتاب سے جہاد کرنے کا حکم دیا جا رہا ہے۔ قتل کرنے کے بجائے۔ گردنیں مارنے کا حکم دیا، کہ اس تعبیر میں کفار کے ساتھ غلظت وشدت کا زیادہ اظہار ہے۔ (فتح القدیر)۔\n(2) یعنی زور دار معرکہ آرائی اور زیادہ سے زیادہ ان کو قتل کرنے کے بعد، ان کے جو آدمی قابو میں آجائیں، انہیں قیدی بنا لو اور مضبوطی سے انہیں جکڑ کر رکھو تاکہ وہ بھاگ نہ سکیں۔\n(3) مَنٌّ کا مطلب ہے بغیر فدیہ کا لئے بطور احسان چھوڑ دینا اور فداء کا مطلب، کچھ معاوضہ لےکر چھوڑنا ہے، قیدیوں کے بارے میں اختیار دے دیا گیا جو صورت، حالات کے اعتبار سے اسلام اور مسلمانوں کےحق میں زیادہ بہتر ہو وہ اختیار کر لی جائے۔\n(4) یعنی کافروں کے ساتھ جنگ ختم ہو جائے، یا مراد ہے کہ محارب دشمن شکست کھا کر یا صلح کرکےہتھیار رکھ دے یا اسلام غالب آجائے اور کفر کا خاتمہ ہو جائے۔ مطلب یہ ہے کہ جب تک یہ صورت حال نہ ہو جائے، کافروں کے ساتھ تمہاری معرکہ آرائی جاری رہے گی جس میں تم انہیں قتل بھی کرو گے قیدیوں میں تمہیں مذکورہ دونوں باتوں کا اختیار ہے، بعض کہتےہیں، یہ آیت منسوخ ہے اور سوائے قتل کےکوئی صورت باقی نہیں ہے۔ لیکن صحیح بات یہی ہے کہ یہ آیت منسوخ نہیں محکم ہے۔ اور امام وقت کو چاروں باتوں کا اختیار ہے، کافروں کو قتل کرے یا قیدی بنائے۔ قیدیوں میں سے جس کو یاسب کو چاہے بطور احسان چھوڑ دے یا معاوضہ لے کر چھوڑ دے۔ (فتح القدیر)۔\n(5) یا تم اسی طرح کرو، افْعَلُوا ذَلِك یا ذَلِكَ حُكْمُ الْكُفَّارِ۔\n(6) مطلب کافروں کو ہلاک کرکے یا انہیں عذاب میں مبتلا کرکے۔ یعنی ان سے لڑنے کی ضرورت ہی پیش نہ آتی۔\n(7) یعنی تمہیں ایک دوسرے کے ذریعے سے آزمائے تاکہ وہ جان لے کہ تم میں سے اس کی راہ میں لڑنے والے کون ہیں؟ تاکہ ان کو اجر وثواب دے اور ان کے ہاتھوں سے کافروں کو ذلت وشکست سے دوچار کرے۔\n(8) یعنی ان کا اجر وثواب ضائع نہیں فرمائے گا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"fa-idhā laqītumu alladhīna kafarū faḍarba al-riqābi ḥattā idhā athkhantumūhum fashuddū al-wathāqa fa-immā mannan baʿdu wa-immā fidāan ḥattā taḍaʿa al-ḥarbu awzārahā dhālika walaw yashāu al-lahu la-intaṣara min'hum walākin liyabluwā baʿḍakum bibaʿḍin wa-alladhīna qutilū fī sabīli al-lahi falan yuḍilla aʿmālahum ","translations":["So when","you meet","those who","disbelieve","then strike","the necks","until","when","you have subdued them","then bind firmly","the bond","then either","a favor","afterwards","or","ransom","until","lays down","the war","its burdens","That","And if","Allah had willed","Allah had willed","surely, He could have taken retribution","from them","but","to test","some of you","with others","And those who","are killed","in","(the) way of Allah","(the) way of Allah","then never","He will cause to be lost","their deeds","(4)"],"transliterationArr":["fa-idhā","laqītumu","alladhīna","kafarū","faḍarba","al-riqābi","ḥattā","idhā","athkhantumūhum","fashuddū","al-wathāqa","fa-immā","mannan","baʿdu","wa-immā","fidāan","ḥattā","taḍaʿa","al-ḥarbu","awzārahā","dhālika","walaw","yashāu","al-lahu","la-intaṣara","min'hum","walākin","liyabluwā","baʿḍakum","bibaʿḍin","wa-alladhīna","qutilū","fī","sabīli","al-lahi","falan","yuḍilla","aʿmālahum",null],"verseTiming":[[1,0,870],[2,870,1890],[3,1890,2890],[4,2890,3760],[5,3760,4550],[6,4550,5690],[7,5690,7910],[8,7910,10490],[9,10490,12660],[10,12660,13510],[11,13510,14550],[12,14550,16500],[13,16500,17860],[14,17860,19040],[15,19040,19690],[16,19690,21400],[17,21400,24190],[18,24190,25000],[19,25000,25680],[20,25680,26550],[21,26550,28180],[22,28180,29970],[23,29970,30510],[24,30510,32720],[25,32720,33570],[26,33570,35350],[27,35350,36230],[28,36230,37120],[29,37120,38230],[30,38230,40270],[31,40270,41140],[32,41140,42730],[33,42730,43520],[34,43520,43950],[35,43950,45070],[36,45070,45680],[37,45680,46290],[38,46290,47950],[39,47950,49815]]}}