{"name":"47:7","price":"اے ایمان والو! اگر تم اللہ (کے دین) کی مدد کرو گے(1) تو وه تمہاری مدد کرے گا اور تمہیں ﺛابت قدم رکھے گا.(2)","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِن تَنصُرُواْ ٱللَّهَ يَنصُرۡكُمۡ وَيُثَبِّتۡ أَقۡدَامَكُمۡ","category":["47 (Muhammad)","Muhammad","Surah Muhammad","Chapter Muhammad","Surah 47","Chapter 47","Muhammad","مُحَمَّد"],"ayahNumber":4552,"juzNumber":26,"footnotes":"(1) اللہ کی مدد کرنے سے مطلب، اللہ کے دین کی مدد ہے۔ کیونکہ وہ اسباب کے مطابق اپنے دین کی مدد اپنے مومن بندوں کے ذریعے سے ہی کرتا ہے۔ یہ مومن بندے اللہ کے دین کی حفاظت اور اس کی تبلیغ ودعوت کرتے ہیں تو اللہ تعالیٰ ان کی مدد فرماتا ہے یعنی انہیں کافروں پرفتح وغلبہ عطا کرتا ہے۔ جیسے صحابہ کرام (رضي الله عنهم) اجمعین اور قرون اولیٰ کے مسلمانوں کی روشن تاریخ ہے، وہ دین کے ہوگئے تھے تو اللہ بھی ان کا ہوگیا تھا، انہوں نے دین کو غالب کیا تو اللہ نے انہیں بھی دنیا پر غالب فرما دیا۔ جیسے دوسرےمقام پر فرمایا۔ وَلَيَنْصُرَنَّ اللَّهُ مَنْ يَنْصُرُهُ (الحج: 40) اللہ اس کی ضرور مدد فرماتا ہے جو اس کی مدد کرتا ہے)۔\n(2) یہ لڑائی کے وقت تَثْبِيتُ أَقْدَامٍ یہ عبارت ہے مواطن حرب میں نصر ومعونت سے۔ بعض کہتے ہیں اسلام، یا پل صراط پر ثابت قدم رکھے گا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāayyuhā alladhīna āmanū in tanṣurū al-laha yanṣur'kum wayuthabbit aqdāmakum ","translations":["O you who believe","O you who believe","O you who believe","If","you help","Allah","He will help you","and make firm","your feet","(7)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","in","tanṣurū","al-laha","yanṣur'kum","wayuthabbit","aqdāmakum",null],"verseTiming":[[1,0,3050],[2,3050,4060],[3,4060,6770],[4,6770,7850],[5,7850,9450],[6,9450,10300],[7,10300,12430],[8,12430,13670],[9,13670,15695]]}}