{"name":"48:18","price":"یقیناً اللہ تعالیٰ مومنوں سے خوش ہوگیا جبکہ وه درخت تلے تجھ سے بیعت کر رہے تھے(1) ۔ ان کے دلوں میں جو تھا اسے اس نے معلوم کر لیا(2) اور ان پر اطمینان نازل فرمایا(3) اور انہیں قریب کی فتح عنایت فرمائی.(4)","arabic":"۞ لَّقَدۡ رَضِيَ ٱللَّهُ عَنِ ٱلۡمُؤۡمِنِينَ إِذۡ يُبَايِعُونَكَ تَحۡتَ ٱلشَّجَرَةِ فَعَلِمَ مَا فِي قُلُوبِهِمۡ فَأَنزَلَ ٱلسَّكِينَةَ عَلَيۡهِمۡ وَأَثَٰبَهُمۡ فَتۡحٗا قَرِيبٗا","category":["48 (Al-Fath)","Al-Fath","Surah Al-Fath","Chapter Al-Fath","Fath","Surah Fath","Chapter Fath","Al Fath","Surah Al Fath","Chapter Al Fath","Surah 48","Chapter 48","The Victory","الفتح"],"ayahNumber":4601,"juzNumber":26,"footnotes":"(1) یہ ان اصحاب بیعت رضوان کے لئے رضائے الٰہی اور ان کے پکے سچے مومن ہونے کا سرٹیفکیٹ ہے، جنہوں نے حدیبیہ میں ایک درخت کے نیچے اس بات پر بیعت کی کہ وہ قریش مکہ سے لڑیں گے اور راہ فرار اختیار نہیں کریں گے۔\n(2) یعنی ان کے دلوں میں جو صدق وصفا کے جذبات تھے، اللہ ان سے بھی واقف ہے۔ اس سے ان دشمنان صحابہ (رضي الله عنهم) کا رد ہو گیا جو کہتے ہیں کہ ان کا ایمان ظاہری تھا، دل سے وہ منافق تھے۔\n(3) یعنی وہ نہتے تھے، جنگ کی نیت سی نہیں گئے تھے، اس لئے جنگی ہتھیار مطلوبہ تعداد میں نہیں تھے۔ اس کے باوجود جب نبی (صلى الله عليه وسلم) نے حضرت عثمان (رضي الله عنه) کا بدلہ لینے کے لئے ان سے جہاد کی بیعت لی تو بلا ادنیٰ تامل، سب لڑنے کے لئے تیار ہوگئے، یعنی ہم نے موت کا خوف ان کےدلوں سے نکال دیا اور اس کی جگہ صبر وسکینت ان پر نازل فرما دی جس کی بنا پر انہیں لڑنے کا حوصلہ ہوا۔\n(4) اس سے مراد وہی فتح خیبر ہے جو یہودیوں کا گڑھ تھا، اور حدیبیہ سے واپسی پر مسلمانوں نے اسے فتح کیا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"laqad raḍiya al-lahu ʿani al-mu'minīna idh yubāyiʿūnaka taḥta al-shajarati faʿalima mā fī qulūbihim fa-anzala al-sakīnata ʿalayhim wa-athābahum fatḥan qarīban ","translations":["Certainly","Allah was pleased","Allah was pleased","with","the believers","when","they pledged allegiance to you","under","the tree","and He knew","what","(was) in","their hearts","so He sent down","the tranquility","upon them","and rewarded them","(with) a victory","near","(18)"],"transliterationArr":["laqad","raḍiya","al-lahu","ʿani","al-mu'minīna","idh","yubāyiʿūnaka","taḥta","al-shajarati","faʿalima","mā","fī","qulūbihim","fa-anzala","al-sakīnata","ʿalayhim","wa-athābahum","fatḥan","qarīban",null],"verseTiming":[[1,0,660],[2,660,1350],[3,1350,2150],[4,2150,2520],[5,2520,3840],[6,3840,4290],[7,4290,5870],[8,5870,6460],[9,6460,7520],[10,7520,8330],[11,8330,8700],[12,8700,9040],[13,9040,10270],[14,10270,12070],[15,12070,13340],[16,13340,14480],[17,14480,16900],[18,16900,18170],[19,18170,19260],[20,19260,20620],[21,20620,22430],[22,22430,24035]]}}