{"name":"48:26","price":"جب کہ(1) ان کافروں نے اپنے دلوں میں حمیت کو جگہ دی اور حمیت بھی جاہلیت کی، سو اللہ تعالیٰ نے اپنے رسول پر اور مومنین پر اپنی طرف سے تسکین نازل فرمائی(2) اور اللہ تعالیٰ نے مسلمانوں کو تقوے کی بات پر جمائے رکھا(3) اور وه اس کے اہل اور زیاده مستحق تھے اور اللہ تعالیٰ ہر چیز کو خوب جانتا ہے.","arabic":"إِذۡ جَعَلَ ٱلَّذِينَ كَفَرُواْ فِي قُلُوبِهِمُ ٱلۡحَمِيَّةَ حَمِيَّةَ ٱلۡجَٰهِلِيَّةِ فَأَنزَلَ ٱللَّهُ سَكِينَتَهُۥ عَلَىٰ رَسُولِهِۦ وَعَلَى ٱلۡمُؤۡمِنِينَ وَأَلۡزَمَهُمۡ كَلِمَةَ ٱلتَّقۡوَىٰ وَكَانُوٓاْ أَحَقَّ بِهَا وَأَهۡلَهَاۚ وَكَانَ ٱللَّهُ بِكُلِّ شَيۡءٍ عَلِيمٗا","category":["48 (Al-Fath)","Al-Fath","Surah Al-Fath","Chapter Al-Fath","Fath","Surah Fath","Chapter Fath","Al Fath","Surah Al Fath","Chapter Al Fath","Surah 48","Chapter 48","The Victory","الفتح"],"ayahNumber":4609,"juzNumber":26,"footnotes":"(1) إِذْ کا ظرف یا تو لَعَذَّبْنَا سے یا وَاذْكُرُوا محذوف ہے۔ یعنی اس وقت کو یاد کرو، جب کہ ان کافروں نے۔۔۔\n(2) کفار کی اس حمیت جاہلیہ (عار اور غرور) سے مراد اہل مکہ کا مسلمانوں کو مکے میں داخل ہونے سے روکنا ہے۔ انہوں نے کہا کہ انہوں نے ہمارے بیٹوں اور باپوں کو قتل کیا ہے۔ لات وعزیٰ کی قسم ہم انہیں کبھی داخل نہیں ہونے دیں گے یعنی انہوں نےاسے اپنی عزت اور وقار کا مسئلہ بنا لیا، اسی کو حمیت جاہلیہ کہا گیا ہے، کیونکہ خانہ کعبہ میں عبادت کے لئے آنے سے روکنے کاکﺴی کو حق نہیں تھا۔ قریش مکہ کے اس معاندانہ رویے کے جواب میں خطرہ تھا کہ مسلمانوں کے جذبات میں بھی شدت آجاتی اور وہ بھی اسے اپنےوقار کا مسئلہ بنا کر مکے جانے پر اصرار کرتے، جس سے دونوں کے درمیان لڑائی چھڑ جاتی، اور یہ لڑائی مسلمانوں کے لئے سخت خطرناک رہتی (جیسا کہ پہلےاشارہ کیا جا چکا ہے) اس لئے اللہ تعالیٰ نے مسلمانوں کےدلوں میں سکینت نازل فرما دی یعنی انہیں صبر وتحمل کی توفیق دے دی اور وہ پیغمبر(صلى الله عليه وسلم) کے ارشاد کے مطابق حدیبیہ میں ہی ٹھہرے رہےجوش اور جذبے میں آکر مکے جانے کی کوشش نہیں کی۔ بعض کہتے ہیں کہ اس حمیت جاہلیہ سے مراد قریش مکہ کا وہ رویہ ہے جو صلح کے لئے معاہدے کے وقت انہوں نے اختیار کیا۔ یہ رویہ اور معاہدہ دونوں مسلمانوں کے لئے بظاہر ناقابل برداشت تھا۔ لیکن انجام کے اعتبار سےچونکہ اس میں اسلام اور مسلمانوں کا بہترین مفاد تھا، اس لئے اللہ تعالیٰ نےمسلمانوں کو نہایت ناگواری اور گرانی کے باوجود اسے قبول کرنے کا حوصلہ عطا فرما دیا۔ اس کی مختصر تفصیل اس طرح ہے۔ کہ جب رسول اللہ (صلى الله عليه وسلم) نےقریش مکہ کے بھیجےہوئے نمائندوں کی یہ بات تسلیم کر لی کہ اس سال مسلمان عمرے کے لئے مکہ نہیں جائیں گے اور یہیں سے واپس ہو جائیں گے تو پھر آپ ﹲ نے حضرت علی (رضي الله عنه) کو معاہدہ لکھنے کا حکم دیا۔ انہوں نے آپ (صلى الله عليه وسلم) کے حکم سے، بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ لکھی، انہوں نے اس پر اعتراض کر دیا کہ رحمٰن، رحیم کو ہم نہیں جانتے۔ ہمارے ہاں جو لفظ استعمال ہوتا ہے، اس کے ساتھ یعنی بِاسْمِكَ اللَّهُمَّ (اے اللہ ! تیرے نام سے) لکھیں چنانچہ آپ(صلى الله عليه وسلم) نے اسی طرح لکھوایا۔ پھر آپ(صلى الله عليه وسلم) نےلکھوایا یہ وہ دستاویز ہے جس پر محمد رسول اللہ ((صلى الله عليه وسلم)) نے اہل مکہ سے مصالحت کی ہے قریش کے نمائندوں نے کہا، اختلاف کی بنیاد تو آپ (صلى الله عليه وسلم)کی رسالت ہی ہے، اگر ہم آپ (صلى الله عليه وسلم)کو رسول اللہ مان لیں تو اس کے بعد جھگڑا ہی کیا رہ جاتا ہے؟ پھر ہمیں آپ(صلى الله عليه وسلم) سے لڑنے کی اور بیت اللہ میں جانے سے روکنے کی ضرورت ہی کیا ہے؟ آپ ﹲ یہاں محمد رسول اللہ کی جگہ محمد بن عبداللہ لکھیں۔ چنانچہ آپ نے حضرت علی (رضي الله عنه) کو ایسا ہی لکھنے کا حکم دیا۔ (یہ مسلمانوں کے لئے نہایت اشتعال انگیز صورت حال تھی، اگر اللہ تعالیٰ مسلمانوں پر سکینت نازل نہ فرماتا تو وہ کبھی سے برداشت نہ کرتے) حضرت علی (رضي الله عنه) نے اپنےہاتھ سے محمد رسول اللہ کے الفاظ مٹانے اور کاٹنے سے انکار کر دیا، تو نبی کریم ﹲ نے کہا کہ یہ لفظ کہاں ہے؟ بتانے کے بعد خود آپ ﹲ اسے اپنے دست مبارک سے مٹا دیا اور اس کی جگہ محمد بن عبداللہ تحریر کرنے کو فرمایا۔ اس کے بعد اس معاہدے یا صلح نامے میں تین باتیں لکھیں گئیں۔ 1۔ اہل مکہ میں سےجو مسلمان ہو کر آپ کےپاس آئے گا، اسے واپس کر دیا جائے گا۔ 2 - جو مسلمان اہل مکہ سے جا ملے گا، وہ اس کو واپس کرنے کا پابند نہیں ہوں گے۔ 3 - مسلمان آئندہ سال مکے میں ائیں گے اور یہاں تین دن قیام کر سکیں گے، تاہم انہیں ہتھیار ساتھ لانے کی اجازت نہیں ہوگی۔ (صحيح مسلم، كتاب الجهاد، باب صلح الحديبية في الحديبية) اور اس کے ساتھ دو باتیں اور لکھی گئیں۔ 1۔ اس سال لڑائی موقوف رہے گی۔ 2 - قبائل میں سے جو چاہے مسلمانوں کے ساتھ اور جو چاہے قریش کے ساتھ ہو جائے۔\n(3) اس سے مراد کلمۂ توحید ورسالت لا إِلَهَ إِلا اللهَ مُحَمَّدٌ رَّسُولُ اللهِ ہے، جس سے حدیبیہ والے دن مشرکین نے انکار کیا (ابن کثیر) یا وہ صبر ووقار ہےجس کا مظاہرہ انہوں نے حدیبیہ میں کیا یا وہ وفائے عہد اور اس پر ثبات ہے جو تقویٰ کا نتیجہ ہے۔ (فتح القدیر)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"idh jaʿala alladhīna kafarū fī qulūbihimu al-ḥamiyata ḥamiyyata al-jāhiliyati fa-anzala al-lahu sakīnatahu ʿalā rasūlihi waʿalā al-mu'minīna wa-alzamahum kalimata al-taqwā wakānū aḥaqqa bihā wa-ahlahā wakāna al-lahu bikulli shayin ʿalīman ","translations":["When","had put","those who","disbelieved","in","their hearts","disdain ","(the) disdain","(of the time of) ignorance","Then Allah sent down","Then Allah sent down","His tranquility","upon","His Messenger","and upon","the believers","and made them adhere","(to the) word","(of) righteousness","and they were","more deserving","of it","and worthy of it","And is","Allah","of every","thing","All-Knower","(26)"],"transliterationArr":["idh","jaʿala","alladhīna","kafarū","fī","qulūbihimu","al-ḥamiyata","ḥamiyyata","al-jāhiliyati","fa-anzala","al-lahu","sakīnatahu","ʿalā","rasūlihi","waʿalā","al-mu'minīna","wa-alzamahum","kalimata","al-taqwā","wakānū","aḥaqqa","bihā","wa-ahlahā","wakāna","al-lahu","bikulli","shayin","ʿalīman",null],"verseTiming":[[1,0,490],[2,490,1040],[3,1040,2180],[4,2180,3040],[5,3040,3470],[6,3470,4730],[7,4730,6030],[8,6030,7070],[9,7070,8810],[10,8810,10660],[11,10660,11600],[12,11600,13060],[13,13060,13740],[14,13740,15020],[15,15020,15610],[16,15610,17110],[17,17110,18580],[18,18580,19360],[19,19360,20520],[20,20520,22640],[21,22640,23400],[22,23400,24460],[23,24460,26859],[24,26859,27739],[25,27739,28309],[26,28309,29759],[27,29759,30929],[28,30929,31799],[29,31799,32589],[30,32589,33479],[31,33479,35064]]}}