{"name":"48:21","price":"اور تمہیں اور (غنیمتیں) بھی دے جن پر اب تک تم نے قابو نہیں پایا۔ اللہ تعالیٰ نے انہیں اپنے قابو میں رکھا ہے(1) اور اللہ تعالیٰ ہر چیز پر قادر ہے.","arabic":"وَأُخۡرَىٰ لَمۡ تَقۡدِرُواْ عَلَيۡهَا قَدۡ أَحَاطَ ٱللَّهُ بِهَاۚ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٗا","category":["48 (Al-Fath)","Al-Fath","Surah Al-Fath","Chapter Al-Fath","Fath","Surah Fath","Chapter Fath","Al Fath","Surah Al Fath","Chapter Al Fath","Surah 48","Chapter 48","The Victory","الفتح"],"ayahNumber":4604,"juzNumber":26,"footnotes":"(1) یہ بعد میں ہونے والی فتوحات اور ان سے حاصل ہونے والی غنیمت کی طرف اشارہ ہے۔ جس طرح چار دیواری کر کے کسی چیز کو اپنے قبصے میں کر لیا جاتا ہے اور پھر اس کی بابت بے فکری ہو جاتی ہے۔ اسی طرح اللہ نے ان فتوحات کو اپنے حیطۂ اقتدار میں لیا ہوا ہے۔ یعنی گو ابھی تمہاری فتوحات کا دائرہ وہاں تک وسیع نہیں ہوا ہے۔ لیکن اللہ نے انہیں تمہارے لئے قابو میں کیا ہوا ہے، وہ جب چاہے گا، تمہیں اس پر غلبہ عطا کر دے گا، جس میں کوئی شک والی بات نہیں ہے، اس لئے کہ وہ ہر چیز پر قادر ہے۔ بعض نے أَحَاطَ کے معنی عَلِمَ کے کیے ہیں، یعنی اسے معلوم ہے کہ وہ علاقے بھی تم فتح کرو گے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-ukh'rā lam taqdirū ʿalayhā qad aḥāṭa al-lahu bihā wakāna al-lahu ʿalā kulli shayin qadīran ","translations":["And others","not","you had power","over them","surely","Allah encompassed","Allah encompassed","them","and is","Allah","over","all","things","All-Powerful","(21)"],"transliterationArr":["wa-ukh'rā","lam","taqdirū","ʿalayhā","qad","aḥāṭa","al-lahu","bihā","wakāna","al-lahu","ʿalā","kulli","shayin","qadīran",null],"verseTiming":[[1,0,1020],[2,1020,1400],[3,1400,2450],[4,2450,3450],[5,3450,3880],[6,3880,4690],[7,4690,5590],[8,5590,6240],[9,6240,7420],[10,7420,8330],[11,8330,8880],[12,8880,9530],[13,9530,11170],[14,11170,12875]]}}