{"name":"48:2","price":"تاکہ جو کچھ تیرے گناه آگے ہوئے اور جو پیچھے سب کو اللہ تعالیٰ معاف فرمائے(1) ، اور تجھ پر اپنا احسان پورا کر دے(2) اور تجھے سیدھی راه چلائے.(3)","arabic":"لِّيَغۡفِرَ لَكَ ٱللَّهُ مَا تَقَدَّمَ مِن ذَنۢبِكَ وَمَا تَأَخَّرَ وَيُتِمَّ نِعۡمَتَهُۥ عَلَيۡكَ وَيَهۡدِيَكَ صِرَٰطٗا مُّسۡتَقِيمٗا","category":["48 (Al-Fath)","Al-Fath","Surah Al-Fath","Chapter Al-Fath","Fath","Surah Fath","Chapter Fath","Al Fath","Surah Al Fath","Chapter Al Fath","Surah 48","Chapter 48","The Victory","الفتح"],"ayahNumber":4585,"juzNumber":26,"footnotes":"(1) اس سے مراد ترک اولیٰ والے معاملات یا وہ امور ہیں جو آپ (صلى الله عليه وسلم)پنے اپنی فہم واجتہاد سے کیے، لیکن اللہ نے انہیں ناپسند فرمایا، جیسے عبداللہ بن ام مکتوم (رضي الله عنه) وغیرہ کا واقعہ ہے جس پر سورۂ عبس کا نزول ہوا، یہ معاملات وامور اگرچہ گناہ اور منافی عصمت نہیں، لیکن آپ(صلى الله عليه وسلم) کی شان ارفع کے پیش نظر انہیں بھی کوتاہیاں شمار کر لیا گیا، جس پر معافی کا اعلان فرمایا جا رہا ہے۔ لِيَغْفِرَ میں لام تعلیل کے لئے ہے۔ یعنی یہ فتح مبین ان تین چیزوں کا سبب ہے جو آیت میں مذکور ہیں۔ اور یہ مغفرت ذنوب کا سبب، اس اعتبار سے ہے کہ اس صلح کے بعد قبول اسلام کرنے والوں کی تعداد میں بکثرت اضافہ ہوا، جس سے آپ(صلى الله عليه وسلم) کے اجر عظیم میں بھی خوب اضافہ ہوا اور حسنات، وبلندی درجات میں بھی۔\n(2) اس دین کو غالب کرکے جس کی تم دعوت دیتے ہو۔ یا فتح وغلبہ عطا کرکے۔ اور بعض کہتے ہیں کہ مغفرت اور ہدایت پر استقامت یہی اتمام نعمت ہے (فتح القدیر)۔\n(3) یعنی اس پر استقامت نصیب فرمائے۔ ہدایت کے اعلیٰ سے اعلیٰ درجات سے نوازے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"liyaghfira laka al-lahu mā taqaddama min dhanbika wamā ta-akhara wayutimma niʿ'matahu ʿalayka wayahdiyaka ṣirāṭan mus'taqīman ","translations":["That may forgive","for you","Allah","what","preceded","of","your sins","and what","will follow","and complete","His favor","upon you","and guide you","(to) a Path","Straight","(2)"],"transliterationArr":["liyaghfira","laka","al-lahu","mā","taqaddama","min","dhanbika","wamā","ta-akhara","wayutimma","niʿ'matahu","ʿalayka","wayahdiyaka","ṣirāṭan","mus'taqīman",null],"verseTiming":[[1,0,1120],[2,1120,1460],[3,1460,2300],[4,2300,2630],[5,2630,3680],[6,3680,4110],[7,4110,4960],[8,4960,6340],[9,6340,6860],[10,6860,8000],[11,8000,9600],[12,9600,10850],[13,10850,11750],[14,11750,12910],[15,12910,13820],[16,13820,16705]]}}