{"name":"49:10","price":"(یاد رکھو) سارے مسلمان بھائی بھائی ہیں پس اپنے دو بھائیوں میں ملاپ کرا دیا کرو(1) ، اور اللہ سے ڈرتے رہو تاکہ تم پر رحم کیا جائے.(2)","arabic":"إِنَّمَا ٱلۡمُؤۡمِنُونَ إِخۡوَةٞ فَأَصۡلِحُواْ بَيۡنَ أَخَوَيۡكُمۡۚ وَٱتَّقُواْ ٱللَّهَ لَعَلَّكُمۡ تُرۡحَمُونَ","category":["49 (Al-Hujurat)","Al-Hujurat","Surah Al-Hujurat","Chapter Al-Hujurat","Hujurat","Surah Hujurat","Chapter Hujurat","Al Hujurat","Surah Al Hujurat","Chapter Al Hujurat","Surah 49","Chapter 49","The Rooms","الحُجرَات"],"ayahNumber":4622,"juzNumber":26,"footnotes":"(1) یہ پچھلے حکم کی ہی تاکید ہے۔ یعنی جب مومن سب آپس میں بھائی بھائی ہیں، تو ان سب کی اصل ایمان ہوئی۔ اس لئے اس اصل کی اہمیت کا تقاضا ہے کہ ایک ہی دین پر ایمان رکھنے والے آپس میں نہ لڑیں بلکہ ایک دوسرےکے دست وبازو، ہمدرد وغم گسار اور مونس وخیر خواہ بن کر رہیں۔ اور کبھی غلط فہمی سے ان کے درمیان بعد اور نفرت پیدا ہو جائے تو اسے دور کرکے انہیں آپس میں دوبارہ جوڑ دیا جائے۔ (مزید دیکھئے سورۂ توبہ، آیت 71 کا حاشیہ)۔\n(2) اور ہر معاملے میں اللہ سے ڈرو، شاید اس کی وجہ سے تم اللہ کی رحمت کے مستحق قرار پا جاؤ۔ ترجی (امید والی بات) مخاطب کے اعتبار سے ہے۔ ورنہ اللہ کی رحمت تو اہل ایمان وتقوی کے لئےیقینی ہے۔\nاس آیت میں باغی گروہ سے قتال کا حکم ہے دراں حالیکہ حدیث میں مسلمان سے قتال کو کفر کہا گیا ہے۔ تو یہ کفر اس وقت ہوگا جب بلا وجہ مسلمان سے قتال کیا جائے۔ لیکن اس قتال کی بنیاد اگر بغاوت ہے تو یہ قتال نہ صرف جائز ہے بلکہ اس کا حکم دیا گیا ہے جو تاکید واستحباب پر ڈال ہے۔ اسی طرح باغی گروہ کو قرآن نے مومن ہی قرار دیا، جس کا مطلب یہ ہے کہ صرف بغاوت سے، جو کبیرہ گناہ ہے، وہ گروہ ایمان سے خارج نہیں ہوگا۔ جیسا کہ خوارج اوربعض معتزلہ کا عقیدہ ہے کہ مرتکب کبائر ایمان سے خارج ہو جاتا ہے۔ اب بعض نہایت اہم اخلاقی ہدایت مسلمانوں کو دی جارہی ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"innamā al-mu'minūna ikh'watun fa-aṣliḥū bayna akhawaykum wa-ittaqū al-laha laʿallakum tur'ḥamūna ","translations":["Only","the believers","(are) brothers","so make peace","between","your brothers","and fear Allah","and fear Allah","so that you may","receive mercy","(10)"],"transliterationArr":["innamā","al-mu'minūna","ikh'watun","fa-aṣliḥū","bayna","akhawaykum","wa-ittaqū","al-laha","laʿallakum","tur'ḥamūna",null],"verseTiming":[[1,0,1830],[2,1830,3330],[3,3330,4920],[4,4920,6670],[5,6670,7280],[6,7280,9130],[7,9130,9920],[8,9920,10910],[9,10910,12240],[10,12240,17245]]}}