{"name":"49:12","price":"اے ایمان والو! بہت بدگمانیوں سے بچو یقین مانو کہ بعض بدگمانیاں گناه ہیں(1) ۔ اور بھید نہ ٹٹوﻻ کرو(2) اور نہ تم میں سے کوئی کسی کی غیبت کرے(3)۔ کیا تم میں سے کوئی بھی اپنے مرده بھائی کا گوشت کھانا پسند کرتا ہے؟ تم کو اس سے گھن آئے گی(4)، اور اللہ سے ڈرتے رہو، بیشک اللہ توبہ قبول کرنے واﻻ مہربان ہے.","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱجۡتَنِبُواْ كَثِيرٗا مِّنَ ٱلظَّنِّ إِنَّ بَعۡضَ ٱلظَّنِّ إِثۡمٞۖ وَلَا تَجَسَّسُواْ وَلَا يَغۡتَب بَّعۡضُكُم بَعۡضًاۚ أَيُحِبُّ أَحَدُكُمۡ أَن يَأۡكُلَ لَحۡمَ أَخِيهِ مَيۡتٗا فَكَرِهۡتُمُوهُۚ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ تَوَّابٞ رَّحِيمٞ","category":["49 (Al-Hujurat)","Al-Hujurat","Surah Al-Hujurat","Chapter Al-Hujurat","Hujurat","Surah Hujurat","Chapter Hujurat","Al Hujurat","Surah Al Hujurat","Chapter Al Hujurat","Surah 49","Chapter 49","The Rooms","الحُجرَات"],"ayahNumber":4624,"juzNumber":26,"footnotes":"(1) ظَنَّ کے معنی ہیں گمان کرنا۔ مطلب ہے کہ اہل خیر واہل اصلاح وتقویٰ کے بارے میں ایسے گمان رکھنا جو بےاصل ہوں اور تہمت وافترا کے ضمن میں آتے ہوں اسی لئے اس کا ترجمہ بدگمانی کیا جاتا ہے۔ اور حدیث میں اس کو أَكْذَبُ الْحَدِيثِ (سب سے بڑا جھوٹ) کہہ کر اس سے بچنے کی تاکید کی گئی ہے إِيَّاكُمْ وَالظَّنَّ (البخاري، كتاب الأدب ، باب يا أيها الذين آمنوا اجتنبوا كثيرا من الظن - صحيح مسلم، كتاب البر، باب تحريم الظن والتجسس) ورنہ فسق وفجور میں مبتلا لوگوں سے ان کے گناہوں کی وجہ سے اور ان کے گناہوں پر بدگمانی رکھنا، یہ وہ بدگمانی نہیں ہے جسے یہاں گناہ کہا گیا ہے اور اس سے اجتناب کی تاکید کی گئی ہے «إِنَّ الظَّنَّ الْقَبِيحَ بِمَنْ ظَاهِرُهُ الْخَيْرُ، لا يَجُوزُ، وَإِنَّهُ لا حَرَجَ فِي الظَّنِّ الْقَبِيحِ بِمَنْ ظَاهِرُه الْقَبِيحُ» (القرطبي)۔\n(2) یعنی اس ٹوہ میں رہنا کہ کوئی خامی یا عیب معلوم ہو جائے تاکہ اسے بدنام کیا جائے، یہ تجسس ہے جو منع ہے اور حدیث میں بھی اس سے منع کیا گیا ہے۔ بلکہ حکم دیا گیا ہے کہ اگر کسی کی خامی، کوتاہی تمہارے علم میں اجائے تو اس کی پردہ پوشی کرو۔ نہ کہ اسے لوگوں کے سامنے بیان کرتے پھرو، بلکہ جستجو کرکے عیب تلاش کرو۔ آج کل حریت اور آزادی کا بڑا چرچا ہے۔ اسلام نے بھی تجسس سےروک کر انسان کی حریت اور آزادی کو تسلیم کیا ہے لیکن اس وقت تک، جب تک وہ کھلے عام بےحیائی کا ارتکاب نہ کرے یا جب تک دوسروں کے لئے ایذا کا باعث نہ ہو۔ مغرب نے مطلق آزادی کا درس دے کر لوگوں کو فساد عام کی اجازت دے دی ہے جس سے معاشرے کا تمام امن وسکون برباد ہو گیا ہے\n(3) غیبت کا مطلب یہ ہےکہ دوسرے لوگوں کے سامنےکسی کی برائیوں اور کوتاہیوں کا ذکر کیا جائے جسے وہ برا سمجھے اور اگر اس کی طرف ایسی باتیں منسوب کی جائیں جو اس کے اندر موجود ہی نہیں تو وہ بہتان ہے۔ اپنی اپنی جگہ دونوں ہی بڑے جرم ہیں۔\n(4) یعنی کسی مسلمان بھائی کی کسی کے سامنے برائی بیان کرنا ایسے ہی ہے جیسے مردار بھائی کا گوشت کھانا۔ مردار بھائی کا گوشت کھانا تو کوئی پسند نہیں کرتا۔ لیکن غیبت لوگوں کی نہایت مرغوب غذا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāayyuhā alladhīna āmanū ij'tanibū kathīran mina al-ẓani inna baʿḍa al-ẓani ith'mun walā tajassasū walā yaghtab baʿḍukum baʿḍan ayuḥibbu aḥadukum an yakula laḥma akhīhi maytan fakarih'tumūhu wa-ittaqū al-laha inna al-laha tawwābun raḥīmun ","translations":["O you who believe","O you who believe","O you who believe","Avoid","much","of","the assumption","Indeed","some","assumption","(is) sin","And (do) not","spy","and (do) not","backbite","some of you","(to) others","Would like","one of you","to","eat","(the) flesh","(of) his brother","dead","Nay, you would hate it","And fear Allah","And fear Allah","indeed","Allah","(is) Oft-Returning","Most Merciful","(12)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","ij'tanibū","kathīran","mina","al-ẓani","inna","baʿḍa","al-ẓani","ith'mun","walā","tajassasū","walā","yaghtab","baʿḍukum","baʿḍan","ayuḥibbu","aḥadukum","an","yakula","laḥma","akhīhi","maytan","fakarih'tumūhu","wa-ittaqū","al-laha","inna","al-laha","tawwābun","raḥīmun",null],"verseTiming":[[1,0,3100],[2,3100,4160],[3,4160,4980],[4,4980,6000],[5,6000,6900],[6,6900,8280],[7,8280,9940],[8,9940,11230],[9,11230,11980],[10,11980,13450],[11,13450,14730],[12,14730,15330],[13,15330,16700],[14,16700,17260],[15,17260,17970],[16,17970,20120],[17,20120,21440],[18,21440,22660],[19,22660,23670],[20,23670,25120],[21,25120,26180],[22,26180,27050],[23,27050,28780],[24,28780,31930],[25,31930,33360],[26,33360,36050],[27,36050,37310],[28,37310,38190],[29,38190,39270],[30,39270,41875]]}}