{"name":"49:11","price":"اے ایمان والو! مرد دوسرے مردوں کا مذاق نہ اڑائیں ممکن ہے کہ یہ ان سے بہتر ہو اور نہ عورتیں عورتوں کا مذاق اڑائیں ممکن ہے یہ ان سے بہتر ہوں(1) ، اور آپس میں ایک دوسرے کو عیب نہ لگاؤ(2) اور نہ کسی کو برے لقب دو(3)۔ ایمان کے بعد فسق برا نام ہے(4)، اور جو توبہ نہ کریں وہی ﻇالم لوگ ہیں.","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا يَسۡخَرۡ قَوۡمٞ مِّن قَوۡمٍ عَسَىٰٓ أَن يَكُونُواْ خَيۡرٗا مِّنۡهُمۡ وَلَا نِسَآءٞ مِّن نِّسَآءٍ عَسَىٰٓ أَن يَكُنَّ خَيۡرٗا مِّنۡهُنَّۖ وَلَا تَلۡمِزُوٓاْ أَنفُسَكُمۡ وَلَا تَنَابَزُواْ بِٱلۡأَلۡقَٰبِۖ بِئۡسَ ٱلِٱسۡمُ ٱلۡفُسُوقُ بَعۡدَ ٱلۡإِيمَٰنِۚ وَمَن لَّمۡ يَتُبۡ فَأُوْلَٰٓئِكَ هُمُ ٱلظَّٰلِمُونَ","category":["49 (Al-Hujurat)","Al-Hujurat","Surah Al-Hujurat","Chapter Al-Hujurat","Hujurat","Surah Hujurat","Chapter Hujurat","Al Hujurat","Surah Al Hujurat","Chapter Al Hujurat","Surah 49","Chapter 49","The Rooms","الحُجرَات"],"ayahNumber":4623,"juzNumber":26,"footnotes":"(1) ایک شخص، دوسرے کسی شخص کا استہزا یعنی اس سے مسخرا پن اسی وقت کرتا ہے، جب وہ اپنے کو اس سے بہتر اور اس کو اپنے سے حقیر اور کمتر سمجھتا ہے۔ حالانکہ اللہ کے ہاں ایمان وعمل کے لحاظ سے کون بہتر ہے اور کون نہیں؟ اس کا علم صرف اللہ کو ہے۔ اس لئے اپنےکوبہتر اور دوسرےکو کم تر سمجھنے کا کوئی جواز ہی نہیں ہے۔ بنابریں آیت میں اس سے منع فرما دیا گیا ہے اور کہتے ہیں کہ عورتوں میں یہ اخلاقی بیماری زیادہ ہوتی ہے، اس لئے عورتوں کا الگ ذکر کرکے انہیں بھی بطور خاص اس سے روک دیا گیا ہے۔ اور حدیث رسول (صلى الله عليه وسلم) میں لوگوں کے حقیر سمجھنے کو کبر سے تعبیر کیا گیا ہے الْكِبْرُ بَطَرُ الْحَقِّ وغَمْطُ النَّاسِ (أبو داود، كتاب اللباس باب ما جاء في الكبر) اور کبر اللہ کو نہایت ہی ناپسند ہے۔\n(2) یعنی ایک دوسرے پر طعنہ زنی مت کرو، مثلاً تو تو فلاں کا بیٹا ہے، تیری ماں ایسی ویسی ہے، تو فلاں خاندان کا ہے نا وغیرہ۔\n(3) یعنی اپنےطور پر استہزا اور تحقیر کے لئے لوگوں کے ایسی نام رکھ لینا جو انہیں ناپسند ہوں۔ یا اچھے بھلے ناموں کو بگاڑ کر بولنا، یہ تنابز بالا لقاب ہے، جس کی یہاں ممانعت کی گئی ہے\n(4) یعنی اس طرح نام بگاڑ کر یا برے نام تجویز کرکے بلانا یا قبول اسلام اور توبہ کےبعد اسے سابقہ دین یا گناہ کی طرف منسوب کرکے خطاب کرنا، مثلاً اے کافر، اے زانی یا شرابی وغیرہ، یہ بہت برا کام ہے۔ الاسْمُ یہاں الذِّكْرُ کے معنی میں ہے یعنی بِئْسَ الاسْمُ الَّذِي يُذْكَرُ بِالْفِسْقِ بَعْدَ دُخُولهِمْ فِي الإِيمَانِ (فتح القدیر) البتہ اس سے بعض وہ صفاتی نام بعض حضرات کے نزدیک مستثنیٰ ہیں جو کسی کے لئےمشہور ہو جائیں اور وہ اس پر اپنے دل میں رنج بھی محسوس نہ کریں، جیسے لنگڑے پن کی وجہ سے کسی کا نام لنگڑا پڑ جائے، کالے رنگ کی بنا پر کالیا یا کالو مشہور ہو جائے۔ وغیرہ (القرطبی)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāayyuhā alladhīna āmanū lā yaskhar qawmun min qawmin ʿasā an yakūnū khayran min'hum walā nisāon min nisāin ʿasā an yakunna khayran min'hunna walā talmizū anfusakum walā tanābazū bil-alqābi bi'sa al-s'mu al-fusūqu baʿda al-īmāni waman lam yatub fa-ulāika humu al-ẓālimūna ","translations":["O you who believe","O you who believe","O you who believe","(Let) not","ridicule","a people","[of]","(another) people","perhaps","that","they may be","better","than them","and (let) not","women","[of]","(other) women","perhaps","that","they may be","better","than them","And (do) not","insult","yourselves","and (do) not","call each other","by nicknames","Wretched is","the name","(of) disobedience","after","the faith","And whoever","(does) not","repent","then those ","they","(are) the wrongdoers","(11)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","lā","yaskhar","qawmun","min","qawmin","ʿasā","an","yakūnū","khayran","min'hum","walā","nisāon","min","nisāin","ʿasā","an","yakunna","khayran","min'hunna","walā","talmizū","anfusakum","walā","tanābazū","bil-alqābi","bi'sa","al-s'mu","al-fusūqu","baʿda","al-īmāni","waman","lam","yatub","fa-ulāika","humu","al-ẓālimūna",null],"verseTiming":[[1,0,3260],[2,3260,4350],[3,4350,5370],[4,5370,5990],[5,5990,6550],[6,6550,7470],[7,7470,9470],[8,9470,10280],[9,10280,10770],[10,10770,12550],[11,12550,13470],[12,13470,14480],[13,14480,15200],[14,15200,16970],[15,16970,17550],[16,17550,20040],[17,20040,21140],[18,21140,24260],[19,24260,26600],[20,26600,26810],[21,26810,29090],[22,29090,29810],[23,29810,32240],[24,32240,33490],[25,33490,35960],[26,35960,37970],[27,37970,38570],[28,38570,39930],[29,39930,43689],[30,43689,44619],[31,44619,45219],[32,45219,46389],[33,46389,46919],[34,46919,50559],[35,50559,51009],[36,51009,51569],[37,51569,52209],[38,52209,55179],[39,55179,55529],[40,55529,58894]]}}