{"name":"49:6","price":"اے مسلمانو! اگر تمہیں کوئی فاسق خبر دے تو تم اس کی اچھی طرح تحقیق کر لیا کرو(1) ایسا نہ ہو کہ نادانی میں کسی قوم کو ایذا پہنچا دو پھر اپنے کیے پر پشیمانی اٹھاؤ.","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِن جَآءَكُمۡ فَاسِقُۢ بِنَبَإٖ فَتَبَيَّنُوٓاْ أَن تُصِيبُواْ قَوۡمَۢا بِجَهَٰلَةٖ فَتُصۡبِحُواْ عَلَىٰ مَا فَعَلۡتُمۡ نَٰدِمِينَ","category":["49 (Al-Hujurat)","Al-Hujurat","Surah Al-Hujurat","Chapter Al-Hujurat","Hujurat","Surah Hujurat","Chapter Hujurat","Al Hujurat","Surah Al Hujurat","Chapter Al Hujurat","Surah 49","Chapter 49","The Rooms","الحُجرَات"],"ayahNumber":4618,"juzNumber":26,"footnotes":"(1) یہ آیت اکثر مفسرین کےنزدیک حضرت ولید بن عقبہ (رضي الله عنه) کےبارے میں نازل ہوئی ہے، جنہیں رسول اللہ ﹲ (صلى الله عليه وسلم)نے بنو المصطلق کےصدقات وصول کرنے کے لئے بھیجا تھا۔ لیکن انہوں نے آکر یوں ہی رپورٹ دے دی کہ انہوں نے زکوٰۃ دینے سے انکار کر دیا ہے جس پر آپ ﹲ (صلى الله عليه وسلم) نے ان کے خلاف فوج کشی کا ارادہ فرما لیا، تاہم پھر پتہ لگ گیا کہ یہ بات غلط تھی اور ولید (رضي الله عنه) تو وہاں گئے ہی نہیں۔ لیکن سند اور امر واقعہ دونوں اعتبار سے یہ روایت صحیح نہیں ہے۔ اس لئے اسے ایک صحابئ رسول (صلى الله عليه وسلم)ﹲ پر چسپاں کرنا صحیح نہیں ہے۔ تاہم شان نزول کی بحث سے قطع نظر اس میں ایک نہایت ہی اہم اصول بیان فرمایا گیا ہے جس کی انفرادی اور اجتماعی دونوں سطحوں پر نہایت اہمیت ہے۔ ہر فرد اور ہر حکومت کی یہ ذمہ داری ہےکہ اس کے پاس جو بھی خبر یا اطلاع آئے بالخصوص بدکردار، فاسق اور مفسد قسم کے لوگوں کی طرف سے، تو پہلے اس کی تحقیق کی جائے تاکہ غلط فہمی میں کسی کے خلاف کوئی کاروائی نہ ہو۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāayyuhā alladhīna āmanū in jāakum fāsiqun binaba-in fatabayyanū an tuṣībū qawman bijahālatin fatuṣ'biḥū ʿalā mā faʿaltum nādimīna ","translations":["O you who believe","O you who believe","O you who believe","If","comes to you","a wicked person","with information","investigate","lest","you harm","a people","in ignorance","then you become","over","what","you have done","regretful","(6)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","in","jāakum","fāsiqun","binaba-in","fatabayyanū","an","tuṣībū","qawman","bijahālatin","fatuṣ'biḥū","ʿalā","mā","faʿaltum","nādimīna",null],"verseTiming":[[1,0,3120],[2,3120,4110],[3,4110,5480],[4,5480,6630],[5,6630,7830],[6,7830,10380],[7,10380,12190],[8,12190,13400],[9,13400,15470],[10,15470,19020],[11,19020,20040],[12,20040,21100],[13,21100,22920],[14,22920,25110],[15,25110,26290],[16,26290,26960],[17,26960,27240],[18,27240,28460],[19,28460,31055]]}}