{"name":"4:1","price":"اے لوگو! اپنے پروردگار سے ڈرو، جس نے تمہیں ایک جان سے پیدا کیا(1) اور اسی سے اس کی بیوی کو پیدا کرکے ان دونوں سے بہت سے مرد اور عورتیں پھیلا دیں، اس اللہ سے ڈرو جس کے نام پر ایک دوسرے سے مانگتے ہو اور رشتے ناطے توڑنے سے بھی بچو(2) بے شک اللہ تعالیٰ تم پر نگہبان ہے۔","arabic":"يَٰٓأَيُّهَا ٱلنَّاسُ ٱتَّقُواْ رَبَّكُمُ ٱلَّذِي خَلَقَكُم مِّن نَّفۡسٖ وَٰحِدَةٖ وَخَلَقَ مِنۡهَا زَوۡجَهَا وَبَثَّ مِنۡهُمَا رِجَالٗا كَثِيرٗا وَنِسَآءٗۚ وَٱتَّقُواْ ٱللَّهَ ٱلَّذِي تَسَآءَلُونَ بِهِۦ وَٱلۡأَرۡحَامَۚ إِنَّ ٱللَّهَ كَانَ عَلَيۡكُمۡ رَقِيبٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":494,"juzNumber":4,"footnotes":"(1) ایک جان سے مراد ابو البشر حضرت آدم (عليه السلام) ہیں اور«خَلَقَ مِنْهَا زَوْجَهَا»میں مِنْهَا سے وہی جان یعنی آدم (عليه السلام) مراد ہیں یعنی آدم (عليه السلام) سے ان کی زوج (بیوی) حضرت حوا کو پیدا کیا۔ حضرت حوا حضرت آدم (عليه السلام) سے کس طرح پیدا ہوئیں اس میں اختلاف ہے حضرت ابن عباس (رضي الله عنه) سے قول مروی ہے کہ حضرت حوا مرد (یعنی آدم عليه السلام) سے پیدا ہوئیں۔ یعنی ان کی بائیں پسلی سے۔ ایک حدیث میں کہا گیا ہے۔ «إِنَّ الْمَرْأَةَ خُلِقَتْ مِنْ ضِلَعٍ أَعْوَجَ وِإِنَّ أَعْوَجَ شَيْءٍ فِي الضِّلَعِ أَعْلاهُ» (صحیح بخاری، کتاب بدء الخلق، صحیح مسلم، کتاب الرضاع) ”کہ عورت پسلی سے پیدا کی گئی ہے اور پسلی میں سب سے ٹیڑھا حصہ، اس کا بالائی حصہ ہے۔ اگر تو اسے سیدھا کرنا جاہے تو توڑ بیٹھے گا اور اگر تو اس سے فائدہ اٹھانا چاہے تو کجی کے ساتھ ہی فائدہ اٹھا سکتا ہے“۔ بعض علماء نے اس حدیث سے استدلال کرتے ہوئے حضرت ابن عباس (رضي الله عنه) سے منقول رائے کی تائید کی ہے۔ قرآن کے الفاظ «خَلَقَ مِنْهَا» سے اسی موقف کی تائید ہوتی ہے حضرت حوا کی تخلیق اسی نفس واحدہ سے ہوئی جسے آدم کہا جاتا ہے۔\n(2) وَالأَرْحَامَ کا عطف اللہ پر ہے یعنی رحموں (رشتوں ناطوں) کو توڑنے سے بھی بچو۔ أَرْحَامٌ، رَحِمٌ کی جمع ہے۔ مراد رشتے داریاں ہیں جو رحم مادر کی بنیاد پر ہی قائم ہوتی ہیں۔ اس سے محرم اور غیر محرم دونوں رشتے مراد ہیں رشتوں ناطوں کا توڑنا سخت کبیرہ گناہ ہے جسے قطع رحمی کہتے ہیں۔ احادیث میں قرابت داریوں کو ہر صورت میں قائم رکھنے اور ان کے حقوق ادا کرنے کی بڑی تاکید اورفضیلت بیان کی گئی ہے جسے صلہ رحمی کہاجاتا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāayyuhā al-nāsu ittaqū rabbakumu alladhī khalaqakum min nafsin wāḥidatin wakhalaqa min'hā zawjahā wabatha min'humā rijālan kathīran wanisāan wa-ittaqū al-laha alladhī tasāalūna bihi wal-arḥāma inna al-laha kāna ʿalaykum raqīban ","translations":["O","mankind","Fear","your Lord","the One Who","created you","from","a soul","single","and created","from it","its mate","and dispersed","from both of them","men","many","and women","And fear","Allah","(through) Whom","you ask","[with it]","and the wombs","Indeed","Allah","is","over you","Ever-Watchful","(1)"],"transliterationArr":["yāayyuhā","al-nāsu","ittaqū","rabbakumu","alladhī","khalaqakum","min","nafsin","wāḥidatin","wakhalaqa","min'hā","zawjahā","wabatha","min'humā","rijālan","kathīran","wanisāan","wa-ittaqū","al-laha","alladhī","tasāalūna","bihi","wal-arḥāma","inna","al-laha","kāna","ʿalaykum","raqīban",null],"verseTiming":[[1,0,2900],[2,2900,4220],[3,4220,5070],[4,5070,6040],[5,6040,6840],[6,6840,7800],[7,7800,8680],[8,8680,10530],[9,10530,12450],[10,12450,13230],[11,13230,14070],[12,14070,15020],[13,15020,16490],[14,16490,17260],[15,17260,18360],[16,18360,19220],[17,19220,20190],[18,20190,21720],[19,21720,23410],[20,23410,26340],[21,26340,27570],[22,27570,28240],[23,28240,29130],[24,29130,32050],[25,32050,32660],[26,32660,35320],[27,35320,37010],[28,37010,37790],[29,37790,38450],[30,38450,39530],[31,39530,41105]]}}