{"name":"4:105","price":"یقیناً ہم نے تمہاری طرف حق کے ساتھ اپنی کتاب نازل فرمائی ہے تاکہ تم لوگوں میں اس چیز کے مطابق فیصلہ کرو جس سے اللہ نے تم کو شناسا کیا ہے(1) اور خیانت کرنے والوں(2) کے حمایتی نہ بنو۔","arabic":"إِنَّآ أَنزَلۡنَآ إِلَيۡكَ ٱلۡكِتَٰبَ بِٱلۡحَقِّ لِتَحۡكُمَ بَيۡنَ ٱلنَّاسِ بِمَآ أَرَىٰكَ ٱللَّهُۚ وَلَا تَكُن لِّلۡخَآئِنِينَ خَصِيمٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":598,"juzNumber":5,"footnotes":"(1) ان آیات (104 سے 113تک) کی شان نزول میں بتلایا گیا ہے کہ انصار کے قبیلہ بنی ظفر میں ایک شخص طعمہ یا بشیر بن ابیرق نے ایک انصاری کے زرہ چرالی، جب اس کا چرچا ہوا اور اس کو اپنی چوری کے بے نقاب ہونے کا خطرہ محسوس ہوا تو اس نے وہ زرہ ایک یہودی کے گھر پھینک دی اوربنی ظفر کے کچھ آدمیوں کو ساتھ لے کر نبی (صلى الله عليه وسلم) کی خدمت میں پہنچ گیا، ان سب نے کہا کہ زرہ چوری کرنے والا فلاں یہودی ہے۔ یہودی نبی (صلى الله عليه وسلم) کی خدمت میں حاضر ہوا اور اس نے کہا کہ بنی ابیرق نے زرہ چوری کر کے میرے گھر پھینک دی ہے۔ بنی ظفر اور بنی ابیرق (طعمہ یا بشیر وغیرہ) ہشیار تھے اور نبی (صلى الله عليه وسلم) کو باور کراتے رہے کہ چور یہودی ہی ہے اور وہ طعمہ پرالزام لگانے میں جھوٹا ہے، نبی (صلى الله عليه وسلم) بھی ان کی چکنی چپڑی باتوں سے متاثر ہوگئے اور قریب تھا کہ اس انصاری کو چوری کے الزام سے بری کر کے یہودی پر چوری کی فرد جرم عائد فرما دیتے کہ اللہ تعالیٰ نے یہ آیت نازل فرما دی۔ جس سے ایک بات یہ معلوم ہوئی کہ نبی (صلى الله عليه وسلم) بھی بہ حیثیت ایک انسان کے غلط فہمی میں پڑ سکتے ہیں۔ دوسری بات یہ معلوم ہوئی کہ آپ عالم الغیب نہیں تھے، ورنہ آپ (صلى الله عليه وسلم) پر فوراً صورتِ حال واضح ہو جاتی۔ تیسری بات یہ معلوم ہوئی کہ اللہ تعالیٰ اپنے پیغمبر (صلى الله عليه وسلم) کی حفاظت فرماتا ہے اور اگر کبھی حق کے پوشیدہ رہ جانے اور اس سے ادھر ادھر ہو جانے کا مرحلہ آجائے تو فوراً اللہ تعالیٰ اسے متنبہ فرما دیتا ہے اور اس کی اصلاح فرما دیتا ہے جیسا کہ عصمت انبیا کا تقاضا ہے۔ یہ وہ مقام عصمت ہے جو انبیا کے علاوہ کسی اور کو حاصل نہیں۔\n(2) اس سے مراد وہی بنی ابیرق ہے۔ جنہوں نے چوری خود کی لیکن اپنی چرب زبانی سے یہودی کو چور باور کرانے پر تلے ہوئے تھے۔ اگلے آیات میں بھی ان کے اور ان کے حمایتیوں کےغلط کردار کو نمایاں کرکے نبی (صلى الله عليه وسلم) کو خبردار کیا جا رہا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"innā anzalnā ilayka al-kitāba bil-ḥaqi litaḥkuma bayna al-nāsi bimā arāka al-lahu walā takun lil'khāinīna khaṣīman ","translations":["Indeed","We (have) sent down","to you","the Book","with the truth","so that you may judge","between","the people","with what","has shown you","Allah","And (do) not","be","for the deceitful","a pleader","(105)"],"transliterationArr":["innā","anzalnā","ilayka","al-kitāba","bil-ḥaqi","litaḥkuma","bayna","al-nāsi","bimā","arāka","al-lahu","walā","takun","lil'khāinīna","khaṣīman",null],"verseTiming":[[1,0,1210],[2,1210,2700],[3,2700,5300],[4,5300,6040],[5,6040,7080],[6,7080,8110],[7,8110,9010],[8,9010,9660],[9,9660,11130],[10,11130,12770],[11,12770,13620],[12,13620,16730],[13,16730,17300],[14,17300,17760],[15,17760,21200],[16,21200,22735]]}}