{"name":"4:106","price":"اور اللہ تعالیٰ سے بخشش مانگو!(1) بے شک اللہ تعالیٰ بخشش کرنے واﻻ، مہربانی کرنے واﻻ ہے>","arabic":"وَٱسۡتَغۡفِرِ ٱللَّهَۖ إِنَّ ٱللَّهَ كَانَ غَفُورٗا رَّحِيمٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":599,"juzNumber":5,"footnotes":"(1) یعنی بغیر تحقیق کئے آپ (صلى الله عليه وسلم) نے جو خیانت کرنے والوں کی حمایت کی ہے، اس پر اللہ سے مغفرت طلب کریں۔ اس سے معلوم ہوا کہ فریقین میں سے جب تک کسی کی بابت پورا یقین نہ ہو کہ وہ حق پر ہے، اس کی حمایت ووکالت کرنا جائز نہیں۔ علاوہ ازیں اگر کوئی فریق دھوکے اور فریب اور اپنی چرب زبانی سے عدالت یا حاکم مجاز سے اپنے حق میں فیصلہ کرا لے گا درآں حالیکہ وہ صاحب حق نہ ہو تو ایسے فیصلے کی عنداللہ کوئی اہمیت نہیں۔ اس بات کو نبی (صلى الله عليه وسلم) نے ایک حدیث میں اس طرح بیان فرمایا خبردار ! میں ایک انسان ہی ہوں اور جس طرح میں سنتا ہوں، اسی کی روشنی میں فیصلہ کرتا ہوں۔ ممکن ہے ایک شخص اپنی دلیل وحجت پیش کرنے میں تیز طرار اور ہشیار ہو اور میں اس کی گفتگو سے متاثر ہو کر اس کے حق میں فیصلہ کر دوں درآں حالیکہ وہ حق پر نہ ہو اور اس طرح میں دوسرے مسلمان کا حق اسے دے دوں، اسے یاد رکھنا چاہئے کہ یہ آگ کا ٹکڑا ہے۔ یہ اس کی مرضی ہے کہ اسے لے لے یا چھوڑ دے۔ (صحيح بخاري، كتاب الشهادة والحيل والأحكام- صحيح مسلم، كتاب الأقضية)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-is'taghfiri al-laha inna al-laha kāna ghafūran raḥīman ","translations":["And seek forgiveness","(of) Allah","Indeed","Allah","is","Oft-Forgiving","Most Merciful","(106)"],"transliterationArr":["wa-is'taghfiri","al-laha","inna","al-laha","kāna","ghafūran","raḥīman",null],"verseTiming":[[1,0,1310],[2,1310,4270],[3,4270,5240],[4,5240,6130],[5,6130,6820],[6,6820,7640],[7,7640,9125]]}}