{"name":"4:101","price":"جب تم سفر میں جا رہے ہو تو تم پر نمازوں کے قصر کرنے میں کوئی گناه نہیں، اگر تمہیں ڈر ہو کہ کافر تمہیں ستائیں گے(1) ، یقیناً کافر تمہارے کھلے دشمن ہیں۔","arabic":"وَإِذَا ضَرَبۡتُمۡ فِي ٱلۡأَرۡضِ فَلَيۡسَ عَلَيۡكُمۡ جُنَاحٌ أَن تَقۡصُرُواْ مِنَ ٱلصَّلَوٰةِ إِنۡ خِفۡتُمۡ أَن يَفۡتِنَكُمُ ٱلَّذِينَ كَفَرُوٓاْۚ إِنَّ ٱلۡكَٰفِرِينَ كَانُواْ لَكُمۡ عَدُوّٗا مُّبِينٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":594,"juzNumber":5,"footnotes":"(1) اس میں حالت سفرمیں نماز قصر کرنے (دوگانہ ادا کرنے) کی اجازت دی جا رہی ہے۔ ”إِنْ خِفْتُمْ“ (اگر تمہیں ڈر ہو) غالب احوال کے اعتبار سے ہے۔ کیونکہ اس وقت پورا عرب دارالحرب بنا ہوا تھا۔ کسی طرف کا بھی سفر خطرات سے خالی نہیں تھا۔ یعنی یہ شرط نہیں ہے کہ سفر میں خوف ہو تو قصر کی اجازت ہے۔ جیسے قرآن مجید میں اور بھی بعض مقامات پر اس قسم کی قیدیں بیان کی گئی ہیں جو اتفاقی یعنی غالب احوال کے اعتبار سے مثلاً: ”لا تَأْكُلُوا الرِّبَا أَضْعَافًا مُضَاعَفَةً“ ( آل عمران: 130)، ”وَلا تُكْرِهُوا فَتَيَاتِكُمْ عَلَى الْبِغَاءِ إِنْ أَرَدْنَ تَحَصُّنًا“ ( النور: 33) ”تم اپنی لونڈیوں کو بدکاری پر مجبور نہ کرو اگر وہ اس سے بچنا چاہیں“۔ چونکہ بچنا چاہتی تھیں، اس لئے اللہ نے اسے بیان فرما دیا۔ یہ نہیں کہ اگر بدکاری پر آمادہ ہوں تو پھر تمہارے لئے یہ جائز ہے کہ تم ان سے بدکاری کروا لیا کرو ”وَرَبَائِبُكُمُ اللاتِي فِي حُجُورِكُمْ مِنْ نِسَائِكُمُ“ (النسا: 23) ٰوَغَيْرهَا مِنَ الآيَاتِ۔ بعض صحابہ (رضي الله عنهم) کے ذہن میں بھی یہ اشکال آیا کہ اب تو امن ہے، ہمیں سفر میں نماز قصر نہیں کرنی چاہئے۔ نبی (صلى الله عليه وسلم) نے فرمایا یہ اللہ کی طرف سے تمہارے لئے صدقہ ہے، اس کے صدقے کو قبول کرو۔ (مسند احمد جلد 1، ص 25،36، وصحیح مسلم، کتاب المسافرین اور دیگر کتب حدیث )\nملحوظة: سفر کی مسافت اور ایام قصر کی تعیین میں کافی اختلاف ہے۔ امام شوکانی نے فرسخ یعنی ( کوس) والی روایت کو ترجیح دی ہے۔ (نیل الاوطار جلد 3 صفحہ220) اسی طرح بہت سے محققین علماء اس بات کو ضروری قرار دیتے ہیں کہ دوران سفر کسی ایک مقام پر تین یا چار دن سے زیادہ قیام کی نیت نہ ہو، اور اگر اس سے زیادہ قیام کی نیت ہو تو پھر قصر کی اجازت نہیں (تفصیل کے لئے ملاحظہ ہو مرعاۃ المفاتیح )","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-idhā ḍarabtum fī al-arḍi falaysa ʿalaykum junāḥun an taqṣurū mina al-ṣalati in khif'tum an yaftinakumu alladhīna kafarū inna al-kāfirīna kānū lakum ʿaduwwan mubīnan ","translations":["And when","you travel","in","the earth","then not","upon you","(is) any blame","that","you shorten","[of]","the prayer","if","you fear","that","(may) harm you","those who","disbelieved","Indeed","the disbelievers","are","for you","an enemy","open","(101)"],"transliterationArr":["wa-idhā","ḍarabtum","fī","al-arḍi","falaysa","ʿalaykum","junāḥun","an","taqṣurū","mina","al-ṣalati","in","khif'tum","an","yaftinakumu","alladhīna","kafarū","inna","al-kāfirīna","kānū","lakum","ʿaduwwan","mubīnan",null],"verseTiming":[[1,0,940],[2,940,1980],[3,1980,2220],[4,2220,3020],[5,3020,3800],[6,3800,4780],[7,4780,5760],[8,5760,6610],[9,6610,7680],[10,7680,8050],[11,8050,9150],[12,9150,9470],[13,9470,10720],[14,10720,11080],[15,11080,11870],[16,11870,12140],[17,12140,13880],[18,13880,14880],[19,14880,15750],[20,15750,17210],[21,17210,18630],[22,18630,19450],[23,19450,20060],[24,20060,20870],[25,20870,23385]]}}