{"name":"4:115","price":"جو شخص باوجود راه ہدایت کے واضح ہو جانے کے بھی رسول (صلی اللہ علیہ وسلم) کا خلاف کرے اور تمام مومنوں کی راه چھوڑ کر چلے، ہم اسے ادھر ہی متوجہ کردیں گے جدھر وه خود متوجہ ہو اور دوزخ میں ڈال دیں گے(1) ، وه پہنچنے کی بہت ہی بری جگہ ہے۔","arabic":"وَمَن يُشَاقِقِ ٱلرَّسُولَ مِنۢ بَعۡدِ مَا تَبَيَّنَ لَهُ ٱلۡهُدَىٰ وَيَتَّبِعۡ غَيۡرَ سَبِيلِ ٱلۡمُؤۡمِنِينَ نُوَلِّهِۦ مَا تَوَلَّىٰ وَنُصۡلِهِۦ جَهَنَّمَۖ وَسَآءَتۡ مَصِيرًا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":608,"juzNumber":5,"footnotes":"(1) ہدایت کے واضح ہو جانے کے بعد رسول اللہ (صلى الله عليه وسلم) کی مخالفت اور مومنین کا راستہ چھوڑ کر کسی اور راستے کی پیروی، دین اسلام سے خروج ہے جس پر یہاں جہنم کی وعید بیان فرمائی گئی ہے۔ مومنین سے مراد صحابہ کرام (رضي الله عنهم) ہیں جو دین اسلام کے اولین پیرو اور اس کی تعلیمات کا کامل نمونہ تھے۔ اور ان آیات کے نزول کے وقت جن کے سوا کوئی گروہ مومنین موجود نہ تھا کہ وہ مراد ہو۔ اس لئے رسول (صلى الله عليه وسلم) کی مخالفت اورغیر سبیل المومنین کا اتباع دونوں حقیقت میں ایک ہی چیز کا نام ہے۔ اس لئے صحابہ کرام (رضي الله عنهم) کے راستے اور منہاج سے انحراف بھی کفر وضلال ہی ہے۔ بعض علما نے سبیل المومنین سے مراد اجماع امت لیا یعنی اجماع امت سےانحراف بھی کفر ہے۔ اجماع امت کا مطلب ہے کسی مسئلے میں امت کے تمام علما وفقہا کا اتفاق۔ یا کسی مسئلے پر صحابہ کرام (رضي الله عنهم) کا اتفاق یہ دونوں صورتیں اجماع امت کی ہیں اور دونوں کا انکار یا ان میں سے کسی ایک کا انکار کفر ہے۔ تاہم صحابہ کرام (رضي الله عنهم) کا اتفاق تو بہت سے مسائل میں ملتا ہے یعنی اجماع کی یہ صورت تو ملتی ہے۔ لیکن اجماع صحابہ (رضي الله عنهم) کے بعد کسی مسئلے پر پوری امت کے اجماع واتفاق کے دعوے تو بہت سے مسائل میں کئے گئے ہیں لیکن فی الحقیقت ایسے اجماعی مسائل بہت ہی کم ہیں۔ جن میں فی الواقع امت کے تمام علما وفقہا کا اتفاق ہو، تاہم ایسے جو مسائل بھی ہیں، ان کا انکار بھی صحابہ (رضي الله عنهم) کے اجماع کے انکار کی طرح، کفر ہے، اس لئے صحیح حدیث میں ہے اللہ تعالیٰ میری امت کو گمراہی پر اکھٹا نہیں کرے گا اور جماعت پر اللہ کا ہاتھ ہے۔ (صحیح ترمذی للالبانی حدیث نمبر 2167)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waman yushāqiqi al-rasūla min baʿdi mā tabayyana lahu al-hudā wayattabiʿ ghayra sabīli al-mu'minīna nuwallihi mā tawallā wanuṣ'lihi jahannama wasāat maṣīran ","translations":["And whoever","opposes","the Messenger","from","after","what","(has) become clear","to him","(of) the guidance","and he follows","other than","(the) way","(of) the believers","We will turn him","(to) what","he (has) turned","and We will burn him","(in) Hell","and evil it is","(as) a destination","(115)"],"transliterationArr":["waman","yushāqiqi","al-rasūla","min","baʿdi","mā","tabayyana","lahu","al-hudā","wayattabiʿ","ghayra","sabīli","al-mu'minīna","nuwallihi","mā","tawallā","wanuṣ'lihi","jahannama","wasāat","maṣīran",null],"verseTiming":[[1,0,900],[2,900,2120],[3,2120,3180],[4,3180,3980],[5,3980,4590],[6,4590,4960],[7,4960,5940],[8,5940,6440],[9,6440,7270],[10,7270,8550],[11,8550,9050],[12,9050,10020],[13,10020,12600],[14,12600,13860],[15,13860,14370],[16,14370,15410],[17,15410,16660],[18,16660,17860],[19,17860,18230],[20,18230,19270],[21,19270,20540],[22,20540,22350],[23,22350,25630],[24,25630,27325]]}}