{"name":"4:11","price":"اللہ تعالیٰ تمہیں تمہاری اوﻻد کے بارے میں حکم کرتا ہے کہ ایک لڑکے کا حصہ دو لڑکیوں کے برابر ہے(1) اور اگر صرف لڑکیاں ہی ہوں اور دو سے زیاده ہوں تو انہیں مال متروکہ کا دو تہائی ملے گا(2)۔ اور اگر ایک ہی لڑکی ہو تو اس کے لئے آدھا ہے اور میت کے ماں باپ میں سے ہر ایک کے لئے اس کے چھوڑے ہوئے مال کا چھٹا حصہ ہے، اگر اس (میت) کی اوﻻد ہو(3)، اور اگر اوﻻد نہ ہو اور ماں باپ وارث ہوتے ہوں تو اس کی ماں کے لئے تیسرا حصہ ہے(4)، ہاں اگر میت کے کئی بھائی ہوں تو پھر اس کی ماں کا چھٹا حصہ ہے(5)۔ یہ حصے اس وصیت (کی تکمیل) کے بعد ہیں جو مرنے واﻻ کر گیا ہو یا ادائے قرض کے بعد، تمہارے باپ ہوں یا تمہارے بیٹے تمہیں نہیں معلوم کہ ان میں سے کون تمہیں نفع پہچانے میں زیاده قریب ہے(6)، یہ حصے اللہ تعالیٰ کی طرف سے مقرر کرده ہیں بے شک اللہ تعالیٰ پورے علم اور کامل حکمتوں واﻻ ہے۔","arabic":"يُوصِيكُمُ ٱللَّهُ فِيٓ أَوۡلَٰدِكُمۡۖ لِلذَّكَرِ مِثۡلُ حَظِّ ٱلۡأُنثَيَيۡنِۚ فَإِن كُنَّ نِسَآءٗ فَوۡقَ ٱثۡنَتَيۡنِ فَلَهُنَّ ثُلُثَا مَا تَرَكَۖ وَإِن كَانَتۡ وَٰحِدَةٗ فَلَهَا ٱلنِّصۡفُۚ وَلِأَبَوَيۡهِ لِكُلِّ وَٰحِدٖ مِّنۡهُمَا ٱلسُّدُسُ مِمَّا تَرَكَ إِن كَانَ لَهُۥ وَلَدٞۚ فَإِن لَّمۡ يَكُن لَّهُۥ وَلَدٞ وَوَرِثَهُۥٓ أَبَوَاهُ فَلِأُمِّهِ ٱلثُّلُثُۚ فَإِن كَانَ لَهُۥٓ إِخۡوَةٞ فَلِأُمِّهِ ٱلسُّدُسُۚ مِنۢ بَعۡدِ وَصِيَّةٖ يُوصِي بِهَآ أَوۡ دَيۡنٍۗ ءَابَآؤُكُمۡ وَأَبۡنَآؤُكُمۡ لَا تَدۡرُونَ أَيُّهُمۡ أَقۡرَبُ لَكُمۡ نَفۡعٗاۚ فَرِيضَةٗ مِّنَ ٱللَّهِۗ إِنَّ ٱللَّهَ كَانَ عَلِيمًا حَكِيمٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":504,"juzNumber":4,"footnotes":"(1) اس کی حکمت اور اس کا مبنی برعدل وانصاف ہونا ہم واضح کر آئے ہیں۔ ورثا میں لڑکی اور لڑکے دونوں ہوں تو پھر اس اصول کے مطابق تقسیم ہوگی۔ لڑکے چھوٹے ہوں یا بڑے، اسی طرح لڑکیاں چھوٹی ہو یا بڑی سب وراث ہوں گی۔ حتی کہ جنين( ماں کے پیٹ میں زیر پرورش بچہ) بھی وراث ہوگا۔ البتہ کافر اولاد وارث نہ ہوگی۔\n(2) یعنی بیٹا کوئی نہ ہو تو مال کا دو تہائی (یعنی کل مال کے تین حصے کرکے دو حصے) دو سے زائد لڑکیوں کو دیئے جائیں گے اور اگر صرف دو ہی لڑکیاں ہوں، تب بھی انہیں دو تہائی حصہ ہی دیا جائے گا، جیسا کہ حدیث میں آتا ہے کہ سعد بن ربیع (رضي الله عنه) احد میں شہید ہوگئے اور ان کی دو لڑکیاں تھیں۔ مگر سعد کے سارے مال پر ان کے ایک بھائی نے قبضہ کر لیا تو نبی (صلى الله عليه وسلم) نے ان دونوں لڑکیوں کو ان کے چچا سے دو ثلث مال دلوایا (ترمذی، ابو داود، ابن ماجہ، کتاب الفرائض) علاوہ ازیں سورۂ نساء کے آخر میں بتلایا گیا ہے کہ اگر کسی مرنے والے کی وارث صرف دو بہنیں ہوں تو ان کے لئے بھی دو تہائی حصہ ہے لہٰذا جب دو بہنیں دو تہائی مال کی وارث ہوں گی تو دو بیٹیاں بطریق اولیٰ دو تہائی مال کی وارث ہوں گی جس طرح دو بہنوں سے زیادہ ہونے کی صورت میں انہیں دو سے زیادہ بیٹیوں کے حکم میں رکھا گیا ہے (فتح القدیر) خلاصۂ مطلب یہ ہوا کہ دو یا دو سے زائد لڑکیاں ہوں، تو دونوں صورتوں میں مال متروکہ سے دو تہائی لڑکیوں کا حصہ ہوگا، باقی مال عصبہ میں تقسیم ہوگا۔\n(3) ماں باپ کے حصے کی تین صورتیں بیان کی گئی ہیں یہ پہلی صورت ہے کہ مرنے والے کی اگر اولاد بھی ہو تو مرنے والے کے ماں باپ میں سے ہر ایک کو ایک ایک سدس ملے گا یعنی باقی دو تہائی مال اولاد پر تقسیم ہو جائے گا البتہ اگر مرنے والے کی اولاد صرف ایک بیٹی ہو تو اس میں سے چونکہ صرف نصف مال (یعنی چھ حصوں میں سے 3 حصے) بیٹی کے ہوں گے اور ایک سدس (چھٹا حصہ) ماں کو اور ایک سدس باپ کو دینے کے بعد مزید ایک سدس باقی بچ جائے گا اس لئے بچنے والا یہ سدس بطور عصبہ باپ کے حصہ میں جائے گا یعنی اس صورت میں باپ کو دو سدس ملیں گے، ایک باپ کی حیثیت سے دوسرے، عصبہ ہونے کی حیثیت سے۔\n(4) یہ دوسری صورت ہے کہ مرنے والے کی اولاد نہیں ہے (یاد رہے کہ پوتا پوتی بھی اولاد میں اجماعاً شامل ہیں) اس صورت میں ماں کے لئے تیسرا حصہ اور باقی دو حصے (جو ماں کے حصے میں دو گنا ہیں) باپ کو بطورعصبہ ملیں گے اور اگر ماں باپ کے ساتھ مرنے والے مرد کی بیوی یا مرنے والی عورت کا شوہر بھی زندہ ہے تو راجح قول کے مطابق بیوی یا شوہر کا حصہ (جس کی تفصیل آرہی ہے) نکال کر باقی ماندہ مال میں سے ماں کے لئے ثلث (تیسرا حصہ) اورباقی باپ کے لئے ہوگا۔\n(5) تیسری صورت یہ ہے کہ ماں باپ کے ساتھ، مرنے والے کے بھائی بہن زندہ ہیں، وہ بھائی چاہے سگے (عینی) ہوں یعنی ایک ہی ماں باپ کی اولاد ہوں۔ یا باپ ایک ہو، مائیں مختلف ہوں یعنی علاتی بھائی بہن ہوں یا ماں ایک ہو، باپ مختلف ہوں یعنی اخیافی بھائی بہن ہوں۔ اگرچہ یہ بھائی بہن میت کے باپ کی موجودگی میں وراثت کے حق دار نہیں ہوں گے لیکن ماں کے لئے حجب (نقصان کا سبب) بن جائیں گے یعنی جب ایک سے زیادہ ہوں گے تو ماں کے ثلث (تیسرے حصے) کو سدس (چھٹے حصے) میں تبدیل کر دیں گے۔ باقی سارا مال ( 5/6) باپ کے حصہ میں چلا جائے گا۔ بشرطیکہ کوئی اور وارث نہ ہو۔ حافظ ابن کثیر لکھتے ہیں کہ جمہور کے نزدیک دو بھائیوں کا بھی وہی حکم ہے جو دو سے زیادہ بھائیوں کا مذکور ہے۔ اس کا مطلب یہ ہوا کہ اگر ایک بھائی یا بہن ہو تو اس صورت میں مال میں ماں کا حصہ ثلث برقرار رہے گاوہ سدس میں تبدیل نہیں ہوگا۔ (تفسیر ابن کثیر)\n(6) اس لئے تم اپنی سمجھ کے مطابق وراثت تقسیم مت کرو، بلکہ اللہ کے حکم کے مطابق جس کا جتنا حصہ مقرر کر دیا گیا ہے،وہ ان کو دو۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yūṣīkumu al-lahu fī awlādikum lildhakari mith'lu ḥaẓẓi al-unthayayni fa-in kunna nisāan fawqa ith'natayni falahunna thuluthā mā taraka wa-in kānat wāḥidatan falahā al-niṣ'fu wali-abawayhi likulli wāḥidin min'humā al-sudusu mimmā taraka in kāna lahu waladun fa-in lam yakun lahu waladun wawarithahu abawāhu fali-ummihi al-thuluthu fa-in kāna lahu ikh'watun fali-ummihi al-sudusu min baʿdi waṣiyyatin yūṣī bihā aw daynin ābāukum wa-abnāukum lā tadrūna ayyuhum aqrabu lakum nafʿan farīḍatan mina al-lahi inna al-laha kāna ʿalīman ḥakīman ","translations":["Instructs you","Allah","concerning","your children ","for the male","like","(the) portion","(of) two females","But if","there are","(only) women","more (than)","two","then for them","two thirds","(of) what","he left","And if","(there) is","(only) one","then for her","(is) half","And for his parents","for each","one","of them","a sixth","of what","(is) left","if","is","for him","a child","But if","not","is","for him","any child","and inherit[ed] him","his parents","then for his mother","(is) one third","And if","are","for him","brothers and sisters","then for his mother","(is) the sixth","from","after","any will","he has made","[of which]","or","any debt","Your parents","and your children ","not","you know","which of them","(is) nearer","to you","(in) benefit","An obligation","from","Allah","Indeed","Allah","is","All-Knowing","All-Wise","(11)"],"transliterationArr":["yūṣīkumu","al-lahu","fī","awlādikum","lildhakari","mith'lu","ḥaẓẓi","al-unthayayni","fa-in","kunna","nisāan","fawqa","ith'natayni","falahunna","thuluthā","mā","taraka","wa-in","kānat","wāḥidatan","falahā","al-niṣ'fu","wali-abawayhi","likulli","wāḥidin","min'humā","al-sudusu","mimmā","taraka","in","kāna","lahu","waladun","fa-in","lam","yakun","lahu","waladun","wawarithahu","abawāhu","fali-ummihi","al-thuluthu","fa-in","kāna","lahu","ikh'watun","fali-ummihi","al-sudusu","min","baʿdi","waṣiyyatin","yūṣī","bihā","aw","daynin","ābāukum","wa-abnāukum","lā","tadrūna","ayyuhum","aqrabu","lakum","nafʿan","farīḍatan","mina","al-lahi","inna","al-laha","kāna","ʿalīman","ḥakīman",null],"verseTiming":[[1,0,1380],[2,1380,2280],[3,2280,3670],[4,3670,5090],[5,5090,6180],[6,6180,6790],[7,6790,7510],[8,7510,11140],[9,11140,12340],[10,12340,13370],[11,13370,16410],[12,16410,16930],[13,16930,18070],[14,18070,19430],[15,19430,20390],[16,20390,20770],[17,20770,21970],[18,21970,23380],[19,23380,24270],[20,24270,26190],[21,26190,26740],[22,26740,28220],[23,28220,30060],[24,30060,30900],[25,30900,31790],[26,31790,33270],[27,33270,34130],[28,34130,35440],[29,35440,36050],[30,36050,37160],[31,37160,37720],[32,37720,38460],[33,38460,39410],[34,39410,39820],[35,39820,40400],[36,40400,40860],[37,40860,41700],[38,41700,42840],[39,42840,45050],[40,45050,46080],[41,46080,47670],[42,47670,48470],[43,48470,50160],[44,50160,50780],[45,50780,52910],[46,52910,54440],[47,54440,56640],[48,56640,57520],[49,57520,58920],[50,58920,59590],[51,59590,61030],[52,61030,62200],[53,62200,63950],[54,63950,64360],[55,64360,66630],[56,66630,69400],[57,69400,72450],[58,72450,72850],[59,72850,73980],[60,73980,75130],[61,75130,75920],[62,75920,76670],[63,76670,78070],[64,78070,79220],[65,79220,80580],[66,80580,83350],[67,83350,84670],[68,84670,85500],[69,85500,86170],[70,86170,87250],[71,87250,88945]]}}