{"name":"4:125","price":"باعتبار دین کے اس سے اچھا کون ہے؟ جو اپنے کو اللہ کے تابع کر دے اور ہو بھی نیکو کار، ساتھ ہی یکسوئی والے ابراہیم کے دین کی پیروی کر رہا ہو اور ابراہیم (علیہ السلام) کو اللہ تعالیٰ نے اپنا دوست بنا لیا ہے۔(1)","arabic":"وَمَنۡ أَحۡسَنُ دِينٗا مِّمَّنۡ أَسۡلَمَ وَجۡهَهُۥ لِلَّهِ وَهُوَ مُحۡسِنٞ وَٱتَّبَعَ مِلَّةَ إِبۡرَٰهِيمَ حَنِيفٗاۗ وَٱتَّخَذَ ٱللَّهُ إِبۡرَٰهِيمَ خَلِيلٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":618,"juzNumber":5,"footnotes":"(1) یہاں کامیابی کا ایک معیار اور اس کا ایک نمونہ بیان کیا جارہا ہے۔ معیار یہ ہے کہ اپنے کو اللہ کے سپرد کردے، محسن بن جائے اور ملت ابراہیم (عليه السلام) کی پیروی کرے اور نمونہ حضرت ابراہیم (عليه السلام) کا ہے جن کو اللہ تعالیٰ نے اپنا خلیل بنایا۔ خلیل کے معنی ہیں کہ جس کے دل میں اللہ تعالیٰ کی محبت اس طرح راسخ ہو جائے کہ کسی اور کے لئے اس میں جگہ نہ رہے۔ خلیل (بروزن فعیل) بمعنی فاعل ہے جیسے علیم بمعنی عالم اور بعض کہتے ہیں کہ بمعنی مفعول ہے۔ جیسے حبیب بمعنی محبوب اور حضرت ابراہیم (عليه السلام) یقیناً اللہ کے محب بھی تھے اور محبوب بھی علیہ الصلاۃ والسلام (فتح القدیر )۔ اور نبی (صلى الله عليه وسلم) نے فرمایا ہے: اللہ نے مجھےبھی خلیل بنایا ہے جس طرح اس نے ابراہیم (عليه السلام) کو خلیل بنایا۔“ (صحيح مسلم، كتاب المساجد)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waman aḥsanu dīnan mimman aslama wajhahu lillahi wahuwa muḥ'sinun wa-ittabaʿa millata ib'rāhīma ḥanīfan wa-ittakhadha al-lahu ib'rāhīma khalīlan ","translations":["And who","(is) better","(in) religion","than (one) who","submits","his face","to Allah","and he","(is) a good-doer","and follows","(the) religion","(of) Ibrahim","(the) upright","And was taken","(by) Allah","Ibrahim","(as) a friend","(125)"],"transliterationArr":["waman","aḥsanu","dīnan","mimman","aslama","wajhahu","lillahi","wahuwa","muḥ'sinun","wa-ittabaʿa","millata","ib'rāhīma","ḥanīfan","wa-ittakhadha","al-lahu","ib'rāhīma","khalīlan",null],"verseTiming":[[1,0,710],[2,710,1470],[3,1470,2130],[4,2130,4540],[5,4540,5390],[6,5390,6300],[7,6300,7310],[8,7310,7960],[9,7960,9420],[10,9420,10370],[11,10370,11220],[12,11220,12530],[13,12530,13740],[14,13740,15220],[15,15220,15990],[16,15990,17360],[17,17360,18915]]}}