{"name":"4:129","price":"تم سے یہ تو کبھی نہ ہو سکے گا کہ اپنی تمام بیویوں میں ہر طرح عدل کرو، گو تم اس کی کتنی ہی خواہش وکوشش کر لو، اس لئے بالکل ہی ایک کی طرف مائل ہو کر دوسری کو ادھڑ لٹکتی ہوئی نہ چھوڑو(1) اور اگر تم اصلاح کرو اور تقویٰ اختیار کرو تو، بے شک اللہ تعالیٰ بڑی مغفرت اور رحمت واﻻ ہے۔","arabic":"وَلَن تَسۡتَطِيعُوٓاْ أَن تَعۡدِلُواْ بَيۡنَ ٱلنِّسَآءِ وَلَوۡ حَرَصۡتُمۡۖ فَلَا تَمِيلُواْ كُلَّ ٱلۡمَيۡلِ فَتَذَرُوهَا كَٱلۡمُعَلَّقَةِۚ وَإِن تُصۡلِحُواْ وَتَتَّقُواْ فَإِنَّ ٱللَّهَ كَانَ غَفُورٗا رَّحِيمٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":622,"juzNumber":5,"footnotes":"(1) یہ ایک دوسری صورت ہے کہ ایک شخص کی ایک سے زیادہ بیویاں ہوں تو دلی تعلق اور محبت میں وہ سب کے ساتھ یکساں سلوک نہیں کر سکتا۔ کیونکہ محبت، فعل قلب ہے جس پر کسی کو اختیار نہیں ہے۔ خود نبی (صلى الله عليه وسلم) کو بھی اپنی بیویوں میں سب سے زیادہ محبت حضرت عائشہ (رضی الله عنها) سے تھی۔ خواہش کے باوجود انصاف نہ کرنے سے مطلب یہی قلبی میلان اور محبت میں عدم مساوات ہے۔ اگر یہ قلبی محبت ظاہری حقوق کی مساوات میں مانع نہ بنے تو عنداللہ قابل مواخذہ نہیں۔ جس طرح کہ نبی (صلى الله عليه وسلم) نے اس کا نہایت عمدہ نمونہ پیش فرمایا۔ لیکن اکثر لوگ اس قلبی محبت کی وجہ سے دوسری بیویوں کے حقوق کی ادائیگی میں بہت کوتاہی کرتے ہیں اور ظاہری طور پر بھی محبوب بیوی کی طرح دوسری بیویوں کے حقوق ادا نہیں کرتے اور انہیں معلقہ (درمیان میں لٹکی ہوئی) بنا کر رکھ چھوڑتے ہیں، نہ انہیں طلاق دیتے ہیں نہ حقوق زوجیت ادا کرتے ہیں۔ یہ انتہائی ظلم ہے جس سے یہاں روکا گیا ہے اور نبی (صلى الله عليه وسلم) نے بھی فرمایا ہےجس شخص کی دو بیویاں ہوں اور وہ ایک کی طرف ہی مائل ہو (یعنی دوسری کو نظر انداز کئے رکھے) تو قیامت کے دن وہ اس طرح آئے گا کہ اس کے جسم کا ایک حصہ (یعنی نصف) ساقط ہوگا، (ترمذي، كتاب النكاح)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walan tastaṭīʿū an taʿdilū bayna al-nisāi walaw ḥaraṣtum falā tamīlū kulla al-mayli fatadharūhā kal-muʿalaqati wa-in tuṣ'liḥū watattaqū fa-inna al-laha kāna ghafūran raḥīman ","translations":["And never","will you be able","to","deal justly","between","[the] women","even if","you desired","but (do) not","incline","(with) all","the inclination","and leave her (the other)","like the suspended one","And if","you reconcile","and fear (Allah)","then indeed","Allah","is","Oft-Forgiving","Most Merciful","(129)"],"transliterationArr":["walan","tastaṭīʿū","an","taʿdilū","bayna","al-nisāi","walaw","ḥaraṣtum","falā","tamīlū","kulla","al-mayli","fatadharūhā","kal-muʿalaqati","wa-in","tuṣ'liḥū","watattaqū","fa-inna","al-laha","kāna","ghafūran","raḥīman",null],"verseTiming":[[1,0,1060],[2,1060,3820],[3,3820,4870],[4,4870,5940],[5,5940,6470],[6,6470,9550],[7,9550,10010],[8,10010,11440],[9,11440,12010],[10,12010,13010],[11,13010,13630],[12,13630,14450],[13,14450,15810],[14,15810,17870],[15,17870,18570],[16,18570,20070],[17,20070,21110],[18,21110,22360],[19,22360,23140],[20,23140,23800],[21,23800,24590],[22,24590,26125]]}}