{"name":"4:127","price":"آپ سے عورتوں کے بارے میں حکم دریافت کرتے ہیں(1) ، آپ کہہ دیجئے! کہ خود اللہ ان کے بارے میں حکم دے رہا ہے اور قرآن کی وه آیتیں جو تم پر ان یتیم لڑکیوں کے بارے میں پڑھی جاتی ہیں جنہیں ان کا مقرر حق تم نہیں دیتے(2) اور انہیں اپنے نکاح میں ﻻنے کی رغبت رکھتے ہو(3) اور کمزور بچوں کے بارے میں اور اس بارے میں کہ یتیموں کی کارگزاری انصاف کے ساتھ کرو(4)۔ تم جو نیک کام کرو، بے شبہ اللہ اسے پوری طرح جاننے واﻻ ہے۔","arabic":"وَيَسۡتَفۡتُونَكَ فِي ٱلنِّسَآءِۖ قُلِ ٱللَّهُ يُفۡتِيكُمۡ فِيهِنَّ وَمَا يُتۡلَىٰ عَلَيۡكُمۡ فِي ٱلۡكِتَٰبِ فِي يَتَٰمَى ٱلنِّسَآءِ ٱلَّٰتِي لَا تُؤۡتُونَهُنَّ مَا كُتِبَ لَهُنَّ وَتَرۡغَبُونَ أَن تَنكِحُوهُنَّ وَٱلۡمُسۡتَضۡعَفِينَ مِنَ ٱلۡوِلۡدَٰنِ وَأَن تَقُومُواْ لِلۡيَتَٰمَىٰ بِٱلۡقِسۡطِۚ وَمَا تَفۡعَلُواْ مِنۡ خَيۡرٖ فَإِنَّ ٱللَّهَ كَانَ بِهِۦ عَلِيمٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":620,"juzNumber":5,"footnotes":"(1) عورتوں کے بارے میں جو سوالات ہوتے رہتے تھے، یہاں سے ان کے جوابات دیئے جا رہے ہیں۔\n(2) ”وَمَا يُتْلَى عَلَيْكُمْ“ اس کا عطف ”اللهُ يُفْتِيكُمْ“ پر ہے یعنی اللہ تعالیٰ ان کی بابت وضاحت فرماتا ہے اور کتاب اللہ کی وہ آیات وضاحت کرتی ہیں جو اس سے قبل یتیم لڑکیوں کے بارے میں نازل ہو چکی ہیں، مراد ہے سورۂ نساء کی آیت 3 جس میں ان لوگوں کو اس بے انصافی سے روکا گیا ہے کہ وہ یتیم لڑکی سے ان کے حسن وجمال کی وجہ سے شادی تو کر لیتے ہیں لیکن مہر مثل دینے سے گریز کرتے تھے۔\n(3) اس کے دو ترجمے کئے گئے ہیں، ایک تو یہی جو مرحوم مترجم نے کیا ہے، اس میں ”فی“ کا لفظ محذوف ہے۔ اس کا دوسرا ترجمہ ”عن“ کا لفظ محذوف مان کر کیا گیا ہے یعنی ”تَرْغَبُونَ عَنْ أَنْ تَنْكِحُوهُنَّ“ (تمہیں ان سے نکاح کرنے کی رغبت نہ ہو) رَغِبَ کا صلہ عَنْ آئے تو معنی اعراض اور بے رغبتی کے ہوتے ہیں۔ جیسے” وَمَنْ يَرْغَبُ عَنْ مِلَّةِ إِبْرَاهِيمَ“ میں ہے یہ گویا دوسری صورت بیان کی گئی ہے کہ یتیم لڑکی بعض دفعہ بدصورت ہوتی تو اس کے ولی یا اس کے ساتھ وراثت میں شریک دوسرے ورثا خود بھی اس کے ساتھ نکاح کرنا پسند نہ کرتے اور کسی دوسری جگہ بھی اس کا نکاح نہ کرتے، تاکہ کوئی اور شخص اس کے حصہ جائیداد میں شریک نہ بنے۔ اللہ تعالیٰ نے پہلی صورت کی طرح ظلم کی اس دوسری صورت سے بھی منع فرمایا۔\n(4) اس کا عطف ”يَتَامَى النِّسَاءِ“ پر ہے۔ یعنی ”وَمَا يُتْلَى عَلَيْكُمْ فِي يَتَامَى النِّسَاءِ وَفِي الْمُسْتَضْعَفِينَ مِنَ الْوِلْدَانِ“ یتیم لڑکیوں کے بارے میں تم پر جو پڑھا جاتا ہے۔ (سورۃ النساء کی آیت نمبر 3) اور کمزور بچوں کی بابت جو پڑھا جاتا ہے اس سے مراد قرآن کا حکم ”يُوصِيكُمُ اللَّهُ فِي أَوْلادِكُمْ“ ہے جس میں بیٹوں کے ساتھ بیٹیوں کو بھی وراثت میں حصہ دار بنایا گیا۔ جب کہ زمانۂ جاہلیت میں صرف بڑے لڑکوں کو ہی وارث سمجھا جاتاتھا، چھوٹے کمزور بچے اور عورتیں وراثت سے محروم ہوتی تھیں۔ شریعت نے سب کو وارث قرار دیا۔\n(5) اس کا عطف بھی ”يَتَامَى النِّسَاءِ“ پر ہے۔ یعنی کتاب اللہ کا یہ حکم بھی تم پر پڑھا جاتا ہے کہ یتیموں کے ساتھ انصاف کا معاملہ کرو۔ یتیم بچی صاحب جمال ہو تب بھی اور بدصورت ہو تب بھی۔ دونوں صورتوں میں انصاف کرو (جیسا کہ تفصیل گزری)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wayastaftūnaka fī al-nisāi quli al-lahu yuf'tīkum fīhinna wamā yut'lā ʿalaykum fī al-kitābi fī yatāmā al-nisāi allātī lā tu'tūnahunna mā kutiba lahunna watarghabūna an tankiḥūhunna wal-mus'taḍʿafīna mina al-wil'dāni wa-an taqūmū lil'yatāmā bil-qis'ṭi wamā tafʿalū min khayrin fa-inna al-laha kāna bihi ʿalīman ","translations":["And they seek your ruling","concerning","the women","Say","Allah","gives you the ruling","about them","and what","is recited","to you","in","the Book","concerning","orphans","(of) girls","(to) whom","not","(do) you give them","what","is ordained","for them","and you desire","to","marry them","and the ones who are weak","of","the children","and to","stand","for orphans","with justice","And whatever","you do","of","good","then indeed","Allah","is","about it","All-Knowing","(127)"],"transliterationArr":["wayastaftūnaka","fī","al-nisāi","quli","al-lahu","yuf'tīkum","fīhinna","wamā","yut'lā","ʿalaykum","fī","al-kitābi","fī","yatāmā","al-nisāi","allātī","lā","tu'tūnahunna","mā","kutiba","lahunna","watarghabūna","an","tankiḥūhunna","wal-mus'taḍʿafīna","mina","al-wil'dāni","wa-an","taqūmū","lil'yatāmā","bil-qis'ṭi","wamā","tafʿalū","min","khayrin","fa-inna","al-laha","kāna","bihi","ʿalīman",null],"verseTiming":[[1,0,1850],[2,1850,2090],[3,2090,5610],[4,5610,6550],[5,6550,7340],[6,7340,8430],[7,8430,9860],[8,9860,10430],[9,10430,11190],[10,11190,12070],[11,12070,12440],[12,12440,13370],[13,13370,13750],[14,13750,14490],[15,14490,17530],[16,17530,18440],[17,18440,19130],[18,19130,22060],[19,22060,23070],[20,23070,23380],[21,23380,25380],[22,25380,25710],[23,25710,26400],[24,26400,27570],[25,27570,30360],[26,30360,31680],[27,31680,32720],[28,32720,35380],[29,35380,37350],[30,37350,37720],[31,37720,38930],[32,38930,39910],[33,39910,40980],[34,40980,42380],[35,42380,43410],[36,43410,44370],[37,44370,45370],[38,45370,45680],[39,45680,46580],[40,46580,48400],[41,48400,49240],[42,49240,49870],[43,49870,50470],[44,50470,52055]]}}