{"name":"4:130","price":"اور اگر میاں بیوی جدا ہو جائیں تو اللہ تعالیٰ اپنی وسعت سے ہر ایک کو بے نیاز کر دے گا(1) ، اللہ تعالیٰ وسعت واﻻ حکمت واﻻ ہے۔","arabic":"وَإِن يَتَفَرَّقَا يُغۡنِ ٱللَّهُ كُلّٗا مِّن سَعَتِهِۦۚ وَكَانَ ٱللَّهُ وَٰسِعًا حَكِيمٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":623,"juzNumber":5,"footnotes":"(1) یہ تیسری صورت ہے کہ کوشش کے باوجود اگرنباہ کی صورت نہ بنے تو پھر طلاق کے ذریعے سے علیحدگی اختیار کر لی جائے۔ ممکن ہے علیحدگی کے بعد مرد کو مطلوبہ صفات والی بیوی اور عورت کو مطلوبہ صفات والا مرد مل جائے۔ اسلام میں طلاق کو اگرچہ سخت ناپسند کیا گیا ہے۔ ایک حدیث میں ”أَبْغَضُ الْحَلالِ إِلَى اللهِ الطَّلاقُ“ (رواه أبو داود، مشكاة) ”طلاق حلال تو ہے لیکن یہ ایسا حلال ہے جو اللہ کو سخت ناپسند ہے“۔ اس کے باوجود اللہ نے اس کی اجازت دی ہے۔ اس لئے کہ بعض دفعہ حالات ایسے موڑ پر پہنچ جاتے ہیں کہ اس کے بغیر چارہ نہیں ہوتا اور فریقین کی بہتری اسی میں ہوتی ہے کہ وہ ایک دوسرے سے علیحدگی اختیار کر لیں۔ مذکورہ حدیث میں صحت اسناد کے اعتبار سے اگرچہ ضعف ہے تاہم قرآن وسنت کی نصوص سے یہ واضح ہے کہ یہ حق اسی وقت استعمال کرنا چاہئے جب نباہ کی کوئی صورت کسی طرح بھی نہ بن سکے۔\nملحوظة:حدیث مذکور (أَبْغَضُ الْحَلالِ ...) کو شیخ البانی نے ضعیف قرار دیا ہے (ارواء الغلیل، نمبر 2040) تاہم عذر شرعی کے بغیر طلاق کے ناپسندیدہ ہونے میں کوئی کلام نہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-in yatafarraqā yugh'ni al-lahu kullan min saʿatihi wakāna al-lahu wāsiʿan ḥakīman ","translations":["And if","they separate","will be enriched","(by) Allah","each (of them)","from","His abundance","and is","Allah","All-Encompassing","All-Wise","(130)"],"transliterationArr":["wa-in","yatafarraqā","yugh'ni","al-lahu","kullan","min","saʿatihi","wakāna","al-lahu","wāsiʿan","ḥakīman",null],"verseTiming":[[1,0,1290],[2,1290,2660],[3,2660,3300],[4,3300,4070],[5,4070,4790],[6,4790,6100],[7,6100,7630],[8,7630,8340],[9,8340,9280],[10,9280,10160],[11,10160,11625]]}}