{"name":"4:142","price":"بے شک منافق اللہ سے چالبازیاں کر رہے ہیں اور وه انہیں اس چالبازی کا بدلہ دینے واﻻ ہے(1) اور جب نماز کو کھڑے ہوتے ہیں تو بڑی کاہلی کی حالت میں کھڑے ہوتے ہیں(2) صرف لوگوں کو دکھاتے ہیں(3)، اور یاد الٰہی تو یوں ہی سی برائے نام کرتے ہیں۔(4)","arabic":"إِنَّ ٱلۡمُنَٰفِقِينَ يُخَٰدِعُونَ ٱللَّهَ وَهُوَ خَٰدِعُهُمۡ وَإِذَا قَامُوٓاْ إِلَى ٱلصَّلَوٰةِ قَامُواْ كُسَالَىٰ يُرَآءُونَ ٱلنَّاسَ وَلَا يَذۡكُرُونَ ٱللَّهَ إِلَّا قَلِيلٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":635,"juzNumber":5,"footnotes":"(1) اس کی مختصر توضیح سورۂ بقرہ کے آغاز میں ہو چکی ہے۔\n(2) نماز اسلام کا اہم ترین رکن اور اشرف ترین فرض ہے اور اس میں بھی وہ کاہلی اور سستی کا مظاہرہ کرتے تھے کیونکہ ان کا قلب ایمان، خشیت الٰہی اور خلوص سے محروم تھا۔ یہی وجہ تھی کہ عشا اور فجر کی نماز بطور خاص ان پر بہت بھاری تھی جیسا کہ نبی (صلى الله عليه وسلم) کا فرمان ہے ”أَثْقَلُ الصَّلاةِ عَلَى الْمُنَافِقِينَ صَلاةُ الْعِشَاءِ وَصَلاةُ الْفَجْرِ ...“ ( صحيح بخاري، مواقيت الصلاة- صحيح مسلم، كتاب المساجد) ”منافق پر عشا اور فجر کی نماز سب سے زیادہ بھاری ہے“۔ (3) یہ نماز بھی وہ صرف ریاکاری اور دکھلاوے کے لئے پڑھتے تھے، تاکہ مسلمانوں کو فریب دے سکیں۔\n(4) اللہ کا ذکر تو برائے نام کرتے ہیں یا نماز مختصر سی پڑھتے ہیں ”أی لا يُصَلُّونَ إِلا صَلاةً قَلِيلَةً“ جب نماز اخلاص، خشیت الٰہی اور خشوع سے خالی ہو تو اطمینان سے نماز کی ادائیگی نہایت گراں ہوتی ہے۔ جیسا کہ ”وَإِنَّهَا لَكَبِيرَةٌ إِلا عَلَى الْخَاشِعِينَ“ (البقرۃ: 45) سے واضح ہے، حدیث میں نبی (صلى الله عليه وسلم) نے فرمایا: ”یہ منافق کی نماز ہے، یہ منافق کی نماز ہے، یہ منافق کی نماز ہے کہ بیٹھا ہوا سورج کا انتظار کرتا رہتا ہے، یہاں تک کہ جب سورج شیطان کے دو سینگوں کے درمیان (یعنی غروب کے قریب) ہو جاتا ہے تو اٹھتاہے اور چار ٹھونگیں مار لیتا ہے“۔ (صحيح مسلم، كتاب المساجد- موطأ كتاب القرآن)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"inna al-munāfiqīna yukhādiʿūna al-laha wahuwa khādiʿuhum wa-idhā qāmū ilā al-ṣalati qāmū kusālā yurāūna al-nāsa walā yadhkurūna al-laha illā qalīlan ","translations":["Indeed","the hypocrites","(seek to) deceive","Allah","and (it is) He","who deceives them","And when","they stand","for","the prayer","they stand","lazily","showing off","(to) the people","and not","they remember","Allah","except","a little","(142)"],"transliterationArr":["inna","al-munāfiqīna","yukhādiʿūna","al-laha","wahuwa","khādiʿuhum","wa-idhā","qāmū","ilā","al-ṣalati","qāmū","kusālā","yurāūna","al-nāsa","walā","yadhkurūna","al-laha","illā","qalīlan",null],"verseTiming":[[1,0,1420],[2,1420,3000],[3,3000,4480],[4,4480,5450],[5,5450,6030],[6,6030,7360],[7,7360,8070],[8,8070,9920],[9,9920,10310],[10,10310,11320],[11,11320,12170],[12,12170,13350],[13,13350,14550],[14,14550,15710],[15,15710,18270],[16,18270,20190],[17,20190,20880],[18,20880,22070],[19,22070,22980],[20,22980,23780],[21,23780,25315]]}}