{"name":"4:149","price":"اگر تم کسی نیکی کو علانیہ کرو یا پوشیده، یا کسی برائی سے درگزر کرو(1) ، پس یقیناً اللہ تعالیٰ پوری معافی کرنے واﻻ اور پوری قدرت واﻻ ہے۔","arabic":"إِن تُبۡدُواْ خَيۡرًا أَوۡ تُخۡفُوهُ أَوۡ تَعۡفُواْ عَن سُوٓءٖ فَإِنَّ ٱللَّهَ كَانَ عَفُوّٗا قَدِيرًا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":642,"juzNumber":6,"footnotes":"(1) کوئی شخص کسی کے ساتھ ظلم یا برائی کا ارتکاب کرے تو شریعت نے اس حد تک بدلہ لینے کی اجازت دی ہے۔ جس حد تک اس پر ظلم ہوا ہے۔ ”الْمُسْتَبَّانِ مَا قَالا، فَعَلَى الْبَادِي، مَا لَمْ يَعْتَدِ الْمَظْلُومُ“ (صحيح مسلم، كتاب البر والصلة والآداب، باب النهي من السباب حديث نمبر4587) ”آپس میں گالی گلوچ کرنے والے دو شخص جو کچھ کہیں اس کا گناہ پہل کرنے والے پر ہے (بشرطیکہ) مظلوم (یعنی جسے پہلے گالی دی گئی اور اس نے جواب میں گالی دی) زیادتی نہ کرے۔“ لیکن بدلہ لینے کی اجازت کے ساتھ ساتھ معافی اور درگزر کو زیادہ پسند فرمایا ہے کیونکہ اللہ تعالیٰ خود باوجود قدرت کاملہ کے عفوودرگزر سے کام لینے والا ہے۔ اس لئے فرمایا ”وَجَزَاءُ سَيِّئَةٍ سَيِّئَةٌ مِثْلُهَا فَمَنْ عَفَا وَأَصْلَحَ فَأَجْرُهُ عَلَى اللَّهِ“ (الشوریٰ: 40) برائی کا بدلہ، اسی کی مثل برائی ہے، مگر جو درگزر کرے اور اصلاح کرلے تو اس کا اجر اللہ کے ذمے ہے اور حدیث میں بھی ہے ”معاف کردینے سے اللہ تعالیٰ عزت میں اضافہ فرماتا ہے۔“ (صحیح مسلم کتاب البر والصلۃ والآداب باب استحباب العفو والتواضع)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"in tub'dū khayran aw tukh'fūhu aw taʿfū ʿan sūin fa-inna al-laha kāna ʿafuwwan qadīran ","translations":["If","you disclose","a good","or","you conceal it","or","pardon","[of]","an evil","then indeed","Allah","is","Oft-Pardoning","All-Powerful","(149)"],"transliterationArr":["in","tub'dū","khayran","aw","tukh'fūhu","aw","taʿfū","ʿan","sūin","fa-inna","al-laha","kāna","ʿafuwwan","qadīran",null],"verseTiming":[[1,0,830],[2,830,2020],[3,2020,2810],[4,2810,3120],[5,3120,4110],[6,4110,4470],[7,4470,5290],[8,5290,6120],[9,6120,8759],[10,8759,9889],[11,9889,10699],[12,10699,11289],[13,11289,12989],[14,12989,14504]]}}