{"name":"4:141","price":"یہ لوگ تمہارے انجام کار کا انتظار کرتے رہتے ہیں پھر اگر تمہیں اللہ فتح دے تو یہ کہتے ہیں کہ کیا ہم تمہارے ساتھی نہیں اور اگر کافروں کو تھوڑا سا غلبہ مل جائے تو (ان سے) کہتے ہیں کہ ہم تم پر غالب نہ آنے لگے تھے اور کیا ہم نے تمہیں مسلمانوں کے ہاتھوں سے نہ بچایا تھا؟(1) پس قیامت میں خود اللہ تعالیٰ تمہارے درمیان فیصلہ کرے گا(2) اور اللہ تعالیٰ کافروں کو ایمان والوں پر ہرگز راه نہ دے گا۔(3)","arabic":"ٱلَّذِينَ يَتَرَبَّصُونَ بِكُمۡ فَإِن كَانَ لَكُمۡ فَتۡحٞ مِّنَ ٱللَّهِ قَالُوٓاْ أَلَمۡ نَكُن مَّعَكُمۡ وَإِن كَانَ لِلۡكَٰفِرِينَ نَصِيبٞ قَالُوٓاْ أَلَمۡ نَسۡتَحۡوِذۡ عَلَيۡكُمۡ وَنَمۡنَعۡكُم مِّنَ ٱلۡمُؤۡمِنِينَۚ فَٱللَّهُ يَحۡكُمُ بَيۡنَكُمۡ يَوۡمَ ٱلۡقِيَٰمَةِۚ وَلَن يَجۡعَلَ ٱللَّهُ لِلۡكَٰفِرِينَ عَلَى ٱلۡمُؤۡمِنِينَ سَبِيلًا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":634,"juzNumber":5,"footnotes":"(1) یعنی ہم تم پر غالب آنے لگے تھے لیکن تمہیں اپنا ساتھی سمجھ کر چھوڑ دیا اور مسلمانوں کا ساتھ چھوڑ کر ہم نے تمہیں مسلمانوں کے ہاتھوں سے بچایا۔ مطلب یہ کہ تمہیں غلبہ ہماری اس دوغلی پالیسی کے نتیجے میں حاصل ہواہے۔ جو ہم نے مسلمانوں میں ظاہری طور پر شامل ہو کر اپنائے رکھی۔ لیکن درپردہ ان کو نقصان پہنچانے میں ہم نے کوئی کوتاہی اور کمی نہیں کی تاآنکہ تم ان پر غالب آگئے۔ یہ منافقین کا قول ہے جو انہوں نے کافروں سے کہا۔\n(2) یعنی دنیا میں تم نے دھوکے اور فریب سے وقتی طور پر کچھ کامیابی حاصل کر لی، لیکن قیامت والے دن اللہ تعالیٰ کا فیصلہ ان باطنی جذبات وکیفیات کی روشنی میں ہوگا جنہیں تم سینوں میں چھپائے ہوئے تھے، اس لئے کہ اللہ تعالیٰ تو سینوں کے رازوں کو بھی خوب جانتا ہے اور پھر اس پر جو وہ سزا دے گا تو معلوم ہوگا کہ دنیا میں منافقت اختیار کرکے نہایت خسارے کا سودا کیا تھا، جس پر جہنم کا دائمی عذاب بھگتنا ہوگا۔أَعَاذَنَا اللهُ مِنْهُ\n(3) یعنی غلبہ نہ دے گا۔ اس کے مختلف مفہوم بیان کئے گئے ہیں۔ (1) اہل اسلام کا یہ غلبہ قیامت والے دن ہوگا۔ (2) حجت اور دلائل کے اعتبار سے کافر مسلمانوں پر غالب نہیں آسکتے۔ (3) کافروں کا ایسا غلبہ نہیں ہوگا کہ مسلمان کی دولت وشوکت کا بالکل خاتمہ ہی ہو جائے اور وہ حرف غلط کی طرح دنیا کے نقشے سے ہی محو ہو جائیں۔ ایک حدیث سے بھی اس مفہوم کی تائید ہوتی ہے۔ (4) جب تک مسلمان اپنے دین کے عامل، باطل سے غیر راضی اور منکرات سے روکنے والے رہیں گے، کافر ان پر غالب نہ آسکیں گے۔ امام ابن العربی فرماتے ہیں کہ ”یہ سب سے عمدہ معنی ہے“ کیونکہ اللہ تعالیٰ کا فرمان ہے۔ ”وَمَا أَصَابَكُمْ مِنْ مُصِيبَةٍ فَبِمَا كَسَبَتْ أَيْدِيكُمْ“ (الشوری: 30) ”اور جو مصیبت تم پر واقع ہوتی ہے، سو تمہارے اپنے فعلوں کی وجہ سے“ (فتح القدیر) گویا مسلمانوں کی مغلوبیت ان کی اپنی کوتاہیوں کا نتیجہ ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"alladhīna yatarabbaṣūna bikum fa-in kāna lakum fatḥun mina al-lahi qālū alam nakun maʿakum wa-in kāna lil'kāfirīna naṣībun qālū alam nastaḥwidh ʿalaykum wanamnaʿkum mina al-mu'minīna fal-lahu yaḥkumu baynakum yawma al-qiyāmati walan yajʿala al-lahu lil'kāfirīna ʿalā al-mu'minīna sabīlan ","translations":["Those who","are waiting","for you","Then if","was","for you","a victory","from","Allah","they say","Were not","we","with you","But if","(there) was","for the disbelievers","a chance","they said","Did not","we have advantage","over you","and we protected you","from","the believers","And Allah","will judge","between you","(on the) Day","(of) the Resurrection","and never","will make","Allah","for the disbelievers","over","the believers","a way","(141)"],"transliterationArr":["alladhīna","yatarabbaṣūna","bikum","fa-in","kāna","lakum","fatḥun","mina","al-lahi","qālū","alam","nakun","maʿakum","wa-in","kāna","lil'kāfirīna","naṣībun","qālū","alam","nastaḥwidh","ʿalaykum","wanamnaʿkum","mina","al-mu'minīna","fal-lahu","yaḥkumu","baynakum","yawma","al-qiyāmati","walan","yajʿala","al-lahu","lil'kāfirīna","ʿalā","al-mu'minīna","sabīlan",null],"verseTiming":[[1,0,1240],[2,1240,2920],[3,2920,3490],[4,3490,4630],[5,4630,5120],[6,5120,5770],[7,5770,6820],[8,6820,7610],[9,7610,8480],[10,8480,10360],[11,10360,10980],[12,10980,11370],[13,11370,13220],[14,13220,14310],[15,14310,14840],[16,14840,16510],[17,16510,18400],[18,18400,19470],[19,19470,21960],[20,21960,22640],[21,22640,23740],[22,23740,24940],[23,24940,26300],[24,26300,27200],[25,27200,30100],[26,30100,31090],[27,31090,32020],[28,32020,33030],[29,33030,33580],[30,33580,35130],[31,35130,35750],[32,35750,37230],[33,37230,38060],[34,38060,39650],[35,39650,40060],[36,40060,41400],[37,41400,43025]]}}