{"name":"4:158","price":"بلکہ اللہ تعالیٰ نے انہیں اپنی طرف اٹھا لیا(1) اور اللہ بڑا زبردست اور پوری حکمتوں واﻻ ہے۔(2)","arabic":"بَل رَّفَعَهُ ٱللَّهُ إِلَيۡهِۚ وَكَانَ ٱللَّهُ عَزِيزًا حَكِيمٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":651,"juzNumber":6,"footnotes":"(1) یہ نص صریح ہے اس بات پر کہ اللہ تعالیٰ نے اپنی قدرت کاملہ سے حضرت عیسیٰ (عليه السلام) کو زندہ آسمان پر اٹھا لیا اور متواتر صحیح احادیث سے بھی یہ بات ثابت ہے۔ یہ احادیث حدیث کی تمام کتابوں کے علاوہ صحیح بخاری و صحیح مسلم میں بھی وارد ہیں۔ ان احادیث میں آسمان پر اٹھائے جانے کے علاوہ قیامت کے قریب ان کے نزول کا اور دیگر بہت سی باتوں کا تذکرہ ہے۔ امام ابن کثیر یہ تمام روایات کا ذکر کرکے آخر میں تحریر فرماتے ہیں پس یہ احادیث رسول اللہ (صلى الله عليه وسلم) سے متواتر ہیں۔ ان کے راویوں میں حضرت ابوہریرۃ، حضرت عبداللہ بن مسعود، عثمان بن ابی العاص، ابوامامہ، نواس بن سمعان، عبداللہ بن عمرو بن العاص، مجمع بن جاریہ، ابی سریحہ اور حذیفہ بن اسید (رضي الله عنهم) ہیں۔ ان احادیث میں آپ کے نزول کی صفت اور جگہ کا بیان ہے، آپ (عليه السلام) دمشق میں منارہ شرقیہ کے پاس اس وقت اتریں گے جب فجر کی نماز کے لئے اقامت ہو رہی ہوگی۔ آپ خنزیر کو قتل کریں گے، صلیب توڑ دیں گے، جزیہ معاف کردیں گے، ان کے دور میں سب مسلمان ہوجائیں گے، دجال کا قتل بھی آپ کے ہاتھوں سے ہوگا اور یاجوج و ماجوج کا ظہور وفساد بھی آپ کی موجودگی میں ہوگا، بالآخر آپ ہی کی بددعا سے ان کی ہلاکت واقع ہوگی۔\n(2) وہ زبردست اور غالب ہے، اس کے ارادہ اور مشیت کو کوئی ٹال نہیں سکتا اور جو اس کی پناہ میں آجائے، اسے کوئی نقصان نہیں پہنچا سکتا اور وہ حکیم بھی ہے، وہ جو فیصلہ بھی کرتا ہے، حکمت پر مبنی ہوتا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"bal rafaʿahu al-lahu ilayhi wakāna al-lahu ʿazīzan ḥakīman ","translations":["Nay","he was raised","(by) Allah","towards Him","And is","Allah","All-Mighty","All-Wise","(158)"],"transliterationArr":["bal","rafaʿahu","al-lahu","ilayhi","wakāna","al-lahu","ʿazīzan","ḥakīman",null],"verseTiming":[[1,0,230],[2,230,1230],[3,1230,2120],[4,2120,4540],[5,4540,5270],[6,5270,6130],[7,6130,7060],[8,7060,8665]]}}