{"name":"4:159","price":"اہل کتاب میں ایک بھی ایسا نہ بچے گا جو حضرت عیسیٰ (علیہ السلام) کی موت سے پہلے ان پر ایمان نہ ﻻچکے(1) اور قیامت کے دن آپ ان پر گواه ہوں گے۔(2)","arabic":"وَإِن مِّنۡ أَهۡلِ ٱلۡكِتَٰبِ إِلَّا لَيُؤۡمِنَنَّ بِهِۦ قَبۡلَ مَوۡتِهِۦۖ وَيَوۡمَ ٱلۡقِيَٰمَةِ يَكُونُ عَلَيۡهِمۡ شَهِيدٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":652,"juzNumber":6,"footnotes":"(1) ”قَبْلَ مَوْتِهِ“ میں ”ہ“ کی ضمیر کا مرجع بعض مفسرین کے نزدیک اہل کتاب (نصاریٰ) ہیں اور مطلب یہ کہ ہر عیسائی موت کے وقت حضرت عیسییٰ پر ایمان لے آتا ہے۔ گو موت کے وقت کا ایمان نافع نہیں۔ لیکن سلف اور اکثر مفسرین کے نزدیک اس کا مرجع حضرت عیسیٰ (عليه السلام) ہیں اور مطلب یہ ہے کہ جب ان کا دوبارہ دنیا میں نزول ہوگا اور وہ دجال کو قتل کرکے اسلام کا بول بالا کریں گے تو اس وقت جتنے یہودی اور عیسائی ہوں گے ان کو بھی قتل کر ڈالیں گے اور روئے زمین پر مسلمان کے سوا کوئی اور باقی نہ بچے گا اس طرح اس دنیا میں جتنے بھی اہل کتاب حضرت عیسیٰ پر ایمان لانے والے ہیں وہ حضرت عیسیٰ (عليه السلام) کی موت سے پہلے پہلے ان پر ایمان لاکر اس دنیا سے گزر چکیں گے۔ خواہ ان کا ایمان کسی بھی ڈھنگ کا ہو۔ صحیح احادیث سے بھی یہی ثابت ہے۔ چنانچہ نبی (صلى الله عليه وسلم) نے فرمایا: ”قسم ہے اس ذات کی جس کے ہاتھ میں میری جان ہے! ضرور ایک وقت آئے گا کہ تم میں ابن مریم حاکم و عادل بن کر نازل ہوں گے، وہ صلیب کو توڑ دیں گے، خنزیر کو قتل کریں گے، جزیہ اٹھا دیں گے اور مال کی اتنی بہتات ہو جائے گی کہ کوئی اسے قبول کرنے والا نہیں ہوگا۔ (یعنی صدقہ خیرات لینے والا کوئی نہیں ہوگا) حتیٰ کہ ایک سجدہ دنیا و مافیہا سے بہتر ہوگا“۔ پھر حضرت ابوہریرۃ رضی اللہ عنہ فرماتے اگر تم چاہو تو قرآن کی یہ آیت پڑھ لو ”وَإِنْ مِنْ أَهْلِ الْكِتَابِ إِلا لَيُؤْمِنَنَّ بِهِ قَبْلَ مَوْتِهِ“ (صحيح بخاري- كتاب الأنبياء) یہ احادیث اتنی کثرت سے آئی ہیں کہ انہیں تواتر کا درجہ حاصل ہے اور انہی متواتر صحیح روایات کی بنیاد پر اہل سنت کے تمام مکاتب کا متفقہ عقیدہ ہے کہ حضرت عیسی (عليه السلام) آسمان پر زندہ ہیں اور قیامت کے قریب دنیا میں ان کا نزول ہوگا اور دجال کا اور تمام ادیان کا خاتمہ فرما کر اسلام کو غالب فرمائیں گے۔ یاجوج ماجوج کا خروج بھی حضرت عیسیٰ (عليه السلام) ہی کی موجودگی میں ہوگا اور حضرت عیسیٰ (عليه السلام) کی دعا کی برکت سے ہی اس فتنے کا بھی خاتمہ ہوگا جیسا کہ احادیث سے واضح ہے۔\n(2) یہ گواہی اپنی پہلی زندگی کے حالات سے متعلق ہوگی۔ جیسا کہ سورۂ مائدہ کے آخر میں وضاحت ہے ”وَكُنْتُ عَلَيْهِمْ شَهِيدًا مَا دُمْتُ فِيهِمْ“ میں جب تک ان میں موجود رہا، ان کے حالات سے باخبر رہا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-in min ahli al-kitābi illā layu'minanna bihi qabla mawtihi wayawma al-qiyāmati yakūnu ʿalayhim shahīdan ","translations":["And (there is) not","from","(the) People","(of) the Book","but","surely he believes","in him","before","his death","And (on the) Day","(of) the Resurrection","he will be","against them","a witness","(159)"],"transliterationArr":["wa-in","min","ahli","al-kitābi","illā","layu'minanna","bihi","qabla","mawtihi","wayawma","al-qiyāmati","yakūnu","ʿalayhim","shahīdan",null],"verseTiming":[[1,0,540],[2,540,1540],[3,1540,2170],[4,2170,3150],[5,3150,3950],[6,3950,5980],[7,5980,6500],[8,6500,7210],[9,7210,8110],[10,8110,8850],[11,8850,10180],[12,10180,10920],[13,10920,11900],[14,11900,13425]]}}