{"name":"4:157","price":"اور یوں کہنے کے باعﺚ کہ ہم نے اللہ کے رسول مسیح عیسیٰ بن مریم کو قتل کر دیا حاﻻنکہ نہ تو انہوں نے اسے قتل کیا نہ سولی پر چڑھایا(1) بلکہ ان کے لئے ان (عیسیٰ) کا شبیہ بنا دیا گیا تھا(2)۔ یقین جانو کہ حضرت عیسیٰ (علیہ السلام) کے بارے میں اختلاف کرنے والے ان کے بارے میں شک میں ہیں، انہیں اس کا کوئی یقین نہیں بجز تخمینی باتوں پر عمل کرنے کے(3) اتنا یقینی ہے کہ انہوں نے انہیں قتل نہیں کیا۔","arabic":"وَقَوۡلِهِمۡ إِنَّا قَتَلۡنَا ٱلۡمَسِيحَ عِيسَى ٱبۡنَ مَرۡيَمَ رَسُولَ ٱللَّهِ وَمَا قَتَلُوهُ وَمَا صَلَبُوهُ وَلَٰكِن شُبِّهَ لَهُمۡۚ وَإِنَّ ٱلَّذِينَ ٱخۡتَلَفُواْ فِيهِ لَفِي شَكّٖ مِّنۡهُۚ مَا لَهُم بِهِۦ مِنۡ عِلۡمٍ إِلَّا ٱتِّبَاعَ ٱلظَّنِّۚ وَمَا قَتَلُوهُ يَقِينَۢا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":650,"juzNumber":6,"footnotes":"(1) اس سے واضح ہوگیا کہ حضرت عیسی (عليه السلام) کو یہودی قتل کرنے میں کامیاب ہوسکے نہ سولی چڑھانے میں۔ جیسا کہ ان کا منصوبہ تھا۔ جیسا کہ سورۂ آل عمران کی آیت نمبر 55 کے حاشیے میں مختصر تفصیل گزر چکی ہے۔\n(2) اس کا مطلب یہ ہے کہ جب حضرت عیسیٰ (عليه السلام) کو یہودیوں کی سازش کا پتہ چلا توانہوں نے اپنے حواریوں کو جن کی تعداد 12 یا 17 تھی، جمع کیا اور فرمایا کہ تم میں سے کوئی شخص میری جگہ قتل ہونے کے لئے تیار ہے؟ تاکہ اللہ تعالیٰ کی طرف سے اس کی شکل و صورت میری جیسی بنا دی جائے۔ ایک نوجوان اس کے لئے تیار ہوگیا۔ چنانچہ حضرت عیسیٰ (عليه السلام) کو وہاں سے آسمان پر اٹھا لیا گیا۔ بعد میں یہودی آئے اور انہوں نے اس نوجوان کو لے جا کر سولی پر چڑھا دیا جسے حضرت عیسیٰ کا ہم شکل بنا دیا گیا تھا۔ یہودی یہی سمجھتے رہے کہ ہم نے عیسیٰ (عليه السلام) کو سولی دی ہے درآں حالیکہ حضرت عیسیٰ (عليه السلام) اس وقت وہاں موجود ہی نہ تھے وہ زندہ جسم عنصری کے ساتھ آسمان پر اٹھائے جا چکے تھے۔(ابن کثیر و فتح القدیر)\n(3) عیسیٰ (عليه السلام) کے ہم شکل شخص کو قتل کرنے کے بعد ایک گروہ تو یہی کہتا رہا کہ حضرت عیسیٰ (عليه السلام) کو قتل کردیا، جب کہ دوسرا گروہ جسے یہ اندازہ ہوگیا کہ مصلوب شخص عیسیٰ (عليه السلام) نہیں، کوئی اور ہے۔ وہ حضرت عیسیٰ (عليه السلام) کے قتل اور مصلوب ہونے کا انکار کرتا رہا۔ بعض کہتے ہیں کہ انہوں نے عیسیٰ (عليه السلام) کو آسمان پر جاتے ہوئے بھی دیکھا تھا۔ بعض کہتے ہیں کہ اس اختلاف سے مراد وہ اختلاف ہے جو خود عیسائیوں کے نسطوریہ فرقے نے کہا کہ عیسیٰ (عليه السلام) جسم کے لحاظ سے تو سولی دے دیئے گئے لیکن لاہوت (خداوندی) کے اعتبار سے نہیں۔ ملکانیہ فرقے نے کہا کہ یہ قتل و صلب ناسوت اور لاہوت دونوں اعتبار سے مکمل طور پر ہوا ہے (فتح القدیر) بہرحال وہ اختلاف، تردد اورشک کاﺷکار رہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waqawlihim innā qatalnā al-masīḥa ʿīsā ib'na maryama rasūla al-lahi wamā qatalūhu wamā ṣalabūhu walākin shubbiha lahum wa-inna alladhīna ikh'talafū fīhi lafī shakkin min'hu mā lahum bihi min ʿil'min illā ittibāʿa al-ẓani wamā qatalūhu yaqīnan ","translations":["And for their saying","Indeed, we","killed","the Messiah","Isa","son","(of) Maryam","(the) Messenger","(of) Allah","And not","they killed him","and not","they crucified him","but","it was made to appear (so)","to them","And indeed","those who","differ","in it","(are) surely in","doubt","about it","Not","for them","about it","[of]","(any) knowledge","except","(the) following","(of) assumption","And not","they killed him","certainly","(157)"],"transliterationArr":["waqawlihim","innā","qatalnā","al-masīḥa","ʿīsā","ib'na","maryama","rasūla","al-lahi","wamā","qatalūhu","wamā","ṣalabūhu","walākin","shubbiha","lahum","wa-inna","alladhīna","ikh'talafū","fīhi","lafī","shakkin","min'hu","mā","lahum","bihi","min","ʿil'min","illā","ittibāʿa","al-ẓani","wamā","qatalūhu","yaqīnan",null],"verseTiming":[[1,0,1290],[2,1290,2490],[3,2490,3340],[4,3340,4360],[5,4360,4960],[6,4960,5420],[7,5420,6220],[8,6220,6900],[9,6900,7790],[10,7790,8370],[11,8370,10860],[12,10860,11380],[13,11380,12560],[14,12560,12980],[15,12980,14180],[16,14180,15780],[17,15780,16670],[18,16670,17660],[19,17660,18920],[20,18920,19870],[21,19870,20890],[22,20890,21570],[23,21570,22100],[24,22100,22790],[25,22790,24170],[26,24170,24950],[27,24950,25870],[28,25870,26460],[29,26460,26830],[30,26830,27680],[31,27680,28220],[32,28220,29300],[33,29300,31070],[34,31070,31570],[35,31570,32610],[36,32610,33765]]}}