{"name":"4:15","price":"تمہاری عورتوں میں سے جو بے حیائی کا کام کریں ان پر اپنے میں سے چار گواه طلب کرو، اگر وه گواہی دیں تو ان عورتوں کو گھروں میں قید رکھو، یہاں تک کہ موت ان کی عمریں پوری کردے(1) ، یا اللہ تعالیٰ ان کے لئے کوئی اور راستہ نکالے۔(2)","arabic":"وَٱلَّٰتِي يَأۡتِينَ ٱلۡفَٰحِشَةَ مِن نِّسَآئِكُمۡ فَٱسۡتَشۡهِدُواْ عَلَيۡهِنَّ أَرۡبَعَةٗ مِّنكُمۡۖ فَإِن شَهِدُواْ فَأَمۡسِكُوهُنَّ فِي ٱلۡبُيُوتِ حَتَّىٰ يَتَوَفَّىٰهُنَّ ٱلۡمَوۡتُ أَوۡ يَجۡعَلَ ٱللَّهُ لَهُنَّ سَبِيلٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":508,"juzNumber":4,"footnotes":"(1) یہ بدکار عورتوں کی بدکاری کی وہ سزا ہے جو ابتدائے اسلام میں، جب کہ زنا کی سزا متعین نہیں ہوئی تھی، عارضی طور پر مقرر کی گئی تھی ہاں یہ بھی یاد رہے کہ عربی زبان میں ایک سے دس تک کی گنتی میں یہ مسلمہ اصول ہے کہ عدد مذکر ہوگا تو معدود مونث اور عدد مونث ہوگا تو معدود مذکر۔ یہاں اربعہ (یعنی 4 کا عدد) مونث ہے، اس لئے اس کا معدود جو یہاں ذکر نہیں کیا گیا اور محذوف ہے، یقیناً مذکر آئے گا اور وہ ہے رجال یعنی اربعہ رجال جس سے یہ بات واضح طور پر معلوم ہوتی ہے کہ اثبات زنا کے لئے چار مرد گواہوں کا ہونا ضروری ہے۔ گویا جس طرح زنا کی سزا سخت مقرر کی گئی ہے، اس کے اثبات کے گواہوں کی کڑی شرط عائد کر دی گئی ہے یعنی چار مسلمان مرد عینی گواہ، اس کے بغیر شرعی سزا کا اثبات ممکن نہیں ہوگا۔\n(2) اس راستے سے مراد زنا کی وہ سزا ہے جو بعد میں مقرر کی گئی یعنی شادی شدہ زنا کار مرد وعورت کے لئے رجم اور غیر شادی شدہ بدکار مرد وعورت کے لئے سو سو کوڑے کی سزا۔ (جس کی تفصیل سورۂ نور اور احادیث صحیحہ میں موجود ہے)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-allātī yatīna al-fāḥishata min nisāikum fa-is'tashhidū ʿalayhinna arbaʿatan minkum fa-in shahidū fa-amsikūhunna fī al-buyūti ḥattā yatawaffāhunna al-mawtu aw yajʿala al-lahu lahunna sabīlan ","translations":["And those who","commit","[the] immorality","from","your women","then call to witness","against them","four","among you","And if","they testify","then confine them","in","their houses","until","comes to them","[the] death","or","makes","Allah","for them","a way","(15)"],"transliterationArr":["wa-allātī","yatīna","al-fāḥishata","min","nisāikum","fa-is'tashhidū","ʿalayhinna","arbaʿatan","minkum","fa-in","shahidū","fa-amsikūhunna","fī","al-buyūti","ḥattā","yatawaffāhunna","al-mawtu","aw","yajʿala","al-lahu","lahunna","sabīlan",null],"verseTiming":[[1,0,1490],[2,1490,2440],[3,2440,3850],[4,3850,4130],[5,4130,7320],[6,7320,8750],[7,8750,10690],[8,10690,11840],[9,11840,14620],[10,14620,15730],[11,15730,16590],[12,16590,19290],[13,19290,19530],[14,19530,20560],[15,20560,21380],[16,21380,23880],[17,23880,26220],[18,26220,27470],[19,27470,29540],[20,29540,31060],[21,31060,31430],[22,31430,32320],[23,32320,33150],[24,33150,34790],[25,34790,36525]]}}