{"name":"4:16","price":"تم میں سے جو دو افراد ایسا کام کر لیں(1) انہیں ایذا دو(2) اگر وه توبہ اور اصلاح کر لیں تو ان سے منھ پھیر لو، بے شک اللہ تعالیٰ توبہ قبول کرنے واﻻ اور رحم کرنے واﻻ ہے۔","arabic":"وَٱلَّذَانِ يَأۡتِيَٰنِهَا مِنكُمۡ فَـَٔاذُوهُمَاۖ فَإِن تَابَا وَأَصۡلَحَا فَأَعۡرِضُواْ عَنۡهُمَآۗ إِنَّ ٱللَّهَ كَانَ تَوَّابٗا رَّحِيمًا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":509,"juzNumber":4,"footnotes":"(1) بعض نے اس سے اغلام بازی مراد لی ہے یعنی عمل لواطت۔ دو مردوں کا ہی آپس میں بدفعلی کرنا اور بعض نے اس سے باکرہ مرد وعورت مراد لئے ہیں اور اس سے قبل کی آیت کو انہوں نے محصنات یعنی شادی شدہ کے ساتھ خاص کیا ہے اور بعض نے اس تثنیہ کے صیغے سے مرد اور عورت مراد لئے ہیں۔ قطع نظر اس سے کہ وہ باکرہ ہوں یا شادی شدہ۔ ابن جریر طبری نے دوسرے مفہوم یعنی باکرہ (مرد وعورت) کو ترجیح دی ہے۔ اور پہلی آیت میں بیان کردہ سزا کو نبی (صلى الله عليه وسلم) کی بتلائی ہوئی سزا سزائے رجم سے اور اس آیت میں بیان کردہ سزا کو سورۂ نور میں بیان کردہ سو کوڑے کی سزا سے منسوخ قرار دیا ہے۔ (تفسیر طبری)\n(2) یعنی زبان سے زجرو توبیخ اور ملامت یا ہاتھ سے کچھ زدو کوب کر لینا۔ اب یہ منسوخ ہے، جیسا کہ گزرا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-alladhāni yatiyānihā minkum faādhūhumā fa-in tābā wa-aṣlaḥā fa-aʿriḍū ʿanhumā inna al-laha kāna tawwāban raḥīman ","translations":["And the two who","commit it","among you","then punish both of them","But if","they repent","and correct themselves","then turn away","from both of them","Indeed","Allah","is","Oft-Forgiving","Most-Merciful","(16)"],"transliterationArr":["wa-alladhāni","yatiyānihā","minkum","faādhūhumā","fa-in","tābā","wa-aṣlaḥā","fa-aʿriḍū","ʿanhumā","inna","al-laha","kāna","tawwāban","raḥīman",null],"verseTiming":[[1,0,1420],[2,1420,3260],[3,3260,4930],[4,4930,6710],[5,6710,8330],[6,8330,9270],[7,9270,10550],[8,10550,11910],[9,11910,12680],[10,12680,14540],[11,14540,15430],[12,15430,16140],[13,16140,17220],[14,17220,18735]]}}