{"name":"4:164","price":"اور آپ سے پہلے کے بہت سے رسولوں کے واقعات ہم نے آپ سے بیان کئے ہیں(1) اور بہت سے رسولوں کے نہیں بھی کئے(2) اور موسیٰ (علیہ السلام) سے اللہ تعالیٰ نے صاف طور پر کلام کیا۔","arabic":"وَرُسُلٗا قَدۡ قَصَصۡنَٰهُمۡ عَلَيۡكَ مِن قَبۡلُ وَرُسُلٗا لَّمۡ نَقۡصُصۡهُمۡ عَلَيۡكَۚ وَكَلَّمَ ٱللَّهُ مُوسَىٰ تَكۡلِيمٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":657,"juzNumber":6,"footnotes":"(1) جن نبیوں اور رسولوں کے اسمائے گرامی اور ان کے واقعات قرآن کریم میں بیان کئے گئے ہیں ان کی تعداد 24 یا 25 ہے۔ (1) آدم (2) ادریس (3) نوح (4) ہود (5) صالح (6) ابراہیم (7) لوط (8) اسماعیل (9) اسحاق (10) یعقوب (11) یوسف (12) ایوب (13) شعیب (14) موسیٰ (15) ہارون (16) یونس (17) داود (18) سلیمان (19) الیاس (20) الیسع (21) زکریا (22) یحیی(23) عیسیٰ (24) ذوالکفل۔ (اکثر مفسرین کے نزدیک) (25)حضرت محمد صلوٰت اللہ وسلامہ علیہ و علیہم اجمعین۔\n(2) جن انبیا ورسل کے نام اور واقعات قرآن میں بیان نہیں کئے گئے، ان کی تعداد کتنی ہے؟ اللہ تعالیٰ ہی بہتر جانتا ہے۔ ایک حدیث میں جو بہت مشہور ہے ایک لاکھ 24 ہزار اور ایک حدیث میں 8 ہزار تعداد بتلائی گئی ہے۔ لیکن یہ روایات سخت ضعیف ہیں۔ قرآن وحدیث سے صرف یہی معلوم ہوتا ہے کہ مختلف ادوار وحالات میں مبشرین ومنذرین (انبیاء) آتے رہے ہیں۔ بالآخر یہ سلسلۂ نبوت حضرت محمد پر ختم فرما دیا گیا۔ آپ سے پہلے کتنے نبی آئے (صلى الله عليه وسلم) ان کی صحیح تعداد اللہ کے سوا کوئی نہیں جانتا تاہم آپ (صلى الله عليه وسلم) کے بعد جتنے بھی دعوے داران نبوت ہو گزرے یا ہوں گے، سب کے سب دجال اور کذاب ہیں اور ان کی جھوٹی نبوت پر ایمان لانے والے دائرۂ اسلام سے خارج ہیں اور امت محمدیہ سے الگ ایک متوازی امت ہیں۔ جیسے امت بابیہ، بہائیہ اور امت مرزائیہ وغیرہ۔ اسی طرح مرزا قادیانی کو مسیح موعود ماننے والے لاہوری مرزائی ہیں۔\n(3) یہ موسیٰ (عليه السلام) کی وہ خاص صفت ہے جس میں وہ دوسرے انبیا سے ممتاز ہیں۔ صحیح ابن حبان کی ایک روایت کی رو سے امام ابن کثیر نے اس صفت ہم کلامی میں حضرت آدم (عليه السلام) وحضرت محمد (صلى الله عليه وسلم) کو بھی شریک مانا ہے۔ (تفسير ابن كثير زیر آیت تِلْكَ الرُّسُلُ فَضَّلْنَا بَعْضَهُمْ عَلَى بَعْضٍ)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"warusulan qad qaṣaṣnāhum ʿalayka min qablu warusulan lam naqṣuṣ'hum ʿalayka wakallama al-lahu mūsā taklīman ","translations":["And Messengers","surely","We (have) mentioned them","to you","from","before","and Messengers","not","We (have) mentioned them","to you","And spoke","Allah","(to) Musa","(in a) conversation","(164)"],"transliterationArr":["warusulan","qad","qaṣaṣnāhum","ʿalayka","min","qablu","warusulan","lam","naqṣuṣ'hum","ʿalayka","wakallama","al-lahu","mūsā","taklīman",null],"verseTiming":[[1,0,1630],[2,1630,1930],[3,1930,3430],[4,3430,4260],[5,4260,5440],[6,5440,6070],[7,6070,6790],[8,6790,7450],[9,7450,8640],[10,8640,10900],[11,10900,11790],[12,11790,12730],[13,12730,13440],[14,13440,15305]]}}