{"name":"4:165","price":"ہم نے انہیں رسول بنایا ہے، خوشخبریاں سنانے والے اور آگاه کرنے والے(1) تاکہ لوگوں کی کوئی حجت اور الزام رسولوں کے بھیجنے کے بعد اللہ تعالیٰ پر ره نہ جائے(2)۔ اللہ تعالی بڑا غالب اور بڑا باحکمت ہے۔","arabic":"رُّسُلٗا مُّبَشِّرِينَ وَمُنذِرِينَ لِئَلَّا يَكُونَ لِلنَّاسِ عَلَى ٱللَّهِ حُجَّةُۢ بَعۡدَ ٱلرُّسُلِۚ وَكَانَ ٱللَّهُ عَزِيزًا حَكِيمٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":658,"juzNumber":6,"footnotes":"(1) ایمان والوں کو جنت اور اس کی نعمتوں کی خوشخبری دینا اور کافروں کو اللہ کے عذاب اور بھڑکتی ہوئی جہنم سے ڈرانا۔\n(2) یعنی نبوت یا انذار وتبشیر کا یہ سلسلہ ہم نے اس لئے قائم فرمایا کہ کسی کے پاس یہ عذر باقی نہ رہے کہ ہمیں تو تیرا پیغام پہنچاہی نہیں۔ جس طرح دوسرے مقام پر فرمایا «وَلَوْ أَنَّا أَهْلَكْنَاهُمْ بِعَذَابٍ مِنْ قَبْلِهِ لَقَالُوا رَبَّنَا لَوْلا أَرْسَلْتَ إِلَيْنَا رَسُولا فَنَتَّبِعَ آيَاتِكَ مِنْ قَبْلِ أَنْ نَذِلَّ وَنَخْزَى» ( طہ: 134) اگر ہم ان کو پیغمبر (کے بھیجنے سے) پہلے ہی ہلاک کر دیتے تو وہ کہتے کہ اے ہمارے پروردگار تو نے ہماری طرف کوئی رسول کیوں نہیں بھیجا کہ ہم ذلیل و رسوا ہونے سے پیشتر تیری آیات کی پیروی کرلیتے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"rusulan mubashirīna wamundhirīna li-allā yakūna lilnnāsi ʿalā al-lahi ḥujjatun baʿda al-rusuli wakāna al-lahu ʿazīzan ḥakīman ","translations":["Messengers","bearers of glad tidings","and warners","so that not","there is","for mankind","against","Allah","any argument","after","the Messengers","And is","Allah","All-Mighty","All-Wise","(165)"],"transliterationArr":["rusulan","mubashirīna","wamundhirīna","li-allā","yakūna","lilnnāsi","ʿalā","al-lahi","ḥujjatun","baʿda","al-rusuli","wakāna","al-lahu","ʿazīzan","ḥakīman",null],"verseTiming":[[1,0,830],[2,830,3080],[3,3080,4950],[4,4950,6020],[5,6020,6860],[6,6860,8530],[7,8530,8890],[8,8890,9730],[9,9730,11610],[10,11610,12170],[11,12170,12960],[12,12960,13990],[13,13990,14900],[14,14900,15900],[15,15900,17295]]}}