{"name":"4:171","price":"اے اہل کتاب! اپنے دین کے بارے میں حد سے نہ گزر جاؤ(1) اور اللہ پر بجز حق کے اور کچھ نہ کہو، مسیح عیسیٰ بن مریم (علیہ السلام) تو صرف اللہ تعالیٰ کے رسول اور اس کے کلمہ (کن سے پیدا شده) ہیں، جسے مریم (علیہا السلام) کی طرف ڈال دیا تھا اور اس کے پاس کی روح(2) ہیں اس لئے تم اللہ کو اور اس کے سب رسولوں کو مانو اور نہ کہو کہ اللہ تین ہیں(3)، اس سے باز آجاؤ کہ تمہارے لئے بہتری ہے، اللہ عبادت کے ﻻئق تو صرف ایک ہی ہے اور وه اس سے پاک ہے کہ اس کی اوﻻد ہو، اسی کے لئے ہے جو کچھ آسمانوں میں ہے اور جو کچھ زمین میں ہے۔ اور اللہ کافی ہے کام بنانے واﻻ۔","arabic":"يَٰٓأَهۡلَ ٱلۡكِتَٰبِ لَا تَغۡلُواْ فِي دِينِكُمۡ وَلَا تَقُولُواْ عَلَى ٱللَّهِ إِلَّا ٱلۡحَقَّۚ إِنَّمَا ٱلۡمَسِيحُ عِيسَى ٱبۡنُ مَرۡيَمَ رَسُولُ ٱللَّهِ وَكَلِمَتُهُۥٓ أَلۡقَىٰهَآ إِلَىٰ مَرۡيَمَ وَرُوحٞ مِّنۡهُۖ فَـَٔامِنُواْ بِٱللَّهِ وَرُسُلِهِۦۖ وَلَا تَقُولُواْ ثَلَٰثَةٌۚ ٱنتَهُواْ خَيۡرٗا لَّكُمۡۚ إِنَّمَا ٱللَّهُ إِلَٰهٞ وَٰحِدٞۖ سُبۡحَٰنَهُۥٓ أَن يَكُونَ لَهُۥ وَلَدٞۘ لَّهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ وَكَفَىٰ بِٱللَّهِ وَكِيلٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":664,"juzNumber":6,"footnotes":"(1) ”غُلُوٌّ“ کا مطلب ہے کسی چیز کو اس کی حد سے بڑھا دینا۔ جیسے عیسائیوں نے حضرت عیسیٰ (عليه السلام) اور ان کی والدہ کے بارے میں کیا کہ انہیں رسالت وبندگی کے مقام سے اٹھا کر الوہیت کے مقام پر فائز کردیا اور ان کی اللہ کی طرح عبادت کرنے لگے۔ اسی طرح حضرت عیسیٰ (عليه السلام) کے پیروکاروں کو بھی غلو کا مظاہرہ کرتے ہوئے، معصوم بنا ڈالا اور ان کو حرام و حلال کے اختیار سے نواز دیا۔ جیسا کہ اللہ تعالیٰ نے فرمایا: «اتَّخَذُوا أَحْبَارَهُمْ وَرُهْبَانَهُمْ أَرْبَابًا مِنْ دُونِ اللَّهِ» (التوبہ: 31) ”انہوں نے اپنے علما اور درویشوں کو اللہ کے سوا رب بنا لیا“۔ یہ رب بنانا حدیث کے مطابق، ان کے حلال کئے کو حلال اور حرام کئے کو حرام سمجھنا تھا۔ دراں حالیکہ یہ اختیار صرف اللہ کو حاصل ہے لیکن اہل کتاب نے یہ حق بھی اپنے علماء وغیرہ کو دے دیا۔ اللہ تعالیٰ نے اس آیت میں اہل کتاب کو دین میں اسی غلو سے منع فرمایا ہے۔ نبی (صلى الله عليه وسلم) نے بھی عیسائیوں کے اس غلو کے پیش نظر اپنے بارے میں اپنی امت کو متنبہ فرمایا ”لا تُطْرُونِي كَمَا أَطْرَتِ النَّصَارَى عِيسَى ابْنَ مَرْيَمَ؛ فَإِنَّمَا أَنَا عَبْدُهُ، فَقُولُوا: عَبْدُ اللهِ وَرَسُولُهُ“ (صحیح بخاری۔ کتاب الانبیاء مسند احمد جلد ا صفحہ 23، نیز دیکھیے مسند احمد جلد ا صفحہ 153) ”تم مجھے اس طرح حد سے نہ بڑھانا جس طرح عیسائیوں نے عیسیٰ بن مریم (عليه السلام) کو بڑھایا، میں تو صرف اللہ کا بندہ ہوں، پس تم مجھے اس کا بندہ اور رسول ہی کہنا“۔ لیکن افسوس امت محمدیہ اس کے باوجود بھی اس غلو سے محفوظ نہ رہ سکی جس میں عیسائی مبتلا ہوئے اور امت محمدیہ نے بھی اپنے پیغمبر کو بلکہ نیک بندوں تک کو خدائی صفات سے متصف ٹھہرا دیا جو دراصل عیسائیوں کا وطیرہ تھا۔ اسی طرح علماء وفقہاء کو بھی دین کا شارح اور مفسر ماننے کے بجائے ان کو شارع (شریعت سازی کا اختیار رکھنے والے) بنا دیا ہے۔فَإِنَّا للهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ۔ سچ فرمایا نبی (صلى الله عليه وسلم) نے ”لَتَتَّبَعُنَّ سَنَنَ مَنْ كَانَ قَبْلَكُمْ حَذْوَ النَّعْلِ بِالنَّعْلِ“ ”جس طرح ایک جوتا دوسرے جوتے کے برابر ہوتا ہے، بالکل اسی طرح تم پچھلی امتوں کی پیروی کرو گے“۔ یعنی ان کے قدم بہ قدم چلو گے۔\n(2) ”كَلِمَةُ اللهِ“ کا مطلب یہ ہے کہ لفظ ”كُنْ“ سے باپ کے بغیر ان کی تخلیق ہوئی اور یہ لفظ حضرت جبریل (عليه السلام) کے ذریعے سے حضرت مریم علیہا السلام تک پہنچایا گیا۔ روح اللہ کا مطلب وہ نفخة ( پھونک) ہے جو حضرت جبریل (عليه السلام) نے اللہ کے حکم سے حضرت مریم علیہا السلام کے گریبان میں پھونکا، جسے اللہ تعالیٰ نے باپ کے نطفہ کے قائم مقام کردیا۔ یوں عیسیٰ (عليه السلام) اللہ کا کلمہ بھی ہیں جو فرشتے نے حضرت مریم علیہا السلام کی طرف ڈالا اور اس کی وہ روح ہیں، جسے لے کر جبریل (عليه السلام) مریم علیہا السلام کی طرف بھیجے گئے۔ (تفسیر ابن کثیر )۔\n(3) عیسائیوں کے کئی فرقے ہیں۔ بعض حضرت عیسیٰ (عليه السلام) کو اللہ، بعض اللہ کا شریک اوربعض اللہ کا بیٹا مانتے ہیں۔ پھر جو اللہ مانتے ہیں وہ أَقَانِيمُ ثَلاثَةٌ ( تین خداؤں) کے اور حضرت عیسیٰ (عليه السلام) کے ثالث ثلاثہ (تین سے ایک) ہونے کے قائل ہیں۔ اللہ تعالیٰ فرما رہا ہے کہ تین خدا کہنے سے باز آجاؤ، اللہ تعالیٰ ایک ہی ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāahla al-kitābi lā taghlū fī dīnikum walā taqūlū ʿalā al-lahi illā al-ḥaqa innamā al-masīḥu ʿīsā ub'nu maryama rasūlu al-lahi wakalimatuhu alqāhā ilā maryama warūḥun min'hu faāminū bil-lahi warusulihi walā taqūlū thalāthatun intahū khayran lakum innamā al-lahu ilāhun wāḥidun sub'ḥānahu an yakūna lahu waladun lahu mā fī al-samāwāti wamā fī al-arḍi wakafā bil-lahi wakīlan ","translations":["O People","(of) the Book","(Do) not","commit excess","in","your religion","and (do) not","say","about","Allah","except","the truth","Only","the Messiah","Isa","son","(of) Maryam","(was) a Messenger","(of) Allah","and His word","which He conveyed","to","Maryam","and a spirit","from Him","So believe","in Allah","and His Messengers","And (do) not","say","Three","desist","(it is) better","for you","Only","Allah","(is) God","One","Glory be to Him","That","He (should) have","for Him","a son","To Him (belongs)","whatever","(is) in","the heavens","and whatever","(is) in","the earth","And is sufficient","Allah","(as) a Disposer of affairs","(171)"],"transliterationArr":["yāahla","al-kitābi","lā","taghlū","fī","dīnikum","walā","taqūlū","ʿalā","al-lahi","illā","al-ḥaqa","innamā","al-masīḥu","ʿīsā","ub'nu","maryama","rasūlu","al-lahi","wakalimatuhu","alqāhā","ilā","maryama","warūḥun","min'hu","faāminū","bil-lahi","warusulihi","walā","taqūlū","thalāthatun","intahū","khayran","lakum","innamā","al-lahu","ilāhun","wāḥidun","sub'ḥānahu","an","yakūna","lahu","waladun","lahu","mā","fī","al-samāwāti","wamā","fī","al-arḍi","wakafā","bil-lahi","wakīlan",null],"verseTiming":[[1,0,2380],[2,2380,3440],[3,3440,3800],[4,3800,4580],[5,4580,5060],[6,5060,6110],[7,6110,6680],[8,6680,7710],[9,7710,8060],[10,8060,8940],[11,8940,9480],[12,9480,10700],[13,10700,12030],[14,12030,13110],[15,13110,13630],[16,13630,14120],[17,14120,14890],[18,14890,15700],[19,15700,16570],[20,16570,18850],[21,18850,19750],[22,19750,21350],[23,21350,21950],[24,21950,22730],[25,22730,23600],[26,23600,24640],[27,24640,26370],[28,26370,27490],[29,27490,28780],[30,28780,29390],[31,29390,30430],[32,30430,31950],[33,31950,33240],[34,33240,34180],[35,34180,35420],[36,35420,36560],[37,36560,37490],[38,37490,39320],[39,39320,40090],[40,40090,42960],[41,42960,43240],[42,43240,44060],[43,44060,44860],[44,44860,45470],[45,45470,45970],[46,45970,46910],[47,46910,47310],[48,47310,47510],[49,47510,48980],[50,48980,49560],[51,49560,49770],[52,49770,50830],[53,50830,51620],[54,51620,52640],[55,52640,54065]]}}