{"name":"4:170","price":"اے لوگو! تمہارے پاس تمہارے رب کی طرف حق لے کر رسول آگیا ہے، پس تم ایمان ﻻؤ تاکہ تمہارے لئے بہتری ہو اور اگر تم کافر ہوگئے تو اللہ ہی کی ہے ہر وه چیز جو آسمانوں اور زمین میں ہے(1) ، اور اللہ دانا ہے حکمت واﻻ ہے۔","arabic":"يَٰٓأَيُّهَا ٱلنَّاسُ قَدۡ جَآءَكُمُ ٱلرَّسُولُ بِٱلۡحَقِّ مِن رَّبِّكُمۡ فَـَٔامِنُواْ خَيۡرٗا لَّكُمۡۚ وَإِن تَكۡفُرُواْ فَإِنَّ لِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ وَكَانَ ٱللَّهُ عَلِيمًا حَكِيمٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":663,"juzNumber":6,"footnotes":"(1) یعنی تمہارے کفر سے اللہ کا کیا بگڑے گا جیسے حضرت موسیٰ (عليه السلام) نے اپنی قوم سے فرمایا تھا «إِنْ تَكْفُرُوا أَنْتُمْ وَمَنْ فِي الأَرْضِ جَمِيعًا فَإِنَّ اللَّهَ لَغَنِيٌّ حَمِيدٌ» (ابراہیم: 8) ”اگر تم اور روئے زمین پر بسنے والے سب کے سب کفر کا راستہ اختیار کرلیں تو وہ اللہ کا کیا بگاڑیں گے؟ یقیناً اللہ تعالیٰ تو بےپروا تعریف کیا گیا ہے“۔ اور حدیث قدسی میں ہے۔ اللہ تعالیٰ فرماتا ہے: ”اے میرے بندو ! اگر تمہارے اول و آخر تمام انسان اور جن اس ایک آدمی کے دل کی طرح ہوجائیں جو تم میں سب سے زیادہ متقی ہے تو اس سے میری بادشاہی میں اضافہ نہیں ہوگا اور اگر تمہارے اول و آخر اور انس وجن اس ایک آدمی کے دل کی طرح ہوجائیں جو تم میں سب سے بڑا نافرمان ہو تو اس سے میری بادشاہی میں کوئی کمی نہیں ہوگی۔ اے میرے بندو ! اگر تم سب ایک میدان میں جمع ہوجاؤ اور مجھ سے سوال کرو اور میں ہر انسان کو اس کے سوال کے مطابق عطا کروں تو اس سے میرے خزانے میں اتنی ہی کمی ہوگی جتنی سوئی کے سمندر میں ڈبو کر نکالنے سے سمندر کے پانی میں ہوتی ہے“۔ (صحيح مسلم، كتاب البر، باب تحريم، الظلم)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāayyuhā al-nāsu qad jāakumu al-rasūlu bil-ḥaqi min rabbikum faāminū khayran lakum wa-in takfurū fa-inna lillahi mā fī al-samāwāti wal-arḍi wakāna al-lahu ʿalīman ḥakīman ","translations":["O","mankind","Surely","has come to you","the Messenger","with the truth","from","your Lord","so believe","(it is) better","for you","But if","you disbelieve","then indeed","to Allah (belongs)","whatever","(is) in","the heavens","and the earth","And is","Allah","All-Knowing","All-Wise","(170)"],"transliterationArr":["yāayyuhā","al-nāsu","qad","jāakumu","al-rasūlu","bil-ḥaqi","min","rabbikum","faāminū","khayran","lakum","wa-in","takfurū","fa-inna","lillahi","mā","fī","al-samāwāti","wal-arḍi","wakāna","al-lahu","ʿalīman","ḥakīman",null],"verseTiming":[[1,0,2720],[2,2720,4070],[3,4070,4420],[4,4420,6630],[5,6630,7680],[6,7680,8630],[7,8630,8760],[8,8760,9990],[9,9990,11170],[10,11170,11820],[11,11820,12990],[12,12990,14030],[13,14030,15150],[14,15150,16360],[15,16360,17450],[16,17450,17790],[17,17790,18010],[18,18010,19540],[19,19540,20730],[20,20730,21410],[21,21410,22310],[22,22310,23210],[23,23210,24715]]}}