{"name":"4:19","price":"ایمان والو! تمہیں حلال نہیں کہ زبردستی عورتوں کو ورثے میں لے بیٹھو(1) انہیں اس لئے روک نہ رکھو کہ جو تم نے انہیں دے رکھا ہے، اس میں سے کچھ لے لو(2) ہاں یہ اور بات ہے کہ وه کوئی کھلی برائی اور بے حیائی کریں(3) ان کے ساتھ اچھے طریقے سے بودوباش رکھو، گو تم انہیں ناپسند کرو لیکن بہت ممکن ہے کہ تم کسی چیز کو برا جانو، اور اللہ تعالیٰ اس میں بہت ہی بھلائی کر دے۔(4)","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا يَحِلُّ لَكُمۡ أَن تَرِثُواْ ٱلنِّسَآءَ كَرۡهٗاۖ وَلَا تَعۡضُلُوهُنَّ لِتَذۡهَبُواْ بِبَعۡضِ مَآ ءَاتَيۡتُمُوهُنَّ إِلَّآ أَن يَأۡتِينَ بِفَٰحِشَةٖ مُّبَيِّنَةٖۚ وَعَاشِرُوهُنَّ بِٱلۡمَعۡرُوفِۚ فَإِن كَرِهۡتُمُوهُنَّ فَعَسَىٰٓ أَن تَكۡرَهُواْ شَيۡـٔٗا وَيَجۡعَلَ ٱللَّهُ فِيهِ خَيۡرٗا كَثِيرٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":512,"juzNumber":4,"footnotes":"(1) اسلام سے قبل عورت پر ایک یہ ظلم بھی ہوتا تھا کہ شوہر کے مرجانے پر اس کے گھر کے لوگ اس کے مال کی طرح اس کی عورت کےبھی زبردستی وارث بن بیٹھتے تھے اور خود اپنی مرضی سے، اس کی رضا مندی کے بغیر اس سے نکاح کر لیتے یا اپنے بھائی، بھتیجے سے اس کا نکاح کر دیتے، حتی کہ سوتیلابیٹا تک بھی مرنے والے باپ کی عورت سے نکاح کر لیتا یا اگر چاہتے تو اسے کسی بھی جگہ نکاح کرنے کی اجازت نہ دیتے اور وہ ساری عمر یوں ہی گزارنے پر مجبور ہوتی۔ اسلام نے ظلم کے اس تمام طریقوں سے منع فرما دی۔\n(2) ایک ظلم یہ بھی عورت پر کیا جاتا تھا کہ اگر خاوند کو وہ پسند نہ ہوتی اور وہ اس سے چھٹکارا حاصل کرنا چاہتا تو ازخود اس کو طلاق نہ دیتا (جس طرح ایسی صورت میں اسلام نے طلاق کی اجازت دی ہے) بلکہ اسے خوب تنگ کرتا تاکہ وہ مجبور ہو کر حق مہر یا جو کچھ خاوند نے اسے دیا ہوتا، از خود واپس کرکے اس سے خلاصی حاصل کرنے کو ترجیح دے اسلام نے اس حرکت کو بھی ظلم قرار دیا ہے۔\n(3) کھلی برائی سے مراد بدکاری یا بدزبانی اور نافرمانی ہے۔ ان دونوں صورتوں میں البتہ یہ اجازت دی گئی ہے کہ خاوند اس کے ساتھ ایسا رویہ اختیار کرے کہ وہ اس کا دیا ہوا مال یا حق مہر واپس کرکے خلع کرانے پر مجبور ہو جائے جیسا کہ خلع کی صورت میں خاوند کو حق مہر واپس لینے کا حق دیا گیا ہے۔ (ملاحظہ ہو سورۂ بقرہ آیت نمبر 229)\n(4) یہ بیوی کے ساتھ حسن معاشرت کا وہ حکم ہے جس کی قرآن نے بڑی تاکید کی ہے اور احادیث میں بھی نبی (صلى الله عليه وسلم) نے اس کی بڑی وضاحت اور تاکید کی ہے ایک حدیث میں آیت کے اس مفہوم کو یوں بیان کیا گیا ہے «لا يَفْرَكْ مُؤْمِنٌ مُؤْمِنَةً إِنْ سَخِطَ مِنْهَا خُلُقًا، رَضِيَ مِنْهَا آخَرَ»، (صحیح مسلم، کتاب الرضاع) ”مومن مرد (شوہر) مومنہ عورت (بیوی) سے بغض نہ رکھے۔ اگر اس کی ایک عادت اسے ناپسند ہے تو اس کی دوسری عادت پسندیدہ بھی ہو گی“، مطلب یہ ہے کہ بے حیائی اور نشوز وعصیان کے علاوہ اگر بیوی میں کچھ اور کوتاہیاں ہوں جن کی وجہ سے خاوند اسے ناپسند کرتا ہو تو اسے جلد بازی کا مظاہرہ کرتے ہوئے طلاق نہ دے بلکہ صبر اور برداشت سے کام لے، ہو سکتا ہے اللہ تعالیٰ اس میں سے اس کے لئے خیر کثیر پیدا فرما دے۔ یعنی نیک اولاد دے دے یا اس کی وجہ سے اللہ تعالیٰ اس کے کاروبار میں برکت ڈال دے،وغیرہ وغیرہ۔ افسوس ہے کہ مسلمان قرآن وحدیث کی ان ہدایات کے برعکس ذرا ذرا سی باتوں میں اپنی بیویوں کو طلاق دے ڈالتے ہیں اور اس طرح اسلام کے عطا کردہ حق طلاق کو نہایت ظالمانہ طریقے سے استعمال کرتے ہیں۔ حالانکہ یہ حق تو انتہائی ناگزیر حالات میں استعمال کے لئے دیا گیا تھا، نہ کہ گھر اجاڑنے، عورتوں پر ظلم کرنے اور بچوں کی زندگیاں خراب کرنے کے لئے۔ علاوہ ازیں اس طرح یہ اسلام کی بدنامی کا بھی باعث بنتے ہیں کہ اسلام نے مرد کو طلاق کا حق دے کر عورت پر ظلم کرنے کا اختیار اسے دے دیا۔ یوں اسلام کی ایک بہت بڑی خوبی کو خرابی اور ظلم باور کرایا جاتا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāayyuhā alladhīna āmanū lā yaḥillu lakum an tarithū al-nisāa karhan walā taʿḍulūhunna litadhhabū bibaʿḍi mā ātaytumūhunna illā an yatīna bifāḥishatin mubayyinatin waʿāshirūhunna bil-maʿrūfi fa-in karih'tumūhunna faʿasā an takrahū shayan wayajʿala al-lahu fīhi khayran kathīran ","translations":["O you","who","believe[d]","Not","(is) lawful","for you","that","you inherit","the women","(by) force","And not","you constraint them","so that you may take","a part","(of) what","you have given them","except","that","they commit","immorality","open","And live with them","in kindness","But if","you dislike them","then perhaps","that","you dislike","a thing","and has placed","Allah","in it","good","much","(19)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","lā","yaḥillu","lakum","an","tarithū","al-nisāa","karhan","walā","taʿḍulūhunna","litadhhabū","bibaʿḍi","mā","ātaytumūhunna","illā","an","yatīna","bifāḥishatin","mubayyinatin","waʿāshirūhunna","bil-maʿrūfi","fa-in","karih'tumūhunna","faʿasā","an","takrahū","shayan","wayajʿala","al-lahu","fīhi","khayran","kathīran",null],"verseTiming":[[1,0,2450],[2,2450,3530],[3,3530,4610],[4,4610,5040],[5,5040,5870],[6,5870,6530],[7,6530,7360],[8,7360,8140],[9,8140,10810],[10,10810,11680],[11,11680,12720],[12,12720,14990],[13,14990,16290],[14,16290,17200],[15,17200,18610],[16,18610,21430],[17,21430,22340],[18,22340,22400],[19,22400,24470],[20,24470,24770],[21,24770,26440],[22,26440,27710],[23,27710,30090],[24,30090,32570],[25,32570,35929],[26,35929,36859],[27,36859,39809],[28,39809,41799],[29,41799,42679],[30,42679,43749],[31,43749,45129],[32,45129,47509],[33,47509,48359],[34,48359,49379],[35,49379,50159],[36,50159,51549],[37,51549,52529],[38,52529,53139],[39,53139,53889],[40,53889,56324]]}}