{"name":"4:24","price":"اور (حرام کی گئیں) شوہر والی عورتیں مگر وه جو تمہاری ملکیت میں آجائیں(1) ، اللہ تعالیٰ نے یہ احکام تم پر فرض کر دیئے ہیں، اور ان عورتوں کے سوا اور عورتیں تمہارے لئے حلال کی گئیں کہ اپنے مال کے مہر سے تم ان سے نکاح کرنا چاہو برے کام سے بچنے کے لئے نہ کہ شہوت رانی کرنے کے لئے(2)، اس لئے جن سے تم فائده اٹھاؤ انہیں ان کا مقرر کیا ہوا مہر دے دو(3)، اور مہر مقرر ہو جانے کے بعد تم آپس کی رضامندی سے جو طے کرلو اس میں تم پر کوئی گناه نہیں(4)، بے شک اللہ تعالیٰ علم واﻻ حکمت واﻻ ہے۔","arabic":"۞ وَٱلۡمُحۡصَنَٰتُ مِنَ ٱلنِّسَآءِ إِلَّا مَا مَلَكَتۡ أَيۡمَٰنُكُمۡۖ كِتَٰبَ ٱللَّهِ عَلَيۡكُمۡۚ وَأُحِلَّ لَكُم مَّا وَرَآءَ ذَٰلِكُمۡ أَن تَبۡتَغُواْ بِأَمۡوَٰلِكُم مُّحۡصِنِينَ غَيۡرَ مُسَٰفِحِينَۚ فَمَا ٱسۡتَمۡتَعۡتُم بِهِۦ مِنۡهُنَّ فَـَٔاتُوهُنَّ أُجُورَهُنَّ فَرِيضَةٗۚ وَلَا جُنَاحَ عَلَيۡكُمۡ فِيمَا تَرَٰضَيۡتُم بِهِۦ مِنۢ بَعۡدِ ٱلۡفَرِيضَةِۚ إِنَّ ٱللَّهَ كَانَ عَلِيمًا حَكِيمٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":517,"juzNumber":5,"footnotes":"(1) قرآن کریم میں ”إِحْصَانٌ“ چار معنوں میں مستعمل ہوا ہے۔ (1) شادی (2) آزادی (3) پاک دامنی (4) اور اسلام۔ اس اعتبار سے محصنات کے چار مطلب ہیں (1) شادی شدہ عورتیں (2) آزاد عورتیں (3) پاک دامن عورتیں (4) اور مسلمان عورتیں۔ یہاں پہلا معنی مراد ہے۔ اس کی شان نزول میں آتا ہے کہ جب بعض جنگوں میں کافروں کی عورتیں بھی مسلمانوں کی قید میں آگئیں تو مسلمانوں نے ان سے ہم بستری کرنے میں کراہت محسوس کی کیونکہ وہ شادی شدہ تھیں۔ صحابہ (رضي الله عنهم) نے نبی (صلى الله عليه وسلم) سے پوچھا، جس پر یہ آیت نازل ہوئی (ابن کثیر) جس سے یہ معلوم ہوا کہ جنگ میں حاصل ہونے والی کافر عورتیں، جب مسلمانوں کی لونڈیاں بن جائیں تو شادی شدہ ہونے کے باوجود ان سے مباشرت کرنا جائز ہے۔ البتہ استبرائے رحم ضروری ہے۔ یعنی ایک حیض آنے کے بعد یا حاملہ ہیں تو وضع حمل کے بعد ان سے جنسی تعلق قائم کیا جائے۔ لونڈی کا مسئلہ:نزول قرآن کے وقت غلام اور لونڈی کا سلسلہ عام تھا جسے قرآن نے بند نہیں کیا، البتہ ان کے بارے میں ایسی حکمت عملی اختیار کی گئی کہ جس سے غلاموں اور لونڈیوں کو زیادہ سے زیادہ سہولتیں حاصل ہوں تاکہ غلامی کی حوصلہ شکنی ہو۔ اس کے دو ذریعے تھے۔ ایک توبعض خاندان صدیوں سے ایسے چلے آرہے تھے کہ ان کے مرد اور عورت فروخت کر دیئے جاتے تھے۔ یہی خریدے ہوئے مرد وعورت غلام اور لونڈی کہلاتے تھے۔ مالک کو ان سے ہر طرح کے استمتاع (فائدہ اٹھانے) کا حق حاصل ہوتا تھا۔ دوسرا ذریعہ جنگ میں قیدیوں والا تھا، کہ کافروں کی قیدی عورتوں کو مسلمانوں میں تقسیم کر دیا جاتا تھا اوروہ ان کی لونڈیاں بن کر ان کے پاس رہتی تھیں۔ قیدیوں کے لئے یہ بہترین حل تھا۔ کیونکہ اگر انہیں معاشرے میں یوں ہی آزاد چھوڑ دیا جاتا تو معاشرے میں ان کے ذریعے سے فساد پیدا ہوتا (تفصیل کے لئے ملاحظہ ہو کتاب الرق فی الاسلام، اسلام میں غلامی کی حقیقت از مولانا سعید احمد اکبر آبادی) بہر حاصل مسلمان شادی شدہ عورتیں تو ویسے ہی حرام ہیں تاہم کافر عورتیں بھی حرام ہی ہیں الاّ یہ کہ وہ مسلمانوں کی ملکیت میں آجائیں۔ اس صورت میں استبرائے رحم کے بعد وہ ان کے لئے حلال ہیں۔\n(2) یعنی مذکورہ محرمات قرآنی اور حدیثی کے علاوہ دیگر عورتوں سے نکاح کرنا جائز ہے۔ بشرطیکہ چار چیزیں اس میں ہوں، اول یہ کہ طلب کرو ”أَنْ تَبْتَغُوا“ یعنی دونوں طرف سے ایجاب وقبول ہو۔ دوسری یہ کہ مال یعنی مہر ادا کرنا قبول کرو، تیسری یہ کہ ان کو شادی کی قید (دائمی قبضے) میں لانا مقصود ہو۔ صرف شہوت رانی غرض نہ ہو (جیسے زنا میں یا اس متعہ میں ہوتا ہے جو شیعوں میں رائج ہے یعنی جنسی خواہش کی تسکین کے لئے چند روز یا چند گھنٹوں کا نکاح )۔ چوتھی یہ کہ چھپی یاری دوستی نہ ہو بلکہ گواہوں کی موجودگی میں نکاح ہو۔ یہ چاروں شرطیں اس آیت سے مستفاد ہیں۔ اس سے جہاں شیعوں کے متعہ کا بطلان ہوتا ہے وہیں مروجہ حلالہ کا بھی ناجائز ہونا ثابت ہوتا ہے کیونکہ اس کا مقصد بھی عورت کو نکاح کی دائمی قید میں لانا نہیں ہوتا، بلکہ عرفاً یہ صرف ایک رات کے لئے مقرر اور معہود ذہنی ہے۔\n(3) یہ اس امرکی تاکید ہے کہ جن عورتوں سے تم نکاح شرعی کے ذریعے سے استمتاع اور تلذذ کرو۔ انہیں ان کا مقرر کردہ مہر ضرور ادا کرو۔\n(4) اس میں آپس کی رضا مندی سے مہر میں کمی بیشی کرنے کا اختیار دیا گیا ہے۔ ملحوظة: استمتاع کے لفظ سے شیعہ حضرات نکاح متعہ کا اثبات کرتے ہیں۔ حالانکہ اس سے مراد نکاح کے بعد صحبت ومباشرت کا استمتاع ہے، جیسا کہ ہم نے بیان کیا ہے۔ البتہ متعہ ابتدائے اسلام میں جائز رہا ہے اور اس کا جواز اس آیت کی بنیاد پر نہیں تھا، بلکہ اس رواج کی بنیاد پر تھا جو اسلام سے قبل چلا آرہا تھا۔ پھر نبی (صلى الله عليه وسلم) نے نہایت واضح الفاظ میں اسے قیامت تک کے لئے حرام کر دیا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wal-muḥ'ṣanātu mina al-nisāi illā mā malakat aymānukum kitāba al-lahi ʿalaykum wa-uḥilla lakum mā warāa dhālikum an tabtaghū bi-amwālikum muḥ'ṣinīna ghayra musāfiḥīna famā is'tamtaʿtum bihi min'hunna faātūhunna ujūrahunna farīḍatan walā junāḥa ʿalaykum fīmā tarāḍaytum bihi min baʿdi al-farīḍati inna al-laha kāna ʿalīman ḥakīman ","translations":["And (prohibited are) the ones who are married","of","the women","except","whom","you possess","rightfully","Decree","(of) Allah","upon you","And are lawful","to you","what","(is) beyond","that","that","you seek","with your wealth","desiring to be chaste","not","(to be) lustful","So what","you benefit[ed]","of it","from them","so you give them","their bridal due","(as) an obligation","And (there is) no","sin","on you","concerning what","you mutually agree","of it","from","beyond","the obligation","Indeed","Allah","is","All-Knowing","All-Wise","(24)"],"transliterationArr":["wal-muḥ'ṣanātu","mina","al-nisāi","illā","mā","malakat","aymānukum","kitāba","al-lahi","ʿalaykum","wa-uḥilla","lakum","mā","warāa","dhālikum","an","tabtaghū","bi-amwālikum","muḥ'ṣinīna","ghayra","musāfiḥīna","famā","is'tamtaʿtum","bihi","min'hunna","faātūhunna","ujūrahunna","farīḍatan","walā","junāḥa","ʿalaykum","fīmā","tarāḍaytum","bihi","min","baʿdi","al-farīḍati","inna","al-laha","kāna","ʿalīman","ḥakīman",null],"verseTiming":[[1,0,1840],[2,1840,2170],[3,2170,4930],[4,4930,5730],[5,5730,6120],[6,6120,7000],[7,7000,8480],[8,8480,9220],[9,9220,10190],[10,10190,11620],[11,11620,12530],[12,12530,13260],[13,13260,14200],[14,14200,16350],[15,16350,17380],[16,17380,17960],[17,17960,19410],[18,19410,20910],[19,20910,22790],[20,22790,23480],[21,23480,26520],[22,26520,26870],[23,26870,28280],[24,28280,29640],[25,29640,31170],[26,31170,33340],[27,33340,35360],[28,35360,36800],[29,36800,37370],[30,37370,38180],[31,38180,39270],[32,39270,40060],[33,40060,42210],[34,42210,42770],[35,42770,43700],[36,43700,44330],[37,44330,46030],[38,46030,47000],[39,47000,47910],[40,47910,48590],[41,48590,49610],[42,49610,51155]]}}