{"name":"4:29","price":"اے ایمان والو! اپنے آپس کے مال ناجائز طریقہ سے مت کھاؤ(1) ، مگر یہ کہ تمہاری آپس کی رضا مندی سے ہو خرید وفروخت(2)، اور اپنے آپ کو قتل نہ کرو(3) یقیناً اللہ تعالیٰ تم پر نہایت مہربان ہے۔","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَأۡكُلُوٓاْ أَمۡوَٰلَكُم بَيۡنَكُم بِٱلۡبَٰطِلِ إِلَّآ أَن تَكُونَ تِجَٰرَةً عَن تَرَاضٖ مِّنكُمۡۚ وَلَا تَقۡتُلُوٓاْ أَنفُسَكُمۡۚ إِنَّ ٱللَّهَ كَانَ بِكُمۡ رَحِيمٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":522,"juzNumber":5,"footnotes":"(1) بِالْبَاطِلِ میں دھوکہ، فریب، جعل سازی، ملاوٹ کے علاوہ وہ تمام کاروبار بھی شامل ہیں جن سے شریعت نے منع کیا ہے،جیسے قمار، ربا، وغیرہ۔ اسی طرح ممنوع اور حرام چیزوں کا کاروبار کرنا بھی باطل میں شامل ہے۔ مثلاً بلا ضرورت فوٹو گرافی، ریڈیو، ٹی وی، وی سی آر، ویڈیو فلمیں اور فحش کیسٹیں وغیرہ۔ ان کا بنانا، بیچنا، مرمت کرنا سب ناجائز ہے۔\n(2) اس کےلئے بھی شرط یہ ہے کہ یہ لین دین حلال اشیا کا ہو، حرام اشیاء کا کاروبار باہمی رضامندی کے باوجود ناجائز ہی رہے گا۔ علاوہ ازیں رضامندی میں خیارمجلس کا مسئلہ بھی آجاتا ہے یعنی جب تک ایک دوسرے سے جدا نہ ہوں سودا فسخ کرنے کا اختیار رہے گا جیسا کہ حدیث میں ہے ”الْبَيِّعَانِ بِالْخِيَارِ مَا لَمْ يَتَفَرَّقَا“ (صحيح بخاري- ومسلم كتاب البيوع) دونوں باہم سودا کرنے والوں کو، جب تک جدا نہ ہوں، اختیار ہے۔\n(3) اس سے مراد خودکشی بھی ہو سکتی ہے جو کیبرہ گناہ ہے اور ارتکاب معصیت بھی جو ہلاکت کا باعث ہے اور کسی مسلمان کو قتل کرنا بھی کیونکہ مسلمان جسد واحد کی طرح ہیں۔ اس لئے اس کا قتل بھی ایسا ہی ہے جیسے اپنے آپ کو قتل کیا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāayyuhā alladhīna āmanū lā takulū amwālakum baynakum bil-bāṭili illā an takūna tijāratan ʿan tarāḍin minkum walā taqtulū anfusakum inna al-laha kāna bikum raḥīman ","translations":["O you","who","believe[d]","(Do) not","eat","your wealth","between yourselves","unjustly","But","that","(there) be","business","on","mutual consent","among you","And (do) not","kill","yourselves","Indeed","Allah","is","to you","Most Merciful","(29)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","lā","takulū","amwālakum","baynakum","bil-bāṭili","illā","an","takūna","tijāratan","ʿan","tarāḍin","minkum","walā","taqtulū","anfusakum","inna","al-laha","kāna","bikum","raḥīman",null],"verseTiming":[[1,0,2720],[2,2720,3640],[3,3640,4540],[4,4540,4860],[5,4860,6840],[6,6840,8900],[7,8900,10210],[8,10210,11530],[9,11530,12360],[10,12360,14710],[11,14710,15460],[12,15460,16200],[13,16200,17360],[14,17360,18170],[15,18170,19010],[16,19010,21160],[17,21160,21670],[18,21670,23690],[19,23690,26250],[20,26250,27640],[21,27640,28430],[22,28430,29060],[23,29060,29630],[24,29630,31085]]}}