{"name":"4:31","price":"اگر تم ان بڑے گناہوں سے بچتے رہوگے جن سے تم کو منع کیا جاتا ہے(1) تو ہم تمہارے چھوٹے گناه دور کر دیں گے اور عزت وبزرگی کی جگہ داخل کریں گے۔","arabic":"إِن تَجۡتَنِبُواْ كَبَآئِرَ مَا تُنۡهَوۡنَ عَنۡهُ نُكَفِّرۡ عَنكُمۡ سَيِّـَٔاتِكُمۡ وَنُدۡخِلۡكُم مُّدۡخَلٗا كَرِيمٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":524,"juzNumber":5,"footnotes":"(1) کبیرہ گناہ کی تعریف میں اختلاف ہے۔ بعض کےنزدیگ وہ گناہ ہیں جن پر حد مقرر ہے، بعض کے نزدیک وہ گناہ جس پر قرآن میں یا حدیث میں سخت وعید یا لعنت آئی ہے، بعض کہتے ہیں کہ ہر وہ کام جس سے اللہ نے یا اس کے رسول نے بطور تحریم کے روکا ہے اور حقیقت یہ ہے کہ ان میں سے کوئی ایک بات بھی کسی گناہ میں پائی جائے تو وہ کبیرہ ہے۔ احادیث میں مختلف کبیرہ گناہوں کا ذکر ہے جنہیں بعض علما نے ایک کتاب میں جمع بھی کیا ہے۔ جیسے الكبائر للذهبي، الزواجر عن اقتراف الكبائر للهيتمي وغیرہ۔ یہاں یہ اصول بیان کیا گیا ہے کہ جو مسلمان کبیرہ گناہوں مثلاً شرک، عقوق والدین، جھوٹ وغیرہ سے اجتناب کرے گا تو ہم اس کے صغیرہ گناہ معاف کر دیں گے۔ سورۂ نجم میں بھی یہ مضمون بیان کیا گیا ہے، البتہ وہاں کبائر کے ساتھ فواحش (بے حیائی کے کاموں) سے اجتناب کوبھی صغیرہ گناہوں کی معافی کے لئے ضروری قرار دیا گیا ہے۔ علاوہ ازیں صغیرہ گناہوں پر اصرار ومداومت بھی صغیرہ گناہوں کو کبائر بنا دیتے ہیں۔ اسی طرح اجتناب کبائر کے ساتھ احکام وفرائض اسلام کی پابندی اور اعمال صالحہ کا اہتمام بھی نہایت ضروری ہے۔ صحابہ کرام (رضي الله عنهم) نے شریعت کے اس مزاج کو سمجھ لیا تھا، اس لئے انہوں نے صرف وعدۂ مغفرت پر ہی تکیہ نہیں کیا، بلکہ مغفرت ورحمت الٰہی کے یقینی حصول کے لئے مذکورہ تمام ہی باتوں کا اہتمام کیا۔ جب کہ ہمارا دامن عمل سے تو خالی ہے لیکن ہمارے قلب امیدوں اور آرزؤں سے معمور ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"in tajtanibū kabāira mā tun'hawna ʿanhu nukaffir ʿankum sayyiātikum wanud'khil'kum mud'khalan karīman ","translations":["If","you avoid","great (sins)","(of) what","you are forbidden","from [it]","We will remove","from you","your evil deeds","and We will admit you","(to) an entrance","noble","(31)"],"transliterationArr":["in","tajtanibū","kabāira","mā","tun'hawna","ʿanhu","nukaffir","ʿankum","sayyiātikum","wanud'khil'kum","mud'khalan","karīman",null],"verseTiming":[[1,0,690],[2,690,2690],[3,2690,5430],[4,5430,5760],[5,5760,6760],[6,6760,7380],[7,7380,8350],[8,8350,9690],[9,9690,11320],[10,11320,14050],[11,14050,15800],[12,15800,17240],[13,17240,18710],[14,18710,19900],[15,19900,21005]]}}