{"name":"4:33","price":"ماں باپ یا قرابت دار جو چھوڑ مریں اس کے وارث ہم نے ہر شخص کے مقرر کر دیئے ہیں(1) اور جن سے تم نے اپنے ہاتھوں معاہده کیا ہے انہیں ان کا حصہ دو(2) حقیقتاً اللہ تعالیٰ ہر چیز پر حاضر ہے۔","arabic":"وَلِكُلّٖ جَعَلۡنَا مَوَٰلِيَ مِمَّا تَرَكَ ٱلۡوَٰلِدَانِ وَٱلۡأَقۡرَبُونَۚ وَٱلَّذِينَ عَقَدَتۡ أَيۡمَٰنُكُمۡ فَـَٔاتُوهُمۡ نَصِيبَهُمۡۚ إِنَّ ٱللَّهَ كَانَ عَلَىٰ كُلِّ شَيۡءٖ شَهِيدًا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":526,"juzNumber":5,"footnotes":"(1) مَوَالِي، مَوْلى کے جمع ہے۔ مولیٰ کے معنی ہیں دوست، آزاد کردہ غلام، چچا زاد، پڑوسی۔ لیکن یہاں اس سے مراد ورثا ہیں۔ مطلب یہ ہے کہ ہر مرد عورت جو کچھ چھوڑ جائیں گے، اس کے وارث ان کے ماں باپ اور دیگر قریبی رشتہ دار ہوں گے۔\n(2) اس آیت کے محکم یا منسوخ ہونے کے بارے میں مفسرین کا اختلاف ہے۔ ابن جریر طبری وغیرہ اسے غیر منسوخ (محکم) مانتے ہیں اور أَيْمَانُكُمْ (معاہدہ) سے مراد وہ حلف اور معاہدہ لیتے ہیں جو ایک دوسرے کی مدد کے لئے اسلام سے قبل دو اشخاص یا دو قبیلوں کے درمیان ہو اور اسلام کے بعد بھی چلا آرہا تھا۔ نَصِيبَهُمْ (حصہ) سے مراد اسی حلف اور معاہدے کی پابندی کے مطابق تعاون وتناصر کا حصہ ہے اور ابن کثیر اور دیگر مفسرین کے نزدیک یہ آیت منسوخ ہے کیونکہ ایمانکم سے ان کے نزدیک وہ معاہدہ ہے جو ہجرت کے بعد ایک انصاری اور مہاجر کے درمیان اخوت کی صورت میں ہوا تھا۔ اس میں ایک مہاجر، انصاری کے مال کا اس کے رشتہ داروں کی بجائے، وارث ہوتا تھا لیکن یہ چونکہ ایک عارضی انتظام تھا، اس لئے پھر ”وَأُولُو الأَرْحَامِ بَعْضُهُمْ أَوْلَى بِبَعْضٍ فِي كِتَابِ اللَّهِ“ ( الانفال: 75 ) رشتے دار اللہ کے حکم کی رو سے ایک دوسرے کے زیادہ حق دار ہیں نازل فرماکر اسے منسوخ کر دیا گیا۔ اب ”فَآتُوهُمْ نَصِيبَهُم“ْ سے مراد دوستی ومحبت اور ایک دوسرے کی مدد ہے اور بطور وصیت کچھ دے دینا بھی اس میں شامل ہے۔ موالات عقد، موالات حلف یا موالات اخوت میں اب وراثت کا تصور نہیں ہوگا۔ اہل علم کے ایک گروہ نے اس سے مراد ایسے دو شخصوں کو لیا جن میں سے کم از کم ایک لاوارث ہے۔ اور ایک دوسرے شخص سے یہ طے کرتا ہے کہ میں تمہارا مولی ہوں۔ اگر کوئی جنایت کروں تو میری مدد کرنا اور اگر مارا جاؤں تو میری دیت لے لینا۔ اس لاوارث کی وفات کے بعد اس کا مال مزکورہ شخص لے گا۔ بشرطیکہ واقعتاً اس کا کوئی وارث نہ ہو۔ بعض دوسرے اہل علم نے اس آیت کا ایک اور معنی بیان کیا ہے۔ وہ کہتے ہیں کہ وَالَّذِينَ عَقَدَتْ أَيْمَانُكُمْ سے مراد بیوی اور شوہر ہیں اور اس کا عطف الأَقْرَبُونَ پر ہے۔ معنی یہ ہیں کہ ماں باپ نے، قرابت داروں نے اور جن کو تمہارا عہد وپیان آپس میں باندھ چکا ہے (یعنی شوہر یا بیوی) انہوں نے جو کچھ چھوڑا اس کے حقدار یعنی حصے دار ہم نے مقرر کر دیئے ہیں۔ لہٰذا ان حقداروں کو ان کے حصے دو گویا پیچھے آیات میراث میں تفصیلاً جو حصے بیان کئے گئے تھے یہاں اجمالاً ان کی ادائیگی کی تاکید مزید کی گئی ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walikullin jaʿalnā mawāliya mimmā taraka al-wālidāni wal-aqrabūna wa-alladhīna ʿaqadat aymānukum faātūhum naṣībahum inna al-laha kāna ʿalā kulli shayin shahīdan ","translations":["And for all","We (have) made","heirs","of what","(is) left","(by) the parents","and the relatives","And those whom","pledged","your right hands ","then give them","their share","Indeed","Allah","is","over","every","thing","a Witness","(33)"],"transliterationArr":["walikullin","jaʿalnā","mawāliya","mimmā","taraka","al-wālidāni","wal-aqrabūna","wa-alladhīna","ʿaqadat","aymānukum","faātūhum","naṣībahum","inna","al-laha","kāna","ʿalā","kulli","shayin","shahīdan",null],"verseTiming":[[1,0,1340],[2,1340,3080],[3,3080,4110],[4,4110,5310],[5,5310,5920],[6,5920,7420],[7,7420,10490],[8,10490,11640],[9,11640,12500],[10,12500,13890],[11,13890,15450],[12,15450,17170],[13,17170,18430],[14,18430,19290],[15,19290,19830],[16,19830,20570],[17,20570,21210],[18,21210,22750],[19,22750,24405]]}}