{"name":"4:34","price":"مرد عورتوں پر حاکم ہیں اس وجہ سے کہ اللہ تعالیٰ نے ایک کو دوسرے پر فضیلت دی ہے اور اس وجہ سے کہ مردوں نے اپنے مال خرچ کئے ہیں(1) ، پس نیک فرمانبردار عورتین خاوند کی عدم موجودگی میں بہ حفاﻇت الٰہی نگہداشت رکھنے والیاں ہیں اور جن عورتوں کی نافرمانی اور بددماغی کا تمہیں خوف ہو انہیں نصیحت کرو اور انہیں الگ بستروں پر چھوڑ دو اور انہیں مار کی سزا دو پھر اگر وه تابعداری کریں تو ان پر کوئی راستہ تلاش نہ کرو(2)، بے شک اللہ تعالیٰ بڑی بلندی اور بڑائی واﻻ ہے۔","arabic":"ٱلرِّجَالُ قَوَّٰمُونَ عَلَى ٱلنِّسَآءِ بِمَا فَضَّلَ ٱللَّهُ بَعۡضَهُمۡ عَلَىٰ بَعۡضٖ وَبِمَآ أَنفَقُواْ مِنۡ أَمۡوَٰلِهِمۡۚ فَٱلصَّٰلِحَٰتُ قَٰنِتَٰتٌ حَٰفِظَٰتٞ لِّلۡغَيۡبِ بِمَا حَفِظَ ٱللَّهُۚ وَٱلَّٰتِي تَخَافُونَ نُشُوزَهُنَّ فَعِظُوهُنَّ وَٱهۡجُرُوهُنَّ فِي ٱلۡمَضَاجِعِ وَٱضۡرِبُوهُنَّۖ فَإِنۡ أَطَعۡنَكُمۡ فَلَا تَبۡغُواْ عَلَيۡهِنَّ سَبِيلًاۗ إِنَّ ٱللَّهَ كَانَ عَلِيّٗا كَبِيرٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":527,"juzNumber":5,"footnotes":"(1) اس میں مرد کی حاکمیت وقوامیت کی دو وجہیں بیان کی گئی ہیں۔ ایک وہبی ہے جو مردانہ قوت ودماغی صلاحیت ہے جس میں مرد عورت سے خلقی طور پر ممتاز ہے۔ دوسری وجہ کسبی ہے، جس کا مکلف شریعت نے مرد کو بنایا ہے اور عورت کو اس کی فطری کمزوری اور مخصوص تعلیمات کی وجہ سے جنہیں اسلام نے عورت کی عفت وحیا اور اس کے تقدس کے تحفظ کے لئے ضروری قرار دیا ہے، عورت کو معاشی جھمیلوں سے دور رکھا ہے۔ عورت کی سربراہی کے خلاف قرآن کریم کی یہ نص قطعی بالکل واضح ہے،جس کی تائید صحیح بخاری کی اس حدیث میں ہوتی ہے۔ جس میں نبی کریم (صلى الله عليه وسلم) نے فرمایا ہے ”وہ قوم ہر گز فلاح یاب نہیں ہوگی جس نے اپنے امور ایک عورت کے سپرد کر دیئے“۔ (صحيح البخاري- كتاب المغازي- باب كتاب النبي إلى كسرى وقيصر وكتاب الفتن باب 18)\n(2) نافرمانی کی صورت میں عورت کو سمجھانے کے لئے سب سے پہلے وعظ ونصیحت کا نمبر ہے، دوسرے نمبر پر ان سے وقتی اور عارضی علیحدگی ہے جو سمجھ دار عورت کے لئے بہت بڑی تنبیہ ہے۔ اس سے بھی نہ سمجھے تو ہلکی سی مار کی اجازت ہے۔ لیکن یہ مار وحشیانہ اور ظالمانہ نہ ہو جیسا کہ جاہل لوگوں کا وطیرہ ہے۔ اللہ تعالیٰ اور اس کے رسول (صلى الله عليه وسلم) نے اس ظلم کی اجازت کسی مرد کو نہیں دی ہے۔ اگر وہ اصلاح کر لے تو پھر راستہ تلاش نہ کرو یعنی مار پیٹ نہ کرو تنگ نہ کرو، یا طلاق نہ دو، گویا طلاق بالکل آخری مرحلہ ہے جب کوئی اور چارۂ کار باقی نہ رہے، لیکن مرد اس حق کو بھی بہت ناجائز طریقے سے استعمال کرتے ہیں اور ذرا ذرا سی بات میں فوراً طلاق دے ڈالتے ہیں اور اپنی زندگی بھی برباد کرتے ہیں، عورت کی بھی اور بچے ہوں تو ان کی بھی۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"al-rijālu qawwāmūna ʿalā al-nisāi bimā faḍḍala al-lahu baʿḍahum ʿalā baʿḍin wabimā anfaqū min amwālihim fal-ṣāliḥātu qānitātun ḥāfiẓātun lil'ghaybi bimā ḥafiẓa al-lahu wa-allātī takhāfūna nushūzahunna faʿiẓūhunna wa-uh'jurūhunna fī al-maḍājiʿi wa-iḍ'ribūhunna fa-in aṭaʿnakum falā tabghū ʿalayhinna sabīlan inna al-laha kāna ʿaliyyan kabīran ","translations":["[The] men","(are) protectors","of","the women","because","(has) bestowed","Allah","some of them","over","others","and because","they spend","from","their wealth","So the righteous women","(are) obedient","guarding","in the unseen","that which","(orders) them to guard","(by) Allah","And those (from) whom","you fear","their ill-conduct","then advise them","and forsake them","in","the bed","and [finally] strike them","Then if","they obey you","then (do) not","seek","against them","a way","Indeed","Allah","is","Most High","Most Great","(34)"],"transliterationArr":["al-rijālu","qawwāmūna","ʿalā","al-nisāi","bimā","faḍḍala","al-lahu","baʿḍahum","ʿalā","baʿḍin","wabimā","anfaqū","min","amwālihim","fal-ṣāliḥātu","qānitātun","ḥāfiẓātun","lil'ghaybi","bimā","ḥafiẓa","al-lahu","wa-allātī","takhāfūna","nushūzahunna","faʿiẓūhunna","wa-uh'jurūhunna","fī","al-maḍājiʿi","wa-iḍ'ribūhunna","fa-in","aṭaʿnakum","falā","tabghū","ʿalayhinna","sabīlan","inna","al-laha","kāna","ʿaliyyan","kabīran",null],"verseTiming":[[1,0,1450],[2,1450,2890],[3,2890,3300],[4,3300,6219],[5,6219,6769],[6,6769,7549],[7,7549,8509],[8,8509,9529],[9,9529,10239],[10,10239,11629],[11,11629,13699],[12,13699,15099],[13,15099,15499],[14,15499,16889],[15,16889,18949],[16,18949,20309],[17,20309,21669],[18,21669,22929],[19,22929,23469],[20,23469,24039],[21,24039,26649],[22,26649,27879],[23,27879,29149],[24,29149,30879],[25,30879,32979],[26,32979,34979],[27,34979,35199],[28,35199,36519],[29,36519,38759],[30,38759,39819],[31,39819,41109],[32,41109,41719],[33,41719,42649],[34,42649,44659],[35,44659,46229],[36,46229,47509],[37,47509,48419],[38,48419,49029],[39,49029,50639],[40,50639,52324]]}}