{"name":"4:36","price":"اور اللہ تعالیٰ کی عبادت کرو اور اس کے ساتھ کسی کو شریک نہ کرو اور ماں باپ کے ساتھ سلوک واحسان کرو اور رشتہ داروں سے اور یتیموں سے اور مسکینوں سے اور قرابت دار ہمسایہ سے اور اجنبی ہمسایہ سے(1) اور پہلو کے ساتھی سے(2) اور راه کے مسافر سے اور ان سے جن کے مالک تمہارے ہاتھ ہیں، (غلام کنیز)(3) یقیناً اللہ تعالیٰ تکبر کرنے والوں اور شیخی خوروں کو پسند نہیں فرماتا۔(4)","arabic":"۞ وَٱعۡبُدُواْ ٱللَّهَ وَلَا تُشۡرِكُواْ بِهِۦ شَيۡـٔٗاۖ وَبِٱلۡوَٰلِدَيۡنِ إِحۡسَٰنٗا وَبِذِي ٱلۡقُرۡبَىٰ وَٱلۡيَتَٰمَىٰ وَٱلۡمَسَٰكِينِ وَٱلۡجَارِ ذِي ٱلۡقُرۡبَىٰ وَٱلۡجَارِ ٱلۡجُنُبِ وَٱلصَّاحِبِ بِٱلۡجَنۢبِ وَٱبۡنِ ٱلسَّبِيلِ وَمَا مَلَكَتۡ أَيۡمَٰنُكُمۡۗ إِنَّ ٱللَّهَ لَا يُحِبُّ مَن كَانَ مُخۡتَالٗا فَخُورًا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":529,"juzNumber":5,"footnotes":"(1) الْجَارِ الْجُنُبِ قرابت دار پڑوسی کے مقابلے میں استعمال ہوا ہے جس کے معنی ہیں ایسا پڑوسی جس سے قرابت داری نہ ہو۔ مطلب یہ ہے کہ پڑوسی سے بہ حیثیت پڑوسی کے حسن سلوک کیا جائے، وہ رشتہ دار ہو یا غیر رشتہ دار جس طرح کہ احادیث میں بھی اس کی بڑی تاکید بیان کی گئی ہے۔\n(2) اس سے مراد رفیق سفر، شریک کار، بیوی اور وہ شخص جو فائدے کی امید پر کسی کی قربت وہم نشینی اختیار کرے۔ بلکہ اس کی تعریف میں وہ لوگ بھی آسکتے ہیں جنہیں تحصیل علم، تعلم صناعت (کوئی کام سیکھنے) کے لئے یا کسی کاروبارﯼ سلسلے میں آپ کے پاس بیٹھنے کا موقع ملے۔ (فتح القدیر)\n(3) اس میں گھر، دوکان اور کارخانوﮞ، ملوں کے ملازم اور نوکر چاکر بھی آجاتے ہیں، غلاموں کے ساتھ حسن سلوک کی بڑی تاکید احادیث میں آئی ہے۔\n(4) فخر وغرور اور تکبر اللہ تعالیٰ کو سخت ناپسند ہے بلکہ ایک حدیث میں یہاں تک آتا ہے کہ ”وہ شخص جنت میں نہیں جائے گا جس کے دل میں رائی کے دانے کے برابر بھی کبر ہوگا۔“ (صحیح مسلم کتاب الایمان، باب تحریم الکبر وبیانہ حدیث نمبر 19) یہاں کبر کی بطور خاص مذمت سے یہ مقصد ہے کہ اللہ تعال۔ کی عبادت اور جن جن لوگوں سے حسن سلوک کی تاکید کی گئی ہے۔ اس پر عمل وہی شخص کر سکتا ہے جس کا دل کبر سے خالی ہوگا۔ متکبر اور مغرورشخص صحیح معنوں مین نہ حق عبادت ادا کر سکتا ہے اور نہ اپنوں اور بیگانوں کے ساتھ حسن سلوک کا اہتمام۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-uʿ'budū al-laha walā tush'rikū bihi shayan wabil-wālidayni iḥ'sānan wabidhī al-qur'bā wal-yatāmā wal-masākīni wal-jāri dhī al-qur'bā wal-jāri al-junubi wal-ṣāḥibi bil-janbi wa-ib'ni al-sabīli wamā malakat aymānukum inna al-laha lā yuḥibbu man kāna mukh'tālan fakhūran ","translations":["And worship","Allah","And (do) not","associate","with Him","anything","and to the parents","(do) good","and with","the relatives","and the orphans","and the needy","and the neighbor","(who is)","near","and the neighbor","(who is) farther away","and the companion","by your side","and the","traveler","and what","possess[ed]","your right hands","Indeed","Allah","(does) not","love","(the one) who","is","[a] proud","(and) [a] boastful","(36)"],"transliterationArr":["wa-uʿ'budū","al-laha","walā","tush'rikū","bihi","shayan","wabil-wālidayni","iḥ'sānan","wabidhī","al-qur'bā","wal-yatāmā","wal-masākīni","wal-jāri","dhī","al-qur'bā","wal-jāri","al-junubi","wal-ṣāḥibi","bil-janbi","wa-ib'ni","al-sabīli","wamā","malakat","aymānukum","inna","al-laha","lā","yuḥibbu","man","kāna","mukh'tālan","fakhūran",null],"verseTiming":[[1,0,1970],[2,1970,2810],[3,2810,3300],[4,3300,4290],[5,4290,4840],[6,4840,6170],[7,6170,7860],[8,7860,9290],[9,9290,11510],[10,11510,13190],[11,13190,13720],[12,13720,14730],[13,14730,16130],[14,16130,17790],[15,17790,18840],[16,18840,18990],[17,18990,20050],[18,20050,21050],[19,21050,21920],[20,21920,23190],[21,23190,24730],[22,24730,25310],[23,25310,26380],[24,26380,26920],[25,26920,27800],[26,27800,29590],[27,29590,30720],[28,30720,31560],[29,31560,32020],[30,32020,32850],[31,32850,33670],[32,33670,34330],[33,34330,36210],[34,36210,37895]]}}