{"name":"4:41","price":"پس کیا حال ہوگا جس وقت کہ ہر امت میں سے ایک گواه ہم ﻻئیں گے اور آپ کو ان لوگوں پر گواه بناکر ﻻئیں گے۔(1)","arabic":"فَكَيۡفَ إِذَا جِئۡنَا مِن كُلِّ أُمَّةِۭ بِشَهِيدٖ وَجِئۡنَا بِكَ عَلَىٰ هَٰٓؤُلَآءِ شَهِيدٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":534,"juzNumber":5,"footnotes":"(1) ہر امت میں سے اس کا پیغمبر اللہ کی بارگاہ میں گواہی دے گا کہ یااللہ ! ہم نے تو تیرا پیغام اپنی قوم کو پہنچا دیا تھا، اب انہوں نے نہیں مانا تو ہمارا کیا قصور ؟ پھر ان سب پر نبی کریم (صلى الله عليه وسلم) گواہی دیں گے کہ یا اللہ! یہ سچے ہیں۔ آپ (صلى الله عليه وسلم) یہ گواہی اس قرآن کی وجہ سے دیں گے جو آپ (صلى الله عليه وسلم) پر نازل ہوا اور جس میں گزشتہ انبیاء اور ان کی قوموں کی سرگزشت بھی حسب ضرورت بیان کی گئی ہے۔ یہ ایک سخت مقام ہوگا، اس کا تصور ہی لرزہ براندام کر دینے والا ہے۔ حدیث میں آتا ہے کہ ایک مرتبہ نبی کریم (صلى الله عليه وسلم) نے حضرت عبداللہ بن مسعود (رضی اللہ عنہ) سے قرآن سننے کی خواہش ظاہر فرمائی، وہ سناتے ہوئے جب اس آیت پر پہنچے تو آپ (صلى الله عليه وسلم) نے فرمایا: ”بس، اب کافی ہے“۔ حضرت ابن مسعود (رضی اللہ عنہ) فرماتے ہیں کہ میں نے دیکھا تو آپ (صلى الله عليه وسلم) کی دونوں آنکھوں میں آنسو رواں تھے۔ (صحيح بخاري، فضائل القرآن) بعض لوگ کہتے ہیں کہ گواہی وہی دے سکتا ہے جو سب کچھ اپنی آنکھوں سے دیکھے۔ اس لئے وہ شہید (گواہ) کے معنی حاضر ناظر کے کرتے ہیں اور یوں نبی (صلى الله عليه وسلم) کو حاضر ناظر باور کراتے ہیں۔ لیکن نبی (صلى الله عليه وسلم) کو حاضر ناظر سمجھنا، یہ آپ (صلى الله عليه وسلم) کو اللہ کی صفت میں شریک کرنا ہے جو شرک ہے کیونکہ حاضر وناظر صرف اللہ تعالیٰ کی صفت ہے۔ شہید کے لفظ سے ان کا استدلال اپنے اندر کوئی قوت نہیں رکھتا۔ اس لئے کہ شہادت یقینی علم کی بنیاد پر بھی ہوتی ہے اور قرآن میں بیان کردہ حقائق وواقعات سے زیادہ یقینی علم کس کا ہو سکتا ہے؟ اسی یقینی علم کی بنیاد پر خود امت محمدیہ کو بھی قرآن نے ”شُهَدَاءَ عَلَى النَّاسِ“ (تمام کائنات کے لوگوں پر گواہ) کہا ہے۔ اگر گواہی کے لئے حاضر وناظر ہونا ضروری ہے تو پھر امت محمدیہ کے ہر فرد کو حاضر وناظر ماننا پڑے گا۔ بہرحال نبی (صلى الله عليه وسلم) کے بارے میں یہ عقیدہ مشرکانہ اور بے بنیاد ہے۔ أَعَاذَنَا اللهُ مِنْهُ","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"fakayfa idhā ji'nā min kulli ummatin bishahīdin waji'nā bika ʿalā hāulāi shahīdan ","translations":["So how (will it be)","when","We bring","from","every","nation","a witness","and We bring","you","against","these (people)","(as) a witness","(41)"],"transliterationArr":["fakayfa","idhā","ji'nā","min","kulli","ummatin","bishahīdin","waji'nā","bika","ʿalā","hāulāi","shahīdan",null],"verseTiming":[[1,0,850],[2,850,1500],[3,1500,2320],[4,2320,3480],[5,3480,4020],[6,4020,6070],[7,6070,7290],[8,7290,8830],[9,8830,9250],[10,9250,9910],[11,9910,13320],[12,13320,14615]]}}