{"name":"4:43","price":"اے ایمان والو! جب تم نشے میں مست ہو نماز کے قریب بھی نہ جاؤ(1) ، جب تک کہ اپنی بات کو سمجھنے نہ لگو اور جنابت کی حالت میں جب تک کہ غسل نہ کر لو(2)، ہاں اگر راه چلتے گزر جانے والے ہو تو اور بات ہے(3) اور اگر تم بیمار ہو یا سفر میں ہو یا تم میں سے کوئی قضائے حاجت سے آیا ہو یا تم نے عورتوں سے مباشرت کی ہو اور تمہیں پانی نہ ملے تو پاک مٹی کا قصد کرو اور اپنے منھ اور اپنے ہاتھ مل لو(4)۔ بے شک اللہ تعالیٰ معاف کرنے واﻻ، بخشنے واﻻ ہے۔","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَقۡرَبُواْ ٱلصَّلَوٰةَ وَأَنتُمۡ سُكَٰرَىٰ حَتَّىٰ تَعۡلَمُواْ مَا تَقُولُونَ وَلَا جُنُبًا إِلَّا عَابِرِي سَبِيلٍ حَتَّىٰ تَغۡتَسِلُواْۚ وَإِن كُنتُم مَّرۡضَىٰٓ أَوۡ عَلَىٰ سَفَرٍ أَوۡ جَآءَ أَحَدٞ مِّنكُم مِّنَ ٱلۡغَآئِطِ أَوۡ لَٰمَسۡتُمُ ٱلنِّسَآءَ فَلَمۡ تَجِدُواْ مَآءٗ فَتَيَمَّمُواْ صَعِيدٗا طَيِّبٗا فَٱمۡسَحُواْ بِوُجُوهِكُمۡ وَأَيۡدِيكُمۡۗ إِنَّ ٱللَّهَ كَانَ عَفُوًّا غَفُورًا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":536,"juzNumber":5,"footnotes":"(1) یہ حکم اس وقت دیا گیا تھا کہ ابھی شراب کی حرمت نازل نہیں ہوئی تھی۔ چنانچہ ایک دعوت میں شراب نوشی کے بعد جب نماز کے لئے کھڑے ہوئے تو نشے میں قرآن کے الفاظ بھی امام صاحب غلط پڑھ گئے۔ (تفصیل کے لئے دیکھئے ترمذی، تفسیر سورۃ النساء) جس پر یہ آیت نازل ہوئی کہ نشے کی حالت میں نماز مت پڑھا کرو، گویا اس وقت صرف نماز کے وقت کے قریب شراب نوشی سے منع کیا گیا۔ بالکل ممانعت اور حرمت کا حکم اس کے بعد نازل ہوا۔ (یہ شراب کی بابت دوسرا حکم ہے جو مشروط ہے )\n(2) یعنی ناپاکی کی حالت میں بھی نماز مت پڑھو۔ کیونکہ نماز کے لئے طہارت ضروری ہے۔\n(3) اس کا مطلب یہ نہیں کہ مسافری کی حالت میں اگر پانی نہ ملے تو جنابت کی حالت میں نماز پڑھ لو (جیسا کہ بعض نے کہا ہے) بلکہ جمہور علماء کے نزدیک اس کا مفہوم یہ ہے کہ جنابت کی حالت میں تم مسجد کے اندر مت بیٹھو، البتہ مسجد کے اندر سے گزرنے کی ضرورت پڑےتو گزر سکتے ہو بعض صحابہ کے مکان اس طرح تھے کہ انہیں ہر صورت میں مسجد نبوی کے اندر سے گزر کر جانا پڑتا تھا۔ یہ رخصت ان ہی کے پیش نظر دی گئی ہے۔ (ابن کثیر) ورنہ مسافر کا حکم آگے آرہا ہے۔\n(4) (أ) بیمار سے مراد، وہ بیمار ہے جسے وضو کرنے سے نقصان یا بیماری میں اضافے کا اندیشہ ہو۔ (ب) مسافر عام ہے، لمبا سفر کیا ہو یا مختصر۔ اگر پانی دستیاب نہ ہو تو تیمم کرنے کی اجازت ہے۔ پانی نہ ملنے کی صورت میں یہ اجازت تو مقیم کو بھی حاصل ہے، لیکن بیمار اور مسافر کو چونکہ اس قسم کی ضرورت عام طور پر پیش آتی تھی اس لئے بطور خاص اس کے لئےاجازت بیان کر دی گئی ہے۔ (ج) قضائے حاجت سے آنے والا۔ (د) اور بیوی سے مباشرت کرنے والا، ان کو بھی پانی نہ ملنے کی صورت میں تیمم کرکے نماز پڑھنے کی اجازت ہے۔ تیمم کا طریقہ یہ ہے کہ ایک ہی مرتبہ ہاتھ زمین پر مار کر کلائی تک دونوں ہاتھ ایک دوسرے پر پھیرلے۔ (کہنیوں تک ضروری نہیں) اور منہ پر بھی پھیر لے قَالَ فِي التَّيَمُّمِ: ”ضَرْبَةٌ لِلْوَجْهِ وَالْكَفَّيْنِ“ (مسند أحمد- عماررضی اللہ عنہ جلد 4 صفحہ 263) نبی (صلى الله عليه وسلم) نے تیمم کے بارے میں فرمایا کہ یہ دونوں ہتھیلیوں اور چہرے کے لئے ایک ہی مرتبہ مارنا ہے۔ ”صَعِيدًا طَيِّبًا“ سے مراد ”پاک مٹی“ ہے۔ زمین سے نکلنے والی ہر چیز نہیں جیسا کہ بعض کا خیال ہے۔ حدیث میں اس کی مزید وضاحت کر دی گئی ہے۔ «جُعِلَتْ تُرْبَتُهَا لَنَا طَهُورًا إِذَا لَمْ نَجِدِ الْمَاءَ»، (صحيح مسلم- كتاب المساجد) ”جب ہمیں پانی نہ ملے تو زمین کی مٹی ہمارے لئے پاکیزگی کا ذریعہ بنا دی گئی ہے“۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāayyuhā alladhīna āmanū lā taqrabū al-ṣalata wa-antum sukārā ḥattā taʿlamū mā taqūlūna walā junuban illā ʿābirī sabīlin ḥattā taghtasilū wa-in kuntum marḍā aw ʿalā safarin aw jāa aḥadun minkum mina al-ghāiṭi aw lāmastumu al-nisāa falam tajidū māan fatayammamū ṣaʿīdan ṭayyiban fa-im'saḥū biwujūhikum wa-aydīkum inna al-laha kāna ʿafuwwan ghafūran ","translations":["O you","who","believe[d]","(Do) not","go near","the prayer","while you","(are) intoxicated","until","you know","what","you are saying","and not","(when you are) impure","except","(when) passing","(through) a way","until","you have bathed","And if","you are","ill","or","on","a journey","or","came","one","of you","from","the toilet","or","you have touched","the women","and not","you find","water","then do tayammum","(with) earth","clean","and wipe (with it)","your faces","and your hands","Indeed","Allah","is","Oft-Pardoning","Oft-Forgiving","(43)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","lā","taqrabū","al-ṣalata","wa-antum","sukārā","ḥattā","taʿlamū","mā","taqūlūna","walā","junuban","illā","ʿābirī","sabīlin","ḥattā","taghtasilū","wa-in","kuntum","marḍā","aw","ʿalā","safarin","aw","jāa","aḥadun","minkum","mina","al-ghāiṭi","aw","lāmastumu","al-nisāa","falam","tajidū","māan","fatayammamū","ṣaʿīdan","ṭayyiban","fa-im'saḥū","biwujūhikum","wa-aydīkum","inna","al-laha","kāna","ʿafuwwan","ghafūran",null],"verseTiming":[[1,0,2510],[2,2510,3390],[3,3390,4440],[4,4440,4800],[5,4800,5530],[6,5530,6600],[7,6600,7900],[8,7900,8940],[9,8940,9690],[10,9690,10700],[11,10700,11060],[12,11060,13510],[13,13510,14380],[14,14380,15390],[15,15390,15760],[16,15760,17070],[17,17070,17640],[18,17640,18360],[19,18360,19180],[20,19180,20090],[21,20090,21140],[22,21140,21770],[23,21770,23220],[24,23220,24630],[25,24630,26140],[26,26140,28990],[27,28990,29320],[28,29320,29910],[29,29910,30520],[30,30520,31010],[31,31010,32750],[32,32750,33330],[33,33330,35450],[34,35450,36360],[35,36360,38760],[36,38760,39480],[37,39480,41370],[38,41370,41880],[39,41880,44110],[40,44110,44880],[41,44880,47289],[42,47289,47639],[43,47639,48839],[44,48839,51409],[45,51409,51979],[46,51979,52869],[47,52869,53729],[48,53729,54889],[49,54889,57719],[50,57719,58239],[51,58239,59029],[52,59029,61519],[53,61519,63099],[54,63099,64709],[55,64709,66149],[56,66149,67189],[57,67189,68619],[58,68619,70409],[59,70409,71349],[60,71349,72219],[61,72219,72809],[62,72809,73639],[63,73639,75314]]}}