{"name":"4:61","price":"ان سے جب کبھی کہا جائے کہ اللہ تعالیٰ کے نازل کرده کلام کی اور رسول (صلی اللہ علیہ وسلم) کی طرف آؤ تو آپ دیکھ لیں گے کہ یہ منافق آپ سے منھ پھیر کر رکے جاتے ہیں۔(1)","arabic":"وَإِذَا قِيلَ لَهُمۡ تَعَالَوۡاْ إِلَىٰ مَآ أَنزَلَ ٱللَّهُ وَإِلَى ٱلرَّسُولِ رَأَيۡتَ ٱلۡمُنَٰفِقِينَ يَصُدُّونَ عَنكَ صُدُودٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":554,"juzNumber":5,"footnotes":"(1) یہ آیات ایسے لوگوں کے بارے میں نازل ہوئیں جو اپنا فیصلہ عدالت میں لے جانے کے بجائے سردارانِ یہود یا سردارانِ قریش کی طرف لے جانا چاہتے تھے۔ تاہم ان کا حکم عام ہے اور اس میں تمام وہ لوگ شامل ہیں جو کتاب وسنت سے اعراض کرتے ہیں اور اپنے فیصلوں کے لئے ان دونوں کو چھوڑ کر کسی اور کی طرف جاتے ہیں۔ ورنہ مسلمانوں کا حال تو یہ ہوتا ہے ”إِنَّمَا كَانَ قَوْلَ الْمُؤْمِنِينَ إِذَا دُعُوا إِلَى اللَّهِ وَرَسُولِهِ لِيَحْكُمَ بَيْنَهُمْ أَنْ يَقُولُوا سَمِعْنَا وَأَطَعْنَا“۔(النور: 51) کہ جب انہیں اللہ ورسول (صلى الله عليه وسلم) کی طرف بلایا جاتا ہے تاکہ وہ ان کے درمیان فیصلہ کریں تو وہ کہتے ہیں کہ ”سَمِعْنَا وَأَطَعْنَا“ ایسے ہی لوگوں کے بارے میں آگے اللہ تعالیٰ نے فرمایا ”وَأُولَئِكَ هُمُ الْمُفْلِحُونَ“ یہی لوگ کامیاب ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-idhā qīla lahum taʿālaw ilā mā anzala al-lahu wa-ilā al-rasūli ra-ayta al-munāfiqīna yaṣuddūna ʿanka ṣudūdan ","translations":["And when","it is said","to them","Come","to","what","(has) revealed","Allah","and to","the Messenger","you see","the hypocrites","turning away","from you","(in) aversion","(61)"],"transliterationArr":["wa-idhā","qīla","lahum","taʿālaw","ilā","mā","anzala","al-lahu","wa-ilā","al-rasūli","ra-ayta","al-munāfiqīna","yaṣuddūna","ʿanka","ṣudūdan",null],"verseTiming":[[1,0,860],[2,860,1550],[3,1550,2120],[4,2120,3120],[5,3120,3810],[6,3810,5440],[7,5440,6770],[8,6770,7760],[9,7760,8250],[10,8250,9270],[11,9270,10090],[12,10090,11670],[13,11670,12920],[14,12920,14070],[15,14070,15295]]}}