{"name":"4:69","price":"اور جو بھی اللہ تعالیٰ کی اور رسول (صلی اللہ علیہ وسلم) کی فرمانبرداری کرے، وه ان لوگوں کے ساتھ ہوگا جن پر اللہ تعالیٰ نے انعام کیا ہے، جیسے نبی اور صدیق اور شہید اور نیک لوگ، یہ بہترین رفیق ہیں۔(1)","arabic":"وَمَن يُطِعِ ٱللَّهَ وَٱلرَّسُولَ فَأُوْلَٰٓئِكَ مَعَ ٱلَّذِينَ أَنۡعَمَ ٱللَّهُ عَلَيۡهِم مِّنَ ٱلنَّبِيِّـۧنَ وَٱلصِّدِّيقِينَ وَٱلشُّهَدَآءِ وَٱلصَّٰلِحِينَۚ وَحَسُنَ أُوْلَٰٓئِكَ رَفِيقٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":562,"juzNumber":5,"footnotes":"(1) اللہ ورسول کی اطاعت کا صلہ بتلایا جا رہا ہے اس لئے حدیث میں آتا ہے ”الْمَرْءُ مَعَ مَنْ أَحَبَّ“ (صحيح بخاري كتاب الآداب باب نمبر 97، علامة حب الله عز وجل مسلم كتاب البر والصلة والآداب باب المرء مع من أحب حديث نمبر 1640) آدمی انہی کے ساتھ ہوگا جن سے اس کو محبت ہوگی، حضرت انس (رضي الله عنه) فرماتے ہیں کہ صحابہ (رضي الله عنهم) کو جتنی خوشی اس فرمان رسول کو سن کر ہوئی اتنی خوشی کبھی نہیں ہوئی۔ کیونکہ وہ جنت میں بھی رسول اللہ (صلى الله عليه وسلم) کی رفاقت پسند کرتے تھے۔ اس کی شان نزول کی روایات میں بتایا گیا ہے کہ بعض صحابہ (رضي الله عنهم) نے نبی (صلى الله عليه وسلم) سے یہ عرض کیا کہ اللہ تعالیٰ آپ (صلی اللہ علیہ وسلم) کو جنت میں اعلیٰ مقام عطا فرمائے گا اور ہمیں اس سے فرو تر مقام ہی ملے گا اور یوں ہم آپ (صلى الله عليه وسلم) کی اس صحبت ورفاقت اور دیدار سے محروم رہیں گے جو ہمیں دنیا میں حاصل ہے۔ چنانچہ اللہ تعالیٰ نے یہ آیت اتار کر ان کی تسلی کا سامان فرمایا۔ (ابن کثیر) بعض صحابہ (رضي الله عنهم) نے بطور خاص نبی (صلى الله عليه وسلم) سے جنّت میں رفاقت کی درخواست کی ”أَسْأَلُكَ مُرَافَقَتَكَ فِي الْجَنَّةِ“ جس پر نبی (صلى الله عليه وسلم) نے انہیں کثرت سے نفلی نماز پڑھنے کی تاکید فرمائی ”فَأَعِنِّي عَلَى نَفْسِكَ بِكَثْرَةِ السُّجُودِ“ (صحيح مسلم كتاب الصلاة باب فضل السجود والحث عليه حديث نمبر488) پس تم کثرت سجود کے ساتھ میری مدد کرو۔ علاوہ ازیں ایک اور حدیث ہے ”التَّاجِرُ الصَّدُوقُ الأَمِينُ مَعَ النَّبِيِّينَ وَالصِّدِّيقِينَ وَالشُّهَدَاءِ“ (ترمذي- كتاب البيوع باب ما جاء في التجار وتسمية النبي صلى الله عليه وسلم إياهم) راستباز، امانت دار تاجر انبیاء، صدیقین اور شہدا کے ساتھ ہوگا، ”صدیقیت“ کمال ایمان وکمال اطاعت کا نام ہے، نبوّت کے بعد اس کا مقام ہے، امت محمدیہ میں اس مقام میں حضرت ابوبکر صدیق (رضي الله عنه) سب سے ممتاز ہیں۔ اور اسی لئے بالاتفاق غیر انبیاء میں وہ نبی (صلى الله عليه وسلم) کے بعد افضل ہیں، ”صالح“ وہ ہے جو اللہ کے حقوق اور بندوں کے حقوق کامل طور پر ادا کرے اور ان میں کوتاہی نہ کرے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waman yuṭiʿi al-laha wal-rasūla fa-ulāika maʿa alladhīna anʿama al-lahu ʿalayhim mina al-nabiyīna wal-ṣidīqīna wal-shuhadāi wal-ṣāliḥīna waḥasuna ulāika rafīqan ","translations":["And whoever","obeys","Allah","and the Messenger","then those","(will be) with","those whom","has bestowed (His) Favor","Allah","upon them ","of","the Prophets","and the truthful","and the martyrs","and the righteous","And excellent","(are) those","companion(s)","(69)"],"transliterationArr":["waman","yuṭiʿi","al-laha","wal-rasūla","fa-ulāika","maʿa","alladhīna","anʿama","al-lahu","ʿalayhim","mina","al-nabiyīna","wal-ṣidīqīna","wal-shuhadāi","wal-ṣāliḥīna","waḥasuna","ulāika","rafīqan",null],"verseTiming":[[1,0,470],[2,470,1800],[3,1800,2700],[4,2700,4010],[5,4010,6700],[6,6700,7040],[7,7040,8110],[8,8110,8920],[9,8920,9840],[10,9840,11330],[11,11330,13970],[12,13970,14330],[13,14330,15410],[14,15410,16190],[15,16190,17080],[16,17080,18210],[17,18210,19050],[18,19050,21170],[19,21170,22870],[20,22870,25740],[21,25740,28630],[22,28630,29520],[23,29520,32050],[24,32050,33365]]}}