{"name":"4:7","price":"ماں باپ اور خویش واقارب کے ترکہ میں مردوں کا حصہ بھی ہے اور عورتوں کا بھی۔ (جو مال ماں باپ اور خویش واقارب چھوڑ مریں) خواه وه مال کم ہو یا زیاده (اس میں) حصہ مقرر کیا ہوا ہے۔(1)","arabic":"لِّلرِّجَالِ نَصِيبٞ مِّمَّا تَرَكَ ٱلۡوَٰلِدَانِ وَٱلۡأَقۡرَبُونَ وَلِلنِّسَآءِ نَصِيبٞ مِّمَّا تَرَكَ ٱلۡوَٰلِدَانِ وَٱلۡأَقۡرَبُونَ مِمَّا قَلَّ مِنۡهُ أَوۡ كَثُرَۚ نَصِيبٗا مَّفۡرُوضٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":500,"juzNumber":4,"footnotes":"(1) اسلام سے قبل ایک یہ ظلم بھی روا رکھا جاتا تھا کہ عورتوں اور چھوٹے بچوں کو وراثت سے حصہ نہیں دیا جاتا تھا اور صرف بڑے لڑکے جو لڑنے کے قابل ہوتے، سارے مال کے وارث قرار پاتے۔ اس آیت میں اللہ تعالیٰ نے فرمایا کہ مردوں کی طرح عورتیں اور بچے بچیاں اپنے والدین اور اقارب کے مال میں حصہ دار ہوں گی، انہیں محروم نہیں کیا جائے گا۔ تاہم یہ الگ بات ہے کہ لڑکی کا حصہ لڑکے کے حصے سے نصف ہے (جیسا کہ آیات کے بعد مذکور ہے) یہ عورت پر ظلم نہیں ہے نہ اس کا استخفاف ہے بلکہ اسلام کا یہ قانون میراث عدل وانصاف کے تقاضوں کے عین مطابق ہے۔ کیونکہ عورت کو اسلام نے معاش کی ذمہ داری سے فارغ رکھا ہے اور مرد کو اس کاکﻔیل بنایا ہے۔ علاوہ ازیں عورت کے پاس مہر کی صورت میں مال آتا ہے جو ایک مرد ہی اسے ادا کرتا ہے۔ اس لحاظ سے عورت کے مقابلے میں مرد پر کئی گنا زیادہ مالی ذمہ داریاں ہیں۔ اس لئے اگر عورت کا حصہ نصف کے بجائے مرد کے برابر ہوتا تو یہ مرد پر ظلم ہوتا۔ لیکن اللہ تعالیٰ نے کسی پر بھی ظلم نہیں کیا ہے کیونکہ وہ عادل بھی ہے اور حکیم بھی۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"lilrrijāli naṣībun mimmā taraka al-wālidāni wal-aqrabūna walilnnisāi naṣībun mimmā taraka al-wālidāni wal-aqrabūna mimmā qalla min'hu aw kathura naṣīban mafrūḍan ","translations":["For the men","a portion","of what","(is) left","(by) the parents","and the near relatives","and for the women","a portion","of what","(is) left","(by) parents","and the near relatives","of what","(is) little","of it","or","much ","a portion","obligatory","(7)"],"transliterationArr":["lilrrijāli","naṣībun","mimmā","taraka","al-wālidāni","wal-aqrabūna","walilnnisāi","naṣībun","mimmā","taraka","al-wālidāni","wal-aqrabūna","mimmā","qalla","min'hu","aw","kathura","naṣīban","mafrūḍan",null],"verseTiming":[[1,0,1450],[2,1450,2330],[3,2330,4350],[4,4350,5000],[5,5000,6470],[6,6470,8170],[7,8170,11160],[8,11160,12030],[9,12030,13900],[10,13900,14500],[11,14500,16060],[12,16060,18890],[13,18890,22430],[14,22430,23280],[15,23280,25160],[16,25160,25800],[17,25800,27340],[18,27340,29070],[19,29070,30440],[20,30440,31110],[21,31110,31800],[22,31800,32140],[23,32140,32770],[24,32770,34030],[25,34030,36495]]}}