{"name":"4:77","price":"کیا تم نے انہیں نہیں دیکھا جنہیں حکم کیا گیا تھا کہ اپنے ہاتھوں کو روکے رکھو اور نمازیں پڑھتے رہو اور زکوٰة ادا کرتے رہو۔ پھر جب انہیں جہاد کا حکم دیا گیا تو اسی وقت ان کی ایک جماعت لوگوں سے اس قدر ڈرنے لگی جیسے اللہ تعالیٰ کا ڈر ہو، بلکہ اس سے بھی زیاده، اور کہنے لگے اے ہمارے رب! تو نے ہم پر جہاد کیوں فرض کر دیا؟(1) کیوں ہمیں تھوڑی سی زندگی اور نہ جینے دی؟(2) آپ کہہ دیجئے کہ دنیا کی سودمندی تو بہت ہی کم ہے اور پرہیزگاروں کے لئے تو آخرت ہی بہتر ہے اور تم پر ایک دھاگے کے برابر بھی ستم روا نہ رکھا جائے گا۔","arabic":"أَلَمۡ تَرَ إِلَى ٱلَّذِينَ قِيلَ لَهُمۡ كُفُّوٓاْ أَيۡدِيَكُمۡ وَأَقِيمُواْ ٱلصَّلَوٰةَ وَءَاتُواْ ٱلزَّكَوٰةَ فَلَمَّا كُتِبَ عَلَيۡهِمُ ٱلۡقِتَالُ إِذَا فَرِيقٞ مِّنۡهُمۡ يَخۡشَوۡنَ ٱلنَّاسَ كَخَشۡيَةِ ٱللَّهِ أَوۡ أَشَدَّ خَشۡيَةٗۚ وَقَالُواْ رَبَّنَا لِمَ كَتَبۡتَ عَلَيۡنَا ٱلۡقِتَالَ لَوۡلَآ أَخَّرۡتَنَآ إِلَىٰٓ أَجَلٖ قَرِيبٖۗ قُلۡ مَتَٰعُ ٱلدُّنۡيَا قَلِيلٞ وَٱلۡأٓخِرَةُ خَيۡرٞ لِّمَنِ ٱتَّقَىٰ وَلَا تُظۡلَمُونَ فَتِيلًا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":570,"juzNumber":5,"footnotes":"(1) مکے میں مسلمان چونکہ تعداد اور وسائل کے اعتبار سے لڑنے کے قابل نہیں تھے۔ اس لئے مسلمانوں کی خواہش کے باوجود انہیں قتال سے روکے رکھا گیا اور دو باتوں کی تاکید کی جاتی رہی، ایک یہ کہ کافروں کے ظالمانہ رویے کو صبر اور حوصلے سے برداشت کریں اور عفو ودرگزر سے کام لیں۔ دوسرے یہ کہ نماز زکواۃ اور دیگر عبادات وتعلیمات پر عمل کا اہتمام کریں تاکہ اللہ تعالیٰ سے ربط وتعلق مضبوط بنیادوں پر استوار ہو جائے۔ لیکن ہجرت کے بعد جب مدینہ میں مسلمانوں کی طاقت مجتمع ہوگئی تو پھر انہیں قتال کی اجازت دے دی گئی تو بعض لوگوں نے کمزوری اور پست ہمتی کا اظہار کیا۔ اس پر آیت میں مکی دور کی ان کی آرزو یاد دلا کر کہا جا رہا ہے کہ اب مسلمان حکم جہاد سن کر خوف زدہ کیوں ہو رہے ہیں جب کہ یہ حکم جہاد خود ان کی اپنی خواہش کے مطابق ہے۔ آیت قران میں تحریف آیت کا پہلا حصہ جس میں ”كَفِّ أَيْدِي“ (لڑائی سے ہاتھ روکے رکھنے) کا حکم ہے۔ اس سے بعض لوگوں نے استدلال کیا ہے کہ نماز میں رکوع سے اٹھتے وقت رفع الیدین نہیں کرنا چاہئے۔ کیونکہ اللہ تعالیٰ نے قرآن کریم میں نماز کی حالت میں ہاتھوں کو روکے رکھنے کا حکم دیا ہے۔ یہ ایک انتہائی غلط اور واہیات استدلال ہے۔ اس کے لئے ان صاحب نے آیت کے الفاظ بھی تحریف کی اور معنی میں بھی۔ یعنی لفظی اور معنوی دونوں قسم کے تحریف سے کام لیا ہے۔\n(2) اس کا دوسرا ترجمہ یہ بھی کیا گیا ہے کہ اس حکم کو کچھ اور مدت کے لئے موخر کیوں نہ کر دیا یعنی ”أَجَلٍ قَرِيبٍ“ سے مراد موت یا فرض جہاد کی مدت ہے۔ (تفسير ابن كثير)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"alam tara ilā alladhīna qīla lahum kuffū aydiyakum wa-aqīmū al-ṣalata waātū al-zakata falammā kutiba ʿalayhimu al-qitālu idhā farīqun min'hum yakhshawna al-nāsa kakhashyati al-lahi aw ashadda khashyatan waqālū rabbanā lima katabta ʿalaynā al-qitāla lawlā akhartanā ilā ajalin qarībin qul matāʿu al-dun'yā qalīlun wal-ākhiratu khayrun limani ittaqā walā tuẓ'lamūna fatīlan ","translations":["Have not","you seen","[towards]","those who","(when) it was said","to them","Restrain","your hands","and establish","the prayer","and give","the zakah","Then when","was ordained","on them","the fighting","then","a group","of them","[they] fear","the people","as (they) fear","Allah","or","more intense","fear","and they said","Our Lord","why","have You ordained","upon us","[the] fighting","Why not","You postpone (it for) us","to","a term","near","Say","Enjoyment","(of) the world","(is) little","and the Hereafter","(is) better","for whoever","fears (Allah)","and not","you will be wronged","(even as much as) a hair on a date-seed","(77)"],"transliterationArr":["alam","tara","ilā","alladhīna","qīla","lahum","kuffū","aydiyakum","wa-aqīmū","al-ṣalata","waātū","al-zakata","falammā","kutiba","ʿalayhimu","al-qitālu","idhā","farīqun","min'hum","yakhshawna","al-nāsa","kakhashyati","al-lahi","aw","ashadda","khashyatan","waqālū","rabbanā","lima","katabta","ʿalaynā","al-qitāla","lawlā","akhartanā","ilā","ajalin","qarībin","qul","matāʿu","al-dun'yā","qalīlun","wal-ākhiratu","khayrun","limani","ittaqā","walā","tuẓ'lamūna","fatīlan",null],"verseTiming":[[1,0,650],[2,650,1100],[3,1100,1420],[4,1420,2460],[5,2460,3180],[6,3180,3770],[7,3770,5820],[8,5820,7040],[9,7040,8020],[10,8020,9130],[11,9130,9930],[12,9930,11000],[13,11000,12450],[14,12450,13080],[15,13080,14070],[16,14070,15150],[17,15150,15760],[18,15760,16600],[19,16600,18120],[20,18120,19190],[21,19190,22150],[22,22150,23280],[23,23280,24620],[24,24620,25710],[25,25710,26550],[26,26550,26980],[27,26980,27780],[28,27780,28930],[29,28930,30070],[30,30070,31030],[31,31030,31430],[32,31430,32320],[33,32320,33110],[34,33110,34220],[35,34220,36660],[36,36660,39250],[37,39250,41100],[38,41100,42610],[39,42610,43250],[40,43250,44740],[41,44740,45640],[42,45640,46460],[43,46460,47450],[44,47450,48340],[45,48340,50400],[46,50400,51200],[47,51200,51910],[48,51910,52780],[49,52780,53310],[50,53310,54540],[51,54540,56335]]}}