{"name":"4:82","price":"کیا یہ لوگ قرآن میں غور نہیں کرتے؟ اگر یہ اللہ تعالیٰ کے سوا کسی اور کی طرف سے ہوتا تو یقیناً اس میں بہت کچھ اختلاف پاتے۔(1)","arabic":"أَفَلَا يَتَدَبَّرُونَ ٱلۡقُرۡءَانَۚ وَلَوۡ كَانَ مِنۡ عِندِ غَيۡرِ ٱللَّهِ لَوَجَدُواْ فِيهِ ٱخۡتِلَٰفٗا كَثِيرٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":575,"juzNumber":5,"footnotes":"(1) قرآن کریم سے رہنمائی حاصل کرنے کے لئے اس میں غور وتدبر کی تاکید کی جا رہی ہے اور اس کی صداقت جانچنے کے لئے ایک معیار بھی بتلایا گیا ہے کہ اگر یہ کسی انسان کا بنایا ہوا کلام ہوتا (جیسا کہ کفار کا خیال ہے) تو اس کے مضامین اور بیان کردہ واقعات میں تعارض وتناقص ہوتا۔ کیونکہ ایک تو یہ کوئی چھوٹی سی کتاب نہیں ہے۔ ایک ضخیم اور مفصّل کتاب ہے، جس کا ہر حصہ اعجاز وبلاغت میں ممتاز ہے۔ حالانکہ انسان کی بنائی ہوئی بڑی تصنیف میں زبان کا معیار اور اس کی فصاحت وبلاغت قائم نہیں رہتی۔ دوسرے، اس میں پچھلی قوموں کے واقعات بھی بیان کئے گئے ہیں۔ جنہیں اللہ علاّم الغیوب کے سوا کوئی اور بیان نہیں کر سکتا۔ تیسرے ان حکایات وقصص میں نہ باہمی تعارض وتضاد ہے اور نہ ان کا چھوٹے سے چھوٹا کوئی جزئیہ قرآن کی کسی اصل سے ٹکراتا ہے۔ حالانکہ ایک انسان گزشتہ واقعات بیان کرے تو تسلسل کی کڑیاں ٹوٹ پھوٹ جاتی ہیں اور ان کی تفصیلات میں تعارض وتضاد واقع ہو جاتا ہے۔ قرآن کریم کے ان تمام انسانی کوتاہیوں سے مبرّا ہونے کے صاف معنی یہ ہیں کہ یہ یقیناً کلام الٰہی ہے جو اس نے فرشتے کے ذریعے سے اپنے آخری پیغمبر حضرت محمد (صلى الله عليه وسلم) پر نازل فرمایا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"afalā yatadabbarūna al-qur'āna walaw kāna min ʿindi ghayri al-lahi lawajadū fīhi ikh'tilāfan kathīran ","translations":["Then (do) not","they ponder","(on) the Quran","And if","it had (been)","(of)","from","other than","Allah","surely they (would have) found","in it","contradiction","much","(82)"],"transliterationArr":["afalā","yatadabbarūna","al-qur'āna","walaw","kāna","min","ʿindi","ghayri","al-lahi","lawajadū","fīhi","ikh'tilāfan","kathīran",null],"verseTiming":[[1,0,910],[2,910,2600],[3,2600,5690],[4,5690,6380],[5,6380,7000],[6,7000,7410],[7,7410,8760],[8,8760,9440],[9,9440,10290],[10,10290,11280],[11,11280,12210],[12,12210,13280],[13,13280,15435]]}}