{"name":"4:83","price":"جہاں انہیں کوئی خبر امن کی یا خوف کی ملی انہوں نے اسے مشہور کرنا شروع کر دیا، حاﻻنکہ اگر یہ لوگ اسے رسول (صلی اللہ علیہ وسلم) کے اور اپنے میں سے ایسی باتوں کی تہہ تک پہنچنے والوں کے حوالے کر دیتے، تو اس کی حقیقت وه لوگ معلوم کر لیتے جو نتیجہ اخذ کرتے ہیں(1) اور اگر اللہ تعالیٰ کا فضل اور اس کی رحمت تم پر نہ ہوتی تو معدودے چند کے علاوه تم سب شیطان کے پیروکار بن جاتے۔","arabic":"وَإِذَا جَآءَهُمۡ أَمۡرٞ مِّنَ ٱلۡأَمۡنِ أَوِ ٱلۡخَوۡفِ أَذَاعُواْ بِهِۦۖ وَلَوۡ رَدُّوهُ إِلَى ٱلرَّسُولِ وَإِلَىٰٓ أُوْلِي ٱلۡأَمۡرِ مِنۡهُمۡ لَعَلِمَهُ ٱلَّذِينَ يَسۡتَنۢبِطُونَهُۥ مِنۡهُمۡۗ وَلَوۡلَا فَضۡلُ ٱللَّهِ عَلَيۡكُمۡ وَرَحۡمَتُهُۥ لَٱتَّبَعۡتُمُ ٱلشَّيۡطَٰنَ إِلَّا قَلِيلٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":576,"juzNumber":5,"footnotes":"(1) یہ بعض کمزور اورجلد باز مسلمانوں کا رویہ، ان کی اصلاح کی غرض سے بیان کیا جا رہا ہے۔ امن کی خبر سے مراد مسلمانوں کی کامیابی اور دشمن کی ہلاکت وشکست کی خبر ہے۔ (جس کو سن کر امن اور اطمینان کی لہر دوڑ جاتی ہے اور جس کے نتیجے میں بعض دفعہ ضرورت سے زیادہ پر اعتمادی پیدا ہو جاتی ہے جو نقصان کا باعث بن سکتی ہے) اور خوف کی خبر سے مراد مسلمانوں کی شکست اور ان کے قتل وہلاکت کی خبر ہے (جس سے مسلمانوں میں افسردگی پھیلنے اور ان کے حوصلے پست ہونے کا امکان ہوتا ہے)، اس لئے انہیں کہا جا رہا ہے کہ اس قسم کی خبریں، چاہے امن کی ہوں یا خوف کی انہیں سن کر عام لوگوں میں پھیلانے کے بجائے رسول (صلى الله عليه وسلم) کے پاس پہنچا دو یا اہل علم وتحقیق میں انہیں پہنچا دو تاکہ وہ یہ دیکھیں کہ یہ خبر صحیح ہے یا غلط؟ اگر صحیح ہے تو اس وقت اس سے مسلمانوں کا باخبر ہونا مفید ہے یا بے خبر رہنا نفع ہے؟ یہ اصول ویسے تو عام حالات میں بھی بڑا اہم اور نہایت مفید ہے لیکن عین حالت جنگ میں تو اس کی اہمیت وافادیت بہت ہی زیادہ ہے۔ ”اسْتِنْبَاطٌ“ کا مادہ نَبْطٌ ہے نَبْطٌ اس پانی کو کہتے ہیں جو کنواں کھودتے وقت سب سے پہلے نکلتا ہے اسی لئے اسْتِنْبَاطٌ تحقیق اور بات کی تہہ تک پہنچنے کو کہا جاتا ہے۔ (فتح القدیر )","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-idhā jāahum amrun mina al-amni awi al-khawfi adhāʿū bihi walaw raddūhu ilā al-rasūli wa-ilā ulī al-amri min'hum laʿalimahu alladhīna yastanbiṭūnahu min'hum walawlā faḍlu al-lahi ʿalaykum waraḥmatuhu la-ittabaʿtumu al-shayṭāna illā qalīlan ","translations":["And when","comes to them","a matter","of","the security","or","[the] fear","they spread","[with] it","But if","they (had) referred it","to","the Messenger","and to","those","(having) authority","among them","surely would have known it","those who","draw correct conclusion (from) it","among them","And if not","(had been the) bounty","(of) Allah","on you","and His Mercy","surely you (would have) followed","the Shaitaan","except","a few","(83)"],"transliterationArr":["wa-idhā","jāahum","amrun","mina","al-amni","awi","al-khawfi","adhāʿū","bihi","walaw","raddūhu","ilā","al-rasūli","wa-ilā","ulī","al-amri","min'hum","laʿalimahu","alladhīna","yastanbiṭūnahu","min'hum","walawlā","faḍlu","al-lahi","ʿalaykum","waraḥmatuhu","la-ittabaʿtumu","al-shayṭāna","illā","qalīlan",null],"verseTiming":[[1,0,900],[2,900,3460],[3,3460,4060],[4,4060,5050],[5,5050,5900],[6,5900,6320],[7,6320,7180],[8,7180,8230],[9,8230,9020],[10,9020,9640],[11,9640,10660],[12,10660,11060],[13,11060,12160],[14,12160,14230],[15,14230,14650],[16,14650,15420],[17,15420,16150],[18,16150,17250],[19,17250,18350],[20,18350,21100],[21,21100,22380],[22,22380,23210],[23,23210,24030],[24,24030,24920],[25,24920,25970],[26,25970,27340],[27,27340,28870],[28,28870,30280],[29,30280,31060],[30,31060,32615]]}}