{"name":"4:86","price":"اور جب تمہیں سلام کیا جائے تو تم اس سے اچھا جواب دو یا انہی الفاظ کو لوٹا دو(1) ، بے شبہ اللہ تعالیٰ ہر چیز کا حساب لینے واﻻ ہے۔","arabic":"وَإِذَا حُيِّيتُم بِتَحِيَّةٖ فَحَيُّواْ بِأَحۡسَنَ مِنۡهَآ أَوۡ رُدُّوهَآۗ إِنَّ ٱللَّهَ كَانَ عَلَىٰ كُلِّ شَيۡءٍ حَسِيبًا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":579,"juzNumber":5,"footnotes":"(1) تَحِيَّةٌ اصل میں تَحْيِيَةٌ (تَفْعِيلَةٌ) ہے۔ یا کے یا میں ادغام کے بعد تَحِيَّةٌ ہوگیا۔ اس کے معنی ہیں۔ درازی عمر کی دعا (الدُّعَاءُ بِالْحَيَاةِ) یہاں یہ سلام کرنے کے معنی میں ہے۔ (فتح القدیر) زیادہ اچھا جواب دینے کی تفسیر حدیث میں اس طرح آئی ہے کہ السّلام علیکم کے جواب میں ورحمتہ اللہ کا اضافہ اور السّلام علیکم ورحمۃ اللہ کے جواب میں وبرکاتہ کا اضافہ کر دیا جائے۔ لیکن اگر کوئی السّلام علیکم ورحمۃ اللہ وبرکاتہ کہے تو پھر اضافے کے بغیر انہی الفاظ میں جواب دیا جائے۔ (ابن کثیر) ایک اور حدیث میں ہے کہ صرف السّلام علیکم کہنے سے دس نیکیاں اس کے ساتھ ورحمۃ اللہ کہنے سے بیس نیکیاں اور برکاتہ کہنے سے تیس نیکیاں ملتی ہیں۔ (مسند أحمد جلد 4، ص 439، 440)، یاد رہے کہ یہ حکم مسلمانوں کے لئے ہے، یعنی ایک مسلمان جب دوسرے مسلمان کو سلام کرے۔ لیکن اہل ذمّہ یعنی یہود ونصاریٰ کو سلام کرنا ہو تو ایک تو ان کو سلام کرنے میں پہل نہ کی جائے۔ دوسرا، اضافہ نہ کیا جائے بلکہ صرف وعلیکم کے ساتھ جواب دیا جائے۔ (صحيح بخاري، كتاب الاستيذان- مسلم، كتاب السلام)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-idhā ḥuyyītum bitaḥiyyatin faḥayyū bi-aḥsana min'hā aw ruddūhā inna al-laha kāna ʿalā kulli shayin ḥasīban ","translations":["And when","you are greeted","with a greeting","then greet","with better","than it","or","return it","Indeed","Allah","is","of","every","thing","an Accountant","(86)"],"transliterationArr":["wa-idhā","ḥuyyītum","bitaḥiyyatin","faḥayyū","bi-aḥsana","min'hā","aw","ruddūhā","inna","al-laha","kāna","ʿalā","kulli","shayin","ḥasīban",null],"verseTiming":[[1,0,890],[2,890,2660],[3,2660,4080],[4,4080,5500],[5,5500,6600],[6,6600,8660],[7,8660,9080],[8,9080,10430],[9,10430,12080],[10,12080,12940],[11,12940,13610],[12,13610,14210],[13,14210,14830],[14,14830,15710],[15,15710,17185]]}}