{"name":"4:9","price":"اور چاہئے کہ وه اس بات سے ڈریں کہ اگر وه خود اپنے پیچھے (ننھے ننھے) ناتواں بچے چھوڑ جاتے جن کے ضائع ہو جانے کا اندیشہ رہتا ہے، (تو ان کی چاہت کیا ہوتی) پس اللہ تعالیٰ سے ڈر کر جچی تلی بات کہا کریں۔(1)","arabic":"وَلۡيَخۡشَ ٱلَّذِينَ لَوۡ تَرَكُواْ مِنۡ خَلۡفِهِمۡ ذُرِّيَّةٗ ضِعَٰفًا خَافُواْ عَلَيۡهِمۡ فَلۡيَتَّقُواْ ٱللَّهَ وَلۡيَقُولُواْ قَوۡلٗا سَدِيدًا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":502,"juzNumber":4,"footnotes":"(1) بعض مفسرین کے نزدیک اس کے مخاطب اوصیا ہیں (جن کو وصیت کی جاتی ہے) ان کو نصیحت کی جا رہی ہے کہ ان کے زیر کفالت جو یتیم ہیں ان کے ساتھ وہ ایسا سلوک کریں جو وہ اپنے بچوں کے ساتھ اپنے مرنے کے بعد کیا جانا پسند کرتے ہیں۔ بعض کے نزدیک اس کے مخاطب عام لوگ ہیں کہ وہ یتیموں اور دیگر چھوٹے بچوں کے ساتھ اچھا سلوک کریں، قطع نظر اس کے کہ وہ ان کی زیر کفالت ہیں یا نہیں بعض کے نزدیک اس کے مخاطب وہ ہیں جو قریب المرگ کے پاس بیٹھے ہوں، ان کی ذمہ داری ہے کہ وہ مرنے والے کو اچھی باتیں سمجھائیں تاکہ وہ نہ حق اللہ میں کوتاہی کر سکے نہ حقوق بنی آدم میں اور وصیت میں وہ ان دونوں باتوں کو ملحوظ رکھے۔ اگر وہ خوب صاحب حیثیت ہے تو ایک تہائی مال کی وصیت ایسے لوگوں کے حق میں ضرور کرے جو اس کے قریبی رشتہ داروں میں غریب اور مستحق امداد ہیں یا پھر کسی دینی مقصد اور ادارے پر خرچ کرنے کی وصیت کرے تاکہ یہ مال اس کے لئے زاد آخرت بن جائے اور اگر وہ صاحب حیثیت نہیں ہے تو اسے تہائی مال میں وصیت کرنے سے روکا جائے تاکہ اس کے اہل خانہ بعد میں مفلسی اور احتیاج سے دوچار نہ ہوں۔ اسی طرح کوئی اپنے ورثا کو محروم کرنا چاہے تو اس سے اس کو منع کیا جائے اور یہ خیال کیا جائے کہ اگر ان کے بعد ان کے بچے فقروفاقہ سے دوچار ہو جائیں تو اس کے تصور سے ان پر کیا گزرے گی۔ اس تفصیل سے مذکورہ سارے ہی مخاطبین اس کا مصداق ہیں۔ (تفسیر قرطبی وفتح القدیر)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walyakhsha alladhīna law tarakū min khalfihim dhurriyyatan ḍiʿāfan khāfū ʿalayhim falyattaqū al-laha walyaqūlū qawlan sadīdan ","translations":["And let fear ","those who","if","they left","from","behind","offspring","weak","(and) they would have feared","about them","So let them fear","Allah","and let them speak","words","appropriate","(9)"],"transliterationArr":["walyakhsha","alladhīna","law","tarakū","min","khalfihim","dhurriyyatan","ḍiʿāfan","khāfū","ʿalayhim","falyattaqū","al-laha","walyaqūlū","qawlan","sadīdan",null],"verseTiming":[[1,0,1200],[2,1200,2200],[3,2200,2540],[4,2540,3550],[5,3550,3930],[6,3930,5100],[7,5100,7100],[8,7100,8170],[9,8170,9170],[10,9170,10210],[11,10210,11580],[12,11580,14330],[13,14330,15600],[14,15600,16510],[15,16510,17930],[16,17930,19080],[17,19080,21235]]}}