{"name":"4:92","price":"کسی مومن کو دوسرے مومن کا قتل کر دینا زیبا نہیں(1) مگر غلطی سے ہو جائے(2) (تو اور بات ہے)، جو شخص کسی مسلمان کو بلا قصد مار ڈالے، اس پر ایک مسلمان غلام کی گردن آزاد کرنا اور مقتول کے عزیزوں کو خون بہا پہنچانا ہے(3)۔ ہاں یہ اور بات ہے کہ وه لوگ بطور صدقہ معاف کر دیں(4) اور اگر مقتول تمہاری دشمن قوم کا ہو اور ہو وه مسلمان، تو صرف ایک مومن غلام کی گردن آزاد کرنی ﻻزمی ہے(5)۔ اور اگر مقتول اس قوم سے ہو کہ تم میں اور ان میں عہد و پیماں ہے تو خون بہا ﻻزم ہے، جو اس کے کنبے والوں کو پہنچایا جائے اور ایک مسلمان غلام کا آزاد کرنا بھی (ضروری ہے)(6)، پس جو نہ پائے اس کے ذمے دو مہینے کے لگاتار روزے ہیں(7)، اللہ تعالیٰ سے بخشوانے کے لئےاور اللہ تعالیٰ بخوبی جاننے واﻻ اور حکمت واﻻ ہے۔","arabic":"وَمَا كَانَ لِمُؤۡمِنٍ أَن يَقۡتُلَ مُؤۡمِنًا إِلَّا خَطَـٔٗاۚ وَمَن قَتَلَ مُؤۡمِنًا خَطَـٔٗا فَتَحۡرِيرُ رَقَبَةٖ مُّؤۡمِنَةٖ وَدِيَةٞ مُّسَلَّمَةٌ إِلَىٰٓ أَهۡلِهِۦٓ إِلَّآ أَن يَصَّدَّقُواْۚ فَإِن كَانَ مِن قَوۡمٍ عَدُوّٖ لَّكُمۡ وَهُوَ مُؤۡمِنٞ فَتَحۡرِيرُ رَقَبَةٖ مُّؤۡمِنَةٖۖ وَإِن كَانَ مِن قَوۡمِۭ بَيۡنَكُمۡ وَبَيۡنَهُم مِّيثَٰقٞ فَدِيَةٞ مُّسَلَّمَةٌ إِلَىٰٓ أَهۡلِهِۦ وَتَحۡرِيرُ رَقَبَةٖ مُّؤۡمِنَةٖۖ فَمَن لَّمۡ يَجِدۡ فَصِيَامُ شَهۡرَيۡنِ مُتَتَابِعَيۡنِ تَوۡبَةٗ مِّنَ ٱللَّهِۗ وَكَانَ ٱللَّهُ عَلِيمًا حَكِيمٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":585,"juzNumber":5,"footnotes":"(1) یہ نفی، نہی کے معنی میں ہے جو حرمت کی متقاضی ہے یعنی ایک مومن کا دوسرے مومن کو قتل کرنا ممنوع اور حرام ہے جیسے ”وَمَا كَانَ لَكُمْ أَنْ تُؤْذُوا رَسُولَ اللَّهِ“ (الأحزاب: 53) ”تمہارے یہ لائق نہیں ہے کہ تم اللہ کے رسول (صلى الله عليه وسلم) کو ایذا پہنچاو“ یعنی حرام ہے۔\n(2) غلطی کے اسباب ووجوہ متعدد ہو سکتے ہیں۔ مقصد ہے کہ نیت اور ارادہ قتل کا نہ ہو۔ مگر بوجوہ قتل ہو جائے۔\n(3) یہ قتل خطا کا جرمانہ بیان کیا جا رہا ہے جو دو چیزیں ہیں۔ ایک بطور کفّارہ واستغفار ہے۔ یعنی مسلمان غلام کی گردن آزاد کرنا اور دوسری چیز بطور حق العباد کے ہے اور وہ ہے ”دِيَةٌ“ (خون بہا )۔ مقتول کے خون کے بدلے میں جو چیز مقتول کے وارثوں کو دی جائے، وہ دیت ہے۔ اور دیت کی مقدار احادیث کی رو سے سو اونٹ یا اس کے مساوی قیمت سونے، چاندی یا کرنسی کی شکل میں ہوگی۔\nملحوظة: خیال رہے کہ قتل عمد میں قصاص یا دیت مغلظہ ہے اور دیتِ مغلظہ کی مقدار سو اونٹ ہے جو عمر اور وصف کے لحاظ سے تین قسم یا تین معیار کے ہوں گے۔ جب کہ قتل خطا میں صرف دیت ہے۔ قصاص نہیں ہے۔ اس دیت کی مقدار سو اونٹ ہے مگر معیار اتنا کڑا نہیں۔ علاوہ ازیں اس دیت کی قیمت سنن ابی داود کی حدیث میں دینار یا ہزار درہم اور ترمذی کی روایت میں بارہ ہزار درہم بتلائی گئی ہے۔ اسی طرح حضرت عمر (رضی اللہ عنہ) نے اپنے دور خلافت میں قیمت دیت میں کمی بیشی اور مختلف پیشوں والوں کے اعتبار سے اس کی مختلف نوعیتیں مقرر فرمائی تھیں۔ (ارواء الغلیل جلد: 8) جس کا مطلب یہ ہے کہ اصل دیت (سو اونٹ) کی بنیاد پر اس کی قیمت ہر دور کے اعتبار سے مقرر کی جائے گی۔ (تفصیل کے لئے شروح حدیث وکتب فقہ ملاحظہ ہوں )\n(4) معاف کر دینے کو صدقہ سے تعبیر کرنے سے مقصد معافی کی ترغیب دینا ہے۔\n(5) یعنی اس صورت میں دیت نہیں ہوگی۔ اس کی وجہ بعض نے یہ بیان کی ہے کہ کیونکہ اس کے وراث حربی کافر ہیں، اس لئے وہ مسلمان کی دیت لینے کے حق دار نہیں۔ بعض نے یہ وجہ بیان کی ہے کہ اس مسلمان نےاسلام قبول کرنے کے بعد چونکہ ہجرت نہیں کی، جب کہ ہجرت کی اس وقت بڑی تاکید تھی۔ اس کوتاہی کی وجہ سے اس کے خون کی حرمت کم ہے۔ (فتح القدیر )\n(6) یہ ایک تیسری صورت ہے، اس میں بھی وہی کفارہ اور دیت ہے جو پہلی صورت میں ہے، بعض نے کہا ہے کہ اگر مقتول معاہد (ذمی) ہو تو اس کی دیت مسلمان کی دیت سے نصف ہوگی، کیونکہ حدیث میں کافر کی دیت مسلمان کی دیت سے نصف بیان کی گئی ہے۔ لیکن زیادہ صحیح بات یہی معلوم ہوتی ہے کہ اس تیسری صورت میں بھی مقتول مسلمان ہی کا حکم بیان کیا جا رہا ہے۔\n(7) یعنی اگر گردن آزاد کرنے کی استطاعت نہ ہو تو پہلی صورت اور اس آخری صورت میں دیت کے ساتھ مسلسل لگاتار (بغیر ناغہ کے) دو مہینے کے روزے ہیں۔ اگر درمیان میں ناغہ ہوگیا تو نئے سرے سے روزے رکھنے ضروری ہوں گے۔ البتہ عذر شرعی کی وجہ سے ناغہ ہونے کی صورت میں نئے سرے سے روزے رکھنے کی ضرورت نہیں ہے۔ جیسے حیض، نفاس یا شدید بیماری، جو روزہ رکھنے میں مانع ہو، سفر کے عذرشرعی ہونے میں اختلاف ہے۔ (ابن كثير)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wamā kāna limu'minin an yaqtula mu'minan illā khaṭa-an waman qatala mu'minan khaṭa-an fataḥrīru raqabatin mu'minatin wadiyatun musallamatun ilā ahlihi illā an yaṣṣaddaqū fa-in kāna min qawmin ʿaduwwin lakum wahuwa mu'minun fataḥrīru raqabatin mu'minatin wa-in kāna min qawmin baynakum wabaynahum mīthāqun fadiyatun musallamatun ilā ahlihi wataḥrīru raqabatin mu'minatin faman lam yajid faṣiyāmu shahrayni mutatābiʿayni tawbatan mina al-lahi wakāna al-lahu ʿalīman ḥakīman ","translations":["And not","is","for a believer","that","he kills","a believer","except","(by) mistake","And whoever","killed","a believer","(by) mistake","then freeing","(of) a slave"," believing","and blood money","(is to be) paid","to","his family","unless","that","they remit (as) charity","But if","(he) was","from","a people","hostile","to you","and he was","a believer","then freeing","(of) a believing slave"," believing","And if","(he) was","from","a people","between you","and between them","(is) a treaty","then blood money","(is to be) paid","to","his family","and freeing","(of) a slave"," believing","And whoever","(does) not","find","then fasting","(for) two months","consecutively","(seeking) repentance","from","Allah","and is","Allah","All-Knowing","All-Wise","(92)"],"transliterationArr":["wamā","kāna","limu'minin","an","yaqtula","mu'minan","illā","khaṭa-an","waman","qatala","mu'minan","khaṭa-an","fataḥrīru","raqabatin","mu'minatin","wadiyatun","musallamatun","ilā","ahlihi","illā","an","yaṣṣaddaqū","fa-in","kāna","min","qawmin","ʿaduwwin","lakum","wahuwa","mu'minun","fataḥrīru","raqabatin","mu'minatin","wa-in","kāna","min","qawmin","baynakum","wabaynahum","mīthāqun","fadiyatun","musallamatun","ilā","ahlihi","wataḥrīru","raqabatin","mu'minatin","faman","lam","yajid","faṣiyāmu","shahrayni","mutatābiʿayni","tawbatan","mina","al-lahi","wakāna","al-lahu","ʿalīman","ḥakīman",null],"verseTiming":[[1,0,620],[2,620,1330],[3,1330,2550],[4,2550,2830],[5,2830,4250],[6,4250,5200],[7,5200,6010],[8,6010,7010],[9,7010,8620],[10,8620,9210],[11,9210,10100],[12,10100,11510],[13,11510,12650],[14,12650,13440],[15,13440,15970],[16,15970,16740],[17,16740,18990],[18,18990,19800],[19,19800,21760],[20,21760,23510],[21,23510,25620],[22,25620,27500],[23,27500,27730],[24,27730,30070],[25,30070,31610],[26,31610,32320],[27,32320,33170],[28,33170,33870],[29,33870,34770],[30,34770,35660],[31,35660,36290],[32,36290,37970],[33,37970,39210],[34,39210,40070],[35,40070,42190],[36,42190,43480],[37,43480,44080],[38,44080,45090],[39,45090,46410],[40,46410,47500],[41,47500,48610],[42,48610,49600],[43,49600,49920],[44,49920,50830],[45,50830,51650],[46,51650,53970],[47,53970,54820],[48,54820,56720],[49,56720,58460],[50,58460,59490],[51,59490,60690],[52,60690,61670],[53,61670,63830],[54,63830,64210],[55,64210,64770],[56,64770,65360],[57,65360,66350],[58,66350,67400],[59,67400,69080],[60,69080,69940],[61,69940,71130],[62,71130,73530],[63,73530,74240],[64,74240,75100],[65,75100,76060],[66,76060,77635]]}}