{"name":"4:93","price":"اور جو کوئی کسی مومن کو قصداً قتل کر ڈالے، اس کی سزا دوزخ ہے جس میں وه ہمیشہ رہے گا، اس پر اللہ تعالیٰ کا غضب ہے(1) ، اسے اللہ تعالیٰ نے لعنت کی ہے اور اس کے لئے بڑا عذاب تیار رکھا ہے۔(2)","arabic":"وَمَن يَقۡتُلۡ مُؤۡمِنٗا مُّتَعَمِّدٗا فَجَزَآؤُهُۥ جَهَنَّمُ خَٰلِدٗا فِيهَا وَغَضِبَ ٱللَّهُ عَلَيۡهِ وَلَعَنَهُۥ وَأَعَدَّ لَهُۥ عَذَابًا عَظِيمٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":586,"juzNumber":5,"footnotes":"(1) یہ قتل عمد کی سزا ہے۔ قتل کی تین قسمیں ہیں۔ (1) قتل خطا (جس کا ذکر ماقبل کی آیت میں ہے)۔ (2) قتل شبہ عمد جو حدیث سے ثابت ہے، (3) قتل عمد جس کا مطلب ہے، ارادہ اور نیت سے کسی کو قتل کرنا اور اس کے لئے وہ آلہ استعمال کرنا جس سے فی الواقع عادتاً قتل کیا جا رہا ہے جیسے تلوار، خنجر وغیرہ۔ آیت میں مومن کے قتل پر نہایت سخت وعید بیان کی گئی ہے۔ مثلاً اس کی سزا جہنم ہے، جس میں ہمیشہ رہنا ہوگا، نیز اللہ کا غضب اور اس کی لعنت اور عذاب عظیم بھی ہوگا۔ اتنی سخت سزائیں بیک وقت کسی بھی گناہ کی بیان نہیں کی گئیں۔ جس سے یہ واضح ہو جاتا ہے کہ ایک مومن کو قتل کرنا اللہ کے ہاں کتنا جرم ہے۔ احادیث میں بھی اس کی سخت مذمت اور اس پر سخت وعیدیں بیان کی گئی ہیں۔\n(2) مومن کے قاتل کی توبہ قبول ہے یا نہیں؟ بعض علماء مذکورہ سخت وعیدوں کے پیش نظر قبولِ توبہ کے قائل نہیں۔ لیکن قرآن وحدیث کی نصوص سے واضح ہے کہ خالص توبہ سے ہر گناہ معاف ہو سکتا ہے۔ ”إِلا مَنْ تَابَ وَآمَنَ وَعَمِلَ عَمَلا صَالِحًا“ ( الفرقان: 70) اور دیگر آیات توبہ عام ہیں۔ ہرگناہ چاہے چھوٹا ہو یا بڑا یا بہت بڑا توبہ النصوح سے اس کی معافی ممکن ہے۔ یہاں اس کی سزا جہنم جو بیان کی گئی ہے اس کا مطلب ہے کہ اگر اس نے توبہ نہیں کی تو اس کی یہ سزا ہے جو اللہ تعالیٰ اس جرم پر اسے دے سکتا ہے۔ اسی طرح توبہ نہ کرنے کی صورت میں خلود (ہمیشہ جہنم میں رہنے) کا مطلب بھی مُكْثٌ طَوِيلٌ (لمبی مدت) ہے۔ کیونکہ جہنم میں خلود کافروں اور مشرکوں کے لئے ہی ہے۔ علاوہ ازیں قتل کا تعلق اگرچہ حقوق العباد سے ہے تو جو توبہ سے بھی ساقط نہیں ہوتے لیکن اللہ تعالیٰ اپنے فضل وکرم سے بھی اس کی تلافی اور ازالہ فرما سکتا ہے اس طرح مقتول کو بھی بدلہ مل جائے گا اور قاتل کی بھی معافی ہو جائے گی۔ (فتح القدیر وابن کثیر )","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waman yaqtul mu'minan mutaʿammidan fajazāuhu jahannamu khālidan fīhā waghaḍiba al-lahu ʿalayhi walaʿanahu wa-aʿadda lahu ʿadhāban ʿaẓīman ","translations":["And whoever","kills","a believer","intentionally","then his recompense","(is) Hell","abiding forever","in it","and will fall the wrath","(of) Allah","on him","and He (will) curse him","and He has prepared","for him","a punishment","great","(93)"],"transliterationArr":["waman","yaqtul","mu'minan","mutaʿammidan","fajazāuhu","jahannamu","khālidan","fīhā","waghaḍiba","al-lahu","ʿalayhi","walaʿanahu","wa-aʿadda","lahu","ʿadhāban","ʿaẓīman",null],"verseTiming":[[1,0,1230],[2,1230,2020],[3,2020,3040],[4,3040,6410],[5,6410,9530],[6,9530,11300],[7,11300,12610],[8,12610,14040],[9,14040,17300],[10,17300,18760],[11,18760,20360],[12,20360,21190],[13,21190,21940],[14,21940,22820],[15,22820,23670],[16,23670,25130],[17,25130,25800],[18,25800,26740],[19,26740,27570],[20,27570,28790],[21,28790,29850],[22,29850,30410],[23,30410,31770],[24,31770,33635]]}}