{"name":"50:15","price":"کیا ہم پہلی بار کے پیدا کرنے سے تھک گئے(1) ؟ بلکہ یہ لوگ نئی پیدائش کی طرف سے شک میں ہیں.(2)","arabic":"أَفَعَيِينَا بِٱلۡخَلۡقِ ٱلۡأَوَّلِۚ بَلۡ هُمۡ فِي لَبۡسٖ مِّنۡ خَلۡقٖ جَدِيدٖ","category":["50 (Qaf)","Qaf","Surah Qaf","Chapter Qaf","Surah 50","Chapter 50","Qaf","ق"],"ayahNumber":4645,"juzNumber":26,"footnotes":"(1) کہ قیامت والے دن دوبارہ پیدا کرنا ہمارے لئے مشکل ہوگا۔ مطلب یہ ہے کہ جب پہلی مرتبہ پیدا کرنا ہمارے لئے مشکل نہیں تھا تو دوبارہ زندہ کرنا تو پہلی مرتبہ پیدا کرنے سے زیادہ آسان ہے۔ جیسے دوسرے مقام پر فرمایا «وَهُوَ الَّذِي يَبْدَأُ الْخَلْقَ ثُمَّ يُعِيدُهُ وَهُوَ أَهْوَنُ عَلَيْهِ» (الروم: 27) سورۂ یٰسین، آیت 78- 79 میں بھی یہ مضمون بیان کیا گیا ہے۔ اور حدیث قدسی میں ہے۔ اللہ تعالیٰ فرماتا ہے ”ابن آدم یہ کہہ کر مجھے ایذا پہنچاتا ہے کہ اللہ مجھے ہر گز دوبارہ پیدا کرنے پر قادر نہیں ہے جس طرح اس نے پہلی مرتبہ مجھے پیدا کیا۔ حالانکہ پہلی مرتبہ پیدا کرنا، دوسری مرتبہ پیدا کرنے سے زیادہ آسان نہیں ہے“ یعنی اگر مشکل ہے تو پہلی مرتبہ پیدا کرنا نہ کہ دوسری مرتبہ (البخاري تفسير سورة الإخلاص)۔\n(2) یعنی یہ اللہ کی قدرت کے منکر نہیں، بلکہ اصل بات یہ ہے کہ انہیں قیامت کے وقوع اور اس میں دوبارہ زندگی کے بارے میں ہی شک ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"afaʿayīnā bil-khalqi al-awali bal hum fī labsin min khalqin jadīdin ","translations":["Were We then tired","with the creation","the first","Nay","they","(are) in","doubt","about","a creation","new","(15)"],"transliterationArr":["afaʿayīnā","bil-khalqi","al-awali","bal","hum","fī","labsin","min","khalqin","jadīdin",null],"verseTiming":[[1,0,1730],[2,1730,2860],[3,2860,4030],[4,4030,5160],[5,5160,5510],[6,5510,6020],[7,6020,6830],[8,6830,8180],[9,8180,10240],[10,10240,12825]]}}