{"name":"50:16","price":"ہم نے انسان کو پیدا کیا ہے اور اس کے دل میں جو خیاﻻت اٹھتے ہیں ان سے ہم واقف ہیں(1) اور ہم اس کی رگ جان سے بھی زیاده اس سے قریب ہیں.(2)","arabic":"وَلَقَدۡ خَلَقۡنَا ٱلۡإِنسَٰنَ وَنَعۡلَمُ مَا تُوَسۡوِسُ بِهِۦ نَفۡسُهُۥۖ وَنَحۡنُ أَقۡرَبُ إِلَيۡهِ مِنۡ حَبۡلِ ٱلۡوَرِيدِ","category":["50 (Qaf)","Qaf","Surah Qaf","Chapter Qaf","Surah 50","Chapter 50","Qaf","ق"],"ayahNumber":4646,"juzNumber":26,"footnotes":"(1) یعنی انسان جو کچھ چھپاتا اور دل میں مستور رکھتا ہے، وہ سب ہم جانتے ہیں۔ وسوسہ، دل میں گزرنے والےخیالات کو کہا جاتا ہے جس کا علم اس انسان کے علاوہ کسی کو نہیں ہوتا۔ لیکن اللہ ان وسوسوں کو بھی جانتا ہے۔ اسی لئے حدیث میں آتا ہے ”اللہ تعالیٰ نے میری امت سےدل میں گزرنے والے خیالات کو معاف فرما دیا ہے یعنی ان پرگرفت نہیں فرمائے گا۔ جب تک وہ زبان سے ان کا اظہار یا ان پر عمل نہ کرے“۔ (البخاري كتاب الإيمان باب إذا حنث ناسيا في الأيمان مسلم، باب تجاوز الله عن حديث النفس والخواطر بالقلب إذا لم تستقر)۔\n(2) وَرِيدٌ شہ رگ یا رگ جان کو کہا جاتا ہے جس کے کٹنے سے موت واقع ہو جاتی ہے۔ یہ رگ حلق کے ایک کنارے سے انسان کے کندھے تک ہوتی ہے۔ اس قرب سے مراد قرب علمی ہے یعنی علم کے لحاظ سے ہم انسان کے بالکل بلکہ اتنے قریب ہیں کہ اس کے نفس کی باتوں کو بھی جانتے ہیں۔ امام ابن کثیر فرماتے ہیں کہ نَحْنُ سے مراد فرشتے ہیں۔ یعنی ہمارے فرشتے انسان کی رگ جان سے بھی قریب ہیں۔ کیونکہ انسان کے دائیں بائیں دو فرشتے ہر وقت موجود رہتے ہیں، وہ انسان کی ہر بات اور عمل کو نوٹ کرتے ہیں يَتَلَقَّى الْمُتَلَقِّيَانِ کے معنی ہیں يَأْخُذَانِ وَيُثَبّتَانِ۔ امام شوکانی نے اس کا مطلب بیان کیا ہے کہ ہم انسان کےتمام احوال کو جانتے ہیں، بغیر اس کے کہ ہم ان فرشتوں کےمحتاج ہوں جن کو ہم نے انسان کے اعمال واقوال لکھنے کے لئے مقرر کیا ہے، یہ فرشتے تو ہم نے صرف اتمام حجت کے لئے مقرر کیے ہیں، دو فرشتوں سےمراد بعض کے نزدیک ایک نیکی اور دوسرا بدی لکھنےکے لئے۔ اور بعض کےنزدیک رات اور دن کے فرشتے مراد ہیں۔ رات کے دو فرشتے الگ اور دن کے دو فرشتے الگ (فتح القدیر)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walaqad khalaqnā al-insāna wanaʿlamu mā tuwaswisu bihi nafsuhu wanaḥnu aqrabu ilayhi min ḥabli al-warīdi ","translations":["And certainly","We created","man","and We know","what","whispers","to him","his soul","and We","(are) nearer","to him","than","(his) jugular vein","(his) jugular vein","(16)"],"transliterationArr":["walaqad","khalaqnā","al-insāna","wanaʿlamu","mā","tuwaswisu","bihi","nafsuhu","wanaḥnu","aqrabu","ilayhi","min","ḥabli","al-warīdi",null],"verseTiming":[[1,0,900],[2,900,1870],[3,1870,4070],[4,4070,5240],[5,5240,5610],[6,5610,6850],[7,6850,7530],[8,7530,8410],[9,8410,9780],[10,9780,10610],[11,10610,11590],[12,11590,11980],[13,11980,12710],[14,12710,15655]]}}