{"name":"50:14","price":"اور ایکہ(1) والوں نے تبع کی قوم(2) نے بھی تکذیب کی تھی۔ سب نے پیغمبروں کو جھٹلایا(3) پس میرا وعدہٴ عذاب ان پر صادق آگیا.","arabic":"وَأَصۡحَٰبُ ٱلۡأَيۡكَةِ وَقَوۡمُ تُبَّعٖۚ كُلّٞ كَذَّبَ ٱلرُّسُلَ فَحَقَّ وَعِيدِ","category":["50 (Qaf)","Qaf","Surah Qaf","Chapter Qaf","Surah 50","Chapter 50","Qaf","ق"],"ayahNumber":4644,"juzNumber":26,"footnotes":"(1) أَصْحَابُ الأيْكَةِ کے لئے دیکھئے سورۃ الشعراء، آیت 176 کا حاشیہ۔\n(2) قَوْمُ تُبَّعٍ کے لئے دیکھئے سورۃ الدخان، آیت 37 کا حاشیہ۔\n(3) یعنی ان میں سے ہر ایک نے اپنے اپنے پیغمبر کو جھٹلایا۔ اس میں رسول اللہ (صلى الله عليه وسلم) کےلئے تسلی ہے۔ گویا آپ (صلى الله عليه وسلم) کو کہا جا رہا ہے کہ آپ (صلى الله عليه وسلم) اپنی قوم کی طرف سے اپنی تکذیب پر غمگین نہ ہوں اس لئے کہ یہ کوئی نئی بات نہیں ہے، آپ (صلى الله عليه وسلم) سے پہلے انبیا علیہم السلام کے ساتھ بھی ان کی قوموں نے یہی معاملہ کیا۔ دوسرے اہل مکہ کو تنبیہ ہے کہ پچھلی قوموں نے انبیا علیہم السلام کی تکذیب کی تو دیکھ لو ان کا کیا انجام ہوا؟ کیا تم بھی اپنے لئے یہی انجام پسند کرتے ہو؟ اگر یہ انجام پسند نہیں کرتے تو تکذیب کا راستہ چھوڑ دو اور پیغمبر (صلى الله عليه وسلم) پر ایمان لے آؤ۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-aṣḥābu al-aykati waqawmu tubbaʿin kullun kadhaba al-rusula faḥaqqa waʿīdi ","translations":["And (the) companions","(of) the wood","and (the) people","(of) Tubba","All","denied","the Messengers","so was fulfilled","My Threat","(14)"],"transliterationArr":["wa-aṣḥābu","al-aykati","waqawmu","tubbaʿin","kullun","kadhaba","al-rusula","faḥaqqa","waʿīdi",null],"verseTiming":[[1,0,1300],[2,1300,2560],[3,2560,3430],[4,3430,4400],[5,4400,6390],[6,6390,7250],[7,7250,8310],[8,8310,9260],[9,9260,11935]]}}