{"name":"50:45","price":"یہ جو کچھ کہہ رہے ہیں ہم بخوبی جانتے ہیں اور آپ ان پر جبر کرنے والے نہیں(1) ، تو آپ قرآن کے ذریعے انہیں سمجھاتے رہیں جو میرے وعید (ڈرانے کے وعدوں) سے ڈرتے ہیں.(2)","arabic":"نَّحۡنُ أَعۡلَمُ بِمَا يَقُولُونَۖ وَمَآ أَنتَ عَلَيۡهِم بِجَبَّارٖۖ فَذَكِّرۡ بِٱلۡقُرۡءَانِ مَن يَخَافُ وَعِيدِ","category":["50 (Qaf)","Qaf","Surah Qaf","Chapter Qaf","Surah 50","Chapter 50","Qaf","ق"],"ayahNumber":4675,"juzNumber":26,"footnotes":"(1) یعنی آپ (صلى الله عليه وسلم) اس بات کے مکلف نہیں ہیں کہ ان کو ایمان لانے پر مجبور کریں۔ بلکہ آپ (صلى الله عليه وسلم) کا کام صرف تبلیغ ودعوت ہے، وہ کرتے رہیں۔\n(2) یعنی آپ (صلى الله عليه وسلم) کی دعوت وتذکیر سے وہی نصیحت حاصل کرے گا جو اللہ سے اور اس کی وعیدوں سے ڈرتا اور اس کے وعدوں پر یقین رکھتا ہوگا۔ اسی لئےحضرت قتادہ یہ دعا فرمایا کرتے تھے «اللَّهُمَّ اجْعَلْنَا مِمَّنْ يَخَافُ وَعِيدَكَ ، وَيَرْجُو مَوْعُودَكَ يَا بَارُّ يَا رَحِيمُ» ”اے اللہ ہمیں ان لوگوں میں سےکر جو تیرے وعیدوں سے ڈرتے اور تیرے وعدوں کی امید رکھتے ہیں۔ اے احسان کرنے والے رحم فرمانے والے“۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"naḥnu aʿlamu bimā yaqūlūna wamā anta ʿalayhim bijabbārin fadhakkir bil-qur'āni man yakhāfu waʿīdi ","translations":["We","know best","[of] what","they say","and not","(are) you","over them","the one to compel","But remind","with the Quran","whoever","fears","My threat","(45)"],"transliterationArr":["naḥnu","aʿlamu","bimā","yaqūlūna","wamā","anta","ʿalayhim","bijabbārin","fadhakkir","bil-qur'āni","man","yakhāfu","waʿīdi",null],"verseTiming":[[1,0,1650],[2,1650,2420],[3,2420,5810],[4,5810,7949],[5,7949,9320],[6,9320,11510],[7,11510,15700],[8,15700,16820],[9,16820,18660],[10,18660,19490],[11,19490,20800],[12,20800,25825]]}}