{"name":"51:36","price":"اور ہم نے وہاں مسلمانوں کا صرف ایک ہی گھر پایا.(1)","arabic":"فَمَا وَجَدۡنَا فِيهَا غَيۡرَ بَيۡتٖ مِّنَ ٱلۡمُسۡلِمِينَ","category":["51 (Adh-Dhariyat)","Adh-Dhariyat","Surah Adh-Dhariyat","Chapter Adh-Dhariyat","Dhariyat","Surah Dhariyat","Chapter Dhariyat","Adh Dhariyat","Surah Adh Dhariyat","Chapter Adh Dhariyat","Surah 51","Chapter 51","The Winnowing Winds","الذَّاريَات"],"ayahNumber":4711,"juzNumber":27,"footnotes":"(1) اور یہ اللہ کے پیغمبر حضرت لوط (عليه السلام) کاگﮭر تھا، جس میں ان کی دو بیٹیاں اور کچھ ان پر ایمان لانے والے تھے۔ کہتے ہیں یہ کل تیرہ آدمی تھے ان میں حضرت لوط (عليه السلام) کی بیوی شامل نہیں تھی۔ بلکہ وہ اپنی قوم کے ساتھ عذاب سے ہلاک ہونے والوں میں سے تھی۔ (ایسر التفاسیر) اسلام کے معنی ہیں، اطاعت و انقیاد۔ اللہ کے حکموں پر سر اطاعت خم کر دینے والا مسلم ہے، اس اعتبار سے ہر مومن،مسلمان ہے۔ اسی لیےپہلے ان کے لیے مومن کا لفظ استعمال کیا، اور پھر ان ہی کے لیے مسلم کا لفظ بولا گیا ہے۔ اس سے استدلال کیا گیا ہے کہ ان کے مصداق میں کوئی فرق نہیں ہے۔ جیساکہ بعض لوگ مومن اور مسلم کے درمیان کرتے ہیں۔ قرآن نے جو کہیں مومن اور کہیں مسلم کا لفظ استعمال کیا ہے تو وہ ان معانی کے اعتبار سے ہے جو عربی لغت کی رو سے ان کے درمیان ہے۔ اس لیےلغوی استعمال کے مقابلے میں حقیقت شرعیہ کا اعتبار زیادہ ضروری ہے اور حقیقت شرعیہ کے اعتبارسےان کے درمیان صرف وہی فرق ہے جو حدیث جبرائیل (عليه السلام) سے ثابت ہے۔ جب نبی (صلى الله عليه وسلم) سے پوچھا گیا کہ اسلام کیا ہے۔ تو آپ نے فرمایا، لا الہٰ الا اللہ کی شہادت، اقامت صلوۃ، ایتائے زکوٰۃ، حج اور صیام رمضان۔ اور جب ایمان کی بابت پوچھا گیا تو فرمایا؟ ”اللہ پر ایمان لانا، اس کے ملائکہ، کتابوں، رسولوں اور تقدیر (خیر وشر کے من جانب اللہ ہونے) پر ایمان رکھنا“ یعنی دل سے ان چیزوں پر یقین رکھنا ایمان اور احکام و فرائض کی ادائیگی اسلام ہے۔ اس لحاظ سے ہر مومن، مسلمان اورہر مسلمان مومن ہے (فتح القدیر) اور جو مومن اورمسلم کے درمیان فرق کرتے ہیں وہ کہتے ہیں کہ یہ ٹھیک ہےکہ یہاں قرآن نے ایک ہی گروہ کے لیے مومن اور مسلم کے الفاظ استعمال کیے ہیں لیکن ان کے درمیان جو فرق ہے اس کی رو سےہر مومن، مسلم بھی ہے، تاہم ہرمسلم کا مومن ہونا ضروری نہیں (ابن کثیر) بہرحال یہ ایک علمی بحث ہے فریقین کے پاس اپنے اپنے موقف پر استدلال کےلیے دلائل موجود ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"famā wajadnā fīhā ghayra baytin mina al-mus'limīna ","translations":["But not","We found","therein","other than","a house","of","the Muslims","(36)"],"transliterationArr":["famā","wajadnā","fīhā","ghayra","baytin","mina","al-mus'limīna",null],"verseTiming":[[1,0,630],[2,630,1780],[3,1780,2710],[4,2710,3460],[5,3460,4280],[6,4280,5370],[7,5370,8485]]}}