{"name":"52:21","price":"اور جو لوگ ایمان ﻻئے اور ان کی اوﻻد نے بھی ایمان میں ان کی پیروی کی ہم ان کی اوﻻد کو ان تک پہنچا دیں گے اور ان کے عمل سے ہم کچھ کم نہ کریں گے(1) ، ہر شخص اپنے اپنے اعمال کا گروی ہے.(2)","arabic":"وَٱلَّذِينَ ءَامَنُواْ وَٱتَّبَعَتۡهُمۡ ذُرِّيَّتُهُم بِإِيمَٰنٍ أَلۡحَقۡنَا بِهِمۡ ذُرِّيَّتَهُمۡ وَمَآ أَلَتۡنَٰهُم مِّنۡ عَمَلِهِم مِّن شَيۡءٖۚ كُلُّ ٱمۡرِيِٕۭ بِمَا كَسَبَ رَهِينٞ","category":["52 (At-Tur)","At-Tur","Surah At-Tur","Chapter At-Tur","Tur","Surah Tur","Chapter Tur","At Tur","Surah At Tur","Chapter At Tur","Surah 52","Chapter 52","The Mount","الطور"],"ayahNumber":4756,"juzNumber":27,"footnotes":"(1) یعنی جن کے باپ اپنے اخلاص و تقویٰ اورعمل و کردار کی بنیاد پر جنت کےاعلیٰ درجوں پر فائز ہوں گے، اللہ تعالیٰ ان کی ایماندار اولاد کے بھی درجے بلند کرکے، ان کو ان کے باپوں کے ساتھ ملا دے گا۔ یہ نہیں کرے گا کہ ان کے باپوں کے درجے کم کرکے ان کی اولاد والے کمتر درجوں میں انہیں لے آئے۔ یعنی اہل ایمان پر دو گونہ احسان فرمائے گا۔ ایک تو باپ بیٹوں کو آپس میں ملادے گا تاکہ ان کی آنکھیں ٹھنڈی ہوں، بشرطیکہ دونوں ایماندار ہو۔ دوسرا یہ کہ کم تر درجے والوں کو اٹھا کر اونچے درجوں پرفائز فرما دے گا۔ ورنہ دونوں کے ملاپ کا یہ طریقہ بھی ہو سکتا ہے کہ اے کلاس والوں کو بی کلاس دے دے، یہ بات چونکہ اس کے فضل واحسان سے فروتر ہوگی، اس لیے وہ ایسا نہیں کرے گا بلکہ بی کلاس والوں کو اے کلاس عطا فرمائے گا۔ یہ تو اللہ کا وہ احسان ہے جو اولاد پر، آباکے عملونکی برکت سے ہوگا اورحدیث میں آتاہے کہ اولاد کی دعا واستغفار سے آباکے درجات میں بھی اضافہ ہوتا ہے ایک شخص کے جب جنت میں درجے بلند ہوتے ہیں تو وہ اللہ سے اس کا سبب پوچھتا ہے، اللہ تعالیٰ فرماتا ہے تیری اولاد کی تیرے لیے دعائے مغفرت کرنے کی وجہ سے (مسند احمد، 2 / 509) اس کی تائید اس حدیث سے بھی ہوتی ہے جس میں آتا ہے کہ ”جب انسان مر جاتا ہےتواس کے عمل کا سلسلہ منقطع ہوجاتا ہے۔ البتہ تین چیزوں کا ثواب، موت کے بعد بھی جاری رہتا ہے ایک صدقۂ جاریہ۔ دوسرا، وہ علم جس سے لوگ فیض یاب ہوتے رہیں اور تیسری، نیک اولاد جو اس کے لیے دعا کرتی ہو۔ (مسلم، كتاب الوصية، باب ما يلحق الإنسان من الثواب بعد وفاته)۔\n(2) رَهِينٌ بمعنی مَرْهُونٍ (گروی شدہ چیز) ہر شخص اپنے عمل کا گروی ہوگا۔ یہ عام ہے، مومن اور کافر دونوں کو شامل ہے اورمطلب ہے کہ جو جیسا (اچھا یا برا) عمل کرے گا، اس کےمطابق (اچھی یا بری) جزا پائے گا۔ یا اس سےمراد صرف کافر ہیں کہ وہ اپنے اعمال میں گرفتار ہوں گے، جیسے دوسرے مقام پر فرمایا «كُلُّ نَفْسٍ بِمَا كَسَبَتْ رَهِينَةٌ ، إِلا أَصْحَابَ الْيَمِينِ» (المدثر: 38۔ 39) ”ہرشخص اپنےاعمال میں گرفتار ہو گا۔ سوائے اصحاب الیمین (اہل ایمان) کے“۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-alladhīna āmanū wa-ittabaʿathum dhurriyyatuhum biīmānin alḥaqnā bihim dhurriyyatahum wamā alatnāhum min ʿamalihim min shayin kullu im'ri-in bimā kasaba rahīnun ","translations":["And those who","believed","and followed them","their offspring","in faith","We will join","with them","their offspring","and not","We will deprive them","of","their deeds","(in) any","thing","Every","person","for what","he earned","(is) pledged","(21)"],"transliterationArr":["wa-alladhīna","āmanū","wa-ittabaʿathum","dhurriyyatuhum","biīmānin","alḥaqnā","bihim","dhurriyyatahum","wamā","alatnāhum","min","ʿamalihim","min","shayin","kullu","im'ri-in","bimā","kasaba","rahīnun",null],"verseTiming":[[1,0,1370],[2,1370,2650],[3,2650,4270],[4,4270,6820],[5,6820,8460],[6,8460,9750],[7,9750,10450],[8,10450,12260],[9,12260,14170],[10,14170,15710],[11,15710,16790],[12,16790,17850],[13,17850,20060],[14,20060,20370],[15,20370,23160],[16,23160,24180],[17,24180,25210],[18,25210,25960],[19,25960,28685]]}}