{"name":"52:48","price":"تو اپنے رب کے حکم کے انتظار میں صبر سے کام لے، بیشک تو ہماری آنکھوں کے سامنے ہے۔ صبح کو جب تو اٹھے(1) اپنے رب کی پاکی اور حمد بیان کر.","arabic":"وَٱصۡبِرۡ لِحُكۡمِ رَبِّكَ فَإِنَّكَ بِأَعۡيُنِنَاۖ وَسَبِّحۡ بِحَمۡدِ رَبِّكَ حِينَ تَقُومُ","category":["52 (At-Tur)","At-Tur","Surah At-Tur","Chapter At-Tur","Tur","Surah Tur","Chapter Tur","At Tur","Surah At Tur","Chapter At Tur","Surah 52","Chapter 52","The Mount","الطور"],"ayahNumber":4783,"juzNumber":27,"footnotes":"(1) اس کھڑے ہونے سے کون سا کھڑا ہونا مراد ہے؟ بعض کہتےہیں جب نماز کے لیے کھڑے ہوں۔ جیساکہ آغاز نماز میں «سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ وَتَبَارَكَ اسْمُكَ» . . . پڑھی جاتی ہے۔ بعض کہتے ہیں، جب نیند سے بیدار ہو کر کھڑے ہوں۔ اس وقت بھی اللہ کی تسبیح و تحمید مسنون ہے۔ بعض کہتےہیں کہ جب کسی مجلس سےکھڑے ہوں۔ جیسے حدیث میں آتا ہے۔ جو شخص کسی مجلس سے اٹھتے وقت یہ دعا پڑھ لے گا تو یہ اس کی مجلس کے گناہوں کاکفارہ ہو جائے گا۔ «سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ أَشْهَدُ أَنْ لا إِلَهَ إِلا أَنْتَ أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ» (سنن الترمذي، أبواب الدعوات، باب ما يقول إذا قام من مجلسه)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-iṣ'bir liḥuk'mi rabbika fa-innaka bi-aʿyuninā wasabbiḥ biḥamdi rabbika ḥīna taqūmu ","translations":["So be patient","for (the) Command","(of) your Lord","for indeed, you","(are) in Our Eyes","And glorify","(the) praise","(of) your Lord","when","you arise","(48)"],"transliterationArr":["wa-iṣ'bir","liḥuk'mi","rabbika","fa-innaka","bi-aʿyuninā","wasabbiḥ","biḥamdi","rabbika","ḥīna","taqūmu",null],"verseTiming":[[1,0,960],[2,960,1800],[3,1800,2730],[4,2730,4840],[5,4840,6490],[6,6490,8070],[7,8070,8960],[8,8960,9950],[9,9950,10640],[10,10640,13895]]}}