{"name":"53:20","price":"اور منات تیسرے پچھلے کو.(1)","arabic":"وَمَنَوٰةَ ٱلثَّالِثَةَ ٱلۡأُخۡرَىٰٓ","category":["53 (An-Najm)","An-Najm","Surah An-Najm","Chapter An-Najm","Najm","Surah Najm","Chapter Najm","An Najm","Surah An Najm","Chapter An Najm","Surah 53","Chapter 53","The Star","النجم"],"ayahNumber":4804,"juzNumber":27,"footnotes":"(1) یہ مشرکین کی تو بیخ کے لیے کہا جا رہا ہے کہ اللہ کی یہ توشان ہے جومذکور ہوئی کہ جبرائیل (عليه السلام) جیسے عظیم فرشتوں کا وہ خالق ہے، محمد صلی اللہ علیہ وسلم جیسے اس کے رسول ہیں، جنہیں اس نے آسمانوں پر بلا کر بڑی بڑی نشانیوں کا مشاہدہ بھی کروایا اور وحی بھی ان پر نازل فرماتا ہے۔ کیا تم جن معبودوں کی عبادت کرتے ہو، ان کے اندر بھی یہ یا اس قسم کی خوبیاں ہیں؟ اس ضمن میں عرب کے تین مشہور بتوں کے نام بطور مثال لیے۔ لاَتٌ، بعض کے نزدیک یہ لفظ اللہ سے ماخوذ ہے، بعض کے نزدیک لاتَ يَلِيتُ سے ہے، جس کے معنی موڑنے کے ہیں، پجاری اپنی گردنیں اس کی طرف موڑتے اور اس کا طواف کرتے تھے۔ اس لیے یہ نام پڑ گیا۔ بعض کہتےہیں کہ، لات میں تامشدد ہے۔ لَتَّ يَلُتُّ سے اسم فاعل (ستو گھولنے والا) یہ ایک نیک آدمی تھا، حاجیوں کو ستو گھول گھول کرپلایا کرتا تھا، جب یہ مر گیا تو لوگوں نے اس کی قبر کو عبادت گاہ بنا لیا، پھر اس کے مجسمے اور بت بن گئے۔ یہ طائف میں بنو ثقیف کا سب سے بڑا بت تھا۔ عُزَّى کہتےہیں کہ یہ اللہ کے صفاتی نام عَزِيزٌ سے ماخوذ ہے، اور یہ أَعَزُّ کی تانیث ہے بمعنی عَزِيزَةٍ بعض کہتے ہیں کہ یہ غطفان میں ایک درخت تھا جس کی عبادت کی جاتی تھی، بعض کہتے ہیں کہ شیطاننی (بھوتنی) تھی جوبعض درختوں میں ظاہر ہوتی تھی۔ بعض کہتے ہیں کہ یہ سنگ ابیض تھا جس کو پوجتے تھے۔ یہ قریش اور بنو کنانہ کا خاص معبود تھا۔ مَنَاة مَنَى يَمْنِي سے ہے جس کے معنی صَبَّ (بہانے) کے ہیں اس کا تقرب حاصل کرنے کے لیے لوگ کثرت سے اس کے پاس جانور ذبح کرتے اور ان کا خون بہاتے تھے۔ یہ مکہ اور مدینہ کے درمیان ایک بت تھا (فتح القدیر) یہ قدید کے بالمقابل مشلل جگہ میں تھا، بنو خزاعہ کا یہ خاص بت تھا۔ زمانۂ جاہلیت میں اوس اور خزرج یہیں سے احرام باندھتے تھے اور اس بت کا طواف بھی کرتے تھے۔ (ایسر التفاسیر وابن کثیر) ان کے علاوہ مختلف اطراف میں اور بھی بہت سے بت اور بت خانے پھیلے ہوئے تھے۔ نبی صلی اللہ علیہ وسلم نے فتح مکہ کے بعد اور دیگر مواقع پر ان بتوں اور دیگر تمام بتوں کا خاتمہ فرما دیا۔ ان پر جو قبے عمارتیں بنی ہوئی تھیں۔ وہ مسمار کروا دیں، ان درختوں کو کٹوا دیا، جن کی تعظیم کی جاتی تھی اور وہ تمام آثار ومظاہر مٹا ڈالے گئے جو بت پرستی کی یادگار تھے، اس کام کے لیے آپ صلی اللہ علیہ وسلم نے حضرت خالد، حضرت علی، حضرت عمرو بن عاص اور حضرت جریر بن عبداللہ البجلی وغیرھم (رضي الله عنهم) کو، جہاں جہاں یہ بت تھے، بھیجا اور انہوں نے جاکر ان سب کوڈھا کر سرزمین عرب سے شرک کا نام مٹا دیا۔ (ابن کثیر) قرون اولی ٰکے بہت بعد ایک مرتبہ پھر عرب میں شرک کے یہ مظاہر عام ہو گئے تھے۔ جس کے لیے اللہ تعالیٰ نے مجدد الدعوۃ شیخ محمد بن عبدالوہاب کو توفیق دی، انہوں نے درعیہ کے حاکم کواپنے ساتھ ملا کر قوت کے ذریعے سے ان مظاہر شرک کا خاتمہ فرمایا اوراسی دعوت کی تجدید ایک مرتبہ پھر سلطان عبدالعزیز والی نجد وحجاز (موجودہ سعودی حکمرانوں کے والد اور اس مملکت کے بانی) نے کی اور تمام پختہ قبروں اور قبوں کو ڈھا کر سنت نبوی ﹲ کااحیاء فرمایااور یوں الحمد للہ اب پورے سعودی عرب میں اسلام کے احکام کے مطابق نہ کوئی پختہ قبر ہے اور نہ کوئی مزار۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wamanata al-thālithata al-ukh'rā ","translations":["And Manat","the third","the other","(20)"],"transliterationArr":["wamanata","al-thālithata","al-ukh'rā",null],"verseTiming":[[1,0,1160],[2,1160,2600],[3,2600,4525]]}}