{"name":"53:32","price":"ان لوگوں کو جو بڑے گناہوں سے بچتے ہیں اور بے حیائی سے بھی(1) ۔ سوائے کسی چھوٹے سے گناه کے(2)۔ بیشک تیرا رب بہت کشاده مغفرت واﻻ ہے، وه تمہیں بخوبی جانتا ہے جبکہ اس نے تمہیں زمین سے پیدا کیا اور جبکہ تم اپنی ماؤں کے پیٹ میں بچے تھے(3)۔ پس تم اپنی پاکیزگی آپ بیان نہ کرو(4)، وہی پرہیزگاروں کو خوب جانتا ہے.","arabic":"ٱلَّذِينَ يَجۡتَنِبُونَ كَبَٰٓئِرَ ٱلۡإِثۡمِ وَٱلۡفَوَٰحِشَ إِلَّا ٱللَّمَمَۚ إِنَّ رَبَّكَ وَٰسِعُ ٱلۡمَغۡفِرَةِۚ هُوَ أَعۡلَمُ بِكُمۡ إِذۡ أَنشَأَكُم مِّنَ ٱلۡأَرۡضِ وَإِذۡ أَنتُمۡ أَجِنَّةٞ فِي بُطُونِ أُمَّهَٰتِكُمۡۖ فَلَا تُزَكُّوٓاْ أَنفُسَكُمۡۖ هُوَ أَعۡلَمُ بِمَنِ ٱتَّقَىٰٓ","category":["53 (An-Najm)","An-Najm","Surah An-Najm","Chapter An-Najm","Najm","Surah Najm","Chapter Najm","An Najm","Surah An Najm","Chapter An Najm","Surah 53","Chapter 53","The Star","النجم"],"ayahNumber":4816,"juzNumber":27,"footnotes":"(1) كَبَائِرُ، كَبِيرَةٌ کی جمع ہے۔ کبیرہ گناہ کی تعریف میں اختلاف ہے۔ زیادہ اہل علم کے نزدیک ہروہ گناہ کبیرہ ہے جس پر جہنم کی وعیدہے، یا جس کے مرتکب کی سخت مذمت قرآن و حدیث میں مذکور ہے اور اہل علم یہ بھی کہتے ہیں کہ چھوٹے گناہ پر اصرار و دوام بھی اسے کبیرہ گنا ہ بنا دیتا ہے۔ علاوہ ازیں اس کے معنی اور ماہیت کی تحقیقی میں الکبائر للذہبی اور الزواجر وغیرہ۔ فَوَاحِشُ، فَاحِشَةٌ کی جمع ہے، بےحیائی پر مبنی کام، جیسے زنا، لواطت وغیرہ۔ بعض کہتے ہیں، جن گناہوں میں حد ہے، وہ سب فواحش میں داخل ہیں۔ آج کل بے حیائی کے مظاہر چونکہ بہت عام ہو گئے ہیں، اس لیے بےحیائی کو تہذیب سمجھ لیا گیا ہے، حتیٰ کہ اب مسلمانوں نے بھی اب اس تہذیب بے حیائی کو اپنا لیا ہے۔ چنانچہ گھروں میں ٹی وی، وی سی آر وغیرہ عام ہیں، عورتوں نے نہ صرف پردے کو خیرباد کہہ دیا ہے،بلکہ بن سنورکر اور حسن وجمال کا مجسم اشتہار بن کر باہر نکلنے کو اپنا شعار اور وطیرہ بنا لیا ہے۔ مخلوط تعلیم، مخلوط ادارے، مخلوط مجلسیں اور دیگر بہت سے موقعوں پر مرد وزن کا بےباکانہ اختلاط اور بےمحابا گفتگو روز افزوں ہے، دراں حالیکہ یہ سب فواحش میں داخل ہیں۔ جن کی بابت یہاں بتلایا جا رہاہے کہ جن لوگوں کی مغفرت ہونی ہے، وہ کبائر وفواحش سے اجتناب کرنے والے ہوں گے نہ کہ ان میں مبتلا۔\n(2) لَمَمٌ کےلغوی معنی ہیں، کم اورچھوٹا ہونا، اسی سے اس کے یہ استعمالات ہیں أَلَمَّ بِالْمَكَانِ(مکان میں تھوڑی دیر ٹھہرا) أَلَمَّ بِالطَّعَامِ (تھوڑسا کھایا) ، اسی طرح کسی چیز کو محض چھو لینا، یا اس کے قریب ہونا، یا کسی کام کو ایک مرتبہ یا دو مرتبہ کرنا، اس پر دوام و استمرار نہ کرنا، یا محض دل میں خیال کا گزرنا، یہ سب صورتیں لَمَمٌ کہلاتی ہیں، (فتح القدیر) اس کے اس مفہوم اور استعمال کی رو سے اس کے معنی صغیرہ گناہ کیے جاتےہیں۔ جس کا مطلب یہ ہے کہ کسی بڑے گناہ کےمبادیات کا ارتکاب، لیکن بڑےگناہ سے اجتناب کرنا، یا کسی گناہ کا ایک دو مرتبہ کرنا پھر ہمیشہ کے لیے اسے چھوڑ دینا، یا کسی گناہ کامﺤﺾ دل میں خیال کرنا لیکن عملاً اس کے قریب نہ جانا، یہ سارے صغیرہ گناہ ہوں گے، جو اللہ تعالیٰ کبائر سے اجتناب کی برکت سے معاف فرمادےگا۔\n(3) أَجِنَّةٌ، جَنِينٌ کی جمع ہے جو پیٹ کے بچےکو کہا جاتا ہے،اس لیے کہ یہ لوگوں کی نظروں سےمستور ہوتا ہے۔\n(4) یعنی جب اس سے تمہاری کوئی کیفیت اور حرکت مخفی نہیں، حتیٰ کہ جب تم ماں کے پیٹ میں تھے، جہاں تمہیں کوئی دیکھنے پرقادر نہیں تھا، وہاں بھی تمہارے تمام احوال سے وہ واقف تھا، تو پھر اپنی پاکیزگی بیان کرنے کی اور اپنے منہ میاں مٹھو بننے کی کیا ضرورت ہے؟ مطلب یہ ہے کہ ایسا نہ کرو تاکہ ریاکاری سے تم بچو۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"alladhīna yajtanibūna kabāira al-ith'mi wal-fawāḥisha illā al-lamama inna rabbaka wāsiʿu al-maghfirati huwa aʿlamu bikum idh ansha-akum mina al-arḍi wa-idh antum ajinnatun fī buṭūni ummahātikum falā tuzakkū anfusakum huwa aʿlamu bimani ittaqā ","translations":["Those who","avoid","great","sins","and the immoralities","except","the small faults","indeed","your Lord","(is) vast","(in) forgiveness","He","(is) most knowing about you","(is) most knowing about you","when","He produced you","from","the earth","and when","you (were)","fetuses","in","(the) wombs","(of) your mothers","So (do) not","ascribe purity","(to) yourselves","He","knows best","(he) who","fears","(32)"],"transliterationArr":["alladhīna","yajtanibūna","kabāira","al-ith'mi","wal-fawāḥisha","illā","al-lamama","inna","rabbaka","wāsiʿu","al-maghfirati","huwa","aʿlamu","bikum","idh","ansha-akum","mina","al-arḍi","wa-idh","antum","ajinnatun","fī","buṭūni","ummahātikum","falā","tuzakkū","anfusakum","huwa","aʿlamu","bimani","ittaqā",null],"verseTiming":[[1,0,1250],[2,1250,2800],[3,2800,5480],[4,5480,6470],[5,6470,8160],[6,8160,8690],[7,8690,10230],[8,10230,11420],[9,11420,12440],[10,12440,13250],[11,13250,15120],[12,15120,15460],[13,15460,16430],[14,16430,17120],[15,17120,17520],[16,17520,19290],[17,19290,20320],[18,20320,21340],[19,21340,21950],[20,21950,23550],[21,23550,25680],[22,25680,26520],[23,26520,27460],[24,27460,30550],[25,30550,31190],[26,31190,34260],[27,34260,36740],[28,36740,37080],[29,37080,38070],[30,38070,38740],[31,38740,40215]]}}