{"name":"53:39","price":"اور یہ کہ ہر انسان کے لیے صرف وہی ہے جس کی کوشش خود اس نے کی.(1)","arabic":"وَأَن لَّيۡسَ لِلۡإِنسَٰنِ إِلَّا مَا سَعَىٰ","category":["53 (An-Najm)","An-Najm","Surah An-Najm","Chapter An-Najm","Najm","Surah Najm","Chapter Najm","An Najm","Surah An Najm","Chapter An Najm","Surah 53","Chapter 53","The Star","النجم"],"ayahNumber":4823,"juzNumber":27,"footnotes":"(1) یعنی جس طرح کوئی کسی دوسرےکے گناہ کا ذمےدار نہیں ہوگا، اسی طرح اسے آخرت میں اجر بھی انہی چیزوں کاملے گا، جن میں اس کی اپنی محنت ہو گی۔ (اس جزا کا تعلق آخرت سے ہے، دنیا سے نہیں۔ جیساکہ بعض سوشلسٹ قسم کے اہل علم اس کا یہ مفہوم باور کرا کے غیر حاضر زمینداری اور کرایہ داری کو ناجائز قرار دیتے ہیں) البتہ اس آیت سے ان علماکا استدلال صحیح ہے جو کہتے ہیں کہ قرآن خوانی کا ثواب میت کو نہیں پہنچتا۔ اس لیے کہ یہ مردہ کا عمل ہے نہ اس کی محنت۔ اسی لیے رسول ﹲ نے اپنی امت کو مردوں کے لیے قرآن خوانی کی ترغیب دی نہ کسی نص یا اشارہ النص سے اس کی طرف رہنمائی فرمائی۔ اسی طرح صحابہ کرام (رضي الله عنهم) سے یہ بھی عمل منقول نہیں۔ اگر یہ عمل، عمل خیرہوتا توصحابہ (رضي الله عنهم) اسے ضرور اختیار کرتے۔ اور عبادات و قربات کے لیے نص کا ہونا ضروری ہے، اس میں رائے اور قیاس نہیں چل سکتا۔ البتہ دعا اور صدقہ خیرات کا ثواب مردوں کوپہنچتا ہے، اس پر تمام علما کا اتفاق ہے، کیونکہ یہ شارع کی طرف سے منصوص ہے۔ اور وہ جو حدیث ہے کہ مرنے کے بعد تین چیزوں کاسلسلہ جاری رہتا ہے، تو وہ بھی دراصل انسان کے اپنے عمل ہیں جو کسی نہ کسی انداز سے اس کی موت کے بعد بھی جاری رہتے ہیں۔ اولاد کونبی ﹲ نےخود انسان کی اپنی کمائی قرار دیا ہے۔ (سنن النسائي، كتاب البيوع، باب الحث على الكسب) صدقۂ جاریہ، وقف کی طرح انسان کے اپنے آثارعمل ہیں۔ «وَنَكْتُبُ مَا قَدَّمُوا وَآثَارَهُمْ» (یٰس:12) اسی طرح وہ علم، جس کی اس نے لوگوں میں نشر واشاعت کی اور لوگوں نے اس کی اقتدا کی، تویہ اس کی سعی اوراس کا عمل ہے اور بمصداق حدیث نبوی \"مَنْ دَعَا إِلَى هُدًى، كَانَ لَهُ مِنَ الأَجْرِ مِثْل أُجُورِ مَنْ تَبِعَهُ، مِنْ غَيْرِ أَنْ يَنْقُصَ مِنْ أُجُورِهِمْ شَيْئًا\"- (سنن أبي داود كتاب السنة، باب لزوم السنة) اقتدا کرنے والوں کا اجر بھی اسے پہنچتا رہے گا۔ اس لیے یہ حدیث، آیت کے منافی نہیں ہے۔ (ابن کثیر)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-an laysa lil'insāni illā mā saʿā ","translations":["And that","is not","for man","except","what","he strives (for)","(39)"],"transliterationArr":["wa-an","laysa","lil'insāni","illā","mā","saʿā",null],"verseTiming":[[1,0,450],[2,450,1240],[3,1240,3650],[4,3650,4560],[5,4560,4950],[6,4950,5805]]}}