{"name":"54:37","price":"اور ان (لوط علیہ السلام) کو ان کے مہمانوں کے بارے میں پھسلایا(1) پس ہم نے ان کی آنکھیں اندھی کردیں(2)، (اور کہہ دیا) میرا عذاب اور میرا ڈرانا چکھو.","arabic":"وَلَقَدۡ رَٰوَدُوهُ عَن ضَيۡفِهِۦ فَطَمَسۡنَآ أَعۡيُنَهُمۡ فَذُوقُواْ عَذَابِي وَنُذُرِ","category":["54 (Al-Qamar)","Al-Qamar","Surah Al-Qamar","Chapter Al-Qamar","Qamar","Surah Qamar","Chapter Qamar","Al Qamar","Surah Al Qamar","Chapter Al Qamar","Surah 54","Chapter 54","The Moon","القَمَر"],"ayahNumber":4883,"juzNumber":27,"footnotes":"(1) یا بہلایا یا مانگا لوط (عليه السلام) سے ان کے مہمانوں کو۔ مطلب یہ ہے کہ جب لوط (عليه السلام) کی قوم کو معلوم ہوا کہ چند خوبر ونوجوان لوط (عليه السلام) کے ہاں آئے ہیں (جو دراصل فرشتے تھے اور ان کو عذاب دینے کے لیے ہی آئے تھے) تو انہوں نے حضرت لوط (عليه السلام) سے مطالبہ کیا کہ ان مہمانوں کو ہمارے سپرد کردیں تاکہ ہم اپنے بگڑے ہوئے ذوق کی ان سے تسکین کریں۔\n(2) کہتے ہیں کہ یہ فرشتے جبرائیل میکائل اور اسرافیل (عليه السلام) تھے۔ جب انہوں نے بدفعلی کی نیت سے فرشتوں (مہمانوں) کو لینے پر زیادہ اصرار کیاتو جبرائیل (عليه السلام) نے اپنے پر کا ایک حصہ انہیں مارا، جس سے ان کی آنکھوں کے ڈھیلےہی باہر نکل آئے، بعض کہتے ہیں ، صرف آنکھوں کی بصارت زائل ہوئی، بہرحال عذاب عام سے پہلے یہ عذاب خاص ان لوگوں کوپہنچا جو حضرت لوط (عليه السلام) کے پاس بدنیتی سے آئے تھے۔ اور آنکھوں سے یا بینائی سے محروم ہو کر گھر پہنچے۔ اور پھر صبح اس عذاب عام میں تباہ ہو گئے جو پوری قوم کے لیے آیا (تفسیر ابن کثیر)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walaqad rāwadūhu ʿan ḍayfihi faṭamasnā aʿyunahum fadhūqū ʿadhābī wanudhuri ","translations":["And certainly","they demanded from him","they demanded from him","his guests","so We blinded","their eyes","So taste","My punishment","and My warnings","(37)"],"transliterationArr":["walaqad","rāwadūhu","ʿan","ḍayfihi","faṭamasnā","aʿyunahum","fadhūqū","ʿadhābī","wanudhuri",null],"verseTiming":[[1,0,820],[2,820,2350],[3,2350,3580],[4,3580,4740],[5,4740,7610],[6,7610,8920],[7,8920,10100],[8,10100,11260],[9,11260,12605]]}}