{"name":"55:20","price":"ان دونوں میں ایک آڑ ہے کہ اس سے بڑھ نہیں سکتے.(1)","arabic":"بَيۡنَهُمَا بَرۡزَخٞ لَّا يَبۡغِيَانِ","category":["55 (Ar-Rahman)","Ar-Rahman","Surah Ar-Rahman","Chapter Ar-Rahman","Rahman","Surah Rahman","Chapter Rahman","Ar Rahman","Surah Ar Rahman","Chapter Ar Rahman","Surah 55","Chapter 55","The Beneficent","الرحمن"],"ayahNumber":4921,"juzNumber":27,"footnotes":"(1) مَرَجَ بمعنی أَرْسَل َجاری کر دیئے۔ اس کی تفصیل سورۃ الفرقان،آیت 53 میں گزر چکی ہے۔ جس کا خلاصہ یہ ہے کہ دو دریاوں سے مراد بعض کے نزدیک ان کے الگ الگ وجود ہیں۔ جیسےمیٹھے پانی کے دریا ہیں، جن سے کھیتیاں سیراب ہوتی ہیں اور انسان ان کا پانی اپنی دیگر ضروریات میں بھی استعمال کرتا ہے۔ دوسری قسم سمندروں کاﭘانی ہے۔ جو کھارا ہے،جس کے کچھ اور فوائد ہیں۔ یہ دونوں آپس میں نہیں ملتے۔ بعض نے اس کا مفہوم یہ بیان کیا ہے کہ کھارے سمندروں میں ہی میٹھے پانی کی لہریں چلتی ہیں اوریہ دونوں لہریں آپس میں نہیں ملتیں، بلکہ ایک دوسرے سے جدا اور ممتاز ہی رہتی ہیں۔ اس کی ایک صورت تویہ ہے کہ اللہ تعالیٰ نے کھارے سمندروں میں ہی کئی مقامات پر میٹھے پانی کی لہریں بھی جاری کی ہوئی ہیں اور وہ کھارے پانی سے الگ ہی رہتی ہیں۔ دوسری صورت یہ بھی ہے کہ اوپرکھارا پانی ہو اور اس کی تہ میں نیچے چشمہ آب شیریں۔ جیسا کہ واقعتاً بعض مقامات پر ایسا ہے۔ تیسری صورت یہ ہے کہ جن مقامات پر میٹھے پانی کے دریا کا پانی سمندر میں جا گرتا ہے، وہاں کئی لوگوں کا مشاہدہ ہے کہ دونوں پانی میلوں دور تک اس طرح ساتھ ساتھ چلتے ہیں کہ ایک طرف میٹھا دریائی پانی اور دوسری طرف وسیع و عریض سمندر کا کھارا پانی، ان کے درمیان اگرچہ کوئی آڑ نہیں۔ لیکن یہ باہم نہیں ملتے۔ دونوں کے درمیان یہ وہ برزخ (آڑ) ہے جو اللہ نے رکھ دی ہے، دونوں اس سے تجاوز نہیں کرتے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"baynahumā barzakhun lā yabghiyāni ","translations":["Between both of them","(is) a barrier","not","they transgress","(20)"],"transliterationArr":["baynahumā","barzakhun","lā","yabghiyāni",null],"verseTiming":[[1,0,1320],[2,1320,2480],[3,2480,2840],[4,2840,6465]]}}