{"name":"55:22","price":"ان دونوں میں سے موتی اور مونگے برآمد ہوتے ہیں.(1)","arabic":"يَخۡرُجُ مِنۡهُمَا ٱللُّؤۡلُؤُ وَٱلۡمَرۡجَانُ","category":["55 (Ar-Rahman)","Ar-Rahman","Surah Ar-Rahman","Chapter Ar-Rahman","Rahman","Surah Rahman","Chapter Rahman","Ar Rahman","Surah Ar Rahman","Chapter Ar Rahman","Surah 55","Chapter 55","The Beneficent","الرحمن"],"ayahNumber":4923,"juzNumber":27,"footnotes":"(1) مَرْجَانٌ سے چھوٹے موتی یا پھر مونگے مراد ہیں۔ کہتے ہیں کہ آسمان سے بارش ہوتی ہے تو سیپیاں اپنے مونہہ کھول دیتی ہیں، جو قطرہ ان کے اندر پڑ جاتا ہے، وہ موتی بن جاتا ہےمشہور یہی ہے کہ موتی وغیرہ میٹھے پانی کے دریاؤں سے نہیں، بلکہ صرف آب شور یعنی سمندروں سے ہی نکلتے ہیں۔ لیکن قرآن نے تثنیہ کی ضمیر استعمال کی ہے جس سے معلوم ہوتا ہے کہ دونوں سے ہی موتی نکلتے ہیں۔ چونکہ موتی کثرت کے ساتھ سمندروں سےہی نکلتے ہیں، اس لیےاس کی شہرت ہو گئی ہے۔ تاہم شیریں دریاؤں سے اس کی نفی ممکن نہیں بلکہ موجودہ دور کے تجربات سے ثابت ہوا ہے کہ میٹھے دریا میں بھی موتی ہوتے ہیں۔ البتہ ان کے مسلسل جاری رہنے کی وجہ سے ان سے موتی نکالنا مشکل امر ہے۔ بعض نے کہا ہے کہ مراد مجموعہ ہے، ان میں سے کسی ایک سے بھی موتی نکل جائیں توان پر تثنیہ کا اطلاق صحیح ہے۔ بعض نے کہا کہ شیریں دریا بھی عام طور پر سمندر میں ہی گرتے ہیں اور وہیں سے موتی نکالے جاتے ہیں، اس لیے گو منبع دریائے شور ہی ہوئے، لیکن دوسرے دریاؤں کا حصہ بھی اس میں شامل ہے لیکن موجودہ دورکے تجربات کے بعد ان تاویلات اور تکلﻔات کی ضرورت نہیں۔ وَاللهُ أَعْلَمُ۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yakhruju min'humā al-lu'lu-u wal-marjānu ","translations":["Come forth","from both of them","the pearl","and the coral","(22)"],"transliterationArr":["yakhruju","min'humā","al-lu'lu-u","wal-marjānu",null],"verseTiming":[[1,0,930],[2,930,1730],[3,1730,2920],[4,2920,7075]]}}