{"name":"55:77","price":"پس (اے جنو اور انسانو!) تم اپنے رب کی کس کس نعمت کو جھٹلاؤ گے؟(1)","arabic":"فَبِأَيِّ ءَالَآءِ رَبِّكُمَا تُكَذِّبَانِ","category":["55 (Ar-Rahman)","Ar-Rahman","Surah Ar-Rahman","Chapter Ar-Rahman","Rahman","Surah Rahman","Chapter Rahman","Ar Rahman","Surah Ar Rahman","Chapter Ar Rahman","Surah 55","Chapter 55","The Beneficent","الرحمن"],"ayahNumber":4978,"juzNumber":27,"footnotes":"(1) یہ آیت اس سورت میں 31 مرتبہ آئی ہے۔ اللہ تعالیٰ نے اس سورت میں اپنی اقسام وانواع کی نعمتوں کا ذکر فرمایا ہے اور ہر نعمت یا چند نعمتوں کے ذکر کے بعد یہ استفسار فرمایا ہے، حتیٰ کہ میدان محشر کی ہولناکیوں اور جہنم کے عذاب کے بعد بھی یہ استفسار فرمایاہے، جس کا مطلب ہے کہ امور آخرت کی یاد دہانی بھی نعمت عظیمہ ہے تاکہ بچنے والے اس سے بچنے کی سعی کر لیں۔ دوسری بات یہ معلوم ہوئی، کہ جن بھی انسانوں کی طرح اللہ کی ایک مخلوق ہے بلکہ انسانوں کے بعدیہ دوسری مخلوق ہے جسے عقل وشعور سے نوازا گیا ہے اور اس کے بدلے میں ان سے صرف اس امر کا تقاضا کیا گیا ہے کہ وہ صرف ایک اللہ کی عبادت کریں۔ اس کے ساتھ کسی کو شریک نہ ٹھہرائیں۔ مخلوقات میں یہی دو ہیں جو شرعی احکام وفرائض کے مکلف ہیں، اسی لیے انہیں ارادہ واختیار کی آزادی دی گئی ہے۔ تاکہ ان کی آزمائش ہو سکے، تیسرے نعمتوں کے بیان سے یہ بھی ثابت ہوا کہ اللہ کی نعمتوں سے فائدہ اٹھانا جائز ومستحب ہے۔ یہ زہد وتقویٰ کے خلاف ہے اور نہ تعلق مع اللہ میں مانع، جیساکہ بعض اہل تصوف باورکراتے ہیں۔ چوتھے، بار بار یہ سوال کہ تم اللہ کی کون کون سی نعمتوں کی تکذیب کرو گے؟ یہ توبیخ اور تہدید کے طور پر ہے، جس کا مقصد اس اللہ کی نافرمانی سے روکنا ہے، جس نے یہ ساری نعمتیں پیدا اور مہیا فرمائیں۔ اسی لیے نبی ﹲ نے اس کے جواب میں یہ پڑھنا پسند فرمایا ”لا بِشَيْءٍ مِنْ نِعَمِكَ رَبَّنَا نُكَذِّبُ فَلَكَ الْحَمْدُ“ اے ہمارے رب ہم تیری کسی بھی نعمت کی تکذیب نہیں کرتے، پس تمام تعریفیں تیرے ہی لیے ہیں (سنن الترمذي، والصحيحة للألباني) لیکن اندرون صلاۃ اس جواب کاﭘڑھنا مشروع نہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"fabi-ayyi ālāi rabbikumā tukadhibāni ","translations":["So which","(of the) favors","(of) your Lord","will you both deny","(77)"],"transliterationArr":["fabi-ayyi","ālāi","rabbikumā","tukadhibāni",null],"verseTiming":[[1,0,1080],[2,1080,3760],[3,3760,4990],[4,4990,8855]]}}