{"name":"56:14","price":"اور تھوڑے سے پچھلے لوگوں میں سے.(1)","arabic":"وَقَلِيلٞ مِّنَ ٱلۡأٓخِرِينَ","category":["56 (Al-Waqi'ah)","Al-Waqi'ah","Surah Al-Waqi'ah","Chapter Al-Waqi'ah","Waqi'ah","Surah Waqi'ah","Chapter Waqi'ah","Al Waqi'ah","Surah Al Waqi'ah","Chapter Al Waqi'ah","Surah 56","Chapter 56","The Inevitable","الواقعة"],"ayahNumber":4993,"juzNumber":27,"footnotes":"(1) ثُلَّةٌ، اس بڑے گروہ کو کہا جاتا ہے جس کا گننا ناممکن ہو۔ کہا جاتا ہے کہ اولین سےمراد حضرت آدم (عليه السلام) سے لے کر نبی ﹲ تک کی امت کےلوگ ہیں اور آخرین سے امت محمدیہ کے افراد۔ مطلب یہ ہے کہ پچھلی امتوں میں سابقین کا ایک بڑا گروہ ہے، کیونکہ ان کا زمانہ بہت لمبا ہے جس میں ہزاروں انبیا کے سابقین شامل ہیں ان کے مقابلے میں امت محمدیہ کا زمانہ (قیامت تک) تھوڑا ہے، اس لیے ان میں سابقین بھی بہ نسبت گزشتہ امتوں کے تھوڑے ہوں گے۔ اور ایک حدیث میں آتا ہے۔ جس میں نبی ﹲ نے فرمایا ہے کہ مجھے امید ہے کہ تم جنتیوں کا نصف ہو گے (صحیح مسلم، نمبر 200) تو یہ آیت کے مذکورہ مفہوم کےمخالف نہیں۔ کیونکہ امت محمدیہ کہ سابقین اور عام مومنین ملا کر باقی تمام امتوں سے جنت میں جانے والوں کا نصف ہو جائیں گے، اس لیے محض سابقین کی کثرت (سابقہ امتوں میں) سے حدیث میں بیان کردہ تعداد کی نفی نہیں ہو گی۔ مگریہ قول محل نظر ہے اور بعض نے اولین وآخرین سے اسی امت محمدیہ کے افراد مراد لیے ہیں۔ یعنی اس کے پہلے لوگوں میں سابقین کی تعداد زیادہ اور پچھلے لوگوں میں تھوڑی ہوگی۔ امام ابن کثیر نے اسی دوسرے قول کو ترجیح دی ہے۔ اوریہی زیادہ درست معلوم ہوتا ہے یہ جملہ معترضہ ہے، فِي جَنَّاتِ النَّعِيمِ اور عَلَى سُرُرٍ مَوْضُونَةٍ کے درمیان۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waqalīlun mina al-ākhirīna ","translations":["And a few","of","the later (people)","(14)"],"transliterationArr":["waqalīlun","mina","al-ākhirīna",null],"verseTiming":[[1,0,1210],[2,1210,2740],[3,2740,6695]]}}