{"name":"56:73","price":"ہم نے اسے سبب نصیحت(1) اور مسافروں کے فائدے کی چیز بنایا ہے.(2)","arabic":"نَحۡنُ جَعَلۡنَٰهَا تَذۡكِرَةٗ وَمَتَٰعٗا لِّلۡمُقۡوِينَ","category":["56 (Al-Waqi'ah)","Al-Waqi'ah","Surah Al-Waqi'ah","Chapter Al-Waqi'ah","Waqi'ah","Surah Waqi'ah","Chapter Waqi'ah","Al Waqi'ah","Surah Al Waqi'ah","Chapter Al Waqi'ah","Surah 56","Chapter 56","The Inevitable","الواقعة"],"ayahNumber":5052,"juzNumber":27,"footnotes":"(1) کہ اس کے اثرات اور فوائد حیرت انگیز ہیں اور دنیاکی بےشمار چیزوں کی تیاری کے لیے اسے ریڑھ کی ہڈی کی حیثیت حاصل ہے۔ جو ہماری قدرت عظیمہ کی نشانی ہے، پھر ہم نے جس طرح دنیامیں یہ آگ پیدا کی ہے، ہم آخرت میں بھی پیدا کرنے پر قادر ہیں۔ جو اس سے 69 درجہ حرارت میں زیادہ ہو گی۔ (كَمَا فِي الْحَدِيثِ)۔\n(2) مُقْوِينَ، مُقْوٍ کی جمع ہے، قَوَاءٌ یعنی خالی صحرا میں داخل ہونے والا، مراد مسافر ہے۔ یعنی مسافر صحراؤں اور جنگلوں میں ان درختوں سے فائدہ اٹھاتے ہیں، اس سے روشنی، گرمی اور ایندھن حاصل کرتے ہیں۔ بعض نے مُقْوٍ سے وہ فقرا مراد لیےہیں جو بھوک کی وجہ سے خالی پیٹ ہوں۔ بعض نے اس کی معنی مُسْتَمْتِعِينَ (فائدہ اٹھانے والے) کیے ہیں۔ اس میں امیر ، غریب، مقیم اور مسافر سب آ جاتے ہیں اور سب ہی آگ سے فائدہ اٹھاتے ہیں، اسی لیے حدیث میں جن تین چیزوں کو عام رکھنے کا اوران سے کسی کو نہ روکنے کا حکم دیا گیا ہے، ان میں پانی اورگھاس کے علاوہ آگ بھی ہے، (أبو داود، كتاب البيوع، باب في منع الماء ، وسنن ابن ماجه، كتاب الرهون، باب المسلمون شركاء في ثلاث) امام ابن کثیر نے اس مفہوم کو زیادہ پسندکیا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"naḥnu jaʿalnāhā tadhkiratan wamatāʿan lil'muq'wīna ","translations":["We","have made it","a reminder","and a provision","for the wayfarers in the desert","(73)"],"transliterationArr":["naḥnu","jaʿalnāhā","tadhkiratan","wamatāʿan","lil'muq'wīna",null],"verseTiming":[[1,0,680],[2,680,2240],[3,2240,3990],[4,3990,5750],[5,5750,9755]]}}