{"name":"57:10","price":"تمہیں کیا ہو گیا ہے جو تم اللہ کی راه میں خرچ نہیں کرتے؟ دراصل آسمانوں اور زمینوں کی میراث کا مالک (تنہا) اللہ ہی ہے تم میں سے جن لوگوں نے فتح سے پہلے فی سبیل اللہ دیا ہے اور قتال کیا ہے وه (دوسروں کے) برابر نہیں(1) ، بلکہ ان سے بہت بڑے درجے کے ہیں جنہوں نے فتح کے بعد خیراتیں دیں اور جہاد کیے(2)۔ ہاں بھلائی کا وعده تو اللہ تعالیٰ کاان سب سے ہے(3) جو کچھ تم کر رہے ہو اس سے اللہ خبردار ہے.","arabic":"وَمَا لَكُمۡ أَلَّا تُنفِقُواْ فِي سَبِيلِ ٱللَّهِ وَلِلَّهِ مِيرَٰثُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ لَا يَسۡتَوِي مِنكُم مَّنۡ أَنفَقَ مِن قَبۡلِ ٱلۡفَتۡحِ وَقَٰتَلَۚ أُوْلَٰٓئِكَ أَعۡظَمُ دَرَجَةٗ مِّنَ ٱلَّذِينَ أَنفَقُواْ مِنۢ بَعۡدُ وَقَٰتَلُواْۚ وَكُلّٗا وَعَدَ ٱللَّهُ ٱلۡحُسۡنَىٰۚ وَٱللَّهُ بِمَا تَعۡمَلُونَ خَبِيرٞ","category":["57 (Al-Hadid)","Al-Hadid","Surah Al-Hadid","Chapter Al-Hadid","Hadid","Surah Hadid","Chapter Hadid","Al Hadid","Surah Al Hadid","Chapter Al Hadid","Surah 57","Chapter 57","The Iron","الحديد"],"ayahNumber":5085,"juzNumber":27,"footnotes":"(1) فتح سے مراد اکثر مفسرین کے نزدیک فتح مکہ ہے۔ بعض نے صلح حدیبیہ کو فتح مبین کا مصداق سمجھ کر اسے مرادلیا ہے۔ بہرحال صلح حدیبیہ یا فتح مکہ سے قبل مسلمان تعداد اور قوت کےلحاظ سے بھی کم ترتھے اور مسلمانوں کی مالی حالت بھی بہت کمزور تھی۔ ان حالات میں اللہ کی راہ میں خرچ کرنا اورجہاد میں حصہ لینا، دونوں کام نہایت مشکل اور بڑے دل گردے کا کام تھا، جب کہ فتح مکہ کے بعد یہ صورت حال بدل گئی۔ مسلمان قوت وتعداد میں بڑھتے چلے گئے اوران کی مالی حالت بھی پہلے سے کہیں زیادہ بہتر ہو گئی۔ اس میں اللہ تعالی نے دونوں ادوار کے مسلمانوں کی بابت فرمایا کہ یہ اجر میں برابرنہیں ہو سکتے۔\n(2) کیونکہ پہلوں کا انفاق اورجہاد، دونوں کام نہایت کٹھن حالات میں ہوئے۔ اس سے معلوم ہوا کہ اہل فضل وعزم کو دیگر لوگوں کے مقابلے میں مقدم رکھنا چاہیے۔ اسی لیے اہل سنت کےنزدیک شرف وفضل میں حضرت ابوبکر صدیق (رضي الله عنه) سب سے مقدم ہیں، کیونکہ مومن اول بھی وہی ہیں اور منفق اول اور مجاہد اول بھی وہی۔ اس لیے رسول اللہ ﹲ نے حضرت صدیق اکبر (رضي الله عنه) کواپنی زندگی اورموجودگی میں نماز کے لیے آگے کیا، اور اسی بنیاد پر مومنوں (صحابہ کرام) نے انہیں استحقاق خلافت میں مقدم رکھا رَضِيَ اللهُ عَنْهُمْ وَرَضُوا عَنْهُ۔\n(3) اس میں وضاحت فرما دی کہ صحابہ کرام (رضي الله عنهم) کے درمیان شرف وفضل میں تفاوت تو ضرور ہے لیکن تفاوت درجات کا مطلب یہ نہیں کہ بعد میں مسلمان ہونے والے صحابہ کرام (رضي الله عنهم) ایمان واخلاق کے اعتبار سے بالکل ہی گئے گزرے تھے، جیساکہ بعض حضرات، حضرت معاویہ (رضي الله عنه) ،ان کے والد حضرت ابوسفیان (رضي الله عنه) اور دیگر بعض ایسے ہی جلیل القدر صحابہ کے بارے میں ہرزہ سرائی یا انہیں طلقاء کہہ کر ان کی تنقیص واہانت کرتے ہیں۔ نبی صلی اللہ علیہ وسلم نے تمام صحابہ کرام (رضي الله عنهم) کے بارے میں فرمایا ہے کہ لا تَسُبُّوا أَصْحَابِي میرے صحابہ پر سب وشتم نہ کرو، قسم ہے اس ذات کی جس کے ہاتھ میں میری جان ہے کہ اگر تم میں سے کوئی شخص احد پہاڑ جتنا سونا بھی اللہ کی راہ میں خرچ کردے تو وہ میرے صحابی کے خرچ کیےہوئے ایک مد بلکہ نصف مد کے بھی برابر نہیں۔ (صحيح بخاري، وصحيح مسلم ، كتاب فضائل الصحابة)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wamā lakum allā tunfiqū fī sabīli al-lahi walillahi mīrāthu al-samāwāti wal-arḍi lā yastawī minkum man anfaqa min qabli al-fatḥi waqātala ulāika aʿẓamu darajatan mina alladhīna anfaqū min baʿdu waqātalū wakullan waʿada al-lahu al-ḥus'nā wal-lahu bimā taʿmalūna khabīrun ","translations":["And what","(is) for you","that not","you spend","in","(the) way","(of) Allah","while for Allah","(is the) heritage","(of) the heavens","and the earth","Not","are equal","among you","(those) who","spent","before","before","the victory","and fought","Those","(are) greater","(in) degree","than","those who","spent","afterwards","afterwards","and fought","But to all","Allah has promised","Allah has promised","the best","And Allah","of what","you do","(is) All-Aware","(10)"],"transliterationArr":["wamā","lakum","allā","tunfiqū","fī","sabīli","al-lahi","walillahi","mīrāthu","al-samāwāti","wal-arḍi","lā","yastawī","minkum","man","anfaqa","min","qabli","al-fatḥi","waqātala","ulāika","aʿẓamu","darajatan","mina","alladhīna","anfaqū","min","baʿdu","waqātalū","wakullan","waʿada","al-lahu","al-ḥus'nā","wal-lahu","bimā","taʿmalūna","khabīrun",null],"verseTiming":[[1,0,750],[2,750,1380],[3,1380,2170],[4,2170,3890],[5,3890,4210],[6,4210,5500],[7,5500,6130],[8,6130,7490],[9,7490,8470],[10,8470,10120],[11,10120,11590],[12,11590,12050],[13,12050,13110],[14,13110,14850],[15,14850,15970],[16,15970,17810],[17,17810,18650],[18,18650,19320],[19,19320,20140],[20,20140,21280],[21,21280,24420],[22,24420,25180],[23,25180,26150],[24,26150,27200],[25,27200,28330],[26,28330,30040],[27,30040,31120],[28,31120,31840],[29,31840,33370],[30,33370,35450],[31,35450,36070],[32,36070,36940],[33,36940,38230],[34,38230,39670],[35,39670,40260],[36,40260,41590],[37,41590,44315]]}}