{"name":"57:20","price":"خوب جان رکھو کہ دنیا کی زندگی صرف کھیل تماشا زینت اور آپس میں فخر (و غرور) اور مال واوﻻد میں ایک کا دوسرے سے اپنے آپ کو زیاده بتلانا ہے، جیسے بارش اور اس کی پیداوار کسانوں(1) کو اچھی معلوم ہوتی ہے پھر جب وه خشک ہو جاتی ہے تو زرد رنگ میں اس کو تم دیکھتے ہو پھر وه بالکل چورا چورا ہو جاتی ہے(2) اور آخرت میں سخت عذاب(3) اور اللہ کی مغفرت اور رضامندی ہے(4) اور دنیا کی زندگی بجز دھوکے کے سامان کے اور کچھ بھی تو نہیں.(5)","arabic":"ٱعۡلَمُوٓاْ أَنَّمَا ٱلۡحَيَوٰةُ ٱلدُّنۡيَا لَعِبٞ وَلَهۡوٞ وَزِينَةٞ وَتَفَاخُرُۢ بَيۡنَكُمۡ وَتَكَاثُرٞ فِي ٱلۡأَمۡوَٰلِ وَٱلۡأَوۡلَٰدِۖ كَمَثَلِ غَيۡثٍ أَعۡجَبَ ٱلۡكُفَّارَ نَبَاتُهُۥ ثُمَّ يَهِيجُ فَتَرَىٰهُ مُصۡفَرّٗا ثُمَّ يَكُونُ حُطَٰمٗاۖ وَفِي ٱلۡأٓخِرَةِ عَذَابٞ شَدِيدٞ وَمَغۡفِرَةٞ مِّنَ ٱللَّهِ وَرِضۡوَٰنٞۚ وَمَا ٱلۡحَيَوٰةُ ٱلدُّنۡيَآ إِلَّا مَتَٰعُ ٱلۡغُرُورِ","category":["57 (Al-Hadid)","Al-Hadid","Surah Al-Hadid","Chapter Al-Hadid","Hadid","Surah Hadid","Chapter Hadid","Al Hadid","Surah Al Hadid","Chapter Al Hadid","Surah 57","Chapter 57","The Iron","الحديد"],"ayahNumber":5095,"juzNumber":27,"footnotes":"(1) كُفَّارٌ، کسانوں کو کہا گیا ہے، اس لیے کہ اس کے لغوی معنی ہیں چھپانے والے۔ کافروں کے دلوں میں اللہ کا اور آخرت کا انکار چھپا ہوتا ہے، اس لیے انہیں کافر کہا جاتا ہے۔ اور کاشﺖ کاروں کے لیے یہ لفظ بولا گیا ہے کہ وہ بھی زمین میں بیج بوتے یعنی انہیں چھپا دیتے ہیں۔\n(2) یہاں دنیا کی زندگی کو سرعت زوال میں کھیتی سے تشبیہ دی گئی ہے کہ جس طرح کھیتی جب شاداب ہوتی ہے تو بڑی بھلی لگتی ہے، کاشﺖ کار اسے دیکھ کر بڑے خوش ہوتےہیں۔ لیکن وہ بہت ہی جلد خشک اور زرد رو ہوکر چورا چورا ہو جاتی ہے۔ اسی طرح دنیا کی زیب وزینت ، مال اور اولاد دیگر چیزیں انسان کاﺩل لبھاتی ہیں۔ لیکن یہ زندگی چند روزہ ہی ہے۔ اس کو بھی ثبات و قرار نہیں۔\n(3) یعنی اہل کفر وعصیان کےلیے، جو دنیا کےکھیل کود میں ہی مصروف رہے اور اسی کو انہوں نے حاصل زندگی سمجھا۔\n(4) یعنی اہل ایمان وطاعت کے لیے، جنہوں نے دنیاکو ہی سب کچھ نہیں سمجھا، بلکہ اسے عارضی، فانی اور دارالامتحان سمجھتے ہوئے اللہ کی ہدایات کے مطابق اس میں زندگی گزاری۔\n(5) لیکن اس کے لیے جواس کےدھوکے میں مبتلا رہا اور آخرت کے لیے کچھ نہیں کیا۔ لیکن جس نے اس حیات دنیا کو طلب آخرت کے لیے استعمال کیا تو اس لیے یہی دنیا، اس سے بہتر زندگی حاصل کرنے کا ذریعہ ثابت ہو گی۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"iʿ'lamū annamā al-ḥayatu al-dun'yā laʿibun walahwun wazīnatun watafākhurun baynakum watakāthurun fī al-amwāli wal-awlādi kamathali ghaythin aʿjaba al-kufāra nabātuhu thumma yahīju fatarāhu muṣ'farran thumma yakūnu ḥuṭāman wafī al-ākhirati ʿadhābun shadīdun wamaghfiratun mina al-lahi wariḍ'wānun wamā al-ḥayatu al-dun'yā illā matāʿu al-ghurūri ","translations":["Know","that","the life","(of) the world","(is) play","and amusement","and adornment","and boasting","among you","and competition in increase","of","the wealth","and the children","like (the) example","(of) a rain","pleases","the tillers","its growth","then","it dries","and you see it","turning yellow","then","becomes","debris","And in","the Hereafter","(is) a punishment","severe","and forgiveness","from","Allah","and Pleasure","But not","(is) the life","(of) the world","except","(the) enjoyment","(of) delusion","(20)"],"transliterationArr":["iʿ'lamū","annamā","al-ḥayatu","al-dun'yā","laʿibun","walahwun","wazīnatun","watafākhurun","baynakum","watakāthurun","fī","al-amwāli","wal-awlādi","kamathali","ghaythin","aʿjaba","al-kufāra","nabātuhu","thumma","yahīju","fatarāhu","muṣ'farran","thumma","yakūnu","ḥuṭāman","wafī","al-ākhirati","ʿadhābun","shadīdun","wamaghfiratun","mina","al-lahi","wariḍ'wānun","wamā","al-ḥayatu","al-dun'yā","illā","matāʿu","al-ghurūri",null],"verseTiming":[[1,0,2350],[2,2350,3820],[3,3820,5010],[4,5010,6110],[5,6110,7550],[6,7550,9190],[7,9190,11130],[8,11130,13240],[9,13240,14380],[10,14380,16470],[11,16470,16730],[12,16730,18010],[13,18010,21540],[14,21540,22320],[15,22320,23260],[16,23260,24070],[17,24070,25440],[18,25440,26670],[19,26670,27850],[20,27850,28850],[21,28850,30030],[22,30030,31740],[23,31740,33010],[24,33010,34020],[25,34020,35270],[26,35270,36050],[27,36050,37360],[28,37360,38290],[29,38290,39410],[30,39410,41200],[31,41200,42480],[32,42480,43690],[33,43690,44660],[34,44660,47920],[35,47920,48480],[36,48480,49590],[37,49590,52220],[38,52220,53250],[39,53250,54120],[40,54120,56955]]}}