{"name":"57:25","price":"یقیناً ہم نے اپنے پیغمبروں کو کھلی دلیلیں دے کر بھیجا اور ان کے ساتھ کتاب اور میزان (ترازو) نازل فرمایا(1) تاکہ لوگ عدل پر قائم رہیں۔ اور ہم نے لوہے کو اتارا(2) جس میں سخت ہیبت وقوت ہے(3) اور لوگوں کے لیے اور بھی (بہت سے) فائدے ہیں(4) اور اس لیے بھی کہ اللہ جان لے کہ اس کی اور اس کے رسولوں کی مدد بےدیکھے کون کرتا ہے(5)، بیشک اللہ قوت واﻻ اور زبردست ہے.(6)","arabic":"لَقَدۡ أَرۡسَلۡنَا رُسُلَنَا بِٱلۡبَيِّنَٰتِ وَأَنزَلۡنَا مَعَهُمُ ٱلۡكِتَٰبَ وَٱلۡمِيزَانَ لِيَقُومَ ٱلنَّاسُ بِٱلۡقِسۡطِۖ وَأَنزَلۡنَا ٱلۡحَدِيدَ فِيهِ بَأۡسٞ شَدِيدٞ وَمَنَٰفِعُ لِلنَّاسِ وَلِيَعۡلَمَ ٱللَّهُ مَن يَنصُرُهُۥ وَرُسُلَهُۥ بِٱلۡغَيۡبِۚ إِنَّ ٱللَّهَ قَوِيٌّ عَزِيزٞ","category":["57 (Al-Hadid)","Al-Hadid","Surah Al-Hadid","Chapter Al-Hadid","Hadid","Surah Hadid","Chapter Hadid","Al Hadid","Surah Al Hadid","Chapter Al Hadid","Surah 57","Chapter 57","The Iron","الحديد"],"ayahNumber":5100,"juzNumber":27,"footnotes":"(1) میزان سے مرد انصاف ہے اور مطلب ہے کہ ہم نے لوگوں کو انصاف کرنےکا حکم دیا ہے۔ بعض نے اس کاﺗرجمہ ترازو کیا ہے،ترازو کے اتارنے کا مطلب ہے، ہم نے ترازو کی طرف لوگوں کی رہنمائی کی کہ اس کے ذریعے سے لوگوں کو تول کر پورا پورا حق دو۔\n(2) یہاں بھی اتارا، پیدا کرنے اور اس کی صنعت سکھانے کے معنی میں ہے۔ لوہے سے بےشمار چیزیں بنتی ہیں، یہ سب اللہ کے اس الہام اور ارشاد کا نتیجہ ہے جو اس نے انسان کوکیا ہے۔\n(3) یعنی لوہے سے جنگی ہتھیار بنتے ہیں۔ جیسے تلوار، نیزہ، بندوق اور اب ایٹم، توپین،جنگی جہاز، آبدوزیں، گنیں، راکٹ اورٹینک وغیرہ بیشمار چیزیں۔ جن سے دشمن پروار بھی کیا جاتا ہے اور اپنا دفاع بھی۔\n(4) یعنی جنگی ہتھیاروں کے علاوہ لوہے سے اوربھی بہت سی چیزیں بنتی ہیں، جو گھروں میں اور مختلف صنعتوں میں کام میں آتی ہیں، جیسے چھریاں، چاقو، قینچی، ہتھوڑا، سوئی، زراعت، نجارت (بڑھئی) اورعمارت وغیرہ کا سامان اورچھوٹی بڑی بےشمار مشینیں اورسازوسامان۔\n(5) یہ ليِقَوُمَ پر عطف ہے۔ یعنی رسولوں کواس لیے بھی بھیجا ہے تاکہ وہ جان لے کہ کون اس کے رسولوں پر اللہ کو دیکھے بغیر، ایمان لاتا اور ان کی مدد کرتا ہے۔\n(6) اس کو اس بات کی حاجت نہیں ہے کہ لوگ اس کے دین کی اور اس کے رسولوں کی مدد کریں، بلکہ وہ چاہے تو اس کے بغیر ہی ان کو غالب فرمادے۔ لوگوں کو تو ان کی مدد کرنے کا حکم ان کی اپنی ہی بھلائی کے لیے دیا گیا ہے، تاکہ اس طرح وہ اپنے اللہ کو راضی کرکے اس کی مغفرت ورحمت کے مستحق بن جائیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"laqad arsalnā rusulanā bil-bayināti wa-anzalnā maʿahumu al-kitāba wal-mīzāna liyaqūma al-nāsu bil-qis'ṭi wa-anzalnā al-ḥadīda fīhi basun shadīdun wamanāfiʿu lilnnāsi waliyaʿlama al-lahu man yanṣuruhu warusulahu bil-ghaybi inna al-laha qawiyyun ʿazīzun ","translations":["Certainly","We sent","Our Messengers","with clear proofs","and We sent down","with them","the Scripture","and the Balance","that may establish","the people","justice","And We sent down","[the] iron","wherein","(is) power","mighty","and benefits","for the people","and so that Allah may make evident","and so that Allah may make evident","(he) who","helps Him","and His Messengers","unseen","Indeed","Allah","(is) All-Strong","All-Mighty","(25)"],"transliterationArr":["laqad","arsalnā","rusulanā","bil-bayināti","wa-anzalnā","maʿahumu","al-kitāba","wal-mīzāna","liyaqūma","al-nāsu","bil-qis'ṭi","wa-anzalnā","al-ḥadīda","fīhi","basun","shadīdun","wamanāfiʿu","lilnnāsi","waliyaʿlama","al-lahu","man","yanṣuruhu","warusulahu","bil-ghaybi","inna","al-laha","qawiyyun","ʿazīzun",null],"verseTiming":[[1,0,700],[2,700,2010],[3,2010,3170],[4,3170,5040],[5,5040,7300],[6,7300,8260],[7,8260,9420],[8,9420,10880],[9,10880,12040],[10,12040,13720],[11,13720,14760],[12,14760,17400],[13,17400,18400],[14,18400,19270],[15,19270,20620],[16,20620,21700],[17,21700,23910],[18,23910,28129],[19,28129,28929],[20,28929,30489],[21,30489,31469],[22,31469,33609],[23,33609,35499],[24,35499,36779],[25,36779,37819],[26,37819,37969],[27,37969,39019],[28,39019,40899],[29,40899,42139],[30,42139,43039],[31,43039,46378],[32,46378,47388],[33,47388,48218],[34,48218,51563]]}}