{"name":"57:3","price":"وہی پہلے ہے اور وہی پیچھے، وہی ﻇاہر ہے اور وہی مخفی(1) ، اور وه ہر چیز کو بخوبی جاننے واﻻ ہے.","arabic":"هُوَ ٱلۡأَوَّلُ وَٱلۡأٓخِرُ وَٱلظَّٰهِرُ وَٱلۡبَاطِنُۖ وَهُوَ بِكُلِّ شَيۡءٍ عَلِيمٌ","category":["57 (Al-Hadid)","Al-Hadid","Surah Al-Hadid","Chapter Al-Hadid","Hadid","Surah Hadid","Chapter Hadid","Al Hadid","Surah Al Hadid","Chapter Al Hadid","Surah 57","Chapter 57","The Iron","الحديد"],"ayahNumber":5078,"juzNumber":27,"footnotes":"(1) وہی اول ہے یعنی اس سے پہلے کچھ نہ تھا، وہی آخر ہے، اس کے بعد کوئی چیز نہیں ہوگی، وہی ظاہر ہے یعنی وہ سب پر غالب ہے، اس پر کوئی غالب نہیں۔ وہی باطن ہے، یعنی باطن کی ساری باتوں کو صرف وہی جانتا ہے یا لوگوں کی نظروں اور عقلوں سےمخفی ہے۔ (فتح القدیر) نبی ﹲ نے اپنی صاحبزادی فاطمہ (رضی الله عنها) کو یہ دعا پڑھنے کی تاکید فرمائی تھی۔ «اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ وَرَبَّ الْعَرْشِ الْعَظِيمِ ، رَبَّنَا وَرَبَّ كُلِّ شَيْءٍ ، مُنْزِلَ التَّوْرَاةِ وَالإِنْجِيلِ وَالْفُرْقَانِ، فَالِقَ الْحَبِّ وَالنَّوَى ، أَعُوذُ بِكَ مِنْ شَرِّ كُلِّ شَيْءٍ أَنْتَ آخِذٌ بِنَاصِيَتِه، اللَّهُمَّ أَنْتَ الأوَّلُ فَلَيْسَ قَبْلَكَ شَيْءٌ ، وَأَنْتَ الآخِرُ فَلَيْسَ بَعْدَكَ شَيْءٌ ، وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيْءٌ ، وَأَنْتَ البَاطِنُ فَلَيْسَ دُونَكَ شَيْءٌ، اقْضِ عَنَّا الدَّيْنَ وَاغْنِنَا مِنَ الْفَقْرِ» (صحيح مسلم، كتاب الذكر والدعاء باب ما يقول عند النوم وأخذ المضجع) اس دعا میں، جو ادائیگی قرض کے لیے مسنون ہے، اول و آخر اور ظاہر وباطن کی تفسیر بیان فرما دی گئی ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"huwa al-awalu wal-ākhiru wal-ẓāhiru wal-bāṭinu wahuwa bikulli shayin ʿalīmun ","translations":["He","(is) the First","and the Last","and the Apparent","and the Unapparent","and He","(is) of every","thing","All-Knower","(3)"],"transliterationArr":["huwa","al-awalu","wal-ākhiru","wal-ẓāhiru","wal-bāṭinu","wahuwa","bikulli","shayin","ʿalīmun",null],"verseTiming":[[1,0,320],[2,320,1400],[3,1400,2690],[4,2690,3890],[5,3890,5130],[6,5130,5590],[7,5590,6430],[8,6430,7240],[9,7240,10185]]}}