{"name":"57:4","price":"وہی ہے جس نے آسمانوں اور زمین کو چھ دن میں پیدا کیا پھر عرش پر مستوی(1) ہو گیا۔ وه (خوب) جانتا ہےاس چیز کو جو زمین میں جائے(2) اور جو اس سے نکلے(3) اور جو آسمان سے نیچے آئے(4) اور جو کچھ چڑھ کر اس میں جائے(5)، اور جہاں کہیں تم ہو وه تمہارے ساتھ ہے(6) اور جو تم کر رہے ہو اللہ دیکھ رہا ہے.","arabic":"هُوَ ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ فِي سِتَّةِ أَيَّامٖ ثُمَّ ٱسۡتَوَىٰ عَلَى ٱلۡعَرۡشِۖ يَعۡلَمُ مَا يَلِجُ فِي ٱلۡأَرۡضِ وَمَا يَخۡرُجُ مِنۡهَا وَمَا يَنزِلُ مِنَ ٱلسَّمَآءِ وَمَا يَعۡرُجُ فِيهَاۖ وَهُوَ مَعَكُمۡ أَيۡنَ مَا كُنتُمۡۚ وَٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرٞ","category":["57 (Al-Hadid)","Al-Hadid","Surah Al-Hadid","Chapter Al-Hadid","Hadid","Surah Hadid","Chapter Hadid","Al Hadid","Surah Al Hadid","Chapter Al Hadid","Surah 57","Chapter 57","The Iron","الحديد"],"ayahNumber":5079,"juzNumber":27,"footnotes":"(1) اسی مفہوم کی آیات سورۂ اعراف 54، سورۂ یونس ،3، اور الم السجدۃ،4 وغیرھا من الآیات میں گزر چکی ہیں۔ ان کےحواشی ملاحظہ فرمالیے جائیں۔\n(2) یعنی زمین میں بارش کےجو قطرے اور غلہ جات ومیوہ جات کے جو بیج داخل ہوتے ہیں، ان کی کمیت وکیفیت کو وہ جانتا ہے۔\n(3) جو درخت، چاہے وہ پھلوں کےہوں یا غلوں کے یا زینت وآرائش اور خوشبو والے پھولوں کے بوٹے ہوں، یہ جتنے بھی اور جیسے بھی باہر نکلتے ہیں، سب اللہ کے علم میں ہیں۔ جیسے دوسرے مقام پر فرمایا «وَعِنْدَهُ مَفَاتِحُ الْغَيْبِ لا يَعْلَمُهَا إِلا هُوَ وَيَعْلَمُ مَا فِي الْبَرِّ وَالْبَحْرِ وَمَا تَسْقُطُ مِنْ وَرَقَةٍ إِلا يَعْلَمُهَا وَلا حَبَّةٍ فِي ظُلُمَاتِ الأَرْضِ وَلا رَطْبٍ وَلا يَابِسٍ إِلا فِي كِتَابٍ مُبِينٍ» (سورة الأنعام :59) اور اللہ تعالیٰ ہی کےپاس ہیں تمام مخفی اشیا کے خزانے، ان کو کوئی نہیں جانتا بجز اللہ کے، اور وہ تمام چیزوں کو جانتاہے جو کچھ خشکی میں اور جو کچھ دریاؤں میں ہیں۔ کوئی پتا نہیں گرتا مگر وہ اس کو بھی جانتاہے، اور کوئی دانہ کوئی زمین کے تاریک حصوں میں نہیں پڑتا اورنہ کوئی تر اور نہ کوئی خشک چیز گرتی ہے، مگر یہ سب کتاب مبین میں ہیں۔\n(4) بارش، اولے، برف، تقدیر اور وہ احکام، جو فرشتے لے کر اترتے ہیں۔\n(5) فرشتے انسانوں کے جو عمل لے کر چڑھتے ہیں جس طرح حدیث میں آتا ہے کہ اللہ کی طرف رات کے عمل دن سے پہلے اور دن کے عمل رات سے پہلے چڑھتے ہیں۔ (صحيح مسلم، كتاب الإيمان ، باب إن الله لا ينام)۔\n(6) یعنی تم خشکی میں ہو یا تری میں،رات ہو یا دن، گھروں میں ہو یا صحراؤں میں، ہرجگہ ہروقت وہ اپنے علم وبصر کے لحاظ سے تمہارے ساتھ ہے یعنی تمہارے ایک ایک عمل کو دیکھتا ہے، تمہاری ایک ایک بات کو جانتا اور سنتا ہے۔ یہی مضمون سورۂ ھود:3۔ سورۂ رعد: 10 اور دیگر آیات میں بیان کیا گیا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"huwa alladhī khalaqa al-samāwāti wal-arḍa fī sittati ayyāmin thumma is'tawā ʿalā al-ʿarshi yaʿlamu mā yaliju fī al-arḍi wamā yakhruju min'hā wamā yanzilu mina al-samāi wamā yaʿruju fīhā wahuwa maʿakum ayna mā kuntum wal-lahu bimā taʿmalūna baṣīrun ","translations":["He","(is) the One Who","created","the heavens","and the earth","in","six","periods","then","He rose","over","the Throne","He knows","what","penetrates","in(to)","the earth","and what","comes forth","from it","and what","descends","from","the heaven","and what","ascends","therein","and He","(is) with you","wherever","wherever","you are","And Allah","of what","you do","(is) All-seer","(4)"],"transliterationArr":["huwa","alladhī","khalaqa","al-samāwāti","wal-arḍa","fī","sittati","ayyāmin","thumma","is'tawā","ʿalā","al-ʿarshi","yaʿlamu","mā","yaliju","fī","al-arḍi","wamā","yakhruju","min'hā","wamā","yanzilu","mina","al-samāi","wamā","yaʿruju","fīhā","wahuwa","maʿakum","ayna","mā","kuntum","wal-lahu","bimā","taʿmalūna","baṣīrun",null],"verseTiming":[[1,0,350],[2,350,1130],[3,1130,1740],[4,1740,3230],[5,3230,4110],[6,4110,4430],[7,4430,5340],[8,5340,6400],[9,6400,7260],[10,7260,8610],[11,8610,9530],[12,9530,9920],[13,9920,10760],[14,10760,12030],[15,12030,12380],[16,12380,12990],[17,12990,13280],[18,13280,14040],[19,14040,14600],[20,14600,15450],[21,15450,16200],[22,16200,16880],[23,16880,18190],[24,18190,18550],[25,18550,20850],[26,20850,21490],[27,21490,22280],[28,22280,23230],[29,23230,24280],[30,24280,25180],[31,25180,25730],[32,25730,26160],[33,26160,28560],[34,28560,29560],[35,29560,30110],[36,30110,31380],[37,31380,34095]]}}