{"name":"58:1","price":"یقیناً اللہ تعالیٰ نے اس عورت کی بات سنی جو تجھ سے اپنے شوہر کے بارے میں تکرار کر رہی تھی اور اللہ کے آگے شکایت کر رہی تھی، اللہ تعالیٰ تم دونوں کے سوال وجواب سن رہا تھا(1) ، بیشک اللہ تعالیٰ سننے دیکھنے واﻻ ہے.","arabic":"قَدۡ سَمِعَ ٱللَّهُ قَوۡلَ ٱلَّتِي تُجَٰدِلُكَ فِي زَوۡجِهَا وَتَشۡتَكِيٓ إِلَى ٱللَّهِ وَٱللَّهُ يَسۡمَعُ تَحَاوُرَكُمَآۚ إِنَّ ٱللَّهَ سَمِيعُۢ بَصِيرٌ","category":["58 (Al-Mujadila)","Al-Mujadila","Surah Al-Mujadila","Chapter Al-Mujadila","Mujadila","Surah Mujadila","Chapter Mujadila","Al Mujadila","Surah Al Mujadila","Chapter Al Mujadila","Surah 58","Chapter 58","The Pleading Woman","المجادلة"],"ayahNumber":5105,"juzNumber":28,"footnotes":"(1) یہ اشارہ ہے حضرت خولہ بنت مالک بن ثعلبہ (رضی الله عنها) کے واقعہ کی طرف، جن کے خاوند حضرت اوس بن صامت (رضي الله عنه) نے ان سے ظہار کر لیا تھا، ظہار کا مطلب ہے، بیوی کو یہ کہہ دینا أَنْتِ عَلَيَّ كَظَهْرِ أُمِّي (تو مجھ پر میری ماں کی پیٹھ کی طرح ہے) زمانۂ جاہلیت میں ظہار کو طلاق سمجھا جاتا تھا۔ حضرت خولہ (رضی الله عنها) سخت پریشان ہوئیں اس وقت تک اس کی بابت کوئی حکم نازل نہیں ہوا تھا۔ اس لیے وہ نبی (صلى الله عليه وسلم) کے پاس آئیں تو آپ (صلى الله عليه وسلم) نے بھی کچھ توقف فرمایا اور وہ آپ سے بحث وتکرار کرتی رہیں۔ جس پر یہ آیات نازل ہوئیں ، جن میں مسئلہ ظہار اور اس کا حکم وکفارہ بیان فرما دیا گیا۔ (أبو داود، كتاب الطلاق، باب في الظهار) حضرت عائشہ (رضی الله عنها) فرماتی ہیں کہ اللہ تعالیٰ کس طرح لوگوں کی باتیں سننے والا ہے کہ یہ عورت گھر کے ایک کونے میں نبی (صلى الله عليه وسلم) سے مجادلہ کرتی اور اپنے خاوند کی شکایﺖ کرتی رہی، مگر میں اس کی باتیں نہیں سنتی تھی۔ لیکن اللہ نے آسمانوں پر سے اس کی بات سن لی، (سنن ابن ماجه ، المقدمة ، باب فيما أنكرت الجهمية - صحيح بخاري میں بھی تعلیقاً اس کا مختصر ذکر ہے۔ كتاب التوحيد ، باب قول الله تعالى وكان الله سمعا بصيرا)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qad samiʿa al-lahu qawla allatī tujādiluka fī zawjihā watashtakī ilā al-lahi wal-lahu yasmaʿu taḥāwurakumā inna al-laha samīʿun baṣīrun ","translations":["Indeed","Allah has heard","Allah has heard","(the) speech","(of one) who","disputes with you","concerning","her husband","and she directs her complaint","to","Allah","And Allah","hears","(the) dialogue of both of you","Indeed","Allah","(is) All-Hearer","All-Seer","(1)"],"transliterationArr":["qad","samiʿa","al-lahu","qawla","allatī","tujādiluka","fī","zawjihā","watashtakī","ilā","al-lahi","wal-lahu","yasmaʿu","taḥāwurakumā","inna","al-laha","samīʿun","baṣīrun",null],"verseTiming":[[1,0,370],[2,370,900],[3,900,1770],[4,1770,2310],[5,2310,3020],[6,3020,4120],[7,4120,4470],[8,4470,5450],[9,5450,7680],[10,7680,8000],[11,8000,8700],[12,8700,9690],[13,9690,10450],[14,10450,12120],[15,12120,13850],[16,13850,14610],[17,14610,16120],[18,16120,18735]]}}