{"name":"58:10","price":"(بری) سرگوشیاں، پس شیطانی کام ہے جس سے ایمان داروں کو رنج پہنچے(1) ۔ گو اللہ تعالیٰ کی اجازت کے بغیر وه انہیں کوئی نقصان نہیں پہنچا سکتا۔ اور ایمان والوں کو چاہئے کہ اللہ ہی پر بھروسہ رکھیں.(2)","arabic":"إِنَّمَا ٱلنَّجۡوَىٰ مِنَ ٱلشَّيۡطَٰنِ لِيَحۡزُنَ ٱلَّذِينَ ءَامَنُواْ وَلَيۡسَ بِضَآرِّهِمۡ شَيۡـًٔا إِلَّا بِإِذۡنِ ٱللَّهِۚ وَعَلَى ٱللَّهِ فَلۡيَتَوَكَّلِ ٱلۡمُؤۡمِنُونَ","category":["58 (Al-Mujadila)","Al-Mujadila","Surah Al-Mujadila","Chapter Al-Mujadila","Mujadila","Surah Mujadila","Chapter Mujadila","Al Mujadila","Surah Al Mujadila","Chapter Al Mujadila","Surah 58","Chapter 58","The Pleading Woman","المجادلة"],"ayahNumber":5114,"juzNumber":28,"footnotes":"- یعنی اثم وعدوان اور معصیت رسول (صلى الله عليه وسلم) پر مبنی سرگوشیاں یہ شیطانی کام ہیں، کیونکہ شیطان ہی ان پر آمادہ کرتا ہے، تاکہ وہ اس کے ذریعے سے مومنوں کو غم وحزن میں مبتلا کرے۔\n(2) لیکن یہ سرگوشیاں اور شیطانی حرکتیں، مومنوں کو کچھ نقصان نہیں پہنچا سکتیں الایہ کہ اللہ کی مشیت ہو اس لیے تم اپنے دشمنوں کی ان اوچھی حرکتوں سے پریشان نہ ہوا کرو۔ بلکہ اللہ پر بھروسہ رکھو، اس لیے کہ تمام معاملات کا اختیار اسی کے ہاتھ میں ہے اور وہی ہر چیز پر قادر ہے، نہ کہ یہود اور منافقین، جو تمہیں تباہ وبرباد کرنا چاہتے ہیں۔ سرگوشی کے سلسلے میں ہی مسلمانوں کو ایک اخلاقی ہدایت یہ دی گئی ہے کہ جب تم تین آدمی اکٹھے ہو، تو اپنے میں سے ایک کو چھوڑ کر دو آدمی آپس میں سرگوشی نہ کریں، کیونکہ یہ طریقہ اس ایک آدمی کو غم میں ڈال دے گا۔ (صحيح بخاري ، كتاب الاستئذان ، باب إذا كانوا أكثر من ثلاثة فلا بأس بالمسارة والمناجاة ، وصحيح مسلم كتاب السلام ، باب تحريم مناجاة الاثنين دون الثالث بغير رضاه) البتہ اس کی رضامندی اور اجازت سے ایسا کرنا جائز ہے۔ کیونکہ اس صورت میں دو آدمیوں کا سرگوشی کرنا، کسی کے لیے تشویش کا باعث نہیں ہوگا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"innamā al-najwā mina al-shayṭāni liyaḥzuna alladhīna āmanū walaysa biḍārrihim shayan illā bi-idh'ni al-lahi waʿalā al-lahi falyatawakkali al-mu'minūna ","translations":["Only","the secret counsels","(are) from","the Shaitaan","that he may grieve","those who","believe","but not","he (can) harm them","(in) anything","except","by Allah's permission","by Allah's permission","And upon","Allah","let put (their) trust","the believers","(10)"],"transliterationArr":["innamā","al-najwā","mina","al-shayṭāni","liyaḥzuna","alladhīna","āmanū","walaysa","biḍārrihim","shayan","illā","bi-idh'ni","al-lahi","waʿalā","al-lahi","falyatawakkali","al-mu'minūna",null],"verseTiming":[[1,0,1410],[2,1410,3010],[3,3010,3330],[4,3330,4610],[5,4610,5480],[6,5480,6540],[7,6540,7660],[8,7660,8410],[9,8410,12390],[10,12390,13220],[11,13220,13960],[12,13960,14810],[13,14810,16770],[14,16770,17830],[15,17830,18620],[16,18620,20170],[17,20170,23175]]}}