{"name":"58:11","price":"اے مسلمانو! جب تم سے کہا جائے کہ مجلسوں میں ذرا کشادگی پیدا کرو تو تم جگہ کشاده کر دو(1) اللہ تمہیں کشادگی دے گا(2)، اور جب کہا جائے کہ اٹھ کھڑے ہو جاؤ(3) تو تم اٹھ کھڑے ہو جاؤ اللہ تعالیٰ تم میں سے ان لوگوں کے جو ایمان ﻻئے ہیں اور جو علم دیئے گئے ہیں درجے بلند کر دے گا(4)، اور اللہ تعالیٰ (ہر اس کام سے) جو تم کر رہے ہو (خوب) خبردار ہے.","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا قِيلَ لَكُمۡ تَفَسَّحُواْ فِي ٱلۡمَجَٰلِسِ فَٱفۡسَحُواْ يَفۡسَحِ ٱللَّهُ لَكُمۡۖ وَإِذَا قِيلَ ٱنشُزُواْ فَٱنشُزُواْ يَرۡفَعِ ٱللَّهُ ٱلَّذِينَ ءَامَنُواْ مِنكُمۡ وَٱلَّذِينَ أُوتُواْ ٱلۡعِلۡمَ دَرَجَٰتٖۚ وَٱللَّهُ بِمَا تَعۡمَلُونَ خَبِيرٞ","category":["58 (Al-Mujadila)","Al-Mujadila","Surah Al-Mujadila","Chapter Al-Mujadila","Mujadila","Surah Mujadila","Chapter Mujadila","Al Mujadila","Surah Al Mujadila","Chapter Al Mujadila","Surah 58","Chapter 58","The Pleading Woman","المجادلة"],"ayahNumber":5115,"juzNumber":28,"footnotes":"(1) اس میں مسلمانوں کو مجلس کے آداب بتلائے جارہے ہیں۔ مجلس کا لفظ عام ہے، جو ہر اس مجلس کو شامل ہے، جس میں مسلمان خیر اور اجر کے حصول کے لیے جمع ہوں، وعظ ونصیحت کی مجلس ہو یا جمعہ کی مجلس ہو۔ (تفسیر القرطبی) (کھل کر بیٹھو) کا مطلب ہے کہ مجلس کا دائرہ وسیع رکھو تاکہ بعد میں آنے والوں کے لیے بیٹھنے کی جگہ رہے۔ دائرہ تنگ مت رکھو کہ بعد میں آنے والے کو کھڑا رہنا پڑے یا کسی بیٹھے ہوئے کو اٹھاکر اس کی جگہ وہ بیٹھے کہ یہ دونوں باتیں ناشائستہ ہیں۔ چنانچہ نبی (صلى الله عليه وسلم) نے بھی فرمایا ”کوئی شخص، کسی دوسرے شخص کو اس کی جگہ سے اٹھا کر خود نہ بیٹھے، اس لیے مجلس کے دائرے کو فراخ اور وسیع کر لو“۔ (صحيح بخاري، كتاب الجمعة ، باب لا يقيم الرجل أخاه يوم الجمعة ويقعد في مكانه ، وصحيح مسلم ، كتاب السلام ، باب تحريم إقامة الإنسان من موضعه المباح الذي سبق إليه)۔\n(2) یعنی اس کے صلے میں اللہ تعالیٰ تمہیں جنت میں وسعت وفراخی عطا فرمائے گا یا جہاں بھی تم وسعت وفراخی کے طالب ہوگے ، مثلاً مکان میں، رزق میں، قبر میں۔ ہر جگہ تمہیں فراخی عطا فرمائے گا۔\n(3) یعنی جہاد کے لیے، نماز کے لیے یا کسی بھی عمل خیر کے لیے۔ یا مطلب ہے کہ جب مجلس سے اٹھ کر جانے کو کہا جائے، تو فوراً چلے جاؤ۔ مسلمانوں کو یہ حکم اس لیے دیا گیا کہ صحابہ کرام (رضي الله عنهم) نبی (صلى الله عليه وسلم) کی مجلس سے اٹھ کر جانا پسند نہیں کرتے تھے لیکن اس طرح بعض دفعہ ان لوگوں کو تکلیف ہوتی تھی جو نبی (صلى الله عليه وسلم) سے خلوت میں کوئی گفتگو کرنا چاہتے تھے۔\n(4) یعنی اہل ایمان کے درجے، غیر اہل ایمان پر اور اہل علم کے درجے اہل ایمان پر بلند فرمائے گا۔ جس کا مطلب یہ ہوا کہ ایمان کے ساتھ علوم دین سے واقفیت مزید رفع درجات کا باعث ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāayyuhā alladhīna āmanū idhā qīla lakum tafassaḥū fī al-majālisi fa-if'saḥū yafsaḥi al-lahu lakum wa-idhā qīla unshuzū fa-unshuzū yarfaʿi al-lahu alladhīna āmanū minkum wa-alladhīna ūtū al-ʿil'ma darajātin wal-lahu bimā taʿmalūna khabīrun ","translations":["O you who believe","O you who believe","O you who believe","When","it is said","to you","Make room","in","the assemblies","then make room","Allah will make room","Allah will make room","for you","And when","it is said","Rise up","then rise up","Allah will raise","Allah will raise","those who","believe","among you","and those who","were given","the knowledge","(in) degrees","And Allah","of what","you do","(is) All-Aware","(11)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","idhā","qīla","lakum","tafassaḥū","fī","al-majālisi","fa-if'saḥū","yafsaḥi","al-lahu","lakum","wa-idhā","qīla","unshuzū","fa-unshuzū","yarfaʿi","al-lahu","alladhīna","āmanū","minkum","wa-alladhīna","ūtū","al-ʿil'ma","darajātin","wal-lahu","bimā","taʿmalūna","khabīrun",null],"verseTiming":[[1,0,2770],[2,2770,3760],[3,3760,6100],[4,6100,6670],[5,6670,7310],[6,7310,7870],[7,7870,9020],[8,9020,9270],[9,9270,10430],[10,10430,11390],[11,11390,12200],[12,12200,12940],[13,12940,14080],[14,14080,14770],[15,14770,15370],[16,15370,16710],[17,16710,18220],[18,18220,19050],[19,19050,19820],[20,19820,20870],[21,20870,21820],[22,21820,23130],[23,23130,24330],[24,24330,24850],[25,24850,25580],[26,25580,28710],[27,28710,29710],[28,29710,30240],[29,30240,31430],[30,31430,34525]]}}