{"name":"58:2","price":"تم میں سے جو لوگ اپنی بیویوں سے ﻇہار کرتے ہیں (یعنی انہیں ماں کہہ بیٹھتے ہیں) وه دراصل ان کی مائیں نہیں بن جاتیں، ان کی مائیں تو وہی ہیں جن کے بطن سے وه پیدا ہوئے(1) ، یقیناً یہ لوگ ایک نامعقول اور جھوٹی بات کہتے ہیں۔ بیشک اللہ تعالیٰ معاف کرنے واﻻ اور بخشنے واﻻ ہے.(2)","arabic":"ٱلَّذِينَ يُظَٰهِرُونَ مِنكُم مِّن نِّسَآئِهِم مَّا هُنَّ أُمَّهَٰتِهِمۡۖ إِنۡ أُمَّهَٰتُهُمۡ إِلَّا ٱلَّٰٓـِٔي وَلَدۡنَهُمۡۚ وَإِنَّهُمۡ لَيَقُولُونَ مُنكَرٗا مِّنَ ٱلۡقَوۡلِ وَزُورٗاۚ وَإِنَّ ٱللَّهَ لَعَفُوٌّ غَفُورٞ","category":["58 (Al-Mujadila)","Al-Mujadila","Surah Al-Mujadila","Chapter Al-Mujadila","Mujadila","Surah Mujadila","Chapter Mujadila","Al Mujadila","Surah Al Mujadila","Chapter Al Mujadila","Surah 58","Chapter 58","The Pleading Woman","المجادلة"],"ayahNumber":5106,"juzNumber":28,"footnotes":"(1) یہ ظہار کا حکم بیان فرمایا کہ تمہارے کہہ دینے سے تمہاری بیوی تمہاری ماں نہیں بن جائے گی۔ اگر ماں کے بجائے کوئی شخص اپنی بیٹی یا بہن وغیرہ کی پیٹھ کی طرح اپنی بیوی کو کہہ دے تو یہ ظہار ہے یا نہیں؟ امام مالک اور امام ابو حنیفہ رحمہما اللہ اسے بھی ظہار قرار دیتے ہیں، جب کہ دوسرے علما اسے ظہار تسلیم نہیں کرتے۔ (پہلا قول ہی صحیح معلوم ہوتا ہے) اسی طرح اس میں بھی اختلاف ہے کہ پیٹھ کی جگہ اگر کوئی یہ کہے کہ تو میری ماں کی طرح ہے، پیٹھ کا نام نہ لے۔ تو علما کہتے ہیں کہ اگر ظہار کی نیت سے وہ مذکورہ الفاظ کہے گا تو ظہار ہوگا، بصورت دیگر نہیں۔ امام ابو حنیفہ رحمہ اللہ کہتے ہیں کہ اگر ایسے عضو کے ساتھ تشبیہ دے گا جس کا دیکھنا جائز ہے تو یہ ظہار نہیں ہوگا، امام شافعی رحمہ اللہ بھی کہتے ہیں کہ ظہار صرف پیٹھ کی طرح کہنے سے ہی ہوگا۔ (فتح القدیر)۔\n(2) اسی لیے اس نے کفارے کو اس قول منکر اور جھوٹ کی معافی کا ذریعہ بنا دیا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"alladhīna yuẓāhirūna minkum min nisāihim mā hunna ummahātihim in ummahātuhum illā allāī waladnahum wa-innahum layaqūlūna munkaran mina al-qawli wazūran wa-inna al-laha laʿafuwwun ghafūrun ","translations":["Those who","pronounce zihar","among you","[from]","(to) their wives","not","they","(are) their mothers","Not","(are) their mothers","except","those who","gave them birth","And indeed, they","surely say","an evil","[of]","[the] word","and a lie","But indeed","Allah","(is) surely, Oft-Pardoning","Oft-Forgiving","(2)"],"transliterationArr":["alladhīna","yuẓāhirūna","minkum","min","nisāihim","mā","hunna","ummahātihim","in","ummahātuhum","illā","allāī","waladnahum","wa-innahum","layaqūlūna","munkaran","mina","al-qawli","wazūran","wa-inna","al-laha","laʿafuwwun","ghafūrun",null],"verseTiming":[[1,0,1030],[2,1030,2420],[3,2420,3790],[4,3790,4930],[5,4930,7889],[6,7889,8599],[7,8599,9989],[8,9989,12049],[9,12049,12959],[10,12959,15309],[11,15309,15789],[12,15789,18139],[13,18139,19959],[14,19959,21639],[15,21639,23039],[16,23039,24439],[17,24439,25409],[18,25409,26239],[19,26239,27839],[20,27839,29189],[21,29189,30079],[22,30079,31049],[23,31049,33604]]}}