{"name":"58:3","price":"جو لوگ اپنی بیویوں سے ﻇہار کریں پھر اپنی کہی ہوئی بات سے رجوع کرلیں(1) تو ان کے ذمہ آپس میں ایک دوسرے کو ہاتھ لگانے سے پہلے(2) ایک غلام آزاد کرنا ہے، اس کے ذریعہ تم نصیحت کیے جاتے ہو۔ اور اللہ تعالیٰ تمہارے تمام اعمال سے باخبر ہے.","arabic":"وَٱلَّذِينَ يُظَٰهِرُونَ مِن نِّسَآئِهِمۡ ثُمَّ يَعُودُونَ لِمَا قَالُواْ فَتَحۡرِيرُ رَقَبَةٖ مِّن قَبۡلِ أَن يَتَمَآسَّاۚ ذَٰلِكُمۡ تُوعَظُونَ بِهِۦۚ وَٱللَّهُ بِمَا تَعۡمَلُونَ خَبِيرٞ","category":["58 (Al-Mujadila)","Al-Mujadila","Surah Al-Mujadila","Chapter Al-Mujadila","Mujadila","Surah Mujadila","Chapter Mujadila","Al Mujadila","Surah Al Mujadila","Chapter Al Mujadila","Surah 58","Chapter 58","The Pleading Woman","المجادلة"],"ayahNumber":5107,"juzNumber":28,"footnotes":"(1) اب اس حکم کی تفصیل بیان کی جارہی ہے۔ رجوع کا مطلب ہے، بیوی سے ہم بستری کرنا چاہیں۔\n(2) یعنی ہم بستری سے پہلے وہ کفارہ ادا کریں۔ 1۔ ایک غلام آزاد کرنا۔ 2۔ اس کی طاقت نہ ہو تو پے درپے بلاناغہ دو مہینے کے روزے۔ اگر درمیان میں بغیر عذر شرعی کے روزہ چھوڑ دیا تو نئے سرے سے پورے دو مہینے کے روزے رکھنے پڑیں گے۔ عذر شرعی سے مراد بیماری یا سفر ہے۔ امام ابو حنیفہ رحمہ اللہ کہتے ہیں کہ بیماری وغیرہ کی وجہ سے بھی روزہ چھوڑے گا تو نئے سرے سے روزے رکھنے ہوں گے۔ 3۔ اگر پے درپے دومہینے کے روزے رکھنے کی طاقت نہ ہو تو ساٹھ مساکین کو کھانا کھلائے۔ بعض کہتے ہیں کہ ہر مسکین کو دو مد (نصف صاع یعنی سوا کلو) اور بعض کہتے ہیں ایک مد کافی ہے۔ لیکن قرآن کے الفاظ سے معلوم ہوتا ہے کہ کھانا اس طرح کھلایا جائے کہ وہ شکم سیر ہو جائیں یا اتنی ہی مقدار میں ان کو کھانا دیا جائے۔ ایک مرتبہ ہی سب کو کھلانا بھی ضروری نہیں بلکہ متعدد اقساط میں یہ تعداد پوری کی جاسکتی ہے۔(فتح القدیر) تاہم یہ ضروری ہے جب تک یہ تعداد پوری نہ ہوجائے، اس وقت تک بیوی سے ہم بستری جائز نہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-alladhīna yuẓāhirūna min nisāihim thumma yaʿūdūna limā qālū fataḥrīru raqabatin min qabli an yatamāssā dhālikum tūʿaẓūna bihi wal-lahu bimā taʿmalūna khabīrun ","translations":["And those who","pronounce zihar","[from]","(to) their wives","then","go back","on what","they said","then freeing","(of) a slave","before","before","[that]","they touch each other","That","you are admonished","to it","And Allah","of what","you do","(is) All-Aware","(3)"],"transliterationArr":["wa-alladhīna","yuẓāhirūna","min","nisāihim","thumma","yaʿūdūna","limā","qālū","fataḥrīru","raqabatin","min","qabli","an","yatamāssā","dhālikum","tūʿaẓūna","bihi","wal-lahu","bimā","taʿmalūna","khabīrun",null],"verseTiming":[[1,0,1539],[2,1539,2704],[3,2704,3546],[4,3546,6237],[5,6237,7339],[6,7339,8468],[7,8468,8992],[8,8992,9908],[9,9908,10848],[10,10848,11941],[11,11941,13158],[12,13158,14440],[13,14440,15777],[14,15777,16562],[15,16562,17725],[16,17725,21755],[17,21755,23138],[18,23138,24407],[19,24407,24969],[20,24969,26226],[21,26226,26885],[22,26885,28004],[23,28004,30273]]}}