{"name":"58:8","price":"کیا تو نے ان لوگوں کو نہیں دیکھا؟ جنہیں کانا پھوسی سے روک دیا گیا تھا وه پھر بھی اس روکے ہوئے کام کو دوباره کرتے ہیں(1) اور آپس میں گناه کی اور ﻇلم وزیادتی کی اور نافرمانیٴ پیغمبر کی سرگوشیاں کرتے ہیں(2)، اور جب تیرے پاس آتے ہیں تو تجھے ان لفظوں میں سلام کرتے ہیں جن لفظوں میں اللہ تعالیٰ نے نہیں کہا(3) اور اپنے دل میں کہتے ہیں کہ اللہ تعالیٰ ہمیں اس پر جو ہم کہتے ہیں سزا کیوں نہیں دیتا(4)، ان کے لیے جہنم کافی (سزا) ہے جس میں یہ جائیں گے(5)، سو وه برا ٹھکانا ہے.","arabic":"أَلَمۡ تَرَ إِلَى ٱلَّذِينَ نُهُواْ عَنِ ٱلنَّجۡوَىٰ ثُمَّ يَعُودُونَ لِمَا نُهُواْ عَنۡهُ وَيَتَنَٰجَوۡنَ بِٱلۡإِثۡمِ وَٱلۡعُدۡوَٰنِ وَمَعۡصِيَتِ ٱلرَّسُولِۖ وَإِذَا جَآءُوكَ حَيَّوۡكَ بِمَا لَمۡ يُحَيِّكَ بِهِ ٱللَّهُ وَيَقُولُونَ فِيٓ أَنفُسِهِمۡ لَوۡلَا يُعَذِّبُنَا ٱللَّهُ بِمَا نَقُولُۚ حَسۡبُهُمۡ جَهَنَّمُ يَصۡلَوۡنَهَاۖ فَبِئۡسَ ٱلۡمَصِيرُ","category":["58 (Al-Mujadila)","Al-Mujadila","Surah Al-Mujadila","Chapter Al-Mujadila","Mujadila","Surah Mujadila","Chapter Mujadila","Al Mujadila","Surah Al Mujadila","Chapter Al Mujadila","Surah 58","Chapter 58","The Pleading Woman","المجادلة"],"ayahNumber":5112,"juzNumber":28,"footnotes":"(1) اس سے مدینے کے یہودی اور منافقین مراد ہیں۔ جب مسلمان ان کے پاس سے گزرتے تو یہ باہم سر جوڑ کر اس طرح سرگوشیاں اور کانا پھوسی کرتے کہ مسلمان یہ سمجھتے کہ شاید ان کے خلاف یہ کوئی سازش کررہے ہیں، یا مسلمانوں کے کسی لشکر پر دشمن نے حملہ کرکے انہیں نقصان پہنچایا ہے، جس کی خبر ان کے پاس پہنچ گئی ہے۔ مسلمان ان چیزوں سے خوف زدہ ہو جاتے۔ چنانچہ نبی (صلى الله عليه وسلم) نے اس طرح سرگوشیاں کرنے سے منع فرما دیا۔ لیکن کچھ ہی عرصے کے بعد انہوں نے پھر یہ مذموم سلسلہ شروع کر دیا۔ آیت میں ان کے اسی کردار کو بیان کیا جارہا ہے۔\n(2) یعنی ان کی سرگوشیاں نیکی اور تقویٰ کی باتوں میں نہیں ہوتیں، بلکہ گناہ، زیادتی اور معصیت رسول (صلى الله عليه وسلم) پر مبنی ہوتی ہیں مثلاً کسی کی غیبت ، الزام تراشی ، بے ہودہ گوئی ، ایک دوسرے کو رسول (صلى الله عليه وسلم) کی نافرمانی پر اکسانا وغیرہ۔\n(3) یعنی اللہ نے تو سلام کا طریقہ یہ بتلایا کہ تم السَّلامُ عَلَيْكُمْ وَرَحْمَةُ اللهِ ، کہو لیکن یہ یہودی نبی (صلى الله عليه وسلم) کی خدمت میں حاضر ہوتے تو اس کے بجائے کہتے السَّامُ عَلَيْكُمْ یا عَلَيْكَ (تم پر موت وارد ہو) اس لیے رسول اللہ (صلى الله عليه وسلم) ان کے جواب میں صرف یہ فرمایا کرتے تھے۔ وَعَلَيْكُمْ یا وَعَلَيْكَ (اور تم پر ہی ہو) اور مسلمانوں کو بھی آپ (صلى الله عليه وسلم) نے تاکید فرمائی کہ جب کوئی اہل کتاب تمہیں سلام کرے تو تم جواب میں ”عَلَيْكَ“ کہا کرو یعنی عَلَيْكَ مَا قُلْتَ (تو نے جو کہا ہے ، وہ تجھ پر ہی وارد ہو) (صحيح بخاري ومسلم ، كتاب الأدب ، باب لم يكن النبي صلى الله عليه وسلم فاحشا ولا متفحشا)۔\n(4) یعنی وہ آپس میں یا اپنے دلوں میں کہتے کہ اگر یہ سچا نبی ہوتا تو اللہ تعالیٰ یقیناً ہماری اس قبیح حرکت پر ہماری گرفت ضرور فرماتا۔\n(5) اللہ نے فرمایا کہ اگر اللہ نے اپنی مشیت اور حکمت بالغہ کے تحت دنیا میں ان کو فوری گرفت نہیں فرمائی تو کیا وہ آخرت میں جہنم کے عذاب سے بھی بچ جائیں گے؟ نہیں یقیناً نہیں۔ جہنم ان کی منتظر ہے جس میں وہ داخل ہوں گے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"alam tara ilā alladhīna nuhū ʿani al-najwā thumma yaʿūdūna limā nuhū ʿanhu wayatanājawna bil-ith'mi wal-ʿud'wāni wamaʿṣiyati al-rasūli wa-idhā jāūka ḥayyawka bimā lam yuḥayyika bihi al-lahu wayaqūlūna fī anfusihim lawlā yuʿadhibunā al-lahu bimā naqūlu ḥasbuhum jahannamu yaṣlawnahā fabi'sa al-maṣīru ","translations":["Do not","you see","[to]","those who","were forbidden","from","secret counsels","then","they return","to what","they were forbidden","from [it]","and they hold secret counsels","for sin","and aggression","and disobedience","(to) the Messenger","And when","they come to you","they greet you","with what","not","greets you","therewith","Allah","and they say","among","themselves","Why (does) not","Allah punish us","Allah punish us","for what","we say","Sufficient (for) them","(is) Hell","they will burn in it","and worst is","the destination","(8)"],"transliterationArr":["alam","tara","ilā","alladhīna","nuhū","ʿani","al-najwā","thumma","yaʿūdūna","limā","nuhū","ʿanhu","wayatanājawna","bil-ith'mi","wal-ʿud'wāni","wamaʿṣiyati","al-rasūli","wa-idhā","jāūka","ḥayyawka","bimā","lam","yuḥayyika","bihi","al-lahu","wayaqūlūna","fī","anfusihim","lawlā","yuʿadhibunā","al-lahu","bimā","naqūlu","ḥasbuhum","jahannamu","yaṣlawnahā","fabi'sa","al-maṣīru",null],"verseTiming":[[1,0,610],[2,610,1040],[3,1040,1380],[4,1380,2370],[5,2370,2970],[6,2970,3390],[7,3390,4940],[8,4940,6030],[9,6030,7320],[10,7320,7960],[11,7960,8570],[12,8570,9300],[13,9300,10820],[14,10820,11920],[15,11920,13280],[16,13280,14500],[17,14500,15560],[18,15560,16380],[19,16380,18819],[20,18819,19859],[21,19859,20519],[22,20519,20899],[23,20899,21929],[24,21929,22409],[25,22409,23249],[26,23249,26149],[27,26149,27549],[28,27549,29389],[29,29389,31289],[30,31289,32089],[31,32089,33319],[32,33319,34219],[33,34219,34799],[34,34799,36999],[35,36999,38469],[36,38469,40169],[37,40169,41609],[38,41609,42409],[39,42409,43394]]}}