{"name":"59:10","price":"اور (ان کے لیے) جو ان کے بعد آئیں جو کہیں گے کہ اے ہمارے پروردگار ہمیں بخش دے اور ہمارے ان بھائیوں کو بھی جو ہم سے پہلے ایمان ﻻچکے ہیں اور ایمان داروں کی طرف سے ہمارے دل میں کینہ (اور دشمنی) نہ ڈال(1) ، اے ہمارے رب بیشک تو شفقت ومہربانی کرنے واﻻ ہے.","arabic":"وَٱلَّذِينَ جَآءُو مِنۢ بَعۡدِهِمۡ يَقُولُونَ رَبَّنَا ٱغۡفِرۡ لَنَا وَلِإِخۡوَٰنِنَا ٱلَّذِينَ سَبَقُونَا بِٱلۡإِيمَٰنِ وَلَا تَجۡعَلۡ فِي قُلُوبِنَا غِلّٗا لِّلَّذِينَ ءَامَنُواْ رَبَّنَآ إِنَّكَ رَءُوفٞ رَّحِيمٌ","category":["59 (Al-Hashr)","Al-Hashr","Surah Al-Hashr","Chapter Al-Hashr","Hashr","Surah Hashr","Chapter Hashr","Al Hashr","Surah Al Hashr","Chapter Al Hashr","Surah 59","Chapter 59","The Exile","الحشر"],"ayahNumber":5136,"juzNumber":28,"footnotes":"(1) یہ مال فیء کے مستحقین کی تیسری قسم ہے، یعنی صحابہ (رضي الله عنهم) کے بعد آنے والے اور صحابہ کے نقش قدم پر چلنے والے۔ اس میں تابعین اور تبع تابعین اور قیامت تک ہونے والے اہل ایمان وتقویٰ آگئے۔ لیکن شرط یہی ہے کہ وہ انصار ومہاجرین کو مومن ماننے اور ان کے حق میں دعائے مغفرت کرنے والے ہوں نہ کہ ان کے ایمان میں شک کرنے اور ان پر سب وشتم کرنے اور ان کے خلاف اپنے دلوں میں بغض وعناد رکھنے والے۔ امام مالک رحمہ اللہ نے اس آیت سے استنباط کرتے ہوئے یہی بات ارشاد فرمائی ہے «إِنَّ الرَّافِضِيَّ الَّذِي يَسُبُّ الصَّحَابَةَ لَيْسَ لَهُ فِي مَالِ الْفَيْءِ نَصِيبٌ لِعَدَمِ اتِّصَافِهِ بِمَا مَدَحَ اللهُ بِهِ هَؤُلاءِ فِي قُلُوبِهِمْ» ”رافضی کو جو صحابہ کرام (رضي الله عنهم) پر سب وشتم کرتے ہیں مال فیء سے حصہ نہیں ملے گا کیونکہ اللہ تعالیٰ نے صحابہ کرام (رضي الله عنهم) کی مدح کی ہے اور رافضی ان کی مذمت کرتے ہیں“۔ (ابن کثیر) اور حضرت عائشہ (رضی الله عنها) فرماتی ہیں۔ «أُمِرْتُمْ بِالاسْتِغْفَارِ لأَصْحَابِ النَّبِي صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَسَبَبْتُمُوهُمْ! سَمِعْتُ نَبِيَّكُمْ يَقُولُ : ”لا تَذْهَبُ هَذِهِ الأمَّةُ حَتَّى يَلْعَنَ آخِرُهَا أَوَّلَهَا .... »(رواه البغوي) ”تم لوگوں کو اصحاب محمد (صلى الله عليه وسلم) کے لیے استغفار کا حکم دیا گیا۔ مگر تم نے ان پر لعن طعن کی۔ میں نے تمہارے نبی کو فرماتے ہوئے سنا کہ یہ امت اس وقت تک ختم نہیں ہوگی جب تک کہ اس کے آخرین اولین پر لعنت نہ کریں“۔ (حوالۂ مذکور)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-alladhīna jāū min baʿdihim yaqūlūna rabbanā igh'fir lanā wali-ikh'wāninā alladhīna sabaqūnā bil-īmāni walā tajʿal fī qulūbinā ghillan lilladhīna āmanū rabbanā innaka raūfun raḥīmun ","translations":["And those who","came","from","after them","they say","Our Lord","forgive","us","and our brothers","who","preceded us","in faith","and (do) not","put","in","our hearts","any rancor","towards those who","believed","Our Lord","indeed You","(are) Full of Kindness","Most Merciful","(10)"],"transliterationArr":["wa-alladhīna","jāū","min","baʿdihim","yaqūlūna","rabbanā","igh'fir","lanā","wali-ikh'wāninā","alladhīna","sabaqūnā","bil-īmāni","walā","tajʿal","fī","qulūbinā","ghillan","lilladhīna","āmanū","rabbanā","innaka","raūfun","raḥīmun",null],"verseTiming":[[1,0,1320],[2,1320,4389],[3,4389,5489],[4,5489,6519],[5,6519,7859],[6,7859,8619],[7,8619,9429],[8,9429,10019],[9,10019,11699],[10,11699,12749],[11,12749,14169],[12,14169,18119],[13,18119,19389],[14,19389,20169],[15,20169,20829],[16,20829,21569],[17,21569,23199],[18,23199,24229],[19,24229,25619],[20,25619,27169],[21,27169,27799],[22,27799,28639],[23,28639,29069],[24,29069,30439],[25,30439,31059],[26,31059,32479],[27,32479,33699],[28,33699,34939],[29,34939,38608],[30,38608,40298],[31,40298,41068],[32,41068,43023]]}}