{"name":"59:20","price":"اہل نار اور اہل جنت (باہم) برابر نہیں(1) ۔ جو اہل جنت ہیں وہی کامیاب ہیں (اور جو اہل نار ہیں وه ناکام ہیں).(2)","arabic":"لَا يَسۡتَوِيٓ أَصۡحَٰبُ ٱلنَّارِ وَأَصۡحَٰبُ ٱلۡجَنَّةِۚ أَصۡحَٰبُ ٱلۡجَنَّةِ هُمُ ٱلۡفَآئِزُونَ","category":["59 (Al-Hashr)","Al-Hashr","Surah Al-Hashr","Chapter Al-Hashr","Hashr","Surah Hashr","Chapter Hashr","Al Hashr","Surah Al Hashr","Chapter Al Hashr","Surah 59","Chapter 59","The Exile","الحشر"],"ayahNumber":5146,"juzNumber":28,"footnotes":"(1) جنہوں نے اللہ کو بھول کر یہ بات بھی بھلائے رکھی کہ اس طرح وہ خود اپنے ہی نفسوں پر ظلم کر رہے ہیں اور ایک دن آئے گا کہ اس کے نتیجے میں ان کے یہ جسم، جن کے لیے دنیا میں وہ بڑے بڑے پاپڑ بیلتے تھے، جہنم کی آگ کا ایندھن بنیں گے۔ اور ان کے مقابلے میں دوسرے وہ لوگ تھے، جنہوں نے اللہ کو یاد رکھا، اس کے احکام کے مطابق زندگی گزاری۔ ایک وقت آئے گا کہ اللہ تعالیٰ انہیں اس کی بہترین جزا عطا فرمائے گا اور اپنی جنت میں انہیں داخل فرمائے گا، جہاں ان کے آرام وراحت کے لیے ہر طرح کی نعمتیں اور سہولتیں ہوں گی۔ یہ دونوں فریق یعنی جنتی اور جہنمی برابر نہیں ہوں گے۔ بھلا یہ برابر ہو بھی کس طرح سکتے ہیں۔ ایک نے اپنے انجام کو یاد رکھا اور اس کے لیے تیاری کرتا رہا۔ دوسرا، اپنے انجام سے غافل رہا اس لیے اس کے لیے تیاری میں بھی مجرمانہ غفلت برتی۔\n(2) جس طرح امتحان کی تیاری کرنے والا کامیاب اور دوسرا ناکام ہوتا ہے۔ اسی طرح اہل ایمان وتقویٰ جنت کے حصول میں کامیاب ہو جائیں گے، کیونکہ اس کے لیے وہ دنیا میں نیک عمل کرکے تیاری کرتے رہے گویا دنیا دارالعمل اور دارالامتحان ہے۔ جس نے اس حقیقت کو سمجھ لیا اور اس نے انجام سے بےخبر ہوکر زندگی نہیں گزاری، وہ کامیاب ہوگا اور جو دنیا کی حقیقت کو سمجھنے سے قاصر اور انجام سے غافل ، فسق وفجور میں مبتلا رہا، وہ خاسر وناکام ہوگا۔ اللَّهُمَّ اجْعَلْنَا مِنَ الْفَائِزِينَ۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"lā yastawī aṣḥābu al-nāri wa-aṣḥābu al-janati aṣḥābu al-janati humu al-fāizūna ","translations":["Not","equal","(are the) companions","(of) the Fire","and (the) companions","(of) Paradise","(The) companions","(of) Paradise","they","(are) the achievers","(20)"],"transliterationArr":["lā","yastawī","aṣḥābu","al-nāri","wa-aṣḥābu","al-janati","aṣḥābu","al-janati","humu","al-fāizūna",null],"verseTiming":[[1,0,450],[2,450,2970],[3,2970,3810],[4,3810,5540],[5,5540,6690],[6,6690,9110],[7,9110,10040],[8,10040,12150],[9,12150,12410],[10,12410,17485]]}}