{"name":"59:2","price":"وہی ہے جس نے اہل کتاب میں سے کافروں کو ان کے گھروں سے پہلے حشر کے وقت نکالا(1) ، تمہارا گمان (بھی) نہ تھا کہ وه نکلیں گے اور وه خود (بھی) سمجھ رہے تھے کہ ان کے (سنگین) قلعے انہیں اللہ (کے عذاب) سے بچا لیں گے(2) پس ان پر اللہ (کا عذاب) ایسی جگہ سے آپڑا کہ انہیں گمان بھی نہ تھا(3) اور ان کے دلوں میں اللہ نے رعب ڈال دیا(4) وه اپنے گھروں کو اپنے ہی ہاتھوں اجاڑ رہے تھے(5) اور مسلمانوں کے ہاتھوں (برباد کروا رہے تھے(6)) پس اے آنکھوں والو! عبرت حاصل کرو.(7)","arabic":"هُوَ ٱلَّذِيٓ أَخۡرَجَ ٱلَّذِينَ كَفَرُواْ مِنۡ أَهۡلِ ٱلۡكِتَٰبِ مِن دِيَٰرِهِمۡ لِأَوَّلِ ٱلۡحَشۡرِۚ مَا ظَنَنتُمۡ أَن يَخۡرُجُواْۖ وَظَنُّوٓاْ أَنَّهُم مَّانِعَتُهُمۡ حُصُونُهُم مِّنَ ٱللَّهِ فَأَتَىٰهُمُ ٱللَّهُ مِنۡ حَيۡثُ لَمۡ يَحۡتَسِبُواْۖ وَقَذَفَ فِي قُلُوبِهِمُ ٱلرُّعۡبَۚ يُخۡرِبُونَ بُيُوتَهُم بِأَيۡدِيهِمۡ وَأَيۡدِي ٱلۡمُؤۡمِنِينَ فَٱعۡتَبِرُواْ يَٰٓأُوْلِي ٱلۡأَبۡصَٰرِ","category":["59 (Al-Hashr)","Al-Hashr","Surah Al-Hashr","Chapter Al-Hashr","Hashr","Surah Hashr","Chapter Hashr","Al Hashr","Surah Al Hashr","Chapter Al Hashr","Surah 59","Chapter 59","The Exile","الحشر"],"ayahNumber":5128,"juzNumber":28,"footnotes":"(1) مدینے کے اطراف میں یہودیوں کے تین قبیلے آباد تھے ، بنو نضیر، بنو قریظہ اور بنو قینقاع۔ ہجرت مدینہ کے بعد نبی (صلى الله عليه وسلم) نے ان سے معاہدہ بھی کیا لیکن یہ لوگ درپردہ سازشیں کرتے رہے اور کفار مکہ سے بھی مسلمانوں کے خلاف رابطہ رکھا، حتیٰ کہ ایک موقعے پر جب کہ آپ (صلى الله عليه وسلم) ان کے پاس گئے ہوئے تھے ، بنو نضیر نے رسول اللہ (صلى الله عليه وسلم) پر اوپر سے ایک بھاری پتھر پھینک کر آپ (صلى الله عليه وسلم) کو مار ڈالنے کی سازش تیار کی، جس سے وحی کے ذریعے سے آپ (صلى الله عليه وسلم) کو بروقت اطلاع کر دی گئی، اور آپ (صلى الله عليه وسلم) وہاں سے واپس تشریف لے آئے۔ ان کی اس عہد شکنی کی وجہ سے رسول اللہ (صلى الله عليه وسلم) نے ان پر لشکر کشی کی، یہ چند دن اپنے قلعوں میں محصور رہے، بالآخر انہوں نے جان بخشی کی صورت میں جلا وطنی پر آمادگی کا اظہار کیا، جسے رسول اللہ (صلى الله عليه وسلم) نے قبول فرما لیا۔ اسے اول حشر (پہلی بار اجتماع) سے اس لیے تعبیر کیا کہ یہ ان کی پہلی جلاوطنی تھی، جو مدینے سے ہوئی، یہاں سے یہ خیبر میں جاکر مقیم ہوگئے، وہاں سے حضرت عمر (رضي الله عنه) ، نے اپنے دور میں انہیں دوبارہ جلا وطن کیا اور شام کی طرف دھکیل دیا، جہاں کہتے ہیں کہ تمام انسانوں کا آخری حشر ہوگا۔\n(2) اس لیے کہ انہوں نے نہایت مضبوط قلعے تعمیر کر رکھے تھے جس پر انہیں گھمنڈ تھا اور مسلمان بھی سمجھتے تھے کہ اتنی آسانی سے یہ قلعے فتح نہیں ہوسکیں گے۔\n(3) اور وہ یہی تھا کہ رسول اللہ (صلى الله عليه وسلم) نے ان کا محاصرہ کر لیا تھا جو ان کے وہم وگمان میں بھی نہیں تھا۔\n(4) اس رعب کی وجہ سے ہی انہوں نے جلاوطنی پر آمادگی کا اظہار کیا، ورنہ عبداللہ بن ابی (رئیس المنافقین) اور دیگر لوگوں نے انہیں پیغامات بھیجے تھے کہ تم مسلمانوں کے سامنے جھکنا نہیں، ہم تمہارے ساتھ ہیں۔ علاوہ ازیں اللہ تعالیٰ نے نبی کریم (صلى الله عليه وسلم) کو یہ خصوصی وصف عطا فرمایا تھا کہ دشمن ایک مہینے کی مسافت پر آپ (صلى الله عليه وسلم) سے مرعوب ہو جاتا تھا۔ اس لیے سخت دہشت اور گھبراہٹ ان پر طاری ہوگئی۔ اور تمام تر اسباب ووسائل کے باوجود انہوں نے ہتھیار ڈال دیئے اور صرف یہ شرط مسلمانوں سے منوائی کہ جتنا سامان وہ لاد کر لے جاسکتے ہیں انہیں لے جانے کی اجازت ہو، چنانچہ اس اجازت کی وجہ سے انہوں نے اپنے گھروں کے دروازے اور شہتیر تک اکھیڑ ڈالے تاکہ انہیں اپنے ساتھ لے جائیں۔\n(5) یعنی جب انہیں یقین ہوگیا کہ اب جلا وطنی ناگزیر ہے تو انہوں نے دوران محاصرہ اندر سے اپنے گھروں کو برباد کرنا شروع کر دیا تاکہ وہ مسلمانوں کے بھی کام کے نہ رہیں۔ یا یہ مطلب ہے کہ سامان لے جانے کی اجازت سے پورا فائدہ اٹھانے کے لیے وہ اپنے اپنے اونٹوں پر جتنا سامان لاد کر لے جاسکتے تھے، اپنے گھر ادھیڑ ادھیڑ کر وہ سامان انہوں نے اونٹوں پر رکھ لیا۔\n(6) باہر سے مسلمان ان کے گھروں کو برباد کرتے رہے تاکہ ان پر گرفت آسان ہو جائے یا یہ مطلب ہے کہ ان کے ادھیڑے ہوئے گھروں سے بقیہ سامان نکالنے اور حاصل کرنے کے لیے مسلمانوں کو مزید تخریب سے کام لینا پڑا۔\n(7) کہ کس طرح اللہ نے ان کے دلوں میں مسلمانوں کا رعب ڈالا۔ دراں حالیکہ وہ ایک نہایت طاقت ور اور باوسائل قبیلہ تھا، لیکن جب اللہ تعالیٰ کی طرف سے مہلت عمل ختم ہوگئی اور اللہ نے اپنے مواخذے کے شکنجے میں کسنے کا فیصلہ کر لیا تو پھر ان کی اپنی طاقت اور وسائل ان کے کام آئے نہ دیگر اعوان وانصار ان کی کچھ مدد کرسکے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"huwa alladhī akhraja alladhīna kafarū min ahli al-kitābi min diyārihim li-awwali al-ḥashri mā ẓanantum an yakhrujū waẓannū annahum māniʿatuhum ḥuṣūnuhum mina al-lahi fa-atāhumu al-lahu min ḥaythu lam yaḥtasibū waqadhafa fī qulūbihimu al-ruʿ'ba yukh'ribūna buyūtahum bi-aydīhim wa-aydī al-mu'minīna fa-iʿ'tabirū yāulī al-abṣāri ","translations":["He","(is) the One Who","expelled","those who","disbelieved","from","(the) People","(of) the Scripture","from","their homes","at (the) first","gathering","Not","you think","that","they would leave","and they thought","that [they]","would defend them","their fortresses","against","Allah","But came to them","Allah","from","where","not","they expected","and He cast","into","their hearts","[the] terror","they destroyed","their houses","with their hands","and the hands","(of) the believers","So take a lesson","O those endowed","(with) insight","(2)"],"transliterationArr":["huwa","alladhī","akhraja","alladhīna","kafarū","min","ahli","al-kitābi","min","diyārihim","li-awwali","al-ḥashri","mā","ẓanantum","an","yakhrujū","waẓannū","annahum","māniʿatuhum","ḥuṣūnuhum","mina","al-lahi","fa-atāhumu","al-lahu","min","ḥaythu","lam","yaḥtasibū","waqadhafa","fī","qulūbihimu","al-ruʿ'ba","yukh'ribūna","buyūtahum","bi-aydīhim","wa-aydī","al-mu'minīna","fa-iʿ'tabirū","yāulī","al-abṣāri",null],"verseTiming":[[1,0,320],[2,320,2330],[3,2330,3000],[4,3000,3850],[5,3850,4560],[6,4560,4920],[7,4920,5460],[8,5460,6380],[9,6380,7320],[10,7320,8330],[11,8330,9250],[12,9250,9820],[13,9820,10650],[14,10650,12440],[15,12440,12670],[16,12670,14490],[17,14490,17770],[18,17770,19210],[19,19210,21090],[20,21090,22130],[21,22130,23010],[22,23010,23810],[23,23810,24950],[24,24950,25770],[25,25770,26040],[26,26040,26650],[27,26650,26990],[28,26990,28320],[29,28320,29670],[30,29670,29980],[31,29980,31190],[32,31190,32360],[33,32360,33450],[34,33450,34720],[35,34720,36470],[36,36470,37170],[37,37170,38410],[38,38410,39540],[39,39540,41660],[40,41660,44695]]}}