{"name":"59:21","price":"اگر ہم اس قرآن کو کسی پہاڑ پر اتارتے(1) تو تو دیکھتا کہ خوف الٰہی سے وه پست ہوکر ٹکڑے ٹکڑے ہو جاتا(2) ہم ان مثالوں کو لوگوں کے سامنے بیان کرتے ہیں تاکہ وه غور وفکر کریں.(3)","arabic":"لَوۡ أَنزَلۡنَا هَٰذَا ٱلۡقُرۡءَانَ عَلَىٰ جَبَلٖ لَّرَأَيۡتَهُۥ خَٰشِعٗا مُّتَصَدِّعٗا مِّنۡ خَشۡيَةِ ٱللَّهِۚ وَتِلۡكَ ٱلۡأَمۡثَٰلُ نَضۡرِبُهَا لِلنَّاسِ لَعَلَّهُمۡ يَتَفَكَّرُونَ","category":["59 (Al-Hashr)","Al-Hashr","Surah Al-Hashr","Chapter Al-Hashr","Hashr","Surah Hashr","Chapter Hashr","Al Hashr","Surah Al Hashr","Chapter Al Hashr","Surah 59","Chapter 59","The Exile","الحشر"],"ayahNumber":5147,"juzNumber":28,"footnotes":"(1) اور پہاڑ میں فہم وادراک کی وہ صلاحیت پیدا کر دیتے جو ہم نے انسان کے اندر رکھی ہے۔\n(2) یعنی قرآن کریم میں ہم نے بلاغت وفصاحت ، قوت واستدلال اور وعظ تذکیر کے ایسے پہلو بیان کیے ہیں کہ انہیں سن کر پہاڑ بھی، باوجود اتنی سختی اور وسعت وبلندی کے ، خوف الٰہی سے ریزہ ریزہ ہو جاتا۔ یہ انسان کو سمجھایا اور ڈرایا جارہا ہے کہ تجھے عقل وفہم کی صلاحیتیں دی گئی ہیں۔ لیکن اگر قرآن سن کر تیرا دل کوئی اثر قبول نہیں کرتا تو تیرا انجام اچھا نہیں ہوگا۔\n(3) تاکہ قرآن کے مواعظ سے وہ نصیحت حاصل کریں اور زواجر کو سن کر نافرمانیوں سے اجتناب کریں۔ بعض کہتے ہیں کہ اس آیت میں نبی (صلى الله عليه وسلم) سے خطاب ہے کہ ہم نے آپ (صلى الله عليه وسلم) پر یہ قرآن مجید نازل کیا جو ایسی عظمت شان کا حامل ہے کہ اگر ہم اسے کسی پہاڑ پر نازل کرتے تو وہ ریزہ ریزہ ہو جاتا، لیکن یہ آپ (صلى الله عليه وسلم) پر ہمارا احسان ہے کہ ہم نے آپ (صلى الله عليه وسلم) کو اتنا قوی اور مضبوط کر دیا کہ آپ (صلى الله عليه وسلم) نے اس چیز کو برداشت کر لیا جس کو برداشت کرنے کی طاقت پہاڑوں میں بھی نہیں ہے۔ (فتح القدیر) اس کے بعد اللہ تعالیٰ اپنی صفات بیان فرما رہا ہے جس سے مقصود توحید کا اثبات اور شرک کی تردید ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"law anzalnā hādhā al-qur'āna ʿalā jabalin lara-aytahu khāshiʿan mutaṣaddiʿan min khashyati al-lahi watil'ka al-amthālu naḍribuhā lilnnāsi laʿallahum yatafakkarūna ","translations":["If","We (had) sent down","this","Quran","on","a mountain","surely you (would) have seen it","humbled","breaking asunder","from","(the) fear","(of) Allah","And these","examples","We present them","to the people","so that they may","give thought","(21)"],"transliterationArr":["law","anzalnā","hādhā","al-qur'āna","ʿalā","jabalin","lara-aytahu","khāshiʿan","mutaṣaddiʿan","min","khashyati","al-lahi","watil'ka","al-amthālu","naḍribuhā","lilnnāsi","laʿallahum","yatafakkarūna",null],"verseTiming":[[1,0,490],[2,490,2700],[3,2700,3250],[4,3250,4560],[5,4560,5200],[6,5200,5890],[7,5890,7340],[8,7340,8420],[9,8420,10790],[10,10790,11900],[11,11900,12780],[12,12780,15480],[13,15480,16310],[14,16310,17490],[15,17490,18700],[16,18700,20600],[17,20600,21790],[18,21790,26015]]}}