{"name":"59:9","price":"اور (ان کے لیے) جنہوں نے اس گھر میں (یعنی مدینہ) اور ایمان میں ان سے پہلے جگہ بنالی ہے(1) اور اپنی طرف ہجرت کرکے آنے والوں سے محبت کرتے ہیں اور مہاجرین کو جو کچھ دے دیا جائے اس سے وه اپنے دلوں میں کوئی تنگی نہیں رکھتے(2) بلکہ خود اپنے اوپر انہیں ترجیح دیتے ہیں گو خود کو کتنی ہی (3)سخت حاجت ہو (بات یہ ہے) کہ جو بھی اپنے نفس کے بخل سے بچایا گیا وہی کامیاب (اور بامراد) ہے.(4)","arabic":"وَٱلَّذِينَ تَبَوَّءُو ٱلدَّارَ وَٱلۡإِيمَٰنَ مِن قَبۡلِهِمۡ يُحِبُّونَ مَنۡ هَاجَرَ إِلَيۡهِمۡ وَلَا يَجِدُونَ فِي صُدُورِهِمۡ حَاجَةٗ مِّمَّآ أُوتُواْ وَيُؤۡثِرُونَ عَلَىٰٓ أَنفُسِهِمۡ وَلَوۡ كَانَ بِهِمۡ خَصَاصَةٞۚ وَمَن يُوقَ شُحَّ نَفۡسِهِۦ فَأُوْلَٰٓئِكَ هُمُ ٱلۡمُفۡلِحُونَ","category":["59 (Al-Hashr)","Al-Hashr","Surah Al-Hashr","Chapter Al-Hashr","Hashr","Surah Hashr","Chapter Hashr","Al Hashr","Surah Al Hashr","Chapter Al Hashr","Surah 59","Chapter 59","The Exile","الحشر"],"ayahNumber":5135,"juzNumber":28,"footnotes":"(1) ان سے انصار مدینہ مراد ہیں، جو مہاجرین کے مدینہ آنے سے قبل مدینے میں آباد تھے اور مہاجرین کے ہجرت کرکے آنے سے قبل، ایمان بھی ان کے دلوں میں قرار پکڑ چکا تھا۔ یہ مطلب نہیں ہے کہ مہاجرین کے ایمان لانے سے پہلے ، یہ انصار ایمان لاچکے تھے، کیونکہ ان کی اکثریت مہاجرین کے ایمان لانے کے بعد ایمان لائی ہے۔ یعنی مِنْ قَبْلِهِمْ کا مطلب مِنْ قَبْلِ هِجْرَتِهِمْ ہے۔ اور دَارٌ سے دَارُ الْهِجْرَةِ یعنی مدینہ مراد ہے۔\n(2) یعنی مہاجرین کو اللہ کا رسول (صلى الله عليه وسلم) جو کچھ دے، اس پر حسد اور انقباض محسوس نہیں کرتے ، جیسے مال فیء کا اولین مستحق بھی ان کو قرار دیا گیا۔ لیکن انصار نے برا نہیں منایا۔\n(3) یعنی اپنے مقابلے میں مہاجرین کی ضرورت کو ترجیح دیتے ہیں۔ خود بھوکا رہتے ہیں لیکن مہاجرین کو کھلاتے ہیں۔ جیسے حدیث میں ایک واقعہ آتا ہے کہ رسول اللہ (صلى الله عليه وسلم) کے پاس ایک مہمان آیا، لیکن آپ (صلى الله عليه وسلم) کے گھر میں کچھ نہ تھا، چنانچہ ایک انصاری اسے اپنے گھر لے گیا، گھر جاکر بیوی کو بتلایا تو بیوی نے کہا کہ گھر میں تو صرف بچوں کی خوراک ہے۔ انہوں نے باہم مشورہ کیا کہ بچوں کو تو آج بھوکا سلا دیں اور ہم خود بھی ایسے ہی کچھ کھائے بغیر سو جائیں گے۔ البتہ مہمان کو کھلاتے وقت چراغ بجھا دینا تاکہ اسے ہماری بابت علم نہ ہو کہ ہم اس کے ساتھ کھانا نہیں کھا رہے ہیں۔ صبح جب وہ صحابی رسول اللہ (صلى الله عليه وسلم) کی خدمت میں حاضر ہوئے تو آپ (صلى الله عليه وسلم) نے ان سے فرمایا کہ اللہ تعالیٰ نے تم دونوں میاں بیوی کی شان میں یہ آیت نازل فرمائی ہے۔ وَيُؤْثِرُونَ عَلَى أَنْفُسِهِمْ الآیہ (صحيح بخاري ، تفسير سورة الحشر) ان کے ایثار کی یہ بھی ایک نہایت عجیب مثال ہے کہ ایک انصاری کے پاس دو بیویاں تھیں تو اس نے ایک بیوی کو اس لیے طلاق دینے کی پیشکش کی کہ عدت گزرنے کے بعد اس سے اس کا دوسرا مہاجر بھائی نکاح کرلے۔ (صحيح البخاري ، كتاب النكاح)۔\n(4) حدیث میں ہے ”شُح سے بچو، اس حرص نفس نے ہی پہلے لوگوں کو ہلاک کیا، اسی نے انہیں خون ریزی پر آمادہ کیا اور انہوں نے محارم کو حلال کر لیا“۔ (صحيح مسلم ، كتاب البر ، تحريم الظلم)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-alladhīna tabawwaū al-dāra wal-īmāna min qablihim yuḥibbūna man hājara ilayhim walā yajidūna fī ṣudūrihim ḥājatan mimmā ūtū wayu'thirūna ʿalā anfusihim walaw kāna bihim khaṣāṣatun waman yūqa shuḥḥa nafsihi fa-ulāika humu al-muf'liḥūna ","translations":["And those who","settled","(in) the home","and (accepted) faith","from","before them","love","(those) who","emigrated","to them","and not","they find","in","their breasts","any want","of what","they were given","but prefer","over","themselves","even though","was","with them","poverty","And whoever","is saved","(from) stinginess","(of) his soul","then those","[they]","(are) the successful ones","(9)"],"transliterationArr":["wa-alladhīna","tabawwaū","al-dāra","wal-īmāna","min","qablihim","yuḥibbūna","man","hājara","ilayhim","walā","yajidūna","fī","ṣudūrihim","ḥājatan","mimmā","ūtū","wayu'thirūna","ʿalā","anfusihim","walaw","kāna","bihim","khaṣāṣatun","waman","yūqa","shuḥḥa","nafsihi","fa-ulāika","humu","al-muf'liḥūna",null],"verseTiming":[[1,0,1290],[2,1290,2300],[3,2300,3270],[4,3270,4670],[5,4670,6040],[6,6040,7010],[7,7010,8400],[8,8400,8830],[9,8830,9670],[10,9670,10710],[11,10710,12050],[12,12050,12420],[13,12420,13300],[14,13300,14410],[15,14410,15030],[16,15030,16000],[17,16000,16450],[18,16450,17840],[19,17840,18870],[20,18870,22370],[21,22370,23330],[22,23330,26090],[23,26090,27490],[24,27490,30030],[25,30030,31800],[26,31800,32440],[27,32440,33130],[28,33130,33720],[29,33720,35530],[30,35530,35980],[31,35980,37440],[32,37440,38150],[33,38150,39220],[34,39220,42240],[35,42240,42640],[36,42640,45615]]}}