{"name":"5:102","price":"ایسی باتیں تم سے پہلے اور لوگوں نے بھی پوچھی تھیں، پھر ان باتوں کے منکر ہوگئے۔(1)","arabic":"قَدۡ سَأَلَهَا قَوۡمٞ مِّن قَبۡلِكُمۡ ثُمَّ أَصۡبَحُواْ بِهَا كَٰفِرِينَ","category":["5 (Al-Ma'idah)","Al-Ma'idah","Surah Al-Ma'idah","Chapter Al-Ma'idah","Ma'idah","Surah Ma'idah","Chapter Ma'idah","Al Ma'idah","Surah Al Ma'idah","Chapter Al Ma'idah","Surah 5","Chapter 5","The Table Spread","المَائدة"],"ayahNumber":771,"juzNumber":7,"footnotes":"(1) کہیں اس کوتاہی کے مرتکب تم بھی نہ ہو جاؤ۔ جس طرح ایک مرتبہ نبی (صلى الله عليه وسلم) نے فرمایا ”اللہ تعالیٰ نے تم پر حج فرض کیا ہے“ ایک شخص نے سوال کیا؟ کیا ہر سال؟ آپ (صلى الله عليه وسلم) خاموش رہے، اس نے تین مرتبہ سوال دہرایا، پھر آپ (صلى الله عليه وسلم) نے فرمایا کہ ”اگر میں ہاں کہہ دیتا تو حج ہر سال فرض ہوجاتا اور اگر ایسا ہوجاتا تو ہر سال حج کرنا تمہارے لئے ممکن نہ ہوتا“۔ (صحيح مسلم، كتاب الحج حديث نمبر 412، ومسند أحمد، سنن أبي داود، نسائي، ابن ماجه) اسی لئے بعض مفسرین نے ”عَفَا ٱللَّهُ عَنۡهَا“ کا ایک مطلب یہ بھی بیان کیا ہے کہ جس چیز کا تذکرہ اللہ نے اپنی کتاب میں نہیں کیا ہے، پس وہ ان چیزوں میں سے ہے جن کو اللہ نے معاف کردیا ہے۔ پس تم بھی ان کی بابت خاموش رہو، جس طرح وہ خاموش رہا۔ (ابن کثیر) ایک حدیث میں نبی (صلى الله عليه وسلم) نے اس مفہوم کو بایں الفاظ بیان فرمایا: ”ذَرُونِي مَا تُرِكْتُمْ فَإِنَّمَا أَهْلَكَ مَنْ كَانَ قَبْلَكُمْ كَثْرَةُ سُؤَالِهِمْ، وَاخْتِلافُهُمْ عَلَى أَنْبِيَائِهِمْ“ (صحيح مسلم، كتاب وباب مذكور) ”تمہیں جن چیزوں کی بابت نہیں بتایا گیا، تم مجھ سے ان کی بابت سوال مت کرو، اس لئے کہ تم سے پہلی امتوں کی ہلاکت کا سبب ان کا کثرت سوال اور اپنے انبیاء سے اختلاف بھی تھا۔“","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qad sa-alahā qawmun min qablikum thumma aṣbaḥū bihā kāfirīna ","translations":["Indeed","asked them","a people","from","before you","then","they became","thereby","disbelievers","(102)"],"transliterationArr":["qad","sa-alahā","qawmun","min","qablikum","thumma","aṣbaḥū","bihā","kāfirīna",null],"verseTiming":[[1,0,520],[2,520,1570],[3,1570,2350],[4,2350,4080],[5,4080,5060],[6,5060,6390],[7,6390,7400],[8,7400,8030],[9,8030,10645]]}}