{"name":"5:103","price":"اللہ تعالیٰ نے نہ بحیره کو مشروع کیا ہے اور نہ سائبہ کو اور نہ وصیلہ کو اور نہ حام کو(1) لیکن جو لوگ کافر ہیں وه اللہ تعالیٰ پر جھوٹ لگاتے ہیں اور اکثر کافر عقل نہیں رکھتے۔","arabic":"مَا جَعَلَ ٱللَّهُ مِنۢ بَحِيرَةٖ وَلَا سَآئِبَةٖ وَلَا وَصِيلَةٖ وَلَا حَامٖ وَلَٰكِنَّ ٱلَّذِينَ كَفَرُواْ يَفۡتَرُونَ عَلَى ٱللَّهِ ٱلۡكَذِبَۖ وَأَكۡثَرُهُمۡ لَا يَعۡقِلُونَ","category":["5 (Al-Ma'idah)","Al-Ma'idah","Surah Al-Ma'idah","Chapter Al-Ma'idah","Ma'idah","Surah Ma'idah","Chapter Ma'idah","Al Ma'idah","Surah Al Ma'idah","Chapter Al Ma'idah","Surah 5","Chapter 5","The Table Spread","المَائدة"],"ayahNumber":772,"juzNumber":7,"footnotes":"(1) یہ ان جانوروں کی قسمیں ہیں جو اہل عرب اپنے بتوں کی نذر کر دیا کرتے تھے۔ ان کی مختلف تفسیریں کی گئی ہیں۔ حضرت سعید بن مسیب (رحمۃ اللہ علیہ) سے صحیح بخاری میں اس کی تفسیر حسب ذیل نقل کی گئی ہے۔”بَحِيرَةٍ“: وہ جانور، جس کا دودھ دوہنا چھوڑ دیا جاتا اور کہا جاتا کہ یہ بتوں کے لئے ہے۔ چنانچہ کوئی شخص اس کے تھنوں کو ہاتھ نہ لگاتا۔ ”سَآئِبَة“: وہ جانور، جسے وہ بتوں کے لئے آزاد چھوڑ دیتے تھے، اسے نہ سواری کے لئے استعمال کرتے نہ باربرداری کے لئے۔ ”وَصِيلَةٍ“: وہ اونٹنی، جس سے پہلی مرتبہ مادہ پیدا ہوتی اور اس کے بعد پھر دوبارہ بھی مادہ ہی پیدا ہوتی۔ (یعنی ایک مادہ کے بعد دوسری مادہ مل گئی، ان کے درمیان کسی نر سے تفریق نہیں ہوئی) ایسی اونٹنی کو بھی وہ بتوں کے لئے آزاد چھوڑ دیتے تھے اور ”حَامٍ“: وہ نر اونٹ، جس کی نسل سے کئی بچے ہوچکے ہوتے۔ (اور نسل کافی بڑھ جاتی) تو اس سے بھی باربرداری یا سواری کا کام نہ لیتے اور بتوں کے لئے چھوڑ دیتے اور اسے وہ حامی کہتے۔ اسی روایت میں یہ حدیث بھی بیان کی گئی ہے کہ سب سے پہلے بتوں کے جانور آزاد چھوڑنے والا شخص عمروبن عامر خزاعی تھا۔ نبی (صلى الله عليه وسلم) فرماتے ہیں کہ میں نے اسے جہنم میں انتڑیاں کھینچتے ہوئے دیکھا (صحيح بخاري- تفسير سورة المائدة) آیت میں کہا گیا ہے کہ اللہ تعالیٰ نے ان جانوروں کو اس طرح مشروع نہیں کیا ہے، کیونکہ اس نے تو نذر ونیاز صرف اپنے لئے خاص کر رکھی ہے۔ بتوں کے لئے نذرونیاز کے طریقے مشرکوں نے ایجاد کئے ہیں اور بتوں اور معبودان باطل کے نام پر جانور چھوڑنے اور نذر نیاز پیش کرنے کا یہ سلسلہ آج بھی مشرکوں میں بلکہ بہت سے نام نہاد مسلمانوں میں بھی قائم و جاری ہے۔ أَعَاذَنَا اللهُ مِنْهُ۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"mā jaʿala al-lahu min baḥīratin walā sāibatin walā waṣīlatin walā ḥāmin walākinna alladhīna kafarū yaftarūna ʿalā al-lahi al-kadhiba wa-aktharuhum lā yaʿqilūna ","translations":["Not","has (been) made","(by) Allah","of","a Bahirah","and not","a Saibah","and not","a Wasilah","and not","a Hami","[And] but","those who","disbelieved","they invent","against","Allah","the lie","and most of them","(do) not","use reason","(103)"],"transliterationArr":["mā","jaʿala","al-lahu","min","baḥīratin","walā","sāibatin","walā","waṣīlatin","walā","ḥāmin","walākinna","alladhīna","kafarū","yaftarūna","ʿalā","al-lahi","al-kadhiba","wa-aktharuhum","lā","yaʿqilūna",null],"verseTiming":[[1,0,620],[2,620,1190],[3,1190,2130],[4,2130,3110],[5,3110,5030],[6,5030,5570],[7,5570,8700],[8,8700,9260],[9,9260,10970],[10,10970,11480],[11,11480,12700],[12,12700,14260],[13,14260,15350],[14,15350,16240],[15,16240,17440],[16,17440,17860],[17,17860,18800],[18,18800,19680],[19,19680,21090],[20,21090,21510],[21,21510,24545]]}}