{"name":"5:117","price":"میں نے تو ان سے اور کچھ نہیں کہا مگر صرف وہی جو تو نے مجھ سے کہنے کو فرمایا تھا کہ تم اللہ کی بندگی اختیار کرو جو میرا بھی رب ہے اور تمہارا بھی رب ہے(1) ۔ میں ان پر گواه رہا جب تک ان میں رہا۔ پھر جب تو نے مجھ کو اٹھا لیا تو، تو ہی ان پر مطلع رہا(2)۔ اور تو ہر چیز کی پوری خبر رکھتا ہے۔","arabic":"مَا قُلۡتُ لَهُمۡ إِلَّا مَآ أَمَرۡتَنِي بِهِۦٓ أَنِ ٱعۡبُدُواْ ٱللَّهَ رَبِّي وَرَبَّكُمۡۚ وَكُنتُ عَلَيۡهِمۡ شَهِيدٗا مَّا دُمۡتُ فِيهِمۡۖ فَلَمَّا تَوَفَّيۡتَنِي كُنتَ أَنتَ ٱلرَّقِيبَ عَلَيۡهِمۡۚ وَأَنتَ عَلَىٰ كُلِّ شَيۡءٖ شَهِيدٌ","category":["5 (Al-Ma'idah)","Al-Ma'idah","Surah Al-Ma'idah","Chapter Al-Ma'idah","Ma'idah","Surah Ma'idah","Chapter Ma'idah","Al Ma'idah","Surah Al Ma'idah","Chapter Al Ma'idah","Surah 5","Chapter 5","The Table Spread","المَائدة"],"ayahNumber":786,"juzNumber":7,"footnotes":"(1) حضرت عیسیٰ (عليه السلام) نے توحید وعبادت رب کی یہ دعوت عالم شیرخوارگی میں بھی دی، جیسا کہ سورۂ مریم میں ہے اور عمر جوانی وکہولت میں بھی۔\n(2) ”تَوَفَّيْتَنِي“ کا مطلب ہے جب تو نے مجھے دنیا سے اٹھا لیا جیسا کہ اس کی تفصیل سورۃ آل عمران کی آیت 55 میں گزرچکی ہے۔ اس سے یہ بات بھی معلوم ہوئی کہ پیغمبروں کو اتنا ہی علم ہوتا ہے جتنا اللہ کی طرف سے انہیں عطا کیا جاتا ہے یا جس کا مشاہدہ وہ اپنی زندگی میں اپنی آنکھوں سے کرتے ہیں۔ ان کے علاوہ ان کو کسی بات کا علم نہیں ہوتا۔ جب کہ عالم الغیب وہ ہوتا ہے جسے بغیر کسی کے بتلائے ہر چیز کا علم ہوتا ہے اور اس کا علم ازل سے ابد تک پر محیط ہوتا ہے۔ یہ صفت علم اللہ کے سوا کسی اور کے اندر نہیں۔ اس لئے عالم الغیب صرف ایک اللہ ہی کی ذات ہے۔ اس کے علاوہ کوئی عالم الغیب نہیں۔ حدیث میں آتا ہے کہ میدان محشر میں نبی (صلى الله عليه وسلم) کی طرف آپ کے کچھ امتی آنے لگیں گے تو فرشتے ان کو پکڑ کر دوسری طرف لے جائیں گے، آپ (صلى الله عليه وسلم) فرمائیں گے ان کو آنے دو یہ تو میرے امتی ہیں، فرشتے آپ کو بتلائیں گے ”إِنَّكَ لا تَدْرِي مَا أَحْدَثُوا بَعْدَكَ“ (اے محمد! (صلى الله عليه وسلم)) آپ ج نہیں جانتے کہ آپ کے بعد انہوں نے دین میں کیا کیا بدعتیں ایجاد کیں جب آپ یہ سنیں گے، تو آپ (صلى الله عليه وسلم) نے فرمایا کہ میں بھی اس وقت یہی کہوں گا جو العبد الصالح (حضرت عیسیٰ علیہ السلام نے کہا ”وَكُنْتُ عَلَيْهِمْ شَهِيدًا مَا دُمْتُ فِيهِمْ فَلَمَّا تَوَفَّيْتَنِي كُنْتَ أَنْتَ الرَّقِيبَ عَلَيْهِمْ“ (صحيح بخاري، تفسير سورة المائدة وكتاب الأنبياء- صحيح مسلم، باب فناء الدنيا وبيان الحشر يوم القيامة)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"mā qul'tu lahum illā mā amartanī bihi ani uʿ'budū al-laha rabbī warabbakum wakuntu ʿalayhim shahīdan mā dum'tu fīhim falammā tawaffaytanī kunta anta al-raqība ʿalayhim wa-anta ʿalā kulli shayin shahīdun ","translations":["Not","I said","to them","except","what","You commanded me","[with it]","that","You worship","Allah","my Lord","and your Lord","And I was","over them","a witness","that","as long as I","(was) among them","then when","You raised me","You were","[You]","the Watcher","over them","and You","(are) on","every","thing","a Witness","(117)"],"transliterationArr":["mā","qul'tu","lahum","illā","mā","amartanī","bihi","ani","uʿ'budū","al-laha","rabbī","warabbakum","wakuntu","ʿalayhim","shahīdan","mā","dum'tu","fīhim","falammā","tawaffaytanī","kunta","anta","al-raqība","ʿalayhim","wa-anta","ʿalā","kulli","shayin","shahīdun",null],"verseTiming":[[1,0,520],[2,520,1880],[3,1880,2800],[4,2800,4280],[5,4280,5560],[6,5560,7350],[7,7350,7720],[8,7720,8700],[9,8700,9270],[10,9270,10170],[11,10170,11980],[12,11980,13490],[13,13490,14500],[14,14500,15410],[15,15410,16600],[16,16600,17290],[17,17290,18610],[18,18610,20100],[19,20100,21870],[20,21870,23330],[21,23330,24560],[22,24560,25700],[23,25700,27160],[24,27160,28770],[25,28770,29450],[26,29450,30120],[27,30120,31910],[28,31910,34075]]}}