{"name":"5:112","price":"وه وقت یاد کے قابل ہے جب کہ حواریوں نے عرض کیا کہ اے عیسیٰ بن مریم! کیا آپ کا رب ایسا کرسکتا ہے کہ ہم پر آسمان سے ایک خوان ﴿دسترخوان﴾ نازل فرما دے؟(1) آپ نے فرمایا کہ اللہ سے ڈرو اگر تم ایمان والے ہو۔(2)","arabic":"إِذۡ قَالَ ٱلۡحَوَارِيُّونَ يَٰعِيسَى ٱبۡنَ مَرۡيَمَ هَلۡ يَسۡتَطِيعُ رَبُّكَ أَن يُنَزِّلَ عَلَيۡنَا مَآئِدَةٗ مِّنَ ٱلسَّمَآءِۖ قَالَ ٱتَّقُواْ ٱللَّهَ إِن كُنتُم مُّؤۡمِنِينَ","category":["5 (Al-Ma'idah)","Al-Ma'idah","Surah Al-Ma'idah","Chapter Al-Ma'idah","Ma'idah","Surah Ma'idah","Chapter Ma'idah","Al Ma'idah","Surah Al Ma'idah","Chapter Al Ma'idah","Surah 5","Chapter 5","The Table Spread","المَائدة"],"ayahNumber":781,"juzNumber":7,"footnotes":"”مَائِدَةً“ ایسے برتن (سینی، پلیٹ یا ٹرے وغیرہ) کو کہتے ہیں جس میں کھانا ہو۔ اسی لئے دسترخوان بھی اس کا ترجمہ کرلیا جاتا ہے کیونکہ اس پر بھی کھانا چنا ہوتا ہے۔ سورت کا نام بھی اسی مناسبت سے ہے کہ اس میں اس کا ذکر ہے حَوَارِيِّينَ نے مزید اطمینان قلب کے لئے یہ مطالبہ کیا جس طرح حضرت ابراہیم (عليه السلام) نے احیائے موتی کے مشاہدے کی خواہش ظاہر فرمائی تھی۔\n(2) یعنی یہ سوال مت کرو، ممکن ہے یہ تمہاری آزمائش کا سبب بن جائے کیونکہ حسب طلب معجزہ دکھائے جانے کے بعد اس قوم کی طرف سے ایمان میں کمزوری عذاب کا باعث بن سکتی ہے۔ اس لئے حضرت عیسیٰ (عليه السلام) نے انہیں اس مطالبے سے روکا اور انہیں اللہ سے ڈرایا۔\nاس سے معلوم ہوا کہ جن لوگوں نے وحی کے لفظ سے یہ استدلال کیا ہے کہ حضرت موسیٰ علیہ السلام کی والدہ اور حضرت مریم نَبِيَّةٌ تھیں، اس لئے کہ ان پر بھی اللہ کی طرف سے وحی آئی تھی، صحیح نہیں۔ اس لئے کہ یہ وحی، وحی الہام ہی تھی، جیسے یہاں «أَوْحَيْتُ إِلَى الْحَوَارِيِّينَ» میں ہے یہ وحی رسالت نہیں ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"idh qāla al-ḥawāriyūna yāʿīsā ib'na maryama hal yastaṭīʿu rabbuka an yunazzila ʿalaynā māidatan mina al-samāi qāla ittaqū al-laha in kuntum mu'minīna ","translations":["When","said","the disciples","O Isa","son","(of) Maryam","Is","able","your Lord","to","send down","to us","a table spread","from","the heaven","He said","Fear","Allah","if","you are","believers","(112)"],"transliterationArr":["idh","qāla","al-ḥawāriyūna","yāʿīsā","ib'na","maryama","hal","yastaṭīʿu","rabbuka","an","yunazzila","ʿalaynā","māidatan","mina","al-samāi","qāla","ittaqū","al-laha","in","kuntum","mu'minīna",null],"verseTiming":[[1,0,690],[2,690,1240],[3,1240,3080],[4,3080,4270],[5,4270,4780],[6,4780,5530],[7,5530,6020],[8,6020,7360],[9,7360,8160],[10,8160,8440],[11,8440,10090],[12,10090,11090],[13,11090,13480],[14,13480,14510],[15,14510,17119],[16,17119,18079],[17,18079,18729],[18,18729,19599],[19,19599,20869],[20,20869,22409],[21,22409,25964]]}}