{"name":"5:114","price":"عیسیٰ ابن مریم نے دعا کی کہ اے اللہ اے ہمارے پروردگار! ہم پر آسمان سے کھانا نازل فرما! کہ وه ہمارے لئے یعنی ہم میں جو اول ہیں اور جو بعد کے ہیں سب کے لئے ایک خوشی کی بات ہوجائے(1) اور تیری طرف سے ایک نشانی ہوجائے اور تو ہم کو رزق عطا فرمادے اور تو سب عطا کرنے والوں سے اچھا ہے۔","arabic":"قَالَ عِيسَى ٱبۡنُ مَرۡيَمَ ٱللَّهُمَّ رَبَّنَآ أَنزِلۡ عَلَيۡنَا مَآئِدَةٗ مِّنَ ٱلسَّمَآءِ تَكُونُ لَنَا عِيدٗا لِّأَوَّلِنَا وَءَاخِرِنَا وَءَايَةٗ مِّنكَۖ وَٱرۡزُقۡنَا وَأَنتَ خَيۡرُ ٱلرَّٰزِقِينَ","category":["5 (Al-Ma'idah)","Al-Ma'idah","Surah Al-Ma'idah","Chapter Al-Ma'idah","Ma'idah","Surah Ma'idah","Chapter Ma'idah","Al Ma'idah","Surah Al Ma'idah","Chapter Al Ma'idah","Surah 5","Chapter 5","The Table Spread","المَائدة"],"ayahNumber":783,"juzNumber":7,"footnotes":"(1) اسلامی شریعتوں میں عید کا مطلب یہ نہیں رہا ہے کہ قومی تہوار کا ایک دن ہو جس میں تمام اخلاقی قیود اور شریعت کے ضابطوں کو پامال کرتے ہوئے بےہنگم طریقے سے طرب ومسرت کا اظہار کیا جائے، چراغاں کیا جائے اور جشن منایا جائے، جیسا کہ آج کل اس کا یہی مفہوم سمجھ لیا گیا ہے اور اسی کے مطابق تہوار منائے جاتے ہیں۔ بلکہ آسمانی شریعتوں میں اس کی حیثیت ایک ملی تقریب کی ہوتی ہے، جس کا اہم مقصد یہ ہوتا ہے کہ اس روز پوری ملت اجتماعی طور پر اللہ تعالیٰ کا شکر ادا کرے اور اس کی تکبیر وتحمید کے زمزمے بلند کرے۔ یہاں بھی حضرت عیسیٰعلیہ السلام نے اس دن کو عید بنانے کی جس خواہش کا اظہار کیا ہے اس سے ان کا مطلب یہی ہے کہ ہم تعریف وتمجید اور تکبیر وتحمید کریں۔ بعض اہل بدعت اس عید مائدہ سے عید میلاد کا جواز ثابت کرتے ہیں۔ حالانکہ اول تو یہ ہماری شریعت سے پہلے کی شریعت کا واقعہ ہے، جسے اگر اسلام برقرار رکھنا چاہتا تو وضاحت کردی جاتی۔ دوسرے یہ پیغمبر کی زبان سے عید بنانے کی خواہش کا اظہار ہوا تھا اور پیغمبر بھی اللہ کے حکم سے شرعی احکام بیان کرنے کا مجاز ہوتا ہے۔ تیسرے عید کا مفہوم ومطلب بھی وہ ہوتا ہے جو مذکورہ بالا سطروں میں بیان کیا گیا ہے۔ جب کہ عید میلاد میں ان میں سے کوئی بات بھی نہیں ہے۔ لہذا عید میلاد کے بدعت ہونے میں کوئی شک وشبہ نہیں ہے۔ اسلام میں صرف دو ہی عیدیں ہیں جو اسلام نے مقرر کی ہیں، عیدالفطر اور عیدالاضحیٰ۔ ان کے علاوہ کوئی تیسری عید نہیں ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qāla ʿīsā ub'nu maryama al-lahuma rabbanā anzil ʿalaynā māidatan mina al-samāi takūnu lanā ʿīdan li-awwalinā waākhirinā waāyatan minka wa-ur'zuq'nā wa-anta khayru al-rāziqīna ","translations":["Said","Isa","son","(of) Maryam","O Allah","our Lord","send down","to us","a table spread","from","the heaven","to be","for us","a festival","for first of us","and last of us","and a sign","from You","And provide us","and You","(are) best","(of) the providers","(114)"],"transliterationArr":["qāla","ʿīsā","ub'nu","maryama","al-lahuma","rabbanā","anzil","ʿalaynā","māidatan","mina","al-samāi","takūnu","lanā","ʿīdan","li-awwalinā","waākhirinā","waāyatan","minka","wa-ur'zuq'nā","wa-anta","khayru","al-rāziqīna",null],"verseTiming":[[1,0,840],[2,840,1410],[3,1410,1880],[4,1880,2670],[5,2670,4660],[6,4660,6140],[7,6140,8500],[8,8500,9650],[9,9650,12010],[10,12010,13200],[11,13200,15479],[12,15479,16359],[13,16359,17039],[14,17039,18579],[15,18579,19419],[16,19419,20129],[17,20129,20799],[18,20799,22449],[19,22449,23929],[20,23929,25069],[21,25069,27688],[22,27688,29238],[23,29238,30778],[24,30778,31408],[25,31408,34483]]}}