{"name":"5:11","price":"اے ایمان والو! اللہ تعالیٰ نے جو احسان تم پر کیا ہے اسے یاد کرو جب کہ ایک قوم نے تم پر دست درازی کرنی چاہی تو اللہ تعالیٰ نے ان کے ہاتھوں کو تم تک پہنچنے سے روک دیا(1) اور اللہ تعالیٰ سے ڈرتے رہو اور مومنوں کو اللہ تعالیٰ ہی پر بھروسہ کرنا چاہئے۔","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱذۡكُرُواْ نِعۡمَتَ ٱللَّهِ عَلَيۡكُمۡ إِذۡ هَمَّ قَوۡمٌ أَن يَبۡسُطُوٓاْ إِلَيۡكُمۡ أَيۡدِيَهُمۡ فَكَفَّ أَيۡدِيَهُمۡ عَنكُمۡۖ وَٱتَّقُواْ ٱللَّهَۚ وَعَلَى ٱللَّهِ فَلۡيَتَوَكَّلِ ٱلۡمُؤۡمِنُونَ","category":["5 (Al-Ma'idah)","Al-Ma'idah","Surah Al-Ma'idah","Chapter Al-Ma'idah","Ma'idah","Surah Ma'idah","Chapter Ma'idah","Al Ma'idah","Surah Al Ma'idah","Chapter Al Ma'idah","Surah 5","Chapter 5","The Table Spread","المَائدة"],"ayahNumber":680,"juzNumber":6,"footnotes":"(1) اس کی شان نزول میں مفسرین نے متعدد واقعات بیان کئے ہیں۔ مثلاً اس اعرابی کا واقعہ کہ رسول اللہ (صلى الله عليه وسلم) ایک سفر سے واپسی پر ایک درخت کے سائے میں آرام فرما تھے، تلوار درخت سے لٹکی ہوئی تھی۔ اس اعرابی نے تلوار پکڑ کر آپ (صلى الله عليه وسلم) پر سونت لی اور کہنے لگا۔ اے محمد! (صلى الله عليه وسلم) آپ کو مجھ سے کون بچائے گا؟ آپ (صلى الله عليه وسلم) نے بلا تامل فرمایا ”اللہ“ (یعنی اللہ بچائے گا) یہ کہنا تھا کہ تلوار اس کے ہاتھ سے گر گئی۔ بعض کہتے ہیں کہ کعب بن اشرف اور اس کے ساتھیوں نے نبی کریم (صلى الله عليه وسلم) اور آپ کے اصحاب کے خلاف، جب کہ آپ (صلى الله عليه وسلم) وہاں تشریف فرما تھے، دھوکہ اور فریب سے نقصان پہنچانے کی سازش تیار کی تھی، جس سے اللہ تعالیٰ نے آپ (صلى الله عليه وسلم) کوبچایا۔ بعض کہتے ہیں کہ ایک مسلمان کے ہاتھوں غلط فہمی سے جو دو عامری شخص قتل ہوگئے تھے، ان کی دیت کی ادائیگی میں یہودیوں کے قبیلے بنونضیر سے حسب معاہدہ جو تعاون لینا تھا، اس کے لئے نبی کریم (صلى الله عليه وسلم) اپنے رفقا سمیت وہاں تشریف لے گئے اور ایک دیوار سے ٹیک لگا کر بیٹھ گئے۔ انہوں نے یہ سازش تیار کی کہ اوپر سے چکی کا پتھر آپ (صلى الله عليه وسلم) پر گرا دیا جائے، جس سے اللہ تعالیٰ نے آپ (صلى الله عليه وسلم) کو بذریعہ وحی مطلع فرما دیا۔ ممکن ہے کہ ان سارے ہی واقعات کے بعد یہ آیت نازل ہوئی ہو۔ کیونکہ ایک آیت کے نزول کے کئی اسباب و عوامل ہوسکتے ہیں۔ (تفسیر ابن کثیر، ایسرالتفاسیر و فتح القدیر)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāayyuhā alladhīna āmanū udh'kurū niʿ'mata al-lahi ʿalaykum idh hamma qawmun an yabsuṭū ilaykum aydiyahum fakaffa aydiyahum ʿankum wa-ittaqū al-laha waʿalā al-lahi falyatawakkali al-mu'minūna ","translations":["O you","who","believe","Remember","(the) Favor","(of) Allah","upon you","when","determined","a people","that","they stretch","towards you","their hands","but He restrained","their hands","from you","And fear","Allah","And upon","Allah","so let put the trust","the believers","(11)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","udh'kurū","niʿ'mata","al-lahi","ʿalaykum","idh","hamma","qawmun","an","yabsuṭū","ilaykum","aydiyahum","fakaffa","aydiyahum","ʿankum","wa-ittaqū","al-laha","waʿalā","al-lahi","falyatawakkali","al-mu'minūna",null],"verseTiming":[[1,0,2950],[2,2950,3930],[3,3930,4810],[4,4810,5610],[5,5610,6510],[6,6510,7330],[7,7330,8380],[8,8380,8750],[9,8750,10160],[10,10160,12490],[11,12490,12800],[12,12800,14070],[13,14070,14910],[14,14910,15780],[15,15780,17790],[16,17790,18830],[17,18830,20020],[18,20020,20950],[19,20950,22130],[20,22130,24050],[21,24050,24810],[22,24810,27570],[23,27570,28180],[24,28180,28980],[25,28980,30670],[26,30670,33435]]}}