{"name":"5:115","price":"حق تعالیٰ نے ارشاد فرمایا کہ میں وه کھانا تم لوگوں پر نازل کرنے واﻻ ہوں، پھر جو شخص تم میں سے اس کے بعد ناحق شناسی کرے گا تو میں اس کو ایسی سزا دوں گا کہ وه سزا دنیا جہان والوں میں سے کسی کو نہ دوں گا۔(1)","arabic":"قَالَ ٱللَّهُ إِنِّي مُنَزِّلُهَا عَلَيۡكُمۡۖ فَمَن يَكۡفُرۡ بَعۡدُ مِنكُمۡ فَإِنِّيٓ أُعَذِّبُهُۥ عَذَابٗا لَّآ أُعَذِّبُهُۥٓ أَحَدٗا مِّنَ ٱلۡعَٰلَمِينَ","category":["5 (Al-Ma'idah)","Al-Ma'idah","Surah Al-Ma'idah","Chapter Al-Ma'idah","Ma'idah","Surah Ma'idah","Chapter Ma'idah","Al Ma'idah","Surah Al Ma'idah","Chapter Al Ma'idah","Surah 5","Chapter 5","The Table Spread","المَائدة"],"ayahNumber":784,"juzNumber":7,"footnotes":"(1) یہ ”مَائِدَةٌ“ (خوان طعام) آسمان سے اترا یا نہیں؟ اس کی بابت کوئی صحیح اور صریح مرفوع حدیث نہیں۔ جمہور علماء (امام شوکانی اور امام ابن جریر طبری سمیت) اس کے نزول کے قائل ہیں اور ان کا استدلال قرآن کے الفاظ ”إِنِّي مُنَزِّلُهَا عَلَيْكُمْ“ سے ہے کہ یہ اللہ کا وعدہ ہے جو یقیناً سچا ہے لیکن اسے اللہ کی طرف سے یقینی وعدہ قرار دینا اس لئے صحیح نہیں معلوم ہوتا کہ اگلے الفاظ ”فَمَنْ يَكْفُرْ“ اس وعدے کو مشروط ہونے کو ظاہر کرتے ہیں۔ اس لئے دوسرے علماء کہتے ہیں کہ اللہ تعالیٰ کی طرف سے یہ شرط سن کر انہوں نے کہا کہ پھر ہمیں اس کی ضرورت نہیں۔ جس کے بعد اس کا نزول نہیں ہوا۔ امام ابن کثیر نے ان آثار کی اسانید کو جو امام مجاہد اور حضرت حسن بصری سے منقول ہیں، صحیح قرار دیا ہے۔ نیز کہا ہے کہ ان آثار کی تائید اس بات سے بھی ہوتی ہے کہ نزول مائدہ کی کوئی شہرت عیسائیوں میں ہے، نہ ان کی کتابوں میں درج ہے۔ حالانکہ اگر یہ نازل ہوا ہوتا تو اسے ان کے ہاں مشہور بھی ہونا چاہئے تھا اور کتابوں میں بھی تواتر سے یا کم از کم آحاد سے نقل ہونا چاہئے تھا۔ واللهُ أَعْلَمُ بِالصَّوَابِ۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qāla al-lahu innī munazziluhā ʿalaykum faman yakfur baʿdu minkum fa-innī uʿadhibuhu ʿadhāban lā uʿadhibuhu aḥadan mina al-ʿālamīna ","translations":["Said","Allah","Indeed I","(will) send it down","to you","then whoever","disbelieves","after (that)","among you","then indeed I","[I] will punish him","(with) a punishment","not","I have punished","anyone","among","the worlds","(115)"],"transliterationArr":["qāla","al-lahu","innī","munazziluhā","ʿalaykum","faman","yakfur","baʿdu","minkum","fa-innī","uʿadhibuhu","ʿadhāban","lā","uʿadhibuhu","aḥadan","mina","al-ʿālamīna",null],"verseTiming":[[1,0,720],[2,720,1700],[3,1700,3350],[4,3350,4860],[5,4860,6380],[6,6380,6930],[7,6930,8270],[8,8270,9040],[9,9040,10530],[10,10530,13700],[11,13700,15380],[12,15380,18400],[13,18400,19790],[14,19790,20980],[15,20980,22980],[16,22980,25590],[17,25590,26560],[18,26560,27490],[19,27490,30695]]}}