{"name":"5:118","price":"اگر تو ان کو سزا دے تو یہ تیرے بندے ہیں اور اگر تو ان کو معاف فرما دے تو، تو زبردست ہے حکمت واﻻ ہے۔(1)","arabic":"إِن تُعَذِّبۡهُمۡ فَإِنَّهُمۡ عِبَادُكَۖ وَإِن تَغۡفِرۡ لَهُمۡ فَإِنَّكَ أَنتَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","category":["5 (Al-Ma'idah)","Al-Ma'idah","Surah Al-Ma'idah","Chapter Al-Ma'idah","Ma'idah","Surah Ma'idah","Chapter Ma'idah","Al Ma'idah","Surah Al Ma'idah","Chapter Al Ma'idah","Surah 5","Chapter 5","The Table Spread","المَائدة"],"ayahNumber":787,"juzNumber":7,"footnotes":"(1) یعنی مطلب یہ کہ یا اللہ! ان کا معاملہ تیری مشیت کے سپرد ہے، اس لئے کہ تو فَعَّالٌ لما يُرِيدُ بھی ہے، (جو چاہے کر سکتا ہے) اور تجھ سے کوئی بازپرس کرنے والا بھی نہیں ہے۔ لا يُسْأَلُ عَمَّا يَفْعَلُ وَهُمْ يُسْأَلُونَ (الأنبياء: 23 ) اللہ جو کچھ کرتا ہے، اس سے بازپرس نہیں ہوگی، لوگوں سے ان کے کاموں کی باز پرس ہوگی۔ گویا آیت میں اللہ کے سامنے بندوں کی عاجزی و بےبسی کا اظہار بھی ہے اور اللہ کی عظمت وجلالت اور اس کے قادر مطلق اور مختار کل ہونے کا بیان بھی اور پھر ان دونوں باتوں کے حوالے سے عفوومغفرت کی التجا بھی۔ سبحان اللہ! کیسی عجیب وبلیغ آیت ہے۔ اسی لئے حدیث میں آتا ہے کہ ایک رات نبی (صلى الله عليه وسلم) پر نوافل میں اس آیت کو پڑھتے ہوئے ایسی کیفیت طاری ہوئی کہ بار بار ہر رکعت میں اسے ہی پڑھتے رہے، حتیٰ کہ صبح ہوگئی۔ (مسند احمد جلد 5، ص 149)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"in tuʿadhib'hum fa-innahum ʿibāduka wa-in taghfir lahum fa-innaka anta al-ʿazīzu al-ḥakīmu ","translations":["If","You punish them","then indeed they","(are) Your slaves","and if","You forgive","[for] them","then indeed You","You","(are) the All-Mighty","the All-Wise","(118)"],"transliterationArr":["in","tuʿadhib'hum","fa-innahum","ʿibāduka","wa-in","taghfir","lahum","fa-innaka","anta","al-ʿazīzu","al-ḥakīmu",null],"verseTiming":[[1,0,800],[2,800,2660],[3,2660,4660],[4,4660,6140],[5,6140,7300],[6,7300,8110],[7,8110,8830],[8,8830,10570],[9,10570,12100],[10,12100,13240],[11,13240,15805]]}}