{"name":"5:13","price":"پھر ان کی عہد شکنی کی وجہ سے ہم نے ان پر اپنی لعنت نازل فرمادی اور ان کے دل سخت کردیئے کہ وه کلام کو اس کی جگہ سے بدل ڈالتے ہیں(1) اور جو کچھ نصیحت انہیں کی گئی تھی اس کا بہت بڑا حصہ بھلا بیٹھے(2)، ان کی ایک نہ ایک خیانت پر تجھے اطلاع ملتی ہی رہے گی(3) ہاں تھوڑے سے ایسے نہیں بھی ہیں(4) پس توانہیں معاف کرتا جا اور درگزر کرتا ره(5)، بےشک اللہ تعالیٰ احسان کرنے والوں سے محبت کرتا ہے۔","arabic":"فَبِمَا نَقۡضِهِم مِّيثَٰقَهُمۡ لَعَنَّٰهُمۡ وَجَعَلۡنَا قُلُوبَهُمۡ قَٰسِيَةٗۖ يُحَرِّفُونَ ٱلۡكَلِمَ عَن مَّوَاضِعِهِۦ وَنَسُواْ حَظّٗا مِّمَّا ذُكِّرُواْ بِهِۦۚ وَلَا تَزَالُ تَطَّلِعُ عَلَىٰ خَآئِنَةٖ مِّنۡهُمۡ إِلَّا قَلِيلٗا مِّنۡهُمۡۖ فَٱعۡفُ عَنۡهُمۡ وَٱصۡفَحۡۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُحۡسِنِينَ","category":["5 (Al-Ma'idah)","Al-Ma'idah","Surah Al-Ma'idah","Chapter Al-Ma'idah","Ma'idah","Surah Ma'idah","Chapter Ma'idah","Al Ma'idah","Surah Al Ma'idah","Chapter Al Ma'idah","Surah 5","Chapter 5","The Table Spread","المَائدة"],"ayahNumber":682,"juzNumber":6,"footnotes":"(1) یعنی اتنے انتظامات اور عہد مواعید کے باوجود بنو اسرائیل نے عہد شکنی کی، جس کی بنا پر وہ لعنت الٰہی کے مستحق بنے۔ اس لعنت کے دنیوی نتائج یہ سامنے آئے کہ ایک، ان کے دل سخت کردیئے گئے جس سے ان کے دل اثر پذیری سے محروم ہوگئے اور انبیاء کے وعظ و نصیحت ان کے لئے بےکار ہوگئے، دوسرے، یہ کہ وہ کلمات الٰہی میں تحریف کرنے لگ گئے۔ یہ تحریف لفظی اور معنوی دونوں طرح کی ہوتی تھی جو اس بات کی دلیل تھی کہ ان کی عقل و فہم میں کجی آگئی ہے اور ان کی جسارتوں میں بھی بےپناہ اضافہ ہوگیا ہے کہ اللہ کی آیتوں تک میں تصرف کرنے سے انہیں گریز نہیں۔ بدقسمتی اس قساوت قلبی اور کلمات الٰہی میں تحریف سے امت محمدیہ کے افراد بھی محفوظ نہیں رہے۔ مسلمان کہلانے والے عوام نہیں خواص بھی، جہلاء ہی نہیں علماء بھی، ایسے مقام پر پہنچ چکے ہیں کہ وعظ و نصیحت اور احکام الٰہی کی یاد دہانی ان کے لئے بےکار ہے، وہ سن کر ان سے ذرا اثر قبول نہیں کرتے اور جن غفلتوں اور کوتاہیوں کا وہ شکار ہیں، ان سے تائب نہیں ہوتے۔ اسی طرح اپنی بدعات، خودساختہ مزعومات اور اپنے تاویلات باطلہ کے اثبات کے لئے کلام الٰہی میں تحریف کر ڈالتے ہیں۔\n(2) یہ تیسرا نتیجہ ہے اور اس کا مطلب یہ ہے کہ احکام الٰہی پر عمل کرنے میں انہیں کوئی رغبت اور دلچسپی نہیں رہی بلکہ بےعملی اور بدعملی ان کا شعار بن گئی اور وہ پستی کے اس مقام پر پہنچ گئے کہ ان کے دل سلیم رہے نہ ان کی فطرت مستقیم۔\n(3) یعنی شذر، خیانت اور مکر، ان کے کردار کا جزو بن گیا ہے جس کے نمونے ہر وقت آپ کے سامنے آتے رہیں گے۔\n(4) یہ تھوڑے سے لوگ وہی ہیں جو یہودیوں میں سے مسلمان ہوگئے تھے اور ان کی تعداد دس سے بھی کم تھی۔\n(5) عفو و درگزر کا یہ حکم اس وقت دیا گیا تھا، جب لڑنے کی اجازت نہیں تھی۔ بعد میں اس کی جگہ حکم دیا گیا «قَاتِلُوا الَّذِينَ لا يُؤْمِنُونَ بِاللَّهِ وَلا بِالْيَوْمِ الآخِرِ» (التوبہ: 29)”ان لوگوں سے جنگ کرو جو اللہ پر اور یوم آخرت پر ایمان نہیں رکھتے“۔ بعض کے نزدیک عفو و درگزر کا یہ حکم منسوخ نہیں ہے۔ یہ بجائے خود ایک اہم حکم ہے، حالات و ظروف کے مطابق اسے بھی اختیار کیا جاسکتا ہے اور اس سے بھی بعض دفعہ وہ نتائج حاصل ہوجاتے ہیں جن کے لئے قتال کا حکم ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"fabimā naqḍihim mīthāqahum laʿannāhum wajaʿalnā qulūbahum qāsiyatan yuḥarrifūna al-kalima ʿan mawāḍiʿihi wanasū ḥaẓẓan mimmā dhukkirū bihi walā tazālu taṭṭaliʿu ʿalā khāinatin min'hum illā qalīlan min'hum fa-uʿ'fu ʿanhum wa-iṣ'faḥ inna al-laha yuḥibbu al-muḥ'sinīna ","translations":["So for","their breaking","(of) their covenant","We cursed them","and We made","their hearts","hard","They distort","the words","from","their places","and forgot","a part","of what","they were reminded","of [it]","And not","will you cease","to discover","of","treachery","from them","except","a few","of them","But forgive","them","and overlook","Indeed","Allah","loves","the good-doers","(13)"],"transliterationArr":["fabimā","naqḍihim","mīthāqahum","laʿannāhum","wajaʿalnā","qulūbahum","qāsiyatan","yuḥarrifūna","al-kalima","ʿan","mawāḍiʿihi","wanasū","ḥaẓẓan","mimmā","dhukkirū","bihi","walā","tazālu","taṭṭaliʿu","ʿalā","khāinatin","min'hum","illā","qalīlan","min'hum","fa-uʿ'fu","ʿanhum","wa-iṣ'faḥ","inna","al-laha","yuḥibbu","al-muḥ'sinīna",null],"verseTiming":[[1,0,970],[2,970,2040],[3,2040,3930],[4,3930,6160],[5,6160,7300],[6,7300,8610],[7,8610,9990],[8,9990,11380],[9,11380,12140],[10,12140,12500],[11,12500,14480],[12,14480,15170],[13,15170,15850],[14,15850,18020],[15,18020,19080],[16,19080,19890],[17,19890,20460],[18,20460,21290],[19,21290,22370],[20,22370,22890],[21,22890,25330],[22,25330,26810],[23,26810,27570],[24,27570,28440],[25,28440,30720],[26,30720,31240],[27,31240,32170],[28,32170,33000],[29,33000,34480],[30,34480,35340],[31,35340,36120],[32,36120,38715]]}}