{"name":"5:14","price":"اور جو اپنے آپ کو نصرانی کہتے ہیں(1) ہم نے ان سے بھی عہد وپیمان لیا، انہوں نے بھی اس کا بڑا حصہ فراموش کر دیا جو انہیں نصیحت کی گئی تھی، تو ہم نے بھی ان کے آپس میں بغض وعداوت ڈال دی جو تاقیامت رہے گی(2) اور جو کچھ یہ کرتے تھے عنقریب اللہ تعالیٰ انہیں سب بتا دے گا۔","arabic":"وَمِنَ ٱلَّذِينَ قَالُوٓاْ إِنَّا نَصَٰرَىٰٓ أَخَذۡنَا مِيثَٰقَهُمۡ فَنَسُواْ حَظّٗا مِّمَّا ذُكِّرُواْ بِهِۦ فَأَغۡرَيۡنَا بَيۡنَهُمُ ٱلۡعَدَاوَةَ وَٱلۡبَغۡضَآءَ إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِۚ وَسَوۡفَ يُنَبِّئُهُمُ ٱللَّهُ بِمَا كَانُواْ يَصۡنَعُونَ","category":["5 (Al-Ma'idah)","Al-Ma'idah","Surah Al-Ma'idah","Chapter Al-Ma'idah","Ma'idah","Surah Ma'idah","Chapter Ma'idah","Al Ma'idah","Surah Al Ma'idah","Chapter Al Ma'idah","Surah 5","Chapter 5","The Table Spread","المَائدة"],"ayahNumber":683,"juzNumber":6,"footnotes":"(1) ”نَصَارَى“ ”نُصْرَةٌ“ (مدد) سے ہے۔ یہ حضرت عیسیٰ (عليه السلام) کے سوال ”مَنْ أَنْصَارِي إِلَى اللَّهِ“ (اللہ کے دین میں کون میرا مددگار ہے؟) کے جواب میں ان کے چند مخلص پیروکاروں نے جواب دیا تھا ”نَحْنُ أَنْصَارُ اللَّهِ“ (ہم اللہ کے مددگار ہیں) اسی سے ماخوذ ہے۔ یہ بھی یہود کی طرح اہل کتاب ہیں۔ ان سے بھی اللہ نے عہد لیا، لیکن انہوں نے بھی اس کی پرواہ نہیں کی، اس کے نتیجے میں ان کے دل بھی اثر پذیری سے خالی اوران کے کردار کھوکھلے ہوگئے۔\n(2) یہ عہد الٰہی سے انحراف اور بے عملی کی وہ سزا ہے جو اللہ تعالیٰ کی طرف سے ان پر قیامت تک کے لئے مسلط کر دی گئی۔ چنانچہ عیسائیوں کے کئی فرقے ہیں جو ایک دوسرے سے شدید نفرت وعناد رکھتے اور ایک دوسرے کی تکفیر کرتے ہیں اور ایک دوسرے کے معبد میں عبادت نہیں کرتے۔ معلوم ہوتا ہے کہ امت مسلمہ پر بھی یہ سزا مسلط کر دی گئی ہے۔ یہ امت بھی کئی فرقوں میں بٹ گئی ہے، جن کے درمیان شدید اختلافات اور نفرت و عناد کی دیواریں حائل ہیں۔ اللہ تعالیٰ رحم فرمائے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wamina alladhīna qālū innā naṣārā akhadhnā mīthāqahum fanasū ḥaẓẓan mimmā dhukkirū bihi fa-aghraynā baynahumu al-ʿadāwata wal-baghḍāa ilā yawmi al-qiyāmati wasawfa yunabbi-uhumu al-lahu bimā kānū yaṣnaʿūna ","translations":["And from","those who","said","Indeed we","(are) Christians","We took","their covenant","but they forgot","a part","of what","they were reminded","of [it]","So We aroused","between them","[the] enmity","and [the] hatred","till","(the) Day","(of) the Resurrection","And soon","will inform them","Allah","of what","they used to","do","(14)"],"transliterationArr":["wamina","alladhīna","qālū","innā","naṣārā","akhadhnā","mīthāqahum","fanasū","ḥaẓẓan","mimmā","dhukkirū","bihi","fa-aghraynā","baynahumu","al-ʿadāwata","wal-baghḍāa","ilā","yawmi","al-qiyāmati","wasawfa","yunabbi-uhumu","al-lahu","bimā","kānū","yaṣnaʿūna",null],"verseTiming":[[1,0,660],[2,660,1770],[3,1770,3580],[4,3580,4890],[5,4890,7090],[6,7090,8160],[7,8160,9580],[8,9580,10400],[9,10400,11760],[10,11760,12570],[11,12570,13250],[12,13250,15470],[13,15470,16530],[14,16530,17190],[15,17190,18750],[16,18750,19820],[17,19820,21190],[18,21190,22610],[19,22610,24399],[20,24399,25079],[21,25079,25739],[22,25739,27229],[23,27229,28009],[24,28009,29489],[25,29489,30349],[26,30349,30929],[27,30929,31839],[28,31839,34634]]}}