{"name":"5:18","price":"یہود و نصاریٰ کہتے ہیں کہ ہم اللہ کے بیٹے اور اس کے دوست ہیں(1) ، آپ کہہ دیجیئے کہ پھر تمہیں تمہارے گناہوں کے باعﺚ اللہ کیوں سزا دیتا ہے؟(2) نہیں بلکہ تم بھی اس کی مخلوق میں سے ایک انسان ہو وه جسے چاہتا ہے بخش دیتا ہے، اور جسے چاہتا ہے عذاب کرتا ہے(3)، زمین و آسمان اور ان کے درمیان کی ہر چیز اللہ تعالیٰ کی ملکیت ہے اور اسی کی طرف لوٹنا ہے۔","arabic":"وَقَالَتِ ٱلۡيَهُودُ وَٱلنَّصَٰرَىٰ نَحۡنُ أَبۡنَٰٓؤُاْ ٱللَّهِ وَأَحِبَّٰٓؤُهُۥۚ قُلۡ فَلِمَ يُعَذِّبُكُم بِذُنُوبِكُمۖ بَلۡ أَنتُم بَشَرٞ مِّمَّنۡ خَلَقَۚ يَغۡفِرُ لِمَن يَشَآءُ وَيُعَذِّبُ مَن يَشَآءُۚ وَلِلَّهِ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَمَا بَيۡنَهُمَاۖ وَإِلَيۡهِ ٱلۡمَصِيرُ","category":["5 (Al-Ma'idah)","Al-Ma'idah","Surah Al-Ma'idah","Chapter Al-Ma'idah","Ma'idah","Surah Ma'idah","Chapter Ma'idah","Al Ma'idah","Surah Al Ma'idah","Chapter Al Ma'idah","Surah 5","Chapter 5","The Table Spread","المَائدة"],"ayahNumber":687,"juzNumber":6,"footnotes":"(1) یہودیوں نے حضرت عزیر (عليه السلام) کو اور عیسائیوں نے حضرت عیسیٰ (عليه السلام) کو ابن اللہ کہا۔ اور اپنے آپ کو بھی ابناء اللہ (اللہ کے بیٹے) اور اس کا محبوب قرار دے لیا۔ بعض کہتے ہیں کہ یہاں ایک لفظ محذوف ہے یعنی ”أَتْبَاعُ أَبْنَاءِ اللهِ“ ہم اللہ کےبیٹوں (عزیر ومسیح) کے پیروکار ہیں۔ دونوں مفہوموں میں سے کوئی سا بھی مفہوم مراد لیا جائے، اس سے ان کے تفاخر اور اللہ کے بارے میں بےجا اعتماد کا اظہار ہوتا ہے، جس کی اللہ کے ہاں کوئی حیثیت نہیں۔\n(2) اس میں ان کے مذکورہ تفاخر کا بے بنیاد ہونا واضح کردیا گیا کہ اگر تم واقعی اللہ کے محبوب اور چہیتے ہوتے یا محبوب ہونے کا مطلب یہ ہے کہ تم جو چاہو کرو، اللہ تعالیٰ تم سے بازپرس ہی نہیں کرے گا، تو پھر اللہ تعالیٰ تمہیں تمہارے گناہوں کی پاداش میں سزا کیوں دیتا رہا ہے؟ اس کا صاف مطلب یہ ہوا کہ اللہ کی بارگاہ میں فیصلہ، دعووں کی بنیاد پر نہیں ہوتا نہ قیامت والے دن ہوگا، بلکہ وہ تو ا یمان و تقویٰ اور عمل دیکھتا ہے اور دنیا میں بھی اسی کی روشنی میں فیصلہ فرماتا ہے اور قیامت والے دن بھی اسی اصول پر فیصلہ ہوگا۔\n(3) تاہم یہ عذاب یا مغفرت کا فیصلہ اسی سنت اللہ کے مطابق ہوگا، جس کی اس نے وضاحت فرما دی ہے کہ اہل ایمان کے لئے مغفرت اور اہل کفر وفسق کے لئے عذاب، تمام انسانوں کا فیصلہ اسی کے مطابق ہوگا۔ اے اہل کتاب! تم بھی اسی کی پیدا کردہ مخلوق یعنی انسان ہو۔ تمہاری بابت فیصلہ دیگر انسانی مخلوق سے مختلف کیوں کر ہوگا ؟","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waqālati al-yahūdu wal-naṣārā naḥnu abnāu al-lahi wa-aḥibbāuhu qul falima yuʿadhibukum bidhunūbikum bal antum basharun mimman khalaqa yaghfiru liman yashāu wayuʿadhibu man yashāu walillahi mul'ku al-samāwāti wal-arḍi wamā baynahumā wa-ilayhi al-maṣīru ","translations":["And said","the Jews","and the Christians","We (are)","(the) children","(of) Allah","and His beloved","Say","Then why","(does He) punish you","for your sins","Nay","you (are)","human beings","from among (those)","He created","He forgives","[for] whom","He wills","and punishes","whom","He wills","And for Allah","(is the) dominion","(of) the heavens","and the earth","and whatever","(is) between them","and to Him","(is) the final return","(18)"],"transliterationArr":["waqālati","al-yahūdu","wal-naṣārā","naḥnu","abnāu","al-lahi","wa-aḥibbāuhu","qul","falima","yuʿadhibukum","bidhunūbikum","bal","antum","basharun","mimman","khalaqa","yaghfiru","liman","yashāu","wayuʿadhibu","man","yashāu","walillahi","mul'ku","al-samāwāti","wal-arḍi","wamā","baynahumā","wa-ilayhi","al-maṣīru",null],"verseTiming":[[1,0,1290],[2,1290,2370],[3,2370,4480],[4,4480,5070],[5,5070,7459],[6,7459,8309],[7,8309,12059],[8,12059,12459],[9,12459,13199],[10,13199,15429],[11,15429,17189],[12,17189,17639],[13,17639,19739],[14,19739,20339],[15,20339,22529],[16,22529,23149],[17,23149,24419],[18,24419,24969],[19,24969,27689],[20,27689,28959],[21,28959,29189],[22,29189,32849],[23,32849,34099],[24,34099,34719],[25,34719,36259],[26,36259,37299],[27,37299,37979],[28,37979,39239],[29,39239,40389],[30,40389,43004]]}}