{"name":"5:20","price":"اور یاد کرو موسیٰ (علیہ السلام) نے اپنی قوم سے کہا، اے میری قوم کے لوگو! اللہ تعالیٰ کے اس احسان کا ذکر کرو کہ اس نے تم میں سے پیغمبر بنائے اور تمہیں بادشاه بنا دیا(1) اور تمہیں وه دیا جو تمام عالم میں کسی کو نہیں دیا۔(2)","arabic":"وَإِذۡ قَالَ مُوسَىٰ لِقَوۡمِهِۦ يَٰقَوۡمِ ٱذۡكُرُواْ نِعۡمَةَ ٱللَّهِ عَلَيۡكُمۡ إِذۡ جَعَلَ فِيكُمۡ أَنۢبِيَآءَ وَجَعَلَكُم مُّلُوكٗا وَءَاتَىٰكُم مَّا لَمۡ يُؤۡتِ أَحَدٗا مِّنَ ٱلۡعَٰلَمِينَ","category":["5 (Al-Ma'idah)","Al-Ma'idah","Surah Al-Ma'idah","Chapter Al-Ma'idah","Ma'idah","Surah Ma'idah","Chapter Ma'idah","Al Ma'idah","Surah Al Ma'idah","Chapter Al Ma'idah","Surah 5","Chapter 5","The Table Spread","المَائدة"],"ayahNumber":689,"juzNumber":6,"footnotes":"(1) بیشتر انبیاء بنی اسرائیل میں سے ہی ہوئے ہیں جن کا سلسلہ حضرت عیسیٰ (عليه السلام) پر ختم کردیا گیا اور آخری پیغمبر بنو اسماعیل سے ہوئے۔ اسی طرح متعدد بادشاہ بھی بنی اسرائیل میں ہوئے اور بعض نبیوں کو بھی اللہ تعالیٰ نے ملوکیت (بادشاہت) سے نوازا۔ جیسے حضرت سلیمان (عليه السلام)۔ اس کا مطلب یہ ہوا کہ نبوت کی طرح ملوکیت (بادشاہت) بھی اللہ کا انعام ہے، جسے علی الاطلاق برا سمجھنا بہت بڑی غلطی ہے۔ اگر ملوکیت بری چیز ہوتی تو اللہ تعالیٰ کسی نبی کو بادشاہ بناتا نہ اس کا ذکر انعام کے طور پر فرماتا، جیسا کہ یہاں ہے آج کل مغربی جمہوریت کا کابوس اس طرح ذہنوں پر مسلط ہے اور شاطران مغرب نے اس کا افسوں اس طرح پھونکا ہے کہ مغربی افکار کے اسیر اہل سیاست ہی نہیں بلکہ اصحاب جبہ و دستاربھی ہیں۔ بہرحال ملوکیت یا شخصی حکومت، اگر بادشاہ اور حکمراں عادل و متقی ہو تو جمہوریت سے ہزار درجے بہتر ہے۔\n(2) یہ اشارہ ہے ان انعامات اور معجزات کی طرف، جن سے بنی اسرائیل نوازے گئے، جیسے من و سلویٰ کا نزول، بادلوں کا سایہ، فرعون سے نجات کے لئے دریا سے راستہ بنا دینا۔ وغیرہ۔ اس لحاظ سے یہ قوم اپنے زمانے میں فضیلت اور اونچے مقام کی حامل تھی لیکن پیغمبر آخرالزمان حضرت محمد (صلى الله عليه وسلم) کی رسالت و بعثت کے بعد اب یہ مقام فضیلت امت محمدیہ کو حاصل ہوگیا ہے۔ «كُنْتُمْ خَيْرَ أُمَّةٍ أُخْرِجَتْ لِلنَّاسِ» (آل عمران: 110) ”تم بہترین امت ہو جسے نوع انسانی کے لئے بنایا گیا ہے“، لیکن یہ بھی مشروط ہے اس مقصد کی تکمیل کے ساتھ جو اسی آیت میں بیان کردیا گیا ہے۔ «تَأْمُرُونَ بِالْمَعْرُوفِ وَتَنْهَوْنَ عَنِ الْمُنْكَرِ وَتُؤْمِنُونَ بِاللَّهِ» ”تم لوگوں کو بھلائی کا حکم دیتے، برائی سے روکتے ہو اور اللہ پر ایمان رکھتے ہو“، اللہ تعالیٰ امت مسلمہ کو اس مقصد کے لئے کام کرنے کی توفیق عطا فرمائے تاکہ وہ اپنے خیر امت ہونے کا اعزاز برقرار رکھ سکے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-idh qāla mūsā liqawmihi yāqawmi udh'kurū niʿ'mata al-lahi ʿalaykum idh jaʿala fīkum anbiyāa wajaʿalakum mulūkan waātākum mā lam yu'ti aḥadan mina al-ʿālamīna ","translations":["And when","said","Musa","to his people","O my people","remember","(the) Favor","(of) Allah","upon you","when","He placed","among you","Prophets","and made you","kings","and He gave you","what","not","He (had) given","(to) anyone","from","the worlds","(20)"],"transliterationArr":["wa-idh","qāla","mūsā","liqawmihi","yāqawmi","udh'kurū","niʿ'mata","al-lahi","ʿalaykum","idh","jaʿala","fīkum","anbiyāa","wajaʿalakum","mulūkan","waātākum","mā","lam","yu'ti","aḥadan","mina","al-ʿālamīna",null],"verseTiming":[[1,0,760],[2,760,1420],[3,1420,2230],[4,2230,3590],[5,3590,4560],[6,4560,5380],[7,5380,6210],[8,6210,7090],[9,7090,8150],[10,8150,8500],[11,8500,9140],[12,9140,10010],[13,10010,13300],[14,13300,14260],[15,14260,14840],[16,14840,15700],[17,15700,18930],[18,18930,20000],[19,20000,21340],[20,21340,23720],[21,23720,25120],[22,25120,26410],[23,26410,26810],[24,26810,27430],[25,27430,28080],[26,28080,29380],[27,29380,32245]]}}