{"name":"5:21","price":"اے میری قوم والو! اس مقدس زمین(1) میں داخل ہو جاؤ جو اللہ تعالیٰ نے تمہارے نام لکھ دی ہے(2) اور اپنی پشت کے بل روگردانی نہ کرو(3) کہ پھر نقصان میں جا پڑو۔","arabic":"يَٰقَوۡمِ ٱدۡخُلُواْ ٱلۡأَرۡضَ ٱلۡمُقَدَّسَةَ ٱلَّتِي كَتَبَ ٱللَّهُ لَكُمۡ وَلَا تَرۡتَدُّواْ عَلَىٰٓ أَدۡبَارِكُمۡ فَتَنقَلِبُواْ خَٰسِرِينَ","category":["5 (Al-Ma'idah)","Al-Ma'idah","Surah Al-Ma'idah","Chapter Al-Ma'idah","Ma'idah","Surah Ma'idah","Chapter Ma'idah","Al Ma'idah","Surah Al Ma'idah","Chapter Al Ma'idah","Surah 5","Chapter 5","The Table Spread","المَائدة"],"ayahNumber":690,"juzNumber":6,"footnotes":"(1) بنو اسرائیل کے مورث اعلیٰ حضرت یعقوب (عليه السلام) کا مسکن بیت المقدس تھا۔ لیکن حضرت یوسف (عليه السلام) کے امارت مصر کے زمانے میں یہ لوگ مصر جا کر آباد ہوگئے تھے اور پھر تب سے اس وقت تک مصر ہی میں رہے، جب تک کہ موسیٰ (عليه السلام) انہیں راتوں رات (فرعون سے چھپ کر) مصر سے نکال نہیں لے گئے۔ اس وقت بیت المقدس پر عمالقہ کی حکمرانی تھی جو ایک بہادر قوم تھی۔ جب حضرت موسیٰ (عليه السلام) نے پھر بیت المقدس جا کر آباد ہونے کا عزم کیا تو اس کے لئے وہاں قابض عمالقہ سے جہاد ضروری تھا۔ چنانچہ حضرت موسی (عليه السلام) نے اپنی قوم کو اس ارض مقدسہ میں داخل ہونے کا حکم دیا اور نصرت الٰہی کی بشارت بھی سنائی۔ لیکن اس کے باوجود بنواسرائیل عمالقہ سے لڑنے پر آمادہ نہیں ہوئے۔ (ابن کثیر )\n(2) اس سے مراد وہی فتح و نصرت ہے جس کا وعدہ اللہ تعالیٰ نے جہاد کی صورت میں ان سے کر رکھا تھا۔\n(3) یعنی جہاد سے اعراض مت کرو۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāqawmi ud'khulū al-arḍa al-muqadasata allatī kataba al-lahu lakum walā tartaddū ʿalā adbārikum fatanqalibū khāsirīna ","translations":["O my people","Enter","the land","the Holy","which","(has been) ordained","(by) Allah","for you","and (do) not","turn","on","your backs","then you will turn back","(as) losers","(21)"],"transliterationArr":["yāqawmi","ud'khulū","al-arḍa","al-muqadasata","allatī","kataba","al-lahu","lakum","walā","tartaddū","ʿalā","adbārikum","fatanqalibū","khāsirīna",null],"verseTiming":[[1,0,1190],[2,1190,1780],[3,1780,2570],[4,2570,4020],[5,4020,4880],[6,4880,5420],[7,5420,6380],[8,6380,7060],[9,7060,7650],[10,7650,9020],[11,9020,10040],[12,10040,11260],[13,11260,13070],[14,13070,14500],[15,14500,16490],[16,16490,19085]]}}