{"name":"5:26","price":"ارشاد ہوا کہ اب زمین ان پر چالیس سال تک حرام کر دی گئی ہے، یہ خانہ بدوش ادھر ادھر سرگرداں پھرتے رہیں گے(1) اس لئے تم ان فاسقوں کے بارے میں غمگین نہ ہونا۔(2)","arabic":"قَالَ فَإِنَّهَا مُحَرَّمَةٌ عَلَيۡهِمۡۛ أَرۡبَعِينَ سَنَةٗۛ يَتِيهُونَ فِي ٱلۡأَرۡضِۚ فَلَا تَأۡسَ عَلَى ٱلۡقَوۡمِ ٱلۡفَٰسِقِينَ","category":["5 (Al-Ma'idah)","Al-Ma'idah","Surah Al-Ma'idah","Chapter Al-Ma'idah","Ma'idah","Surah Ma'idah","Chapter Ma'idah","Al Ma'idah","Surah Al Ma'idah","Chapter Al Ma'idah","Surah 5","Chapter 5","The Table Spread","المَائدة"],"ayahNumber":695,"juzNumber":6,"footnotes":"(1) یہ میدان تیہ کہلاتا ہے، جس میں چالیس سال یہ قوم اپنی نافرمانی اور جہاد سے اعراض کی وجہ سے سرگرداں رہی۔ اس میدان میں اس کے باوجود ان پر من وسلویٰ کا نزول ہوا، جس سے اکتا کر انہوں نے اپنے پیغمبر سے کہا کہ روز روز ایک ہی کھانا کھا کر ہمارا جی بھر گیا ہے۔ اپنے رب سے دعا کر کہ وہ مختلف قسم کی سبزیاں اور دالیں ہمارے لئے پیدا فرمائے۔ یہیں ان پر بادلوں کا سایہ ہوا، پتھر پر حضرت موسیٰ (عليه السلام) کی لاٹھی مارنے سے بارہ قبیلوں کے لئے بارہ چشمے جاری ہوئے، اور اس طرح کے دیگر انعامات ہوتے رہے۔ چالیس سال بعد پھر ایسے حالات پیدا کئے گئے کہ یہ بیت المقدس کے اندر داخل ہوئے۔\n(2) پیغمبر، دعوت وتبلیغ کے باوجود جب دیکھتا ہے کہ میری قوم سیدھا راستہ اختیار کرنے کے لئے تیار نہیں، جس میں اس کے لئے دین ودنیا کی سعادتیں اور بھلائیاں ہیں تو فطری طور پر اس کو سخت افسوس اور دلی قلق ہوتا ہے۔ یہی نبی (صلى الله عليه وسلم) کا بھی حال ہوتا تھا، جس کا ذکر قرآن مجید میں اللہ تعالیٰ نے متعدد جگہ فرمایا ہے۔ لیکن آیت میں حضرت موسیٰ (عليه السلام) سے خطاب کرکے کہا جا رہا ہے کہ جب تو نے فریضۂ تبلیغ ادا کردیا اور پیغام الٰہی لوگوں تک پہنچا دیا اور اپنی قوم کو ایک عظیم الشان کامیابی کے نقطۂ آغاز پر لاکھڑا کیا۔ لیکن اب وہ اپنی دون ہمتی اور بددماغی کے سبب تیری بات ماننے کو تیار نہیں تو، تو اپنے فرض سے سبک دوش ہو گیا اور اب تجھے ان کے بارے میں غمگین ہونے کی ضرورت نہیں۔ ایسے موقع پر غمگینی تو ایک فطری چیز ہے۔ لیکن مراد اس تسلی سے یہ ہے کہ تبلیغ ودعوت کے بعد اب تم عند اللہ بری الذمہ ہو۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qāla fa-innahā muḥarramatun ʿalayhim arbaʿīna sanatan yatīhūna fī al-arḍi falā tasa ʿalā al-qawmi al-fāsiqīna ","translations":["(Allah) said","Then indeed it","(will be) forbidden","to them","(for) forty","years","they will wander","in","the earth","So (do) not","grieve","over","the people","the defiantly disobedient","(26)"],"transliterationArr":["qāla","fa-innahā","muḥarramatun","ʿalayhim","arbaʿīna","sanatan","yatīhūna","fī","al-arḍi","falā","tasa","ʿalā","al-qawmi","al-fāsiqīna",null],"verseTiming":[[1,0,700],[2,700,2320],[3,2320,3790],[4,3790,4840],[5,4840,6350],[6,6350,7110],[7,7110,8840],[8,8840,9140],[9,9140,10190],[10,10190,10730],[11,10730,11470],[12,11470,11790],[13,11790,12660],[14,12660,16605]]}}