{"name":"5:27","price":"آدم (علیہ السلام) کے دونوں بیٹوں کا کھرا کھرا حال بھی انہیں سنا دو(1) ، ان دونوں نے ایک نذرانہ پیش کیا، ان میں سے ایک کی نذر تو قبول ہوگئی اور دوسرے کی مقبول نہ ہوئی(2) تو وه کہنے لگا کہ میں تجھے مار ہی ڈالوں گا، اس نے کہا اللہ تعالیٰ تقویٰ والوں کا ہی عمل قبول کرتا ہے۔","arabic":"۞ وَٱتۡلُ عَلَيۡهِمۡ نَبَأَ ٱبۡنَيۡ ءَادَمَ بِٱلۡحَقِّ إِذۡ قَرَّبَا قُرۡبَانٗا فَتُقُبِّلَ مِنۡ أَحَدِهِمَا وَلَمۡ يُتَقَبَّلۡ مِنَ ٱلۡأٓخَرِ قَالَ لَأَقۡتُلَنَّكَۖ قَالَ إِنَّمَا يَتَقَبَّلُ ٱللَّهُ مِنَ ٱلۡمُتَّقِينَ","category":["5 (Al-Ma'idah)","Al-Ma'idah","Surah Al-Ma'idah","Chapter Al-Ma'idah","Ma'idah","Surah Ma'idah","Chapter Ma'idah","Al Ma'idah","Surah Al Ma'idah","Chapter Al Ma'idah","Surah 5","Chapter 5","The Table Spread","المَائدة"],"ayahNumber":696,"juzNumber":6,"footnotes":"(1) آدم (عليه السلام) کے ان دو بیٹوں کے نام ہابیل اور قابیل تھے۔\n(2) یہ نذر یا قربانی کس لئے پیش کی گئی؟ اس کے بارے میں کوئی صحیح روایت نہیں۔ البتہ مشہور یہ ہے کہ ابتدا میں حضرت آدم وحوا کے ملاپ سے بیک وقت لڑکا اور لڑکی پیدا ہوتی۔ دوسرے حمل سے پھر لڑکا لڑکی ہوتی، ایک حمل کے بہن بھائی کا نکاح دوسرے حمل کے بہن بھائی سے کردیا جاتا۔ ہابیل کے ساتھ پیدا ہونے والی بہن بدصورت تھی، جب کہ قابیل کے ساتھ پیدا ہونے والی بہن خوبصورت تھی۔ اس وقت کے اصول کے مطابق ہابیل کا نکاح قابیل کی بہن کے ساتھ اور قابیل کا نکاح ہابیل کی بہن کے ساتھ ہونا تھا۔ لیکن قابیل چاہتا تھا کہ وہ ہابیل کے بہن کی بجائے اپنی ہی بہن کے ساتھ جو خوبصورت تھی، نکاح کرے۔ حضرت آدم (عليه السلام) نے اسے سمجھایا، لیکن وہ نہ سمجھا، بالآخر حضرت آدم (عليه السلام) نے دونوں کو بارگاہ الٰہی میں قربانیاں پیش کرنے کا حکم دیا اور فرمایا کہ جس کی قربانی قبول ہو جائے گی قابیل کی بہن کا نکاح اس کے ساتھ کردیا جائے گا۔ ہابیل کی قربانی قبول ہوگئی، یعنی آسمان سے آگ آئی اور اسے کھا گئی جو اس کے قبول ہونے کی دلیل تھی۔ بعض مفسرین کا خیال ہے کہ ویسے ہی دونوں بھائیوں نے اپنے اپنے طور پر اللہ کی بارگاہ میں نذر پیش کی، ہابیل نے ایک عمدہ دنبہ کی قربانی اور قابیل نے گندم کی بالی قربانی میں پیش کی، ہابیل کی قربانی قبول ہونے پر قابیل حسد کا شکار ہوگیا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-ut'lu ʿalayhim naba-a ib'nay ādama bil-ḥaqi idh qarrabā qur'bānan fatuqubbila min aḥadihimā walam yutaqabbal mina al-ākhari qāla la-aqtulannaka qāla innamā yataqabbalu al-lahu mina al-mutaqīna ","translations":["And recite","to them","the story","(of) two sons","(of) Adam","in truth","when","both offered","a sacrifice","and it was accepted","from","one of them","and not","was accepted","from","the other","Said (the latter)","Surely I will kill you","Said (the former)","Only","accepts","(does) Allah","from","the God fearing","(27)"],"transliterationArr":["wa-ut'lu","ʿalayhim","naba-a","ib'nay","ādama","bil-ḥaqi","idh","qarrabā","qur'bānan","fatuqubbila","min","aḥadihimā","walam","yutaqabbal","mina","al-ākhari","qāla","la-aqtulannaka","qāla","innamā","yataqabbalu","al-lahu","mina","al-mutaqīna",null],"verseTiming":[[1,0,2950],[2,2950,4050],[3,4050,4510],[4,4510,5360],[5,5360,6100],[6,6100,7090],[7,7090,7440],[8,7440,8380],[9,8380,9980],[10,9980,11370],[11,11370,11750],[12,11750,12810],[13,12810,13630],[14,13630,14790],[15,14790,15140],[16,15140,16210],[17,16210,16900],[18,16900,19070],[19,19070,19660],[20,19660,20980],[21,20980,22290],[22,22290,23140],[23,23140,23490],[24,23490,26285]]}}