{"name":"5:30","price":"پس اسے اس کے نفس نے اپنے بھائی کے قتل پر آماده کر دیا اور اس نے اسے قتل کر ڈاﻻ، جس سے نقصان پانے والوں میں سے ہوگیا۔(1)","arabic":"فَطَوَّعَتۡ لَهُۥ نَفۡسُهُۥ قَتۡلَ أَخِيهِ فَقَتَلَهُۥ فَأَصۡبَحَ مِنَ ٱلۡخَٰسِرِينَ","category":["5 (Al-Ma'idah)","Al-Ma'idah","Surah Al-Ma'idah","Chapter Al-Ma'idah","Ma'idah","Surah Ma'idah","Chapter Ma'idah","Al Ma'idah","Surah Al Ma'idah","Chapter Al Ma'idah","Surah 5","Chapter 5","The Table Spread","المَائدة"],"ayahNumber":699,"juzNumber":6,"footnotes":"(1) چنانچہ حدیث میں آتا ہے ”لا تُقْتَلُ نَفْسٌ ظُلْمًا إلا كَانَ عَلَى ابْنِ آدَمَ الأَوَّلِ كِفْلٌ مِنْ دَمِهَا؛ لأَنَّهُ كَانَ أَوَّلَ مَنْ سَنَّ الْقَتْلَ“ (صحيح بخاري، كتاب الأنبياء ومسلم، كتاب القسامة) ”جو قتل بھی ظلماً ہوتا ہے، (قاتل کے ساتھ) اس کے خون ناحق کا بوجھ آدم کے اس پہلے بیٹے پر بھی ہوتا ہے کیونکہ یہ پہلا شخص ہے جس نے قتل کا کام کیا۔“ امام ابن کثیر فرماتے ہیں کہ ”ظاہر بات یہ معلوم ہوتی ہے کہ قابیل کو ہابیل کے قتل ناحق کی سزا دنیا میں ہی فوری طور پر دے دی گئی تھی“۔ حدیث میں آتا ہے نبی (صلى الله عليه وسلم) نے فرمایا ”مَا مِنْ ذَنْبٍ أَجْدَرُ أَنْ يُعَجِّلَ اللهُ عُقُوبَتَهُ فِي الدُّنْيَا مَعَ مَا يَدِّخِرُ لِصَاحِبِهِ فِي الآخِرَةِ؛ مِنَ الْبَغْيِ وَقَطِيعَةِ الرَّحِمِ“ (أبو داود، كتاب الأدب- ابن ماجه، كتاب الزهد ومسند أحمد 5/ 36-38) ”بغی (ظلم و زیادتی) اور قطع رحمی یہ دونوں گناہ اس بات کے زیادہ لائق ہیں کہ اللہ تعالیٰ ان کے مرتکبین کو دنیا میں ہی جلد سزا دے دے، تاہم آخرت کی سزا اس کے علاوہ اس کے لئے ذخیرہ ہوگی“ جو انہیں وہاں بھگتنی ہوگی اور قابیل میں یہ دونوں گناہ جمع ہوگئے تھے۔ فَإِنَّا للهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ (ابن کثیر)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"faṭawwaʿat lahu nafsuhu qatla akhīhi faqatalahu fa-aṣbaḥa mina al-khāsirīna ","translations":["Then prompted","to him","his soul","(to) kill","his brother","so he killed him","and became","of","the losers","(30)"],"transliterationArr":["faṭawwaʿat","lahu","nafsuhu","qatla","akhīhi","faqatalahu","fa-aṣbaḥa","mina","al-khāsirīna",null],"verseTiming":[[1,0,1400],[2,1400,2010],[3,2010,3040],[4,3040,3700],[5,3700,4550],[6,4550,5720],[7,5720,6830],[8,6830,7140],[9,7140,10275]]}}