{"name":"5:32","price":"اسی وجہ سے ہم نے بنی اسرائیل پر یہ لکھ دیا کہ جو شخص کسی کو بغیر اس کے کہ وه کسی کا قاتل ہو یا زمین میں فساد مچانے واﻻ ہو، قتل کر ڈالے تو گویا اس نے تمام لوگوں کو قتل کردیا، اور جو شخص کسی ایک کی جان بچا لے، اس نے گویا تمام لوگوں کو زنده کردیا(1) اور ان کے پاس ہمارے بہت سے رسول ﻇاہر دلیلیں لے کر آئے لیکن پھر اس کے بعد بھی ان میں کے اکثر لوگ زمین میں ﻇلم و زیادتی اور زبردستی کرنے والے ہی رہے۔(2)","arabic":"مِنۡ أَجۡلِ ذَٰلِكَ كَتَبۡنَا عَلَىٰ بَنِيٓ إِسۡرَٰٓءِيلَ أَنَّهُۥ مَن قَتَلَ نَفۡسَۢا بِغَيۡرِ نَفۡسٍ أَوۡ فَسَادٖ فِي ٱلۡأَرۡضِ فَكَأَنَّمَا قَتَلَ ٱلنَّاسَ جَمِيعٗا وَمَنۡ أَحۡيَاهَا فَكَأَنَّمَآ أَحۡيَا ٱلنَّاسَ جَمِيعٗاۚ وَلَقَدۡ جَآءَتۡهُمۡ رُسُلُنَا بِٱلۡبَيِّنَٰتِ ثُمَّ إِنَّ كَثِيرٗا مِّنۡهُم بَعۡدَ ذَٰلِكَ فِي ٱلۡأَرۡضِ لَمُسۡرِفُونَ","category":["5 (Al-Ma'idah)","Al-Ma'idah","Surah Al-Ma'idah","Chapter Al-Ma'idah","Ma'idah","Surah Ma'idah","Chapter Ma'idah","Al Ma'idah","Surah Al Ma'idah","Chapter Al Ma'idah","Surah 5","Chapter 5","The Table Spread","المَائدة"],"ayahNumber":701,"juzNumber":6,"footnotes":"(1) اس قتل ناحق کے بعد اللہ تعالیٰ نے انسانی جان کی قدر وقیمت کو واضح کرنے کے لئے بنو اسرائیل پر یہ حکم نازل فرمایا۔ اس سے اندازہ لگایا جاسکتا ہے کہ اللہ کے ہاں انسانی خون کی کتنی اہمیت اور تکریم ہے اور یہ اصول صرف بنی اسرائیل ہی کے لئے نہیں تھا، اسلام کی تعلیمات کے مطابق بھی یہ اصول ہمیشہ کے لئے ہے۔ سلیمان بن ربعی کہتے ہیں کہ میں نے حضرت حسن بصری سے پوچھا یہ آیت ہمارے لئے بھی ہے جس طرح بنو اسرائیل کے لئے تھی؟ انہوں نے فرمایا: ”ہاں۔ قسم ہے اس ذات کی جس کے سوا کوئی معبود برحق نہیں، بنواسرائیل کے خون اللہ کے ہاں ہمارے خونوں سے زیادہ قابل احترام نہیں تھے“ (تفسیر ابن کثیر)\n(2) اس میں یہود کو زجروتوبیخ ہے کہ ان کے پاس انبیاء دلائل وبراہین لے کر آتے رہے۔ لیکن ان کا رویہ ہمیشہ حد سے تجاوز کرنے والا ہی رہا۔ اس میں گویا نبی (صلى الله عليه وسلم) کو تسلی دی جا رہی ہے کہ یہ آپ کو قتل کرنے اور نقصان پہنچانے کی جو سازشیں کرتے رہتے ہیں، یہ کوئی نئی بات نہیں ہے، ان کی ساری تاریخ ہی مکروفساد سے بھری ہوئی ہے۔ آپ بہرحال اللہ پر بھروسہ رکھیں جو خیر الماکرین ہے۔ تمام سازشوں سے بہتر تدبیر کرنے والا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"min ajli dhālika katabnā ʿalā banī is'rāīla annahu man qatala nafsan bighayri nafsin aw fasādin fī al-arḍi faka-annamā qatala al-nāsa jamīʿan waman aḥyāhā faka-annamā aḥyā al-nāsa jamīʿan walaqad jāathum rusulunā bil-bayināti thumma inna kathīran min'hum baʿda dhālika fī al-arḍi lamus'rifūna ","translations":["From","time","that","We ordained","on","(the) Children","(of) Israel","that he","who","kills","a soul","other than","(for) a soul","or","(for) spreading corruption","in","the earth","then (it) is as if","he has killed","mankind","all","and whoever","saves it","then (it) is as if","he has saved","mankind","all","And surely","came to them","Our Messengers","with clear Signs","yet","indeed","many","of them","after","that","in","the earth","(are) surely those who commit excesses","(32)"],"transliterationArr":["min","ajli","dhālika","katabnā","ʿalā","banī","is'rāīla","annahu","man","qatala","nafsan","bighayri","nafsin","aw","fasādin","fī","al-arḍi","faka-annamā","qatala","al-nāsa","jamīʿan","waman","aḥyāhā","faka-annamā","aḥyā","al-nāsa","jamīʿan","walaqad","jāathum","rusulunā","bil-bayināti","thumma","inna","kathīran","min'hum","baʿda","dhālika","fī","al-arḍi","lamus'rifūna",null],"verseTiming":[[1,0,590],[2,590,1220],[3,1220,1980],[4,1980,3080],[5,3080,3670],[6,3670,5450],[7,5450,8360],[8,8360,9850],[9,9850,11000],[10,11000,11630],[11,11630,12880],[12,12880,13800],[13,13800,14550],[14,14550,14910],[15,14910,16430],[16,16430,16710],[17,16710,17490],[18,17490,19370],[19,19370,22000],[20,22000,22560],[21,22560,24070],[22,24070,25110],[23,25110,26360],[24,26360,27600],[25,27600,30860],[26,30860,31400],[27,31400,32770],[28,32770,34230],[29,34230,35060],[30,35060,37560],[31,37560,38390],[32,38390,40220],[33,40220,41200],[34,41200,42340],[35,42340,43220],[36,43220,45330],[37,45330,45960],[38,45960,46710],[39,46710,46920],[40,46920,47810],[41,47810,50495]]}}