{"name":"5:33","price":"جو اللہ تعالیٰ سے اور اس کے رسول سے لڑیں اور زمین میں فساد کرتے پھریں ان کی سزا یہی ہے کہ وه قتل کر دیئے جائیں یا سولی چڑھا دیئے جائیں یا مخالف جانب سے ان کے ہاتھ پاوں کاٹ دیئے جائیں، یا انہیں جلاوطن کر دیا جائے(1) ، یہ تو ہوئی ان کی دنیوی ذلت اور خواری، اور آخرت میں ان کے لئے بڑا بھاری عذاب ہے۔","arabic":"إِنَّمَا جَزَٰٓؤُاْ ٱلَّذِينَ يُحَارِبُونَ ٱللَّهَ وَرَسُولَهُۥ وَيَسۡعَوۡنَ فِي ٱلۡأَرۡضِ فَسَادًا أَن يُقَتَّلُوٓاْ أَوۡ يُصَلَّبُوٓاْ أَوۡ تُقَطَّعَ أَيۡدِيهِمۡ وَأَرۡجُلُهُم مِّنۡ خِلَٰفٍ أَوۡ يُنفَوۡاْ مِنَ ٱلۡأَرۡضِۚ ذَٰلِكَ لَهُمۡ خِزۡيٞ فِي ٱلدُّنۡيَاۖ وَلَهُمۡ فِي ٱلۡأٓخِرَةِ عَذَابٌ عَظِيمٌ","category":["5 (Al-Ma'idah)","Al-Ma'idah","Surah Al-Ma'idah","Chapter Al-Ma'idah","Ma'idah","Surah Ma'idah","Chapter Ma'idah","Al Ma'idah","Surah Al Ma'idah","Chapter Al Ma'idah","Surah 5","Chapter 5","The Table Spread","المَائدة"],"ayahNumber":702,"juzNumber":6,"footnotes":"(1) اس کی شان نزول کی بابت آتا ہے کہ عکل اور عرینہ قبیلے کے کچھ لوگ مسلمان ہو کر مدینہ آئے، انہیں مدینہ کی آب وہوا راس نہ آئی تو نبی (صلى الله عليه وسلم) نے انہیں مدینہ سے باہر، جہاں صدقے کے اونٹ تھے، بھیج دیا کہ ان کا دودھ اور پیشاب پیو، اللہ تعالیٰ شفا عطا فرمائے گا۔ چنانچہ چند روز میں وہ ٹھیک ہوگئے لیکن اس کے بعد انہوں نے اونٹوں کے رکھوالے اور چرواہے کو قتل کردیا اور اونٹ ہنکا کر لے گئے۔ جب نبی (صلى الله عليه وسلم) کو اس امر کی اطلاع ملی تو آپ (صلى الله عليه وسلم) نے ان کے پیچھے آدمی دوڑائے جو انہیں اونٹوں سمیت پکڑ لائے۔ نبی (صلى الله عليه وسلم) نے ان کے ہاتھ پیر مخالف جانب سے کاٹ دالے ان کی آنکھوں میں گرم سلائیاں پھروائیں، (کیونکہ انہوں نے بھی چرواہے کے ساتھ ایسا ہی کیا تھا) پھر انہیں دھوپ میں ڈال دیا گیا حتیٰ کہ وہیں مر گئے۔ صحیح بخاری میں یہ الفاظ بھی آتے ہیں کہ انہوں نے چوری بھی کی، قتل بھی کیا، ایمان لانے کے بعد کفر بھی کیا اور اللہ ورسول کے ساتھ محاربہ بھی۔ ( صحيح بخاري كتاب الديات، والطب والتفسير- صحيح مسلم كتاب القسامة) یہ آیت محاربہ کہلاتی ہے۔ اس کا حکم عام ہے یعنی مسلمانوں اور کافروں دونوں کو شامل ہے۔ محاربہ کا مطلب ہے۔ کسی منظم اور مسلح جتھے کا اسلامی حکومت کے دائرے میں یا اس کے قریب صحرا وغیرہ میں راہ چلتے قافلوں اور افراد اور گروہوں پر حملے کرنا، قتل وغارت گری کرنا، سلب ونہب، اغوا اور آبروریزی کرنا وغیرہ اس کی جو سزائیں بیان کی گئی ہیں، امام (خلیفۂ وقت) کو اختیار ہے کہ ان میں سے جو سزا مناسب سمجھے، دے۔ بعض لوگ کہتے ہیں اگر محاربین نے قتل وسلب کیا اور دہشت گردی کی تو انہیں قتل اور سولی کی سزا دی جائے گی اور جس نے صرف قتل کیا، مال نہیں لیا، اسے قتل کیا جائے گا اور جس نے قتل کیا اور مال بھی چھینا، اس کا ایک دایاں ہاتھ اور بایاں پاؤں یا بایاں ہاتھ اور دایاں پاؤں کاٹ دیا جائے گا۔ اور جس نے نہ قتل کیا نہ مال لیا، صرف دہشت گردی کی اسے جلاوطن کردیا جائے گا۔ لیکن امام شوکانی فرماتے ہیں پہلی بات صحیح ہے کہ سزا دینے میں امام کو اختیار حاصل ہے۔ (فتح القدیر )","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"innamā jazāu alladhīna yuḥāribūna al-laha warasūlahu wayasʿawna fī al-arḍi fasādan an yuqattalū aw yuṣallabū aw tuqaṭṭaʿa aydīhim wa-arjuluhum min khilāfin aw yunfaw mina al-arḍi dhālika lahum khiz'yun fī al-dun'yā walahum fī al-ākhirati ʿadhābun ʿaẓīmun ","translations":["Only","(the) recompense","(for) those who","wage war","(against) Allah","and His Messenger","and strive","in","the earth","spreading corruption","(is) that","they be killed","or","they be crucified","or","be cut off","their hands","and their feet","of","opposite sides","or","they be exiled","from","the land","That","(is) for them","disgrace","in","the world","and for them","in","the Hereafter","(is) a punishment","great","(33)"],"transliterationArr":["innamā","jazāu","alladhīna","yuḥāribūna","al-laha","warasūlahu","wayasʿawna","fī","al-arḍi","fasādan","an","yuqattalū","aw","yuṣallabū","aw","tuqaṭṭaʿa","aydīhim","wa-arjuluhum","min","khilāfin","aw","yunfaw","mina","al-arḍi","dhālika","lahum","khiz'yun","fī","al-dun'yā","walahum","fī","al-ākhirati","ʿadhābun","ʿaẓīmun",null],"verseTiming":[[1,0,1890],[2,1890,4200],[3,4200,5270],[4,5270,6670],[5,6670,7640],[6,7640,9110],[7,9110,10300],[8,10300,10520],[9,10520,11320],[10,11320,12400],[11,12400,12640],[12,12640,14420],[13,14420,16290],[14,16290,18420],[15,18420,18820],[16,18820,21180],[17,21180,21520],[18,21520,22680],[19,22680,23840],[20,23840,25170],[21,25170,25990],[22,25990,27040],[23,27040,27410],[24,27410,28730],[25,28730,29100],[26,29100,30500],[27,30500,31410],[28,31410,31970],[29,31970,33140],[30,33140,33550],[31,33550,34590],[32,34590,35390],[33,35390,35630],[34,35630,36850],[35,36850,37890],[36,37890,40105]]}}