{"name":"5:45","price":"اور ہم نے یہودیوں کے ذمہ تورات میں یہ بات مقرر کر دی تھی کہ جان کے بدلے جان اور آنکھ کے بدلے آنکھ اور ناک کے بدلے ناک اور کان کے بدلے کان اور دانت کے بدلے دانت اور خاص زخموں کا بھی بدلہ ہے(1) ، پھر جو شخص اس کو معاف کردے تو وه اس کے لئے کفاره ہے، اور جو لوگ اللہ کے نازل کئے ہوئے کے مطابق حکم نہ کریں، وہی لوگ ﻇالم ہیں۔(2)","arabic":"وَكَتَبۡنَا عَلَيۡهِمۡ فِيهَآ أَنَّ ٱلنَّفۡسَ بِٱلنَّفۡسِ وَٱلۡعَيۡنَ بِٱلۡعَيۡنِ وَٱلۡأَنفَ بِٱلۡأَنفِ وَٱلۡأُذُنَ بِٱلۡأُذُنِ وَٱلسِّنَّ بِٱلسِّنِّ وَٱلۡجُرُوحَ قِصَاصٞۚ فَمَن تَصَدَّقَ بِهِۦ فَهُوَ كَفَّارَةٞ لَّهُۥۚ وَمَن لَّمۡ يَحۡكُم بِمَآ أَنزَلَ ٱللَّهُ فَأُوْلَٰٓئِكَ هُمُ ٱلظَّٰلِمُونَ","category":["5 (Al-Ma'idah)","Al-Ma'idah","Surah Al-Ma'idah","Chapter Al-Ma'idah","Ma'idah","Surah Ma'idah","Chapter Ma'idah","Al Ma'idah","Surah Al Ma'idah","Chapter Al Ma'idah","Surah 5","Chapter 5","The Table Spread","المَائدة"],"ayahNumber":714,"juzNumber":6,"footnotes":"(1) جب تورات میں جان کے بدلے جان اور زخموں میں قصاص کا حکم دیا گیا تھا تو پھر یہودیوں کے ایک قبیلے (بنونضیر) کا دوسرے قبیلے (بنوقریظہ) کے ساتھ اس کے برعکس معاملہ کرنا اور اپنے مقتول کی دیت دوسرے قبیلے کے مقتول کی بہ نسبت دوگنا رکھنے کا کیا جواز ہے؟ جیسا کہ اس کی تفصیل پچھلے صفحات میں گزری۔\n(2) یہ اشارہ ہے اس بات کی طرف کہ جس قبیلے نے مذکورہ فیصلہ کیا تھا، یہ اللہ کے نازل کردہ حکم کے خلاف تھا اور اس طرح انہوں نے ظلم کا ارتکاب کیا۔ گویا انسان اس بات کا مکلف ہے کہ وہ احکامات الٰہی کو اپنائے، اسی کے مطابق فیصلے کرے اور زندگی کے تمام معاملات میں اس سے رہنمائی حاصل کرے، اگر وہ ایسا نہیں کرے گا تو بارگاہ الٰہی میں ظالم متصور ہوگا، فاسق متصور ہوگا اور کافر متصورہوگا۔ ایسے لوگوں کے لئے اللہ تعالیٰ نے تینوں لفظ استعمال کرکے اپنے غضب اور ناراضگی کا بھرپور اظہار فرما دیا۔ اس کے بعد بھی انسان اپنے ہی خود ساختہ قوانین یا اپنی خواہشات ہی کو اہمیت دے تو اس سے زیادہ بدقسمتی کیا ہوگی؟\nملحوظة:علمائے اصولیین نے لکھا ہے کہ پچھلی شریعت کا حکم، اگر اللہ نے برقرار رکھا ہے تو ہمارے لئے بھی اس پر عمل کرنا ضروری ہے اور اس آیت میں بیان کردہ حکم غیر منسوخ ہے اس لئے یہ بھی شریعت اسلامیہ ہی کے احکام ہیں جیسا کہ احادیث سے اس کی تائید ہوتی ہے۔ اسی طرح احادیث سے «النَّفْسَ بِالنَّفْسِ» ( جان، بدلے جان کے) کے عموم سے دو صورتیں خارج ہوں گی۔ کہ کوئی مسلمان اگر کسی کافر کو قتل کر دے تو قصاص میں اس کافر کے بدلے مسلمان کو، اسی طرح غلام کے بدلے آزاد کو قتل نہیں کیا جائے گا۔ (تفصیل کے لئے ملاحظہ ہو، فتح الباری ونیل الاوطار وغیرہ)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wakatabnā ʿalayhim fīhā anna al-nafsa bil-nafsi wal-ʿayna bil-ʿayni wal-anfa bil-anfi wal-udhuna bil-udhuni wal-sina bil-sini wal-jurūḥa qiṣāṣun faman taṣaddaqa bihi fahuwa kaffāratun lahu waman lam yaḥkum bimā anzala al-lahu fa-ulāika humu al-ẓālimūna ","translations":["And We ordained","for them","in it","that ","the life","for the life","and the eye","for the eye","and the nose","for the nose","and the ear","for the ear","and the tooth","for the tooth","and (for) wounds","(is) retribution","But whoever","gives charity","with it","then it is","an expiation","for him","And whoever","(does) not","judge","by what","has revealed","Allah","then those","[they]","(are) the wrongdoers","(45)"],"transliterationArr":["wakatabnā","ʿalayhim","fīhā","anna","al-nafsa","bil-nafsi","wal-ʿayna","bil-ʿayni","wal-anfa","bil-anfi","wal-udhuna","bil-udhuni","wal-sina","bil-sini","wal-jurūḥa","qiṣāṣun","faman","taṣaddaqa","bihi","fahuwa","kaffāratun","lahu","waman","lam","yaḥkum","bimā","anzala","al-lahu","fa-ulāika","humu","al-ẓālimūna",null],"verseTiming":[[1,0,1470],[2,1470,2510],[3,2510,4640],[4,4640,5630],[5,5630,7040],[6,7040,8630],[7,8630,9550],[8,9550,10670],[9,10670,12320],[10,12320,13880],[11,13880,14800],[12,14800,15840],[13,15840,17370],[14,17370,18940],[15,18940,20240],[16,20240,22560],[17,22560,24250],[18,24250,25400],[19,25400,26000],[20,26000,26660],[21,26660,27970],[22,27970,29100],[23,29100,29580],[24,29580,30180],[25,30180,31110],[26,31110,33280],[27,33280,34770],[28,34770,35700],[29,35700,38400],[30,38400,38840],[31,38840,41605]]}}