{"name":"5:46","price":"اور ہم نے ان کے پیچھے عیسیٰ بن مریم کو بھیجا جو اپنے سے پہلے کی کتاب یعنی تورات کی تصدیق کرنے والے تھے(1) اور ہم نے انہیں انجیل عطا فرمائی جس میں نور اور ہدایت تھی اور وه اپنے سے پہلے کی کتاب تورات کی تصدیق کرتی تھی اور وه سراسر ہدایت ونصیحت تھی پارسا لوگوں کے لئے۔(2)","arabic":"وَقَفَّيۡنَا عَلَىٰٓ ءَاثَٰرِهِم بِعِيسَى ٱبۡنِ مَرۡيَمَ مُصَدِّقٗا لِّمَا بَيۡنَ يَدَيۡهِ مِنَ ٱلتَّوۡرَىٰةِۖ وَءَاتَيۡنَٰهُ ٱلۡإِنجِيلَ فِيهِ هُدٗى وَنُورٞ وَمُصَدِّقٗا لِّمَا بَيۡنَ يَدَيۡهِ مِنَ ٱلتَّوۡرَىٰةِ وَهُدٗى وَمَوۡعِظَةٗ لِّلۡمُتَّقِينَ","category":["5 (Al-Ma'idah)","Al-Ma'idah","Surah Al-Ma'idah","Chapter Al-Ma'idah","Ma'idah","Surah Ma'idah","Chapter Ma'idah","Al Ma'idah","Surah Al Ma'idah","Chapter Al Ma'idah","Surah 5","Chapter 5","The Table Spread","المَائدة"],"ayahNumber":715,"juzNumber":6,"footnotes":"(1) یعنی انبیائے سابقین کے فوراً بعد، متصل ہی حضرت عیسی (عليه السلام) کو بھیجا جو اپنے سے پہلے نازل شدہ کتاب تورات کی تصدیق کرنے والے تھے، اس کی تکذیب کرنے والے نہیں، جو اس بات کی دلیل تھی کہ حضرت عیسیٰ (عليه السلام) بھی اللہ کے سچے رسول ہیں اور اسی اللہ کے فرستادہ ہیں جس نے تورات حضرت موسیٰ (عليه السلام) پر نازل فرمائی تھی، تو اس کے باوجود بھی یہودیوں نے حضرت عیسیٰ (عليه السلام) کی تکذیب کی بلکہ ان کی تکفیر اور تنقیص واہانت کی۔\n(2) یعنی جس طرح تورات اپنے وقت میں لوگوں کے لئے ہدایت کا ذریعہ تھی۔ اسی طرح انجیل کے نزول کے بعد اب یہی حیثیت انجیل کو حاصل ہوگئی اور پھر قرآن کریم کے نزول کے بعد تورات وانجیل اور دیگر صحائف آسمانی پر عمل منسوخ ہوگیا اور ہدایت ونجات کا واحد ذریعہ قرآن کریم رہ گیا اور اسی پر اللہ تعالیٰ نے آسمانی کتابوں کا سلسلہ ختم فرما دیا۔ یہ گویا اسی بات کا اعلان ہے کہ قیامت تک پیدا ہونے والے انسانوں کی فلاح وکامیابی اسی قرآن سے وابستہ ہے۔ جو اس سے جڑ گیا، سرخرو رہے گا۔ جو کٹ گیا ناکامی ونامرادی اس کا مقدر ہے۔ اس سے معلوم ہوا کہ (وحدت ادیان) کا فلسفہ یکسر غلط ہے، حق ہر دور میں ایک ہی رہا ہے، متعدد نہیں۔ حق کے سوا دوسری چیزیں باطل ہیں۔ تورات اپنے دور کا حق تھی، اس کے بعد انجیل اپنے دور کا حق تھی انجیل کے نزول کے بعد تورات پر عمل کرنا جائز نہیں تھا۔ اور جب قرآن نازل ہوگیا تو انجیل منسوخ ہوگئی، انجیل پر عمل کرنا جائز نہیں رہا اور صرف قرآن ہی واحد نظام عمل اور نجات کے لئے قابل عمل رہ گیا۔ اس پر ایمان لائے بغیر یعنی نبوت محمدی (علی صاحبہا الصلاۃ والسلام) کو تسلیم کئے بغیر نجات ممکن نہیں۔ مزید ملاحظہ ہو، سورۂ بقرہ آیت 62 کا حاشیہ۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waqaffaynā ʿalā āthārihim biʿīsā ib'ni maryama muṣaddiqan limā bayna yadayhi mina al-tawrāti waātaynāhu al-injīla fīhi hudan wanūrun wamuṣaddiqan limā bayna yadayhi mina al-tawrāti wahudan wamawʿiẓatan lil'muttaqīna ","translations":["And We sent","on","their footsteps","Isa","son","(of) Maryam","confirming","what","(was) between","his hands","of","the Taurat","and We gave him","the Injeel","in it","(was) Guidance","and light","and confirming","what","(was) between","his hands","of","the Taurat","and a Guidance","and an admonition","for the God conscious","(46)"],"transliterationArr":["waqaffaynā","ʿalā","āthārihim","biʿīsā","ib'ni","maryama","muṣaddiqan","limā","bayna","yadayhi","mina","al-tawrāti","waātaynāhu","al-injīla","fīhi","hudan","wanūrun","wamuṣaddiqan","limā","bayna","yadayhi","mina","al-tawrāti","wahudan","wamawʿiẓatan","lil'muttaqīna",null],"verseTiming":[[1,0,1490],[2,1490,3430],[3,3430,5360],[4,5360,6160],[5,6160,6600],[6,6600,7490],[7,7490,8550],[8,8550,9330],[9,9330,9900],[10,9900,10830],[11,10830,11140],[12,11140,13480],[13,13480,15550],[14,15550,17400],[15,17400,18040],[16,18040,18370],[17,18370,19370],[18,19370,20800],[19,20800,22830],[20,22830,24220],[21,24220,24900],[22,24900,25480],[23,25480,26420],[24,26420,26750],[25,26750,28090],[26,28090,29590],[27,29590,30790],[28,30790,34195]]}}