{"name":"5:50","price":"کیا یہ لوگ پھر سے جاہلیت کا فیصلہ چاہتے ہیں(1) یقین رکھنے والے لوگوں کے لئے اللہ تعالیٰ سے بہتر فیصلے اور حکم کرنے واﻻ کون ہوسکتا ہے؟(2)","arabic":"أَفَحُكۡمَ ٱلۡجَٰهِلِيَّةِ يَبۡغُونَۚ وَمَنۡ أَحۡسَنُ مِنَ ٱللَّهِ حُكۡمٗا لِّقَوۡمٖ يُوقِنُونَ","category":["5 (Al-Ma'idah)","Al-Ma'idah","Surah Al-Ma'idah","Chapter Al-Ma'idah","Ma'idah","Surah Ma'idah","Chapter Ma'idah","Al Ma'idah","Surah Al Ma'idah","Chapter Al Ma'idah","Surah 5","Chapter 5","The Table Spread","المَائدة"],"ayahNumber":719,"juzNumber":6,"footnotes":"(1) اب قرآن اور اسلام کے سوا، سب جاہلیت ہے، کیا یہ اب بھی روشنی اور ہدایت (اسلام) کو چھوڑ کر جاہلیت ہی کے متلاشی اور طالب ہیں؟ یہ استفہام، انکار اور توبیخ کے لئے ہے اور (فا) لفظ مقدر پر عطف ہے اور معنی ہیں ”يُعْرِضُونَ عَنْ حُكْمِكَ بِمَا أَنْزَلَ اللهُ عَلَيْكَ وَيَتَوَلَّوْنَ عَنْهُ، يَبْتَغُونَ حُكْمَ الْجَاهِلِيَّةِ“ (تیرے اس فیصلے سے جو اللہ نے تجھ پر نازل کیا ہے یہ اعراض کرتے اور پیٹھ پھیرتے ہیں اور جاہلیت کے طریقوں کے متلاشی ہیں) (فتح القدیر)\n(2) حدیث میں آتا ہے نبی (صلى الله عليه وسلم) نے فرمایا ”أَبْغَضُ النَّاسِ إِلَى اللهِ عَزَّ وَجَلَّ ثَلاثَةٌ: مُبْتَغٍ فِي الإِسْلامِ سُنَّةَ الْجَاهِلِيَّةِ، وَطَالِبُ دَمِ امْرِئٍ بِغَيْرِ حَقٍّ لْيُرِيقَ دَمَهُ“ (صحيح بخاري- كتاب الديات) ”اللہ کو سب سے زیادہ ناپسندیدہ شخص وہ ہے جو اسلام میں جاہلیت کے طریقے کا متلاشی ہو اور جو ناحق کسی کا خون بہانے کا طالب ہو۔“","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"afaḥuk'ma al-jāhiliyati yabghūna waman aḥsanu mina al-lahi ḥuk'man liqawmin yūqinūna ","translations":["Is it then the judgment","(of the time of) ignorance","they seek","And who (is)","better","than","Allah","(in) judgment","for a people","(who) firmly believe","(50)"],"transliterationArr":["afaḥuk'ma","al-jāhiliyati","yabghūna","waman","aḥsanu","mina","al-lahi","ḥuk'man","liqawmin","yūqinūna",null],"verseTiming":[[1,0,1080],[2,1080,2880],[3,2880,6020],[4,6020,6540],[5,6540,7510],[6,7510,7840],[7,7840,8870],[8,8870,9540],[9,9540,10760],[10,10760,15165]]}}