{"name":"5:58","price":"اور جب تم نماز کے لئے پکارتے ہو تو وہ اسے ہنسی کھیل ٹھرا لیتے ہیں(1) ۔ یہ اس واسطے کہ بےعقل ہیں۔","arabic":"وَإِذَا نَادَيۡتُمۡ إِلَى ٱلصَّلَوٰةِ ٱتَّخَذُوهَا هُزُوٗا وَلَعِبٗاۚ ذَٰلِكَ بِأَنَّهُمۡ قَوۡمٞ لَّا يَعۡقِلُونَ","category":["5 (Al-Ma'idah)","Al-Ma'idah","Surah Al-Ma'idah","Chapter Al-Ma'idah","Ma'idah","Surah Ma'idah","Chapter Ma'idah","Al Ma'idah","Surah Al Ma'idah","Chapter Al Ma'idah","Surah 5","Chapter 5","The Table Spread","المَائدة"],"ayahNumber":727,"juzNumber":6,"footnotes":"(1) حدیث میں آتا ہے کہ جب شیطان اذان کی آواز سنتا ہے تو گوز مارتا ہوا بھاگ جاتا ہے، جب اذان ختم ہو جاتی ہے تو پھر آ جاتا ہے، تکبیر کے وقت پھر پیٹھ پھیر کر چل دیتا ہے، جب تکبیر ختم ہو جاتی ہے تو پھر آ کر نمازیوں کے دلوں میں وسوسے پیدا کرتا ہے۔ الحدیث (صحيح بخاري- كتاب الأذان، صحيح مسلم، كتاب الصلاة) شیطان ہی کی طرح شیطان کے پیروکاروں کو اذان کی آواز اچھی نہیں لگتی، اس لئے وہ اس کا مذاق اڑاتے ہیں۔ اس آیت سے یہ بھی معلوم ہوا کہ حدیث رسول صلی اللہ علیہ وسلم بھی قرآن کی طرح دین کا ماخذ اور اسی طرح حجت ہے۔ کیونکہ قرآن نے نماز کے لئے ”ندا“ کا تو ذکر کیا ہے لیکن یہ ”ندا“ کس طرح دی جائے گی؟ اس کے الفاظ کیا ہوں گے؟ یہ قرآن کریم میں کہیں نہیں ہے۔ یہ چیزیں حدیث سے ثابت ہیں، جو اس کی حجیت اور ماخذ دین ہونے پر دلیل ہیں۔ حجیت حدیث کا مطلب: حدیث کے ماخذ دین اور حجت شرعیہ ہونے کا مطلب ہے، کہ جس طرح قرآن کریم کی نص سے ثابت ہونے والے احکام وفرائض پر عمل کرنا ضروری اور ان کا انکار کفر ہے۔ اسی طرح حدیث رسول صلی اللہ علیہ وسلم سے ثابت ہونے والے احکام کا ماننا بھی فرض، ان پر عمل کرنا ضروری اور ان کا انکار کفر ہے۔ تاہم حدیث کا صحیح مرفوع اور متصل ہونا ضروری ہے۔ صحیح حدیث چاہے متواتر ہو یا آحاد، قولی ہو، فعلی ہو یا تقریری۔ یہ سب قابل عمل ہیں۔ حدیث کا خبر واحد کی بنیاد پر، یا قرآن سے زائد ہونے کی بنیاد پر یا ائمہ کے قیاس واجتہادات کی بنیاد پر یا راوی کی عدم فقاہت کے دعویٰ کی بنیاد پر یا عقلی استحالے کی بنیاد پر یا اسی قسم کے دیگر دعوؤں کی بنیاد پر، رد کرنا صحیح نہیں ہے۔ یہ سب حدیث سے اعراض کی مختلف صورتیں ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-idhā nādaytum ilā al-ṣalati ittakhadhūhā huzuwan walaʿiban dhālika bi-annahum qawmun lā yaʿqilūna ","translations":["And when","you make a call","for","the prayer","they take it","(in) ridicule","and fun","That","(is) because they","(are) a people","(who do) not","understand","(58)"],"transliterationArr":["wa-idhā","nādaytum","ilā","al-ṣalati","ittakhadhūhā","huzuwan","walaʿiban","dhālika","bi-annahum","qawmun","lā","yaʿqilūna",null],"verseTiming":[[1,0,1030],[2,1030,2350],[3,2350,2690],[4,2690,3810],[5,3810,5150],[6,5150,6760],[7,6760,7890],[8,7890,9340],[9,9340,11260],[10,11260,12000],[11,12000,12540],[12,12540,15405]]}}