{"name":"5:6","price":"اے ایمان والو! جب تم نماز کے لئے اٹھو تو اپنے منھ کو، اور اپنے ہاتھوں کو کہنیوں سمیت دھو لو(1) اپنے سروں کا مسح کرو(2) اور اپنے پاؤں کو ٹخنوں سمیت دھو لو(3)، اور اگر تم جنابت کی حالت میں ہو تو غسل کرلو(4)، ہاں اگر تم بیمار ہو یا سفر کی حالت میں ہو یا تم میں سے کوئی حاجت ضروری سے فارغ ہو کر آیا ہو، یا تم عورتوں سے ملے ہو اور تمہیں پانی نہ ملے تو تم پاک مٹی سے تیمم کرلو، اسے اپنے چہروں پر اور ہاتھوں پر مل لو(5) اللہ تعالیٰ تم پر کسی قسم کی تنگی ڈالنا نہیں چاہتا(6) بلکہ اس کا اراده تمہیں پاک کرنے کا اور تمہیں اپنی بھرپور نعمت دینے کا ہے(7)، تاکہ تم شکر ادا کرتے رہو۔","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا قُمۡتُمۡ إِلَى ٱلصَّلَوٰةِ فَٱغۡسِلُواْ وُجُوهَكُمۡ وَأَيۡدِيَكُمۡ إِلَى ٱلۡمَرَافِقِ وَٱمۡسَحُواْ بِرُءُوسِكُمۡ وَأَرۡجُلَكُمۡ إِلَى ٱلۡكَعۡبَيۡنِۚ وَإِن كُنتُمۡ جُنُبٗا فَٱطَّهَّرُواْۚ وَإِن كُنتُم مَّرۡضَىٰٓ أَوۡ عَلَىٰ سَفَرٍ أَوۡ جَآءَ أَحَدٞ مِّنكُم مِّنَ ٱلۡغَآئِطِ أَوۡ لَٰمَسۡتُمُ ٱلنِّسَآءَ فَلَمۡ تَجِدُواْ مَآءٗ فَتَيَمَّمُواْ صَعِيدٗا طَيِّبٗا فَٱمۡسَحُواْ بِوُجُوهِكُمۡ وَأَيۡدِيكُم مِّنۡهُۚ مَا يُرِيدُ ٱللَّهُ لِيَجۡعَلَ عَلَيۡكُم مِّنۡ حَرَجٖ وَلَٰكِن يُرِيدُ لِيُطَهِّرَكُمۡ وَلِيُتِمَّ نِعۡمَتَهُۥ عَلَيۡكُمۡ لَعَلَّكُمۡ تَشۡكُرُونَ","category":["5 (Al-Ma'idah)","Al-Ma'idah","Surah Al-Ma'idah","Chapter Al-Ma'idah","Ma'idah","Surah Ma'idah","Chapter Ma'idah","Al Ma'idah","Surah Al Ma'idah","Chapter Al Ma'idah","Surah 5","Chapter 5","The Table Spread","المَائدة"],"ayahNumber":675,"juzNumber":6,"footnotes":"(1) منہ دھوؤ یعنی ایک ایک، دو دو یا تین تین مرتبہ دونوں ہتھیلیاں دھونے، کلی کرنے، ناک میں پانی ڈال کر جھاڑنے کے بعد۔ جیسا کہ حدیث سے ثابت ہے۔ منہ دھونے کے بعد ہاتھوں کو کہنیوں سمیت دھویا جائے۔\n(2) مسح پورے سر کا کیا جائے، جیسا کہ حدیث سے ثابت ہے، اپنے ہاتھ آگے سے پیچھے گدی تک لے جائے اور پھر وہاں سے آگے کو لائے جہاں سے شروع کیا تھا۔ اسی کے ساتھ کانوﮞ کا مسح کرلے۔ اگر سر پر پگڑی یا عمامہ ہو تو حدیث کی رو سے موزوں کی طرح اس پر بھی مسح جائز ہے۔ (صحیح مسلم، کتاب الطہارۃ) علاوہ ازیں ایک مرتبہ ہی اس طرح مسح کرلینا کافی ہے۔\n(3) ”أَرْجُلَكُمْ“ کا عطف ”وُجُوهَكُمْ“ پر ہے یعنی اپنے پیر ٹخنوں تک دھوؤ! اور اگر موزے یا جرابیں پہنی ہوئی ہیں (بشرطیکہ وضو کی حالت میں پہنی ہوں) تو حدیث کی رو سے پیر دھونے کی بجائے جرابوں پر مسح بھی جائز ہے۔\nملحوظة: (1) اگر پہلے سے باوضو ہو تو نیا وضو کرنا ضروری نہیں۔ تاہم ہر نماز کے لئے تازہ وضو بہتر ہے۔ (2) وضو سے پہلے نیت فرض ہے۔ (3) وضو سے پہلے بسم اللہ پڑھنی بھی ضروری ہے۔ (4) داڑھی گھنی ہو تو اس کا خلال کیا جائے۔ (5) اعضا کو ترتیب وار دھویا جائے۔ (6) ”ان کے درمیان فاصلہ نہ کیا جائے“ یعنی ایک عضو دھونے کے بعد دوسرے عضو کے دھونے میں دیر نہ کی جائے۔ بلکہ سب اعضا تسلسل کے ساتھ یکے بعد دیگرے دھوئے جائیں۔ (7) اعضائے وضو میں سے کسی بھی عضو کا کوئی حصہ خشک نہ رہے، ورنہ وضو نہیں ہوگا۔ (8) کوئی عضو بھی تین مرتبہ سے زیادہ نہ دھویا جائے۔ ایسا کرنا خلاف سنت ہے۔ (تفسیر ابن کثیر، فتح القدیر وایسر التفاسیر )\n(4) جنابت سے مراد وہ ناپاکی ہے جو احتلام یا بیوی سے ہم بستری کرنے کی وجہ سے لاحق ہوجاتی ہے اور اسی حکم میں حیض اور نفاس بھی داخل ہے۔ جب حیض یا نفاس کا خون بند ہوجائے تو پاکیزگی حاصل کرنے کے لئے طہارت یعنی غسل ضروری ہے۔ البتہ پانی نہ ملنے کی صورت میں تیمم کی اجازت ہے جیسا کہ حدیث سے ثابت ہے۔ (فتح القدیر وایسر التفاسیر )\n(5) اس کی مختصر تشریح اور تیمم کا طریقہ سورۃ النساء کی آیت نمبر 43میں گزر چکا ہے۔ صحیح بخاری میں اس کی شان نزول کی بابت آتا ہے کہ ایک سفر میں بیداء کے مقام پر حضرت عائشہ (رضی الله عنها) کا ہار گم ہوگیا جس کی وجہ سے وہاں رکنا یا رکے رہنا پڑا۔ صبح کی نماز کے لئے لوگوں کے پاس پانی نہ تھا اور تلاش ہوئی تو پانی دستیاب بھی نہیں ہوا۔ اس موقع پر یہ آیت نازل ہوئی جس میں تیمم کی اجازت دی گئی ہے۔ حضرت اسید بن حضیر (رضي الله عنه) نے آیت سن کر کہا ”اے آل ابی بکر! تمہاری وجہ سے اللہ نے لوگوں کے لئے برکتیں نازل فرمائی ہیں اور یہ تمہاری کوئی پہلی برکت نہیں ہے۔“ (تم لوگوں کے لئے سراپا برکت ہو۔) (صحیح بخاری۔ سورۃ المائدۃ)\n(6) اسی لئے تیمم کی اجازت مرحمت فرما دی ہے۔\n(7) اسی لئے حدیث میں وضو کرنے کے بعد دعا کرنے کی ترغیب ہے۔ دعاؤں کی کتابوں سے یہ دعا یاد کرلی جائے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāayyuhā alladhīna āmanū idhā qum'tum ilā al-ṣalati fa-igh'silū wujūhakum wa-aydiyakum ilā al-marāfiqi wa-im'saḥū biruūsikum wa-arjulakum ilā al-kaʿbayni wa-in kuntum junuban fa-iṭṭahharū wa-in kuntum marḍā aw ʿalā safarin aw jāa aḥadun minkum mina al-ghāiṭi aw lāmastumu al-nisāa falam tajidū māan fatayammamū ṣaʿīdan ṭayyiban fa-im'saḥū biwujūhikum wa-aydīkum min'hu mā yurīdu al-lahu liyajʿala ʿalaykum min ḥarajin walākin yurīdu liyuṭahhirakum waliyutimma niʿ'matahu ʿalaykum laʿallakum tashkurūna ","translations":["O you","who","believe","When","you stand up","for","the prayer","then wash","your faces","and your hands","till","the elbows","and wipe","your heads","and your feet","till","the ankles","But if","you are","(in) a state of ceremonial impurity","then purify yourselves","But if","you are","ill","or","on","a journey","or","has come","anyone","of you","from","the toilet","or","has (had) contact","(with) the women","and not","you find","water","then do tayyammum","(with) earth","clean","then wipe","your faces","and your hands","with it","Does not","intend","Allah","to make","for you","any","difficulty","but","He intends","to purify you","and to complete","His Favor","upon you","so that you may","(be) grateful","(6)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","idhā","qum'tum","ilā","al-ṣalati","fa-igh'silū","wujūhakum","wa-aydiyakum","ilā","al-marāfiqi","wa-im'saḥū","biruūsikum","wa-arjulakum","ilā","al-kaʿbayni","wa-in","kuntum","junuban","fa-iṭṭahharū","wa-in","kuntum","marḍā","aw","ʿalā","safarin","aw","jāa","aḥadun","minkum","mina","al-ghāiṭi","aw","lāmastumu","al-nisāa","falam","tajidū","māan","fatayammamū","ṣaʿīdan","ṭayyiban","fa-im'saḥū","biwujūhikum","wa-aydīkum","min'hu","mā","yurīdu","al-lahu","liyajʿala","ʿalaykum","min","ḥarajin","walākin","yurīdu","liyuṭahhirakum","waliyutimma","niʿ'matahu","ʿalaykum","laʿallakum","tashkurūna",null],"verseTiming":[[1,0,2930],[2,2930,4110],[3,4110,5630],[4,5630,6850],[5,6850,7800],[6,7800,8140],[7,8140,9270],[8,9270,10440],[9,10440,11650],[10,11650,13080],[11,13080,13410],[12,13410,14900],[13,14900,16590],[14,16590,17770],[15,17770,19230],[16,19230,19570],[17,19570,20790],[18,20790,21780],[19,21780,23240],[20,23240,24640],[21,24640,24990],[22,24990,26060],[23,26060,28820],[24,28820,30140],[25,30140,31330],[26,31330,33310],[27,33310,34750],[28,34750,35870],[29,35870,38809],[30,38809,39159],[31,39159,39759],[32,39759,40599],[33,40599,40949],[34,40949,42639],[35,42639,43339],[36,43339,45049],[37,45049,46199],[38,46199,48499],[39,48499,49289],[40,49289,51309],[41,51309,51839],[42,51839,53999],[43,53999,55009],[44,55009,57609],[45,57609,57959],[46,57959,59139],[47,59139,61859],[48,61859,62459],[49,62459,63379],[50,63379,64259],[51,64259,65459],[52,65459,68369],[53,68369,68949],[54,68949,69779],[55,69779,72349],[56,72349,74069],[57,74069,75719],[58,75719,77409],[59,77409,79189],[60,79189,80769],[61,80769,82219],[62,82219,83259],[63,83259,84719],[64,84719,85999],[65,85999,87679],[66,87679,88339],[67,88339,89079],[68,89079,89939],[69,89939,90949],[70,90949,91889],[71,91889,92829],[72,92829,94369],[73,94369,95699],[74,95699,96419],[75,96419,98169],[76,98169,100009],[77,100009,101209],[78,101209,102549],[79,102549,103969],[80,103969,104729],[81,104729,106419],[82,106419,108189],[83,108189,109449],[84,109449,110609],[85,110609,111849],[86,111849,114444]]}}