{"name":"5:64","price":"اور یہودیوں نے کہا کہ اللہ تعالیٰ کے ہاتھ بندھے ہوئے ہیں(1) ۔ انہی کے ہاتھ بندھے ہوئے ہیں اور ان کے اس قول کی وجہ سے ان پر لعنت کی گئی، بلکہ اللہ تعالیٰ کے دونوں ہاتھ کھلے ہوئے ہیں۔ جس طرح چاہتا ہے خرچ کرتا ہے اور جو کچھ تیری طرف تیرے رب کی جانب سے اتارا جاتا ہے وه ان میں سے اکثر کو تو سرکشی اور کفر میں اور بڑھا دیتا ہے اور ہم نے ان میں آپس میں ہی قیامت تک کے لئے عداوت اور بغض ڈال دیا ہے، وه جب کبھی لڑائی کی آگ کو بھڑکانا چاہتے ہیں تو اللہ تعالیٰ اسے بجھا دیتا ہے(2)، یہ ملک بھر میں شر وفساد مچاتے پھرتے ہیں(3) اور اللہ تعالیٰ فسادیوں سے محبت نہیں کرتا۔","arabic":"وَقَالَتِ ٱلۡيَهُودُ يَدُ ٱللَّهِ مَغۡلُولَةٌۚ غُلَّتۡ أَيۡدِيهِمۡ وَلُعِنُواْ بِمَا قَالُواْۘ بَلۡ يَدَاهُ مَبۡسُوطَتَانِ يُنفِقُ كَيۡفَ يَشَآءُۚ وَلَيَزِيدَنَّ كَثِيرٗا مِّنۡهُم مَّآ أُنزِلَ إِلَيۡكَ مِن رَّبِّكَ طُغۡيَٰنٗا وَكُفۡرٗاۚ وَأَلۡقَيۡنَا بَيۡنَهُمُ ٱلۡعَدَٰوَةَ وَٱلۡبَغۡضَآءَ إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِۚ كُلَّمَآ أَوۡقَدُواْ نَارٗا لِّلۡحَرۡبِ أَطۡفَأَهَا ٱللَّهُۚ وَيَسۡعَوۡنَ فِي ٱلۡأَرۡضِ فَسَادٗاۚ وَٱللَّهُ لَا يُحِبُّ ٱلۡمُفۡسِدِينَ","category":["5 (Al-Ma'idah)","Al-Ma'idah","Surah Al-Ma'idah","Chapter Al-Ma'idah","Ma'idah","Surah Ma'idah","Chapter Ma'idah","Al Ma'idah","Surah Al Ma'idah","Chapter Al Ma'idah","Surah 5","Chapter 5","The Table Spread","المَائدة"],"ayahNumber":733,"juzNumber":6,"footnotes":"(1) یہ وہی بات ہے جو سورۂ آل عمران کی آیت 181 میں کی گئی ہے کہ اللہ تعالیٰ نے جب اپنی راہ میں خرچ کرنے کی ترغیب دی اور اسے اللہ کو قرض حسن دینے سے تعبیر کیا تو ان یہودیوں نے کہا کہ ”اللہ تعالیٰ تو فقیر ہے“ لوگوں سے قرض مانگ رہا ہے اور وہ تعبیر کے اس حسن کو نہ سمجھ سکے جو اس میں پنہاں تھا۔ یعنی سب کچھ اللہ کا دیا ہوا ہے۔ اور اللہ کے دیئے ہوئے مال میں سے کچھ اللہ کی راہ میں خرچ کردینا، کوئی قرض نہیں ہے۔ لیکن یہ اس کی کمال مہربانی ہے کہ وہ اس پر بھی خوب اجر عطا فرماتا ہے۔ حتیٰ کہ ایک ایک دانے کو سات سات سو دانے تک بڑھا دیتا ہے۔ اور اسے قرض حسن سے اسی لئے تعبیر فرمایا کہ جتنا تم خرچ کرو گے، اللہ تعالیٰ اس سے کئی گنا تمہیں واپس لوٹائے گا۔ ”مَغْلُولَةٌ“ کے معنی ”بَخِيلَةٌ“ (بخل والے) کئے گئے ہیں۔ یعنی یہود کا مقصد یہ نہیں تھا کہ اللہ کے ہاتھ واقعتاً بندھے ہوئے ہیں، بلکہ ان کا مقصد یہ تھا کہ اس نے اپنے ہاتھ خرچ کرنے سے روکے ہوئے ہیں۔ (ابن کثیر) اللہ تعالیٰ نے فرمایا ”ہاتھ تو انہی کے بندھے ہوئے ہیں“ یعنی بخیلی انہی کا شیوہ ہے۔ اللہ تعالیٰ کے تو دونوں ہاتھ کھلے ہوتے ہیں، وہ جس طرح چاہتا ہے۔ خرچ کرتا ہے۔ وہ وَاسِعُ الْفَضْلِ اورجَزِيلُ الْعَطَاءِ ہے، تمام خزانے اسی کے پاس ہیں۔ نیز اس نے اپنی مخلوقات کے لئے تمام حاجات وضروریات کا انتظام کیا ہوا ہے، ہمیں رات یا دن کو، سفرمیں اور حضر میں اور دیگر تمام احوال میں جن جن چیزوں کی ضرورت پڑتی ہے یا پڑ سکتی ہے، سب وہی مہیا کرتا ہے۔ «وَآتَاكُمْ مِنْ كُلِّ مَا سَأَلْتُمُوهُ وَإِنْ تَعُدُّوا نِعْمَةَ اللَّهِ لا تُحْصُوهَا إِنَّ الإِنْسَانَ لَظَلُومٌ كَفَّارٌ» ( سورۂ ابراہیم: 34) ”تم نے جو کچھ اس سے مانگا، وہ اس نے تمہیں دیا، اللہ کی نعمتیں اتنی ہیں کہ تم گن نہیں سکتے، انسان ہی نادان اور نہایت ناشکرا ہے“۔ حدیث میں بھی ہے نبی (صلى الله عليه وسلم)نے فرمایا: ”اللہ کا دایاں ہاتھ بھرا ہوا ہے، رات دن خرچ کرتا ہے لیکن کوئی کمی نہیں آتی، ذرا دیکھو تو، جب سے آسمان و زمین اس نے پیدا کئے ہیں وہ خرچ کر رہا ہے لیکن اس کے ہاتھ کے خزانے میں کمی نہیں آئی...“ (البخاري، كتاب التوحيد، باب وكان عرشه على الماء- مسلم، كتاب الزكاة، باب الحث على النفقة)\n(2) یعنی یہ جب بھی آپ کے خلاف کوئی سازش کرتے یا لڑائی کے اسباب مہیا کرتے ہیں تو اللہ تعالیٰ ان کو باطل کردیتا اور ان کی سازش کو انہی پر الٹا دیتا ہے اور ان کو ”چاہ کن را چاہ درپیش“ کی سی صورتحال سے دوچار کر دیتا ہے۔\n(3) ان کی عادت ثانیہ ہے کہ ہمیشہ زمین میں فساد پھیلانے کی مذموم کوششیں کرتے ہیں دراں حالیکہ اللہ تعالیٰ مفسدین کو پسند نہیں فرماتا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waqālati al-yahūdu yadu al-lahi maghlūlatun ghullat aydīhim waluʿinū bimā qālū bal yadāhu mabsūṭatāni yunfiqu kayfa yashāu walayazīdanna kathīran min'hum mā unzila ilayka min rabbika ṭugh'yānan wakuf'ran wa-alqaynā baynahumu al-ʿadāwata wal-baghḍāa ilā yawmi al-qiyāmati kullamā awqadū nāran lil'ḥarbi aṭfa-ahā al-lahu wayasʿawna fī al-arḍi fasādan wal-lahu lā yuḥibbu al-muf'sidīna ","translations":["And said","the Jews","The Hand","(of) Allah","(is) chained","Are chained","their hands","and they have been cursed","for what","they said","Nay","His Hands","(are) stretched out","He spends","how","He wills","And surely increase","many","of them","what","has been revealed","to you","from","your Lord","(in) rebellion","and disbelief","And We have cast","among them","[the] enmity","and [the] hatred","till","(the) Day","(of) the Resurrection","Every time","they kindled","(the) fire","of [the] war","it (was) extinguished","(by) Allah","And they strive","in","the earth","spreading corruption","And Allah","(does) not","love","the corrupters","(64)"],"transliterationArr":["waqālati","al-yahūdu","yadu","al-lahi","maghlūlatun","ghullat","aydīhim","waluʿinū","bimā","qālū","bal","yadāhu","mabsūṭatāni","yunfiqu","kayfa","yashāu","walayazīdanna","kathīran","min'hum","mā","unzila","ilayka","min","rabbika","ṭugh'yānan","wakuf'ran","wa-alqaynā","baynahumu","al-ʿadāwata","wal-baghḍāa","ilā","yawmi","al-qiyāmati","kullamā","awqadū","nāran","lil'ḥarbi","aṭfa-ahā","al-lahu","wayasʿawna","fī","al-arḍi","fasādan","wal-lahu","lā","yuḥibbu","al-muf'sidīna",null],"verseTiming":[[1,0,1290],[2,1290,2260],[3,2260,2630],[4,2630,3500],[5,3500,5130],[6,5130,6060],[7,6060,7300],[8,7300,8290],[9,8290,8940],[10,8940,9820],[11,9820,10570],[12,10570,11490],[13,11490,13190],[14,13190,14530],[15,14530,15130],[16,15130,17100],[17,17100,19550],[18,19550,20480],[19,20480,21820],[20,21820,24190],[21,24190,25650],[22,25650,26530],[23,26530,26770],[24,26770,27740],[25,27740,28890],[26,28890,31080],[27,31080,32490],[28,32490,33440],[29,33440,34850],[30,34850,36160],[31,36160,37920],[32,37920,38510],[33,38510,39140],[34,39140,40860],[35,40860,43030],[36,43030,44060],[37,44060,44850],[38,44850,45940],[39,45940,46930],[40,46930,49990],[41,49990,51120],[42,51120,51420],[43,51420,52190],[44,52190,53390],[45,53390,54700],[46,54700,55100],[47,55100,55880],[48,55880,58895]]}}