{"name":"5:67","price":"اے رسول جو کچھ بھی آپ کی طرف آپ کے رب کی جانب سے نازل کیا گیا ہے پہنچا دیجیئے۔ اگر آپ نے ایسا نہ کیا تو آپ نے اللہ کی رسالت ادا نہیں کی(1) ، اور آپ کو اللہ تعالیٰ لوگوں سے بچا لے گ(2)ا بےشک اللہ تعالیٰ کافر لوگوں کو ہدایت نہیں دیتا۔","arabic":"۞ يَٰٓأَيُّهَا ٱلرَّسُولُ بَلِّغۡ مَآ أُنزِلَ إِلَيۡكَ مِن رَّبِّكَۖ وَإِن لَّمۡ تَفۡعَلۡ فَمَا بَلَّغۡتَ رِسَالَتَهُۥۚ وَٱللَّهُ يَعۡصِمُكَ مِنَ ٱلنَّاسِۗ إِنَّ ٱللَّهَ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلۡكَٰفِرِينَ","category":["5 (Al-Ma'idah)","Al-Ma'idah","Surah Al-Ma'idah","Chapter Al-Ma'idah","Ma'idah","Surah Ma'idah","Chapter Ma'idah","Al Ma'idah","Surah Al Ma'idah","Chapter Al Ma'idah","Surah 5","Chapter 5","The Table Spread","المَائدة"],"ayahNumber":736,"juzNumber":6,"footnotes":"(1) اس حکم کا مفاد یہ ہے کہ جو کچھ آپ (صلى الله عليه وسلم) پر نازل کیا گیا ہے، بلاکم وکاست اور بلاخوف لومۃ لائم آپ لوگوں تک پہنچا دیں، چنانچہ آپ (صلى الله عليه وسلم) نے ایسا ہی کیا۔ حضرت عائشہ (رضی الله عنها) فرماتی ہیں کہ ”جو شخص یہ گمان کرے کہ نبی (صلى الله عليه وسلم) نے کچھ چھپا لیا، اس نے یقیناً جھوٹ کہا۔“ (صحيح بخاري۔ 4855) اور حضرت علی (رضي الله عنه) سے بھی جب سوال کیا گیا کہ تمہارے پاس قرآن کے علاوہ وحی کے ذریعے سے نازل شدہ کوئی بات ہے؟ تو انہوں نے قسم کھا کر نفی فرمائی اور فرمایا ”الا فَهْمًا يُعْطِيهِ اللهُ رَجُلا“ (البتہ قرآن کا فہم ہے جسے اللہ تعالیٰ کسی کو بھی عطا فرما دے) (صحيح بخاري -نمبر3-69) اورحجۃ الوداع کے موقع پر آپ (صلى الله عليه وسلم) نے صحابہ کے ایک لاکھ یا ایک لاکھ چالیس ہزار کے جم غفیر میں فرمایا ”تم میرے بارے میں کیا کہو گے ؟ انہوں نے کہا: نَشْهَدُ أَنَّكَ قَدْ بَلَّغْتَ، وَأَدَّيْتَ، وَنَصَحْتَ ( ہم گواہی دیں گے کہ آپ نے اللہ کا پیغام دیا اور ادا کردیا اور خیرخواہی فرما دی)، آپ (صلى الله عليه وسلم) نے آسمان کی طرف انگلی کا اشارہ کرتے ہوئے فرمایا ”اللَّهُمَّ هَلْ بَلَّغْتُ“ ( تین مرتبہ) یا ”اللَّهُمَّ فَاشْهَدْ“ ( تین مرتبہ) (صحيح مسلم، كتاب الحج، باب حجة النبي صلى الله عليه وسلم) یعنی اے اللہ! میں نے تیرا پیغام پہنچا دیا، تو گواہ رہ، تو گواہ رہ، تو گواہ رہ۔\n(2) یہ حفاظت اللہ تعالیٰ نے معجزانہ طریقہ پر بھی فرمائی اور دنیاوی اسباب کے تحت بھی دنیاوی اسباب کے تحت اس آیت کے نزول سے بہت قبل اللہ تعالیٰ نے پہلے آپ کے چچا ابوطالب کے دل میں آپ کی طبعی محبت ڈال دی، اور وہ آپ کی حفاظت کرتے رہے، ان کا کفر پر قائم رہنا بھی شاید انہی اسباب کا ایک حصہ معلوم ہوتا ہے۔ کیوں کہ اگر وہ مسلمان ہوجاتے تو شاید سرداران قریش کے دل میں ان کی وہ ہیبت وعظمت نہ رہتی جو ان کے ہم مذہب ہونے کی صورت میں آخر وقت تک رہی۔ پھر ان کی وفات کے بعد اللہ تعالیٰ نے بعض سرداران قریش کے ذریعہ پھر انصار مدینہ کے ذریعے سے آپ کا تحفظ فرمایا۔ پھر جب یہ آیت نازل ہوگئی تو آپ نے تحفظ کے ظاہری اسباب (پہرے وغیرہ) اٹھوا دیئے۔ اس کے بعد بارہا سنگین خطرے پیش آئے لیکن اللہ نے حفاظت فرمائی۔ چنانچہ وحی کے ذریعے سے اللہ نے وقتاً فوقتاً یہودیوں کے مکر وکید سے مطلع فرماکر خاص خطرے کے مواقع پر بچایا اور گھمسان کی جنگوں میں کفار کے انتہائی پرخطر حملوں سے بھی آپ کو محفوظ رکھا۔ ذَلِكَ مِنْ قُدْرَةِ اللهِ وَقَدَّرَهُ بِمَا شَاءَ، وَلا يَرُدُّ قَدَرَ اللهِ وَقَضَاءَهُ أَحَدٌ وَلا يَغْلِبُهُ وَهُوَ الْعَزِيزُ الْعَلِيمُ.","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāayyuhā al-rasūlu balligh mā unzila ilayka min rabbika wa-in lam tafʿal famā ballaghta risālatahu wal-lahu yaʿṣimuka mina al-nāsi inna al-laha lā yahdī al-qawma al-kāfirīna ","translations":["O","Messenger","Convey","what","has been revealed","to you","from","your Lord","and if","not","you do","then not","you (have) conveyed","His Message","And Allah","will protect you","from","the people","Indeed","Allah","(does) not","guide","the people","the disbelieving","(67)"],"transliterationArr":["yāayyuhā","al-rasūlu","balligh","mā","unzila","ilayka","min","rabbika","wa-in","lam","tafʿal","famā","ballaghta","risālatahu","wal-lahu","yaʿṣimuka","mina","al-nāsi","inna","al-laha","lā","yahdī","al-qawma","al-kāfirīna",null],"verseTiming":[[1,0,2630],[2,2630,3630],[3,3630,4400],[4,4400,6120],[5,6120,7540],[6,7540,8320],[7,8320,8460],[8,8460,9900],[9,9900,10220],[10,10220,10800],[11,10800,11560],[12,11560,12230],[13,12230,13270],[14,13270,14760],[15,14760,15680],[16,15680,16730],[17,16730,17170],[18,17170,19860],[19,19860,20960],[20,20960,21870],[21,21870,22180],[22,22180,22870],[23,22870,23600],[24,23600,26175]]}}