{"name":"5:68","price":"آپ کہہ دیجیئے کہ اے اہل کتاب! تم دراصل کسی چیز پر نہیں جب تک کہ تورات وانجیل کو اور جو کچھ تمہاری طرف تمہارے رب کی سے طرف اتارا گیا ہے قائم نہ کرو، جو کچھ آپ کی جانب آپ کے رب کی طرف سے اترا ہے وه ان میں سے بہتوں کو شرارت اور انکار میں اور بھی بڑھائے گا ہی(1) ، تو آپ ان کافروں پر غمگین نہ ہوں۔","arabic":"قُلۡ يَٰٓأَهۡلَ ٱلۡكِتَٰبِ لَسۡتُمۡ عَلَىٰ شَيۡءٍ حَتَّىٰ تُقِيمُواْ ٱلتَّوۡرَىٰةَ وَٱلۡإِنجِيلَ وَمَآ أُنزِلَ إِلَيۡكُم مِّن رَّبِّكُمۡۗ وَلَيَزِيدَنَّ كَثِيرٗا مِّنۡهُم مَّآ أُنزِلَ إِلَيۡكَ مِن رَّبِّكَ طُغۡيَٰنٗا وَكُفۡرٗاۖ فَلَا تَأۡسَ عَلَى ٱلۡقَوۡمِ ٱلۡكَٰفِرِينَ","category":["5 (Al-Ma'idah)","Al-Ma'idah","Surah Al-Ma'idah","Chapter Al-Ma'idah","Ma'idah","Surah Ma'idah","Chapter Ma'idah","Al Ma'idah","Surah Al Ma'idah","Chapter Al Ma'idah","Surah 5","Chapter 5","The Table Spread","المَائدة"],"ayahNumber":737,"juzNumber":6,"footnotes":"(1) یہ ہدایت اور گمراہی اس اصول کے مطابق ہے جو سنت اللہ رہی ہے۔ یعنی جس طرح بعض اعمال واشیا سے اہل ایمان کے ایمان وتصدیق، عمل صالح اور علم نافع میں اضافہ ہوتا ہے، اسی طرح معاصی اور تمرد سے کفر وطغیان میں زیادتی ہوتی ہے۔ اس مضمون کو اللہ تعالیٰ نے قرآن کریم میں متعدد جگہ بیان فرمایا ہے۔ مثلاً ”قُلْ هُوَ لِلَّذِينَ آمَنُوا هُدًى وَشِفَاءٌ وَالَّذِينَ لا يُؤْمِنُونَ فِي آذَانِهِمْ وَقْرٌ وَهُوَ عَلَيْهِمْ عَمًى أُولَئِكَ يُنَادَوْنَ مِنْ مَكَانٍ بَعِيدٍ“ (حم السجدة: 44) ”فرما دیجئے یہ قرآن ایمان والوں کے لئے ہدایت اور شفا ہے اور جو لوگ ایمان نہیں لاتے ان کے کانوﮞ میں گرانی (بہراپن) ہے اور یہ ان پر اندھاپن ہے۔ گرانی کے سبب ان کو (گویا) دور جگہ سے آواز دی جاتی ہے“۔ ”وَنُنَزِّلُ مِنَ الْقُرْآنِ مَا هُوَ شِفَاءٌ وَرَحْمَةٌ لِلْمُؤْمِنِينَ وَلا يَزِيدُ الظَّالِمِينَ إِلا خَسَارًا“ (بني إسرائيل: 82) ”اور ہم قرآن کے ذریعے سے وہ چیز نازل کرتے ہیں جو مومنوں کے لئے شفا اور رحمت ہے اور ظالموں کے حق میں تو نقصان ہی کا بڑھانا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qul yāahla al-kitābi lastum ʿalā shayin ḥattā tuqīmū al-tawrāta wal-injīla wamā unzila ilaykum min rabbikum walayazīdanna kathīran min'hum mā unzila ilayka min rabbika ṭugh'yānan wakuf'ran falā tasa ʿalā al-qawmi al-kāfirīna ","translations":["Say","O People","(of) the Book","You are not","on","anything","until","you stand firmly","(by) the Taurat","and the Injeel","and what","has been revealed","to you","from","your Lord","And surely increase","many","of them","what","has been revealed","to you","from","your Lord","(in) rebellion","and disbelief","So (do) not","grieve","over","the people","the disbelieving","(68)"],"transliterationArr":["qul","yāahla","al-kitābi","lastum","ʿalā","shayin","ḥattā","tuqīmū","al-tawrāta","wal-injīla","wamā","unzila","ilaykum","min","rabbikum","walayazīdanna","kathīran","min'hum","mā","unzila","ilayka","min","rabbika","ṭugh'yānan","wakuf'ran","falā","tasa","ʿalā","al-qawmi","al-kāfirīna",null],"verseTiming":[[1,0,550],[2,550,2880],[3,2880,4070],[4,4070,4790],[5,4790,5350],[6,5350,6200],[7,6200,6980],[8,6980,7810],[9,7810,10290],[10,10290,11510],[11,11510,12360],[12,12360,13620],[13,13620,15670],[14,15670,17310],[15,17310,18750],[16,18750,19630],[17,19630,20350],[18,20350,21990],[19,21990,23950],[20,23950,24850],[21,24850,26160],[22,26160,28470],[23,28470,29630],[24,29630,30410],[25,30410,30590],[26,30590,31750],[27,31750,33010],[28,33010,35240],[29,35240,35800],[30,35800,36550],[31,36550,36940],[32,36940,37730],[33,37730,40485]]}}