{"name":"5:77","price":"کہہ دیجیئے اے اہل کتاب! اپنے دین میں ناحق غلو اور زیادتی نہ کرو(1) اور ان لوگوں کی نفسانی خواہشوں کی پیروی نہ کرو جو پہلے سے بہک چکے ہیں اور بہتوں کو بہکا بھی چکے(2) ہیں اور سیدھی راه سے ہٹ گئے ہیں۔","arabic":"قُلۡ يَٰٓأَهۡلَ ٱلۡكِتَٰبِ لَا تَغۡلُواْ فِي دِينِكُمۡ غَيۡرَ ٱلۡحَقِّ وَلَا تَتَّبِعُوٓاْ أَهۡوَآءَ قَوۡمٖ قَدۡ ضَلُّواْ مِن قَبۡلُ وَأَضَلُّواْ كَثِيرٗا وَضَلُّواْ عَن سَوَآءِ ٱلسَّبِيلِ","category":["5 (Al-Ma'idah)","Al-Ma'idah","Surah Al-Ma'idah","Chapter Al-Ma'idah","Ma'idah","Surah Ma'idah","Chapter Ma'idah","Al Ma'idah","Surah Al Ma'idah","Chapter Al Ma'idah","Surah 5","Chapter 5","The Table Spread","المَائدة"],"ayahNumber":746,"juzNumber":6,"footnotes":"(1) یعنی اتباع حق میں حد سے تجاوز نہ کرو اور جن کی تعظیم کا حکم دیا گیا ہے، اس میں مبالغہ کرکے انہیں منصب نبوت سے اٹھا کر مقام الوہیت پر فائز مت کرو، جیسے حضرت مسیح (عليه السلام) کے معاملے میں تم نے کیا۔ غلو ہر دور میں شرک اور گمراہی کا سب سے بڑا ذریعہ رہا ہے۔ انسان کو جس سے عقیدت ومحبت ہوتی ہے، وہ اس کی شان میں خوب مبالغہ کرتا ہے۔ وہ امام اور دینی قائد ہے تو اس کو پیغمبر کی طرح معصوم سمجھنا اور پیغمبر کو خدائی صفات سے متصف ماننا عام بات ہے، بدقسمتی سے مسلمان بھی اس غلو سے محفوظ نہیں رہ سکے۔ ا نہوں نے بعض ائمہ کی شان میں بھی غلو کیا اور ان کی رائے اور قول، حتیٰ کہ ان کی طرف منسوب فتویٰ اور فقہ کو بھی حدیث رسول (صلى الله عليه وسلم) کے مقابلے میں ترجیح دے دی۔\n(2) یعنی اپنے سے پہلے لوگوں کے پیچھے مت لگو، جو ایک نبی کو الٰہ بنا کر خود بھی گمراہ ہوئے اور دوسروں کو بھی گمراہ کیا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qul yāahla al-kitābi lā taghlū fī dīnikum ghayra al-ḥaqi walā tattabiʿū ahwāa qawmin qad ḍallū min qablu wa-aḍallū kathīran waḍallū ʿan sawāi al-sabīli ","translations":["Say","O People","(of) the Book","(Do) not","exceed","in","your religion","other than","the truth","and (do) not","follow","(vain) desires","(of) a people","certainly","who went astray","from","before","and they misled","many","and they have strayed","from","(the) right","[the] way","(77)"],"transliterationArr":["qul","yāahla","al-kitābi","lā","taghlū","fī","dīnikum","ghayra","al-ḥaqi","walā","tattabiʿū","ahwāa","qawmin","qad","ḍallū","min","qablu","wa-aḍallū","kathīran","waḍallū","ʿan","sawāi","al-sabīli",null],"verseTiming":[[1,0,460],[2,460,2590],[3,2590,3730],[4,3730,4200],[5,4200,5000],[6,5000,5470],[7,5470,6550],[8,6550,7160],[9,7160,7990],[10,7990,8560],[11,8560,10660],[12,10660,13190],[13,13190,14480],[14,14480,14790],[15,14790,15670],[16,15670,16540],[17,16540,17150],[18,17150,18270],[19,18270,19770],[20,19770,20770],[21,20770,22250],[22,22250,23040],[23,23040,23560],[24,23560,27825]]}}