{"name":"5:79","price":"آپس میں ایک دوسرے کو برے کاموں سے جو وه کرتے تھے روکتے نہ تھے(1) جو کچھ بھی یہ کرتے تھے یقیناً وه بہت برا تھا۔","arabic":"كَانُواْ لَا يَتَنَاهَوۡنَ عَن مُّنكَرٖ فَعَلُوهُۚ لَبِئۡسَ مَا كَانُواْ يَفۡعَلُونَ","category":["5 (Al-Ma'idah)","Al-Ma'idah","Surah Al-Ma'idah","Chapter Al-Ma'idah","Ma'idah","Surah Ma'idah","Chapter Ma'idah","Al Ma'idah","Surah Al Ma'idah","Chapter Al Ma'idah","Surah 5","Chapter 5","The Table Spread","المَائدة"],"ayahNumber":748,"juzNumber":6,"footnotes":"(1) اس پرمستزاد یہ کہ وہ ایک دوسرے کو برائی سے روکتے نہیں تھے۔ جو بجائے خود ایک بہت بڑا جرم ہے۔ بعض مفسرین نے اسی ترک نہی کو عصیان اور اعتدا قرار دیا ہے جو لعنت کا سبب بنا۔ بہرحال دونوں صورتوں میں برائی کو دیکھتے ہوئے برائی سے نہ روکنا، بہت بڑا جرم اور لعنت وغضب الٰہی کا سبب ہے۔ حدیث میں بھی اس جرم پر بڑی سخت وعیدیں بیان فرمائی گئی ہیں۔ ایک حدیث میں نبی (صلى الله عليه وسلم) نے فرمایا: ”سب سے پہلا نقص جو بنی اسرائیل میں داخل ہوا یہ تھا کہ ایک آدمی دوسرے آدمی کو برائی کرتے ہوئے دیکھتا تو کہتا، اللہ سے ڈر اور یہ برائی چھوڑ دے، یہ تیرے لئے جائز نہیں۔ لیکن دوسرے روز پھر اسی کے ساتھ اسے کھانے پینے اور اٹھنے بیٹھنے میں کوئی عار یا شرم محسوس نہ ہوتی، (یعنی اس کا ہم نوالہ وہم پیالہ اور ہم نشین بن جاتا) درآں حالیکہ ایمان کا تقاضا اس سے نفرت اور ترک تعلق تھا۔ جس پر اللہ تعالیٰ نے ان کے درمیان آپس میں عداوت ڈال دی اور وہ لعنت الہیٰ کے مستحق قرار پائے“ پھر فرمایا کہ ”اللہ کی قسم! تم ضرور لوگوں کو نیکی کا حکم دیا کرو اور برائی سے روکا کرو، ظالم کا ہاتھ پکڑ لیا کرو (ورنہ تمہارا حال بھی یہی ہوگا )...“ الحدیث (ابو داود- كتاب الملاحم نمبر 4336) ایک دوسری راویت میں اس فریضے کے ترک پر یہ وعید سنائی گئی ہے کہ تم عذاب الٰہی کے مستحق بن جاؤ گے، پھر تم اللہ سے دعائیں بھی مانگو گے تو قبول نہیں ہوں گی۔ (مسند احمد، جلد 5،ص 388)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"kānū lā yatanāhawna ʿan munkarin faʿalūhu labi'sa mā kānū yafʿalūna ","translations":["They had been","not","forbidding each other","from","wrongdoing","they did [it]","Surely, evil","(was) what","they were","doing","(79)"],"transliterationArr":["kānū","lā","yatanāhawna","ʿan","munkarin","faʿalūhu","labi'sa","mā","kānū","yafʿalūna",null],"verseTiming":[[1,0,1020],[2,1020,1500],[3,1500,2920],[4,2920,3270],[5,3270,6180],[6,6180,8850],[7,8850,9670],[8,9670,10090],[9,10090,11020],[10,11020,13475]]}}