{"name":"5:84","price":"اور ہمارے پاس کون سا عذر ہے کہ ہم اللہ تعالیٰ پر اور جو حق ہم کو پہنچا ہے اس پر ایمان نہ ﻻئیں اور ہم اس بات کی امید رکھتے ہیں کہ ہمارا رب ہم کو نیک لوگوں کی رفاقت میں داخل کردے گا۔(1)","arabic":"وَمَا لَنَا لَا نُؤۡمِنُ بِٱللَّهِ وَمَا جَآءَنَا مِنَ ٱلۡحَقِّ وَنَطۡمَعُ أَن يُدۡخِلَنَا رَبُّنَا مَعَ ٱلۡقَوۡمِ ٱلصَّٰلِحِينَ","category":["5 (Al-Ma'idah)","Al-Ma'idah","Surah Al-Ma'idah","Chapter Al-Ma'idah","Ma'idah","Surah Ma'idah","Chapter Ma'idah","Al Ma'idah","Surah Al Ma'idah","Chapter Al Ma'idah","Surah 5","Chapter 5","The Table Spread","المَائدة"],"ayahNumber":753,"juzNumber":7,"footnotes":"(1) حبشے میں، جہاں مسلمان مکی زندگی میں دو مرتبہ ہجرت کرکے گئے۔ أَصْحَمَة نجاشی کی حکومت تھی، یہ عیسائی مملکت تھی۔ یہ آیات حبشے میں رہنے والے عیسائیوں ہی کے بارے میں نازل ہوئی ہیں تاہم روایات کی رو سے نبی (صلى الله عليه وسلم) نے حضرت عمرو بن امیہ ضمری (رضي الله عنه) کو اپنا مکتوب دے کر نجاشی کے پاس بھیجا تھا، جو انہوں نے جا کر اسے سنایا، نجاشی نے وہ مکتوب سن کر حبشے میں موجود مہاجرین اور حضرت جعفر بن ابی طالب (رضي الله عنه) کو اپنے پاس بلایا اور اپنے علماء اور عباد وزہاد (قسیسین) کو بھی جمع کرلیا، پھر حضرت جعفر (رضي الله عنه) کو قرآن کریم پڑھنے کا حکم دیا۔ حضرت جعفر (رضي الله عنه) نے سورۂ مریم پڑھی، جس میں حضرت عیسیٰ (عليه السلام) کی اعجازی ولادت اور ان کی عبدیت ورسالت کا ذکر ہے جس سن کر وہ بڑے متاثر ہوئے اور آنکھوں سے آنسو رواں ہوگئے اور ایمان لے آئے۔ بعض کہتے ہیں کہ نجاشی نے اپنے کچھ علماء نبی (صلى الله عليه وسلم) کے پاس بھیجے تھے، جب آپ (صلى الله عليه وسلم) نے انہیں قرآن پڑھ کر سنایا تو بےاختیار ان کی آنکھوں سے آنسو جاری ہوگئے۔ اور ایمان لے آئے۔ (فتح القدیر) آیات میں قرآن کریم سن کر ان پر جو اثر ہوا اس کا نقشہ کھینچا گیا ہے اور ان کے ایمان لانے کا تذکرہ ہے قرآن کریم میں بعض اور مقامات پر اس قسم کے عیسائیوں کا ذکر کیا گیا ہے۔ مثلاً «وَإِنَّ مِنْ أَهْلِ الْكِتَابِ لَمَنْ يُؤْمِنُ بِاللَّهِ وَمَا أُنْزِلَ إِلَيْكُمْ وَمَا أُنْزِلَ إِلَيْهِمْ خَاشِعِينَ لِلَّهِ» (سورة آل عمران: 199) ”یقیناً اہل کتاب میں کچھ ایسے لوگ بھی ہیں جو اللہ پر اور اس کتاب پر جو تم پر نازل ہوئی اور اس پر جو ان پر نازل ہوئی، ایمان رکھتے ہیں اور اللہ کے آگے عاجزی کرتے ہیں“ وَغَيْرهَا مِنَ الآيَاتِ اور حدیث میں آتا ہے کہ جب نجاشی کی موت کی خبر نبی (صلى الله عليه وسلم) کو پہنچی تو آپ (صلى الله عليه وسلم) نے صحابہ (رضي الله عنهم) سے فرمایا کہ حبشے میں تمہارے بھائی کا انتقال ہوگیا ہے، اس کی نماز جنازہ پڑھو! چنانچہ ایک صحرا میں آپ (صلى الله عليه وسلم) نے اس کی نماز جنازہ (غائبانہ) ادا فرمائی۔ (صحيح بخاري، مناقب الأنصار وكتاب الجنائز، صحيح مسلم، كتاب الجنائز) ایک اور حدیث میں ایسے اہل کتاب کی بابت ، جو نبی (صلى الله عليه وسلم) کی نبوت پر ایمان لائے بتلایا گیا ہے کہ انہیں دوگنا اجر ملے گا (بخاري- كتاب العلم وكتاب النكاح)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wamā lanā lā nu'minu bil-lahi wamā jāanā mina al-ḥaqi wanaṭmaʿu an yud'khilanā rabbunā maʿa al-qawmi al-ṣāliḥīna ","translations":["And what","for us (that)","not","we believe","in Allah","and what","came (to) us","from","the truth","And we hope","that","will admit us","our Lord","with","the people","the righteous","(84)"],"transliterationArr":["wamā","lanā","lā","nu'minu","bil-lahi","wamā","jāanā","mina","al-ḥaqi","wanaṭmaʿu","an","yud'khilanā","rabbunā","maʿa","al-qawmi","al-ṣāliḥīna",null],"verseTiming":[[1,0,740],[2,740,1460],[3,1460,1830],[4,1830,2700],[5,2700,3700],[6,3700,4320],[7,4320,6500],[8,6500,6870],[9,6870,7710],[10,7710,8740],[11,8740,9010],[12,9010,10740],[13,10740,11940],[14,11940,13290],[15,13290,13830],[16,13830,15190],[17,15190,16510],[18,16510,16920],[19,16920,17700],[20,17700,20345]]}}