{"name":"5:89","price":"اللہ تعالیٰ تمہاری قسموں میں لغو قسم پر تم سے مؤاخذہ نہیں فرماتا لیکن مؤاخذہ اس پر فرماتا ہے کہ تم جن قسموں کو مضبوط کردو(1) ۔ اس کا کفاره دس محتاجوں کو کھانا دینا ہے اوسط درجے کا جو اپنے گھر والوں کو کھلاتے ہو(2) یا ان کو کپڑا دینا(3) یا ایک غلام یا لونڈی آزاد کرنا(4) ہے اور جس کو مقدور نہ ہو تو تین دن کے روزے ہیں(5) یہ تمہاری قسموں کا کفاره ہے جب کہ تم قسم کھا لو اور اپنی قسموں کا خیال رکھو! اسی طرح اللہ تعالیٰ تمہارے واسطے اپنے احکام بیان فرماتا ہے تاکہ تم شکر کرو۔","arabic":"لَا يُؤَاخِذُكُمُ ٱللَّهُ بِٱللَّغۡوِ فِيٓ أَيۡمَٰنِكُمۡ وَلَٰكِن يُؤَاخِذُكُم بِمَا عَقَّدتُّمُ ٱلۡأَيۡمَٰنَۖ فَكَفَّٰرَتُهُۥٓ إِطۡعَامُ عَشَرَةِ مَسَٰكِينَ مِنۡ أَوۡسَطِ مَا تُطۡعِمُونَ أَهۡلِيكُمۡ أَوۡ كِسۡوَتُهُمۡ أَوۡ تَحۡرِيرُ رَقَبَةٖۖ فَمَن لَّمۡ يَجِدۡ فَصِيَامُ ثَلَٰثَةِ أَيَّامٖۚ ذَٰلِكَ كَفَّٰرَةُ أَيۡمَٰنِكُمۡ إِذَا حَلَفۡتُمۡۚ وَٱحۡفَظُوٓاْ أَيۡمَٰنَكُمۡۚ كَذَٰلِكَ يُبَيِّنُ ٱللَّهُ لَكُمۡ ءَايَٰتِهِۦ لَعَلَّكُمۡ تَشۡكُرُونَ","category":["5 (Al-Ma'idah)","Al-Ma'idah","Surah Al-Ma'idah","Chapter Al-Ma'idah","Ma'idah","Surah Ma'idah","Chapter Ma'idah","Al Ma'idah","Surah Al Ma'idah","Chapter Al Ma'idah","Surah 5","Chapter 5","The Table Spread","المَائدة"],"ayahNumber":758,"juzNumber":7,"footnotes":"(1) قَسَمٌ جس کو عربی میں حَلْفٌ یا يَمِينٌ کہتے ہیں جن کی جمع أَحْلافٌ اور ایمان ہے، تین قسم کی ہیں۔ لَغْوٌ، غَمُوسٌ اور مُعَقَّدَةٌ، لَغْوٌ: وہ قسم ہے جو انسان بات بات میں عادتًا بغیر ارادہ اور نیت کے کھاتا رہتا ہے۔ اس پر کوئی مواخذہ نہیں۔ غَمُوسٌ: وہ جھوٹی قسم ہے جو انسان دھوکہ اور فریب دینے کے لئے کھائے۔ یہ کبیرہ گناہ بلکہ اکبر الکبائر ہے۔ لیکن اس پر کفارہ نہیں۔ مُعَقَّدَةٌ: وہ قسم ہے جو انسان اپنی بات میں تاکید اور پختگی کے لئے ارادۃً اورنیتہً کھائے ایسی قسم اگر توڑے گا تو اس کا وہ کفارہ ہے جو آگے آیت میں بیان کیا جا رہا ہے۔\n(2) اس کھانے کی مقدار میں کوئی صحیح روایت نہیں ہے، اس لئے اختلاف ہے۔ البتہ امام شافعی نے اس حدیث سے استدلال کرتے ہوئے، جس میں رمضان میں روزے کی حالت میں بیوی سے ہم بستری کرنے والے کے کفارہ کا ذکر ہے، ایک مد (تقریباً 10/ چھٹانک) فی مسکین خوراک قرار دی ہے۔ کیونکہ نبی (صلى الله عليه وسلم) نے اس شخص کو کفارۂ جماع ادا کرنے کے لئے 15 صاع کھجوریں دی تھیں، جنہیں ساٹھ مسکینوں پر تقسیم کرنا تھا۔ ایک صاع میں 4 مد ہوتے ہیں۔ اس اعتبار سے بغیر سالن کے دس مسکینوں کے لئے دس مد (یعنی سوا چھ سیر یا چھ کلو) خوراک کفارہ ہوگی۔ (ابن کثیر )\n(3) لباس کے بارے میں بھی اختلاف ہے۔ بظاہر مراد جوڑا ہے جس میں انسان نماز پڑھ سکے۔ بعض علماء خوراک اور لباس دونوں کے لئے عرف کو معتبر قرار دیتے ہیں۔ (حاشیہ ابن کثیر، تحت آیت زیر بحث )\n(4) بعض علماء قتل خطا کی دیت پر قیاس کرتے ہوئے لونڈی، غلام کے لئے ایمان کی شرط عائد کرتے ہیں۔ امام شوکانی کہتے ہیں، آیت میں عموم ہے مومن اور کافر دونوں کو شامل ہے۔\n(5) یعنی جس کو مذکورہ تینوں چیزوں میں سے کسی کی طاقت نہ ہو تو وہ تین دن کے روزے رکھے، یہ روزے اس کی قسم کا کفارہ ہو جائیں گے۔ بعض علماء پےدرپے روزے رکھنے کے قائل ہیں اور بعض کے نزدیک دونوں طرح جائز ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"lā yuākhidhukumu al-lahu bil-laghwi fī aymānikum walākin yuākhidhukum bimā ʿaqqadttumu al-aymāna fakaffāratuhu iṭ'ʿāmu ʿasharati masākīna min awsaṭi mā tuṭ'ʿimūna ahlīkum aw kis'watuhum aw taḥrīru raqabatin faman lam yajid faṣiyāmu thalāthati ayyāmin dhālika kaffāratu aymānikum idhā ḥalaftum wa-iḥ'faẓū aymānakum kadhālika yubayyinu al-lahu lakum āyātihi laʿallakum tashkurūna ","translations":["Not","will call you to account","Allah","for the thoughtless utterances","in","your oaths","but","He will call you to account","for what","you contracted","(of) the oath","So its expiation","(is) feeding","(of) ten","needy people","of","average","(of) what","you feed","your families","or","clothing them","or","freeing","a slave","But whoever","(does) not","find","(that), then fasting","(for) three","days","That","(is the) expiation","(of) your oaths","when","you have sworn","And guard","your oaths","Thus","makes clear","Allah","to you","His Verses","so that you may","(be) grateful","(89)"],"transliterationArr":["lā","yuākhidhukumu","al-lahu","bil-laghwi","fī","aymānikum","walākin","yuākhidhukum","bimā","ʿaqqadttumu","al-aymāna","fakaffāratuhu","iṭ'ʿāmu","ʿasharati","masākīna","min","awsaṭi","mā","tuṭ'ʿimūna","ahlīkum","aw","kis'watuhum","aw","taḥrīru","raqabatin","faman","lam","yajid","faṣiyāmu","thalāthati","ayyāmin","dhālika","kaffāratu","aymānikum","idhā","ḥalaftum","wa-iḥ'faẓū","aymānakum","kadhālika","yubayyinu","al-lahu","lakum","āyātihi","laʿallakum","tashkurūna",null],"verseTiming":[[1,0,560],[2,560,1940],[3,1940,2800],[4,2800,3850],[5,3850,5340],[6,5340,6790],[7,6790,8350],[8,8350,10230],[9,10230,10800],[10,10800,12000],[11,12000,12900],[12,12900,14360],[13,14360,17529],[14,17529,18579],[15,18579,19389],[16,19389,20649],[17,20649,21039],[18,21039,21879],[19,21879,22229],[20,22229,23469],[21,23469,24719],[22,24719,25099],[23,25099,26399],[24,26399,26719],[25,26719,27779],[26,27779,28809],[27,28809,29219],[28,29219,29799],[29,29799,30409],[30,30409,31439],[31,31439,32559],[32,32559,34658],[33,34658,35779],[34,35779,37039],[35,37039,38459],[36,38459,39009],[37,39009,40309],[38,40309,42859],[39,42859,44689],[40,44689,45669],[41,45669,46689],[42,46689,47479],[43,47479,48129],[44,48129,49609],[45,49609,50879],[46,50879,53434]]}}