{"name":"60:10","price":"اے ایمان والو! جب تمہارے پاس مومن عورتیں ہجرت کرکے آئیں تو تم ان کا امتحان لو(1) ۔ دراصل ان کے ایمان کو بخوبی جاننے واﻻ تو اللہ ہی ہے لیکن اگر وه تمہیں ایمان والیاں معلوم ہوں(2) تو اب تم انہیں کافروں کی طرف واپس نہ کرو، یہ ان کے لیے حلال نہیں اور نہ وه ان کے لیے حلال ہیں(3)، اور جو خرچ ان کافروں کا ہوا ہو وه انہیں ادا کردو(4)، ان عورتوں کو ان کے مہر دے کر ان سے نکاح کر لینے میں تم پر کوئی گناه نہیں(5) اور کافر عورتوں کی ناموس اپنے قبضہ میں نہ رکھو(6) اور جو کچھ تم نے خرچ کیا ہو(7)، مانگ لو اور جو کچھ ان کافروں نے خرچ کیا ہو(8) وه بھی مانگ لیں یہ اللہ کا فیصلہ ہے جو تمہارے درمیان کر رہا ہے(9)، اللہ تعالیٰ بڑے علم (اور) حکمت واﻻ ہے.","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا جَآءَكُمُ ٱلۡمُؤۡمِنَٰتُ مُهَٰجِرَٰتٖ فَٱمۡتَحِنُوهُنَّۖ ٱللَّهُ أَعۡلَمُ بِإِيمَٰنِهِنَّۖ فَإِنۡ عَلِمۡتُمُوهُنَّ مُؤۡمِنَٰتٖ فَلَا تَرۡجِعُوهُنَّ إِلَى ٱلۡكُفَّارِۖ لَا هُنَّ حِلّٞ لَّهُمۡ وَلَا هُمۡ يَحِلُّونَ لَهُنَّۖ وَءَاتُوهُم مَّآ أَنفَقُواْۚ وَلَا جُنَاحَ عَلَيۡكُمۡ أَن تَنكِحُوهُنَّ إِذَآ ءَاتَيۡتُمُوهُنَّ أُجُورَهُنَّۚ وَلَا تُمۡسِكُواْ بِعِصَمِ ٱلۡكَوَافِرِ وَسۡـَٔلُواْ مَآ أَنفَقۡتُمۡ وَلۡيَسۡـَٔلُواْ مَآ أَنفَقُواْۚ ذَٰلِكُمۡ حُكۡمُ ٱللَّهِ يَحۡكُمُ بَيۡنَكُمۡۖ وَٱللَّهُ عَلِيمٌ حَكِيمٞ","category":["60 (Al-Mumtahanah)","Al-Mumtahanah","Surah Al-Mumtahanah","Chapter Al-Mumtahanah","Mumtahanah","Surah Mumtahanah","Chapter Mumtahanah","Al Mumtahanah","Surah Al Mumtahanah","Chapter Al Mumtahanah","Surah 60","Chapter 60","She that is to be Examined","الممتحنة"],"ayahNumber":5160,"juzNumber":28,"footnotes":"(1) معاہدۂ حدیبیہ میں ایک شق یہ تھی کہ مکے سے کوئی مسلمانوں کے پاس چلا جائے گا، تو اس کو واپس کرنا پڑے گا۔ لیکن اس میں مرد وعورت کی صراحت نہیں تھی۔ بظاہر کوئی (احد) میں دونوں ہی شامل تھے۔ چنانچہ بعد میں بعض عورتیں مکے سے ہجرت کرکے مسلمانوں کے پاس چلی گئیں تو کفار نے ان کی واپسی کا مطالبہ کیا، جس پر اللہ نے اس آیت میں مسلمانوں کی رہنمائی فرمائی اور یہ حکم دیا۔ امتحان لینے کا مطلب ہے اس امر کی تحقیق کرو کہ ہجرت کرکے آنے والی عورت جو ایمان کا اظہار کر رہی ہے، اپنے کافر خاوند سے ناراض ہوکر یا کسی مسلمان کے عشق میں یا کسی اور غرض سے تو نہیں آئی ہے اور صرف یہاں پناہ لینے کی خاطر ایمان کا دعویٰ کر رہی ہے۔\n(2) یعنی تم اپنی تحقیق سے اس نتیجے پر پہنچو اور تمہیں گمان غالب حاصل ہو جائے کہ یہ واقعی مومنہ ہیں۔\n(3) یہ انہیں ان کے کافر خاوندوں کے پاس واپس نہ کرنے کی علت ہے کہ اب کوئی مومن عورت کسی کافر کے لیے حلال نہیں۔ جیسا کہ ابتدائے اسلام میں یہ جائز تھا، چنانچہ نبی (صلى الله عليه وسلم) کی صاحبزادی حضرت زینب (رضی الله عنها) کا نکاح ابو العاص ابن ربیع کے ساتھ ہوا تھا، جب کہ وہ مسلمان نہیں تھے۔ لیکن اس آیت نے آئندہ کے لیے ایسا کرنے سے منع کر دیا، اسی لیے یہاں فرمایا گیا کہ وہ ایک دوسرے کے لیے حلال نہیں، اس لیے انہیں کافروں کے پاس مت لوٹاؤ۔ ہاں اگر شوہر بھی مسلمان ہو جائے تو پھر ان کا نکاح برقرار رہ سکتا ہے۔ چاہے خاوند عورت کے بعد ہجرت کرکے آئے۔\n(4) یعنی ان کے کافر خاوندوں نے ان کو جو مہر ادا کیا ہے ، وہ تم انہیں ادا کر دو۔\n(5) یہ مسلمانوں کو کہا جارہا ہے کہ یہ عورتیں، جو ایمان کی خاطر اپنے کافر خاوندوں کو چھوڑ کر تمہارے پاس آگئی ہیں ، تم ان سے نکاح کر سکتے ہو، بشرطیکہ ان کا حق مہر تم ادا کرو۔ تاہم یہ نکاح مسنون طریقے سے ہی ہوگا۔ یعنی ایک تو انقضائے عدت (استبراء رحم) کے بعد ہوگا۔ دوسرے، اس میں ولی کی اجازت اور دو عادل گواہوں کی موجودگی بھی ضروری ہے۔ البتہ عورت مدخول بہا نہیں ہے تو پھر بلاعدت فوری نکاح جائز ہے۔\n(6) عِصَمٌ، عِصْمَةٌ کی جمع ہے، یہاں اس سے مراد عصمت عقد نکاح ہے۔ مطلب یہ ہے کہ اگر خاوند مسلمان ہو جائے اور بیوی بدستور کافر اور مشرک رہے تو ایسی مشرک عورت کو اپنے نکاح میں رکھنا جائز نہیں ہے۔ اسے فوراً طلاق دے کر اپنے سے علیحدہ کر دیا جائے۔ چنانچہ اس حکم کے بعد حضرت عمر (رضي الله عنه) نے اپنی دو مشرک بیویوں کو اور حضرت طلحہ ابن عبید اللہ (رضي الله عنه) نے اپنی بیوی کو طلاق دے دی۔ (ابن کثیر) البتہ اگر بیوی کتابیہ (یہودی یا عیسائی) ہو تو اسے طلاق دینا ضروری نہیں ہے۔ کیونکہ ان سے نکاح جائز ہے، اس لیے اگر وہ پہلے سے ہی بیوی کی حیثیت سے تمہارے پاس موجود ہے تو قبول اسلام کے بعد اسے علیحدہ کرنے کی ضرورت نہیں ہے۔\n(7) یعنی ان عورتوں پر جو کفر پر برقرار رہنے کی وجہ سے کافروں کے پاس چلی گئی ہیں۔\n(8) یعنی ان عورتوں پر جو مسلمان ہوکر ہجرت کرکے مدینے آگئی ہیں۔\n(9) یعنی یہ حکم مذکور کہ دونوں ایک دوسرے کو حق مہر ادا کریں بلکہ مانگ کرلیں، اللہ کا حکم ہے۔ امام قرطبی فرماتے ہیں کہ یہ حکم اس دور کے ساتھ ہی خاص تھا۔ اس پر مسلمانوں کا اجماع ہے۔ (فتح القدیر) اس کی وجہ وہ معاہدہ ہے جو اس وقت فریقین کے درمیان تھا۔ اس قسم کے معاہدے کی صورت میں آئندہ بھی اس پر عمل کرنا ضروری ہوگا۔ بصورت دیگر نہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāayyuhā alladhīna āmanū idhā jāakumu al-mu'minātu muhājirātin fa-im'taḥinūhunna al-lahu aʿlamu biīmānihinna fa-in ʿalim'tumūhunna mu'minātin falā tarjiʿūhunna ilā al-kufāri lā hunna ḥillun lahum walā hum yaḥillūna lahunna waātūhum mā anfaqū walā junāḥa ʿalaykum an tankiḥūhunna idhā ātaytumūhunna ujūrahunna walā tum'sikū biʿiṣami al-kawāfiri wasalū mā anfaqtum walyasalū mā anfaqū dhālikum ḥuk'mu al-lahi yaḥkumu baynakum wal-lahu ʿalīmun ḥakīmun ","translations":["O you","who","believe","When","come to you","the believing women","(as) emigrants","then examine them","Allah","(is) most knowing","of their faith","And if","you know them","(to be) believers","then (do) not","return them","to","the disbelievers","Not","they","(are) lawful","for them","and not","they","are lawful","for them","But give them","what","they have spent","And not","any blame","upon you","if","you marry them","when","you have given them","their (bridal) dues","And (do) not","hold","to marriage bonds","(with) disbelieving women","but ask (for)","what","you have spent","and let them ask","what","they have spent","That","(is the) Judgment","(of) Allah","He judges","between you","And Allah","(is) All-Knowing","All-Wise","(10)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","idhā","jāakumu","al-mu'minātu","muhājirātin","fa-im'taḥinūhunna","al-lahu","aʿlamu","biīmānihinna","fa-in","ʿalim'tumūhunna","mu'minātin","falā","tarjiʿūhunna","ilā","al-kufāri","lā","hunna","ḥillun","lahum","walā","hum","yaḥillūna","lahunna","waātūhum","mā","anfaqū","walā","junāḥa","ʿalaykum","an","tankiḥūhunna","idhā","ātaytumūhunna","ujūrahunna","walā","tum'sikū","biʿiṣami","al-kawāfiri","wasalū","mā","anfaqtum","walyasalū","mā","anfaqū","dhālikum","ḥuk'mu","al-lahi","yaḥkumu","baynakum","wal-lahu","ʿalīmun","ḥakīmun",null],"verseTiming":[[1,0,2880],[2,2880,3840],[3,3840,6470],[4,6470,7040],[5,7040,9530],[6,9530,10890],[7,10890,12970],[8,12970,15600],[9,15600,16870],[10,16870,17640],[11,17640,19880],[12,19880,20880],[13,20880,23260],[14,23260,24610],[15,24610,25600],[16,25600,25940],[17,25940,28040],[18,28040,28430],[19,28430,29260],[20,29260,31360],[21,31360,33440],[22,33440,34140],[23,34140,34910],[24,34910,35430],[25,35430,35790],[26,35790,36980],[27,36980,38340],[28,38340,40190],[29,40190,42800],[30,42800,44600],[31,44600,45630],[32,45630,46430],[33,46430,47440],[34,47440,48390],[35,48390,51300],[36,51300,53330],[37,53330,56010],[38,56010,58180],[39,58180,59180],[40,59180,60210],[41,60210,61050],[42,61050,62190],[43,62190,63150],[44,63150,64810],[45,64810,66700],[46,66700,68020],[47,68020,70140],[48,70140,71810],[49,71810,73330],[50,73330,73930],[51,73930,74740],[52,74740,75520],[53,75520,76850],[54,76850,77790],[55,77790,78740],[56,78740,81225]]}}