{"name":"60:1","price":"اے وه لوگو جو ایمان ﻻئے ہو! میرے اور (خود) اپنے دشمنوں کو اپنا دوست نہ بناؤ(1) تم تو دوستی سے ان کی طرف پیغام بھیجتے(2) ہو اور وه اس حق کے ساتھ جو تمہارے پاس آچکا ہے کفر کرتے ہیں، پیغمبر کو اور خود تمہیں بھی محض اس وجہ سے جلاوطن کرتے ہیں کہ تم اپنے رب پر ایمان رکھتے ہو(3)، اگر تم میری راه میں جہاد کے لیے اور میری رضا مندی کی طلب میں نکلتے ہو (تو ان سے دوستیاں نہ کرو(4))، تم ان کے پاس محبت کا پیغام پوشیده پوشیده بھیجتے ہو اور مجھے خوب معلوم ہے جو تم نے چھپایا اور وه بھی جو تم نے ﻇاہر کیا، تم میں سے جو بھی اس کام کو کرے گا وه یقیناً راه راست سے بہک جائے گا.(5)","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَّخِذُواْ عَدُوِّي وَعَدُوَّكُمۡ أَوۡلِيَآءَ تُلۡقُونَ إِلَيۡهِم بِٱلۡمَوَدَّةِ وَقَدۡ كَفَرُواْ بِمَا جَآءَكُم مِّنَ ٱلۡحَقِّ يُخۡرِجُونَ ٱلرَّسُولَ وَإِيَّاكُمۡ أَن تُؤۡمِنُواْ بِٱللَّهِ رَبِّكُمۡ إِن كُنتُمۡ خَرَجۡتُمۡ جِهَٰدٗا فِي سَبِيلِي وَٱبۡتِغَآءَ مَرۡضَاتِيۚ تُسِرُّونَ إِلَيۡهِم بِٱلۡمَوَدَّةِ وَأَنَا۠ أَعۡلَمُ بِمَآ أَخۡفَيۡتُمۡ وَمَآ أَعۡلَنتُمۡۚ وَمَن يَفۡعَلۡهُ مِنكُمۡ فَقَدۡ ضَلَّ سَوَآءَ ٱلسَّبِيلِ","category":["60 (Al-Mumtahanah)","Al-Mumtahanah","Surah Al-Mumtahanah","Chapter Al-Mumtahanah","Mumtahanah","Surah Mumtahanah","Chapter Mumtahanah","Al Mumtahanah","Surah Al Mumtahanah","Chapter Al Mumtahanah","Surah 60","Chapter 60","She that is to be Examined","الممتحنة"],"ayahNumber":5151,"juzNumber":28,"footnotes":"(1) کفار مکہ اور نبی (صلى الله عليه وسلم) کے درمیان حدیبیہ میں جو معاہدہ ہوا تھا، اہل مکہ نے اس کی خلاف ورزی کی۔ اس لیے رسول اللہ (صلى الله عليه وسلم) نے بھی مسلمانوں کو خفیہ طور پر لڑائی کی تیاری کا حکم دے دیا۔ حضرت حاطب بن ابی بلتعہ (رضي الله عنه) ، ایک مہاجر بدری صحابی تھے، جن کی قریش کے ساتھ کوئی رشتے داری نہیں تھی، لیکن ان کے بیوی بچے مکے میں ہی تھے۔ انہوں نے سوچا کہ میں قریش مکہ کو آپ (صلى الله عليه وسلم) کی تیاری کی اطلاع کر دوں تاکہ اس احسان کے بدلے وہ میرے بال بچوں کا خیال رکھیں۔ چنانچہ انہوں نے ایک عورت کے ذریعے سے یہ پیغام تحریری طور پر اہل مکہ کی طرف روانہ کر دیا، جس کے اطلاع بذریعہ وحی نبی (صلى الله عليه وسلم) کو کر دی گئی چنانچہ آپ (صلى الله عليه وسلم) نے حضرت علی ، حضرت مقداد اور حضرت زبیر (رضي الله عنهم) کو فرمایا کہ جاؤ روضئہ خاخ پر ایک عورت ہوگی جو مکہ جا رہی ہوگی، اس کے پاس ایک رقعہ ہے، وہ لے آؤ، چنانچہ وہ حضرات گئے اور اس سے یہ رقعہ لے آئے جو اس نے سر کے بالوں میں چھپا رکھا تھا۔ آپ (صلى الله عليه وسلم) نے حضرت حاطب (رضي الله عنه)، سے پوچھا۔ یہ تم نے کیا کیا؟ انہوں نے فرمایا کہ میں نے یہ کام کفر وارتداد کی بنا پر نہیں کیا بلکہ اس کی وجہ صرف یہ ہے کہ دیگر مہاجرین کے رشتے دار مکے میں موجود ہیں جو ان کے بال بچوں کی حفاظت کرتے ہیں۔ میرا وہاں کوئی رشتے دار نہیں ہے تو میں نے یہ سوچا کہ میں اہل مکہ کو کچھ اطلاع کر دوں تاکہ وہ میرے احسان مند رہیں اور میرے بچوں کی حفاظت کریں۔ آپ (صلى الله عليه وسلم) نے ان کی سچائی کی وجہ سے انہیں کچھ نہیں کہا۔ تاہم اللہ نے تنبیہ کے طور پر یہ آیات نازل فرما دیں، تاکہ آئندہ کوئی مومن کسی کافر کے ساتھ اس طرح کا تعلق مودت قائم نہ کرے۔ (صحيح بخاري، تفسير سورة الممتحنة ، وصحيح مسلم، كتاب فضائل الصحابة)۔\n(2) مطلب ہے نبی (صلى الله عليه وسلم) کی خبریں ان تک پہنچا کر ان سے دوستانہ تعلق قائم کرنا چاہتے ہو؟\n(3) جب ان کا تمہارے ساتھ اور حق کے ساتھ یہ معاملہ ہے تو تمہارے لیے کیا یہ مناسب ہے کہ تم ان سے محبت اور ہمدردی کا رویہ اختیار کرو؟\n(4) یہ جواب شرط، جو محذوف ہے، کا ترجمہ ہے۔\n(5) یعنی میرے اور اپنے دشمنوں سے محبت کا تعلق جوڑنا اور انہیں خفیہ نامہ وپیام بھیجنا، یہ گمراہی کا راستہ ہے، جو کسی مسلمان کے شایان شان نہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāayyuhā alladhīna āmanū lā tattakhidhū ʿaduwwī waʿaduwwakum awliyāa tul'qūna ilayhim bil-mawadati waqad kafarū bimā jāakum mina al-ḥaqi yukh'rijūna al-rasūla wa-iyyākum an tu'minū bil-lahi rabbikum in kuntum kharajtum jihādan fī sabīlī wa-ib'tighāa marḍātī tusirrūna ilayhim bil-mawadati wa-anā aʿlamu bimā akhfaytum wamā aʿlantum waman yafʿalhu minkum faqad ḍalla sawāa al-sabīli ","translations":["O you","who","believe","(Do) not","take","My enemies","and your enemies","(as) allies","offering","them","love","while","they have disbelieved","in what","came to you","of","the truth","driving out","the Messenger","and yourselves","because","you believe","in Allah","your Lord","If","you","come forth","(to) strive","in","My way","and (to) seek","My Pleasure","You confide","to them","love","but I Am","most knowing","of what","you conceal","and what","you declare","And whoever","does it","among you","then certainly","he has strayed","(from the) straight","path","(1)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","lā","tattakhidhū","ʿaduwwī","waʿaduwwakum","awliyāa","tul'qūna","ilayhim","bil-mawadati","waqad","kafarū","bimā","jāakum","mina","al-ḥaqi","yukh'rijūna","al-rasūla","wa-iyyākum","an","tu'minū","bil-lahi","rabbikum","in","kuntum","kharajtum","jihādan","fī","sabīlī","wa-ib'tighāa","marḍātī","tusirrūna","ilayhim","bil-mawadati","wa-anā","aʿlamu","bimā","akhfaytum","wamā","aʿlantum","waman","yafʿalhu","minkum","faqad","ḍalla","sawāa","al-sabīli",null],"verseTiming":[[1,0,2870],[2,2870,3700],[3,3700,4660],[4,4660,4970],[5,4970,6060],[6,6060,6960],[7,6960,8320],[8,8320,10740],[9,10740,11610],[10,11610,13080],[11,13080,14380],[12,14380,14840],[13,14840,15620],[14,15620,16190],[15,16190,18570],[16,18570,19510],[17,19510,20340],[18,20340,21440],[19,21440,22440],[20,22440,23790],[21,23790,24700],[22,24700,25720],[23,25720,26680],[24,26680,27750],[25,27750,28860],[26,28860,30300],[27,30300,31300],[28,31300,32620],[29,32620,33020],[30,33020,34110],[31,34110,36590],[32,36590,37540],[33,37540,39450],[34,39450,40930],[35,40930,42260],[36,42260,42830],[37,42830,43620],[38,43620,45430],[39,45430,46560],[40,46560,48620],[41,48620,51100],[42,51100,52160],[43,52160,53220],[44,53220,54540],[45,54540,55080],[46,55080,55690],[47,55690,57760],[48,57760,59755]]}}