{"name":"60:8","price":"جن لوگوں نے تم سے دین کے بارے میں لڑائی نہیں لڑی(1) اور تمہیں جلاوطن نہیں کیا(2) ان کے ساتھ سلوک واحسان کرنے اور منصفانہ بھلے برتاؤ کرنے سے اللہ تعالیٰ تمہیں نہیں روکتا(3)، بلکہ اللہ تعالیٰ تو انصاف کرنے والوں سے محبت کرتا ہے.(4)","arabic":"لَّا يَنۡهَىٰكُمُ ٱللَّهُ عَنِ ٱلَّذِينَ لَمۡ يُقَٰتِلُوكُمۡ فِي ٱلدِّينِ وَلَمۡ يُخۡرِجُوكُم مِّن دِيَٰرِكُمۡ أَن تَبَرُّوهُمۡ وَتُقۡسِطُوٓاْ إِلَيۡهِمۡۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُقۡسِطِينَ","category":["60 (Al-Mumtahanah)","Al-Mumtahanah","Surah Al-Mumtahanah","Chapter Al-Mumtahanah","Mumtahanah","Surah Mumtahanah","Chapter Mumtahanah","Al Mumtahanah","Surah Al Mumtahanah","Chapter Al Mumtahanah","Surah 60","Chapter 60","She that is to be Examined","الممتحنة"],"ayahNumber":5158,"juzNumber":28,"footnotes":"(1) یہ ان کافروں کے بارے میں ہدایات دی جارہی ہیں جو مسلمانوں سے محض دین اسلام کی وجہ سے بغض وعداوت نہیں رکھتے اور اس بنیاد پر مسلمانوں سے نہیں لڑتے، یہ پہلی شرط ہے۔\n(2) یعنی تمہارے ساتھ ایسا رویہ بھی اختیار نہیں کیا کہ تم ہجرت پر مجبور ہو جاؤ۔ یہ دوسری شرط ہے۔ ایک تیسری شرط یہ ہے جو اگلی آیت سے واضح ہوتی ہے، کہ وہ مسلمانوں کے خلاف دوسرے کافروں کو کسی قسم کی مدد بھی نہ پہنچائیں۔ مشورے اور رائے سے اور نہ ہتھیاروں وغیرہ کے ذریعے سے۔\n(3) یعنی ایسے کافروں سے احسان اور انصاف کا معاملہ کرنا ممنوع نہیں ہے۔ جیسے حضرت اسماء بنت ابی بکر صدیق (رضي الله عنه) ما نے رسول اللہ (صلى الله عليه وسلم) سے اپنی مشرکہ ماں کی بابت صلہ رحمی یعنی حسن سلوک کرنے کا پوچھا، آپ (صلى الله عليه وسلم) نے فرمایا : صِلِي أُمَّكِ (صحيح مسلم ، كتاب الزكاة ، باب فضل النفقة والصدقة على الأقربين .... بخاري كتاب الأدب ، باب صلة الوالد المشرك) ”اپنی ماں کے ساتھ صلہ رحمی کرو“۔\n(4) اس میں انصاف کرنے کی ترغیب ہے حتیٰ کہ کافروں کے ساتھ بھی۔ حدیث میں انصاف کرنے والوں کی فضیلت یوں بیان ہوئی ہے «إَنَّ الْمُقْسِطِينَ عِنْدَ اللهِ عَلَى مَنَابِرَ مِنْ نُورٍ ، عَنْ يَمِينِ الرَّحْمَنِ عَزَّ وَجَلَّ - وَكِلْتَا يَدَيْهِ يَمِينٌ - الَّذِينَ يَعْدِلُونَ فِي حُكْمِهِمْ وَأَهْلِيهِمْ، وَمَا وَلُوا»(صحيح مسلم ، كتاب الإمارة ، باب فضيلة الإمام العادل ) ”انصا ف کرنے والے نور کے منبروں پر ہوں گے جو رحمٰن کے دائیں جانب ہوں گے اور رحمٰن کے دونوں ہاتھ دائیں ہیں، جو اپنے فیصلوں میں، اپنے اہل میں اور اپنی رعایا میں انصاف کا اہتمام کرتے ہیں“۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"lā yanhākumu al-lahu ʿani alladhīna lam yuqātilūkum fī al-dīni walam yukh'rijūkum min diyārikum an tabarrūhum watuq'siṭū ilayhim inna al-laha yuḥibbu al-muq'siṭīna ","translations":["Not","(does) forbid you","Allah","from","those who","(do) not","fight you","in","the religion","and (do) not","drive you out","of","your homes","that","you deal kindly","and deal justly","with them","Indeed","Allah","loves","those who act justly","(8)"],"transliterationArr":["lā","yanhākumu","al-lahu","ʿani","alladhīna","lam","yuqātilūkum","fī","al-dīni","walam","yukh'rijūkum","min","diyārikum","an","tabarrūhum","watuq'siṭū","ilayhim","inna","al-laha","yuḥibbu","al-muq'siṭīna",null],"verseTiming":[[1,0,550],[2,550,1610],[3,1610,2500],[4,2500,2880],[5,2880,3920],[6,3920,4250],[7,4250,5780],[8,5780,6050],[9,6050,6780],[10,6780,7350],[11,7350,8640],[12,8640,10280],[13,10280,11800],[14,11800,12960],[15,12960,14280],[16,14280,16750],[17,16750,18220],[18,18220,19440],[19,19440,20280],[20,20280,21080],[21,21080,24075]]}}