{"name":"61:13","price":"اور تمہیں ایک دوسری (نعمت) بھی دے گا جسے تم چاہتے ہو وه اللہ کی مدد اور جلد فتح یابی ہے(1) ، ایمان والوں کو خوشخبری دے دو.(2)","arabic":"وَأُخۡرَىٰ تُحِبُّونَهَاۖ نَصۡرٞ مِّنَ ٱللَّهِ وَفَتۡحٞ قَرِيبٞۗ وَبَشِّرِ ٱلۡمُؤۡمِنِينَ","category":["61 (As-Saff)","As-Saff","Surah As-Saff","Chapter As-Saff","Saff","Surah Saff","Chapter Saff","As Saff","Surah As Saff","Chapter As Saff","Surah 61","Chapter 61","The Ranks","الصَّف"],"ayahNumber":5176,"juzNumber":28,"footnotes":"(1) یعنی جب تم اس کی راہ میں لڑو گے اور اس کے دین کی مدد کرو گے، تو وہ بھی تمہیں فتح ونصرت سے نوازے گا۔ - «إِنْ تَنْصُرُوا اللَّهَ يَنْصُرْكُمْ وَيُثَبِّتْ أَقْدَامَكُمْ» (سورة محمد: 7) «وَلَيَنْصُرَنَّ اللَّهُ مَنْ يَنْصُرُهُ إِنَّ اللَّهَ لَقَوِيٌّ عَزِيزٌ» (الحج: 40) آخرت کی نعمتوں کے مقابلے میں اسے فتح قریب، قرار دیا۔ اور اس سے مراد فتح مکہ ہے اور بعض نے فارس وروم کی عظیم الشان سلطنتوں پر مسلمانوں کے غلبے کو اس کا مصداق قرار دیا ہے۔ جو خلافت راشدہ میں مسلمانوں کو حاصل ہوا۔\n(2) جنت کی بھی، مرنے کے بعد۔ اور فتح ونصرت کی بھی، دنیا میں۔ بشرطیکہ اہل ایمان ایمان کے تقاضے پورے کرتے رہیں۔ «وَأَنْتُمُ الأَعْلَوْنَ إِنْ كُنْتُمْ مُؤْمِنِينَ» (آل عمران: 139) آگے اللہ تعالیٰ مومنوں کو اپنے دین کی نصرت کی مزید ترغیب دے رہا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-ukh'rā tuḥibbūnahā naṣrun mina al-lahi wafatḥun qarībun wabashiri al-mu'minīna ","translations":["And another","that you love ","a help","from","Allah","and a victory","near","and give glad tidings","(to) the believers","(13)"],"transliterationArr":["wa-ukh'rā","tuḥibbūnahā","naṣrun","mina","al-lahi","wafatḥun","qarībun","wabashiri","al-mu'minīna",null],"verseTiming":[[1,0,910],[2,910,2650],[3,2650,3720],[4,3720,4890],[5,4890,5670],[6,5670,7720],[7,7720,10600],[8,10600,11510],[9,11510,14175]]}}