{"name":"61:14","price":"اے ایمان والو! تم اللہ تعالیٰ کے مددگار بن جاؤ(1) ۔ جس طرح حضرت مریم کے بیٹے حضرت عیسیٰ نے حواریوں سے فرمایا کہ کون ہے جو اللہ کی راه میں میرا مددگار بنے(2)؟ حواریوں نے کہا ہم اللہ کی راه میں مددگار ہیں، پس بنی اسرائیل میں سے ایک جماعت تو ایمان ﻻئی اور ایک جماعت نے کفر کیا(3) تو ہم نے مومنوں کی انکے دشمنوں کے مقابلہ میں مدد کی پس وه غالب آ گئے.(4)","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ كُونُوٓاْ أَنصَارَ ٱللَّهِ كَمَا قَالَ عِيسَى ٱبۡنُ مَرۡيَمَ لِلۡحَوَارِيِّـۧنَ مَنۡ أَنصَارِيٓ إِلَى ٱللَّهِۖ قَالَ ٱلۡحَوَارِيُّونَ نَحۡنُ أَنصَارُ ٱللَّهِۖ فَـَٔامَنَت طَّآئِفَةٞ مِّنۢ بَنِيٓ إِسۡرَٰٓءِيلَ وَكَفَرَت طَّآئِفَةٞۖ فَأَيَّدۡنَا ٱلَّذِينَ ءَامَنُواْ عَلَىٰ عَدُوِّهِمۡ فَأَصۡبَحُواْ ظَٰهِرِينَ","category":["61 (As-Saff)","As-Saff","Surah As-Saff","Chapter As-Saff","Saff","Surah Saff","Chapter Saff","As Saff","Surah As Saff","Chapter As Saff","Surah 61","Chapter 61","The Ranks","الصَّف"],"ayahNumber":5177,"juzNumber":28,"footnotes":"(1) تمام حالتوں میں، اپنے اقوال وافعال کے ذریعے سے بھی اور جان ومال کے ذریعے سے بھی۔ جب بھی، جس وقت بھی اور جس حالت میں بھی تمہیں اللہ اور اس کا رسول اپنے دین کے لیے پکارﮮ تم فوراً ان کی پکار پر لبیک کہو، جس طرح حواریین نے عیسیٰ (عليه السلام) کی پکار پر لبیک کہا۔\n(2) یعنی ہم آپ (صلى الله عليه وسلم) کے اس دین کی دعوت وتبلیغ میں مددگار ہیں جس کی نشرواشاعت کا حکم اللہ نے آپ (صلى الله عليه وسلم) کو دیا ہے۔ اسی طرح رسول اللہ (صلى الله عليه وسلم) ایام حج میں فرماتے (کون ہے جو مجھے پناہ دے تاکہ میں لوگوں تک اللہ کا پیغام پہنچا سکوں، اس لیے کہ قریش مجھے فریضۂ رسالت ادا نہیں کرنے دیتے)۔ حتیٰ کہ آپ (صلى الله عليه وسلم) کی اس پکار پر مدینے کے اوس اور خزرج نے لبیک کہا، آپ (صلى الله عليه وسلم) کے ہاتھ پر انہوں نے بیعت کی اور آپ (صلى الله عليه وسلم) کی مدد کا وعدہ کیا۔ نیز آپ (صلى الله عليه وسلم) کو یہ پیشکش کی کہ اگر آپ (صلى الله عليه وسلم) ہجرت کرکے مدینہ آجائیں تو آپ (صلى الله عليه وسلم) کی حفاظت کی ذمے داری ہم قبول کرتے ہیں۔ چنانچہ جب آپ (صلى الله عليه وسلم) ہجرت کرکے مدینہ تشریف لے گئے تو وعدے کے مطابق انہوں نے آپ (صلى الله عليه وسلم) کی اور آپ (صلى الله عليه وسلم) کے تمام ساتھیوں کی پوری مدد کی۔ حتیٰ کہ اللہ اور اس کے رسول (صلى الله عليه وسلم) نے ان کا نام ہی (انصار) رکھ دیا اور اب یہ ان کا علم بن گیا۔ رَضِيَ اللهُ عَنْهُمْ وَأَرْضَاهُمْ (ابن کثیر)\n(3) یہ یہود تھے جنہوں نے نبوت عیسیٰ (عليه السلام) ہی کا انکار نہیں کیا بلکہ ان پر اور ان کی ماں پر بہتان تراشی کی۔ بعض کہتے ہیں کہ یہ اختلاف وتفرق اس وقت ہوا، جب حضرت عیسیٰ (عليه السلام) کو آسمان پر اٹھا لیا گیا۔ ایک نے کہا کہ عیسیٰ (عليه السلام) کی شکل میں اللہ تعالیٰ نے ہی زمین پر ظہور فرمایا تھا، اب وہ پھر آسمان پر چلا گیا ہے، یہ فرقہ یعقوبیہ کہلاتا ہے۔ نسطوریہ فرقے نے کہا کہ وہ ابن اللہ تھے، باپ نے بیٹے کو آسمان پر بلا لیا ہے۔ تیسرے فرقے نے کہا وہ اللہ کے بندے اور اس کے رسول تھے، یہی فرقہ صحیح تھا۔\n(4) یعنی نبی (صلى الله عليه وسلم) کو مبعوث فرما کر ہم نے اسی آخری جماعت کی، دوسرے باطل گروہوں کے مقابلے میں مدد کی۔ چنانچہ یہ صحیح عقیدے کی حامل جماعت نبی (صلى الله عليه وسلم) پر بھی ایمان لے آئی اور یوں ہم نے ان کو دلائل کے لحاظ سے بھی سب کافروں پر غلبہ عطا فرمایا اور قوت وسلطنت کے اعتبار سے بھی۔ اس غلبے کا آخری ظہور اس وقت پھر ہوگا، جب قیامت کے قریب حضرت عیسیٰ (عليه السلام) کا دوبارہ نزول ہوگا، جیسا کہ اس نزول اور غلبے کی صراحت احادیث صحیحہ میں تواتر کے ساتھ منقول ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāayyuhā alladhīna āmanū kūnū anṣāra al-lahi kamā qāla ʿīsā ub'nu maryama lil'ḥawāriyyīna man anṣārī ilā al-lahi qāla al-ḥawāriyūna naḥnu anṣāru al-lahi faāmanat ṭāifatun min banī is'rāīla wakafarat ṭāifatun fa-ayyadnā alladhīna āmanū ʿalā ʿaduwwihim fa-aṣbaḥū ẓāhirīna ","translations":["O you","who","believe","Be","helpers","(of) Allah","as","said","Isa","son","(of) Maryam","to the disciples","Who","(are) my helpers","for","Allah","Said","the disciples","We","(are) the helpers","(of) Allah","Then believed","a group","of","Children","(of) Israel","and disbelieved","a group","So We supported","those who","believed","against","their enemy","and they became","dominant","(14)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","kūnū","anṣāra","al-lahi","kamā","qāla","ʿīsā","ub'nu","maryama","lil'ḥawāriyyīna","man","anṣārī","ilā","al-lahi","qāla","al-ḥawāriyūna","naḥnu","anṣāru","al-lahi","faāmanat","ṭāifatun","min","banī","is'rāīla","wakafarat","ṭāifatun","fa-ayyadnā","alladhīna","āmanū","ʿalā","ʿaduwwihim","fa-aṣbaḥū","ẓāhirīna",null],"verseTiming":[[1,0,2910],[2,2910,3770],[3,3770,4740],[4,4740,5990],[5,5990,7060],[6,7060,8880],[7,8880,9570],[8,9570,10070],[9,10070,10630],[10,10630,11270],[11,11270,11710],[12,11710,12460],[13,12460,16960],[14,16960,17420],[15,17420,18080],[16,18080,18670],[17,18670,19060],[18,19060,19790],[19,19790,21770],[20,21770,22100],[21,22100,24510],[22,24510,26019],[23,26019,28599],[24,28599,29139],[25,29139,30949],[26,30949,31489],[27,31489,33479],[28,33479,36629],[29,36629,37639],[30,37639,40449],[31,40449,42418],[32,42418,44628],[33,44628,47528],[34,47528,48318],[35,48318,51568],[36,51568,52728],[37,52728,53628],[38,53628,54648],[39,54648,55208],[40,55208,56478],[41,56478,57788],[42,57788,60723]]}}