{"name":"61:5","price":"اور (یاد کرو) جبکہ موسیٰ نے اپنی قوم سے کہا اے میری قوم کے لوگو! تم مجھے کیوں ستا رہے ہو حاﻻنکہ تمہیں (بخوبی) معلوم ہے کہ میں تمہاری جانب اللہ کا رسول ہوں(1) پس جب وه لوگ ٹیڑھے ہی رہے تو اللہ نے ان کے دلوں کو (اور) ٹیڑھا کر دیا(2)، اور اللہ تعالیٰ نافرمان قوم کو ہدایت نہیں دیتا.","arabic":"وَإِذۡ قَالَ مُوسَىٰ لِقَوۡمِهِۦ يَٰقَوۡمِ لِمَ تُؤۡذُونَنِي وَقَد تَّعۡلَمُونَ أَنِّي رَسُولُ ٱللَّهِ إِلَيۡكُمۡۖ فَلَمَّا زَاغُوٓاْ أَزَاغَ ٱللَّهُ قُلُوبَهُمۡۚ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلۡفَٰسِقِينَ","category":["61 (As-Saff)","As-Saff","Surah As-Saff","Chapter As-Saff","Saff","Surah Saff","Chapter Saff","As Saff","Surah As Saff","Chapter As Saff","Surah 61","Chapter 61","The Ranks","الصَّف"],"ayahNumber":5168,"juzNumber":28,"footnotes":"(1) یہ جانتے ہوئے بھی کہ حضرت موسیٰ (عليه السلام) اللہ کے سچے رسول ہیں، بنی اسرائیل انہیں اپنی زبان سے ایذا پہنچاتے تھے، حتیٰ کہ بعض جسمانی عیوب ان کی طرف منسوب کرتے تھے، حالانکہ وہ بیماری ان کے اندر نہیں تھی۔\n(2) یعنی علم کے باوجود حق سے اعراض کیا اور حق کے مقابلے میں باطل کو خیر کے مقابلے میں شرکو اور ایمان کے مقابلے میں کفر کو اختیار کیا، تو اللہ تعالیٰ نے اس کی سزا کے طور پر ان کے دلوں کو مستقل طور پر ہدایت سے پھیر دیا۔ کیونکہ یہی سنت اللہ چلی آرہی ہے۔ کفر وضلالت پر دوام واستمرار ہی دلوں پر مہر لگنے کا باعث ہوتا ہے، پھر فسق ، کفر اور ظلم اس کی طبیعت اور عادت بن جاتی ہے، جس کو کوئی بدلنے پر قادر نہیں ہے۔ اسی لیے آگے فرمایا، اللہ تعالیٰ نافرمانوں کو ہدایت نہیں دیتا۔ اس لیے کہ اللہ تعالیٰ نے ایسے لوگوں کو اپنی سنت کے مطابق گمراہ کیا ہوتا ہے، اب کون اسے ہدایت دے سکتا ہے جسے اس طریقے سے اللہ نے گمراہ کیا ہو؟","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-idh qāla mūsā liqawmihi yāqawmi lima tu'dhūnanī waqad taʿlamūna annī rasūlu al-lahi ilaykum falammā zāghū azāgha al-lahu qulūbahum wal-lahu lā yahdī al-qawma al-fāsiqīna ","translations":["And when","said","Musa","to his people","O my people","Why","do you hurt me","while certainly","you know","that I am","(the) Messenger","(of) Allah","to you","Then when","they deviated","(was caused to) deviate","(by) Allah","their hearts","And Allah","(does) not","guide","the people","the defiantly disobedient","(5)"],"transliterationArr":["wa-idh","qāla","mūsā","liqawmihi","yāqawmi","lima","tu'dhūnanī","waqad","taʿlamūna","annī","rasūlu","al-lahi","ilaykum","falammā","zāghū","azāgha","al-lahu","qulūbahum","wal-lahu","lā","yahdī","al-qawma","al-fāsiqīna",null],"verseTiming":[[1,0,600],[2,600,1220],[3,1220,1960],[4,1960,3240],[5,3240,4100],[6,4100,4490],[7,4490,6010],[8,6010,6380],[9,6380,7700],[10,7700,8970],[11,8970,9840],[12,9840,10730],[13,10730,12150],[14,12150,13640],[15,13640,15690],[16,15690,16370],[17,16370,17380],[18,17380,19020],[19,19020,20000],[20,20000,20450],[21,20450,20980],[22,20980,21750],[23,21750,24985]]}}