{"name":"61:6","price":"اور جب مریم کے بیٹے عیسیٰ نے کہا اے (میری قوم)، بنی اسرائیل! میں تم سب کی طرف اللہ کا رسول ہوں مجھ سے پہلے کی کتاب تورات کی میں تصدیق کرنے واﻻ ہوں(1) اور اپنے بعد آنے والے ایک رسول کی میں تمہیں خوشخبری سنانے واﻻ ہوں جنکا نام احمد ہے(2)۔ پھر جب وه ان کے پاس کھلی دلیلیں ﻻئے تو یہ کہنے لگے، یہ تو کھلا جادو ہے.(3)","arabic":"وَإِذۡ قَالَ عِيسَى ٱبۡنُ مَرۡيَمَ يَٰبَنِيٓ إِسۡرَٰٓءِيلَ إِنِّي رَسُولُ ٱللَّهِ إِلَيۡكُم مُّصَدِّقٗا لِّمَا بَيۡنَ يَدَيَّ مِنَ ٱلتَّوۡرَىٰةِ وَمُبَشِّرَۢا بِرَسُولٖ يَأۡتِي مِنۢ بَعۡدِي ٱسۡمُهُۥٓ أَحۡمَدُۖ فَلَمَّا جَآءَهُم بِٱلۡبَيِّنَٰتِ قَالُواْ هَٰذَا سِحۡرٞ مُّبِينٞ","category":["61 (As-Saff)","As-Saff","Surah As-Saff","Chapter As-Saff","Saff","Surah Saff","Chapter Saff","As Saff","Surah As Saff","Chapter As Saff","Surah 61","Chapter 61","The Ranks","الصَّف"],"ayahNumber":5169,"juzNumber":28,"footnotes":"(1) حضرت عیسیٰ (عليه السلام) کا قصہ اس لیے بیان فرمایا کہ بنی اسرائیل نے جس طرح حضرت موسیٰ (عليه السلام) کی نافرمانی کی، اسی طرح انہوں نے حضرت عیسیٰ (عليه السلام) کا بھی انکار کیا، اس میں نبی (صلى الله عليه وسلم) کو تسلی دی جارہی ہے کہ یہ یہود آپ (صلى الله عليه وسلم) ہی کے ساتھ اس طرح نہیں کر رہے ہیں، بلکہ ان کی تو ساری تاریخ ہی انبیا علیہم السلام کی تکذیب سے بھری پڑی ہے۔ تورات کی تصدیق کا مطلب یہ ہے کہ میں جو دعوت دے رہا ہوں، وہ وہی ہے جو تورات کی بھی دعوت ہے۔ جو اس بات کی دلیل ہے، کہ جو پیغمبر مجھ سے پہلے تورات لے کر آئے اور اب میں انجیل لے کر آیا ہوں، ہم دونوں کا اصل ماخذ ایک ہی ہے۔ اس لیے جس طرح تم موسیٰ وہارون اور داود وسلیمان علیہم السلام پر ایمان لائے ، مجھ پر بھی ایمان لاؤ، اس لیے کہ میں تورات کی تصدیق کر رہا ہوں نہ کہ اس کی تردید وتکذیب۔\n(2) یہ حضرت عیسیٰ (عليه السلام) نے اپنے بعد آنے والے آخری پیغمبر حضرت محمد رسول اللہ (صلى الله عليه وسلم) کی خوش خبری سنائی۔ چنانچہ نبی (صلى الله عليه وسلم) نے فرمایا : «أَنَا دَعْوَةُ أَبِي إِبْرَاهِيمَ وَبَشَارَةُ عِيسَى» (أيسر التفاسير) (میں اپنے باپ ابراہیم (عليه السلام) کی دعا اور عیسیٰ (عليه السلام) کی بشارت کا مصداق ہوں)۔ احمد، یہ فاعل سے اگر مبالغے کا صیغہ ہو تو معنی ہوں گے، دوسرے تمام لوگوں سے اللہ کی زیادہ حمد کرنے والا۔ اور اگر یہ مفعول سے ہو تو معنی ہوں گے کہ آپ (صلى الله عليه وسلم) کی خوبیوں اور کمالات کی وجہ سے جتنی تعریف آپ (صلى الله عليه وسلم) کی کی گئی، اتنی کسی کی بھی نہیں کی گئی۔ (فتح القدیر)۔\n(3) یعنی حضرت عیسیٰ (عليه السلام) کے پیش کردہ معجزات کو جادو سے تعبیر کیا، جس طرح گزشتہ قومیں بھی اپنے پیغمبروں کو اسی طرح کہتی رہی ہیں۔ بعض نے اس سے مراد نبی (صلى الله عليه وسلم) لیے ہیں اور قَالُوا کا فاعل کفار مکہ کو بنایا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-idh qāla ʿīsā ub'nu maryama yābanī is'rāīla innī rasūlu al-lahi ilaykum muṣaddiqan limā bayna yadayya mina al-tawrāti wamubashiran birasūlin yatī min baʿdī us'muhu aḥmadu falammā jāahum bil-bayināti qālū hādhā siḥ'run mubīnun ","translations":["And when","said","Isa","son","(of) Maryam","O Children","(of) Israel","Indeed, I am","(the) Messenger","(of) Allah","to you","confirming","that which","(was) between","my hands","of","the Taurat","and bringing glad tidings","(of) a Messenger","to come","from","after me","whose name (will be)","Ahmad","But when","he came to them","with clear proofs","they said","This","(is) a magic","clear","(6)"],"transliterationArr":["wa-idh","qāla","ʿīsā","ub'nu","maryama","yābanī","is'rāīla","innī","rasūlu","al-lahi","ilaykum","muṣaddiqan","limā","bayna","yadayya","mina","al-tawrāti","wamubashiran","birasūlin","yatī","min","baʿdī","us'muhu","aḥmadu","falammā","jāahum","bil-bayināti","qālū","hādhā","siḥ'run","mubīnun",null],"verseTiming":[[1,0,630],[2,630,1320],[3,1320,1830],[4,1830,2270],[5,2270,2990],[6,2990,5210],[7,5210,8140],[8,8140,9390],[9,9390,10230],[10,10230,11080],[11,11080,11930],[12,11930,13950],[13,13950,14680],[14,14680,15240],[15,15240,16110],[16,16110,16470],[17,16470,17710],[18,17710,19730],[19,19730,21460],[20,21460,22220],[21,22220,23250],[22,23250,23830],[23,23830,26100],[24,26100,27390],[25,27390,28960],[26,28960,31960],[27,31960,33430],[28,33430,34230],[29,34230,34960],[30,34960,35670],[31,35670,38945]]}}