{"name":"62:11","price":"اور جب کوئی سودا بکتا دیکھیں یا کوئی تماشا نظر آجائے تو اس کی طرف دوڑ جاتے ہیں اور آپ کو کھڑا ہی چھوڑ دیتے ہیں(1) ۔ آپ کہہ دیجئے کہ اللہ کے پاس جو ہے(2) وه کھیل اور تجارت سے بہتر ہے(3)۔ اور اللہ تعالیٰ بہترین روزی رساں ہے.(4)","arabic":"وَإِذَا رَأَوۡاْ تِجَٰرَةً أَوۡ لَهۡوًا ٱنفَضُّوٓاْ إِلَيۡهَا وَتَرَكُوكَ قَآئِمٗاۚ قُلۡ مَا عِندَ ٱللَّهِ خَيۡرٞ مِّنَ ٱللَّهۡوِ وَمِنَ ٱلتِّجَٰرَةِۚ وَٱللَّهُ خَيۡرُ ٱلرَّٰزِقِينَ","category":["62 (Al-Jumu'ah)","Al-Jumu'ah","Surah Al-Jumu'ah","Chapter Al-Jumu'ah","Jumu'ah","Surah Jumu'ah","Chapter Jumu'ah","Al Jumu'ah","Surah Al Jumu'ah","Chapter Al Jumu'ah","Surah 62","Chapter 62","The Day of Congregation","الجمعة"],"ayahNumber":5188,"juzNumber":28,"footnotes":"(1) ایک مرتبہ نبی کریم (صلى الله عليه وسلم) جمعے کا خطبہ ارشاد فرما رہے تھے کہ ایک قافلہ آگیا، لوگوں کو پتہ چلا تو خطبہ چھوڑ کر باہر خرید وفروخت کے لیے چلے گئے کہ کہیں سامان فروخت ختم نہ ہو جائے صرف 12 آدمی مسجد میں رہ گئے۔ جس پر یہ آیت نازل ہوئی (صحيح بخاري، تفسير سورة الجمعة وصحيح مسلم، كتاب الجمعة، باب وإذا رأوا تجارة أو لهوا...) انْفِضَاضٌ کے معنی ہیں، مائل اور متوجہ ہونا، دوڑ کر منتشر ہو جانا۔ إِلَيْهَا میں ضمیر کا مرجع تِجَارَةً ہے۔ یہاں صرف ضمیر تجارت پر اکتفا کیا، اس لیے کہ جب تجارت بھی ، باوجود جائز اور ضروری ہونے کے، دوران خطبہ مذموم ہے تو کھیل وغیرہ کے مذموم ہونے میں کیا شک ہوسکتا ہے؟ علاوہ ازیں (قآئماً) سے معلوم ہوا کہ خطبہ جمعہ کھڑے ہو کر دینا سنت ہے۔ چنانچہ حدیث میں بھی آتا ہے کہ آپ (صلى الله عليه وسلم) کے دو خطبے ہوتے تھے، جن کے درمیان آپ (صلى الله عليه وسلم) بیٹھتے تھے، قرآن پڑھتے اور لوگوں کو وعظ ونصیحت فرماتے۔ (صحيح مسلم، كتاب الجمعة)۔\n(2) یعنی اللہ اور رسول (صلى الله عليه وسلم) کے احکام کی اطاعت کی جو جزائے عظیم ہے۔\n(3) جس کی طرف تم دوڑ کر گئے اور مسجد سے نکل گئے اور خطبہ جمعہ کی سماعت بھی نہیں کی۔\n(4) پس اسی سے روزی طلب کرو اور اطاعت کے ذریعے سے اسی کی طرف وسیلہ پکڑو۔ اس کی اطاعت اور اس کی طرف انابت تحصیل رزق کا بہت بڑا سبب ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-idhā ra-aw tijāratan aw lahwan infaḍḍū ilayhā watarakūka qāiman qul mā ʿinda al-lahi khayrun mina al-lahwi wamina al-tijārati wal-lahu khayru al-rāziqīna ","translations":["And when","they saw","a transaction","or","a sport","they rushed","to it","and left you","standing","Say","What","(is) with","Allah","(is) better","than","the sport","and from","(any) transaction","And Allah","(is the) Best","(of) the Providers","(11)"],"transliterationArr":["wa-idhā","ra-aw","tijāratan","aw","lahwan","infaḍḍū","ilayhā","watarakūka","qāiman","qul","mā","ʿinda","al-lahi","khayrun","mina","al-lahwi","wamina","al-tijārati","wal-lahu","khayru","al-rāziqīna",null],"verseTiming":[[1,0,830],[2,830,1360],[3,1360,2610],[4,2610,2970],[5,2970,3660],[6,3660,6970],[7,6970,8030],[8,8030,9280],[9,9280,11809],[10,11809,12590],[11,12590,13000],[12,13000,14180],[13,14180,14990],[14,14990,15600],[15,15600,16740],[16,16740,17660],[17,17660,18130],[18,18130,19930],[19,19930,20940],[20,20940,21690],[21,21690,26395]]}}