{"name":"62:3","price":"اور دوسروں کے لیے بھی انہیں میں سے جو اب تک ان سے نہیں(1) ملے۔ اور وہی غالب باحکمت ہے.","arabic":"وَءَاخَرِينَ مِنۡهُمۡ لَمَّا يَلۡحَقُواْ بِهِمۡۚ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","category":["62 (Al-Jumu'ah)","Al-Jumu'ah","Surah Al-Jumu'ah","Chapter Al-Jumu'ah","Jumu'ah","Surah Jumu'ah","Chapter Jumu'ah","Al Jumu'ah","Surah Al Jumu'ah","Chapter Al Jumu'ah","Surah 62","Chapter 62","The Day of Congregation","الجمعة"],"ayahNumber":5180,"juzNumber":28,"footnotes":"(1) یہ أُمِّيِّينَ پر عطف ہے یعنی بَعَثَ فِي آخَرِينَ مِنْهُمْ آخَرِينَ سے فارس اور دیگر غیر عرب لوگ ہیں جو قیامت تک آپ (صلى الله عليه وسلم) پر ایمان لانے والے ہوں گے۔ بعض کہتے ہیں کہ عرب وعجم کے وہ تمام لوگ ہیں جو عہد صحابہ (رضي الله عنهم) کے بعد قیامت تک ہوں گے چنانچہ اس میں فارس، روم، بربر، سوڈان، ترک، مغول، کرد، چینی اور اہل ہند وغیرہ سب آجاتے ہیں۔ یعنی آپ (صلى الله عليه وسلم) کی نبوت سب کے لیے ہے چنانچہ یہ سب ہی آپ (صلى الله عليه وسلم) پر ایمان لائے۔ اور اسلام لانے کے بعد یہ بھی مِنْهُمْ کا مصداق یعنی اولین اسلام لانے والے أُمِّيِّينَ میں سے ہوگئے کیونکہ تمام مسلمان امت واحدہ ہیں۔ اسی ضمیر کی وجہ سے بعض کہتے ہیں کہ آخرین سے مراد بعد میں ہونے والے عرب ہیں کیونکہ مِنْهُمْ کی ضمیر کا مرجع أُمِّيِّين َ ہیں۔ (فتح القدیر)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waākharīna min'hum lammā yalḥaqū bihim wahuwa al-ʿazīzu al-ḥakīmu ","translations":["And others","among them","who have not yet","joined","them","and He","(is) the All-Mighty","the All-Wise","(3)"],"transliterationArr":["waākharīna","min'hum","lammā","yalḥaqū","bihim","wahuwa","al-ʿazīzu","al-ḥakīmu",null],"verseTiming":[[1,0,1370],[2,1370,2040],[3,2040,3430],[4,3430,4370],[5,4370,5010],[6,5010,5890],[7,5890,6900],[8,6900,9405]]}}