{"name":"64:9","price":"جس دن تم سب کو اس جمع ہونے کے دن(1) جمع کرے گا وہی دن ہے ہار جیت کا(2) اور جو شخص اللہ پر ایمان ﻻکر نیک عمل کرے اللہ اس سے اس کی برائیاں دور کر دے گا اور اسے جنتوں میں داخل کرے گا جن کے نیچے نہریں بہہ رہی ہیں جن میں وه ہمیشہ ہمیشہ رہیں گے۔ یہی بہت بڑی کامیابی ہے.","arabic":"يَوۡمَ يَجۡمَعُكُمۡ لِيَوۡمِ ٱلۡجَمۡعِۖ ذَٰلِكَ يَوۡمُ ٱلتَّغَابُنِۗ وَمَن يُؤۡمِنۢ بِٱللَّهِ وَيَعۡمَلۡ صَٰلِحٗا يُكَفِّرۡ عَنۡهُ سَيِّـَٔاتِهِۦ وَيُدۡخِلۡهُ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَآ أَبَدٗاۚ ذَٰلِكَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ","category":["64 (At-Taghabun)","At-Taghabun","Surah At-Taghabun","Chapter At-Taghabun","Taghabun","Surah Taghabun","Chapter Taghabun","At Taghabun","Surah At Taghabun","Chapter At Taghabun","Surah 64","Chapter 64","Mutual Disillusion","التغابن"],"ayahNumber":5208,"juzNumber":28,"footnotes":"(1) قیامت کو یوم الجمع اس لیے کہا کہ اس دن اول وآخر سب ایک ہی میدان میں جمع ہوں گے۔ فرشتہ پکارﮮ گا تو سب اس کی آواز سنیں گے، ہر ایک کی نگاہ آخر تک پہنچ جائے گی، کیونکہ درمیان میں کوئی چیز حائل نہ ہوگی۔ جیسے دوسرے مقام پر فرمایا: «ذَلِكَ يَوْمٌ مَجْمُوعٌ لَهُ النَّاسُ وَذَلِكَ يَوْمٌ مَشْهُودٌ» (هود: 103) ”وہ دن جس میں سب لوگ جمع کیے جائیں گے اور وہ ، وہ دن ہے جس میں سب حاضر کیے جائیں گے“۔ «قُلْ إِنَّ الأَوَّلِينَ وَالآخِرِينَ (1) لَمَجْمُوعُونَ إِلَى مِيقَاتِ يَوْمٍ مَعْلُومٍ» (الواقعة: 49-50)۔\n(2) یعنی ایک گروہ جیت جائے گا اور ایک ہار جائے گا، اہل حق اہل باطل پر ، ایمان والے اہل کفر پر اور اہل طاعت اہل معصیت پر جیت جائیں گے، سب سے بڑی جیت اہل ایمان کو یہ حاصل ہوگی کہ وہ جنت میں داخل ہو جائیں گے اور وہاں ان گھروں کے بھی وہ مالک بن جائیں گے جو جہنمیوں کے لیے تھے۔ اگر وہ جہنم میں جانے والے کام نہ کرتے۔ اور سب سے بڑی ہار جہنمیوں کے حصے میں آئے گی جو جہنم میں داخل ہوں گے، جنہوں نے خیر کو شر سے، عمدہ چیز کو ردی سے اور نعمتوں کو عذاب سے بدل لیا۔ غبن کے معنی نقصان اور خسارے کے بھی ہیں، یعنی نقصان کا دن۔ اس دن کافروں کو تو خسارے کا احساس ہوگا ہی۔ اہل ایمان کو بھی اس اعتبار سے خسارے کا احساس ہوگا کہ انہوں نے اور زیادہ نیکیاں کرکے مزید درجات کیوں نہ حاصل کیے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yawma yajmaʿukum liyawmi al-jamʿi dhālika yawmu al-taghābuni waman yu'min bil-lahi wayaʿmal ṣāliḥan yukaffir ʿanhu sayyiātihi wayud'khil'hu jannātin tajrī min taḥtihā al-anhāru khālidīna fīhā abadan dhālika al-fawzu al-ʿaẓīmu ","translations":["(The) Day","He will assemble you","for (the) Day","(of) the Assembly","that","(will be the) Day","(of) mutual loss and gain","And whoever","believes","in Allah","and does","righteous deeds","He will remove","from him","his evil deeds","and He will admit him","(to) Gardens","flow","from","underneath it","the rivers","abiding","therein","forever","That","(is) the success","the great","(9)"],"transliterationArr":["yawma","yajmaʿukum","liyawmi","al-jamʿi","dhālika","yawmu","al-taghābuni","waman","yu'min","bil-lahi","wayaʿmal","ṣāliḥan","yukaffir","ʿanhu","sayyiātihi","wayud'khil'hu","jannātin","tajrī","min","taḥtihā","al-anhāru","khālidīna","fīhā","abadan","dhālika","al-fawzu","al-ʿaẓīmu",null],"verseTiming":[[1,0,670],[2,670,1890],[3,1890,2780],[4,2780,3640],[5,3640,4450],[6,4450,5060],[7,5060,6260],[8,6260,7410],[9,7410,9530],[10,9530,10630],[11,10630,11540],[12,11540,12450],[13,12450,13540],[14,13540,14950],[15,14950,16580],[16,16580,17730],[17,17730,19320],[18,19320,20990],[19,20990,22770],[20,22770,25590],[21,25590,26370],[22,26370,26920],[23,26920,28110],[24,28110,29340],[25,29340,30550],[26,30550,32890],[27,32890,34410],[28,34410,35240],[29,35240,36070],[30,36070,39135]]}}