{"name":"65:1","price":"اے نبی! (اپنی امت سے کہو کہ) جب تم اپنی بیویوں کو طلاق دینا چاہو(1) تو ان کی عدت (کے دنوں کے آغاز) میں انہیں طلاق دو(2) اور عدت کا حساب رکھو(3)، اور اللہ سے جو تمہارا پروردگار ہے ڈرتے رہو، نہ تم انہیں ان کے گھروں سے نکالو(4) اور نہ وه (خود) نکلیں(5) ہاں یہ اور بات ہے کہ وه کھلی برائی کر بیٹھیں(6)، یہ اللہ کی مقرر کرده حدیں ہیں، جو شخص اللہ کی حدوں سے آگے بڑھ جائے اس نے یقیناً اپنے اوپر ﻇلم کیا(7)، تم نہیں جانتے شاید اس کے بعد اللہ تعالیٰ کوئی نئی بات پیدا کر دے.(8)","arabic":"يَٰٓأَيُّهَا ٱلنَّبِيُّ إِذَا طَلَّقۡتُمُ ٱلنِّسَآءَ فَطَلِّقُوهُنَّ لِعِدَّتِهِنَّ وَأَحۡصُواْ ٱلۡعِدَّةَۖ وَٱتَّقُواْ ٱللَّهَ رَبَّكُمۡۖ لَا تُخۡرِجُوهُنَّ مِنۢ بُيُوتِهِنَّ وَلَا يَخۡرُجۡنَ إِلَّآ أَن يَأۡتِينَ بِفَٰحِشَةٖ مُّبَيِّنَةٖۚ وَتِلۡكَ حُدُودُ ٱللَّهِۚ وَمَن يَتَعَدَّ حُدُودَ ٱللَّهِ فَقَدۡ ظَلَمَ نَفۡسَهُۥۚ لَا تَدۡرِي لَعَلَّ ٱللَّهَ يُحۡدِثُ بَعۡدَ ذَٰلِكَ أَمۡرٗا","category":["65 (At-Talaq)","At-Talaq","Surah At-Talaq","Chapter At-Talaq","Talaq","Surah Talaq","Chapter Talaq","At Talaq","Surah At Talaq","Chapter At Talaq","Surah 65","Chapter 65","The Divorce","الطلاق"],"ayahNumber":5218,"juzNumber":28,"footnotes":"(1) نبی (صلى الله عليه وسلم) سے خطاب آپ کے شرف ومرتبت کی وجہ سے ہے، ورنہ حکم تو امت کو دیا جارہا ہے۔ یا آپ ہی کو بطور خاص خطاب ہے اور جمع کا صیغہ بطور تعظیم کے ہے اور امت کے لیے آپ (صلى الله عليه وسلم) کا اسوہ ہی کافی ہے۔ طَلَّقْتُمُ کا مطلب ہے جب طلاق دینے کا پختہ ارادہ کر لو۔\n(2) اس میں طلاق دینے کا طریقہ اور وقت بتلایا ہے لِعِدَّتِهِنَّ میں لام توقیت کے لیے ہے۔ یعنی لأوَّلِ یا لاسْتِقْبَالِ عِدَّتِهِنَّ (عدت کے آغاز میں) طلاق دو۔ یعنی جب عورت حیض سے پاک ہو جائے تو اس سے ہم بستری کیے بغیر طلاق دو۔ حالت طہر اسکی عدت کا آغاز ہے۔ اس کا مطلب یہ ہے کہ حیض کی حالت میں یا طہر میں ہم بستری کرنے کے بعد طلاق دینا غلط طریقہ ہے اس کو فقہا طلاق بدعی سے اور پہلے (صحیح) طریقے کو طلاق سنت سے تعبیر کرتے ہیں۔ اس کی تائید اس حدیث سے ہوتی ہے جس میں آتا ہے کہ حضرت ابن عمر (رضي الله عنه) ما نے حیض کی حالت میں اپنی بیوی کو طلاق دے دی تو رسول اللہ (صلى الله عليه وسلم) غضبناک ہوئے اور انہیں اس سے رجوع کرنے کے ساتھ حکم دیا کہ حالت طہر میں طلاق دینا، اور اس کے لیے آپ (صلى الله عليه وسلم) نے اسی آیت سے استدلال فرمایا۔ (صحيح بخاري، كتاب الطلاق) تاہم حیض میں دی گئی طلاق بھی ، باوجود بدعی ہونے کے واقع ہو جائے گی۔ محدثین اور جمہور علما اسی بات کے قائل ہیں۔ البتہ امام ابن قیم اور امام ابن تیمیہ طلاق بدعی کے وقوع کے قائل نہیں ہیں۔ (تفصیل کے لیے دیکھیئے نيل الأوطار، كتاب الطلاق، باب النهي عن الطلاق في الحيض وفي الطهر اور دیگر شروحات حدیث)۔\n(3) یعنی اس کی ابتدا اور انتہا کا خیال رکھو، تاکہ عورت اس کے بعد نکاح ثانی کرسکے، یا اگر تم ہی رجوع کرنا چاہو، (پہلی اور دوسری طلاق کی صورت میں) تو عدت کے اندر رجوع کرسکو۔\n(4) یعنی طلاق دیتے ہی عورت کو اپنے گھر سے مت نکالو، بلکہ عدت تک اسے گھر میں ہی رہنے دو، اور اس وقت تک رہائش اور نان ونفقہ تمہاری ذمے داری ہے۔\n(5) یعنی عدت کے دوران خود عورت بھی گھر سے باہر نکلنے سے احتراز کرے، الایہ کہ کوئی بہت ہی ضروری معاملہ ہو۔\n(6) یعنی بدکاری کا ارتکاب کر بیٹھے یا بدزبانی اور بداخلاقی کا مظاہرہ کرے جس سے گھر والوں کو تکلیف ہو۔ دونوں صورتوں میں اس کا اخراج جائز ہوگا۔\n(7) یعنی احکام مذکورہ، اللہ کی حدیں ہیں، جن سے تجاوز خود اپنے آپ پر ہی ظلم کرنا ہے، کیونکہ اس کے دینی اور دنیوی نقصانات خود تجاوز کرنے والے کو ہی بھگتنے پڑیں گے۔\n(8) یعنی مرد کے دل میں مطلقہ عورت کی رغبت پیدا کر دے اور وہ رجوع کرنے پر آمادہ ہو جائے، جیسا کہ پہلی اور دوسری طلاق کے بعد خاوند کو عدت کے اندر رجوع کرنے کا حق حاصل ہے۔ اسی لیےبعض مفسرین کی رائے ہے کہ اس آیت میں اللہ تعالیٰ نے صرف ایک طلاق دینے کی تلقین اور بیک وقت تین طلاقیں دینے سے منع فرمایا ہے، کیونکہ اگر وہ ایک ہی وقت میں تین طلاقیں دے دے (اور شریعت اسے جائز قرار دے کر نافذ بھی کر دے) تو پھر یہ کہنا بےفائدہ ہے کہ شاید اللہ تعالیٰ کوئی نئی بات پیدا کر دے۔ (فتح القدیر) اسی سے امام احمد اور دیگر بعض علما نے یہ استدلال بھی کیا ہے کہ رہائش اور نفقے کی جو تاکید کی گئی ہے وہ ان عورتوں کے لیے ہے جن کو ان کے خاوندوں نے پہلی یا دوسری طلاق دی ہو۔ کیونکہ ان میں خاوند کے رجوع کا حق برقرار رہتا ہے۔ اور جس عورت کو مختلف اوقات میں دو طلاقیں مل چکی ہوں تو تیسری طلاق اس کے لیے طلاق بتہ یا بائنہ ہے، اس کا سُكْنَى (رہائش) اور نفقہ خاوند کے ذمے نہیں ہے۔ اس کو فوراً خاوند کے مکان سے دوسری جگہ منتقل کر دیا جائے گا، کیونکہ خاوند اب اس سے رجوع کرکے اسے اپنے گھر آباد نہیں کرسکتا حَتَّى تَنْكِحَ زَوْجًا غَيْرَهُ۔ اس لیے اب اسے خاوند کے پاس رہنے کا اور اس سے نان ونفقہ وصول کرنے کا حق نہیں ہے۔ اس کی تائید حضرت فاطمہ بنت قیس (رضی الله عنها) کے اس واقعے سے ہوتی ہے کہ جب ان کے خاوند نے ان کو تیسری طلاق بھی دے دی اور اس کے بعد انھیں خاوند کے مکان سے نکلنے کے لیے کہا گیا تو وہ آمادہ نہیں ہوئی بالآخر معاملہ رسول اللہ (صلى الله عليه وسلم) کے پاس پہنچا تو آپ (صلى الله عليه وسلم) نے یہی فیصلہ فرمایا کہ ان کے لیے رہائش اور نفقہ نہیں ہے، انھیں فوراً کسی دوسری جگہ منتقل ہو جانا چاہیے۔ بلکہ بعض روایات میں صراحت بھی ہے، إِنَّمَا النَّفَقَةُ وَالسُّكْنَى لِلْمَرْأَةِ؛ إِذَا كَانَ لِزَوْجِهَا عَلَيْهَا الرَّجْعَةُ رواه أحمد والنسائي۔ البتہ بعض روایات میں حاملہ عورت کے لیے بھی نفقہ اور رہائش کی صراحت ہے۔ (تفصیل اور حوالوں کے لیے دیکھئے: نيل الأوطار، باب ما جاء في نفقة المبتوتة وسكناها وباب النفقة والسكنى للمعتدة الرجعية) بعض لوگ ان روایات کو قرآن کے مذکورہ حکم ”لا تُخْرِجُوهُنَّ مِنْ بُيُوتِهِنَّ“ کے خلاف باور کرا کے ان کو رد کر دیتے ہیں جو صحیح نہیں ہے۔ کیونکہ قرآن کا حکم اپنے گرد وپیش کے قرائن کے پیش نظر مطلقہ رجعیہ سے متعلق ہے۔ اور اگر اسے عام مان بھی لیا جائے تو یہ روایات اس کی مخصص ہیں یعنی قرآن کے عموم کو ان روایات نے مطلقہ رجعیہ کے لیے خاص کر دیا اور مطلقہ بائنہ کو اس عموم سے نکال دیا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāayyuhā al-nabiyu idhā ṭallaqtumu al-nisāa faṭalliqūhunna liʿiddatihinna wa-aḥṣū al-ʿidata wa-ittaqū al-laha rabbakum lā tukh'rijūhunna min buyūtihinna walā yakhruj'na illā an yatīna bifāḥishatin mubayyinatin watil'ka ḥudūdu al-lahi waman yataʿadda ḥudūda al-lahi faqad ẓalama nafsahu lā tadrī laʿalla al-laha yuḥ'dithu baʿda dhālika amran ","translations":["O","Prophet","When","you divorce","[the] women","then divorce them","for their waiting period","and keep count","(of) the waiting period","and fear","Allah","your Lord","(Do) not","expel them","from","their houses","and not","they should leave","except","that","they commit","an immorality","clear","And these","(are the) limits","(of) Allah","And whoever","transgresses","(the) limits","(of) Allah","then certainly","he has wronged","himself","Not","you know","Perhaps","Allah","will bring about","after","that","a matter","(1)"],"transliterationArr":["yāayyuhā","al-nabiyu","idhā","ṭallaqtumu","al-nisāa","faṭalliqūhunna","liʿiddatihinna","wa-aḥṣū","al-ʿidata","wa-ittaqū","al-laha","rabbakum","lā","tukh'rijūhunna","min","buyūtihinna","walā","yakhruj'na","illā","an","yatīna","bifāḥishatin","mubayyinatin","watil'ka","ḥudūdu","al-lahi","waman","yataʿadda","ḥudūda","al-lahi","faqad","ẓalama","nafsahu","lā","tadrī","laʿalla","al-laha","yuḥ'dithu","baʿda","dhālika","amran",null],"verseTiming":[[1,0,2570],[2,2570,4150],[3,4150,4570],[4,4570,5810],[5,5810,8620],[6,8620,10840],[7,10840,13130],[8,13130,13890],[9,13890,15270],[10,15270,16040],[11,16040,16860],[12,16860,18170],[13,18170,18450],[14,18450,20670],[15,20670,21670],[16,21670,23660],[17,23660,24200],[18,24200,25110],[19,25110,25910],[20,25910,26560],[21,26560,27130],[22,27130,28030],[23,28030,29970],[24,29970,30380],[25,30380,31760],[26,31760,32970],[27,32970,35540],[28,35540,36280],[29,36280,37100],[30,37100,39930],[31,39930,40200],[32,40200,41820],[33,41820,42510],[34,42510,43350],[35,43350,43860],[36,43860,44530],[37,44530,45760],[38,45760,46100],[39,46100,46920],[40,46920,47550],[41,47550,48410],[42,48410,49190],[43,49190,49650],[44,49650,50540],[45,50540,51505]]}}