{"name":"65:12","price":"اللہ وه ہے جس نے سات آسمان بنائے اور اسی کے مثل زمینیں بھی(1) ۔ اس کا حکم ان کے درمیان اترتا ہے(2) تاکہ تم جان لو کہ اللہ ہر چیز پر قادر ہے۔ اور اللہ تعالیٰ نے ہر چیز کو بہ اعتبار علم گھیر رکھا ہے.(3)","arabic":"ٱللَّهُ ٱلَّذِي خَلَقَ سَبۡعَ سَمَٰوَٰتٖ وَمِنَ ٱلۡأَرۡضِ مِثۡلَهُنَّۖ يَتَنَزَّلُ ٱلۡأَمۡرُ بَيۡنَهُنَّ لِتَعۡلَمُوٓاْ أَنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ وَأَنَّ ٱللَّهَ قَدۡ أَحَاطَ بِكُلِّ شَيۡءٍ عِلۡمَۢا","category":["65 (At-Talaq)","At-Talaq","Surah At-Talaq","Chapter At-Talaq","Talaq","Surah Talaq","Chapter Talaq","At Talaq","Surah At Talaq","Chapter At Talaq","Surah 65","Chapter 65","The Divorce","الطلاق"],"ayahNumber":5229,"juzNumber":28,"footnotes":"(1) أَيْ خَلَقَ مِنَ الأَرْضِ مِثْلَهُنَّ یعنی سات آسمانوں کی طرح، اللہ نے سات زمینیں بھی پیدا کی ہیں۔ بعض نے اس سے سات اقالیم مراد لیے ہیں، لیکن یہ صحیح نہیں۔ بلکہ جس طرح اوپر نیچے سات آسمان ہیں، اسی طرح سات زمینیں ہیں، جن کے درمیان بعد ومسافت ہے اور ہر زمین میں اللہ کی مخلوق آباد ہے (القرطبی) احادیث سے بھی اس کی تائید ہوتی ہے، جیسے نبی (صلى الله عليه وسلم) نے فرمایا «مَنْ أَخَذَ شِبْرًا مِنَ الأَرْضِ ظُلْمًا فَإِنَّهُ يُطَوَّقُهُ يَوْمَ الْقِيَامَةِ مِنْ سَبْعِ أَرَاضِينَ» (صحيح مسلم، كتاب البيوع، باب تحريم الظلم) ”جس نے کسی کی ایک بالشت زمین بھی ہتھیالی تو قیامت والے دن اس زمین کا اتنا حصہ ساتوں زمینوں سے طوق بنا کر اس کے گلے میں ڈال دیا جائے گا“۔ صحیح بخاری کے الفاظ ہیں «خسف بِهِ إِلَى سَبْعِ أَرَاضِينَ» ”اس کو ساتوں زمینوں تک دھنسا دیا جائے گا“۔ (صحيح بخاري، كتاب المظالم باب إثم من ظلم شيئا من الأرض) بعض یہ بھی کہتے ہیں کہ ہر زمین میں، اسی طرح کا پیغمبر ہے، جس طرح کا پیغمبر تمہاری زمین پر آیا، مثلاً آدم، آدم کی طرح۔ نوح، نوح کی طرح۔ ابراہیم، ابراہیم کی طرح۔ عیسیٰ ، عیسیٰ کی طرح (علیہم السلام)۔ لیکن یہ بات کسی صحیح روایت سے ثابت نہیں۔\n(2) یعنی جس طرح ہر آسمان پر اللہ کا حکم نافذ اور غالب ہے، اسی طرح ہر زمین پر اس کا حکم چلتا ہے، آسمانوں کی طرح ساتوں زمینوں کی بھی وہ تدبیر فرماتا ہے۔\n(3) پس اس کے علم سے کوئی چیز باہر نہیں، چاہے وہ کیسی ہی ہو۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"al-lahu alladhī khalaqa sabʿa samāwātin wamina al-arḍi mith'lahunna yatanazzalu al-amru baynahunna litaʿlamū anna al-laha ʿalā kulli shayin qadīrun wa-anna al-laha qad aḥāṭa bikulli shayin ʿil'man ","translations":["Allah","(is) He Who","created","seven","heavens","and of","the earth","(the) like of them","Descends","the command","between them","that you may know","that","Allah","(is) on","every","thing","All-Powerful","And that","Allah","indeed","encompasses","all","things","(in) knowledge","(12)"],"transliterationArr":["al-lahu","alladhī","khalaqa","sabʿa","samāwātin","wamina","al-arḍi","mith'lahunna","yatanazzalu","al-amru","baynahunna","litaʿlamū","anna","al-laha","ʿalā","kulli","shayin","qadīrun","wa-anna","al-laha","qad","aḥāṭa","bikulli","shayin","ʿil'man",null],"verseTiming":[[1,0,980],[2,980,1710],[3,1710,2290],[4,2290,2880],[5,2880,4810],[6,4810,5230],[7,5230,6060],[8,6060,7740],[9,7740,9050],[10,9050,9690],[11,9690,11390],[12,11390,12600],[13,12600,15390],[14,15390,16390],[15,16390,17210],[16,17210,17730],[17,17730,18290],[18,18290,19720],[19,19720,21250],[20,21250,22380],[21,22380,23240],[22,23240,23580],[23,23580,24540],[24,24540,25420],[25,25420,26470],[26,26470,27715]]}}