{"name":"66:12","price":"اور (مثال بیان فرمائی) مریم بنت عمران کی(1) جس نے اپنے ناموس کی حفاﻇت کی پھر ہم نے اپنی طرف سے اس میں جان پھونک دی اور (مریم) اس نے اپنے رب کی باتوں(2) اور اس کی کتابوں کی تصدیق کی اور عبادت گزاروں میں سے تھی.(3)","arabic":"وَمَرۡيَمَ ٱبۡنَتَ عِمۡرَٰنَ ٱلَّتِيٓ أَحۡصَنَتۡ فَرۡجَهَا فَنَفَخۡنَا فِيهِ مِن رُّوحِنَا وَصَدَّقَتۡ بِكَلِمَٰتِ رَبِّهَا وَكُتُبِهِۦ وَكَانَتۡ مِنَ ٱلۡقَٰنِتِينَ","category":["66 (At-Tahrim)","At-Tahrim","Surah At-Tahrim","Chapter At-Tahrim","Tahrim","Surah Tahrim","Chapter Tahrim","At Tahrim","Surah At Tahrim","Chapter At Tahrim","Surah 66","Chapter 66","The Prohibition","التحريم"],"ayahNumber":5241,"juzNumber":28,"footnotes":"(1) حضرت مریم علیہا السلام کے ذکر سے مقصود یہ بیان کرنا ہے کہ باوجود اس بات کے کہ وہ ایک بگڑی ہوئی قوم کے درمیان رہتی تھی، لیکن اللہ نے انہیں دنیا و آخرت میں شرف و کرامت سے سرفراز فرمایا اور تمام جہان کی عورتوں پر انہیں فضیلت عطا فرمائی۔\n(2) کلمات رب سے مراد شرائع الہی ہیں۔\n(3) یعنی ایسے لوگوں میں سے یا خاندان میں سے تھیں جو فرماں بردار عبادت گزار اور صلاح واطاعت میں ممتاز تھا حدیث میں ہے جنتی عورتوں میں سب سے افضل حضرت خدیجہ، حضرت فاطمہ، حضرت مریم اور فرعون کی بیوی آسیہ ہیں رضی اللہ عنھن۔(مسند احمد) ایک دوسری حدیث میں فرمایا مردوں میں تو کامل بہت ہوئے ہیں مگر عورتوں میں کامل صرف فرعون کی بیوی آسیہ مریم بنت عمران اور خدیجہ بنت خویلد رضی اللہ عنھن ہیں اور عائشہ (رضي الله عنه) ا کی فضلیت عورتوں پر ایسے ہے جیسے ثرید کو تمام کھانوں پر فضلیت حاصل ہے۔ صحیح بخاری۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wamaryama ib'nata ʿim'rāna allatī aḥṣanat farjahā fanafakhnā fīhi min rūḥinā waṣaddaqat bikalimāti rabbihā wakutubihi wakānat mina al-qānitīna ","translations":["And Maryam","(the) daughter","(of) Imran","who","guarded","her chastity","so We breathed","into it","of","Our Spirit","And she believed","(in the) Words","(of) her Lord","and His Books","and she was","of","the devoutly obedient","(12)"],"transliterationArr":["wamaryama","ib'nata","ʿim'rāna","allatī","aḥṣanat","farjahā","fanafakhnā","fīhi","min","rūḥinā","waṣaddaqat","bikalimāti","rabbihā","wakutubihi","wakānat","mina","al-qānitīna",null],"verseTiming":[[1,0,960],[2,960,1610],[3,1610,2440],[4,2440,4860],[5,4860,5820],[6,5820,6790],[7,6790,8000],[8,8000,8630],[9,8630,8770],[10,8770,9980],[11,9980,12930],[12,12930,14100],[13,14100,14990],[14,14990,16240],[15,16240,17330],[16,17330,17660],[17,17660,22245]]}}