{"name":"66:1","price":"اے نبی! جس چیز کو اللہ نے آپ کے لیے حلال کر دیا ہے اسے آپ کیوں حرام کرتے ہیں(1) ؟ (کیا) آپ اپنی بیویوں کی رضامندی حاصل کرنا چاہتے ہیں اور اللہ بخشنے واﻻ رحم کرنے واﻻ ہے.","arabic":"يَٰٓأَيُّهَا ٱلنَّبِيُّ لِمَ تُحَرِّمُ مَآ أَحَلَّ ٱللَّهُ لَكَۖ تَبۡتَغِي مَرۡضَاتَ أَزۡوَٰجِكَۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ","category":["66 (At-Tahrim)","At-Tahrim","Surah At-Tahrim","Chapter At-Tahrim","Tahrim","Surah Tahrim","Chapter Tahrim","At Tahrim","Surah At Tahrim","Chapter At Tahrim","Surah 66","Chapter 66","The Prohibition","التحريم"],"ayahNumber":5230,"juzNumber":28,"footnotes":"(1) نبی (صلى الله عليه وسلم) نے جس چیز کو اپنے لئے حرام کرلیا تھا، وہ کیا تھی؟ جس پر اللہ نے ناپسندیدگی کا اظہار فرمایا۔ اس سلسلے میں ایک تو وہ مشہور واقعہ ہے جو صحیح بخاری و مسلم وغیرہ میں نقل ہوا ہے کہ آپ (صلى الله عليه وسلم) حضرت زینب بنت جحش (رضی الله عنها) کے پاس کچھ دیر ٹھہرتے اور وہاں شہد پیتے، حضرت حفصہ اور حضرت عائشہ ب دونوں نے وہاں معمول سے زیادہ دیر تک آپ (صلى الله عليه وسلم)کو ٹھہرنے سے روکنے کے لئے یہ سکیم تیار کی کہ ان میں سے جس کے پاس بھی آپ (صلى الله عليه وسلم) تشریف لائیں تو وہ ان سے کہے کہ اللہ کے رسول! آپ (صلى الله عليه وسلم) کے منہ سے مغافیر (ایک قسم کا پھول جس میں بساند ہوتی ہے) کی بو آرہی ہے۔ چنانچہ انہوں نے ایسا ہی کیا آپ (صلى الله عليه وسلم) نے فرمایا، میں نے تو زینب (رضی الله عنها)کے گھر صرف شہد پیا ہے۔ اب میں قسم کھاتا ہوں کہ یہ نہیں پیوں گا، لیکن یہ بات تم کسی کو مت بتلانا۔ صحیح بخاری۔ سنن نسائی میں بیان کیا گیا ہے کہ وہ ایک لونڈی تھی جس کو آپ (صلى الله عليه وسلم)نے اپنے اوپر حرام کرلیا تھا (سنن نسائی) جب کہ کچھ دوسرے علماء اسے ضعیف قرار دیتے ہیں اس کی تفصیل دوسری کتابوں میں اس طرح بیان کی گئی ہے کہ یہ حضرت ماریہ قبطیہ (رضی الله عنها)تھیں جن سے نبی (صلى الله عليه وسلم) کے صاحبزادے ابراہیم (عليه السلام)تولد ہوئے تھے، یہ ایک مرتبہ حضرت حفصہ (رضی الله عنها)کے گھر آگئی تھیں جب کہ حضرت حفصہ (رضی الله عنها) موجود نہیں تھیں اتفاق سے انہی کی موجودگی میں حضرت حفصہ (رضی الله عنها) آگئیں انہیں نبی (صلى الله عليه وسلم) کے ساتھ اپنے گھر میں خلوت میں دیکھنا ناگوار گزرا۔ جسے نبی (صلى الله عليه وسلم) نے بھی محسوس فرمایا جس پر آپ (صلى الله عليه وسلم) نے حضرت حفصہ (رضی الله عنها) کو راضی کرنے کے لیے قسم کھا کر ماریہ ر(رضی الله عنها) کو اپنے اوپر حرام کرلیا اور حفصہ (رضی الله عنها)کو تاکید کی کہ وہ یہ بات کسی کو نہ بتلائے امام ابن حجر ایک تو یہ فرماتے ہیں کہ یہ واقعہ مختلف طرق سے نقل ہوا ہے جو ایک دوسرے کو تقویت پہنچاتے ہیں دوسری بات وہ یہ فرماتے ہیں کہ ممکن ہے بیک وقت دونوں ہی واقعات اس آیت کے نزول کا سبب بنے ہوں۔ فتح الباری۔ امام شوکانی نے بھی اسی رائے کا اظہار کیا ہے اور دونوں کو صحیح قرار دیا ہے اس سے یہ بات واضح ہوئی کہ اللہ کی حلال کردہ چیز کو حرام کرنے کا اختیار کسی کے پاس بھی نہیں ہے حتی کہ رسول اللہ (صلى الله عليه وسلم) بھی یہ اختیار نہیں رکھتے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāayyuhā al-nabiyu lima tuḥarrimu mā aḥalla al-lahu laka tabtaghī marḍāta azwājika wal-lahu ghafūrun raḥīmun ","translations":["O","Prophet","Why (do)","you prohibit","what","has made lawful","Allah","for you","seeking","(to) please","your wives","And Allah","(is) Oft-Forgiving","Most Merciful","(1)"],"transliterationArr":["yāayyuhā","al-nabiyu","lima","tuḥarrimu","mā","aḥalla","al-lahu","laka","tabtaghī","marḍāta","azwājika","wal-lahu","ghafūrun","raḥīmun",null],"verseTiming":[[1,0,2770],[2,2770,4410],[3,4410,4760],[4,4760,5780],[5,5780,7830],[6,7830,8580],[7,8580,9500],[8,9500,10350],[9,10350,11280],[10,11280,12270],[11,12270,13780],[12,13780,14720],[13,14720,15750],[14,15750,18305]]}}