{"name":"66:2","price":"تحقیق کہ اللہ تعالیٰ نے تمہارے لیے قسموں کو کھول ڈالنا مقرر کر دیا ہے(1) اور اللہ تمہارا کارساز ہے اور وہی (پورے) علم واﻻ، حکمت واﻻ ہے.","arabic":"قَدۡ فَرَضَ ٱللَّهُ لَكُمۡ تَحِلَّةَ أَيۡمَٰنِكُمۡۚ وَٱللَّهُ مَوۡلَىٰكُمۡۖ وَهُوَ ٱلۡعَلِيمُ ٱلۡحَكِيمُ","category":["66 (At-Tahrim)","At-Tahrim","Surah At-Tahrim","Chapter At-Tahrim","Tahrim","Surah Tahrim","Chapter Tahrim","At Tahrim","Surah At Tahrim","Chapter At Tahrim","Surah 66","Chapter 66","The Prohibition","التحريم"],"ayahNumber":5231,"juzNumber":28,"footnotes":"(1) یعنی کفارہ ادا کرکے اس کام کو کرنے کی، جس کی نہ کرنے کی قسم کھائی ہو، اجازت دے دی، قسم کا یہ کفارہ سورۃ مائد ۃ۔ 89 میں بیان کیا گیا ہے۔ چنانچہ نبی (صلى الله عليه وسلم) نے بھی کفارہ ادا کیا (فتح القدیر) اس امر میں علماء کے مابین اختلاف ہے کہ اگر کوئی شخص کسی چیز کو اپنے اوپر حرام کرلے تو اس کا یہ حکم ہے؟ جمہور علماء کے نزدیک بیوی کے علاوہ کسی چیز کو حرام کرنے سے وہ چیز حرام ہوگی اور نہ اس پر کفارہ ہے، اگر بیوی کو اپنے اوپر حرام کرے گا تو اس سے اس کا مقصد اگر طلاق ہے تو طلاق ہو جائے گی اور اگر طلاق کی نیت نہیں ہے تو راجح قول کے مطابق یہ قسم ہے، اس کے لئے کفارہ کی ادائیگی ضروری ہے۔ (ایسر التفاسیر)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qad faraḍa al-lahu lakum taḥillata aymānikum wal-lahu mawlākum wahuwa al-ʿalīmu al-ḥakīmu ","translations":["Indeed","has ordained","Allah","for you","(the) dissolution","(of) your oaths","And Allah","(is) your Protector","and He","(is) the All-Knower","the All-Wise","(2)"],"transliterationArr":["qad","faraḍa","al-lahu","lakum","taḥillata","aymānikum","wal-lahu","mawlākum","wahuwa","al-ʿalīmu","al-ḥakīmu",null],"verseTiming":[[1,0,360],[2,360,1020],[3,1020,1780],[4,1780,2360],[5,2360,3430],[6,3430,5220],[7,5220,6150],[8,6150,7790],[9,7790,8300],[10,8300,9290],[11,9290,12115]]}}