{"name":"66:5","price":"اگر وه (پیغمبر) تمہیں طلاق دے دیں تو بہت جلد انہیں ان کا رب! تمہارے بدلے تم سے بہتر بیویاں عنایت فرمائے گا(1) ، جو اسلام والیاں، ایمان والیاں اللہ کے حضور جھکنے والیاں توبہ کرنے والیاں، عبادت بجا ﻻنے والیاں روزے رکھنے والیاں ہوں گی بیوه اور کنواریاں.(2)","arabic":"عَسَىٰ رَبُّهُۥٓ إِن طَلَّقَكُنَّ أَن يُبۡدِلَهُۥٓ أَزۡوَٰجًا خَيۡرٗا مِّنكُنَّ مُسۡلِمَٰتٖ مُّؤۡمِنَٰتٖ قَٰنِتَٰتٖ تَٰٓئِبَٰتٍ عَٰبِدَٰتٖ سَٰٓئِحَٰتٖ ثَيِّبَٰتٖ وَأَبۡكَارٗا","category":["66 (At-Tahrim)","At-Tahrim","Surah At-Tahrim","Chapter At-Tahrim","Tahrim","Surah Tahrim","Chapter Tahrim","At Tahrim","Surah At Tahrim","Chapter At Tahrim","Surah 66","Chapter 66","The Prohibition","التحريم"],"ayahNumber":5234,"juzNumber":28,"footnotes":"(1) یہ تنبیہ کے طور پر ازواج مطہرات کو کہا جا رہا ہے کہ اللہ تعالٰی اپنے پیغمبر کو تم سے بھی بہتر بیویاں عطا کرسکتا ہے۔\n(2) ثیبات۔ثیب کی جمع ہے (لوٹ آنے والی) بیوہ عورت کو ثیب اس لیے کہا جاتا ہے کہ وہ خاوند سے واپس لوٹ آتی ہے اور پھر اس طرح بےخاوند رہ جاتی ہے جیسے پہلے تھی ابکار بکر کی جمع ہے کنواری عورت اسے بکر اسی لیے کہتے ہیں کہ یہ ابھی اپنی اسی پہلی حالت پر ہوتی ہے جس پر اس کی تخلیق ہوتی ہے فتح القدیر۔ بعض روایات میں آتا ہے کہ ثیب سے حضرت آسیہ فرعون کی بیوی اور بکر سے حضرت مریم حضرت عیسیٰ (عليه السلام) کی والدہ مراد ہیں یعنی جنت میں ان دونوں کو نبی (صلى الله عليه وسلم) کی بیویاں بنا دیا جائے گا ممکن ہے کہ ایسا ہو لیکن ان روایات کی بنیاد پر ایسا خیال رکھنا یا بیان کرنا صحیح نہیں ہے کیونکہ سندا یہ روایات پایہ اعتبار سے ساقط ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"ʿasā rabbuhu in ṭallaqakunna an yub'dilahu azwājan khayran minkunna mus'limātin mu'minātin qānitātin tāibātin ʿābidātin sāiḥātin thayyibātin wa-abkāran ","translations":["Perhaps","his Lord","if","he divorced you","[that]","He will substitute for him","wives","better","than you","submissive","faithful","obedient","repentant","who worship","who fast","previously married","and virgins","(5)"],"transliterationArr":["ʿasā","rabbuhu","in","ṭallaqakunna","an","yub'dilahu","azwājan","khayran","minkunna","mus'limātin","mu'minātin","qānitātin","tāibātin","ʿābidātin","sāiḥātin","thayyibātin","wa-abkāran",null],"verseTiming":[[1,0,760],[2,760,3240],[3,3240,4400],[4,4400,6430],[5,6430,6790],[6,6790,9700],[7,9700,10850],[8,10850,11530],[9,11530,14600],[10,14600,17700],[11,17700,19140],[12,19140,22080],[13,22080,23640],[14,23640,27300],[15,27300,29610],[16,29610,33330],[17,33330,35450],[18,35450,37405]]}}