{"name":"67:22","price":"اچھا وه شخص زیاده ہدایت واﻻ ہے جو اپنے منھ کے بل اوندھا ہو کر چلے(1) یا وه جو سیدھا (پیروں کے بل) راه راست پر چلا ہو؟(2)","arabic":"أَفَمَن يَمۡشِي مُكِبًّا عَلَىٰ وَجۡهِهِۦٓ أَهۡدَىٰٓ أَمَّن يَمۡشِي سَوِيًّا عَلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ","category":["67 (Al-Mulk)","Al-Mulk","Surah Al-Mulk","Chapter Al-Mulk","Mulk","Surah Mulk","Chapter Mulk","Al Mulk","Surah Al Mulk","Chapter Al Mulk","Surah 67","Chapter 67","The Sovereignty","الملك"],"ayahNumber":5263,"juzNumber":29,"footnotes":"(1) منہ کے بل اوندھے چلنے والے کو دائیں بائیں کچھ نظر نہیں آتا نہ وہ ٹھوکروں سے محفوظ ہوتا ہے کیا ایسا شخص اپنی منزل مقصود تک پہنچ سکتا ہے؟ یقینا نہیں اسی طرح دنیا میں اللہ کی معصیتوں میں ڈوبا ہوا شخص آخرت کی کامیابی سے محروم رہے گا۔\n(2) جس میں کوئی کجی اور انحراف نہ ہوا اور اس کو آگے اور دائیں بائیں بھی نظر آرہا ہو ظاہر ہے یہ شخص اپنی منزل مقصود کو پہنچ جائے گا یعنی اللہ کی اطاعت کا سیدھا راستہ اپنانے والا آخرت میں سرخرو رہے گا بعض کہتے ہیں کہ مومن اور کافر دونوں کی اس کیفیت کا بیان ہے جو قیامت والے دن انکی ہوگی کافر منہ کے بل جہنم میں جائے جائیں گے اور مومن سیدھے قدموں سے چل کر جنت میں جائیں گے۔جیسے کافروں کے بارے میں دوسرے مقام پر فرمایا« وَنَحۡشُرُهُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ عَلَىٰ وُجُوهِهِمۡ » (الإسراء: 97) ”ہم انہیں قیامت والے دن ان کے منہ کے بل اکٹھا کریں گے“۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"afaman yamshī mukibban ʿalā wajhihi ahdā amman yamshī sawiyyan ʿalā ṣirāṭin mus'taqīmin ","translations":["Then is he who","walks","fallen","on","his face","better guided","or (he) who","walks","upright","on","(the) Path","Straight","(22)"],"transliterationArr":["afaman","yamshī","mukibban","ʿalā","wajhihi","ahdā","amman","yamshī","sawiyyan","ʿalā","ṣirāṭin","mus'taqīmin",null],"verseTiming":[[1,0,750],[2,750,2210],[3,2210,3210],[4,3210,3850],[5,3850,6400],[6,6400,8860],[7,8860,10100],[8,10100,10870],[9,10870,11570],[10,11570,12560],[11,12560,13170],[12,13170,14090],[13,14090,18555]]}}