{"name":"68:17","price":"بیشک ہم نے انہیں اسی طرح آزما لیا(1) جس طرح ہم نے باغ والوں کو(2) آزمایا تھا جبکہ انہوں نے قسمیں کھائیں کہ صبح ہوتے ہی اس باغ کے پھل اتار لیں گے.(3)","arabic":"إِنَّا بَلَوۡنَٰهُمۡ كَمَا بَلَوۡنَآ أَصۡحَٰبَ ٱلۡجَنَّةِ إِذۡ أَقۡسَمُواْ لَيَصۡرِمُنَّهَا مُصۡبِحِينَ","category":["68 (Al-Qalam)","Al-Qalam","Surah Al-Qalam","Chapter Al-Qalam","Qalam","Surah Qalam","Chapter Qalam","Al Qalam","Surah Al Qalam","Chapter Al Qalam","Surah 68","Chapter 68","The Pen","القلم"],"ayahNumber":5288,"juzNumber":29,"footnotes":"(1) مراد اہل مکہ ہیں یعنی ہم نے ان کو مال و دولت سے نوازا تاکہ وہ اللہ کا شکر کریں نہ کہ کفر وتکبر لیکن انہوں نے کفر و استکبار کیا تو ہم نے انہیں بھوک اور قحط کی آزمائش میں ڈال دیا جس میں وہ نبی کی بددعا کی وجہ سے کچھ عرصہ مبتلا رہے۔\n(2) باغ والوں کا قصہ عربوں میں مشہور تھا۔ یہ باغ (یمن) سے دو فرسخ کے فاصلے پر تھا اس کا مالک اس کی پیداوار غربا و مساکین پر بھی خرچ کرتا تھا، لیکن اس کے مرنے کے بعد جب اس کی اولاد اس کی وارث بنی تو انہوں نے کہا کہ ہمارے تو اپنے اخراجات بمشکل پورے ہوتے ہیں، ہم اس کی آمدنی میں سے مساکین اور سائلین کو کس طرح دیں؟ چنانچہ اللہ تعالٰی نے اس باغ کو تباہ کر دیا، کہتے ہیں یہ واقعہ حضرت عیسیٰ (عليه السلام) کے آسمان پر اٹھائے جانے کے تھوڑے عرصے بعد پیش آیا (فتح القدیر) یہ ساری تفصیل تفسیری روایات کی ہے۔\n(3) صزم کے معنی ہے کاٹ ڈالنا ،پھل اور کھیتی کا کاٹ دالنا ،مصبحین ضال ہے یعنی صبح ہوتے ہی پھل اتار لیں گے اور پیداوار کاٹ لیں گے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"innā balawnāhum kamā balawnā aṣḥāba al-janati idh aqsamū layaṣrimunnahā muṣ'biḥīna ","translations":["Indeed, We","have tried them","as","We tried","(the) companions","(of) the garden","when","they swore","to pluck its fruit","(in the) morning","(17)"],"transliterationArr":["innā","balawnāhum","kamā","balawnā","aṣḥāba","al-janati","idh","aqsamū","layaṣrimunnahā","muṣ'biḥīna",null],"verseTiming":[[1,0,1510],[2,1510,2960],[3,2960,3570],[4,3570,5700],[5,5700,6630],[6,6630,8350],[7,8350,8710],[8,8710,9650],[9,9650,12160],[10,12160,15415]]}}