{"name":"68:42","price":"جس دن پنڈلی کھول دی جائے گی اور سجدے کے لیے بلائے جائیں گے تو (سجده) نہ کر سکیں گے.(1)","arabic":"يَوۡمَ يُكۡشَفُ عَن سَاقٖ وَيُدۡعَوۡنَ إِلَى ٱلسُّجُودِ فَلَا يَسۡتَطِيعُونَ","category":["68 (Al-Qalam)","Al-Qalam","Surah Al-Qalam","Chapter Al-Qalam","Qalam","Surah Qalam","Chapter Qalam","Al Qalam","Surah Al Qalam","Chapter Al Qalam","Surah 68","Chapter 68","The Pen","القلم"],"ayahNumber":5313,"juzNumber":29,"footnotes":"(1) بعض نے کشف ساق سے مراد قیامت کی ہولناکیاں لی ہیں لیکن ایک صحیح حدیث اس کی تفسیر اس طرح بیان ہوئی ہے کہ قیامت والے دن اللہ تعالٰی اپنی پنڈلی کھولے گا (جس طرح اس کی شان کے لائق ہے) تو ہر مومن مرد اور عورت اس کے سامنے سجدہ ریز ہو جائیں گے البتہ وہ لوگ باقی رہ جائیں گے جو دکھلاوے اور شہرت کے لئے سجدہ کرتے تھے وہ سجدہ کرنا چاہیں گے لیکن ان کی ریڑھ کی ہڈی کے منکے، تختے کی طرح ایک ہڈی بن جائیں گے جس کی وجہ سے ان کے لئے جھکنا ناممکن ہو جائے گا (صحیح بخاری) اللہ تعالٰی کی پنڈلی کس طرح کی ہوگی؟ اسے وہ کس طرح کھولے گا؟ اس کیفیت ہم نہ جان سکتے ہیں نہ بیان کر سکتے ہیں۔ اس لئے جس طرح ہم بلا کیف و بلاشبہ اس کی آنکھوں، کان، ہاتھ وغیرہ پر ایمان رکھتے ہیں، اسی طرح پنڈلی کا ذکر بھی قرآن اور حدیث میں ہے، اس پر بلاکیف ایمان رکھنا ضروری ہے۔ یہی سلف اور محدثین کا مسلک ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yawma yuk'shafu ʿan sāqin wayud'ʿawna ilā al-sujūdi falā yastaṭīʿūna ","translations":["(The) Day","will be uncovered","from","the shin","and they will be called","to","prostrate","but not","they will be able","(42)"],"transliterationArr":["yawma","yuk'shafu","ʿan","sāqin","wayud'ʿawna","ilā","al-sujūdi","falā","yastaṭīʿūna",null],"verseTiming":[[1,0,570],[2,570,1370],[3,1370,1950],[4,1950,3710],[5,3710,4810],[6,4810,5190],[7,5190,6220],[8,6220,6750],[9,6750,10415]]}}