{"name":"68:51","price":"اور قریب ہے کہ کافر اپنی تیز نگاہوں سے آپ کو پھسلا دیں(1) ، جب کبھی قرآن سنتے ہیں اور کہہ دیتے ہیں یہ تو ضرور دیوانہ ہے.(2)","arabic":"وَإِن يَكَادُ ٱلَّذِينَ كَفَرُواْ لَيُزۡلِقُونَكَ بِأَبۡصَٰرِهِمۡ لَمَّا سَمِعُواْ ٱلذِّكۡرَ وَيَقُولُونَ إِنَّهُۥ لَمَجۡنُونٞ","category":["68 (Al-Qalam)","Al-Qalam","Surah Al-Qalam","Chapter Al-Qalam","Qalam","Surah Qalam","Chapter Qalam","Al Qalam","Surah Al Qalam","Chapter Al Qalam","Surah 68","Chapter 68","The Pen","القلم"],"ayahNumber":5322,"juzNumber":29,"footnotes":"(1) یعنی اگر تجھے اللہ کی حمائت و حفاظت نہ ہوتی تو کفار کی حاسدانہ نظروں سے نظر بد کا شکار ہو جانا یعنی ان کی نظر تمہیں لگ جاتی۔ چنانچہ امام ابن کثیر نے یہ مفہوم بیان کیا، مذید لکھتے ہیں ' یہ اس بات کی دلیل ہے کہ نظر کا لگ جانا اور اس کا دوسروں پر، اللہ کے حکم سے، اثر انداز ہونا، حق ہے۔ جیسا کہ متعدد احادیث سے بھی ثابت ہے۔ چنانچہ حدیث میں اس سے بچنے کے لیے دعائیں بھی بیان کی گئی ہیں اور یہ بھی تاکید کی گئی ہے کہ جب تمہیں کوئی چیز اچھی لگے تو ماشاء اللہ یا بارک اللہ کہا کرو تاکہ اسے نظر نہ لگے۔اسی طرح کسی کو نظر لگ جائے رو فرمای ، اسے غسل کروا کے اس کا پانی اس شخص پر ڈالا جائے جس کو اس کی نظرلگی ہے(تفصیل کے لئے دیکھئے تفسیر ابن کثیر اور کتب حدیث)اس کا مطلب یہ بیا کیا ہے کہ یہ تجھے تبلیغرسالت سے پھیر دیتے۔\n(2) یعنی حسد کے طور پر بھی اور اس غرض سے بھی کہ لوگ اس قرآن سے متاثر نہ ہوں بلکہ اس سے دور ہی رہیں آنکھوں کے ذریعے سے بھی یہ کفار نبی کو نقصان پہنچانے کی کوشش کرتے اور زبانوں سے بھی آپ کو دیوانہ کہہ کر ایذاء پہنچاتے اور آپ کے دل کو مجروح کرتے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-in yakādu alladhīna kafarū layuz'liqūnaka bi-abṣārihim lammā samiʿū al-dhik'ra wayaqūlūna innahu lamajnūnun ","translations":["And indeed","would almost","those who","disbelieve","surely make you slip","with their look","when","they hear","the Message","and they say","Indeed, he","(is) surely mad","(51)"],"transliterationArr":["wa-in","yakādu","alladhīna","kafarū","layuz'liqūnaka","bi-abṣārihim","lammā","samiʿū","al-dhik'ra","wayaqūlūna","innahu","lamajnūnun",null],"verseTiming":[[1,0,1150],[2,1150,1890],[3,1890,2850],[4,2850,3710],[5,3710,5370],[6,5370,6970],[7,6970,8200],[8,8200,8870],[9,8870,9690],[10,9690,11000],[11,11000,12500],[12,12500,15915]]}}