{"name":"6:105","price":"اور ہم اس طور پر دﻻئل کو مختلف پہلوؤں سے بیان کرتے ہیں تاکہ یہ یوں کہیں کہ آپ نے کسی سے پڑھ لیا ہے(1) اور تاکہ ہم اس کو دانشمندوں کے لئے خوب ﻇاہر کردیں۔","arabic":"وَكَذَٰلِكَ نُصَرِّفُ ٱلۡأٓيَٰتِ وَلِيَقُولُواْ دَرَسۡتَ وَلِنُبَيِّنَهُۥ لِقَوۡمٖ يَعۡلَمُونَ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":894,"juzNumber":7,"footnotes":"(1) یعنی ہم توحید اور اس کے دلائل کو اس طرح کھول کھول کر اور مختلف انداز سے بیان کرتے ہیں کہ مشرکین یہ کہنے لگتے ہیں کہ محمد (صلى الله عليه وسلم) کہیں سے پڑھ کر اور سیکھ کر آیا ہے۔ جس طرح دوسرے مقام پر فرمایا: «وَقَالَ الَّذِينَ كَفَرُوا إِنْ هَذَا إِلا إِفْكٌ افْتَرَاهُ وَأَعَانَهُ عَلَيْهِ قَوْمٌ آخَرُونَ فَقَدْ جَاءُوا ظُلْمًا وَزُورًا، وَقَالُوا أَسَاطِيرُ الأَوَّلِينَ اكْتَتَبَهَا» (الفرقان: 4۔ 5) ”کافروں نے کہا، یہ قرآن تو اس کا اپنا گھڑا ہوا ہے، جس پر دوسروں نے بھی اس کی مدد کی ہے۔ یہ لوگ ایسا دعویٰ کرکے ظلم اور جھوٹ پر اتر آئے ہیں۔ نیز انہوں نے کہا کہ یہ پہلے لوگوں کی کہانیاں ہیں، جس کو اس نے لکھ رکھا ہے“۔ حالانکہ بات یہ نہیں ہے، جس طرح یہ سمجھتے یا دعویٰ کرتے ہیں بلکہ مقصد اس تفصیل سے سمجھ دار لوگوں کے لئے تبیین وتشریح ہے تاکہ ان پر حجت پوری ہوجائے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wakadhālika nuṣarrifu al-āyāti waliyaqūlū darasta walinubayyinahu liqawmin yaʿlamūna ","translations":["And thus","We explain","the Signs","that they (may) say","You have studied","and that We (may) make it clear","for a people","who know","(105)"],"transliterationArr":["wakadhālika","nuṣarrifu","al-āyāti","waliyaqūlū","darasta","walinubayyinahu","liqawmin","yaʿlamūna",null],"verseTiming":[[1,0,1430],[2,1430,2470],[3,2470,3810],[4,3810,5290],[5,5290,6210],[6,6210,8040],[7,8040,9730],[8,9730,13455]]}}