{"name":"6:103","price":"اس کو تو کسی کی نگاه محیط نہیں ہوسکتی(1) اور وه سب نگاہوں کو محیط ہو جاتا ہے اور وہی بڑا باریک بین باخبر ہے۔","arabic":"لَّا تُدۡرِكُهُ ٱلۡأَبۡصَٰرُ وَهُوَ يُدۡرِكُ ٱلۡأَبۡصَٰرَۖ وَهُوَ ٱللَّطِيفُ ٱلۡخَبِيرُ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":892,"juzNumber":7,"footnotes":"(1) أَبْصَارٌ بَصَرَةٌ (نگاہ) کی جمع ہے یعنی انسان کی آنکھیں اللہ کی حقیقت کی کنہ تک نہیں پہنچ سکتیں۔ اور اگر اس سے مراد رؤیت بصری ہو تو اس کا تعلق دنیا سے ہوگا یعنی دنیا کی آنکھ سے کوئی اللہ کو نہیں دیکھ سکتا۔ تاہم یہ صحیح اور متواتر روایات سے ثابت ہے کہ قیامت والے دن اہل ایمان اللہ تعالیٰ کو دیکھیں گے اور جنت میں بھی اس کے دیدار سے مشرف ہوں گے۔ اس لئے معتزلہ کا اس آیت سے استدلال کرتے ہوئے یہ کہنا کہ اللہ تعالیٰ کو کوئی بھی نہیں دیکھ سکتا، دنیا میں نہ آخرت میں، صحیح نہیں، کیونکہ اس نفی کا تعلق صرف دنیا سے ہے۔ اسی لئے حضرت عائشہ (رضی الله عنها) بھی اس آیت سے استدلال کرتے ہوئے فرماتی تھیں، ”جس شخص نے بھی دعویٰ کیا کہ نبی (صلى الله عليه وسلم) نے (شب معراﺝ میں) اللہ تعالیٰ کی زیارت کی ہے، اس نے قطعاً جھوٹ بولا ہے“۔ (صحيح بخاري، تفسير سورة الأنعام) کیونکہ اس آیت کی رو سے پیغمبر سمیت کوئی بھی اللہ کو دیکھنے پر قادر نہیں ہے۔ البتہ آخرت کی زندگی میں یہ دیدار ممکن ہوگا۔ جیسے دوسرے مقام پر قرآن نے اس کا اثبات فرمایا۔ «وُجُوهٌ يَوْمَئِذٍ نَاضِرَةٌ، إِلَى رَبِّهَا نَاظِرَةٌ» (القيامة) ”کئی چہرے اس دن تروتازہ ہوں گے، اپنے رب کی طرف دیکھ رہے ہوں گے۔“","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"lā tud'rikuhu al-abṣāru wahuwa yud'riku al-abṣāra wahuwa al-laṭīfu al-khabīru ","translations":["Not (can)","grasp Him","the visions","but He","(can) grasp","(all) the vision","and He (is)","the All-Subtle","the All-Aware","(103)"],"transliterationArr":["lā","tud'rikuhu","al-abṣāru","wahuwa","yud'riku","al-abṣāra","wahuwa","al-laṭīfu","al-khabīru",null],"verseTiming":[[1,0,480],[2,480,1480],[3,1480,2830],[4,2830,3270],[5,3270,4180],[6,4180,5520],[7,5520,5980],[8,5980,7090],[9,7090,10445]]}}