{"name":"6:116","price":"اور دنیا میں زیاده لوگ ایسے ہیں کہ اگر آپ ان کا کہنا ماننے لگیں تو وه آپ کو اللہ کی راه سے بے راه کردیں وه محض بے اصل خیاﻻت پر چلتے ہیں اور بالکل قیاسی باتیں کرتے ہیں۔(1)","arabic":"وَإِن تُطِعۡ أَكۡثَرَ مَن فِي ٱلۡأَرۡضِ يُضِلُّوكَ عَن سَبِيلِ ٱللَّهِۚ إِن يَتَّبِعُونَ إِلَّا ٱلظَّنَّ وَإِنۡ هُمۡ إِلَّا يَخۡرُصُونَ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":905,"juzNumber":8,"footnotes":"(1) قرآن کی اس بیان کردہ حقیقت کا بھی، واقعے کے طور پر ہر دور میں مشاہدہ کیا جاسکتا ہے۔ دوسرے مقام پر اللہ تعالیٰ نے فرمایا «وَمَا أَكْثَرُ النَّاسِ وَلَوْ حَرَصْتَ بِمُؤْمِنِينَ» (سورۃ یوسف: 103) ”آپ کی خواہش کے باوجود اکثر لوگ ایمان لانے والے نہیں“۔ اس سے معلوم ہوا کہ حق وصداقت کے راستے پر چلنے والے لوگ ہمیشہ تھوڑے ہی ہوتے ہیں۔ جس سے یہ بات بھی ثابت ہوئی کہ حق وباطل کا معیار، دلائل وبراہین ہیں، لوگوں کی اکثریت واقلیت نہیں۔ یعنی ایسا نہیں ہے کہ جس بات کو اکثریت نے اختیار کیا ہوا ہو، وہ حق ہو اور اقلیت میں رہنے والے باطل پر ہوں۔ بلکہ مذکورہ حقیقت قرآنی کی رو سے یہ زیادہ ممکن ہے کہ اہل حق تعداد کے لحاظ سے اقلیت میں ہوں اور اہل باطل اکثریت میں۔ جس کی تائید اس حدیث سے بھی ہوتی ہے جس میں نبی (صلى الله عليه وسلم) نے فرمایا ہے کہ ”میری امت 73 فرقوں میں بٹ جائے گی، جن میں سے صرف ایک فرقہ جنتی ہوگا، باقی سب جہنمی۔ اور اس جنتی فرقے کی نشانی آپ (صلى الله عليه وسلم) نے یہ بیان فرمائی کہ جو«مَا أَنَا عَلَيْهِ وَأَصْحَابِي» میرے اور میرے صحابہ کے طریقے پر چلنے والا ہوگا“ (أبو داود كتاب السنة، باب شرح السنة، نمبر 4596، ترمذي، كتاب الإيمان، باب ما جاء في افتراق هذه الأمة، وقد حسنه الترمذي في بعض النسخ وأقره الألباني في الطحاوية، حديث نمبر263)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-in tuṭiʿ akthara man fī al-arḍi yuḍillūka ʿan sabīli al-lahi in yattabiʿūna illā al-ẓana wa-in hum illā yakhruṣūna ","translations":["And if","you obey","most","of","(those) in","the earth","they will mislead you","from","(the) way","(of) Allah","Not","they follow","except","[the] assumption","and not","they (do)","except","guess","(116)"],"transliterationArr":["wa-in","tuṭiʿ","akthara","man","fī","al-arḍi","yuḍillūka","ʿan","sabīli","al-lahi","in","yattabiʿūna","illā","al-ẓana","wa-in","hum","illā","yakhruṣūna",null],"verseTiming":[[1,0,1180],[2,1180,2060],[3,2060,3030],[4,3030,4170],[5,4170,4430],[6,4430,5270],[7,5270,6470],[8,6470,7780],[9,7780,8940],[10,8940,11230],[11,11230,12360],[12,12360,13680],[13,13680,14310],[14,14310,16060],[15,16060,16600],[16,16600,16990],[17,16990,17830],[18,17830,20925]]}}