{"name":"6:111","price":"اور اگر ہم ان کے پاس فرشتوں کو بھیج دیتے(1) اور ان سے مردے باتیں کرنے لگتے(2) اور ہم تمام موجودات کو ان کے پاس ان کی آنکھوں کے روبرو ﻻ کر جمع کر دیتے ہیں(3) تب بھی یہ لوگ ہرگز ایمان نہ ﻻتے ہاں اگر اللہ ہی چاہے تو اور بات ہے لیکن ان میں زیاده لوگ جہالت کی باتیں کرتے ہیں۔(4)","arabic":"۞ وَلَوۡ أَنَّنَا نَزَّلۡنَآ إِلَيۡهِمُ ٱلۡمَلَٰٓئِكَةَ وَكَلَّمَهُمُ ٱلۡمَوۡتَىٰ وَحَشَرۡنَا عَلَيۡهِمۡ كُلَّ شَيۡءٖ قُبُلٗا مَّا كَانُواْ لِيُؤۡمِنُوٓاْ إِلَّآ أَن يَشَآءَ ٱللَّهُ وَلَٰكِنَّ أَكۡثَرَهُمۡ يَجۡهَلُونَ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":900,"juzNumber":8,"footnotes":"(1) جیسا کہ وہ بار بار اس کا مطالبہ ہمارے پیغمبر سے کرتے ہیں۔\n(2) اور وہ حضرت محمد رسول اللہ (صلى الله عليه وسلم) کی رسالت کی تصدیق کردیتے۔\n(3) دوسرا مفہوم اس کا یہ بیان کیا گیا ہے کہ جو نشانیاں وہ طلب کرتے ہیں، وہ سب ان کے روبرو پیش کردیتے۔ اور ایک مفہوم یہ بھی بیان کیا گیا ہے کہ ہر چیز جمع ہوکر گروہ در گروہ یہ گواہی دے کہ پیغمبروں کا سلسلہ برحق ہے تو ان تمام نشانیوں اور مطالبوں کے پورا کردینے کے باوجود یہ ایمان لانے والے نہیں ہیں۔ مگر جس کو اللہ چاہے۔ اسی مفہوم کی یہ آیت بھی ہے«إِنَّ الَّذِينَ حَقَّتْ عَلَيْهِمْ كَلِمَةُ رَبِّكَ لا يُؤْمِنُونَ، وَلَوْ جَاءَتْهُمْ كُلُّ آيَةٍ حَتَّى يَرَوُا الْعَذَابَ الأَلِيمَ» (سورۃ یونس: 96۔ 97) ”جن پر تیرے رب کی بات ثابت ہوگئی ہے وہ ایمان نہیں لائیں گے، اگرچہ ان کے پاس ہر قسم کی نشانی آجائے یہاں تک کہ وہ دردناک عذاب دیکھ لیں“۔\n(4) اور یہ جہالت کی باتیں ہی ان کے اور حق قبول کرنے کے درمیان حائل ہیں۔ اگر جہالت کا پردہ اٹھ جائے تو شاید حق ان کی سمجھ میں آجائے اور پھر اللہ کی مشیت سے حق کو اپنا بھی لیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walaw annanā nazzalnā ilayhimu al-malāikata wakallamahumu al-mawtā waḥasharnā ʿalayhim kulla shayin qubulan mā kānū liyu'minū illā an yashāa al-lahu walākinna aktharahum yajhalūna ","translations":["And (even) if","[that] We (had)","[We] sent down","to them","the Angels","and spoken to them","the dead","and We gathered","before them","every","thing","face to face","not","they were","to believe","unless","[that]","wills","Allah","But","most of them","(are) ignorant","(111)"],"transliterationArr":["walaw","annanā","nazzalnā","ilayhimu","al-malāikata","wakallamahumu","al-mawtā","waḥasharnā","ʿalayhim","kulla","shayin","qubulan","mā","kānū","liyu'minū","illā","an","yashāa","al-lahu","walākinna","aktharahum","yajhalūna",null],"verseTiming":[[1,0,1140],[2,1140,2980],[3,2980,4600],[4,4600,6080],[5,6080,9870],[6,9870,11220],[7,11220,12220],[8,12220,13390],[9,13390,15100],[10,15100,16290],[11,16290,17270],[12,17270,17810],[13,17810,19540],[14,19540,20150],[15,20150,21540],[16,21540,22370],[17,22370,25220],[18,25220,26060],[19,26060,26890],[20,26890,27250],[21,27250,28130],[22,28130,30660],[23,30660,32970],[24,32970,33300],[25,33300,36630],[26,36630,37670],[27,37670,39370],[28,39370,40560],[29,40560,43475]]}}