{"name":"6:112","price":"اور اسی طرح ہم نے ہر نبی کے دشمن بہت سے شیطان پیدا کئے تھے کچھ آدمی اور کچھ جن(1) ، جن میں سے بعض بعضوں کو چکنی چپڑی باتوں کا وسوسہ ڈالتے رہتے تھے تاکہ ان کو دھوکہ میں ڈال دیں(2) اور اگر اللہ تعالیٰ چاہتا تو یہ ایسے کام نہ کرسکتے(3) سو ان لوگوں کو اور جو کچھ یہ افترا پردازی کر رہے ہیں اس کو آپ رہنے دیجئے۔","arabic":"وَكَذَٰلِكَ جَعَلۡنَا لِكُلِّ نَبِيٍّ عَدُوّٗا شَيَٰطِينَ ٱلۡإِنسِ وَٱلۡجِنِّ يُوحِي بَعۡضُهُمۡ إِلَىٰ بَعۡضٖ زُخۡرُفَ ٱلۡقَوۡلِ غُرُورٗاۚ وَلَوۡ شَآءَ رَبُّكَ مَا فَعَلُوهُۖ فَذَرۡهُمۡ وَمَا يَفۡتَرُونَ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":901,"juzNumber":8,"footnotes":"(1) یہ وہی بات ہے جو مختلف انداز میں رسول اللہ (صلى الله عليه وسلم) کی تسلی کے لیے فرمائی گئی ہے کہ آپ سے پہلے جتنے بھی انبیا گزرے، ان کی تکذیب کی گئی، انہیں ایذائیں دی گئیں وغیرہ وغیرہ۔ مقصد یہ ہے کہ جس طرح انہوں نے صبر اور حوصلے سے کام لیا، آپ بھی ان دشمنان حق کے مقابلے میں صبرواستقامت کا مظاہرہ فرمائیں۔ اس سے یہ بھی معلوم ہوا کہ شیطان کے پیروکار جنوں میں سے بھی ہیں اور انسانوں میں سے بھی۔ اور یہ وہ ہیں جو دونوں گروہوں میں سے سرکش، باغی، اور متکبر قسم کے ہیں۔\n(2) وَحْيٌ خفیہ بات کو کہتے ہیں یعنی انسانوں اور جنوں کو گمراہ کرنے کے لیے ایک دوسرے کو چالبازیاں اور حیلے سکھاتے ہیں تاکہ لوگوں کو دھوکے اور فریب میں مبتلا کرسکیں۔ یہ بات عام مشاہدے میں بھی آئی ہے کہ شیطانی کاموں میں لوگ ایک دوسرے کے ساتھ خوب بڑھ چڑھ کر تعاون کرتے ہیں جس کی وجہ سے برائی بہت جلدی فروغ پاجاتی ہے۔\n(3) یعنی اللہ تعالیٰ تو ان شیطانی ہتھکنڈوں کو ناکام بنانے پر قادر ہے لیکن وہ بالجبر ایسا نہیں کرے گا کیونکہ ایسا کرنا اس کے نظام اور اصول کے خلاف ہے جو اس نے اپنی مشیت کے تحت اختیار کیا ہے، جس کی حکمتیں وہ بہتر جانتا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wakadhālika jaʿalnā likulli nabiyyin ʿaduwwan shayāṭīna al-insi wal-jini yūḥī baʿḍuhum ilā baʿḍin zukh'rufa al-qawli ghurūran walaw shāa rabbuka mā faʿalūhu fadharhum wamā yaftarūna ","translations":["And thus","We made","for every","Prophet","an enemy ","devils","(from) the mankind","and the jinn","inspiring","some of them","to","others","(with) decorative","[the] speech","(in) deception","But if","(had) willed","your Lord","not","they (would) have done it","so leave them","and what","they invent","(112)"],"transliterationArr":["wakadhālika","jaʿalnā","likulli","nabiyyin","ʿaduwwan","shayāṭīna","al-insi","wal-jini","yūḥī","baʿḍuhum","ilā","baʿḍin","zukh'rufa","al-qawli","ghurūran","walaw","shāa","rabbuka","mā","faʿalūhu","fadharhum","wamā","yaftarūna",null],"verseTiming":[[1,0,1410],[2,1410,2440],[3,2440,3280],[4,3280,4170],[5,4170,5990],[6,5990,7330],[7,7330,9010],[8,9010,10690],[9,10690,11550],[10,11550,13200],[11,13200,14300],[12,14300,15340],[13,15340,15910],[14,15910,17210],[15,17210,18540],[16,18540,19370],[17,19370,20940],[18,20940,21500],[19,21500,23790],[20,23790,24590],[21,24590,24940],[22,24940,27620],[23,27620,28690],[24,28690,29270],[25,29270,32095]]}}