{"name":"6:115","price":"آپ کے رب کا کلام سچائی اور انصاف کے اعتبار سے کامل ہے(1) ، اس کے کلام کا کوئی بدلنے واﻻ نہیں(2) اور وه خوب سننے واﻻ خوب جاننے واﻻ ہے۔(3)","arabic":"وَتَمَّتۡ كَلِمَتُ رَبِّكَ صِدۡقٗا وَعَدۡلٗاۚ لَّا مُبَدِّلَ لِكَلِمَٰتِهِۦۚ وَهُوَ ٱلسَّمِيعُ ٱلۡعَلِيمُ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":904,"juzNumber":8,"footnotes":"(1) اخبار و واقعات کے لحاظ سے سچا ہے اور احکام ومسائل کے اعتبار سے عادل ہے یعنی اس کا ہر امر اور نہی عدل وانصاف پر مبنی ہے۔ کیونکہ اس نے انہی باتوں کا حکم دیا ہے جن میں انسانوں کا فائدہ ہے اور انہی چیزوں سے روکا ہے جن میں نقصان اور فساد ہے۔ گو انسان اپنی نادانی یا اغوائے شیطانی کی وجہ سے اس حقیقت کو نہ سمجھ سکیں۔\n(2) یعنی کوئی ایسا نہیں جو رب کے کسی حکم میں تبدیلی کردے، کیونکہ اس سے بڑھ کر کوئی طاقتور نہیں۔\n(3) یعنی بندوں کے اقوال سننے والا اور ان کی ایک ایک حرکت و ادا کو جاننے والا ہے اور وہ اس کے مطابق ہر ایک کوجزا دے گا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"watammat kalimatu rabbika ṣid'qan waʿadlan lā mubaddila likalimātihi wahuwa al-samīʿu al-ʿalīmu ","translations":["And (has been) fulfilled","(the) word","(of) your Lord","(in) truth","and justice","No","one can change","His words","and He","(is) the All-Hearer","the All-Knower","(115)"],"transliterationArr":["watammat","kalimatu","rabbika","ṣid'qan","waʿadlan","lā","mubaddila","likalimātihi","wahuwa","al-samīʿu","al-ʿalīmu",null],"verseTiming":[[1,0,1950],[2,1950,2770],[3,2770,3580],[4,3580,5260],[5,5260,6320],[6,6320,7240],[7,7240,8280],[8,8280,10160],[9,10160,10730],[10,10730,11880],[11,11880,14375]]}}