{"name":"6:118","price":"سو جس جانور پر اللہ تعالیٰ کا نام لیا جائے اس میں سے کھاؤ! اگر تم اس کے احکام پر ایمان رکھتے ہو۔(1)","arabic":"فَكُلُواْ مِمَّا ذُكِرَ ٱسۡمُ ٱللَّهِ عَلَيۡهِ إِن كُنتُم بِـَٔايَٰتِهِۦ مُؤۡمِنِينَ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":907,"juzNumber":8,"footnotes":"(1) یعنی جس جانور پر شکار کرتے وقت یا ذبح یا نحر کرتے وقت اللہ کا نام لیا جائے، اسے کھالو بشرطیکہ وہ ان جانوروں میں سے ہوں جن کا کھانا مباح ہے۔ اس کا مطلب یہ ہوا کہ جس جانور پر عمداً ان موقعوں پر اللہ کا نام نہ لیا جائے وہ حلال وطیب نہیں البتہ اس سے ایسی صورت مستثنیٰ ہے کہ جس میں یہ التباس ہو کہ ذبح کے وقت ذبح کرنے والے نے اللہ کا نام لیا یا نہیں، اس میں حکم یہ ہے کہ اللہ کا نام لے کر اسے کھالو۔ حدیث میں آتا ہے کہ حضرت عائشہ (رضی الله عنها) نے رسول اللہ (صلى الله عليه وسلم) سے پوچھا کہ کچھ لوگ ہمارے پاس گوشت لے کر آتے ہیں (اس سے مراد وہ اعرابی تھے جو نئے نئے مسلمان ہوئے تھے اور اسلامی تعلیم وتربیت سے پوری طرح بہرہ ور بھی نہیں تھے) ہم نہیں جانتے کہ انہوں نے اللہ کا نام لیا یا نہیں ؟ آپ (صلى الله عليه وسلم) نے فرمایا«سَمُّوا عَلَيْهِ أَنْتُمْ وَكُلُوا»(صحيح بخاري- باب ذبيحة الأعراب نمبر5507) تم اللہ کا نام لے کر اسے کھالو یعنی التباس (شبہ) کی صورت میں یہ رخصت ہے۔ اس کا مطلب یہ نہیں کہ ہر قسم کے جانور کا گوشت بسم اللہ پڑھ لینے سے حلال ہوجائے گا۔ اس سے زیادہ سے زیادہ یہ ثابت ہوتا ہے کہ مسلمانوں کی منڈیوں اور دکانوں پر ملنے والا گوشت حلال ہے۔ ہاں اگر کسی کو وہم اور التباس ہو تو وہ کھاتے وقت بسم اللہ پڑھ لے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"fakulū mimmā dhukira us'mu al-lahi ʿalayhi in kuntum biāyātihi mu'minīna ","translations":["So eat","of what","(is) mentioned","(the) name","(of) Allah","on it","if","you are","in His Verses ","believers","(118)"],"transliterationArr":["fakulū","mimmā","dhukira","us'mu","al-lahi","ʿalayhi","in","kuntum","biāyātihi","mu'minīna",null],"verseTiming":[[1,0,880],[2,880,2620],[3,2620,3180],[4,3180,3530],[5,3530,4520],[6,4520,5340],[7,5340,6550],[8,6550,8790],[9,8790,10570],[10,10570,13635]]}}