{"name":"6:121","price":"اور ایسے جانوروں میں سے مت کھاؤ جن پر اللہ کا نام نہ لیا گیا ہو اور یہ کام نافرمانی کا ہے(1) اور یقیناً شیاطین اپنے دوستوں کے دل میں ڈالتے ہیں تاکہ یہ تم سے جدال کریں(2) اور اگر تم ان لوگوں کی اطاعت کرنے لگو تو یقیناً تم مشرک ہوجاؤ گے۔","arabic":"وَلَا تَأۡكُلُواْ مِمَّا لَمۡ يُذۡكَرِ ٱسۡمُ ٱللَّهِ عَلَيۡهِ وَإِنَّهُۥ لَفِسۡقٞۗ وَإِنَّ ٱلشَّيَٰطِينَ لَيُوحُونَ إِلَىٰٓ أَوۡلِيَآئِهِمۡ لِيُجَٰدِلُوكُمۡۖ وَإِنۡ أَطَعۡتُمُوهُمۡ إِنَّكُمۡ لَمُشۡرِكُونَ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":910,"juzNumber":8,"footnotes":"(1) یعنی عمداً اللہ کا نام جس جانور پر نہ لیا گیا، اس کا کھانا فسق اور ناجائز ہے۔ حضرت ابن عباس (رضي الله عنه) نے اس کے یہی معنی بیان کئے ہیں وہ کہتے ہیں کہ بھول جانے والے کو فاسق نہیں کہا جاتا اور امام بخاری کا رجحان بھی یہی ہے اور یہی احناف کا مسلک ہے تاہم امام شافعی کامسلک یہ ہے کہ مسلمان کا ذبیحہ دونوں صورتوں میں حلال ہے چاہے وہ اللہ کا نام لے یا عمداً چھوڑ دے اور وہ ”وَإِنَّهُ لَفِسْقٌ“ کو غیر اللہ کے نام پر ذبح کئے گئے جانور سے متعلق قرار دیتے ہیں۔\n(2) شیطان نے اپنے ساتھیوں کے ذریعے سے یہ بات پھیلائی کہ یہ مسلمان اللہ کے ذبح کئے ہوئے جانور (یعنی مردہ) کو تو حرام اور اپنے ہاتھ سے ذبح شدہ کو حلال قرار دیتے ہیں اور دعویٰ یہ کرتے ہیں کہ ہم اللہ کو ماننے والے ہیں۔ اللہ تعالیٰ نے فرمایا کہ شیطان اور اس کے دوستوں کے وسوسوں کے پیچھے مت لگو، جو جانور مردہ ہے یعنی بغیر ذبح کئے مر گیا (سوائے سمندری میتہ کے کہ وہ حلال ہے) اس پر چونکہ اللہ کا نام نہیں لیا گیا، اس لئے اس کا کھانا حلال نہیں ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walā takulū mimmā lam yudh'kari us'mu al-lahi ʿalayhi wa-innahu lafis'qun wa-inna al-shayāṭīna layūḥūna ilā awliyāihim liyujādilūkum wa-in aṭaʿtumūhum innakum lamush'rikūna ","translations":["And (do) not","eat","of that","not","has been mentioned","(the) name","(of) Allah","on it","and indeed, it (is)","grave disobedience","And indeed","the devils","inspire","to","their friends","so that they dispute with you","and if","you obey them","indeed, you","(would) be the polytheists","(121)"],"transliterationArr":["walā","takulū","mimmā","lam","yudh'kari","us'mu","al-lahi","ʿalayhi","wa-innahu","lafis'qun","wa-inna","al-shayāṭīna","layūḥūna","ilā","awliyāihim","liyujādilūkum","wa-in","aṭaʿtumūhum","innakum","lamush'rikūna",null],"verseTiming":[[1,0,670],[2,670,1740],[3,1740,3330],[4,3330,3670],[5,3670,4490],[6,4490,4880],[7,4880,5780],[8,5780,6630],[9,6630,8470],[10,8470,9940],[11,9940,11500],[12,11500,13130],[13,13130,14310],[14,14310,16629],[15,16629,19579],[16,19579,22059],[17,22059,22659],[18,22659,24359],[19,24359,26269],[20,26269,30274]]}}