{"name":"6:12","price":"آپ کہئے کہ جو کچھ آسمانوں اور زمین میں موجود ہے یہ سب کس کی ملکیت ہے، آپ کہہ دیجئے کہ سب اللہ ہی کی ملکیت ہے، اللہ نے مہربانی فرمانا اپنے اوپر ﻻزم فرما لیا ہے(1) تم کو اللہ قیامت کے روز جمع کرے گا، اس میں کوئی شک نہیں، جن لوگوں نے اپنے آپ کو گھاٹے میں ڈاﻻ ہے سو وه ایمان نہیں ﻻئیں گے۔","arabic":"قُل لِّمَن مَّا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ قُل لِّلَّهِۚ كَتَبَ عَلَىٰ نَفۡسِهِ ٱلرَّحۡمَةَۚ لَيَجۡمَعَنَّكُمۡ إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِ لَا رَيۡبَ فِيهِۚ ٱلَّذِينَ خَسِرُوٓاْ أَنفُسَهُمۡ فَهُمۡ لَا يُؤۡمِنُونَ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":801,"juzNumber":7,"footnotes":"(1) جس طرح حدیث میں نبی (صلى الله عليه وسلم) نے فرمایا ”جب اللہ تعالیٰ نے مخلوق کو پیدا فرمایا تو عرش پر یہ لکھ دیا «إِنَّ رَحْمَتِي تَغْلِبُ غَضَبِي» یقیناً میری رحمت میرے غضب پر غالب ہے“۔ (صحيح بخاري، كتاب التوحيد، وبدء الخلق، مسلم كتاب التوبة)، لیکن یہ رحمت قیامت والے دن صرف اہل ایمان کے لئے ہوگی، کافروں کے لئے رب سخت غضب ناک ہوگا مطلب یہ ہے کہ دنیا میں تو اس کی رحمت یقیناً عام ہے، جس سے مومن اور کافر نیک اور بد، فرماں برداراور نافرمان سب ہی فیض یاب ہو رہے ہیں۔ اللہ تعالیٰ کسی شخص کی بھی روزی نافرمانی کرنے کی وجہ سے بند نہیں کرتا، لیکن اس کی رحمت کا یہ عموم صرف دنیا کی حد تک ہے۔ آخرت میں جو کہ دارالجزا ہے، وہاں اللہ کی صفت عدل کا کامل ظہور ہوگا، جس کے نتیجے میں اہل ایمان امان رحمت میں جگہ پائیں گے اور اہل کفر وفسق جہنم کے دائمی عذاب کے مستحق ٹھہریں گے۔ اسی لئے قرآن میں فرمایا گیا ہے «وَرَحْمَتِي وَسِعَتْ كُلَّ شَيْءٍ فَسَأَكْتُبُهَا لِلَّذِينَ يَتَّقُونَ وَيُؤْتُونَ الزَّكَاةَ وَالَّذِينَ هُمْ بِآيَاتِنَا يُؤْمِنُونَ» (الأعراف: 156) ”اور میری رحمت تمام اشیا پر محیط ہے»۔ تو وہ رحمت ان لوگوں کے نام ضرور لکھوں گا جو اللہ سے ڈرتے ہیں اور زکٰوۃ دیتے ہیں اور جو ہماری آیتوں پر ایمان لاتے ہیں“۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qul liman mā fī al-samāwāti wal-arḍi qul lillahi kataba ʿalā nafsihi al-raḥmata layajmaʿannakum ilā yawmi al-qiyāmati lā rayba fīhi alladhīna khasirū anfusahum fahum lā yu'minūna ","translations":["Say","To whom (belongs)","what","(is) in","the heavens","and the earth","Say","To Allah","He has decreed","upon","Himself","the Mercy","Surely He will assemble you","on","(the) Day","(of) the Resurrection","(there is) no","doubt","about it","Those who","have lost","themselves","then they","(do) not","believe","(12)"],"transliterationArr":["qul","liman","mā","fī","al-samāwāti","wal-arḍi","qul","lillahi","kataba","ʿalā","nafsihi","al-raḥmata","layajmaʿannakum","ilā","yawmi","al-qiyāmati","lā","rayba","fīhi","alladhīna","khasirū","anfusahum","fahum","lā","yu'minūna",null],"verseTiming":[[1,0,430],[2,430,930],[3,930,2030],[4,2030,2250],[5,2250,3760],[6,3760,4810],[7,4810,5070],[8,5070,8260],[9,8260,8840],[10,8840,9490],[11,9490,10240],[12,10240,11650],[13,11650,13950],[14,13950,14560],[15,14560,15170],[16,15170,16520],[17,16520,16830],[18,16830,17500],[19,17500,19940],[20,19940,21150],[21,21150,23500],[22,23500,25230],[23,25230,25850],[24,25850,26140],[25,26140,28985]]}}