{"name":"6:122","price":"ایسا شخص جو پہلے مرده تھا پھر ہم نے اس کو زنده کردیا اور ہم نے اس کو ایک ایسا نور دے دیا کہ وه اس کو لئے ہوئے آدمیوں میں چلتا پھرتا ہے۔ کیا ایسا شخص اس شخص کی طرح ہوسکتا ہے؟ جو تاریکیوں سے نکل ہی نہیں پاتا(1) ۔ اسی طرح کافروں کو ان کے اعمال خوش نما معلوم ہوا کرتے ہیں۔","arabic":"أَوَمَن كَانَ مَيۡتٗا فَأَحۡيَيۡنَٰهُ وَجَعَلۡنَا لَهُۥ نُورٗا يَمۡشِي بِهِۦ فِي ٱلنَّاسِ كَمَن مَّثَلُهُۥ فِي ٱلظُّلُمَٰتِ لَيۡسَ بِخَارِجٖ مِّنۡهَاۚ كَذَٰلِكَ زُيِّنَ لِلۡكَٰفِرِينَ مَا كَانُواْ يَعۡمَلُونَ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":911,"juzNumber":8,"footnotes":"(1) اس آیت میں اللہ تعالیٰ نے کافر کو میت (مردہ) اور مومن کو حی (زندہ) قرار دیا ہے۔ اس لئے کہ کافر کفر وضلالت کی تاریکیوں میں بھٹکتا پھرتا ہے اور اس سے نکل ہی نہیں پاتا جس کانتیجہ ہلاکت وبربادی ہے اور مومن کے دل کو اللہ تعالیٰ ایمان کے ذریعے سے زندہ فرما دیتا ہے جس سے زندگی کی راہیں اس کے لئے روشن ہوجاتی ہیں اور وہ ایمان و ہدایت کے راستے پر گامزن ہوجاتا ہے، جس کا نتیجہ کامیابی وکامرانی ہے۔ یہ وہی مضمون ہے جو حسب ذیل آیات میں بیان کیا گیا ہے۔ «اللَّهُ وَلِيُّ الَّذِينَ آمَنُوا يُخْرِجُهُمْ مِنَ الظُّلُمَاتِ إِلَى النُّورِ وَالَّذِينَ كَفَرُوا أَوْلِيَاؤُهُمُ الطَّاغُوتُ يُخْرِجُونَهُمْ مِنَ النُّورِ إِلَى الظُّلُمَاتِ» (سورة البقرة: 257)،«مَثَلُ الْفَرِيقَيْنِ كَالأَعْمَى وَالأَصَمِّ وَالْبَصِيرِ وَالسَّمِيعِ هَلْ يَسْتَوِيَانِ مَثَلا» (سورة هود:24) اور «وَمَا يَسْتَوِي الأَعْمَى وَالْبَصِيرُ، وَلا الظُّلُمَاتُ وَلا النُّورُ، وَلا الظِّلُّ وَلا الْحَرُورُ، وَمَا يَسْتَوِي الأَحْيَاءُ وَلا الأَمْوَاتُ» (سورة فاطر: 19۔ 22)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"awaman kāna maytan fa-aḥyaynāhu wajaʿalnā lahu nūran yamshī bihi fī al-nāsi kaman mathaluhu fī al-ẓulumāti laysa bikhārijin min'hā kadhālika zuyyina lil'kāfirīna mā kānū yaʿmalūna ","translations":["Is (one) who","was","dead","and We gave him life","and We made","for him","light","he walks","whereby","among","the people","like (one) who","[similar to him]","(is) in","the darknesses","not","he comes out","of it","Thus","is made fair-seeming","to the disbelievers","what","they were","doing","(122)"],"transliterationArr":["awaman","kāna","maytan","fa-aḥyaynāhu","wajaʿalnā","lahu","nūran","yamshī","bihi","fī","al-nāsi","kaman","mathaluhu","fī","al-ẓulumāti","laysa","bikhārijin","min'hā","kadhālika","zuyyina","lil'kāfirīna","mā","kānū","yaʿmalūna",null],"verseTiming":[[1,0,850],[2,850,1540],[3,1540,3060],[4,3060,4850],[5,4850,6140],[6,6140,6750],[7,6750,7460],[8,7460,8440],[9,8440,9200],[10,9200,9820],[11,9820,10100],[12,10100,11580],[13,11580,12040],[14,12040,13550],[15,13550,14800],[16,14800,16420],[17,16420,16670],[18,16670,18000],[19,18000,18560],[20,18560,19660],[21,19660,21560],[22,21560,23100],[23,23100,23880],[24,23880,25600],[25,25600,25940],[26,25940,26820],[27,26820,30215]]}}