{"name":"6:143","price":"(پیدا کیے) آٹھ نر و ماده(1) یعنی بھیڑ میں دو قسم اور بکری میں دو قسم(2) آپ کہیے کہ کیا اللہ نے ان دونوں نروں کو حرام کیا ہے یا دونوں ماده کو؟ یا اس کو جس کو دونوں ماده پیٹ میں لئے ہوئے ہوں؟(3) تم مجھ کو کسی دلیل سے تو بتاؤ اگر سچے ہو۔(4)","arabic":"ثَمَٰنِيَةَ أَزۡوَٰجٖۖ مِّنَ ٱلضَّأۡنِ ٱثۡنَيۡنِ وَمِنَ ٱلۡمَعۡزِ ٱثۡنَيۡنِۗ قُلۡ ءَآلذَّكَرَيۡنِ حَرَّمَ أَمِ ٱلۡأُنثَيَيۡنِ أَمَّا ٱشۡتَمَلَتۡ عَلَيۡهِ أَرۡحَامُ ٱلۡأُنثَيَيۡنِۖ نَبِّـُٔونِي بِعِلۡمٍ إِن كُنتُمۡ صَٰدِقِينَ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":932,"juzNumber":8,"footnotes":"(1) یعنی أَنْشَأَ ثَمَانِيَةَ أَزْوَاجٍ (اسی اللہ نے آٹھ زوﺝ پیدا کئے ) أَزْوَاجٌ، زَوْجٌ کی جمع ہے۔ ایک ہی جنس کے نر اور مادہ کو زوﺝ (جوڑا) کہا جاتا ہے اور ان دونوں کے ایک ایک فرد کو بھی زوﺝ کہہ لیا جاتا ہے کیونکہ ہر ایک دوسرے کے لئے زوﺝ ہوتا ہے۔ قرآن کے اس مقام پر بھی ازواﺝ، افراد ہی کے معنی میں استعمال ہوا ہے۔ یعنی 8 افراد اللہ نے پیدا کئے۔ جو باہم ایک دوسرے کا جوڑا ہیں۔ یہ نہیں کہ زوﺝ (معنی جوڑے) پیدا کئے کیوں کہ اس طرح تعداد 8 کے بجائے 16ہوجائے گی جو آیت کے اگلے حصہ کے مطابق نہیں ہے۔\n(2) یہ ثَمَانِيَةَ سے بدل ہے اور مراد دو قسم سے نر اور مادہ ہے یعنی بھیڑ سے نر اور مادہ اور بکری سے نر اور مادہ پیدا کئے (بھیڑ میں ہی دنبہ چھترا بھی شامل ہے )۔\n(3) مشرکین جو بعض جانوروں کو اپنے طور پر ہی حرام کرلیتے تھے، اس کے حوالے سے اللہ تعالیٰ پوچھ رہا ہے کہ اللہ تعالیٰ نے ان کے نروں کو حرام کیا ہے یا ماداؤں کو یا اس بچے کو جو دونوں ماداؤں کے پیٹ میں ہیں؟ مطلب یہ ہے کہ اللہ نے تو کسی کو بھی حرام نہیں کیا ہے۔\n(4) تمہارے پاس حرام قرار دینے کی کوئی یقینی دلیل ہے تو پیش کرو کہ بَحِيرَةٌ، سَائِبَةٍ، وَصِيلَةٍ اورحَامٍ وغیرہ اس دلیل کی بنیاد پر حرام ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"thamāniyata azwājin mina al-ḍani ith'nayni wamina al-maʿzi ith'nayni qul āldhakarayni ḥarrama ami al-unthayayni ammā ish'tamalat ʿalayhi arḥāmu al-unthayayni nabbiūnī biʿil'min in kuntum ṣādiqīna ","translations":["Eight","pairs ","of","the sheep","two","and of","the goats","two","Say","(Are) the two males","He has forbidden","or","the two females","or what","contains","[in it]","(the) wombs","(of) the two females","Inform me","with knowledge","if","you are","truthful","(143)"],"transliterationArr":["thamāniyata","azwājin","mina","al-ḍani","ith'nayni","wamina","al-maʿzi","ith'nayni","qul","āldhakarayni","ḥarrama","ami","al-unthayayni","ammā","ish'tamalat","ʿalayhi","arḥāmu","al-unthayayni","nabbiūnī","biʿil'min","in","kuntum","ṣādiqīna",null],"verseTiming":[[1,0,1460],[2,1460,4360],[3,4360,5120],[4,5120,5910],[5,5910,6780],[6,6780,7350],[7,7350,8270],[8,8270,11480],[9,11480,11830],[10,11830,16440],[11,16440,17280],[12,17280,17810],[13,17810,19970],[14,19970,21290],[15,21290,22340],[16,22340,23260],[17,23260,24170],[18,24170,28320],[19,28320,29750],[20,29750,30880],[21,30880,32170],[22,32170,34100],[23,34100,38135]]}}