{"name":"6:153","price":"اور یہ کہ یہ دین(1) میرا راستہ ہے جو مستقیم ہے سو اس راه پر چلو(2) اور دوسری راہوں پر مت چلو کہ وه راہیں تم کو اللہ کی راه سے جدا کردیں گی۔ اس کا تم کو اللہ تعالیٰ نے تاکیدی حکم دیا ہے تاکہ تم پرہیزگاری اختیار کرو۔","arabic":"وَأَنَّ هَٰذَا صِرَٰطِي مُسۡتَقِيمٗا فَٱتَّبِعُوهُۖ وَلَا تَتَّبِعُواْ ٱلسُّبُلَ فَتَفَرَّقَ بِكُمۡ عَن سَبِيلِهِۦۚ ذَٰلِكُمۡ وَصَّىٰكُم بِهِۦ لَعَلَّكُمۡ تَتَّقُونَ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":942,"juzNumber":8,"footnotes":"(1) هَذَا (یہ) سے مراد قرآن مجید یا دین اسلام یا وہ احکام ہیں جو بطور خاص اس سورت میں بیان کئے گئے ہیں اور وہ ہیں توحید، معاد اور رسالت۔ اور یہی اسلام کے اصول ثلاثہ ہیں جن کے گرد پورا دین گھومتا ہے۔ اس لئے جو بھی مراد لیا جائے مفہوم سب کا ایک ہی ہے۔\n(2) صراط مستقیم کو واحد کے صیغے سے بیان فرمایا کیونکہ اللہ کی، یا قرآن کی، یا رسول اللہ (صلى الله عليه وسلم) کی راہ ایک ہی ہے۔ ایک سے زیادہ نہیں۔ اس لئے پیروی صرف اسی ایک راہ کی کرنی ہے کسی اور کی نہیں۔ یہی ملت مسلمہ کی وحدت واجتماع کی بنیاد ہے جس سے ہٹ کر یہ امت مختلف فرقوں اور گروہوں میں بٹ گئی ہے۔ حالانکہ اسے تاکید کی گئی ہے کہ ”دوسری راہوں پر مت چلو کہ وہ راہیں تم کو اللہ کی راہ سے جدا کردیں گی“۔ دوسرے مقام پر اللہ تعالیٰ نے فرمایا ”أَنْ أَقِيمُوا الدِّينَ وَلا تَتَفَرَّقُوا فِيهِ“ (الشورى) ”دین کو قائم رکھو اور اس میں پھوٹ نہ ڈالو“ گویا اختلاف اور تفرقہ کی قطعاً اجازت نہیں ہے۔ اسی بات کو حدیث میں نبی (صلى الله عليه وسلم) نے اس طرح واضح فرمایا کہ آپ نے اپنے ہاتھ سے ایک خط کھینچا اور فرمایا کہ ”یہ اللہ کا سیدھا راستہ ہے“۔ اور چند خطوط اس کی دائیں اور بائیں جانب کھینچے اور فرمایا ”یہ راستے ہیں جن پر شیطان بیٹھا ہوا ہے اور وہ ان کی طرف لوگوں کو بلاتا ہے“۔ پھر آپ (صلى الله عليه وسلم) نے یہی آیت تلاوت فرمائی جو زیر وضاحت ہے۔ (مسنداحمد، جلد 1، ص 465،435۔ احمد شاکر نے اسے صحیح کہا ہے دیکھئے مسند احمد بہ تعلیق احمد شاکر نمبر 4142) بلکہ ابن ماجہ کی روایت میں صراحت ہے کہ دو دو خط داہنے اور بائیں کھینچے۔ یعنی کل چار خطوط کھینچے اور انہیں شیطان کا راستہ بتلایا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-anna hādhā ṣirāṭī mus'taqīman fa-ittabiʿūhu walā tattabiʿū al-subula fatafarraqa bikum ʿan sabīlihi dhālikum waṣṣākum bihi laʿallakum tattaqūna ","translations":["And that","this","(is) My path","straight","so follow it","And (do) not","follow","the (other) paths","then they will separate","you","from","His path","That","(He) has enjoined on you","[with it]","so that you may","become righteous","(153)"],"transliterationArr":["wa-anna","hādhā","ṣirāṭī","mus'taqīman","fa-ittabiʿūhu","walā","tattabiʿū","al-subula","fatafarraqa","bikum","ʿan","sabīlihi","dhālikum","waṣṣākum","bihi","laʿallakum","tattaqūna",null],"verseTiming":[[1,0,2030],[2,2030,2930],[3,2930,4230],[4,4230,6540],[5,6540,9850],[6,9850,12040],[7,12040,12570],[8,12570,13680],[9,13680,14540],[10,14540,15920],[11,15920,16510],[12,16510,17880],[13,17880,18940],[14,18940,20600],[15,20600,22550],[16,22550,23240],[17,23240,24560],[18,24560,28185]]}}