{"name":"6:151","price":"آپ کہیے کہ آؤ میں تم کو وه چیزیں پڑھ کر سناؤں جن (یعنی جن کی مخالفت) کو تمہارے رب نے تم پر حرام فرما دیا ہے(1) ، وه یہ کہ اللہ کے ساتھ کسی چیز کو شریک مت ٹھہراؤ(2) اور ماں باپ کے ساتھ احسان کرو(3) اور اپنی اوﻻد کو افلاس کے سبب قتل مت کرو۔ ہم تم کو اور ان کو رزق دیتے ہیں(4) اور بے حیائی کے جتنے طریقے ہیں ان کے پاس بھی مت جاؤ خواه علانیہ ہوں خواه پوشیده، اور جس کا خون کرنا اللہ تعالیٰ نے حرام کردیا ہے اس کو قتل مت کرو، ہاں مگر حق کے ساتھ(5) ان کا تم کو تاکیدی حکم دیا ہے تاکہ تم سمجھو۔","arabic":"۞ قُلۡ تَعَالَوۡاْ أَتۡلُ مَا حَرَّمَ رَبُّكُمۡ عَلَيۡكُمۡۖ أَلَّا تُشۡرِكُواْ بِهِۦ شَيۡـٔٗاۖ وَبِٱلۡوَٰلِدَيۡنِ إِحۡسَٰنٗاۖ وَلَا تَقۡتُلُوٓاْ أَوۡلَٰدَكُم مِّنۡ إِمۡلَٰقٖ نَّحۡنُ نَرۡزُقُكُمۡ وَإِيَّاهُمۡۖ وَلَا تَقۡرَبُواْ ٱلۡفَوَٰحِشَ مَا ظَهَرَ مِنۡهَا وَمَا بَطَنَۖ وَلَا تَقۡتُلُواْ ٱلنَّفۡسَ ٱلَّتِي حَرَّمَ ٱللَّهُ إِلَّا بِٱلۡحَقِّۚ ذَٰلِكُمۡ وَصَّىٰكُم بِهِۦ لَعَلَّكُمۡ تَعۡقِلُونَ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":940,"juzNumber":8,"footnotes":"(1) یعنی حرام وہ نہیں ہیں جن کو تم نے بلا دلیل مَا أَنْزَلَ اللهُ، محض اپنے اوہام باطلہ اور ظنون فاسدہ کی بنیاد پر حرام قرار دے رکھا ہے۔ بلکہ حرام تو وہ چیزیں ہیں جن کو تمہارے رب نے حرام کیا ہے۔ تمہارا پیدا کرنے والا اور تمہارا پالنہار وہی ہے اور ہر چیز کا علم بھی اسی کے پاس ہے۔ اس لئے اسی کو یہ حق حاصل ہے کہ وہ جس چیز کو چاہے حلال اور جس چیز کو چاہے حرام کرے۔ چنانچہ میں تمہیں ان باتوں کی تفصیل بتلاتا ہوں جن کی تاکید تمہارے رب نے کی ہے۔\n(2) أَلا تُشْرِكُوا سے پہلے أَوْصَاكُمْ محذوف ہے۔ یعنی اللہ تعالیٰ نے تمہیں اس بات کا حکم دیا ہے کہ اس کے ساتھ کسی چیز کو تم شریک مت ٹھہراؤ۔ شرک سب سے بڑا گناہ ہے، جس کے لئے معافی نہیں، مشرک پر جنت حرام اور دوزخ واجب ہے۔ قرآن مجید میں یہ ساری چیزیں مختلف انداز سے بار بار بیان ہوئی ہیں۔ اور نبی کریم (صلى الله عليه وسلم) نے بھی احادیث میں ان کو تفصیل اور وضاحت سے بیان فرما دیا ہے اس کے باوجود یہ واقعہ ہے کہ لوگ شیطان کے بہکاوﮮ میں آکر شرک کا عام ارتکاب کرتے ہیں۔\n(3) اللہ تعالیٰ کی توحید واطاعت کے بعد یہاں بھی (اور قرآن کے دوسرے مقامات پر بھی) والدین کے ساتھ حسن سلوک کا حکم دیا گیا ہے جس سے یہ بات واضح ہوتی ہے کہ اطاعت رب کے بعد اطاعت والدین کی بڑی اہمیت ہے۔ اگر کسی نے اس ربوبیت صغریٰ (والدین کی اطاعت اور ان سے حسن سلوک) کے تقاضے پورے نہیں کئے تو وہ ربوبیت کبریٰ کے تقاضے بھی پورے کرنے میں ناکام رہے گا۔\n(4) زمانۂ جاہلیت کا یہ فعل قبیح آﺝ کل ضبط ولادت یا خاندانی منصوبہ بندی کے نام سے پوری دنیا میں زور وشور سے جاری ہے۔ اللہ تعالیٰ اس سے محفوظ رکھے۔\n(5) یعنی قصاص کے طور پر، نہ صرف جائز ہے بلکہ اگر مقتول کے وارث معاف نہ کریں تو یہ قتل نہایت ضروری ہے۔ ”وَلَكُمْ فِي الْقِصَاصِ حَيَاةٌ“ ( البقرۃ: 79) ”قصاص میں تمہاری زندگی ہے“۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qul taʿālaw atlu mā ḥarrama rabbukum ʿalaykum allā tush'rikū bihi shayan wabil-wālidayni iḥ'sānan walā taqtulū awlādakum min im'lāqin naḥnu narzuqukum wa-iyyāhum walā taqrabū al-fawāḥisha mā ẓahara min'hā wamā baṭana walā taqtulū al-nafsa allatī ḥarrama al-lahu illā bil-ḥaqi dhālikum waṣṣākum bihi laʿallakum taʿqilūna ","translations":["Say","Come","I will recite","what","has prohibited","your Lord","to you","That (do) not","associate","with Him","anything","and with the parents","(be) good","and (do) not","kill","your children","(out) of","poverty","We","provide for you","and for them","And (do) not","go near","[the] immoralities","what","(is) apparent","of them","and what","(is) concealed","And (do) not","kill","the soul","which","has (been) forbidden","(by) Allah","except","by (legal) right","That","(He) has enjoined on you","with it","so that you may","use reason","(151)"],"transliterationArr":["qul","taʿālaw","atlu","mā","ḥarrama","rabbukum","ʿalaykum","allā","tush'rikū","bihi","shayan","wabil-wālidayni","iḥ'sānan","walā","taqtulū","awlādakum","min","im'lāqin","naḥnu","narzuqukum","wa-iyyāhum","walā","taqrabū","al-fawāḥisha","mā","ẓahara","min'hā","wamā","baṭana","walā","taqtulū","al-nafsa","allatī","ḥarrama","al-lahu","illā","bil-ḥaqi","dhālikum","waṣṣākum","bihi","laʿallakum","taʿqilūna",null],"verseTiming":[[1,0,450],[2,450,1620],[3,1620,2260],[4,2260,2590],[5,2590,3470],[6,3470,4580],[7,4580,5740],[8,5740,6530],[9,6530,7660],[10,7660,8310],[11,8310,9360],[12,9360,10840],[13,10840,11930],[14,11930,12550],[15,12550,14310],[16,14310,16210],[17,16210,18140],[18,18140,18690],[19,18690,21380],[20,21380,22820],[21,22820,23980],[22,23980,26840],[23,26840,28000],[24,28000,29400],[25,29400,31370],[26,31370,31900],[27,31900,32810],[28,32810,34180],[29,34180,34510],[30,34510,35310],[31,35310,36100],[32,36100,36760],[33,36760,37480],[34,37480,38430],[35,38430,39340],[36,39340,40910],[37,40910,41790],[38,41790,42670],[39,42670,43550],[40,43550,44390],[41,44390,46020],[42,46020,47190],[43,47190,49230],[44,49230,49860],[45,49860,51140],[46,51140,54995]]}}