{"name":"6:158","price":"کیا یہ لوگ صرف اس امر کے منتظر ہیں کہ ان کے پاس فرشتے آئیں یا ان کے پاس آپ کا رب آئے یا آپ کے رب کی کوئی (بڑی) نشانی آئے؟(1) جس روز آپ کے رب کی کوئی بڑی نشانی آپہنچے گی، کسی ایسے شخص کا ایمان اس کے کام نہ آئے گا جو پہلے سے ایمان نہیں رکھتا(2)۔ یا اس نے اپنے ایمان میں کوئی نیک عمل نہ کیا ہو(2)۔ آپ فرما دیجئے کہ تم منتظر رہو، ہم بھی منتظر ہیں۔(4)","arabic":"هَلۡ يَنظُرُونَ إِلَّآ أَن تَأۡتِيَهُمُ ٱلۡمَلَٰٓئِكَةُ أَوۡ يَأۡتِيَ رَبُّكَ أَوۡ يَأۡتِيَ بَعۡضُ ءَايَٰتِ رَبِّكَۗ يَوۡمَ يَأۡتِي بَعۡضُ ءَايَٰتِ رَبِّكَ لَا يَنفَعُ نَفۡسًا إِيمَٰنُهَا لَمۡ تَكُنۡ ءَامَنَتۡ مِن قَبۡلُ أَوۡ كَسَبَتۡ فِيٓ إِيمَٰنِهَا خَيۡرٗاۗ قُلِ ٱنتَظِرُوٓاْ إِنَّا مُنتَظِرُونَ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":947,"juzNumber":8,"footnotes":"(1) قرآن مجید کے نزول اور حضرت محمد (صلى الله عليه وسلم) کی رسالت کے ذریعے سے ہم نے حجت قائم کردی ہے۔ اب بھی اگر یہ اپنی گمراہی سے باز نہیں آتے تو کیا یہ اس بات کے منتظر ہیں کہ ان کے پاس فرشتے آئیں یعنی ان کی روحیں قبض کرنے کے لئے، اس وقت یہ ایمان لائیں گے؟ یا آپ کا رب ان کے پاس آئے، یعنی قیامت برپا ہوجائے اور وہ اللہ کے روبرو پیش کئے جائیں۔ اس وقت یہ ایمان لائیں گے؟ یا آپ کے رب کی کوئی بڑی نشانی آئے۔ جیسے قیامت کے قریب سورﺝ مشرق کے بجائے مغرب سے طلوع ہوگا۔ تو اس قسم کی بڑی نشانی دیکھ کر یہ ایمان لائیں گے؟ اگلے جملے میں وضاحت کی جارہی ہے کہ اگر یہ اس انتظار میں ہیں تو بہت ہی نادانی کا مظاہرہ کررہے ہیں۔ کیونکہ بڑی نشانی کے ظہور کے بعد کافر کا ایمان اور فاسق وفاجر شخص کی توبہ قبول نہیں ہوگی۔ صحیح حدیث ہے نبی (صلى الله عليه وسلم) نے فرمایا کہ ”قیامت قائم نہیں ہوگی یہاں تک کہ سورﺝ (مشرق کے بجائے) مغرب سے طلوع ہو پس جب ایسا ہوگا اور لوگ اسے مغرب سے طلوع ہوتے دیکھیں گے تو سب ایمان لے آئیں گے“ پھر آپ (صلى الله عليه وسلم) نے یہ آیت تلاوت فرمائی «لا يَنْفَعُ نَفْسًا إِيمَانُهَا لَمْ تَكُنْ آمَنَتْ مِنْ قَبْلُ» یعنی اس وقت ایمان لانا کسی کو نفع نہیں دے گا جو اس سے قبل ایمان نہ لایا ہوگا۔ (صحیح بخاری۔ تفسیر سورۃ الانعام )\n(2) یعنی کافر کا ایمان فائدہ مند، یعنی قبول نہیں ہوگا۔\n(3) اس کا مطلب ہے کہ کوئی گناہ گار مومن گناہوں سے توبہ کرے گا تو اس وقت اس کی توبہ قبول نہیں ہوگی اور اس کے بعد عمل صالح غیرمقبول ہوگا۔ جیسا کہ احادیث بھی اس پر دلالت کرتی ہیں۔\n(4) یہ ایمان نہ لانے والوں اور توبہ نہ کرنے والوں کے لئے تہدید ووعید ہے۔ قرآن کریم میں یہی مضمون سورۂ محمد: 18 اور سورۂ مومن: 84 ، 85 میں بھی بیان کیا گیا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"hal yanẓurūna illā an tatiyahumu al-malāikatu aw yatiya rabbuka aw yatiya baʿḍu āyāti rabbika yawma yatī baʿḍu āyāti rabbika lā yanfaʿu nafsan īmānuhā lam takun āmanat min qablu aw kasabat fī īmānihā khayran quli intaẓirū innā muntaẓirūna ","translations":["Are","they waiting","except","that","comes to them","the Angels","or","comes","your Lord","or","comes","some (of)","(the) Signs","(of) your Lord","(The) Day","(when) comes","some (of)","(the) Signs","(of) your Lord","not","will benefit","a soul","its faith","not","(if) it had","believed","from","before","or","earned","through","its faith","any good","Say","Wait","Indeed, we","(are) those who wait","(158)"],"transliterationArr":["hal","yanẓurūna","illā","an","tatiyahumu","al-malāikatu","aw","yatiya","rabbuka","aw","yatiya","baʿḍu","āyāti","rabbika","yawma","yatī","baʿḍu","āyāti","rabbika","lā","yanfaʿu","nafsan","īmānuhā","lam","takun","āmanat","min","qablu","aw","kasabat","fī","īmānihā","khayran","quli","intaẓirū","innā","muntaẓirūna",null],"verseTiming":[[1,0,620],[2,620,3130],[3,3130,5820],[4,5820,6840],[5,6840,8200],[6,8200,11270],[7,11270,11640],[8,11640,12520],[9,12520,13490],[10,13490,13860],[11,13860,14860],[12,14860,15470],[13,15470,16640],[14,16640,18060],[15,18060,18850],[16,18850,19730],[17,19730,20420],[18,20420,21530],[19,21530,22520],[20,22520,22930],[21,22930,24750],[22,24750,25680],[23,25680,27270],[24,27270,27620],[25,27620,28340],[26,28340,29470],[27,29470,30720],[28,30720,31340],[29,31340,31700],[30,31700,32630],[31,32630,34730],[32,34730,36190],[33,36190,37970],[34,37970,38420],[35,38420,41560],[36,41560,43180],[37,43180,47795]]}}