{"name":"6:163","price":"اس کا کوئی شریک نہیں اور مجھ کو اسی کا حکم ہوا ہے اور میں سب ماننے والوں میں سے پہلا ہوں۔(1)","arabic":"لَا شَرِيكَ لَهُۥۖ وَبِذَٰلِكَ أُمِرۡتُ وَأَنَا۠ أَوَّلُ ٱلۡمُسۡلِمِينَ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":952,"juzNumber":8,"footnotes":"(1) توحید الوہیت کی یہی دعوت تمام انبیا نے دی، جس طرح یہاں آخری پیغمبر کی زبان مبارک سے کہلوایا گیا کہ ”مجھے اسی کا حکم دیا گیا ہے اور میں سب ماننے والوں سے پہلا ہوں“۔ دوسرے مقام پر اللہ تعالیٰ نے فرمایا ”ہم نےآپ سے پہلے جتنے بھی انبیا بھیجے، سب کو یہی وحی کی کہ میرے سوا کوئی معبود نہیں، تم میری ہی عبادت کرو“ (الانبیاء: 25) چنانچہ حضرت نوح علیہ السلام نے بھی یہ اعلان فرمایا «وَأُمِرْتُ أَنْ أَكُونَ مِنَ الْمُسْلِمِينَ» (يونس: 72) حضرت ابراہیم علیہ السلام کے بارے میں آتا ہے جب اللہ تعالیٰ نے انہیں کہا کہ أَسْلِمْ (فرمانبردار ہوجا) تو انہوں نے فرمایا «أَسْلَمْتُ لِرَبِّ الْعَالَمِينَ» (البقرة: 131) ”میں رب العالمین کے لئے مسلمان یعنی فرمانبردار ہوگیا“، حضرت ابراہیم السلام ویعقوب علیہ السلام نے اپنی اولاد کو وصیت فرمائی «فَلا تَمُوتُنَّ إِلا وَأَنْتُمْ مُسْلِمُونَ» (البقرة: 132) ”تمہیں موت اسلام پر آنی چاہیے“، حضرت یوسف علیہ السلام نے دعا فرمائی «تَوَفَّنِي مُسْلِمًا» (يوسف: 101) ”مجھے اسلام کی حالت میں دنیا سے اٹھانا“، حضرت موسیٰ علیہ السلام نے اپنی قوم سے کہا «فَعَلَيْهِ تَوَكَّلُوا إِنْ كُنْتُمْ مُسْلِمِينَ» (يونس: 84) ”اگر تم مسلمان ہو تو اسی اللہ پر بھروسہ کرو“، حضرت عیسیٰ علیہ السلام کے حواریوں نے کہا «وَاشْهَدْ بِأَنَّنَا مُسْلِمُونَ» (المائدة: 111) اسی طرح اور بھی تمام انبیاء اور ان کے مخلص پیروکاروں نے اسی اسلام کو اپنایا جس میں توحید الوہیت کو بنیادی حیثیت حاصل تھی۔ گو بعض بعض شرعی احکام ایک دوسرے سے مختلف تھے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"lā sharīka lahu wabidhālika umir'tu wa-anā awwalu al-mus'limīna ","translations":["No","partners","for Him","and with that","I have been commanded","And I am","(the) first","(of) the ones who surrender (to Him)","(163)"],"transliterationArr":["lā","sharīka","lahu","wabidhālika","umir'tu","wa-anā","awwalu","al-mus'limīna",null],"verseTiming":[[1,0,450],[2,450,1430],[3,1430,2030],[4,2030,3840],[5,3840,4800],[6,4800,5360],[7,5360,6260],[8,6260,9715]]}}