{"name":"6:17","price":"اور اگر تجھ کو اللہ تعالیٰ کوئی تکلیف پہنچائے تو اس کا دور کرنے واﻻ سوائے اللہ تعالیٰ کے اور کوئی نہیں۔ اور اگر تجھ کو اللہ تعالیٰ کوئی نفع پہنچائے تو وه ہر چیز پر پوری قدرت رکھنے واﻻ ہے۔(1)","arabic":"وَإِن يَمۡسَسۡكَ ٱللَّهُ بِضُرّٖ فَلَا كَاشِفَ لَهُۥٓ إِلَّا هُوَۖ وَإِن يَمۡسَسۡكَ بِخَيۡرٖ فَهُوَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":806,"juzNumber":7,"footnotes":"(1) یعنی نفع وضرر کا مالک، کائنات میں ہر طرح کا تصرف کرنے والا صرف اللہ ہے اور اس کے حکم وقضا کو کوئی رد کرنےوالا نہیں ہے۔ ایک حدیث میں اس مضمون کو اس طرح بیان کیا گیا ہے «اللَّهُمَّ لا مَانِعَ لِمَا أَعْطَيْتَ، وَلا مُعْطِيَ لِمَا مَنَعْتَ، وَلا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ»(صحيح بخاري، كتاب الاعتصام والقدر والدعوات- مسلم كتاب الصلاة والمساجد)۔ ”جس کو تو دے اس کو کوئی روکنے والا نہیں، اور جس سے تو روک لے اس کو کوئی دینے والا نہیں اور کسی صاحب حیثیت کو اس کی حیثیت تیرے مقابلے میں نفع نہیں پہنچاسکتی“، نبی (صلى الله عليه وسلم) ہر نماز کے بعد یہ دعا پڑھا کرتے تھے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-in yamsaska al-lahu biḍurrin falā kāshifa lahu illā huwa wa-in yamsaska bikhayrin fahuwa ʿalā kulli shayin qadīrun ","translations":["And if","touches you","Allah","with affliction","then no","remover","of it","except","Him","And if","He touches you","with good","then He","(is) on","every","thing","All-Powerful","(17)"],"transliterationArr":["wa-in","yamsaska","al-lahu","biḍurrin","falā","kāshifa","lahu","illā","huwa","wa-in","yamsaska","bikhayrin","fahuwa","ʿalā","kulli","shayin","qadīrun",null],"verseTiming":[[1,0,1410],[2,1410,2380],[3,2380,3310],[4,3310,4350],[5,4350,5710],[6,5710,6700],[7,6700,8630],[8,8630,9480],[9,9480,10060],[10,10060,11910],[11,11910,12930],[12,12930,13960],[13,13960,15250],[14,15250,15940],[15,15940,16620],[16,16620,18430],[17,18430,21105]]}}