{"name":"6:21","price":"اور اس سے زیاده بےانصاف کون ہوگا جو اللہ تعالیٰ پر جھوٹ بہتان باندھے یا اللہ کی آیات کو جھوٹا بتلائے(1) ایسے بےانصافوں کو کامیابی نہ ہوگی۔(2)","arabic":"وَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبًا أَوۡ كَذَّبَ بِـَٔايَٰتِهِۦٓۚ إِنَّهُۥ لَا يُفۡلِحُ ٱلظَّٰلِمُونَ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":810,"juzNumber":7,"footnotes":"(1) یعنی جس طرح اللہ پر جھوٹ گھڑنے والا (یعنی نبوت کا جھوٹا دعویٰ کرنے والا) سب سے بڑا ظالم ہے، اسی طرح وہ بھی بڑا ظالم ہے جو اللہ کی آیات اور اس کے سچے رسول کی تکذیب کرے۔ جھوٹے دعوائے نبوت پر اتنی سخت وعید کے باوجود یہ واقعہ ہے کہ متعدد لوگوں نے ہر دور میں نبوت کے جھوٹے دعوے کئے ہیں اور یوں یقیناً نبی (صلى الله عليه وسلم) کی یہ پیش گوئی پوری ہوگئی کی تیس جھوٹے دجال ہوں گے۔ ہر ایک کا دعویٰ ہوگا کہ وہ نبی ہے۔ گذشتہ صدی میں بھی قادیان کے ایک شحض نے نبوت کا دعویٰ کیا اور آج اس کے پیروکار اسے اس لئے سچا نبی اوربعض مسیح موعود مانتے ہیں کہ اسے ایک قلیل تعداد نبی مانتی ہے۔ حالانکہ کچھ لوگوں کا کسی جھوٹے کو سچا مان لینا، اس کی سچائی کی دلیل نہیں بن سکتا۔ صداقت کے لئے تو قرآن وحدیث کے واضح دلائل کی ضرورت ہے۔\n(2) جب یہ دونوں ہی ظالم ہیں تو نہ مفتری (جھوٹ گھڑنے والا) کامیاب ہوگا اور نہ مکذب (جھٹلانے والا) اس لئے ضروری ہے کہ ہر ایک اپنے انجام پر اچھی طرح غور کرلے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waman aẓlamu mimmani if'tarā ʿalā al-lahi kadhiban aw kadhaba biāyātihi innahu lā yuf'liḥu al-ẓālimūna ","translations":["And who","(is) more unjust","than (he) who","invents","against","Allah","a lie","or","rejects","His Signs","Indeed","not","will be successful","the wrongdoers","(21)"],"transliterationArr":["waman","aẓlamu","mimmani","if'tarā","ʿalā","al-lahi","kadhiban","aw","kadhaba","biāyātihi","innahu","lā","yuf'liḥu","al-ẓālimūna",null],"verseTiming":[[1,0,650],[2,650,1480],[3,1480,2820],[4,2820,3700],[5,3700,4060],[6,4060,4920],[7,4920,5710],[8,5710,6090],[9,6090,6980],[10,6980,8920],[11,8920,10690],[12,10690,11150],[13,11150,11990],[14,11990,16195]]}}