{"name":"6:23","price":"پھر ان کے شرک کا انجام اس کے سوا اور کچھ بھی نہ ہوگا کہ وه یوں کہیں گے کہ قسم اللہ کی اپنے پروردگار کی ہم مشرک نہ تھے۔(1)","arabic":"ثُمَّ لَمۡ تَكُن فِتۡنَتُهُمۡ إِلَّآ أَن قَالُواْ وَٱللَّهِ رَبِّنَا مَا كُنَّا مُشۡرِكِينَ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":812,"juzNumber":7,"footnotes":"(1) فتنہ کے ایک معنی حجت اور ایک معنی معذرت کے کئے گئے ہیں۔ بالآخر یہ حجت یا معذرت پیش کرکے چھٹکارا حاصل کرنے کی کوشش کریں گے کہ ہم تو مشرک ہی نہ تھے۔ اور امام ابن جریر نے اس کے معنی یہ بیان کئے ہیں «ثُمَّ لَمْ يَكُنْ قِيلُهُمْ عِنْدَ فِتْنَتِنَا إِيَّاهُمْ اعْتِذَارًا مِمَّا سَلَفَ مِنْهُمْ مِنَ الشِّرْكِ بِاللهِ»۔ ”جب ہم انہیں سوال کی بھٹی میں جھونکیں گے تو دنیا میں انہوں نے جو شرک کیا، اس کی معذرت کے لئے یہ کہے بغیر ان کے لئے چارہ نہیں ہوگا کہ ہم تو مشرک ہی نہ تھے“ یہاں یہ اشکال پیش نہ آئے کہ وہاں تو انسانوں کے ہاتھ پیر گواہی دیں گے اور زبانوں پر تو مہریں لگا دی جائیں گی، پھر یہ انکار کس طرح کریں گے؟ اس کا جواب حضرت ابن عباس (رضي الله عنه) نے یہ دیا ہے کہ جب مشرکین دیکھیں کے کہ اہل توحید مسلمان جنت میں جا رہے ہیں تو یہ باہم مشورہ کرکے اپنے شرک کرنے سے ہی انکار کردیں گے تب اللہ تعالیٰ ان کے مونہوں پر مہر لگا دے گا اور ان کے ہاتھ پاؤ ں جو کچھ انہوں نے کیا ہوگا اس کی گواہی دیں گے اور پھر یہ اللہ سے کوئی بات چھپانے پر قادر نہ ہوسکیں گے۔ (ابن کثیر)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"thumma lam takun fit'natuhum illā an qālū wal-lahi rabbinā mā kunnā mush'rikīna ","translations":["Then","not","will be","(for) them a plea","except","that","they say","By Allah","our Lord","not","we were","those who associated others (with Allah)","(23)"],"transliterationArr":["thumma","lam","takun","fit'natuhum","illā","an","qālū","wal-lahi","rabbinā","mā","kunnā","mush'rikīna",null],"verseTiming":[[1,0,1220],[2,1220,1570],[3,1570,2830],[4,2830,4120],[5,4120,6800],[6,6800,8030],[7,8030,8890],[8,8890,9830],[9,9830,10870],[10,10870,11180],[11,11180,12820],[12,12820,15765]]}}