{"name":"6:28","price":"بلکہ جس چیز کو اس کے قبل چھپایا کرتے تھے وه ان کے سامنے آگئی ہے(1) اور اگر یہ لوگ پھر واپس بھیج دیئے جائیں تب بھی یہ وہی کام کریں گے جس سے ان کو منع کیا گیا تھا اور یقیناً یہ بالکل جھوٹے ہیں۔(2)","arabic":"بَلۡ بَدَا لَهُم مَّا كَانُواْ يُخۡفُونَ مِن قَبۡلُۖ وَلَوۡ رُدُّواْ لَعَادُواْ لِمَا نُهُواْ عَنۡهُ وَإِنَّهُمۡ لَكَٰذِبُونَ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":817,"juzNumber":7,"footnotes":"(1) بَلْ جو إِضْرَاب ( یعنی پہلی بات سے گریز کرنے) کے لئے آتا ہے۔ اس کے کئی مفہوم بیان کئے گئے ہیں۔ ان کے لئے وہ کفر اور عناد وتکذیب ظاہر ہوجائے گی، جو اس سے قبل وہ دنیا یا آخرت میں چھپاتے تھے۔ یعنی جس کا انکارکرتے تھے، جیسے وہاں بھی ابتداءً کہیں گے مَا كُنَّا مُشْرِكِينَ (ہم تو مشرک ہی نہ تھے) یا رسول اللہ (صلى الله عليه وسلم) اور قرآن کریم کی صداقت کا علم جو ان کے دلوں میں تھا، لیکن اپنے پیروکاروں سے چھپاتے تھے۔ وہاں ظاہر ہوجائے گا۔ یا منافقین کا وہ نفاق وہاں ظاہر ہوجائے گا جسے وہ دنیا میں اہل ایمان سے چھپاتے تھے۔ (تفسیر ابن کثیر)\n(2) یعنی دوبارہ دنیا میں آنے کی خواہش ایمان لانے کے لئے نہیں، صرف عذاب سے بچنے کے لئے ہے، جو ان پر قیامت کے دن ظاہر ہوجائے گا اور جس کا وہ معائنہ کرلیں گے ورنہ اگر یہ دنیا میں دوبارہ بھیج دیئے جائیں تب بھی یہ وہی کچھ کریں گے جو پہلے کرتے رہے ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"bal badā lahum mā kānū yukh'fūna min qablu walaw ruddū laʿādū limā nuhū ʿanhu wa-innahum lakādhibūna ","translations":["Nay","became manifest","for them","what","they used to","conceal","from","before","And if","they were sent back","certainly they (would) return","to what","they were forbidden","from it","and indeed they","certainly are liars","(28)"],"transliterationArr":["bal","badā","lahum","mā","kānū","yukh'fūna","min","qablu","walaw","ruddū","laʿādū","limā","nuhū","ʿanhu","wa-innahum","lakādhibūna",null],"verseTiming":[[1,0,480],[2,480,1160],[3,1160,1820],[4,1820,3000],[5,3000,3900],[6,3900,5000],[7,5000,6350],[8,6350,7190],[9,7190,7870],[10,7870,8700],[11,8700,9780],[12,9780,10550],[13,10550,11120],[14,11120,11860],[15,11860,13790],[16,13790,17635]]}}