{"name":"6:33","price":"ہم خوب جانتے ہیں کہ آپ کو ان کے اقوال مغموم کرتے ہیں، سو یہ لوگ آپ کو جھوٹا نہیں کہتے لیکن یہ ﻇالم تو اللہ کی آیتوں کا انکار کرتے ہیں۔(1)","arabic":"قَدۡ نَعۡلَمُ إِنَّهُۥ لَيَحۡزُنُكَ ٱلَّذِي يَقُولُونَۖ فَإِنَّهُمۡ لَا يُكَذِّبُونَكَ وَلَٰكِنَّ ٱلظَّٰلِمِينَ بِـَٔايَٰتِ ٱللَّهِ يَجۡحَدُونَ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":822,"juzNumber":7,"footnotes":"(1) نبی (صلى الله عليه وسلم) کو کفار کی طرف اپنی تکذیب کی وجہ سے جو غم وحزن پہنچتا، اس کے ازالے اور آپ کی تسلی کے لئے فرمایا جارہا ہے کہ یہ تکذیب آپ کی نہیں۔ (آپ کو تو وہ صادق وامین مانتے ہیں) دراصل یہ آیات الٰہی کی تکذیب ہے اوریہ ایک ظلم ہے۔ جس کا وہ ارتکاب کر رہے ہیں۔ ترمذی وغیرہ کی ایک روایات میں ہے کہ ابوجہل نے ایک بار رسول اللہ (صلى الله عليه وسلم) سے کہا اے محمد! ہم تم کو نہیں بلکہ جو کچھ تم لے کر آئے ہو اس کو جھٹلاتے ہیں۔ اس پر یہ آیت نازل ہوئی۔ ترمذی کی یہ راویت اگرچہ سنداً ضعیف ہے لیکن دوسری صحیح روایات سے اس امر کی تصدیق ہوتی ہے کہ کفار مکہ نبی (صلى الله عليه وسلم) کی امانت ودیانت اور صداقت کے قائل تھے، لیکن اس کے باوجود وہ آپ (صلى الله عليه وسلم) کی رسالت پر ایمان لانے سے گریزاں رہے۔ آج بھی جو لوگ نبی (صلى الله عليه وسلم) کے حسن اخلاق، رفعت کردار اور امانت وصداقت کو تو خوب جھوم جھوم کر بیان کرتے اور اس موضوع پر فصاحت وبلاغت کے دریا بہاتے ہیں لیکن اتباع رسول (صلى الله عليه وسلم) میں وہ انقباض محسوس کرتے آپ کی بات کے مقابلے میں فقہ وقیاس اور اقوال ائمہ کو ترجیح دیتے ہیں، انہیں سوچنا چاہیئے کہ یہ کس کا کردار ہے جسے انہوں نے اپنایا ہوا ہے؟","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qad naʿlamu innahu layaḥzunuka alladhī yaqūlūna fa-innahum lā yukadhibūnaka walākinna al-ẓālimīna biāyāti al-lahi yajḥadūna ","translations":["Indeed","We know","that it","grieves you","what","they say","And indeed, they","(do) not","deny you","but","the wrongdoers ","the Verses","(of) Allah","they reject","(33)"],"transliterationArr":["qad","naʿlamu","innahu","layaḥzunuka","alladhī","yaqūlūna","fa-innahum","lā","yukadhibūnaka","walākinna","al-ẓālimīna","biāyāti","al-lahi","yajḥadūna",null],"verseTiming":[[1,0,510],[2,510,1250],[3,1250,2860],[4,2860,4220],[5,4220,5050],[6,5050,8310],[7,8310,10060],[8,10060,10490],[9,10490,12300],[10,12300,14080],[11,14080,15510],[12,15510,16870],[13,16870,17800],[14,17800,20685]]}}