{"name":"6:34","price":"اور بہت سے پیغمبر جو آپ سے پہلے ہوئے ہیں ان کی بھی تکذیب کی جا چکی ہے سو انہوں نے اس پر صبر ہی کیا، ان کی تکذیب کی گئی اور ان کو ایذائیں پہنچائی گئیں یہاں تک کہ ہماری امداد ان کو پہنچی(1) اور اللہ کی باتوں کا کوئی بدلنے واﻻ نہیں(2) اور آپ کے پاس بعض پیغمبروں کی بعض خبریں پہنچ چکی ہیں۔(3)","arabic":"وَلَقَدۡ كُذِّبَتۡ رُسُلٞ مِّن قَبۡلِكَ فَصَبَرُواْ عَلَىٰ مَا كُذِّبُواْ وَأُوذُواْ حَتَّىٰٓ أَتَىٰهُمۡ نَصۡرُنَاۚ وَلَا مُبَدِّلَ لِكَلِمَٰتِ ٱللَّهِۚ وَلَقَدۡ جَآءَكَ مِن نَّبَإِيْ ٱلۡمُرۡسَلِينَ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":823,"juzNumber":7,"footnotes":"(1) نبی (صلى الله عليه وسلم) کی مزید تسلی کے لئے کہا جا رہاہے کہ یہ پہلا واقعہ نہیں ہے کہ کافر اللہ کے پیغمبر کا انکار کر رہے ہیں بلکہ اس سے پہلے بھی بہت سے رسول گزرچکے ہیں جن کی تکذیب کی جاتی رہی ہے۔ پس آپ بھی ان کی اقتدا کرتے ہوئے اسی طرح صبر اور حوصلے سے کام لیں جس طرح انہوں نے تکذیب اور ایذا پر صبر سے کام لیا، حتیٰ کہ آپ کے پاس بھی اسی طرح ہمار ی مدد آجائے، جس طرح پہلے رسولوں کی ہم نے مدد کی اور ہم اپنے وعدے کے خلاف نہیں کرتے۔ ہم نے وعدہ کیا ہوا ہے «إِنَّا لَنَنْصُرُ رُسُلَنَا وَالَّذِينَ آمَنُوا» (المؤمن: 51) ”یقیناً ہم اپنے پیغمبروں اور اہل ایمان کی مدد کریں گے“۔ «كَتَبَ اللَّهُ لأَغْلِبَنَّ أَنَا وَرُسُلِي» (المجادلة: 21) ”اللہ نے یہ فیصلہ کردیا ہے کہ میں اور میرے رسول غالب رہیں گے“، وَغَيْرهَا مِنَ الآيَاتِ . (مثلا الصافات: 171، 172)\n(2) بلکہ اس کا وعدہ پورا ہو کر رہے گا کہ آپ کافروں پر غالب ومنصور رہیں گے۔ چنانچہ ایسا ہی ہوا۔\n(3) جن سے واضح ہے کہ ابتدا میں گو ان کی قوموں نے انہیں جھٹلایا، انہیں ایذائیں پہنچائیں اور ان کے لئے عرصۂ حیات تنگ کردیا، لیکن بالآخر اللہ کی نصرت سے کامیابی وکامرانی اور نجات ابدی انہی کا مقدر بنی۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walaqad kudhibat rusulun min qablika faṣabarū ʿalā mā kudhibū waūdhū ḥattā atāhum naṣrunā walā mubaddila likalimāti al-lahi walaqad jāaka min naba-i al-mur'salīna ","translations":["And surely","were rejected","Messengers","from","before you","but they were patient","over","what","they were rejected","and they were harmed","until","came to them","Our help","And no","one (can) alter","(the) words","(of) Allah","and surely","has come to you","of","(the) news","(of) the Messengers","(34)"],"transliterationArr":["walaqad","kudhibat","rusulun","min","qablika","faṣabarū","ʿalā","mā","kudhibū","waūdhū","ḥattā","atāhum","naṣrunā","walā","mubaddila","likalimāti","al-lahi","walaqad","jāaka","min","naba-i","al-mur'salīna",null],"verseTiming":[[1,0,850],[2,850,1850],[3,1850,2540],[4,2540,3920],[5,3920,4760],[6,4760,5490],[7,5490,6530],[8,6530,7200],[9,7200,7590],[10,7590,8740],[11,8740,9800],[12,9800,12560],[13,12560,13680],[14,13680,14820],[15,14820,15860],[16,15860,16900],[17,16900,18240],[18,18240,20800],[19,20800,21600],[20,21600,23699],[21,23699,23959],[22,23959,25639],[23,25639,29084]]}}