{"name":"6:41","price":"بلکہ خاص اسی کو پکارو گے، پھر جس کے لئے تم پکارو گے اگر وه چاہے تو اس کو ہٹا بھی دے اور جن کو تم شریک ٹھہراتے ہو ان سب کو بھول بھال جاؤ گے۔(1)","arabic":"بَلۡ إِيَّاهُ تَدۡعُونَ فَيَكۡشِفُ مَا تَدۡعُونَ إِلَيۡهِ إِن شَآءَ وَتَنسَوۡنَ مَا تُشۡرِكُونَ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":830,"juzNumber":7,"footnotes":"(1) ”أَرَأيْتَكُمْ“ میں کاف اور میم خطاب کے لئے ہے اس کے معنی ”أَخْبِرُونِي“ (مجھے بتلاؤ یا خبر دو) کے ہیں۔ اس مضمون کو بھی قرآن کریم میں کئی جگہ بیان کیا گیا ہے۔ (دیکھیے سورۂ بقرہ آیت 165 کا حاشیہ) اس کا مطلب یہ ہوا کہ توحید انسانی فطرت کی آواز ہے۔ انسانی ماحول، یا آبا واجداد کی تقلید نا سدید میں مشرکانہ عقائد واعمال میں مبتلا رہتا ہے اور غیر اللہ کو اپنا حاجت روا ومشکل کشا سمجھتا رہتا ہے، نذر ونیاز بھی انہی کے نام کی نکالتا ہے، لیکن جب کسی ابتلا سے دوچار ہوتا ہے تو پھر یہ سب بھول جاتا ہے اور فطرت ان سب پر غالب آجاتی ہے اور بےاختیار انسان پھر اسی ذات کو پکارتا ہے جس کو پکارنا چاہیے۔ کاش! لوگ اسی فطرت پر قائم رہیں کہ نجات اخروی تو مکمل طور پر اسی صدائے فطرت یعنی توحید کے اختیار کرنے میں ہی ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"bal iyyāhu tadʿūna fayakshifu mā tadʿūna ilayhi in shāa watansawna mā tush'rikūna ","translations":["Nay","Him Alone","you call","and He would remove","what","you call","upon Him","if","He wills","and you will forget","what","you associate (with Him)","(41)"],"transliterationArr":["bal","iyyāhu","tadʿūna","fayakshifu","mā","tadʿūna","ilayhi","in","shāa","watansawna","mā","tush'rikūna",null],"verseTiming":[[1,0,530],[2,530,1600],[3,1600,2710],[4,2710,3850],[5,3850,4210],[6,4210,5280],[7,5280,6200],[8,6200,7240],[9,7240,9640],[10,9640,11590],[11,11590,12000],[12,12000,14705]]}}