{"name":"6:45","price":"پھر ﻇالم لوگوں کی جڑ کٹ گئی اور اللہ تعالیٰ کا شکر ہے جو تمام عالم کا پروردگار ہے۔(1)","arabic":"فَقُطِعَ دَابِرُ ٱلۡقَوۡمِ ٱلَّذِينَ ظَلَمُواْۚ وَٱلۡحَمۡدُ لِلَّهِ رَبِّ ٱلۡعَٰلَمِينَ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":834,"juzNumber":7,"footnotes":"(1) اس میں خدا فراموش قوموں کی بابت اللہ تعالیٰ بیان فرماتا ہے کہ ہم بعض دفعہ وقتی طور پر ایسی قوموں پر دنیا کی آسائشوں اور فراوانیوں کے دروازے کھول دیتے ہیں، یہاں تک کہ جب وہ اس میں خوب مگن ہوجاتی ہیں اور اپنی مادی خوش حالی و ترقی پر اترانے لگ جاتی ہیں تو پھر ہم اچانک انہیں اپنے مواخذے کی گرفت میں لے لیتے ہیں اور ان کی جڑ ہی کاٹ کر رکھ دیتے ہیں۔ حدیث میں بھی آتا ہے۔ نبی (صلى الله عليه وسلم) نے فرمایا کہ ”جب تم دیکھو کہ اللہ تعالیٰ نافرمانیوں کے باوجود کسی کو اس کی خواہشات کے مطابق دنیا دے رہا ہے تو یہ استدراج (دھیل دینا) ہے۔ پھر آپ نے یہی آیت تلاوت فرمائی۔“ (مسند أحمد، جلد 4، صفحة 145) قرآن کریم کی اس آیت اور حدیث نبوی (صلى الله عليه وسلم) سے معلوم ہوا کہ دنیوی ترقی اور خوش حالی اس بات کی دلیل نہیں ہے کہ جس فرد یا قوم کو یہ حاصل ہو تو وہ اللہ کی چہیتی ہے اور اللہ تعالیٰ اس سے خوش ہے، جیسا کہ بعض لوگ ایسا سمجھتے ہیں بلکہ بعض تو انہیں «أَنَّ الأَرْضَ يَرِثُهَا عِبَادِيَ الصَّالِحُونَ» (الأنبياء: 105) کا مصداق قرار دے کر انہیں (اللہ کے نیک بندے) تک قرار دیتے ہیں۔ ایسا سمجھنا اور کہنا غلط ہے، گمراہ قوموں یا افراد کی دنیوی خوش حالی، ابتلا اور مہلت کے طور پر ہے نہ کہ یہ ان کے کفر ومعاصی کا صلہ ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"faquṭiʿa dābiru al-qawmi alladhīna ẓalamū wal-ḥamdu lillahi rabbi al-ʿālamīna ","translations":["So was cut off","(the) remnant","(of) the people","[those] who","did wrong","And all praises and thanks","(be) to Allah","Lord","(of) the worlds","(45)"],"transliterationArr":["faquṭiʿa","dābiru","al-qawmi","alladhīna","ẓalamū","wal-ḥamdu","lillahi","rabbi","al-ʿālamīna",null],"verseTiming":[[1,0,1060],[2,1060,1870],[3,1870,2850],[4,2850,3940],[5,3940,4970],[6,4970,6470],[7,6470,7590],[8,7590,8280],[9,8280,13035]]}}