{"name":"6:53","price":"اور اسی طرح ہم نے بعض کو بعض کے ذریعہ سے آزمائش میں ڈال رکھا ہے تاکہ یہ لوگ کہا کریں، کیا یہ لوگ ہیں کہ ہم سب میں سے ان پر اللہ تعالیٰ نے فضل کیا ہے(1) ۔ کیا یہ بات نہیں ہے کہ اللہ تعالیٰ شکر گزاروں کو خوب جانتا ہے۔(2)","arabic":"وَكَذَٰلِكَ فَتَنَّا بَعۡضَهُم بِبَعۡضٖ لِّيَقُولُوٓاْ أَهَٰٓؤُلَآءِ مَنَّ ٱللَّهُ عَلَيۡهِم مِّنۢ بَيۡنِنَآۗ أَلَيۡسَ ٱللَّهُ بِأَعۡلَمَ بِٱلشَّٰكِرِينَ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":842,"juzNumber":7,"footnotes":"(1) ابتدا میں اکثر غریب، غلام قسم کے لوگ ہی مسلمان ہوئے تھے۔ اس لئے یہی چیز روءسائے کفار کی آزمائش کا ذریعہ بن گئی اور وہ ان غریبوں کا مذاق بھی اڑاتے اور جن پر ان کا بس چلتا، انہیں تعذیب واذیت سے بھی دوچار کرتے اور کہتے کہ کیا یہی لوگ جن پراللہ نے احسان فرمایا ہے؟ مقصد ان کا یہ تھا کہ ایمان اور اسلام اگر واقعی اللہ کا احسان ہوتا تو یہ سب سے پہلے ہم پر ہوتا، جس طرح دوسرے مقام پر فرمایا ”لَوْ كَانَ خَيْرًا مَا سَبَقُونَا إِلَيْهِ“ (الأحقاف: 11) ”اگر یہ بہتر چیز ہوتی تو اس کے قبول کرنے میں یہ ہم سے سبقت نہ کرتے“ یعنی ان ضعفا کے مقابلے میں ہم پہلے مسلمان ہوتے۔\n(2) یعنی اللہ تعالیٰ ظاہری چمک دمک، ٹھاٹھ باٹھ اور رئیسانہ کروفر وغیرہ نہیں دیکھتا، وہ تو دلوں کی کیفیت کو دیکھتا ہے اور اس اعتبار سے وہ جانتا ہے کہ اس کے شکرگزار بندے اور حق شناس کون ہیں؟ پس اس نے جن کے اندر شکرگزاری کی خوبی دیکھی، انہیں ایمان کی سعادت سے سرفراز کردیا جس طرح حدیث میں آتا ہے۔ ”اللہ تعالیٰ تمہاری صورتیں اور تمہارے رنگ نہیں دیکھتا، وہ تو تمہارے دل اور تمہارے عمل دیکھتا ہے۔“ (صحيح مسلم، كتاب البر، باب تحريم ظلم المسلم وخذله واحتقاره ودمه وعرضه)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wakadhālika fatannā baʿḍahum bibaʿḍin liyaqūlū ahāulāi manna al-lahu ʿalayhim min bayninā alaysa al-lahu bi-aʿlama bil-shākirīna ","translations":["And thus","We try","some of them","with others","that they say","Are these","(whom has been) favored","(by) Allah","[upon them]","from","among us","is not","Allah","most knowing","of those who are grateful","(53)"],"transliterationArr":["wakadhālika","fatannā","baʿḍahum","bibaʿḍin","liyaqūlū","ahāulāi","manna","al-lahu","ʿalayhim","min","bayninā","alaysa","al-lahu","bi-aʿlama","bil-shākirīna",null],"verseTiming":[[1,0,1420],[2,1420,3040],[3,3040,4580],[4,4580,5410],[5,5410,7010],[6,7010,9920],[7,9920,14200],[8,14200,15200],[9,15200,16140],[10,16140,18040],[11,18040,19020],[12,19020,20200],[13,20200,21500],[14,21500,22490],[15,22490,23610],[16,23610,26755]]}}