{"name":"6:58","price":"آپ کہہ دیجئے کہ اگر میرے پاس وه چیز ہوتی جس کا تم تقاضا کر رہے ہو تو میرا اور تمہارا باہمی قصہٴ فیصل(1) ہوچکا ہوتا اور ﻇالموں کو اللہ تعالیٰ خوب جانتا ہے۔","arabic":"قُل لَّوۡ أَنَّ عِندِي مَا تَسۡتَعۡجِلُونَ بِهِۦ لَقُضِيَ ٱلۡأَمۡرُ بَيۡنِي وَبَيۡنَكُمۡۗ وَٱللَّهُ أَعۡلَمُ بِٱلظَّٰلِمِينَ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":847,"juzNumber":7,"footnotes":"(1) یعنی اگر اللہ تعالیٰ میرے طلب کرنے پر فوراً عذاب بھیج دیتا یا اللہ تعالیٰ میرے اختیار میں یہ چیز دے دیتا تو پھر تمہاری خواہش کے مطابق عذاب بھیج کر جلد ہی فیصلہ کردیا جاتا۔ لیکن یہ معاملہ چونکہ کلیتاً اللہ کی مشیت پر موقوف ہے، اس لئے اس نے مجھے اس کا اختیار دیا ہے اور نہ ہی ممکن ہے کہ میری درخواست پر فوراً عذاب نازل فرما دے۔\nضروری وضاحت: حدیث میں جو آتا ہے کہ ایک موقعے پر اللہ کے حکم سے پہاڑوں کا فرشتہ نبی (صلى الله عليه وسلم) کے خدمت میں آیا اور اس نے کہا کہ اگر آپ (صلى الله عليه وسلم) حکم دیں تو میں ساری آبادی کو دونوں پہاڑوں کے درمیان کچل دوں آپ (صلى الله عليه وسلم) نے فرمایا: ”نہیں، بلکہ مجھے امید ہے کہ اللہ تعالیٰ ان کی نسلوں سے اللہ کی عبادت کرنے والا پیدا فرمائے گا، جو اس کے ساتھ کسی کو شریک نہیں ٹھہرائیں گے“ (صحيح بخاري، كتاب بدء الخلق، باب إذا قال أحدكم آمين والملائكة في السماء ... وصحيح مسلم، كتاب الجهاد باب ما لقي النبي من أذى المشركين) یہ حدیث آیت زیرِ وضاحت کے خلاف نہیں ہے، جیسا کہ بظاہر معلوم ہوتی ہے، اس لئے کہ آیت میں عذاب طلب کرنے پر عذاب دینے کا اظہار ہے جب کہ اس حدیث میں مشرکین کے طلب کئے بغیر صرف ان کی ایذا دہی کی وجہ سے ان پر عذاب بھیجنے کا ارادہ ظاہر کیا گیا ہے جسے آپ (صلى الله عليه وسلم) نے پسند نہیں فرمایا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qul law anna ʿindī mā tastaʿjilūna bihi laquḍiya al-amru baynī wabaynakum wal-lahu aʿlamu bil-ẓālimīna ","translations":["Say","If","that","(were) with me","what","you seek to hasten","of it","surely would have been decided","the matter","between me","and between you","And Allah","(is) most knowing","of the wrongdoers","(58)"],"transliterationArr":["qul","law","anna","ʿindī","mā","tastaʿjilūna","bihi","laquḍiya","al-amru","baynī","wabaynakum","wal-lahu","aʿlamu","bil-ẓālimīna",null],"verseTiming":[[1,0,360],[2,360,920],[3,920,2390],[4,2390,4200],[5,4200,4570],[6,4570,6260],[7,6260,6990],[8,6990,7750],[9,7750,8680],[10,8680,9460],[11,9460,11200],[12,11200,12330],[13,12330,13300],[14,13300,17635]]}}