{"name":"6:62","price":"پھر سب اپنے مالک حقیقی کے پاس ﻻئے جائیں گے(1) ۔ خوب سن لو فیصلہ اللہ ہی کا ہوگا اور وه بہت جلد حساب لے گا۔","arabic":"ثُمَّ رُدُّوٓاْ إِلَى ٱللَّهِ مَوۡلَىٰهُمُ ٱلۡحَقِّۚ أَلَا لَهُ ٱلۡحُكۡمُ وَهُوَ أَسۡرَعُ ٱلۡحَٰسِبِينَ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":851,"juzNumber":7,"footnotes":"(1) آیت میں ”رُدُّوْا“ (لوٹائے جائیں گے) کا مرجع بعض نے فرشتوں کو قرار دیا ہے یعنی قبض روح کے بعد فرشتے اللہ کی بارگاہ میں لوٹ جاتے ہیں۔ اور بعض نے اس کا مرجع تمام لوگوں کو بنایا ہے۔ یعنی سب لوگ حشر کے بعد اللہ کی بارگاہ میں لوٹائے جائیں گے (پیش کئے جائیں گے) اور پھر وہ سب کا فیصلہ فرمائے گا۔ آیت میں روح قبض کرنے والے فرشتوں کو رسل (جمع کے صیغے کے ساتھ) بیان کیا گیا ہے جس سے بظاہر یہ معلوم ہوتا ہے کہ روح قبض کرنے والا فرشتہ ایک نہیں متعدد ہیں۔ اس کی توجیہ بعض مفسرین نے اس طرح کی ہے کہ قرآن مجید میں روح قبض کرنے کی نسبت اللہ کی طرف بھی ہے۔ ”اللَّهُ يَتَوَفَّى الأَنْفُسَ حِينَ مَوْتِهَا“ (الزمر: 42) اللہ لوگوں کے مرنے کے وقت ان کی روحیں قبض کرلیتا ہے، اور اس کی نسبت ایک فرشتے (ملک الموت) کی طرف بھی کی گئی ہے۔ ”قُلْ يَتَوَفَّاكُمْ مَلَكُ الْمَوْتِ الَّذِي وُكِّلَ بِكُمْ“ (الم السجدة: 11) کہہ دو تمہاری روحیں وہ فرشتۂ موت قبض کرتا ہے جو تمہارے لئے مقرر کیا گیا ہے، اور اس کی نسبت متعدد فرشتوں کی طرف بھی کی گئی ہے، جیسا کہ اس مقام پر ہے اور اسی طرح سورۂ نساء آیت 97 اور الانعام آیت 93 میں بھی ہے۔ اس لئے اللہ کی طرف اس کی نسبت اس لحاظ سے ہے کہ وہی اصل آمر (حکم دینے والا) بلکہ فاعل حقیقی ہے۔ متعدد فرشتوں کی طرف نسبت اس لحاظ سے ہے کہ وہ ملک الموت کے مددگار ہیں، وہ رگوں، شریانوں، پٹھوں سے روح نکالنے اور اس کا تعلق ان تمام چیزوں سے کاﭨنے کا کام کرتے ہیں اور ملک الموت کی طرف نسبت کے معنی یہ ہیں کہ پھر آخر میں وہ روح قبض کرکے آسمانوں کی طرف لے جاتا ہے۔ (تفسير روح المعاني جلد 5، صفحة 5) حافظ ابن کثیر، امام شوکاﻧﯽ اور جمہور علماء اس بات کے قائل ہیں کہ ملک الموت ایک ہی ہے جیسا کہ سورۂ الم السجدۃ کی آیت سے اور مسند احمد (جلد 4، صفحہ 287) میں حضرت براء بن عازب (رضي الله عنه) کی حدیث سے معلوم ہوتا ہے اور جہاں جمع کے صیغے میں ان کا ذکر ہے تو وہ اس کے اعوان وانصار ہیں۔ اور بعض آثار میں ملک الموت کا نام عزرائیل بتلایا گیا ہے۔ (تفسير ابن كثير - الم السجدة ) والله أعلم-","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"thumma ruddū ilā al-lahi mawlāhumu al-ḥaqi alā lahu al-ḥuk'mu wahuwa asraʿu al-ḥāsibīna ","translations":["Then","they are returned","to","Allah","their Protector ","[the] True","Unquestionably","for Him","(is) the judgment","And He","(is) swiftest","(of) the Reckoners","(62)"],"transliterationArr":["thumma","ruddū","ilā","al-lahi","mawlāhumu","al-ḥaqi","alā","lahu","al-ḥuk'mu","wahuwa","asraʿu","al-ḥāsibīna",null],"verseTiming":[[1,0,4636],[2,4636,7158],[3,7158,7734],[4,7734,8455],[5,8455,9848],[6,9848,11114],[7,11114,11953],[8,11953,12561],[9,12561,13331],[10,13331,13989],[11,13989,14918],[12,14918,17739]]}}