{"name":"6:65","price":"آپ کہئے کہ اس پر بھی وہی قادر ہے کہ تم پر کوئی عذاب تمہارے اوپر سے بھیج دے(1) یا تمہارے پاؤں تلے سے(2) یا کہ تم کو گروه گروه کرکے سب کو بھڑا دے اور تمہارے ایک کو دوسرے کی لڑائی چکھا دے(3)۔ آپ دیکھیے تو سہی ہم کس طرح دﻻئل مختلف پہلوؤں سے بیان کرتے ہیں شاید وه سمجھ جائیں۔","arabic":"قُلۡ هُوَ ٱلۡقَادِرُ عَلَىٰٓ أَن يَبۡعَثَ عَلَيۡكُمۡ عَذَابٗا مِّن فَوۡقِكُمۡ أَوۡ مِن تَحۡتِ أَرۡجُلِكُمۡ أَوۡ يَلۡبِسَكُمۡ شِيَعٗا وَيُذِيقَ بَعۡضَكُم بَأۡسَ بَعۡضٍۗ ٱنظُرۡ كَيۡفَ نُصَرِّفُ ٱلۡأٓيَٰتِ لَعَلَّهُمۡ يَفۡقَهُونَ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":854,"juzNumber":7,"footnotes":"(1) یعنی آسمان سے، جیسے بارش کی کثرت، یا ہوا، پتھر کے ذریعے سے عذاب۔ یا امرا وحکام کی طرف سے ظلم وستم۔\n(2) جیسے دھنسایا جانا، طوفانی سیلاب، جس میں سب کچھ غرق ہوجائے۔ یا مراد ہے ماتحتوں، غلاموں اور نوکروں چاکروں کی طرف سے عذاب کہ وہ بددیانت اور خائن ہوجائیں۔\n(3) ”يَلْبِسَكُمْ“ أَيْ يَخْلُطَ أَمْرَكُمْ تمہارے معاملے کو غلط ملط یا مشتبہ کردے جس کی وجہ سے تم گروہوں اور جماعتوں میں بٹ جاوء۔ ”وَيُذِيقَ“: أَيْ يَقْتلُ بَعْضُكُمْ بَعْضًا فَتُذِيقَ كُلُّ طَائِفَةٍ الأُخْرَى أَلَمَ الْحَرْبِ۔ تمہارا ایک، دوسرے کو قتل کرے۔ اس طرح ہر گروہ دوسرے گروہ کو لڑائی کا مزہ چکھائے (ایسرالتفاسیر) حدیث میں آتا ہے نبی (صلى الله عليه وسلم) نے فرمایا کہ میں نے اللہ تعالیٰ سے تین دعائیں کیں۔۔ میری امت غرق کے ذریعے ہلاک نہ کی جائے۔ 2۔ قحط عام کے ذریعے اس کی تباہی نہ ہو۔ 3۔ آپس میں ان کی لڑائی نہ ہو۔ اللہ تعالیٰ نے پہلی دو دعائیں قبول فرمالیں۔ اور تیسری دعا سے مجھے روک دیا۔ (صحیح مسلم، نمبر 2216) یعنی اللہ تعالیٰ کے علم میں یہ بات تھی کہ امت محمدیہ میں اختلاف وَانْشِقاق واقع ہوگا اور اس کی وجہ اللہ کی نافرمانی اور قرآن وحدیث سے اعراض ہوگا جس کے نتیجے میں عذاب کی اس صورت سے امت محمدیہ بھی محفوظ نہ رہ سکے گی۔ گویا اس کا تعلق اس سنت اللہ سے ہے جو قوموں کے اخلاق وکردار کے بارے میں ہمیشہ رہی ہے۔ جس میں تبدیلی ممکن نہیں ”فَلَنْ تَجِدَ لِسُنَّةِ اللَّهِ تَبْدِيلا، وَلَنْ تَجِدَ لِسُنَّةِ اللَّهِ تَحْوِيلا“ (فاطر: 43)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qul huwa al-qādiru ʿalā an yabʿatha ʿalaykum ʿadhāban min fawqikum aw min taḥti arjulikum aw yalbisakum shiyaʿan wayudhīqa baʿḍakum basa baʿḍin unẓur kayfa nuṣarrifu al-āyāti laʿallahum yafqahūna ","translations":["Say","He","(is) All-Capable","[on]","to","send","upon you","punishment","from","above you","or","from","beneath","your feet","or","(to) confuse you","(into) sects","and make (you) taste ","some of you","violence","(of) others","See","how","We explain","the Signs","so that they may","understand","(65)"],"transliterationArr":["qul","huwa","al-qādiru","ʿalā","an","yabʿatha","ʿalaykum","ʿadhāban","min","fawqikum","aw","min","taḥti","arjulikum","aw","yalbisakum","shiyaʿan","wayudhīqa","baʿḍakum","basa","baʿḍin","unẓur","kayfa","nuṣarrifu","al-āyāti","laʿallahum","yafqahūna",null],"verseTiming":[[1,0,470],[2,470,880],[3,880,2030],[4,2030,3790],[5,3790,4010],[6,4010,5040],[7,5040,6710],[8,6710,7760],[9,7760,9460],[10,9460,10660],[11,10660,11070],[12,11070,12080],[13,12080,12780],[14,12780,14080],[15,14080,14470],[16,14470,15780],[17,15780,17630],[18,17630,18760],[19,18760,20850],[20,20850,21470],[21,21470,21980],[22,21980,23380],[23,23380,24140],[24,24140,25190],[25,25190,26590],[26,26590,27890],[27,27890,31015]]}}