{"name":"6:73","price":"اور وہی ہے جس نے آسمانوں اور زمین کو برحق پیدا کیا(1) اور(2) جس وقت اللہ تعالیٰ اتنا کہہ دے گا تو ہوجا بس وه ہو پڑے گا۔ اس کا کہنا حق اور بااﺛر ہے۔ اور ساری حکومت خاص اسی کی ہوگی جب کہ صُور میں پھونک ماری جائے گی(3) وه جاننے واﻻ ہے پوشیده چیزوں کا اور ﻇاہر چیزوں کا اور وہی ہے بڑی حکمت واﻻ پوری خبر رکھنے واﻻ۔","arabic":"وَهُوَ ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ بِٱلۡحَقِّۖ وَيَوۡمَ يَقُولُ كُن فَيَكُونُۚ قَوۡلُهُ ٱلۡحَقُّۚ وَلَهُ ٱلۡمُلۡكُ يَوۡمَ يُنفَخُ فِي ٱلصُّورِۚ عَٰلِمُ ٱلۡغَيۡبِ وَٱلشَّهَٰدَةِۚ وَهُوَ ٱلۡحَكِيمُ ٱلۡخَبِيرُ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":862,"juzNumber":7,"footnotes":"(1) حق کے ساتھ یا بافائدہ پیدا کیا، یعنی ان کو عبث اور بےفائدہ (کھیل کود کے طور پر) پیدا نہیں کیا، بلکہ ایک خاﺹ مقصد کے لئے کائنات کی تخلیق فرمائی ہے اور وہ یہ کہ اس اللہ کو یاد رکھا اور اس کا شکر ادا کیا جائے جس نے یہ سب کچھ بنایا۔\n(2) ”يَوْمَ“ فعل محذوف وَاذْكُر یا وَاتَّقُوا کی وجہ سے منصوب ہے۔ یعنی اس دن کو یاد کرو یا اس دن سے ڈرو! کہ اس کے لفظ کن (ہوجا) سے وہ جو چاہے گا، ہوجائے گا۔ یہ اشارہ ہے اس بات کی طرف کہ حساب کتاب کے کٹھن مراحل بھی بڑی سرعت کے ساتھ طے ہوجائیں گے۔ لیکن کن کے لئے؟ ایمان داروں کے لئے۔ دوسروں کو تو یہ دن ہزار سال یا پچاس ہزار سال کی طرح بھاری لگے گا۔\n(3) ”صُورٌ“ سے مراد وہ نرسنگا یا بگل ہے جس کے متعلق حدیث میں آتا ہے کہ ”اسرافیل اسے منہ میں لئے اور اپنی پیشانی جھکائے، حکم الہیٰ کے منتظر کھڑے ہیں کہ جب انہیں کہا جائے تو اس میں پھونک دیں“۔ (ابن کثیر) ابوداود اور ترمذی میں ہے ”الصور قرن ينفخ فيه“ (نمبر 474۔ 4030 ،344) ”صور ایک قرن (نرسنگا) ہے جس میں پھونکا جائے گا“ بعض علماء کے نزدیک تین نفخے ہوں گے، نَفْخَةُ الصَّعْقِ (جس سے تمام لوگ بےہوش ہو جائیں گے) نَفْخَةُ الفَنَاءِ جس سے تمام لوگ فنا ہوجائیں گے۔ نَفْخَةُ الإِنْشَاءِ جس سے تمام انسان دوبارہ زندہ ہوجائیں گے۔ بعض علماء آخری دو نفخوں کے ہی قائل ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wahuwa alladhī khalaqa al-samāwāti wal-arḍa bil-ḥaqi wayawma yaqūlu kun fayakūnu qawluhu al-ḥaqu walahu al-mul'ku yawma yunfakhu fī al-ṣūri ʿālimu al-ghaybi wal-shahādati wahuwa al-ḥakīmu al-khabīru ","translations":["And (it is) He","Who","created","the heavens","and the earth","in truth","And (the) Day","He says","Be","and it is","His word","(is) the truth","And for Him","(is) the Dominion","(on the) Day","will be blown","in","the trumpet","(He is) All-Knower","(of) the unseen","and the seen","And He","(is) the All-Wise","the All-Aware","(73)"],"transliterationArr":["wahuwa","alladhī","khalaqa","al-samāwāti","wal-arḍa","bil-ḥaqi","wayawma","yaqūlu","kun","fayakūnu","qawluhu","al-ḥaqu","walahu","al-mul'ku","yawma","yunfakhu","fī","al-ṣūri","ʿālimu","al-ghaybi","wal-shahādati","wahuwa","al-ḥakīmu","al-khabīru",null],"verseTiming":[[1,0,670],[2,670,1550],[3,1550,2160],[4,2160,3810],[5,3810,4910],[6,4910,6470],[7,6470,7210],[8,7210,8230],[9,8230,9330],[10,9330,11980],[11,11980,12780],[12,12780,14090],[13,14090,14690],[14,14690,15580],[15,15580,16290],[16,16290,17980],[17,17980,18210],[18,18210,21230],[19,21230,22020],[20,22020,23190],[21,23190,24790],[22,24790,25850],[23,25850,27000],[24,27000,30665]]}}