{"name":"6:78","price":"پھر جب آفتاب کو دیکھا چمکتا ہوا تو فرمایا کہ(1) یہ میرا رب ہے یہ تو سب سے بڑا ہے پھر جب وه بھی غروب ہوگیا تو آپ نے فرمایا بےشک میں تمہارے شرک سے بیزار ہوں۔(2)","arabic":"فَلَمَّا رَءَا ٱلشَّمۡسَ بَازِغَةٗ قَالَ هَٰذَا رَبِّي هَٰذَآ أَكۡبَرُۖ فَلَمَّآ أَفَلَتۡ قَالَ يَٰقَوۡمِ إِنِّي بَرِيٓءٞ مِّمَّا تُشۡرِكُونَ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":867,"juzNumber":7,"footnotes":"(1) ”شَمْسٌ“ (سورج) عربی میں مونث ہے۔ لیکن اسم اشارہ مذکر ہے۔ مراد الطالع ہے یعنی یہ طلوع ہونے والا سورج، میرا رب ہے۔ کیونکہ یہ سب سے بڑا ہے۔ جس طرح کہ سورﺝ پرستوں کو مغالطہ لگا اور وہ اس کی پرستش کرتے ہیں۔ (اجرام سماویہ میں سورج سب سے بڑا اور سب سے زیادہ روشن ہے اور انسانی زندگی کے بقا ووجود کے لئے اس کی اہمیت وافادیت محتاج وضاحت نہیں۔ اسی لئے مظاہر پرستوں میں سورج کی پرستش عام رہی ہے حضرت ابراہیم (عليه السلام) نے نہایت لطیف پیرائے میں چاند سورج کے پجاریوں پر ان کے معبودوں کی بے حیثیتی کو واضح فرمایا۔\n(2) یعنی ان تمام چیزوں سے، جن کو تم اللہ کا شریک بناتے ہو اور جن کی عبادت کرتے ہو، میں بیزار ہوں۔ اس لئے کہ ان میں تبدیلی آتی رہتی ہے، کبھی طلوع ہوتے، کبھی غروب ہوتے ہیں، جو اس بات کی دلیل ہے کہ یہ مخلوق ہیں اور ان کا خالق کوئی اور ہے جس کے حکم کے یہ تابع ہیں۔ جب یہ خود مخلوق اور کسی کے تابع ہیں تو کسی کو نفع نقصان پہنچانے پر کس طرح قادر ہوسکتے ہیں؟ مشہور ہے کہ اس وقت کے بادشاہ نمرود نے اپنے ایک خواب اور کاہنوں کی تعبیر کی وجہ سے نو مولود لڑکوں کو قتل کرنے کا حکم دے رکھا تھا، حضرت ابراہیم (عليه السلام) بھی ان ہی ایام میں پیدا ہوئے جس کی وجہ سے انہیں ایک غار میں رکھا گیا تاکہ نمرود اور اس کے کارندوں کے ہاتھوں قتل ہونے سے بچ جائیں۔ وہیں غار میں جب کچھ شعور آیا اور چاند سورﺝ دیکھے تو یہ تاثرات ظاہر فرمائے، لیکن یہ غار والی بات مستند نہیں ہے۔ قرآن کے الفاظ سے معلوم ہوتا ہے کہ قوم سے گفتگو اور مکالمے کے وقت حضرت ابراہیم (عليه السلام) نے یہ باتیں کی ہیں، اسی لئے آخر میں قوم سے خطاب کرکے فرمایا کہ میں تمہارے ٹھہرائے ہوئے شریکوں سے بیزار ہوں۔ اور مقصد اس مکالمے سے معبودان باطل کی اصل حقیقت کی وضاحت تھی۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"falammā raā al-shamsa bāzighatan qāla hādhā rabbī hādhā akbaru falammā afalat qāla yāqawmi innī barīon mimmā tush'rikūna ","translations":["When","he saw","the sun","rising","he said","This (is)","my Lord","this (is)","greater","But when","it set","he said","O my people","Indeed, I am","free","of what","you associate (with Allah)","(78)"],"transliterationArr":["falammā","raā","al-shamsa","bāzighatan","qāla","hādhā","rabbī","hādhā","akbaru","falammā","afalat","qāla","yāqawmi","innī","barīon","mimmā","tush'rikūna",null],"verseTiming":[[1,0,1690],[2,1690,2130],[3,2130,2950],[4,2950,4870],[5,4870,5620],[6,5620,6340],[7,6340,7260],[8,7260,10010],[9,10010,11350],[10,11350,14620],[11,14620,15420],[12,15420,16030],[13,16030,17110],[14,17110,18440],[15,18440,20790],[16,20790,23370],[17,23370,26195]]}}