{"name":"6:8","price":"اور یہ لوگ یوں کہتے ہیں کہ ان کے پاس کوئی فرشتہ کیوں نہیں اتارا گیا اور اگر ہم کوئی فرشتہ بھیج دیتے تو سارا قصہ ہی ختم ہوجاتا۔ پھر ان کو ذرا مہلت نہ دی جاتی۔","arabic":"وَقَالُواْ لَوۡلَآ أُنزِلَ عَلَيۡهِ مَلَكٞۖ وَلَوۡ أَنزَلۡنَا مَلَكٗا لَّقُضِيَ ٱلۡأَمۡرُ ثُمَّ لَا يُنظَرُونَ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":797,"juzNumber":7,"footnotes":"(1) اللہ تعالیٰ نے انسانوں کو ہدایت ورہنمائی کے لئے جتنے بھی انبیا ورسل بھیجے وہ انسانوں میں سے ہی تھے اور ہر قوم میں اسی کے ایک فرد کو وحی ورسالت سے نواز دیا جاتا تھا۔ یہ اس لئے کہ اس کے بغیر کوئی رسول فریضۂ تبلیغ ودعوت ادا ہی نہیں کرسکتا تھا، مثلاً اگر فرشتوں کو اللہ تعالیٰ رسول بنا کر بھیجتا تو ایک تو وہ انسانی زبان میں گفتگو ہی نہ کر پاتے دوسرے وہ انسانی جذبات سے عاری ہونے کی وجہ سے انسان کے مختلف حالات میں مختلف کیفیات وجذبات کے سمجھنے سے بھی قاصر رہتے۔ ایسی صورت میں ہدایت ورہنمائی کا فریضہ کس طرح انجام دے سکتے تھے؟ اس لئے اللہ تعالیٰ کا انسانوں پر ایک بڑا احسان ہے کہ اس نے انسانوں کو ہی نبی اور رسول بنایا۔ چنانچہ اللہ تعالیٰ نے بھی اسے بطور احسان ہی قرآن کریم میں ذکر فرمایا ہے «لَقَدْ مَنَّ اللَّهُ عَلَى الْمُؤْمِنِينَ إِذْ بَعَثَ فِيهِمْ رَسُولا مِنْ أَنْفُسِهِمْ» (آل عمران: 164) ”اللہ تعالیٰ نے مومنوں پر احسان فرمایا جب کہ انہی کی جانوں میں سے ایک شخص کو رسول بنا کر بھیجا“۔ لیکن پیغمبروں کی بشریت کافروں کے لئے حیرت واستعجاب کا باعث رہی۔ وہ سمجھتے تھے کہ رسول انسانوں میں سے نہیں، فرشتوں میں سے ہونا چاہیئے گویا ان کے نزدیک بشریت رسالت کے شایان شان نہیں تھی۔ جیسا کہ آج کل کے اہل بدعت بھی یہی سمجھتے ہیں۔ «تَشَابَهَتْ قُلُوبُهُمْ» اہل کفر وشرک، رسولوں کی بشریت کا تو انکار کر نہیں سکتے تھے، کیونکہ وہ ان کے خاندان، حسب نسب ہر چیز سے واقف ہوتے تھے لیکن رسالت کا وہ انکار کردیتے رہے۔ جبکہ آج کل کے اہل بدعت رسالت کا انکار تو نہیں کرتے لیکن بشریت کو رسالت کے منافی سمجھنے کی وجہ سے رسولوں کی بشریت کا انکار کرتے ہیں۔ بہرحال اللہ تعالیٰ اس آیت میں فرما رہا ہے کہ اگر ہم کافروں کے مطالبے پر کسی فرشتے کو رسول بنا کر بھیجتے یا اس رسول کی تصدیق کے لئے ہم کوئی فرشتہ نازل کردیتے (جیسا کہ یہاں یہی بات بیان کی گئی ہے) اور پھر وہ اس پر ایمان نہ لاتے توانہیں مہلت دیئے بغیر ہلاک کردیا جاتا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waqālū lawlā unzila ʿalayhi malakun walaw anzalnā malakan laquḍiya al-amru thumma lā yunẓarūna ","translations":["And they said","Why has not been","sent down","to him","an Angel","And if","We (had) sent down","an Angel","surely (would) have been decided","the matter","then","no","respite would have been granted to them","(8)"],"transliterationArr":["waqālū","lawlā","unzila","ʿalayhi","malakun","walaw","anzalnā","malakan","laquḍiya","al-amru","thumma","lā","yunẓarūna",null],"verseTiming":[[1,0,1120],[2,1120,3410],[3,3410,4960],[4,4960,5850],[5,5850,6530],[6,6530,7420],[7,7420,9390],[8,9390,10010],[9,10010,11010],[10,11010,11820],[11,11820,13380],[12,13380,13700],[13,13700,15035]]}}