{"name":"6:84","price":"اور ہم نے ان کو اسحاق دیا اور یعقوب(1) ہر ایک کو ہم نے ہدایت کی اور پہلے زمانہ میں ہم نے نوح کو ہدایت کی اور ان کی اوﻻد میں سے(2) داؤد کو اور سلیمان کو اور ایوب کو اور یوسف کو اور موسیٰ کو اور ہارون کو اور اسی طرح ہم نیک کام کرنے والوں کو جزا دیا کرتے ہیں۔","arabic":"وَوَهَبۡنَا لَهُۥٓ إِسۡحَٰقَ وَيَعۡقُوبَۚ كُلًّا هَدَيۡنَاۚ وَنُوحًا هَدَيۡنَا مِن قَبۡلُۖ وَمِن ذُرِّيَّتِهِۦ دَاوُۥدَ وَسُلَيۡمَٰنَ وَأَيُّوبَ وَيُوسُفَ وَمُوسَىٰ وَهَٰرُونَۚ وَكَذَٰلِكَ نَجۡزِي ٱلۡمُحۡسِنِينَ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":873,"juzNumber":7,"footnotes":"(1) یعنی بڑھاپے میں، جب کہ وہ اولاد سے ناامید ہوگئے تھے، جیسا کہ سورۂ ہود،آیت 73،72 میں ہے، پھر بیٹے کے ساتھ ایسے پوتے کی بھی بشارت دی جو یعقوب (عليه السلام) ہوگا، جس کے معنی میں یہ مفہوم شامل ہے کہ اس کے بعد ان کی اولاد کا سلسلہ چلے گا، اس لئے کہ یہ عقب (پیچھے) سے مشتق ہے۔\n(2) ”ذُرِّيَّتِهِ“ میں ضمیر کا مرجع بعض مفسرین نے حضرت نوح (عليه السلام) کو قرار دیا ہے کیونکہ وہی اقرب ہیں۔ یعنی حضرت نوح (عليه السلام) کی اولاد میں سے داود اور سلیمان علیہما السلام کو۔ اور بعض نے حضرت ابراہیم (عليه السلام) کو۔ اس لئے کہ ساری گفتگو ان ہی کے ضمن میں ہو رہی ہے۔ لیکن اس صورت میں یہ اشکال پیش آتا ہے کہ پھر لوط (عليه السلام) کا ذکر اس فہرست میں نہیں آنا چاہیئے تھا کیونکہ وہ ذریت ابراہیم (عليه السلام) میں سے نہیں ہیں۔ وہ ان کے بھائی ہاران بن آزر کے بیٹے یعنی ابراہیم (عليه السلام) کے بھتیجے ہیں۔ اور ابراہیم (عليه السلام) ، لوط (عليه السلام) کے باپ نہیں، چچا ہیں۔ لیکن بطور تغلیب انہیں بھی ذریت ابراہیم (عليه السلام) میں شمار کر لیا گیا ہے۔ اس کی ایک اور مثال قرآن مجید میں ہے۔ جہاں حضرت اسماعیل (عليه السلام) کو اولاد یعقوب (عليه السلام) کے آبا میں شمار کیا گیا ہے جب کہ وہ ان کے چچا تھے۔ (دیکھیے سورۂ بقرۃ آیت 133)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wawahabnā lahu is'ḥāqa wayaʿqūba kullan hadaynā wanūḥan hadaynā min qablu wamin dhurriyyatihi dāwūda wasulaymāna wa-ayyūba wayūsufa wamūsā wahārūna wakadhālika najzī al-muḥ'sinīna ","translations":["And We bestowed","to him","Isaac","and Yaqub","all","We guided","And Nuh","We guided","from","before","and of","his descendents","Dawood","and Sulaiman","and Ayyub","and Yusuf","and Musa","and Harun","And thus","We reward","the good-doers","(84)"],"transliterationArr":["wawahabnā","lahu","is'ḥāqa","wayaʿqūba","kullan","hadaynā","wanūḥan","hadaynā","min","qablu","wamin","dhurriyyatihi","dāwūda","wasulaymāna","wa-ayyūba","wayūsufa","wamūsā","wahārūna","wakadhālika","najzī","al-muḥ'sinīna",null],"verseTiming":[[1,0,1340],[2,1340,3210],[3,3210,4360],[4,4360,7270],[5,7270,8390],[6,8390,9510],[7,9510,10970],[8,10970,12080],[9,12080,13320],[10,13320,13650],[11,13650,15530],[12,15530,17130],[13,17130,18200],[14,18200,19640],[15,19640,20920],[16,20920,21970],[17,21970,22950],[18,22950,26030],[19,26030,27250],[20,27250,27900],[21,27900,31145]]}}