{"name":"6:91","price":"اور ان لوگوں نے، اللہ کی جیسی قدر کرنا واجب تھی ویسی قدر نہ کی جب کہ یوں کہہ دیا کہ اللہ نے کسی بشر پر کوئی چیز نازل نہیں کی(1) آپ یہ کہیئے کہ وه کتاب کس نے نازل کی ہے جس کو موسیٰ ﻻئے تھے جس کی کیفیت یہ ہے کہ وه نور ہے اور لوگوں کے لئے وه ہدایت ہے جس کو تم نے ان متفرق اوراق میں رکھ چھوڑا(2) ہے جن کو ﻇاہر کرتے ہو اور بہت سی باتوں کو چھپاتے ہو اور تم کو بہت سی ایسی باتیں بتائی گئی ہیں جن کو تم نہ جانتے تھے اور نہ تمہارے بڑے(3)۔ آپ کہہ دیجیئے کہ اللہ نے نازل فرمایا ہے(4) پھر ان کو ان کے خرافات میں کھیلتے رہنے دیجیئے۔","arabic":"وَمَا قَدَرُواْ ٱللَّهَ حَقَّ قَدۡرِهِۦٓ إِذۡ قَالُواْ مَآ أَنزَلَ ٱللَّهُ عَلَىٰ بَشَرٖ مِّن شَيۡءٖۗ قُلۡ مَنۡ أَنزَلَ ٱلۡكِتَٰبَ ٱلَّذِي جَآءَ بِهِۦ مُوسَىٰ نُورٗا وَهُدٗى لِّلنَّاسِۖ تَجۡعَلُونَهُۥ قَرَاطِيسَ تُبۡدُونَهَا وَتُخۡفُونَ كَثِيرٗاۖ وَعُلِّمۡتُم مَّا لَمۡ تَعۡلَمُوٓاْ أَنتُمۡ وَلَآ ءَابَآؤُكُمۡۖ قُلِ ٱللَّهُۖ ثُمَّ ذَرۡهُمۡ فِي خَوۡضِهِمۡ يَلۡعَبُونَ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":880,"juzNumber":7,"footnotes":"(1) قَدَرٌکے معنی اندازہ کرنے کے ہیں اور یہ کسی چیز کی اصل حقیقت جاننے اور اس کی معرفت حاصل کرنے کے معنی میں استعمال ہوتا ہے۔ مطلب یہ ہے کہ یہ مشرکین مکہ ارسال رسل اور انزال کتب کا انکار کرتے ہیں، جس کے صاف معنی یہ ہیں کہ انہیں اللہ کی صحیح معرفت ہی حاصل نہیں ورنہ وہ ان چیزوں کا انکار نہ کرتے۔ علاوہ ازیں اسی عدم معرفت الٰہی کی وجہ سے وہ نبوت و رسالت کی معرفت سے بھی قاصر رہے اور یہ سمجھتے رہے کہ کسی انسان پر اللہ کا کلام کس طرح نازل ہوسکتا ہے؟ جس طرح دوسرے مقام پر اللہ تعالیٰ نے فرمایا «أَكَانَ لِلنَّاسِ عَجَبًا أَنْ أَوْحَيْنَا إِلَى رَجُلٍ مِنْهُمْ أَنْ أَنْذِرِ النَّاسَ» (يونس:20) ”کیا یہ بات لوگوں کے لئے باعث تعجب ہے کہ ہم نے ان ہی میں سے ایک آدمی پر وحی نازل کرکے اسے لوگوں کو ڈرانے پر مامور کر دیا ہے؟“ دوسرے مقام پر فرمایا «وَمَا مَنَعَ النَّاسَ أَنْ يُؤْمِنُوا إِذْ جَاءَهُمُ الْهُدَى إِلا أَنْ قَالُوا أَبَعَثَ اللَّهُ بَشَرًا رَسُولا» (بني إسرائيل: 94) ”ہدایت آجانے کے بعد لوگ اسے قبول کرنے سے اس لئے رک گئے کہ انہوں نے کہا کہ کیا اللہ نے ایک بشر کو رسول بنا کر بھیج دیا ہے؟“ اس کی کچھ تفصیل اس سے قبل آیت نمبر 8 کے حاشیے میں بھی گزرچکی ہے۔ آیت زیر وضاحت میں بھی انہوں نے اپنے اسی خیال کی بنیاد پر اس بات کی نفی کی کہ اللہ تعالیٰ نے کسی انسان پر کوئی کتاب نازل کی ہے۔ اللہ تعالیٰ نے فرمایا کہ اگر ایسی بات ہے تو ان سے پوچھو! موسیٰ (عليه السلام) پر تورات کس نے نازل کی تھی؟ (جس کو یہ بھی مانتے ہیں)\n(2) آیت کی مذکورہ تفسیر کے مطابق اب یہود سے خطاب کرکے کہا جا رہا ہے کہ تم اس کتاب کو متفرق اوراق میں رکھتے ہو جن میں سے جس کو چاہتے ہو، ظاہر کردیتے ہو اور جن کو چاہتے ہو، چھپا لیتے ہو۔ جیسے رجم کا مسئلہ یا نبی (صلى الله عليه وسلم) کی صفات کا مسئلہ ہے۔ حافظ ابن کثیر اور امام ابن جریر طبری وغیرہ نے: ”يَجْعَلُونَهُ“، اور ”يُبْدُونَهَا“ صیغہ غائب کے ساتھ والی قرات کو ترجیح دی ہے اور دلیل یہ دی ہے کہ یہ مکی آیت ہے، اس میں یہود سے خطاب کس طرح ہوسکتا ہے؟ اور بعض مفسرین نے پوری آیت کو ہی یہود سے متعلق قرار دیا ہے اور اس میں سرے سے نبوت ورسالت کا جو انکار ہے اسے یہود کی ہٹ دھرمی، ضد اور عناد پر مبنی قول قرار دیا ہے۔ گویا اس آیت کی تفسیر میں مفسرین کی تین رائے ہیں۔ ایک پوری آیت کو یہود سے، دوسرے پوری آیت کو مشرکین سے متعلق اور تیسرے آیت کے ابتدائی حصے کو مشرکین سے متعلق اور ”تَجْعَلُونَهُ“ سے یہود سے متعلق قرار دیتے ہیں۔وَاللهُ أَعْلَمُ.\n(3) یہود سے متعلق ماننے کی صورت میں اس کی تفسیر ہوگی کہ تورات کے ذریعے سے تمہیں بتائی گئیں، بصورت دیگر قرآن کے ذریعے سے۔\n(4) یہ ”مَنْ أَنْزَلَ“ (کس نے اتارا) کا جواب ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wamā qadarū al-laha ḥaqqa qadrihi idh qālū mā anzala al-lahu ʿalā basharin min shayin qul man anzala al-kitāba alladhī jāa bihi mūsā nūran wahudan lilnnāsi tajʿalūnahu qarāṭīsa tub'dūnahā watukh'fūna kathīran waʿullim'tum mā lam taʿlamū antum walā ābāukum quli al-lahu thumma dharhum fī khawḍihim yalʿabūna ","translations":["And not","they appraised","Allah","(with) true","[of his] appraisal","when","they said","Not","revealed","(by) Allah","on","a human being","[of]","anything","Say","Who","revealed","the Book","which","brought","[it]","Musa","(as) a light","and guidance","for the people","You make it","(into) parchments","you disclose (some of) it","and you conceal","much (of it)","And you were taught","what","not","knew","you","and not","your forefathers","Say","Allah (revealed it)","Then","leave them","in","their discourse ","playing","(91)"],"transliterationArr":["wamā","qadarū","al-laha","ḥaqqa","qadrihi","idh","qālū","mā","anzala","al-lahu","ʿalā","basharin","min","shayin","qul","man","anzala","al-kitāba","alladhī","jāa","bihi","mūsā","nūran","wahudan","lilnnāsi","tajʿalūnahu","qarāṭīsa","tub'dūnahā","watukh'fūna","kathīran","waʿullim'tum","mā","lam","taʿlamū","antum","walā","ābāukum","quli","al-lahu","thumma","dharhum","fī","khawḍihim","yalʿabūna",null],"verseTiming":[[1,0,700],[2,700,1340],[3,1340,2180],[4,2180,2800],[5,2800,5500],[6,5500,5940],[7,5940,6760],[8,6760,7480],[9,7480,9150],[10,9150,10090],[11,10090,10480],[12,10480,11360],[13,11360,11990],[14,11990,12630],[15,12630,15190],[16,15190,17510],[17,17510,17920],[18,17920,18320],[19,18320,19980],[20,19980,20960],[21,20960,21840],[22,21840,24630],[23,24630,25210],[24,25210,26080],[25,26080,27430],[26,27430,28000],[27,28000,32130],[28,32130,34020],[29,34020,35330],[30,35330,36830],[31,36830,37940],[32,37940,39720],[33,39720,41100],[34,41100,42150],[35,42150,42510],[36,42510,44910],[37,44910,46570],[38,46570,48820],[39,48820,52950],[40,52950,53300],[41,53300,54110],[42,54110,55170],[43,55170,56140],[44,56140,56450],[45,56450,57470],[46,57470,60645]]}}