{"name":"6:95","price":"بےشک اللہ تعالیٰ دانہ کو اور گٹھلیوں کو پھاڑنے واﻻ ہے(1) ، وه جاندار کو بے جان سے نکال ﻻتا ہے(2) اور وه بے جان کو جاندار سے نکالنے واﻻ ہے(3) اللہ تعالیٰ یہ ہے، سو تم کہاں الٹے چلے جا رہے ہو۔","arabic":"۞ إِنَّ ٱللَّهَ فَالِقُ ٱلۡحَبِّ وَٱلنَّوَىٰۖ يُخۡرِجُ ٱلۡحَيَّ مِنَ ٱلۡمَيِّتِ وَمُخۡرِجُ ٱلۡمَيِّتِ مِنَ ٱلۡحَيِّۚ ذَٰلِكُمُ ٱللَّهُۖ فَأَنَّىٰ تُؤۡفَكُونَ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":884,"juzNumber":7,"footnotes":"(1) یہاں سے اللہ تعالیٰ کی بےمثل قدرت اور کاریگری کا بیان شروع ہو رہا ہے۔ فرمایا:۔ اللہ تعالیٰ دانے (حب) اور گٹھلی (نواة، جمع نوى) کو، جسے کاشت کار زمین کی تہہ میں دبا دیتا ہے، پھاڑ کر اس سے انواع واقسام کے درخت پیدا فرماتا ہے۔ زمین ایک ہوتی ہے، پانی بھی، جس سے کھیتیاں سیراب ہوتی ہیں، ایک ہی ہوتا ہے، لیکن جس جس چیز کے وہ دانے یا گٹھلیاں ہوتی ہیں۔ اس کے مطابق ہی اللہ تعالیٰ مختلف قسم کے غلوں اور پھلوں کے درخت ان سے پیدا فرما دیتا ہے۔ کیا اللہ تعالیٰ کے سوا بھی، کوئی ہے، جو یہ کام کرتا ہو یا کرسکتا ہو؟ (2) یعنی دانے اور گٹھلیوں سے درخت اگا دیتا ہے جس میں زندگی ہوتی ہے اور وہ بڑھتا، پھیلتا اور پھل یا غلہ دیتا ہے یا وہ خوشبودار، رنگ برنگ کے پھول ہوتے ہیں جن کو دیکھ یا سونگھ کر انسان فرحت وانبساط محسوس کرتا یا نطفے اور انڈے سے انسان اور حیوانات پیدا کرتا ہے۔\n(3) یعنی حیوانات سے انڈے، جو مردہ کے حکم میں ہیں۔ حی اور میت کی تعبیر مومن اور کافر سے بھی کی گئی ہے، یعنی مومن کے گھر میں کافر اور کافر کے گھر میں مومن پیدا کردیتا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"inna al-laha fāliqu al-ḥabi wal-nawā yukh'riju al-ḥaya mina al-mayiti wamukh'riju al-mayiti mina al-ḥayi dhālikumu al-lahu fa-annā tu'fakūna ","translations":["Indeed","Allah","(is the) Cleaver","(of) the grain","and the date-seed","He brings forth","the living","from","the dead","and brings forth","the dead","from","the living","That","(is) Allah","so how","are you deluded","(95)"],"transliterationArr":["inna","al-laha","fāliqu","al-ḥabi","wal-nawā","yukh'riju","al-ḥaya","mina","al-mayiti","wamukh'riju","al-mayiti","mina","al-ḥayi","dhālikumu","al-lahu","fa-annā","tu'fakūna",null],"verseTiming":[[1,0,1380],[2,1380,2330],[3,2330,3200],[4,3200,4090],[5,4090,5900],[6,5900,7300],[7,7300,8170],[8,8170,8500],[9,8500,9610],[10,9610,10580],[11,10580,11690],[12,11690,12060],[13,12060,12620],[14,12620,14470],[15,14470,17730],[16,17730,19570],[17,19570,22685]]}}