{"name":"70:6","price":"بیشک یہ اس (عذاب) کو دور سمجھ رہے ہیں.","arabic":"إِنَّهُمۡ يَرَوۡنَهُۥ بَعِيدٗا","category":["70 (Al-Ma'arij)","Al-Ma'arij","Surah Al-Ma'arij","Chapter Al-Ma'arij","Ma'arij","Surah Ma'arij","Chapter Ma'arij","Al Ma'arij","Surah Al Ma'arij","Chapter Al Ma'arij","Surah 70","Chapter 70","The Ascending Stairways","المعارج"],"ayahNumber":5381,"juzNumber":29,"footnotes":"(1) اس یوم کی تعریف میں بہت اختلاف ہے جیسا کہ الم سجدہ کے آغاز میں ہم بیان کر آئے ہیں۔ یہاں امام ابن کثیر نے چار اقوال نقل فرمائےہیں۔ پہلا قول ہے کہ اس سے وہ مسافت مراد ہے جو عرش عظیم سے اسفل سافلین (زمین کے ساتویں طبقے) تک ہے۔ یہ مسافت 50 ہزار سال میں طے ہونے والی ہے۔ دوسرا قول ہے کہ یہ دنیا کی کل مدت ہے۔ ابتدائے آفرینش سے وقوع قیامت تک، اس میں سے کتنی مدت گزر گئی اور کتنی باقی ہے، اسے صرف اللہ تعالیٰ جانتا ہے۔ تیسرا قول ہے کہ یہ دنیا و آخرت کے درمیان فاصلہ ہے۔ چوتھا قول یہ ہے کہ یہ قیامت کے دن کی مقدار ہے۔ یعنی کافروں پر یہ یوم حساب پچاس ہزار سال کی طرح بھاری ہوگا۔ لیکن مومن کے لئے دنیا میں ایک فرض نماز پڑھنے سے بھی مختصر ہوگا۔ (مسند احمد، 3/75) امام ابن کثیر نے اسی قول کو ترجیح دی ہے کیوں کہ احادیث سے بھی اس کی تائید ہوتی ہے۔ چنانچہ ایک حدیث میں زکوٰۃ ادا نہ کرنے والے کو قیامت والے دن جو عذاب دیا جائے گا اس کی تفصیل بیان فرماتے ہوئے رسول اللہ (صلى الله عليه وسلم) نے فرمایا: «حَتَّى يَحْكُمَ اللَّهُ بَيْنَ عِبَادِهِ فِى يَوْمٍ كَانَ مِقْدَارُهُ خَمْسِينَ أَلْفَ سَنَةٍ مِمَّا تَعُدُّونَ»۔ (صحیح مسلم، کتاب الزکوٰۃ، باب اثم مانع الزکوٰۃ)، ”یہاں تک کہ اللہ اپنے بندوں کے درمیان فیصلہ فرمائے گا، ایسے دن میں، جس کی مدت تمہاری گنتی کے مطابق پچاس ہزار سال ہوگی“۔ اس تفسیر کی رو سے فی یوم کا تعلق عذاب سے ہوگا، یعنی وہ واقع ہونے والا عذاب قیامت والے دن ہوگا جو کافروں پر پچاس ہزار سال کی طرح بھاری ہوگا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"innahum yarawnahu baʿīdan ","translations":["Indeed, they","see it","(as) far off","(6)"],"transliterationArr":["innahum","yarawnahu","baʿīdan",null],"verseTiming":[[1,0,1680],[2,1680,2910],[3,2910,4165]]}}