{"name":"71:23","price":"اور کہا انہوں نے کہ ہرگز اپنے معبودوں کو نہ چھوڑنا اور نہ ود اور سواع اور یغوث اور یعوق اور نسر کو (چھوڑنا).(1)","arabic":"وَقَالُواْ لَا تَذَرُنَّ ءَالِهَتَكُمۡ وَلَا تَذَرُنَّ وَدّٗا وَلَا سُوَاعٗا وَلَا يَغُوثَ وَيَعُوقَ وَنَسۡرٗا","category":["71 (Nuh)","Nuh","Surah Nuh","Chapter Nuh","Surah 71","Chapter 71","Noah","نوح"],"ayahNumber":5442,"juzNumber":29,"footnotes":"(1) یہ قوم نوح (عليه السلام) کے وہ لوگ تھے جن کی وہ عبادت کرتے تھے اور ان کی اتنی شہرت ہوئی کہ عرب میں بھی ان کی پوجا ہوتی رہی، چنانچہ ود دومة الجندل میں قبیلہ کلب کا، سواع ساحل بحر کے قبیلہ ھذیل کا، یغوث سبا کے قریب جرف جگہ میں مراد اور بنی غطیف کا، یعوق، ہمدان قبیلے کا اور نسر، حمیر قبیلہ ذوالکلاع کا معبود رہا۔ (ابن کثیرو فتح القدیر) یہ پانچوں قوم نوح (عليه السلام) کے نیک آدمیوں کے نام تھے، جب یہ مر گئے تو شیطان نے ان کے عقیدت مندوں کو کہا کہ ان کی تصوریں بنا کر تم اپنے گھروں اور دکانوں میں رکھ لو تاکہ ان کی یاد تازہ رہے اور ان کے تصور سے تم بھی ان کی طرح نیکیاں کرتے رہو، جب یہ تصویریں بنا کر رکھنے والے فوت ہوگئے تو شیطان نے ان کی نسلوں کو یہ کہہ کر کہ شرک میں ملوث کر دیا کہ تمہارے آباء تو ان کی عبادت کرتے تھے جن کی تصویریں تمہارے گھروں میں لٹک رہی ہیں چنانچہ انہوں نے ان کی پوجا شروع کر دی (صحیح بخاری، تفسیر سورة نوح)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waqālū lā tadharunna ālihatakum walā tadharunna waddan walā suwāʿan walā yaghūtha wayaʿūqa wanasran ","translations":["And they said","(Do) not","leave","your gods","and (do) not","leave","Wadd","and not","Suwa","and not","Yaguth","and Yauq","and Nasr","(23)"],"transliterationArr":["waqālū","lā","tadharunna","ālihatakum","walā","tadharunna","waddan","walā","suwāʿan","walā","yaghūtha","wayaʿūqa","wanasran",null],"verseTiming":[[1,0,950],[2,950,1290],[3,1290,2860],[4,2860,4200],[5,4200,4720],[6,4720,6190],[7,6190,6930],[8,6930,7890],[9,7890,9110],[10,9110,9990],[11,9990,10850],[12,10850,11860],[13,11860,13415]]}}