{"name":"72:17","price":"تاکہ ہم اس میں انہیں آزمالیں(1) ، اور جو شخص اپنے پروردگار کے ذکر سے منھ پھیر لے گا تو اللہ تعالیٰ اسے سخت عذاب میں مبتلا کردے گا.(2)","arabic":"لِّنَفۡتِنَهُمۡ فِيهِۚ وَمَن يُعۡرِضۡ عَن ذِكۡرِ رَبِّهِۦ يَسۡلُكۡهُ عَذَابٗا صَعَدٗا","category":["72 (Al-Jinn)","Al-Jinn","Surah Al-Jinn","Chapter Al-Jinn","Jinn","Surah Jinn","Chapter Jinn","Al Jinn","Surah Al Jinn","Chapter Al Jinn","Surah 72","Chapter 72","The Jinn","الجن"],"ayahNumber":5464,"juzNumber":29,"footnotes":"(1) أَنْ لَوِ اسْتَقَامُوا، أَنَّهُ اسْتَمَعَ نَفَرٌ مِنَ الْجِنِّ پر عطف ہے یعنی یہ بات بھی میری طرف وحی کی گئی ہے کہ ۔۔الطریقہ سے مراد راہ راست یعنی اسلام ہے۔ غدق کے معنی کثیر۔ وافر پانی سے مطلب دنیوی خوش حالی ہے۔ یعنی دنیا کا مال و اسباب دے کر ہم ان کی آزمائش کرتے۔ جیسے دوسرے مقام پر فرمایا: «وَلَوْ أَنَّ أَهْلَ الْقُرَى آمَنُوا وَاتَّقَوْا لَفَتَحْنَا عَلَيْهِمْ بَرَكَاتٍ مِنَ السَّمَاءِ وَالأَرْضِ» (الأعراف:96) یہی بات اہل کتاب کے ضمن میں بھی فرمائی گئی ہے۔ سورۂ مائدہ، 66۔ بعض کہتے ہیں کہ اس آیت کا نزول اس وقت ہوا تھا جب کفار قریش پر قحط سالی مسلط کردی گئی تھی۔ الطریقۃ کے دوسرے معنی گمراہی کے راستے کے کئے گئے ہیں۔ اس معنی کے لحاظ سے یہ مادی خوش حالی استدراج کے طور پر ہوگی۔ جیسے دوسرے مقام پر فرمایا: «فَلَمَّا نَسُوا مَا ذُكِّرُوا بِهِ فَتَحْنَا عَلَيْهِمْ أَبْوَابَ كُلِّ شَيْءٍ» الآية (الأنعام:44) «أَيَحْسَبُونَ أَنَّمَا نُمِدُّهُمْ بِهِ مِنْ مَالٍ وَبَنِينَ ، نُسَارِعُ لَهُمْ فِي الْخَيْرَاتِ» (المؤمنون:55-56)\n(2) صَعَدًا، أَيْ: عَذَابًا شَاقًّا شَدِيدًا مُوجِعًا مُؤْلِمًا ،(ابن کثیر) نہایت سخت الم ناک عذاب۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"linaftinahum fīhi waman yuʿ'riḍ ʿan dhik'ri rabbihi yasluk'hu ʿadhāban ṣaʿadan ","translations":["That We might test them","therein","And whoever","turns away","from","the Remembrance","(of) his Lord","He will make him enter","a punishment","severe","(17)"],"transliterationArr":["linaftinahum","fīhi","waman","yuʿ'riḍ","ʿan","dhik'ri","rabbihi","yasluk'hu","ʿadhāban","ṣaʿadan",null],"verseTiming":[[1,0,1300],[2,1300,3650],[3,3650,4400],[4,4400,5730],[5,5730,6670],[6,6670,7310],[7,7310,8190],[8,8190,9100],[9,9100,10640],[10,10640,12045]]}}