{"name":"72:18","price":"اور یہ کہ مسجدیں صرف اللہ ہی کے لئے خاص ہیں پس اللہ تعالیٰ کے ساتھ کسی اور کو نہ پکارو.(1)","arabic":"وَأَنَّ ٱلۡمَسَٰجِدَ لِلَّهِ فَلَا تَدۡعُواْ مَعَ ٱللَّهِ أَحَدٗا","category":["72 (Al-Jinn)","Al-Jinn","Surah Al-Jinn","Chapter Al-Jinn","Jinn","Surah Jinn","Chapter Jinn","Al Jinn","Surah Al Jinn","Chapter Al Jinn","Surah 72","Chapter 72","The Jinn","الجن"],"ayahNumber":5465,"juzNumber":29,"footnotes":"(1) مسجد کے معنی ہیں سجدہ گاہ۔ سجدہ بھی ایک رکن نماز ہے اس لیے نماز پڑھنے کی جگہ مسجد کہا جاتا ہے آیت کا مطلب واضح ہے کہ مسجدوں کا مقصد صرف ایک اللہ کی عبادت ہے اس لیے مسجدوں میں کسی اور کی عبادت کسی اور سے دعا ومناجات 'کسی اور (رضي الله عنه) سے استغاثہ و استمداد جائز نہیں۔یہ امور ویسے تو مطلقا ہی ممنوع ہیں اور کہیں بھی غیر اللہ کی عبادت جائز نہیں ہے لیکن مسجدوں کا بطور خاص اس لئے ذکر کیا ہے کہ ان کے قیام کا مقصد ہی اللہ کی عبادت ہے ۔اگر یہاں بھی غیر اللہ کو پکارنا شروع کر دیا گیا تو یہ نہایت ہی قبیح او ظالمانہ حرکت ہوگی ۔لیکن بدقسمتی سے بعض نادان مسلمان اب مسجدوں میں بھی اللہ کے ساتھ دوسروں کو بھی مدد کے لئے پکارتے ہیں ۔بلکہ مسجدوں میں ایسے کتبے آویزاں کیے ہوئے ہیں جن میں اللہ کو چھوڑ کر دوسروں سے استغاثہ کیا گیا ہے ۔آہ! فَلْيَبْكِ عَلَى الإِسْلامِ مَنْ كَانَ بَاكِيًا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-anna al-masājida lillahi falā tadʿū maʿa al-lahi aḥadan ","translations":["And that","the masjids","(are) for Allah","so (do) not","call","with","Allah","anyone","(18)"],"transliterationArr":["wa-anna","al-masājida","lillahi","falā","tadʿū","maʿa","al-lahi","aḥadan",null],"verseTiming":[[1,0,1370],[2,1370,2660],[3,2660,3620],[4,3620,4190],[5,4190,4960],[6,4960,5310],[7,5310,6150],[8,6150,7095]]}}