{"name":"72:28","price":"تاکہ ان کے اپنے رب کے پیغام پہنچا دینے کا علم ہو جائے(1) اللہ تعالیٰ نے ان کے آس پاس (کی تمام چیزوں) کا احاطہ کر رکھا ہے(2) اور ہر چیز کی گنتی شمار کر رکھا ہے.(3)","arabic":"لِّيَعۡلَمَ أَن قَدۡ أَبۡلَغُواْ رِسَٰلَٰتِ رَبِّهِمۡ وَأَحَاطَ بِمَا لَدَيۡهِمۡ وَأَحۡصَىٰ كُلَّ شَيۡءٍ عَدَدَۢا","category":["72 (Al-Jinn)","Al-Jinn","Surah Al-Jinn","Chapter Al-Jinn","Jinn","Surah Jinn","Chapter Jinn","Al Jinn","Surah Al Jinn","Chapter Al Jinn","Surah 72","Chapter 72","The Jinn","الجن"],"ayahNumber":5475,"juzNumber":29,"footnotes":"(1) لِيَعْلَمَ میں ضمیر کا مرجع کون ہے؟ بعض کے نزدیک رسول اللہ (صلى الله عليه وسلم) تاکہ آپ جان لیں کہ آپ سے پہلے رسولوں نے بھی اللہ کا پیغام اسی طرح پہنچایا جس طرح آپ نے پہنچایا۔ یا نگران فرشتوں نے اپبے رب ک کا پیغام پیغمبروں تک پہنچایا دیا ہے۔ اور بعض نے اللہ کو مرجع بنایا ہے کہ اللہ تعالٰی اپنے پیغمبروں کی فرشتوں کے ذریعے حفاظت فرماتا ہے۔ تاکہ وہ فریضہ رسالت کی ادائگی سحیح طریقے کر سکیں ۔نیز وہ اس وحی کی بھی حفاظت فرماتا ہے جو پیغمبروں کو کی جاتی ہے تاکہ وہ جان جائے کہ انہوں نے اہنے رب کے پیغامات لوگوں تک ٹھیک ٹھیک پہنچادیے ہیں یا فرشتوں نے پیغمبروں تک وحی پہنچادی ہے ۔اللہ کو اگر چہ پہلے ہی ہر چیز کا علم ہے لیکن ایسے موقعوں ہر اللہ کے جاننے کا مطلب اس کے تحقیق کا عام مشاہدہ ہے 'جیسے «لِنَعْلَمَ مَنْ يَتَّبِعُ الرَّسُولَ» ( البقرة: 143) اور «وَلَيَعْلَمَنَّ اللَّهُ الَّذِينَ آمَنُوا وَلَيَعْلَمَنَّ الْمُنَافِقِينَ» (سورة العنكبوت: 11) وغیرہ آیات میں میں ہے۔(ابن کثیر)\n(2) فرشتوں کے پاس کی یا پیغمبروں کے پاس کی۔\n(3) کیونکہ وہی عالم الغیب ہے، جو ہو چکا اور آئندہ ہوگا، سب کا اس نے شمار کر رکھا ہے۔ یعنی اسکے علم میں ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"liyaʿlama an qad ablaghū risālāti rabbihim wa-aḥāṭa bimā ladayhim wa-aḥṣā kulla shayin ʿadadan ","translations":["That He may make evident","that","indeed","they have conveyed","(the) Messages","(of) their Lord","and He has encompassed","what","(is) with them","and He takes account","(of) all","things","(in) number","(28)"],"transliterationArr":["liyaʿlama","an","qad","ablaghū","risālāti","rabbihim","wa-aḥāṭa","bimā","ladayhim","wa-aḥṣā","kulla","shayin","ʿadadan",null],"verseTiming":[[1,0,1050],[2,1050,2350],[3,2350,2640],[4,2640,3680],[5,3680,4870],[6,4870,5880],[7,5880,6900],[8,6900,7510],[9,7510,8500],[10,8500,9650],[11,9650,10250],[12,10250,11240],[13,11240,12445]]}}