{"name":"72:2","price":"جو راه راست کے طرف رہنمائی کرتا ہے(1) ۔ ہم اس پر ایمان ﻻ چکے(2) (اب) ہم ہرگز کسی کو بھی اپنے رب(3) کا شریک نہ بنائیں گے.","arabic":"يَهۡدِيٓ إِلَى ٱلرُّشۡدِ فَـَٔامَنَّا بِهِۦۖ وَلَن نُّشۡرِكَ بِرَبِّنَآ أَحَدٗا","category":["72 (Al-Jinn)","Al-Jinn","Surah Al-Jinn","Chapter Al-Jinn","Jinn","Surah Jinn","Chapter Jinn","Al Jinn","Surah Al Jinn","Chapter Al Jinn","Surah 72","Chapter 72","The Jinn","الجن"],"ayahNumber":5449,"juzNumber":29,"footnotes":"(1) یہ قرآن کی دوسری صفت ہے کہ وہ راہ راست یعنی حق کو واضح کرتا ہے یا اللہ کی معرفت عطا کرتا ہے۔\n(2) یعنی ہم نے سن کر اس بات کی تصدیق کر دی کہ واقعی یہ اللہ کا کلام ہے کسی انسان کا نہیں اس میں کفار کو توبیخ وتنبیہ ہے کہ جن تو ایک مرتبہ ہی سن کر قرآن پر ایمان لے آئے 'تھیڑی سی آیات دن کر ہی ان کا کایا پلٹ گئی اور وہ یہ بھی سمجھ گئے کہ یہ کسی انسان کا بنایا ہواکلام نہیں ہےلیکن انسانوں کو، خاص کر ان کے سرداروں کو اس قرآن سے کوئی فائدہ نہیں ہوا حالانکہ نبی (صلى الله عليه وسلم) کی زبان مبارک سے متعدد بار انہوں نے قرآن سنا۔ علاوہ ازیں خو د آپ (صلى الله عليه وسلم) بھی ان ہی میں سے تھے اور ان ہی کی زبان میں آپ ان کو قرآن سناتے تھے۔\n(3) نہ مخلوق میں سے نہ کسی اور معبود کو اس لیے کہ وہ اپنی ربوبیت میں متفرد ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yahdī ilā al-rush'di faāmannā bihi walan nush'rika birabbinā aḥadan ","translations":["It guides","to","the right way","so we believe","in it","and never","we will associate","with our Lord","anyone","(2)"],"transliterationArr":["yahdī","ilā","al-rush'di","faāmannā","bihi","walan","nush'rika","birabbinā","aḥadan",null],"verseTiming":[[1,0,2410],[2,2410,2790],[3,2790,3520],[4,3520,5490],[5,5490,6360],[6,6360,6790],[7,6790,8190],[8,8190,10390],[9,10390,11685]]}}