{"name":"73:20","price":"آپ کا رب بخوبی جانتا ہے کہ آپ اور آپ کے ساتھ کے لوگوں کی ایک جماعت قریب دو تہائی رات کے اور آدھی رات کے اور ایک تہائی رات کے تہجد پڑھتی ہے(1) اور رات دن کا پورا اندازه اللہ تعالیٰ کو ہی ہے(2)، وه (خوب) جانتا ہے کہ تم اسے ہرگز نہ نبھا سکو گے(3) پس اس نے تم پر مہربانی کی لہٰذا جتنا قرآن پڑھنا تمہارے لیے آسان ہو اتنا ہی پڑھو(4)، وه جانتا ہے کہ تم میں بعض بیمار بھی ہوں گے، بعض دوسرے زمین میں چل پھر کر اللہ تعالیٰ کا فضل (یعنی روزی بھی) تلاش کریں گے(5) اور کچھ لوگ اللہ تعالیٰ کی راه میں جہاد بھی کریں گے(6)، سو تم بہ آسانی جتنا قرآن پڑھ سکو پڑھو(7) اور نماز کی پابندی رکھو(8) اور زکوٰة دیتے رہا کرو اور اللہ تعالیٰ کو اچھا قرض دو(9)۔ اور جو نیکی تم اپنے لیے آگے بھیجو گے اسے اللہ تعالیٰ کے ہاں بہتر سے بہتر اور ﺛواب میں بہت زیاده پاؤ گے(10) اللہ تعالیٰ سے معافی مانگتے رہو۔ یقیناً اللہ تعالیٰ بخشنے واﻻ. مہربان ہے","arabic":"۞ إِنَّ رَبَّكَ يَعۡلَمُ أَنَّكَ تَقُومُ أَدۡنَىٰ مِن ثُلُثَيِ ٱلَّيۡلِ وَنِصۡفَهُۥ وَثُلُثَهُۥ وَطَآئِفَةٞ مِّنَ ٱلَّذِينَ مَعَكَۚ وَٱللَّهُ يُقَدِّرُ ٱلَّيۡلَ وَٱلنَّهَارَۚ عَلِمَ أَن لَّن تُحۡصُوهُ فَتَابَ عَلَيۡكُمۡۖ فَٱقۡرَءُواْ مَا تَيَسَّرَ مِنَ ٱلۡقُرۡءَانِۚ عَلِمَ أَن سَيَكُونُ مِنكُم مَّرۡضَىٰ وَءَاخَرُونَ يَضۡرِبُونَ فِي ٱلۡأَرۡضِ يَبۡتَغُونَ مِن فَضۡلِ ٱللَّهِ وَءَاخَرُونَ يُقَٰتِلُونَ فِي سَبِيلِ ٱللَّهِۖ فَٱقۡرَءُواْ مَا تَيَسَّرَ مِنۡهُۚ وَأَقِيمُواْ ٱلصَّلَوٰةَ وَءَاتُواْ ٱلزَّكَوٰةَ وَأَقۡرِضُواْ ٱللَّهَ قَرۡضًا حَسَنٗاۚ وَمَا تُقَدِّمُواْ لِأَنفُسِكُم مِّنۡ خَيۡرٖ تَجِدُوهُ عِندَ ٱللَّهِ هُوَ خَيۡرٗا وَأَعۡظَمَ أَجۡرٗاۚ وَٱسۡتَغۡفِرُواْ ٱللَّهَۖ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمُۢ","category":["73 (Al-Muzzammil)","Al-Muzzammil","Surah Al-Muzzammil","Chapter Al-Muzzammil","Muzzammil","Surah Muzzammil","Chapter Muzzammil","Al Muzzammil","Surah Al Muzzammil","Chapter Al Muzzammil","Surah 73","Chapter 73","The Enshrouded One","المزمل"],"ayahNumber":5495,"juzNumber":29,"footnotes":"(1) جب سورت کے آغاز میں نصف رات یا اس سے کم یا زیادہ قیام کا حکم دیا گیا تو نبی (صلى الله عليه وسلم) اور آپ کے ساتھ صحابہ کی ایک جماعت رات کو قیام کرتی کبھی دو تہائی سے کم یا زیادہ کبھی نصف رات کبھی ثلث رات جیسا کہ یہاں ذکر ہے۔ لیکن ایک تو رات کا یہ قیام نہایت گراں تھا دوسرے وقت کا اندازہ لگانا مشکل تھا کہ یہ نصف رات ہوئی یا ثلث اس لیے اللہ نے اس آیت میں تخفیف کا حکم نازل فرمایا جس میں فرمایا کہ بعض کے نزدیک ترک قیام کی اجازت ہے۔ اور بعض کے نزدیک یہ ہے کہ اس کے فرض کو استحباب میں بدل دیا گیا ۔اب یہ نہ امت کے لئے فرض ہے نہ نبی (صلى الله عليه وسلم)کے لئے اور بعض کہتے ہیں کہ یہ تخفیف صرف امت کے لئے ہے نبی (صلى الله عليه وسلم)کے لئے اس کا پڑھنا ضروری تھا۔\n(2) یعنی اللہ تورات کی گھڑیاں گن سکتا ہے کتنی گزر گئی ہیں اور کتنی باقی ہیں تمہارے لیے یہ اندازہ لگانا ناممکن ہے۔\n(3) جب تمہارے لئے رات کے گزرنے کا صحیح اندازہ ممکن ہی نہیں، تو تم مقررہ اوقات تک نماز تہجد میں مشغول بھی کس طرح رہ سکتے ہو؟\n(4) یعنی اللہ نے قیام الیل کا حکم منسوخ کر دیا اور اب صرف اس کا استحباب باقی رہ گیا ہے اور وہ بھی وقت کی پابندی کے بغیر ،نصف شب یا ثلث شب یا دو ثلث کی پابندی بھی ضتوتی نہیں ۔اگر تم تھوڑا سا وقت صرف کر کے دو رکعت بھی ہڑھ لو گے تو عنداللہ قیام الیل کے اجر کے مستحق قرار پاؤگے ،تاہم اگر کوئی شحص آٹھ رکعات تہجد کا اہتمام کرے گا جیسا کہ نبی کریم (صلى الله عليه وسلم) کا معمول تھا ،تو زیادہ بہتر ہو گا اور نبی (صلى الله عليه وسلم) کا تبع قرار پائے گا۔\n(5) فَاقْرَءُوا کا مطلب ہے فصلو 'اور اور قرآن سے مراد الصلوۃ ہے ، قیام الیل میں چوں کہ قیام لمبا ہوتا ہے اور قرآن زیادہ پڑھا جاتا ہے اس لئے نماز تہجد کو ہی قرآن سے تعبیر کر دیا گیا ہے جیسے نماز میں سور فاتحہ نہایت ضروری ہے 'اس لئے اللہ تعالیٰ نے حدیث قدسی میں 'جو سورہ فاتحہ میں گزر چکی ہے 'سورہ فاتحہ کو نماز سے تعبیر فرمایا ہے «قَسَمْتُ الصَّلاةَ بَيْنِي وَبَيْنَ عَبْدِي» (الحدیث) اس لئے ”جتنا قرآن پڑھنا آسان ہو پڑھ لو“ کا مطلب ہے رات کو جتنی نماز پڑھ سکتے ہو 'پڑھ لو۔ اس کے لئے نہ وقت کی پابندی ہے اور نہ رکعات کی ۔اس آیت سے بعض لوگ اسدلال کرتے ہوئے کہتے ہیں کہ نماز میں سورۃ فاتحہ پڑھنی ضروری نہیں ہے جتنا کسی کے لئے آسان ہو'پڑھ لے اگر کوئی ایک آیت بھی کہیں سے پڑھ لے گا تو نماز ہو جائے گی ۔لیکن اول تو یہاں قراءت بمعنی نماز ہے 'جیسا کہ ہم نے بیان کیا ۔اس لئےآیت کا تعلق اس بات سے نہیں ہے کہ نماز میں کتنی قراءت ضروری ہے ؟دوسرے اگر اس کا تعلق قراءت سے ہی مان لیا جائے تب بھی یہ استدلال اپنی اندر کوئی قوت نہیں رکھتا ۔کیوں کہ ما تیسر کی تفسیر خود نبی (صلى الله عليه وسلم) نے فرمادی ہے کہ وہ کم سے کم قراءت ،جس کے بغیر نماز نہیں ہو گی وہ سورۃ ھاتحہ ہے اس لئے آپ (صلى الله عليه وسلم) نے فرمایا ہے کہ یہ ضروری پڑھو جیسا کہ صحیح اور نہایت قوی اور واضح احادیث میں یہ حکم ہے اس تفسیر نبوی (صلى الله عليه وسلم)کے خلاف یہ کہنا کہ نماز میں سورۃ فاتحہ ضروری نہیں بلکہ کوئی سی بھی ایک آیت پڑھ لو نماز ہو جائے گی ۔بڑی جسارت اور نبی(صلى الله عليه وسلم) کی احادیث سے بے اعتناعی اکا مظاہرہ ہے ۔نیزائمی کے اقوال کے بھی خلاف ہے جو انہوں نے اصول فقیہ کی کتابوں میں لکھا ہے کہ اس آیت سے ترک فاتحہ خلف امام پر استدلال جائز نہیں ' اس لئے کہ وہ آیتیں متعارض ہیں ۔البتہ اگر کوئی شخص جہری نماز میں امام کے پیچھے سورہ فاتحہ نہ پڑھے تو بعض احادیث کی رو سے بعض ائمہ نے اسے جائز کہا ہے اور بعض نے نہ پڑھنے ہی کو ترجیح دی ہے ۔(تفصیل کے لئے فرضیت فاتحہ خلف امام پر تحریر کردہ کتب ملاحظہ فرمائیں )\n(6) یعنی تجارت اور کاروبار کے لئے سفر کرنا اور ایک شہر سے دوسرے شہر میں یا ایک ملک سے دوسرے ملک میں جانا پڑے گا۔\n(7) اسی طرح جہاد میں بھی پُر مشقت سفر اور مشقتیں کرنی پڑتی ہیں، اور یہ تینوں چیزیں، بیماری، سفر اور جہاد نوبت بہ نوبت ہر ایک کو لاحق ہوتی ہیں اس لیے اللہ نے قیام اللیل کے حکم میں تخفیف کردی ہے کیونکہ تینوں حالتوں میں یہ نہایت مشکل اور بڑا صبر آزما کام ہے۔\n(8) اسباب تخفیف کے ساتھ تخفیف کا یہ حکم دوبارہ بطور تاکید بیان کر دیا گیا۔\n(9) یعنی پانچوں نمازوں کی جو فرض ہیں۔\n(10) یعنی اللہ کی راہ میں حسب ضرورت و توفیق خرچ کرو، اسے قرض حسنہ سے اس لئے تعبیر فرمایا کہ اللہ تعالٰی اس کے بدلے میں سات سو گنا بلکہ اس سے زیادہ تک اجر و ثواب عطا فرمائے گا۔\n11- یعنی نفلی نمازیں، صدقات و خیرات اور دیگر نیکیاں جو بھی کرو گے اللہ کے ہاں ان کا بہترین اجر پاؤ گے اکثر مفسرین کے نزدیک یہ آیت مدینہ میں نازل ہوئی اس لیے کہتے ہیں کہ اس کا نصف حصہ مکی اور نصف حصہ مدنی ہے۔(ایسر التفاسیر)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"inna rabbaka yaʿlamu annaka taqūmu adnā min thuluthayi al-layli waniṣ'fahu wathuluthahu waṭāifatun mina alladhīna maʿaka wal-lahu yuqaddiru al-layla wal-nahāra ʿalima an lan tuḥ'ṣūhu fatāba ʿalaykum fa-iq'raū mā tayassara mina al-qur'āni ʿalima an sayakūnu minkum marḍā waākharūna yaḍribūna fī al-arḍi yabtaghūna min faḍli al-lahi waākharūna yuqātilūna fī sabīli al-lahi fa-iq'raū mā tayassara min'hu wa-aqīmū al-ṣalata waātū al-zakata wa-aqriḍū al-laha qarḍan ḥasanan wamā tuqaddimū li-anfusikum min khayrin tajidūhu ʿinda al-lahi huwa khayran wa-aʿẓama ajran wa-is'taghfirū al-laha inna al-laha ghafūrun raḥīmun ","translations":["Indeed","your Lord","knows","that you","stand","(a little) less","than","two-thirds","(of) the night","and half of it","and a third of it","and (so do) a group","of","those who","(are) with you","And Allah","determines","the night","and the day","He knows","that","not","you count it","so He has turned","to you","so recite","what","is easy","of","the Quran","He knows","that","there will be","among you","sick","and others","traveling","in","the land","seeking","of","(the) Bounty","(of) Allah","and others","fighting","in","(the) way","(of) Allah","So recite","what","is easy","of it","and establish","the prayer","and give","the zakah","and loan","Allah","a loan","goodly","And whatever","you send forth","for yourselves","of","good","you will find it","with","Allah","It","(will be) better","and greater","(in) reward","And seek forgiveness","(of) Allah","Indeed","Allah","(is) Oft-Forgiving","Most Merciful","(20)"],"transliterationArr":["inna","rabbaka","yaʿlamu","annaka","taqūmu","adnā","min","thuluthayi","al-layli","waniṣ'fahu","wathuluthahu","waṭāifatun","mina","alladhīna","maʿaka","wal-lahu","yuqaddiru","al-layla","wal-nahāra","ʿalima","an","lan","tuḥ'ṣūhu","fatāba","ʿalaykum","fa-iq'raū","mā","tayassara","mina","al-qur'āni","ʿalima","an","sayakūnu","minkum","marḍā","waākharūna","yaḍribūna","fī","al-arḍi","yabtaghūna","min","faḍli","al-lahi","waākharūna","yuqātilūna","fī","sabīli","al-lahi","fa-iq'raū","mā","tayassara","min'hu","wa-aqīmū","al-ṣalata","waātū","al-zakata","wa-aqriḍū","al-laha","qarḍan","ḥasanan","wamā","tuqaddimū","li-anfusikum","min","khayrin","tajidūhu","ʿinda","al-lahi","huwa","khayran","wa-aʿẓama","ajran","wa-is'taghfirū","al-laha","inna","al-laha","ghafūrun","raḥīmun",null],"verseTiming":[[1,0,1300],[2,1300,2050],[3,2050,2770],[4,2770,3970],[5,3970,4720],[6,4720,5550],[7,5550,5960],[8,5960,7690],[9,7690,8280],[10,8280,9480],[11,9480,10660],[12,10660,13160],[13,13160,14200],[14,14200,15200],[15,15200,15870],[16,15870,17180],[17,17180,18160],[18,18160,18990],[19,18990,23340],[20,23340,23900],[21,23900,24180],[22,24180,25630],[23,25630,26720],[24,26720,27500],[25,27500,28610],[26,28610,29510],[27,29510,29820],[28,29820,30900],[29,30900,31210],[30,31210,35040],[31,35040,35760],[32,35760,36690],[33,36690,37680],[34,37680,39040],[35,39040,40590],[36,40590,41810],[37,41810,43040],[38,43040,43300],[39,43300,44090],[40,44090,45230],[41,45230,46000],[42,46000,46640],[43,46640,47390],[44,47390,48760],[45,48760,50100],[46,50100,50480],[47,50480,51370],[48,51370,53690],[49,53690,54600],[50,54600,54930],[51,54930,55950],[52,55950,57140],[53,57140,58100],[54,58100,59150],[55,59150,59860],[56,59860,60920],[57,60920,61900],[58,61900,62640],[59,62640,63350],[60,63350,64310],[61,64310,65290],[62,65290,66450],[63,66450,68210],[64,68210,69370],[65,69370,70550],[66,70550,71650],[67,71650,72570],[68,72570,73470],[69,73470,73820],[70,73820,75060],[71,75060,75960],[72,75960,77000],[73,77000,78620],[74,78620,81940],[75,81940,82990],[76,82990,83990],[77,83990,84880],[78,84880,88245]]}}