{"name":"76:24","price":"پس تو اپنے رب کے حکم پر قائم ره(1) اور ان میں سے کسی گنہگار یا ناشکرے کا کہا نہ مان.(2)","arabic":"فَٱصۡبِرۡ لِحُكۡمِ رَبِّكَ وَلَا تُطِعۡ مِنۡهُمۡ ءَاثِمًا أَوۡ كَفُورٗا","category":["76 (Al-Insan)","Al-Insan","Surah Al-Insan","Chapter Al-Insan","Insan","Surah Insan","Chapter Insan","Al Insan","Surah Al Insan","Chapter Al Insan","Surah 76","Chapter 76","Man","الإنسان"],"ayahNumber":5615,"juzNumber":29,"footnotes":"(1) یعنی اس کے فیصلے کا انتظار کرو وہ تیری مدد میں کچھ تاخیر کر رہا ہے تو اس میں اس کی حکمت ہے۔ اس لئے صبر اور حوصلے کی ضرورت ہے۔\n(2) یعنی اگر تجھے اللہ کے نازل کردہ احکام سے روکیں تو ان کا کہنا نہ مان، بلکہ تبلیغ ودعوت کا کام جاری رکھ اور اللہ پر بھروسہ رکھ، وہ لوگوں سے تیری حفاظت فرمائے گا، فاجر جو اللہ کی نافرمانی کرنے والا ہو اور کفور جو دل سے کفر کرنے والا ہو اور کفور جو دل سے کفر کرنے والا ہو یا کفر میں حد سے بڑھ جانے والا ہو۔ بعض کہتے ہیں کہ اس سے مراد ولید بن مغیرہ ہے جس نے نبی (صلى الله عليه وسلم) سے کہا تھا کہ اس کام سے باز آجا، ہم تجھے تیرے کہنے کے مطابق دولت مہیا کردیتے ہیں اور عرب کی جس عورت سے تو شادی کرنا چاہے، ہم تیری شادی کرادیتے ہیں۔ (فتح القدیر)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"fa-iṣ'bir liḥuk'mi rabbika walā tuṭiʿ min'hum āthiman aw kafūran ","translations":["So be patient","for (the) Command","(of) your Lord","and (do) not","obey","from them","any sinner","or","disbeliever","(24)"],"transliterationArr":["fa-iṣ'bir","liḥuk'mi","rabbika","walā","tuṭiʿ","min'hum","āthiman","aw","kafūran",null],"verseTiming":[[1,0,650],[2,650,1410],[3,1410,2290],[4,2290,2760],[5,2760,3300],[6,3300,4050],[7,4050,5070],[8,5070,5370],[9,5370,6925]]}}