{"name":"76:3","price":"ہم نے اسے راه دکھائی اب خواه وه شکر گزار بنے خواه ناشکرا.(1)","arabic":"إِنَّا هَدَيۡنَٰهُ ٱلسَّبِيلَ إِمَّا شَاكِرٗا وَإِمَّا كَفُورًا","category":["76 (Al-Insan)","Al-Insan","Surah Al-Insan","Chapter Al-Insan","Insan","Surah Insan","Chapter Insan","Al Insan","Surah Al Insan","Chapter Al Insan","Surah 76","Chapter 76","Man","الإنسان"],"ayahNumber":5594,"juzNumber":29,"footnotes":"(1) یعنی اسے سماعت اور بصارت کی قوتیں عطا کیں، تاکہ وہ سب کچھ دیکھ سکے اور سن سکے اور اس کے بعد اطاعت یا انکاری دونوں راستوں میں کسی ایک کا انتخاب کر سکے۔\n(2) یعنی مذکورہ قوتوں اور صلاحیتوں کے علاوہ ہم نے خود بھی انبیاء علیہ السلام، اپنی کتابوں اور داعیان حق کے ذریعے سے صحیح راستے کو بیان اور واضح کردیا ہے اب یہ اس کی مرضی ہے کہ اطاعت الہی کا راستہ اختیار کر کے شکر گزار بندہ بن جائے یا معصیت کا راستہ اختیار کر کے اس کا ناشکرا بن جائے۔ جیسے ایک حدیث میں نبی (صلى الله عليه وسلم) نے فرمایا: «كُلُّ النَّاسِ يَغْدُو فَبَائِعٌ نَفْسَهُ فَمُوبِقُهَا أَوْ مُعْتِقُهَا»، (صحیح مسلم، کتاب الطهارة، باب فضل الوضوء) ”ہر شخص اپنے نفس کی خریدو فروخت کرتا ہے، پس اسے ہلاک کرتا ہے یا اسے آزاد کرالیتا ہے“۔ یعنی اپنے عمل و کسب کے ذریعے سے ہلاک یا آزاد کرالیتا ہے، اگر شر کمائے گا تو اپنے نفس کو ہلاک اور خیر کمائے گا تو نفس کو آزاد کرالے گا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"innā hadaynāhu al-sabīla immā shākiran wa-immā kafūran ","translations":["Indeed, We","guided him","(to) the way","whether","(he) be grateful","and whether","(he) be ungrateful","(3)"],"transliterationArr":["innā","hadaynāhu","al-sabīla","immā","shākiran","wa-immā","kafūran",null],"verseTiming":[[1,0,1470],[2,1470,2580],[3,2580,3570],[4,3570,5180],[5,5180,6830],[6,6830,8440],[7,8440,10215]]}}