{"name":"7:105","price":"میرے لیے یہی شایان ہے کہ بجز سچ کے اللہ کی طرف کوئی بات منسوب نہ کروں، میں تمہارے پاس تمہارے رب کی طرف سے ایک بڑی دلیل بھی ﻻیا ہوں(1) ، سو تو بنی اسرائیل کو میرے ساتھ بھیج دے۔(2)","arabic":"حَقِيقٌ عَلَىٰٓ أَن لَّآ أَقُولَ عَلَى ٱللَّهِ إِلَّا ٱلۡحَقَّۚ قَدۡ جِئۡتُكُم بِبَيِّنَةٖ مِّن رَّبِّكُمۡ فَأَرۡسِلۡ مَعِيَ بَنِيٓ إِسۡرَٰٓءِيلَ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":1059,"juzNumber":9,"footnotes":"(1) جو اس بات کی دلیل ہے کہ میں واقعی اللہ کی طرف سے مقرر کردہ رسول ہوں ۔ اس معجزے اور بڑی دلیل کی تفصیل بھی آگے آرہی ہے ۔\n(2) بنی اسرائیل ، جن کا اصل مسکن شام کا علاقہ تھا، حضرت یوسف (عليه السلام) کے زمانے میں مصر چلے گئے تھے اور پھر وہیں کے ہوکر رہ گئے ۔ فرعون نے ان کو غلام بنا لیا تھا اور ان پر طرح طرح کے مظالم کرتا تھا، جس کی تفصیل پہلے سورۂ بقرہ میں گزر چکی ہے اور آئندہ بھی آئے گی۔ فرعون اور اس کے درباری امراء نے جب حضرت موسیٰ (عليه السلام) کی دعوت کو ٹھکرا دیا تو حضرت موسیٰ (عليه السلام) نے فرعون سے یہ دوسرا مطالبہ کیا کہ بنی اسرائیل کو آزاد کردے تاکہ یہ اپنے آبائی مسکن میں جا کر عزت و احترام کی زندی گزاریں اور اللہ کی عبادت کریں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"ḥaqīqun ʿalā an lā aqūla ʿalā al-lahi illā al-ḥaqa qad ji'tukum bibayyinatin min rabbikum fa-arsil maʿiya banī is'rāīla ","translations":["Obligated","on","that","not","I say","about","Allah","except","the truth","Verily","I (have) come to you","with a clear Sign","from","your Lord","so send","with me","(the) Children","(of) Israel","(105)"],"transliterationArr":["ḥaqīqun","ʿalā","an","lā","aqūla","ʿalā","al-lahi","illā","al-ḥaqa","qad","ji'tukum","bibayyinatin","min","rabbikum","fa-arsil","maʿiya","banī","is'rāīla",null],"verseTiming":[[1,0,1070],[2,1070,3100],[3,3100,3360],[4,3360,5450],[5,5450,6260],[6,6260,6740],[7,6740,7640],[8,7640,8220],[9,8220,8930],[10,8930,10170],[11,10170,12010],[12,12010,13280],[13,13280,14610],[14,14610,15900],[15,15900,17000],[16,17000,17630],[17,17630,19470],[18,19470,24365]]}}