{"name":"7:100","price":"اور کیا ان لوگوں کو جو زمین کے وارث ہوئے وہاں کے لوگوں کی ہلاکت کے بعد (ان واقعات مذکوره نے) یہ بات نہیں بتلائی کہ اگر ہم چاہیں تو ان کے جرائم کے سبب ان کو ہلاک کر ڈالیں اور ہم ان کے دلوں پر بند لگا دیں، پس وه نہ سن سکیں۔(1)","arabic":"أَوَلَمۡ يَهۡدِ لِلَّذِينَ يَرِثُونَ ٱلۡأَرۡضَ مِنۢ بَعۡدِ أَهۡلِهَآ أَن لَّوۡ نَشَآءُ أَصَبۡنَٰهُم بِذُنُوبِهِمۡۚ وَنَطۡبَعُ عَلَىٰ قُلُوبِهِمۡ فَهُمۡ لَا يَسۡمَعُونَ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":1054,"juzNumber":9,"footnotes":"(1) یعنی گناہوں کے نتیجے میں عذاب ہی نہیں آتا، دلوں پر بھی قفل لگ جاتے ہیں، پھر بڑے بڑے عذاب بھی انہیں خواب غفلت سے بیدار نہیں کر پاتے۔ دیگر بعض مقامات کی طرح یہاں بھی اللہ تعالیٰ نے ایک تو یہ بیان فرمایا ہے کہ جس طرح گزشتہ قوموں کو ہم نے ان کے گناہوں کی پاداش میں ہلاک کیا، ہم چاہیں تو تمہیں بھی تمہارے کرتوتوں کی وجہ سے ہلاک کر دیں اور دوسری بات یہ بیان فرمائی کہ مسلسل گناہوں کے ارتکاب کی وجہ سے لوگوں کے دلوں پر مہر لگا دی جاتی ہے، جس کا نتیجہ یہ ہوتا ہے کہ حق کی آواز کے لیے ان کے کان بند ہو جاتے ہیں ۔ پھر انذار اور وعظ ونصیحت ان کے لیے بیکار ہو جاتے ہیں ۔ آیت میں ہدایت تَبْيِينٌ (وضاحت) کے معنی میں ہے، اسی لیے لام کے ساتھ متعدی ہے۔ أَوَلَمْ يَهْدِ للَّذِينَ، یعنی کیا ان پر یہ بات واضح نہیں ہوئی۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"awalam yahdi lilladhīna yarithūna al-arḍa min baʿdi ahlihā an law nashāu aṣabnāhum bidhunūbihim wanaṭbaʿu ʿalā qulūbihim fahum lā yasmaʿūna ","translations":["Would it not","guide","[for] those who","inherit","the land","from","after","its people","that","if","We willed","We (could) afflict them","for their sins","and We put a seal","over","their hearts","so they","(do) not","hear","(100)"],"transliterationArr":["awalam","yahdi","lilladhīna","yarithūna","al-arḍa","min","baʿdi","ahlihā","an","law","nashāu","aṣabnāhum","bidhunūbihim","wanaṭbaʿu","ʿalā","qulūbihim","fahum","lā","yasmaʿūna",null],"verseTiming":[[1,0,870],[2,870,1580],[3,1580,2760],[4,2760,3760],[5,3760,4630],[6,4630,5810],[7,5810,6450],[8,6450,8960],[9,8960,9230],[10,9230,9720],[11,9720,12229],[12,12229,14279],[13,14279,16299],[14,16299,17339],[15,17339,17939],[16,17939,19219],[17,19219,19869],[18,19869,20369],[19,20369,23484]]}}