{"name":"7:101","price":"ان بستیوں کے کچھ کچھ قصے ہم آپ سے بیان کر رہے ہیں اور ان سب کے پاس ان کے پیغمبر معجزات لے کر آئے(1) ، پھر جس چیز کو انہوں نے ابتدا میں جھوٹا کہہ دیا یہ بات نہ ہوئی کہ پھر اس کو مان لیتے(2)، اللہ تعالیٰ اسی طرح کافروں کے دلوں پر بند لگا دیتا ہے۔","arabic":"تِلۡكَ ٱلۡقُرَىٰ نَقُصُّ عَلَيۡكَ مِنۡ أَنۢبَآئِهَاۚ وَلَقَدۡ جَآءَتۡهُمۡ رُسُلُهُم بِٱلۡبَيِّنَٰتِ فَمَا كَانُواْ لِيُؤۡمِنُواْ بِمَا كَذَّبُواْ مِن قَبۡلُۚ كَذَٰلِكَ يَطۡبَعُ ٱللَّهُ عَلَىٰ قُلُوبِ ٱلۡكَٰفِرِينَ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":1055,"juzNumber":9,"footnotes":"(1) جس طرح گزشتہ صفحات میں چند انبیاء کا ذکر گزرا۔ بینات سے مراد دلائل وبراہین اور معجزات دونوں ہیں۔ مقصد یہ ہے کہ رسولوں کے ذریعے سے جب تک ہم نے حجت تمام نہیں کر دی، ہم نے انہیں ہلاک نہیں کیا ۔ کیونکہ: «وَمَا كُنَّا مُعَذِّبِينَ حَتَّىٰ نَبۡعَثَ رَسُولٗا» [الإسراء: 15] ”جب تک ہم رسول نہیں بھیج دیتے ۔ عذاب نازل نہیں کرتے“۔ (2) اس کا ایک مفہوم تو یہ ہے کہ یوم میثاق کو جب ان سے عہد لیا گیا تھا تو یہ اللہ کے علم میں ایمان لانے والے نہ تھے، اس لیے جب ان کے پاس رسول آئے تو اللہ کے علم کے مطابق ایمان نہیں لائے ۔ کیونکہ ان کی تقدیر میں ہی ایمان نہیں تھا جسے اللہ نے اپنے علم کے مطابق لکھ دیا تھا ۔ جس کو حدیث میں «فَكُلٌّ مُيَسَّرٌ لِمَا خُلِقَ لَهُ» (صحيح بخاري، تفسير سورة الليل) سے تعبیر کیا گیا ہے دوسرا مفہوم یہ ہے کہ جب پیغمبر ان کے پاس آئے تو وہ اس وجہ سے ان پر ایمان نہیں لائے کہ وہ اس سے قبل حق کی تکذیب کر چکے تھے ۔ گویا ابتداءً جس چیز کی وہ تکذیب کرچکے تھے، یہی گناہ ان کے عدم ایمان کا سبب بن گیا اور ایمان لانے کی توفیق ان سے سلب کر لی گئی، اسی کو اگلے جملے میں مہر لگانے سے تعبیر کیا گیا ہے ۔ «وَمَا يُشۡعِرُكُمۡ أَنَّهَآ إِذَا جَآءَتۡ لَا يُؤۡمِنُونَ، وَنُقَلِّبُ أَفۡ‍ِٔدَتَهُمۡ وَأَبۡصَٰرَهُمۡ كَمَا لَمۡ يُؤۡمِنُواْ بِهِۦٓ أَوَّلَ مَرَّةٖ» [الأنعام: 109-110]. ”اور تمہیں کیا معلوم ہے یہ تو ایسے (بدبخت) ہیں کہ ان کے پاس نشانیاں بھی آجائیں تب بھی ایمان نہ لائیں اور ہم ان کے دلوں اور آنکھوں کو الٹ دیں گے (تو) جیسے یہ اس (قرآن) پر پہلی دفعہ ایمان نہیں لائے (ویسے پھر نہ لائیں گے)“۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"til'ka al-qurā naquṣṣu ʿalayka min anbāihā walaqad jāathum rusuluhum bil-bayināti famā kānū liyu'minū bimā kadhabū min qablu kadhālika yaṭbaʿu al-lahu ʿalā qulūbi al-kāfirīna ","translations":["These","(were) the cities ","We relate","to you","of","their news","And certainly","came to them","their Messengers","with clear proofs","but not","they were","to believe","in what","they (had) denied","from","before","Thus","(has been) put a seal","(by) Allah","on","(the) hearts","(of) the disbelievers","(101)"],"transliterationArr":["til'ka","al-qurā","naquṣṣu","ʿalayka","min","anbāihā","walaqad","jāathum","rusuluhum","bil-bayināti","famā","kānū","liyu'minū","bimā","kadhabū","min","qablu","kadhālika","yaṭbaʿu","al-lahu","ʿalā","qulūbi","al-kāfirīna",null],"verseTiming":[[1,0,770],[2,770,1650],[3,1650,2520],[4,2520,3330],[5,3330,3750],[6,3750,7940],[7,7940,9200],[8,9200,11660],[9,11660,13410],[10,13410,15020],[11,15020,15570],[12,15570,16480],[13,16480,17700],[14,17700,18290],[15,18290,19360],[16,19360,20750],[17,20750,21660],[18,21660,22820],[19,22820,23580],[20,23580,24490],[21,24490,25090],[22,25090,26020],[23,26020,29465]]}}