{"name":"7:116","price":"(موسیٰ علیہ السلام) نے فرمایا کہ تم ہی ڈالو(1) ، پس جب انہوں نے ڈاﻻ تو لوگوں کی نظر بندی کر دی اور ان پر ہیبت غالب کر دی اور ایک طرح کا بڑا جادو دکھلایا۔(2)","arabic":"قَالَ أَلۡقُواْۖ فَلَمَّآ أَلۡقَوۡاْ سَحَرُوٓاْ أَعۡيُنَ ٱلنَّاسِ وَٱسۡتَرۡهَبُوهُمۡ وَجَآءُو بِسِحۡرٍ عَظِيمٖ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":1070,"juzNumber":9,"footnotes":"(1) لیکن موسیٰ (عليه السلام) چونکہ اللہ کے رسول تھے اور اللہ کی تائید انہیں حاصل تھی، اس لیے انہیں اپنے اللہ کی مدد کا یقین تھا، لہذا انہوں نے بغیر کسی خوف اور تامل کے جادوگروں سے کہا کہ پہلے تم جو دکھانا چاہتے ہو، دکھاو! علاوہ ازیں اس میں یہ حکمت بھی ہوسکتی ہے کہ جادو گروں کے پیش کردہ جادو کا توڑ جب حضرت موسیٰ (عليه السلام) کی طرف سے معجزانہ انداز میں پیش ہوگا تو یہ لوگوں کے لیے زیادہ متاثر کن ہوگا، جس سے ان کی صداقت واضح تر ہوگی اور لوگوں کے لیے ایمان لانا سہل ہو جائے گا ۔\n(2) بعض آثار میں بتایا گیا ہے کہ یہ جادوگر 70 ہزار کی تعداد میں تھے ۔ بظاہر یہ تعداد مبالغے سے خالی نہیں، جن میں سے ہر ایک نے ایک ایک رسی اور ایک ایک لاٹھی میدان میں پھینکی، جو دیکھنے والوں کو دوڑتی ہوئی محسوس ہوتی تھیں ۔ یہ گویا بزعم خویش بہت بڑا جادو تھا جو انہوں نے پیش کیا ۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qāla alqū falammā alqaw saḥarū aʿyuna al-nāsi wa-is'tarhabūhum wajāū bisiḥ'rin ʿaẓīmin ","translations":["He said","Throw","Then when","they threw","they bewitched","(the) eyes","(of) the people","and terrified them","and came (up)","with a magic","great","(116)"],"transliterationArr":["qāla","alqū","falammā","alqaw","saḥarū","aʿyuna","al-nāsi","wa-is'tarhabūhum","wajāū","bisiḥ'rin","ʿaẓīmin",null],"verseTiming":[[1,0,890],[2,890,1880],[3,1880,5400],[4,5400,6190],[5,6190,8870],[6,8870,9650],[7,9650,11420],[8,11420,13250],[9,13250,16060],[10,16060,16910],[11,16910,19925]]}}