{"name":"7:127","price":"اور قوم فرعون کے سرداروں نے کہا کہ کیا آپ موسیٰ (علیہ السلام) اور ان کی قوم کو یوں ہی رہنے دیں گے کہ وه ملک میں فساد کرتے پھریں(1) ، اور وه آپ کو اور آپ کے معبودوں کو ترک کئے رہیں(2)۔ فرعون نے کہا کہ ہم ابھی ان لوگوں کے بیٹوں کو قتل کرنا شروع کر دیں گے اور عورتوں کو زنده رہنے دیں گے اور ہم کو ان پر ہر طرح کا زور ہے۔(3)","arabic":"وَقَالَ ٱلۡمَلَأُ مِن قَوۡمِ فِرۡعَوۡنَ أَتَذَرُ مُوسَىٰ وَقَوۡمَهُۥ لِيُفۡسِدُواْ فِي ٱلۡأَرۡضِ وَيَذَرَكَ وَءَالِهَتَكَۚ قَالَ سَنُقَتِّلُ أَبۡنَآءَهُمۡ وَنَسۡتَحۡيِۦ نِسَآءَهُمۡ وَإِنَّا فَوۡقَهُمۡ قَٰهِرُونَ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":1081,"juzNumber":9,"footnotes":"(1) یہ ہر دور کے مفسدین کا شیوہ رہا ہے کہ وہ اللہ والوں کو فسادی اور ان کی دعوت ایمان وتوحید کو فساد سے تعبیر کرتے ہیں۔ فرعونیوں نے بھی یہی کہا۔\n(2) فرعون کو بھی اگرچہ دعوائے ربوبیت تھا ”فَقَالَ أَنَا۠ رَبُّكُمُ ٱلۡأَعۡلَىٰ“ [النازعات: 24]. ”میں تمہارا بڑا رب ہوں“ (وہ کہا کرتا تھا) لیکن دوسرے چھوٹے چھوٹے معبود بھی تھے جن کے ذریعے سے لوگ فرعون کا تقرب حاصل کرتے تھے ۔\n(3) ہمارے اس انتظام میں یہ رکاوٹ نہیں ڈال سکتے۔ قتل ابناء کا یہ پروگرام فرعونیوں کے کہنے سے بنایا گیا اس سے قبل بھی، جب موسیٰ علیہ السلام کی ولادت نہیں ہوئی تھی، موسیٰ علیہ السلام کے بعد از ولادت خاتمے کے لیے اس نے بنی اسرائیل کے نومولود بچوں کو قتل کرنا شروع کیا تھا، اللہ تعالیٰ نے موسیٰ علیہ السلام کی ولادت کے بعد ان کو بچانے کی یہ تدبیر کی کہ موسیٰ علیہ السلام کو خود فرعون کے محل میں پہنچوا کر اسی کی گود میں ان کی پرورش کروائی۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waqāla al-mala-u min qawmi fir'ʿawna atadharu mūsā waqawmahu liyuf'sidū fī al-arḍi wayadharaka waālihataka qāla sanuqattilu abnāahum wanastaḥyī nisāahum wa-innā fawqahum qāhirūna ","translations":["And said","the chiefs","of","(the) people","(of) Firaun","Will you leave","Musa","and his people","so that they cause corruption","in","the earth","and forsake you","and your gods","He said","We will kill","their sons","and we will let live","their women","and indeed, we","over them","(are) subjugators","(127)"],"transliterationArr":["waqāla","al-mala-u","min","qawmi","fir'ʿawna","atadharu","mūsā","waqawmahu","liyuf'sidū","fī","al-arḍi","wayadharaka","waālihataka","qāla","sanuqattilu","abnāahum","wanastaḥyī","nisāahum","wa-innā","fawqahum","qāhirūna",null],"verseTiming":[[1,0,880],[2,880,1830],[3,1830,3000],[4,3000,3600],[5,3600,4690],[6,4690,5660],[7,5660,6570],[8,6570,7690],[9,7690,9130],[10,9130,9430],[11,9430,10350],[12,10350,11550],[13,11550,13690],[14,13690,14270],[15,14270,15580],[16,15580,18150],[17,18150,19630],[18,19630,22159],[19,22159,23839],[20,23839,25039],[21,25039,28054]]}}