{"name":"7:133","price":"پھر ہم نے ان پر طوفان بھیجا اور ٹڈیاں اور گھن کا کیڑا اور مینڈک اور خون، کہ یہ سب کھلے کھلے معجزے تھے(1) ۔ سو وه تکبر کرتے رہے اور وه لوگ کچھ تھے ہی جرائم پیشہ۔","arabic":"فَأَرۡسَلۡنَا عَلَيۡهِمُ ٱلطُّوفَانَ وَٱلۡجَرَادَ وَٱلۡقُمَّلَ وَٱلضَّفَادِعَ وَٱلدَّمَ ءَايَٰتٖ مُّفَصَّلَٰتٖ فَٱسۡتَكۡبَرُواْ وَكَانُواْ قَوۡمٗا مُّجۡرِمِينَ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":1087,"juzNumber":9,"footnotes":"(1) طوفان سے سیلاب یا کثرت بارش، جس سے ہر چیز غرق ہوگئی ، یا کثرت اموات مراد ہے، جس سے ہر گھر میں ماتم برپا ہوگیا۔ ”جَرَادٌ“ ٹڈی کو کہتے ہیں ، ٹڈی دل کا حملہ فصلوں کی ویرانی کے لیے مشہور ہے۔ یہ ٹڈیاں ان کے غلوں اور پھلوں کی فصلوں کو کھا کر چٹ کر جاتیں۔ ”قُمَّلٌ“ سے مراد جوں ہیں جو انسان کے جسم، کپڑے اور بالوں میں ہوجاتی ہیں یا گھن کا کیڑا ہے جو غلے میں لگ جاتا ہے تو اس کے بیشتر حصے کو ختم کر دیتا ہے۔ جووں سے انسان کو گھن بھی آتی ہے اور اس کی کثرت سے سخت پریشانی بھی ۔ اور جب یہ بطور عذاب ہوں تو اسے لاحق ہونے والی پریشانی کا اندازہ کیا جاسکتا ہے۔ اسی طرح گھن کا عذاب بھی معیشت کو کھوکھلا کر دینے کے لیے کافی ہے۔ ”ضَفَادِعُ“ ضَفْدَعَةٌ کی جمع ہے یہ مینڈک کو کہتے ہیں جو پانی اور جوہڑوں، چھپڑوں میں ہوتا ہے۔ یہ مینڈک ان کے کھانوں میں، بستروں میں، ابلے ہوئے غلوں میں غرض ہر جگہ اور ہر طرف مینڈک ہی مینڈک ہوگئے، جس سے ان کا کھانا پینا، سونا اور آرام کرنا حرام ہوگیا۔ ”دم“ (خون) سے مراد ہے پانی کا خون بن جانا، یوں پانی پینا ان کے لیے ناممکن ہوگیا۔ بعض نے خون سے مراد نکسیر کی بیماری لی ہے۔ یعنی ہر شخص کی ناک سے خون جاری ہوگیا، ”آيَاتٌ مُفَصَّلاتٌ“ یہ کھلے کھلے اور جدا جدا معجزے تھے، جو وقفے وقفے سے ان کے پاس آئے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"fa-arsalnā ʿalayhimu al-ṭūfāna wal-jarāda wal-qumala wal-ḍafādiʿa wal-dama āyātin mufaṣṣalātin fa-is'takbarū wakānū qawman muj'rimīna ","translations":["So We sent","on them","the flood","and the locusts","and the lice","and the frogs","and the blood","(as) signs","manifest","but they showed arrogance","and they were","a people","criminal","(133)"],"transliterationArr":["fa-arsalnā","ʿalayhimu","al-ṭūfāna","wal-jarāda","wal-qumala","wal-ḍafādiʿa","wal-dama","āyātin","mufaṣṣalātin","fa-is'takbarū","wakānū","qawman","muj'rimīna",null],"verseTiming":[[1,0,1660],[2,1660,2650],[3,2650,4040],[4,4040,5560],[5,5560,7510],[6,7510,9240],[7,9240,9870],[8,9870,11060],[9,11060,14300],[10,14300,15930],[11,15930,16990],[12,16990,17680],[13,17680,21655]]}}