{"name":"7:131","price":"سو جب ان پر خوشحالی آجاتی تو کہتے کہ یہ تو ہمارے لیے ہونا ہی چاہئے اور اگر ان کو کوئی بدحالی پیش آتی تو موسیٰ (علیہ السلام) اور ان کے ساتھیوں کی نحوست بتلاتے(1) ۔ یاد رکھو کہ ان کی نحوست اللہ تعالیٰ کے پاس ہے(2)، لیکن ان کے اکثر لوگ نہیں جانتے۔","arabic":"فَإِذَا جَآءَتۡهُمُ ٱلۡحَسَنَةُ قَالُواْ لَنَا هَٰذِهِۦۖ وَإِن تُصِبۡهُمۡ سَيِّئَةٞ يَطَّيَّرُواْ بِمُوسَىٰ وَمَن مَّعَهُۥٓۗ أَلَآ إِنَّمَا طَٰٓئِرُهُمۡ عِندَ ٱللَّهِ وَلَٰكِنَّ أَكۡثَرَهُمۡ لَا يَعۡلَمُونَ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":1085,"juzNumber":9,"footnotes":"(1) ”حَسَنَةٌ“ (بھلائی) سے مراد غلے اور پھلوں کی فراوانی اور”سيِّئَةٌ“ (برائی) سے اس کے برعکس اور قحط سالی اور پیداوار میں کمی۔ حَسَنَةٌ کا سارا کریڈٹ خود لے لیتے کہ یہ ہماری محنت کا ثمرہ ہے اور بدحالی کا سبب حضرت موسیٰ علیہ السلام اور ان پر ایمان لانے والوں کو قرار دیتے کہ یہ تم لوگوں کی نحوست کے اثرات ہمارے ملک پر پڑ رہے ہیں۔\n(2) ”طَآئِرٌ“ کے معنی ہیں ”اڑنے والا“ یعنی پرندہ ۔ چوں کہ پرندے کے بائیں یا دائیں اڑنے سے وہ لوگ نیک فالی یا بدفالی لیا کرتے تھے۔ اس لیے یہ لفظ مطلق فال کے لیے بھی استعمال ہونے لگ گیا اور یہاں یہ اسی معنی میں استعمال ہوا ہے۔ اللہ تعالیٰ نے فرمایا کہ خیر یا شر، جو خوش حالی یا قحط سالی کی وجہ سے انہیں پہنچتا ہے، اس کے اسباب اللہ تعالیٰ کی طرف سے ہیں، موسیٰ علیہ السلام اور ان کے پیروکار اس کا سبب نہیں۔ کا مطلب ہوگا کہ ان کی بدشگونی کا سبب اللہ کے علم میں ہے اور وہ ان کا کفر وانکار ہے نہ کہ کچھ اور۔ یا اللہ کی طرف سے ہے اور اس کی وجہ ان کا کفر ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"fa-idhā jāathumu al-ḥasanatu qālū lanā hādhihi wa-in tuṣib'hum sayyi-atun yaṭṭayyarū bimūsā waman maʿahu alā innamā ṭāiruhum ʿinda al-lahi walākinna aktharahum lā yaʿlamūna ","translations":["But when","came to them","the good","they said","For us","(is) this","And if","afflicts them","bad","they ascribe evil omens","to Musa","and who","(were) with him","Behold","Only","their evil omens","(are) with","Allah","but","most of them","(do) not","know","(131)"],"transliterationArr":["fa-idhā","jāathumu","al-ḥasanatu","qālū","lanā","hādhihi","wa-in","tuṣib'hum","sayyi-atun","yaṭṭayyarū","bimūsā","waman","maʿahu","alā","innamā","ṭāiruhum","ʿinda","al-lahi","walākinna","aktharahum","lā","yaʿlamūna",null],"verseTiming":[[1,0,970],[2,970,4010],[3,4010,5150],[4,5150,6060],[5,6060,6790],[6,6790,8040],[7,8040,9340],[8,9340,10660],[9,10660,11800],[10,11800,14590],[11,14590,15610],[12,15610,16200],[13,16200,18580],[14,18580,20530],[15,20530,22240],[16,22240,24860],[17,24860,26170],[18,26170,27110],[19,27110,29120],[20,29120,30400],[21,30400,30880],[22,30880,33755]]}}