{"name":"7:143","price":"اور جب موسیٰ (علیہ السلام) ہمارے وقت پر آئے اور ان کے رب نے ان سے باتیں کیں تو عرض کیا کہ اے میرے پروردگار! اپنا دیدار مجھ کو کرا دیجئے کہ میں آپ کو ایک نظر دیکھ لوں ارشاد ہوا کہ تم مجھ کو ہرگز نہیں دیکھ سکتے(1) لیکن تم اس پہاڑ کی طرف دیکھتے رہو وه اگر اپنی جگہ پر برقرار رہا تو تم بھی مجھے دیکھ سکو گے۔ پس جب ان کے رب نے پہاڑ پر تجلی فرمائی تو تجلی نے اس کے پرخچے اڑا دیئے اور موسیٰ (علیہ السلام) بےہوش ہوکر گر پڑے(2)۔ پھر جب ہوش میں آئے تو عرض کیا، بےشک آپ کی ذات منزه ہے میں آپ کی جناب میں توبہ کرتا ہوں اور میں سب سے پہلے آپ پر ایمان ﻻنے واﻻ ہوں۔(3)","arabic":"وَلَمَّا جَآءَ مُوسَىٰ لِمِيقَٰتِنَا وَكَلَّمَهُۥ رَبُّهُۥ قَالَ رَبِّ أَرِنِيٓ أَنظُرۡ إِلَيۡكَۚ قَالَ لَن تَرَىٰنِي وَلَٰكِنِ ٱنظُرۡ إِلَى ٱلۡجَبَلِ فَإِنِ ٱسۡتَقَرَّ مَكَانَهُۥ فَسَوۡفَ تَرَىٰنِيۚ فَلَمَّا تَجَلَّىٰ رَبُّهُۥ لِلۡجَبَلِ جَعَلَهُۥ دَكّٗا وَخَرَّ مُوسَىٰ صَعِقٗاۚ فَلَمَّآ أَفَاقَ قَالَ سُبۡحَٰنَكَ تُبۡتُ إِلَيۡكَ وَأَنَا۠ أَوَّلُ ٱلۡمُؤۡمِنِينَ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":1097,"juzNumber":9,"footnotes":"(1) جب موسیٰ علیہ السلام طور پر گئے اور وہاں اللہ نے ان سے براہ راست گفتگو کی، تو حضرت موسیٰ علیہ السلام کے دل میں اللہ کو دیکھنے کا بھی شوق پیدا ہوا، اور اپنے اس شوق کا اظہار ربِّ أرِنِي کہہ کر کیا ۔ جس کے جواب میں اللہ تعالیٰ نے فرمایا کہ لَنْ تَرَانِي (تو مجھے ہر گز نہیں دیکھ سکتا) اس سے استدلال کرتے ہوئے معتزلہ نے کہا کہ لَنْ نَفْيُ تَأْبِيدٍ (ہمیشہ کی نفی) کے لیے آتا ہے۔ اس لیے اللہ کا دیدار نہ دنیا میں ممکن ہے نہ آخرت میں۔ لیکن معتزلہ کا یہ مسلک صحیح احادیث کے خلاف ہے۔ متواتر، صحیح اور قوی روایات سے ثابت ہے کہ قیامت والے دن اہل ایمان اللہ کو دیکھیں گے اور جنت میں بھی دیدار الہیٰ سے مشرف ہوں گے۔ تمام اہل سنت کا یہی عقیدہ ہے۔ اس نفی رویت کا تعلق صرف دنیا سے ہے۔ دنیا میں کوئی انسانی آنکھ اللہ کو دیکھنے پرقادر نہیں ہے۔ لیکن آخرت میں اللہ تعالیٰ ان آنکھوں میں اتنی قوت پیدا فرما دے گا کہ وہ اللہ تعالیٰ کے جلوے کو برداشت کرسکے۔\n(2) یعنی وہ پہاڑ بھی رب کی تجلی کو برداشت نہ کرسکا اور موسیٰ علیہ السلام بےہوش ہوکر گر پڑے ۔ حدیث میں آتا ہے کہ ”قیامت والے دن سب لوگ بےہوش ہوں گے، (یہ بےہوشی امام ابن کثیر کے بقول میدان محشر میں اس وقت ہوگی جب اللہ تعالیٰ فیصلے کرنے کے لیے نزول اجلال فرمائے گا) اور جب ہوش میں آئیں گے تو میں ہوش میں آنے والوں میں سب سے پہلا شخص ہوں گا، میں دیکھوں گا کہ موسیٰ (عليه السلام) عرش کا پایہ تھامے کھڑے ہیں، مجھے نہیں معلوم کہ وہ مجھ سے پہلے ہوش میں آئے یا انہیں کوہ طور کی بے ہوشی کے بدلے میں میدان محشر کی بےہوشی سے مستثنیٰ رکھا گیا“۔ (صحيح بخاري- تفسير سورة الأعراف - صحيح مسلم، باب فضائل موسى عليه السلام)\n(3) تیری عظمت وجلالت کا اور اس بات کا کہ میں تیرا عاجز بندہ ہوں، دنیا میں تیرے دیدار کا متحّمل نہیں ہوسکتا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walammā jāa mūsā limīqātinā wakallamahu rabbuhu qāla rabbi arinī anẓur ilayka qāla lan tarānī walākini unẓur ilā al-jabali fa-ini is'taqarra makānahu fasawfa tarānī falammā tajallā rabbuhu lil'jabali jaʿalahu dakkan wakharra mūsā ṣaʿiqan falammā afāqa qāla sub'ḥānaka tub'tu ilayka wa-anā awwalu al-mu'minīna ","translations":["And when","came","Musa","to Our appointed place","and spoke to him","his Lord","he said","O my Lord","Show me","(that) I may look","at You","He said","Never","you (can) see Me","but","look","at","the mountain","[then] if","it remains","in its place","then","you (will) see Me","But when","revealed (His) Glory","his Lord","to the mountain","He made it","crumbled to dust","and fell down","Musa","unconscious","And when","he recovered","he said","Glory be to You","I turn (in repentance)","to you","and I am","(the) first","(of) the believers","(143)"],"transliterationArr":["walammā","jāa","mūsā","limīqātinā","wakallamahu","rabbuhu","qāla","rabbi","arinī","anẓur","ilayka","qāla","lan","tarānī","walākini","unẓur","ilā","al-jabali","fa-ini","is'taqarra","makānahu","fasawfa","tarānī","falammā","tajallā","rabbuhu","lil'jabali","jaʿalahu","dakkan","wakharra","mūsā","ṣaʿiqan","falammā","afāqa","qāla","sub'ḥānaka","tub'tu","ilayka","wa-anā","awwalu","al-mu'minīna",null],"verseTiming":[[1,0,1750],[2,1750,3910],[3,3910,4750],[4,4750,6530],[5,6530,8030],[6,8030,9060],[7,9060,9720],[8,9720,10440],[9,10440,12639],[10,12639,14539],[11,14539,16729],[12,16729,17999],[13,17999,19059],[14,19059,20229],[15,20229,21369],[16,21369,22509],[17,22509,22869],[18,22869,23819],[19,23819,24419],[20,24419,25559],[21,25559,26799],[22,26799,27759],[23,27759,28899],[24,28899,31739],[25,31739,32919],[26,32919,34009],[27,34009,35099],[28,35099,36179],[29,36179,37399],[30,37399,38849],[31,38849,39659],[32,39659,41389],[33,41389,44419],[34,44419,45299],[35,45299,45899],[36,45899,47189],[37,47189,47879],[38,47879,48789],[39,48789,49379],[40,49379,50249],[41,50249,53354]]}}