{"name":"7:167","price":"اور وه وقت یاد کرنا چاہیئے کہ آپ کے رب نے یہ بات بتلا دی کہ وه ان یہود پر قیامت تک ایسے شخص کو ضرور مسلط کرتا رہے گا(1) جو ان کو سزائے شدید کی تکلیف پہنچاتا رہے گا، بلاشبہ آپ کا رب جلدی ہی سزا دے دیتا ہے اور بلاشبہ وه واقعی بڑی مغفرت اور بڑی رحمت واﻻ ہے۔(2)","arabic":"وَإِذۡ تَأَذَّنَ رَبُّكَ لَيَبۡعَثَنَّ عَلَيۡهِمۡ إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِ مَن يَسُومُهُمۡ سُوٓءَ ٱلۡعَذَابِۗ إِنَّ رَبَّكَ لَسَرِيعُ ٱلۡعِقَابِ وَإِنَّهُۥ لَغَفُورٞ رَّحِيمٞ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":1121,"juzNumber":9,"footnotes":"(1) ”تَأَذَّنَ“ إِيذَانٌ بمعنی إِعْلامٍ (خبر دینا، جتلا دینا) سے باب تفعل ہے۔ یعنی وہ وقت بھی یاد کرو! جب آپ کے رب نے ان یہودیوں کو اچھی طرح باخبر کر دیا یا جتلا دیا تھا، ”لَيَبْعَثَنَّ“ میں لام تاکید ہے جو قسم کے معنی کا فائدہ دیتا ہے۔ یعنی قسم کھا کر نہایت تاکید کے ساتھ اللہ تعالیٰ فرما رہا ہے کہ وہ ان پر قیامت تک ایسے لوگوں کو مسلط کرتا رہے گا جو ان کو سخت عذاب میں مبتلا رکھیں گے، چنانچہ یہودیوں کی پوری تاریخ اسی ذلت ومسکنت اور غلامی ومحکومی کی تاریخ ہے جس کی خبر اللہ تعالیٰ نے اس آیت میں دی ہے۔ اسرائیل کی موجودہ حکومت قرآن کی بیان کردہ اس حقیقت کے خلاف نہیں ہے اس لیے کہ وہ قرآن ہی کے بیان کردہ استثنا وَحَبْلٍ مِنَ النَّاسِ کی مظہر ہے جو قرآنی حقیقت کے خلاف نہیں بلکہ اس کی مؤید ہے۔ (تفصیل کے لیے دیکھئے آل عمران: 112 کا حاشیہ)\n(2) یعنی اگر ان میں سے کوئی توبہ کرکے مسلمان ہو جائے گا تو وہ اس ذلت وسوء عذاب سے بچ جائے گا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-idh ta-adhana rabbuka layabʿathanna ʿalayhim ilā yawmi al-qiyāmati man yasūmuhum sūa al-ʿadhābi inna rabbaka lasarīʿu al-ʿiqābi wa-innahu laghafūrun raḥīmun ","translations":["And when","declared","your Lord","that He would surely send","upon them","till","(the) Day","(of) the Resurrection","(those) who","would afflict them","(with) a grievous","[the] punishment","Indeed","your Lord","(is) surely swift","(in) the retribution","but indeed, He","(is) surely Oft-Forgiving","Most Merciful","(167)"],"transliterationArr":["wa-idh","ta-adhana","rabbuka","layabʿathanna","ʿalayhim","ilā","yawmi","al-qiyāmati","man","yasūmuhum","sūa","al-ʿadhābi","inna","rabbaka","lasarīʿu","al-ʿiqābi","wa-innahu","laghafūrun","raḥīmun",null],"verseTiming":[[1,0,770],[2,770,1840],[3,1840,2700],[4,2700,4830],[5,4830,5960],[6,5960,6570],[7,6570,7230],[8,7230,8540],[9,8540,8750],[10,8750,9880],[11,9880,10810],[12,10810,12920],[13,12920,15659],[14,15659,17289],[15,17289,18249],[16,18249,19189],[17,19189,22419],[18,22419,24469],[19,24469,25599],[20,25599,29024]]}}