{"name":"7:170","price":"اور جو لوگ کتاب کے پابند ہیں اور نماز کی پابندی کرتے ہیں، ہم ایسے لوگوں کا جو اپنی اصلاح کریں ﺛواب ضائع نہ کریں گے۔(1)","arabic":"وَٱلَّذِينَ يُمَسِّكُونَ بِٱلۡكِتَٰبِ وَأَقَامُواْ ٱلصَّلَوٰةَ إِنَّا لَا نُضِيعُ أَجۡرَ ٱلۡمُصۡلِحِينَ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":1124,"juzNumber":9,"footnotes":"(1) ان لوگوں میں سے جو تقویٰ کا راستہ اختیار کرلیں، کتاب کو مضبوطی سے تھام لیں، جس سے مراد اصلی تورات ہے اور جس پر عمل کرتے ہوئے نبوت محمدی پر ایمان لے آئیں، نماز وغیرہ کی پابندی کریں، تو اللہ ایسے مصلحین کا اجر ضائع نہیں کرے گا ۔ اس میں ان اہل کتاب (سیاق کلام سے یہاں بطور خاص یہود) کا ذکر ہے جو تقویٰ ، تمسک بالکتاب اور اقامت صلوٰۃٔ کا اہتمام کریں اور ان کے لیے آخرت کی خوش خبری ہے۔ اس سے مطلب یہ ہے کہ وہ مسلمان ہوجائیں اور رسالت محمدیہ پر ایمان لے آئیں۔ کیونکہ اب پیغمبر آخر الزمان حضرت محمد مصطفیٰ (صلى الله عليه وسلم) پر ایمان لائے بغیر نجات اخروی ممکن نہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-alladhīna yumassikūna bil-kitābi wa-aqāmū al-ṣalata innā lā nuḍīʿu ajra al-muṣ'liḥīna ","translations":["And those who","hold fast","to the Book","and establish","the prayer","indeed, We","(will) not","[We] let go waste","(the) reward","(of) the reformers","(170)"],"transliterationArr":["wa-alladhīna","yumassikūna","bil-kitābi","wa-aqāmū","al-ṣalata","innā","lā","nuḍīʿu","ajra","al-muṣ'liḥīna",null],"verseTiming":[[1,0,1300],[2,1300,2900],[3,2900,4170],[4,4170,5300],[5,5300,6420],[6,6420,8140],[7,8140,8520],[8,8520,9380],[9,9380,9970],[10,9970,13565]]}}