{"name":"7:172","price":"اور جب آپ کے رب نے اوﻻد آدم کی پشت سے ان کی اوﻻد کو نکالا اور ان سے ان ہی کے متعلق اقرار لیا کہ کیا میں تمہارا رب نہیں ہوں؟ سب نے جواب دیا کیوں نہیں! ہم سب گواه بنتے ہیں(1) ۔ تاکہ تم لوگ قیامت کے روز یوں نہ کہو کہ ہم تو اس سے محض بے خبر تھے۔","arabic":"وَإِذۡ أَخَذَ رَبُّكَ مِنۢ بَنِيٓ ءَادَمَ مِن ظُهُورِهِمۡ ذُرِّيَّتَهُمۡ وَأَشۡهَدَهُمۡ عَلَىٰٓ أَنفُسِهِمۡ أَلَسۡتُ بِرَبِّكُمۡۖ قَالُواْ بَلَىٰ شَهِدۡنَآۚ أَن تَقُولُواْ يَوۡمَ ٱلۡقِيَٰمَةِ إِنَّا كُنَّا عَنۡ هَٰذَا غَٰفِلِينَ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":1126,"juzNumber":9,"footnotes":"(1) یہ عَهْدِ أَلَسْتُ کہلاتا ہے جو أَلَسْتُ بِرَبِّكُمْ سے بنی ہوئی ترکیب ہے ۔ یہ عہد حضرت آدم (عليه السلام) کی تخلیق کے بعد ان کی پشت سے ہونے والی تمام اولاد سے لیا گیا۔ اس کی تفصیل ایک صحیح حدیث میں اس طرح آتی ہے کہ ”عرفہ والے دن نعمان جگہ میں اللہ تعالیٰ نے اصلاب آدم سے عہد (میثاق) لیا۔ پس آدم کی پشت سے ان کی ہونے والی تمام اولاد کو نکالا اور اس کو اپنے سامنے پھیلا دیا اور ان سے پوچھا، (کیا میں تمہارا رب نہیں ہوں ؟) سب نے کہا ” بَلَى، شَهِدْنَا“ (کیوں نہیں۔ ہم سب رب ہونے کی گواہی دیتے ہیں) (مسند أحمد ۔ جلد 1ص 272، والحاكم ۔ جلد ،2 ص 544، وصححه ووافقه الذهبي) امام شوکانی اس حدیث کی بابت لکھتے ہیں ”وَإِسْنَادُهُ لا مَطْعَنَ فِيهِ“ (فتح القدیر) (اس کی سند میں کوئی طعن نہیں) نیز امام شوکانی فرماتے ہیں ”یہ عالم ذر کہلاتا ہے اس کی یہی تفسیر صحیح اور حق ہے جس سے عدول اور کسی اور مفہوم کی طرف جانا صحیح نہیں ہے کیونکہ یہ مرفوع حدیث اور آثار صحابہ سے ثابت ہے اور اسے مجاز پر بھی محمول کرنا جائز نہیں ہے“۔ بہرحال اللہ کی ربوبیت کی یہ گواہی ہر انسان کی فطرت میں ودیعت ہے۔ اسی مفہوم کو رسول اللہ (صلى الله عليه وسلم) نے اس طرح بیان فرمایا ہے کہ ”ہر بچہ فطرت پر پیدا ہوتا ہے، پس اس کے ماں باپ اس کو یہودی یا نصرانی یا مجوسی بنا دیتے ہیں ۔ جس طرح جانور کابچہ صحیح سالم پیدا ہوتا ہے، اس کا ناک، کان کٹا نہیں ہوتا“۔ (صحيح بخاري- كتاب الجنائز ومسلم، كتاب القدر) اور صحیح مسلم کی روایت ہے ۔ اللہ تعالیٰ فرماتا ہے ”میں نے اپنے بندوں کو حنیف (اللہ کی طرف یکسوئی سے متوجہ ہونے والا) پیدا کیا ہے۔ پس شیطان ان کو ان کے دین (فطری) سے گمراہ کر دیتا ہے“۔ الحدیث (صحيح مسلم- كتاب الجنة) یہ فطرت یا دین فطرت، یہی رب کی توحید اور اس کی نازل کردہ شریعت ہے جو اب اسلام کی صورت میں محفوظ اور موجود ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-idh akhadha rabbuka min banī ādama min ẓuhūrihim dhurriyyatahum wa-ashhadahum ʿalā anfusihim alastu birabbikum qālū balā shahid'nā an taqūlū yawma al-qiyāmati innā kunnā ʿan hādhā ghāfilīna ","translations":["And when","(was) taken","(by) your Lord","from","(the) Children","(of) Adam ","from","their loins ","their descendants","and made them testify","over","themselves","Am I not","your Lord","They said","Yes","we have testified","Lest","you say","(on the) Day","(of) the Resurrection","Indeed","we were","about","this","unaware","(172)"],"transliterationArr":["wa-idh","akhadha","rabbuka","min","banī","ādama","min","ẓuhūrihim","dhurriyyatahum","wa-ashhadahum","ʿalā","anfusihim","alastu","birabbikum","qālū","balā","shahid'nā","an","taqūlū","yawma","al-qiyāmati","innā","kunnā","ʿan","hādhā","ghāfilīna",null],"verseTiming":[[1,0,590],[2,590,1250],[3,1250,2080],[4,2080,3110],[5,3110,4900],[6,4900,5750],[7,5750,6820],[8,6820,8170],[9,8170,9970],[10,9970,11850],[11,11850,13210],[12,13210,14760],[13,14760,16760],[14,16760,17610],[15,17610,18910],[16,18910,19690],[17,19690,20430],[18,20430,23480],[19,23480,24340],[20,24340,25440],[21,25440,26050],[22,26050,27470],[23,27470,28680],[24,28680,30330],[25,30330,30660],[26,30660,31530],[27,31530,34735]]}}