{"name":"7:179","price":"اور ہم نے ایسے بہت سے جن اور انسان دوزخ کے لیے پیدا کئے ہیں(1) ، جن کے دل ایسے ہیں جن سے نہیں سمجھتے اور جن کی آنکھیں ایسی ہیں جن سے نہیں دیکھتے اور جن کے کان ایسے ہیں جن سے نہیں سنتے۔ یہ لوگ چوپایوں کی طرح ہیں بلکہ یہ ان سے بھی زیاده گمراه ہیں(2)۔ یہی لوگ غافل ہیں۔","arabic":"وَلَقَدۡ ذَرَأۡنَا لِجَهَنَّمَ كَثِيرٗا مِّنَ ٱلۡجِنِّ وَٱلۡإِنسِۖ لَهُمۡ قُلُوبٞ لَّا يَفۡقَهُونَ بِهَا وَلَهُمۡ أَعۡيُنٞ لَّا يُبۡصِرُونَ بِهَا وَلَهُمۡ ءَاذَانٞ لَّا يَسۡمَعُونَ بِهَآۚ أُوْلَٰٓئِكَ كَٱلۡأَنۡعَٰمِ بَلۡ هُمۡ أَضَلُّۚ أُوْلَٰٓئِكَ هُمُ ٱلۡغَٰفِلُونَ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":1133,"juzNumber":9,"footnotes":"(1) اس کا تعلق تقدیر سے ہے ۔ یعنی ہر انسان اور جن کی بابت اللہ کو علم تھا کہ وہ دنیا میں جاکر اچھے یا برے کیا عمل کرے گا، اس کے مطابق اس نے لکھ رکھا ہے ۔ یہاں انہی دوزخیوں کا ذکر ہے جنہیں اللہ کے علم کے مطابق دوزخ والے ہی کام کرنے تھے۔ آگے ان کی مزید صفات بیان کرکے بتا دیا گیا کہ جن لوگوں کے اندر یہ چیزیں اسی انداز میں ہوں جس کا ذکر یہاں کیا گیا ہے، تو سمجھ لو کہ اس کا انجام برا ہے۔\n(2) یعنی دل، آنکھ، کان یہ چیز یں اللہ نے اس لیے دی ہیں کہ انسان ان سے فائدہ اٹھاتے ہوئے اپنے پروردگار کو سمجھے، اس کی آیات کامشاہدہ کرے اور حق کی بات کو غور سے سنے۔ لیکن جو شخص ان مشاعر سے یہ کام نہیں لیتا، وہ گویا ان سے عدم انتفاع (فائدہ نہ اٹھانے) میں چوپایوں کی طرح بلکہ ان سے بھی زیادہ گمراہ ہے۔ اس لیے کہ چوپایے تو پھر بھی اپنے نفع نقصان کا کچھ شعور رکھتے ہیں اور نفع والی چیزوں سے نفع اٹھاتے اور نقصان دینے والی چیزوں سے بچ کر رہتے ہیں۔ لیکن اللہ تعالیٰ کی ہدایت سے اعراض کرنے والے شخص کے اندر تو یہ تمیز کرنے کی صلاحیت ہی ختم ہو جاتی ہے کہ اس کے لیے مفید چیز کون سی ہے اور مضر کون سی؟ اسی لیے اگلے جملے میں انہیں غافل بھی کہا گیا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walaqad dharanā lijahannama kathīran mina al-jini wal-insi lahum qulūbun lā yafqahūna bihā walahum aʿyunun lā yub'ṣirūna bihā walahum ādhānun lā yasmaʿūna bihā ulāika kal-anʿāmi bal hum aḍallu ulāika humu al-ghāfilūna ","translations":["And certainly","We have created","for Hell","many","of","the jinn","and men","For them","(are) hearts","(but) not","they understand","with them","and for them","(are) eyes","(but) not","they see","with them","and for them","(are) ears","(but) not","they hear","with them","Those","(are) like cattle","nay","they","(are) more astray","Those ","they","(are) the heedless","(179)"],"transliterationArr":["walaqad","dharanā","lijahannama","kathīran","mina","al-jini","wal-insi","lahum","qulūbun","lā","yafqahūna","bihā","walahum","aʿyunun","lā","yub'ṣirūna","bihā","walahum","ādhānun","lā","yasmaʿūna","bihā","ulāika","kal-anʿāmi","bal","hum","aḍallu","ulāika","humu","al-ghāfilūna",null],"verseTiming":[[1,0,920],[2,920,1950],[3,1950,3770],[4,3770,4650],[5,4650,5810],[6,5810,7450],[7,7450,10300],[8,10300,10960],[9,10960,11840],[10,11840,12520],[11,12520,13680],[12,13680,14520],[13,14520,15180],[14,15180,16140],[15,16140,16810],[16,16810,18040],[17,18040,18780],[18,18780,19530],[19,19530,20950],[20,20950,21440],[21,21440,22750],[22,22750,23490],[23,23490,26500],[24,26500,28030],[25,28030,28480],[26,28480,28910],[27,28910,29690],[28,29690,32619],[29,32619,33069],[30,33069,36234]]}}