{"name":"7:189","price":"وه اللہ تعالیٰ ایسا ہے جس نے تم کو ایک تن واحد سے پیدا کیا(1) اور اسی سے اس کا جوڑا بنایا(2) تاکہ وه اس اپنے جوڑے سے انس حاصل کرے(3) پھر جب میاں نے بیوی سے قربت کی تو(4) اس کو حمل ره گیا ہلکا سا۔ سو وه اس کو لئے ہوئے چلتی پھرتی رہی(5)، پھر جب وه بوجھل ہوگئی تو دونوں میاں بیوی اللہ سے جو ان کا مالک ہے دعا کرنے لگے کہ اگر تو نے ہم کو صحیح سالم اوﻻد دے دی تو ہم خوب شکر گزاری کریں گے۔(6)","arabic":"۞ هُوَ ٱلَّذِي خَلَقَكُم مِّن نَّفۡسٖ وَٰحِدَةٖ وَجَعَلَ مِنۡهَا زَوۡجَهَا لِيَسۡكُنَ إِلَيۡهَاۖ فَلَمَّا تَغَشَّىٰهَا حَمَلَتۡ حَمۡلًا خَفِيفٗا فَمَرَّتۡ بِهِۦۖ فَلَمَّآ أَثۡقَلَت دَّعَوَا ٱللَّهَ رَبَّهُمَا لَئِنۡ ءَاتَيۡتَنَا صَٰلِحٗا لَّنَكُونَنَّ مِنَ ٱلشَّٰكِرِينَ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":1143,"juzNumber":9,"footnotes":"(1) ابتدا یعنی حضرت آدم (عليه السلام) سے ۔ اسی لیے ان کو انسان اول اور ابو البشر کہا جاتا ہے۔\n(2) اس سے مراد حضرت حوا ہیں، جو حضرت آدم (عليه السلام) کی زوج بنیں۔ ان کی تخلیق حضرت آدم (عليه السلام) سے ہوئی، جس طرح کہ منھا کی ضمیر سے، جو نفس واحدۂ کی طرف راجع ہے، واضح ہے (مزید دیکھئے سورہ نساء آیت 1، کا حاشیہ)\n(3) یعنی اس سے اطمینان وسکون حاصل کرے۔ اس لیے کہ ایک جنس اپنے ہی ہم جنس سے صحیح معنوں میں مانوس اور قریب ہوسکتی ہے جو سکون حاصل کرنے کے لیے ضروری ہے۔ قربت کے بغیر یہ ممکن ہی نہیں۔ دوسرے مقام پر اللہ تعالیٰ نے فرمایا: «وَمِنۡ ءَايَٰتِهِۦٓ أَنۡ خَلَقَ لَكُم مِّنۡ أَنفُسِكُمۡ أَزۡوَٰجٗا لِّتَسۡكُنُوٓاْ إِلَيۡهَا وَجَعَلَ بَيۡنَكُم مَّوَدَّةٗ وَرَحۡمَةً» [الروم: 21]. ”اللہ کی نشانیوں میں سے یہ بھی ہے کہ اس نے تمہارے لیے تم ہی میں سے ( یا تمہاری جنس ہی میں سے ) جوڑے پیدا کیے، تاکہ تم ان سے سکون حاصل کرو اور تمہارے درمیان اس نے پیار ومحبت رکھ دی“۔ یعنی اللہ نے مرد اور عورت دونوں کے اندر ایک دوسرے کے لیے جو جذبات اور کشش رکھی ہے، فطرت کے یہ تقاضے وہ جوڑا بن کر پورا کرتے ہیں اور ایک دوسرے سے قرب وانس حاصل کرتے ہیں۔ چنانچہ یہ واقعہ ہے کہ جو باہمی پیار میاں بیوی کے درمیان ہوتا ہے وہ دنیا میں کسی اور کے ساتھ نہیں ہوتا۔\n(4) یعنی یہ نسل انسانی اس طرح بڑھی اور آگے چل کر جب ان میں سے ایک زوج یعنی میاں بیوی نے ایک دوسرے سے قربت کی۔ ”تَغَشَّاهَا“ کے معنی بیوی سے ہم بستری کرنا ہیں۔ یعنی وطی کرنے کے لیے ڈھانپا۔\n(5) یعنی حمل کے ابتدائی ایام میں حتیٰ کہ نطفے سے عَلَقَةٌ اور عَلَقَةٌ سے مُضْغَةٌ بننے تک، حمل خفیف ہی رہتا ہے، محسوس بھی نہیں ہوتا اور عورت کو زیادہ گرانی بھی نہیں ہوتی۔\n(6) بوجھل ہو جانے سے مراد، جب بچہ پیٹ میں بڑا ہو جاتا ہے تو جوں جوں ولادت کا وقت قریب آتا جاتا ہے، والدین کے دل میں خطرات اور توہمات پیدا ہوتے جاتے ہیں (بالخصوص جب عورت کو اٹھراہ کی بیماری ہو) تو انسانی فطرت ہے کہ خطرات میں وہ اللہ کی طرف رجوع کرتا ہے، چنانچہ وہ دونوں اللہ سے دعائیں کرتے ہیں اور شکر گزاری کا عہد کرتے ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"huwa alladhī khalaqakum min nafsin wāḥidatin wajaʿala min'hā zawjahā liyaskuna ilayhā falammā taghashāhā ḥamalat ḥamlan khafīfan famarrat bihi falammā athqalat daʿawā al-laha rabbahumā la-in ātaytanā ṣāliḥan lanakūnanna mina al-shākirīna ","translations":["He","(is) the One Who","created you","from","a soul","single","and made","from it","its mate","that he might live","with her","And when","he covers her","she carries","a burden","light","and continues","with it","But when","she grows heavy","they both invoke","Allah","their Lord","If","You give us","a righteous (child)","surely we will be","among","the thankful","(189)"],"transliterationArr":["huwa","alladhī","khalaqakum","min","nafsin","wāḥidatin","wajaʿala","min'hā","zawjahā","liyaskuna","ilayhā","falammā","taghashāhā","ḥamalat","ḥamlan","khafīfan","famarrat","bihi","falammā","athqalat","daʿawā","al-laha","rabbahumā","la-in","ātaytanā","ṣāliḥan","lanakūnanna","mina","al-shākirīna",null],"verseTiming":[[1,0,400],[2,400,1300],[3,1300,2220],[4,2220,3250],[5,3250,5750],[6,5750,7480],[7,7480,8260],[8,8260,9080],[9,9080,10170],[10,10170,11200],[11,11200,12350],[12,12350,14710],[13,14710,16240],[14,16240,17080],[15,17080,17890],[16,17890,19700],[17,19700,20710],[18,20710,21650],[19,21650,25190],[20,25190,26060],[21,26060,26760],[22,26760,27840],[23,27840,29100],[24,29100,29710],[25,29710,31040],[26,31040,32120],[27,32120,34360],[28,34360,34710],[29,34710,38045]]}}