{"name":"7:190","price":"سو جب اللہ نے دونوں کو صحیح سالم اوﻻد دے دی تو اللہ کی دی ہوئی چیز میں وه دونوں اللہ کے شریک قرار دینے لگے(1) ، سو اللہ پاک ہے ان کے شرک سے۔","arabic":"فَلَمَّآ ءَاتَىٰهُمَا صَٰلِحٗا جَعَلَا لَهُۥ شُرَكَآءَ فِيمَآ ءَاتَىٰهُمَاۚ فَتَعَٰلَى ٱللَّهُ عَمَّا يُشۡرِكُونَ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":1144,"juzNumber":9,"footnotes":"(1) شریک قرار دینے سے مراد یا تو بچے کا نام ایسا رکھنا ہے، مثلاً امام بخش، پیراں دتہ ، عبد شمس، بندۂ علی، وغیرہ، جس سے یہ اظہار ہوتا ہو کہ یہ بچہ فلاں بزرگ، فلاں پیر کی (نعوذ باللہ) نظر کرم کا نتیجہ ہے۔ یا پھر اپنے اس عقیدے کا اظہار کرے کہ ہم فلاں بزرگ یا فلاں قبر پر گئے تھے جس کے نتیجے میں یہ بچہ پیدا ہوا ہے۔ یا کسی مردہ کے نام کی نذر نیاز دے یا بچے کو کسی قبر پر لے جاکر اس کا ماتھا وہاں ٹکائے کہ ان کے طفیل بچہ ہوا ہے۔ یہ ساری صورتیں اللہ کا شریک ٹھہرانے کی ہیں، جو بدقسمتی سے مسلمان عوام میں بھی عام ہیں۔ اگلی آیات میں اللہ تعالیٰ شرک کی تردید فرما رہا ہے ۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"falammā ātāhumā ṣāliḥan jaʿalā lahu shurakāa fīmā ātāhumā fataʿālā al-lahu ʿammā yush'rikūna ","translations":["But when","He gives them","a good, (child)","they make","for Him","partners","in what","He has given them","But exalted","(is) Allah","above what","they associate (with Him)","(190)"],"transliterationArr":["falammā","ātāhumā","ṣāliḥan","jaʿalā","lahu","shurakāa","fīmā","ātāhumā","fataʿālā","al-lahu","ʿammā","yush'rikūna",null],"verseTiming":[[1,0,2930],[2,2930,4360],[3,4360,6350],[4,6350,7260],[5,7260,7850],[6,7850,10430],[7,10430,12790],[8,12790,14340],[9,14340,15850],[10,15850,16700],[11,16700,18290],[12,18290,21925]]}}