{"name":"7:199","price":"آپ درگزر کو اختیار کریں(1) نیک کام کی تعلیم دیں(2) اور جاہلوں سے ایک کناره ہو جائیں۔(3)","arabic":"خُذِ ٱلۡعَفۡوَ وَأۡمُرۡ بِٱلۡعُرۡفِ وَأَعۡرِضۡ عَنِ ٱلۡجَٰهِلِينَ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":1153,"juzNumber":9,"footnotes":"(1) بعض علماء نے اس کے معنی کیے ہیں ”خُذْ مَا عَفَا لَكَ مِنْ أَمْوَالِهِمْ أَيْ: مَا فَضَلَ“ یعنی ”جو ضرورت سے زائد مال ہو، وہ لے لو“ اور یہ زکوٰۂ کی فرضیت سے قبل کا حکم ہے۔ ( فتح الباري، جلد 8، ص 305) لیکن دوسرے مفسرین نے اس سے اخلاقی ہدایت یعنی عفو و درگزر مراد لیا ہے اور امام ابن جریر اور امام بخاری وغیرہ نے اسی کو ترجیح دی ہے۔ چنانچہ امام بخاری نے اس کی تفسیر میں حضرت عمر (رضي الله عنه)، کا ایک واقعہ نقل کیا ہے کہ عیینہ بن حصن حضرت عمر (رضي الله عنه)، کی خدمت میں حاضر ہوئے اور آکر ان پر تنقید کرنے لگے کہ آپ ہمیں نہ پوری عطا دیتے ہیں اور نہ ہمارے درمیان انصاف کرتے ہیں جس پر حضرت عمر (رضي الله عنه) غضب ناک ہوئے، یہ صورت حال دیکھ کر حضرت عمر (رضي الله عنه)، کے مشیر حر بن قیس نے (جو عیینہ کے بھیتجے تھے) حضرت عمر س، سے کہا کہ ”اللہ تعالیٰ نے اپنی نبی (صلى الله عليه وسلم) کو حکم فرمایا تھا۔ «خُذِ ٱلۡعَفۡوَ وَأۡمُرۡ بِٱلۡعُرۡفِ وَأَعۡرِضۡ عَنِ ٱلۡجَٰهِلِينَ» [الأعراف: 199]. ”درگزر کو اختیار کیجئے اور نیکی کا حکم دیجئے اور جاہلوں سے اعراض کیجئے“۔ اور یہ بھی جاہلوں میں سے ہے“۔ جس پر حضرت عمر (رضي الله عنه)، نے درگزر فرما دیا۔ ”وَكَانَ وَقَّافًا عِنْدَ كِتَابِ اللهِ“ اور حضرت عمر (رضي الله عنه) اللہ کی کتاب کا حکم سن کر فوراً گردن خم کر دینے والے تھے۔ (صحيح بخاري - تفسير سورة الأعراف ) اس کی تائید ان احادیث سے بھی ہوتی ہے جن میں ظلم کے مقابلے میں معاف کر دینے، قطع رحمی کے مقابلے میں صلۂ رحمی اور برائی کے بدلے احسان کرنے کی تلقین کی گئی ہے ۔\n(2) ”عُرْفٌ“ سے مراد معروف یعنی نیکی ہے ۔\n(3) یعنی جب آپ نیکی کا حکم دینے میں اتمام حجت کر چکیں اور پھر بھی وہ نہ مانیں تو ان سے اعراض فرما لیں اور ان کے جھگڑوں اور حماقتوں کا جواب نہ دیں ۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"khudhi al-ʿafwa wamur bil-ʿur'fi wa-aʿriḍ ʿani al-jāhilīna ","translations":["Hold","(to) forgiveness","and enjoin","the good","and turn away","from","the ignorant","(199)"],"transliterationArr":["khudhi","al-ʿafwa","wamur","bil-ʿur'fi","wa-aʿriḍ","ʿani","al-jāhilīna",null],"verseTiming":[[1,0,550],[2,550,1440],[3,1440,2320],[4,2320,3380],[5,3380,4530],[6,4530,4940],[7,4940,8515]]}}