{"name":"7:204","price":"اور جب قرآن پڑھا جایا کرے تو اس کی طرف کان لگا دیا کرو اور خاموش رہا کرو امید ہے کہ تم پر رحمت ہو۔(1)","arabic":"وَإِذَا قُرِئَ ٱلۡقُرۡءَانُ فَٱسۡتَمِعُواْ لَهُۥ وَأَنصِتُواْ لَعَلَّكُمۡ تُرۡحَمُونَ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":1158,"juzNumber":9,"footnotes":"(1) یہ ان کافروں کو کہا جارہا ہے جو قرآن کی تلاوت کرتے وقت شور کرتے تھے اور اپنے ساتھیوں کو کہتے تھے: «لَا تَسۡمَعُواْ لِهَٰذَا ٱلۡقُرۡءَانِ وَٱلۡغَوۡاْ فِيهِ» [فصلت: 26] ”یہ قرآن مت سنو اور شور کرو“، ان سے کہا گیا کہ اس کے بجائے تم اگر غور سے سنو اور خاموش رہو تو شاید اللہ تعالیٰ تمہیں ہدایت سے نواز دے۔ اور یوں تم رحمت الٰہی کے مستحق بن جاؤ۔\nبعض ائمۂ دین اسے عام مراد لیتے ہیں جب بھی قرآن پڑھا جائے، چاہے نماز ہو یا غیر نماز، سب کو خاموشی سے قرآن سننے کا حکم ہے اور پھر وہ اس عموم سے استدلال کرتے ہوئے جہری نمازوں میں مقتدی کے سورۂ فاتحہ پڑھنے کو بھی اس قرآنی حکم کے خلاف بتاتے ہیں ۔ لیکن دوسرے علماء کی رائے یہ ہے کہ جہری نمازوں میں امام کے پیچھے سورۂ فاتحہ پڑھنے کی تاکید نبی (صلى الله عليه وسلم) سے صحیح احادیث سے ثابت ہے۔ ان کے نزدیک اس آیت کو صرف کفار کے متعلق ہی سمجھنا صحیح ہے، جیسا کہ اس کے مکی ہونے سے بھی اس کی تائید ہوتی ہے۔ لیکن اگر اسے عام سمجھا جائے تب بھی اس عموم سے نبی (صلى الله عليه وسلم) نے مقتدیوں کو خارج فرما دیا اور یوں قرآن کے اس عموم کے باوجود جہری نمازوں میں مقتدیوں کا سورہ فاتحہ پڑھنا ضروری ہوگا۔ کیونکہ قرآن کے اس عموم کی یہ تخصیص صحیح وقوی احادیث سے ثابت ہے۔ بنا بریں جس طرح اور بعض عمومات قرآنی کی تخصیص احادیث کی بنیاد پر تسلیم کی جاتی ہے، مثلاً آیت «الزَّانِيَةُ وَالزَّانِي فَاجْلِدُوا» الآية (النور: 2) کے عموم سے شادی شدہ زانی کا اخراج، اور «وَالسَّارِقُ وَالسَّارِقَةُ» (المائدۃ: 38) کے عموم سے ایسے چور کا اخراج یا تخصیص جس نے ربع دینار سے کم مالیت کی چیز چوری کی ہو یا چوری شدہ چیز، حرز میں نہ رکھی ہو، وغیرہ۔ اسی طرح «فَٱسۡتَمِعُواْ لَهُۥ وَأَنصِتُواْ» کے عمومی حکم سے مقتدی خارج ہوں گے اور ان کے لیے جہری نمازوں میں بھی سورۂ فاتحہ کا پڑھنا ضروری ہوگا، کیونکہ نبی (صلى الله عليه وسلم) نے اس کی تاکید فرمائی ہے۔ (جیسا کہ سورۂ فاتحہ کی تفسیر میں یہ احادیث بیان کی گئی ہیں)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-idhā quri-a al-qur'ānu fa-is'tamiʿū lahu wa-anṣitū laʿallakum tur'ḥamūna ","translations":["And when","is recited","the Quran","then listen","to it","and pay attention","so that you may","receive mercy","(204)"],"transliterationArr":["wa-idhā","quri-a","al-qur'ānu","fa-is'tamiʿū","lahu","wa-anṣitū","laʿallakum","tur'ḥamūna",null],"verseTiming":[[1,0,860],[2,860,1500],[3,1500,2820],[4,2820,4150],[5,4150,4860],[6,4860,6970],[7,6970,8310],[8,8310,11535]]}}