{"name":"7:23","price":"دونوں نے کہا اے ہمارے رب! ہم نے اپنا بڑا نقصان کیا اور اگر تو ہماری مغفرت نہ کرے گا اور ہم پر رحم نہ کرے گا تو واقعی ہم نقصان پانے والوں میں سے ہوجائیں گے۔(1)","arabic":"قَالَا رَبَّنَا ظَلَمۡنَآ أَنفُسَنَا وَإِن لَّمۡ تَغۡفِرۡ لَنَا وَتَرۡحَمۡنَا لَنَكُونَنَّ مِنَ ٱلۡخَٰسِرِينَ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":977,"juzNumber":8,"footnotes":"(1) توبہ واستغفار کے یہ وہی کلمات ہیں جو حضرت آدم (عليه السلام) نے اللہ تبارک وتعالیٰ سے سیکھے، جیسا کہ سورۂ بقرہ، آیت 37 میں صراحت ہے۔ (دیکھئے آیت مذکورہ کا حاشیہ) گویا شیطان نے اللہ کی نافرمانی کا ارتکاب کیا تو اس کے بعد وہ اس پر نہ صرف اڑ گیا بلکہ اس کے جواز و اثبات میں عقلی و قیاسی دلائل دینے لگا۔ نتیجتاً وہ راندۂ درگاہ اور ہمیشہ کے لئے ملعون قرار پایا اور حضرت آدم (عليه السلام) نے اپنی غلطی پر ندامت و پشیمانی کا اظہار اور بارگاہ الٰہی میں توبہ و استغفار کا اہتمام کیا۔ تو اللہ کی رحمت و مغفرت کے مستحق قرار پائے۔ یوں گویا دونوں راستوں کی نشان دہی ہوگئی، شیطانی راستے کی بھی اور اللہ والوں کے راستے کی بھی۔ گناہ کرکے اس پر اترانا، اصرار کرنا اور اس کو صحیح ثابت کرنے کے لئے ”دلائل“ کے انبار فراہم کرنا، شیطانی راستہ ہے۔ اور گناہ کے بعد احساس ندامت ہوکر بارگاہ الٰہی میں جھک جانا اور توبہ و استغفار کا اہتمام کرنا، بندگان الٰہی کا راستہ ہے۔ اللَّهُمَّ! اجْعَلْنَا مِنْهُمْ۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qālā rabbanā ẓalamnā anfusanā wa-in lam taghfir lanā watarḥamnā lanakūnanna mina al-khāsirīna ","translations":["Both of them said","Our Lord","we have wronged","ourselves","and if","not","You forgive","[for] us","and have mercy (on) us","surely, we will be","among","the losers","(23)"],"transliterationArr":["qālā","rabbanā","ẓalamnā","anfusanā","wa-in","lam","taghfir","lanā","watarḥamnā","lanakūnanna","mina","al-khāsirīna",null],"verseTiming":[[1,0,1130],[2,1130,2250],[3,2250,3410],[4,3410,5020],[5,5020,7310],[6,7310,7780],[7,7780,8360],[8,8360,9280],[9,9280,10060],[10,10060,11560],[11,11560,14110],[12,14110,14460],[13,14460,17635]]}}