{"name":"7:26","price":"اے آدم (علیہ السلام) کی اوﻻد ہم نے تمہارے لئے لباس پیدا کیا جو تمہاری شرم گاہوں کو بھی چھپاتا ہے اور موجب زینت بھی ہے(1) اور تقوے کا لباس(2)، یہ اس سے بڑھ کر ہے(3)۔ یہ اللہ تعالیٰ کی نشانیوں میں سے ہے تاکہ یہ لوگ یاد رکھیں۔","arabic":"يَٰبَنِيٓ ءَادَمَ قَدۡ أَنزَلۡنَا عَلَيۡكُمۡ لِبَاسٗا يُوَٰرِي سَوۡءَٰتِكُمۡ وَرِيشٗاۖ وَلِبَاسُ ٱلتَّقۡوَىٰ ذَٰلِكَ خَيۡرٞۚ ذَٰلِكَ مِنۡ ءَايَٰتِ ٱللَّهِ لَعَلَّهُمۡ يَذَّكَّرُونَ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":980,"juzNumber":8,"footnotes":"(1) ”سَوْآتٌ“ جسم کے وہ حصے جنہیں چھپانا ضروری ہے۔ جیسے شرم گاہ اور ”رِيشًا“ وہ لباس جو حسن ورعنائی کے لئے پہنا جائے۔ گویا لباس کی پہلی قسم ضروریات سے اور دوسری قسم تکملہ واضافہ سے ہے۔ اللہ تعالیٰ نے ان دونوں قسموں کے لباس کے لئے سامان اور مواد پیدا فرمایا۔\n(2) اس سے مراد بعض کے نزدیک وہ لباس ہے جو متقین قیامت والے دن پہنیں گے۔ بعض کے نزدیک ایمان، بعض کے نزدیک عمل صالح، خشیت الٰہی وغیرہ ہیں۔ مفہوم سب کا تقریباً ایک ہے کہ ایسا لباس، جسے پہن کر انسان تکبر کرنے کے بجائے، اللہ سے ڈرے اور ایمان و عمل صالح کے تقاضوں کا اہتمام کرے۔\n(3) اس سے یہ مفہوم بھی نکلتا ہے کہ زیب و زینت اور آرائش کے لئے بھی اگرچہ لباس پہننا جائز ہے۔ تاہم لباس میں ایسی سادگی زیادہ پسندیدہ ہے جو انسان کے زہد وورع اور تقویٰ کی مظہر ہو۔ علاوہ ازیں نیا لباس پہن کر یہ دعا بھی پڑھی جائے، کیونکہ نبی (صلى الله عليه وسلم) یہ دعا پڑھا کرتے تھے ”الْحَمْدُ للهِ الَّذِي كَسَانِي مَا أُوَارِي بِهِ عَوْرَتِي وَأَتَجَمَّلُ بِهِ فِي حَيَاتِي“ (ترمذي ، أبواب الدعوات - ابن ماجه ، كتاب اللباس ، باب ما يقول الرجل إذا لبس ثوبا جديدا) ”تمام تعریفیں اس اللہ کے لئے ہیں جس نے مجھے ایسا لباس پہنایا جس سے میں اپنا ستر چھپالوں اور اپنی زندگی میں اس سے زینت حاصل کروں“۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yābanī ādama qad anzalnā ʿalaykum libāsan yuwārī sawātikum warīshan walibāsu al-taqwā dhālika khayrun dhālika min āyāti al-lahi laʿallahum yadhakkarūna ","translations":["O Children","(of) Adam","Verily","We have sent down","to you","clothing","it covers","your shame","and (as) an adornment","But the clothing","(of) [the] righteousness ","that","(is) best","That","(is) from","(the) Signs","(of) Allah","so that they may","remember","(26)"],"transliterationArr":["yābanī","ādama","qad","anzalnā","ʿalaykum","libāsan","yuwārī","sawātikum","warīshan","walibāsu","al-taqwā","dhālika","khayrun","dhālika","min","āyāti","al-lahi","laʿallahum","yadhakkarūna",null],"verseTiming":[[1,0,2520],[2,2520,3370],[3,3370,3800],[4,3800,6310],[5,6310,7420],[6,7420,8480],[7,8480,9890],[8,9890,11600],[9,11600,13250],[10,13250,14300],[11,14300,15460],[12,15460,16380],[13,16380,18550],[14,18550,19530],[15,19530,19950],[16,19950,21100],[17,21100,21980],[18,21980,23330],[19,23330,26685]]}}