{"name":"7:28","price":"اور وه لوگ جب کوئی فحش کام کرتے ہیں تو کہتے ہیں کہ ہم نے اپنے باپ دادا کو اسی طریق پر پایا ہے اور اللہ نے بھی ہم کو یہی بتایا ہے۔ آپ کہہ دیجیئے کہ اللہ تعالیٰ فحش بات کی تعلیم نہیں دیتا، کیا اللہ کے ذمہ ایسی بات لگاتے ہو جس کی تم سند نہیں رکھتے؟(1)","arabic":"وَإِذَا فَعَلُواْ فَٰحِشَةٗ قَالُواْ وَجَدۡنَا عَلَيۡهَآ ءَابَآءَنَا وَٱللَّهُ أَمَرَنَا بِهَاۗ قُلۡ إِنَّ ٱللَّهَ لَا يَأۡمُرُ بِٱلۡفَحۡشَآءِۖ أَتَقُولُونَ عَلَى ٱللَّهِ مَا لَا تَعۡلَمُونَ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":982,"juzNumber":8,"footnotes":"(1) اسلام سے قبل مشرکین بیت اللہ کا ننگا طواف کرتے تھے اور کہتے تھے کہ ہم اس حالت کو اختیار کرکے طواف کرتے ہیں جو اس وقت تھی جب ہمیں ہماری ماؤں نے جنا تھا۔ بعض کہتے ہیں کہ وہ اس کی یہ تاویل کرتے تھے کہ ہم جو لباس پہنے ہوتے ہیں اس میں ہم اللہ کی نافرمانی کرتے رہتے ہیں، اس لئے اس لباس میں طواف کرنا مناسب نہیں۔ چنانچہ وہ لباس اتار کر طواف کرتے اور عورتیں بھی ننگی طواف کرتیں، صرف شرم گاہ پر کپڑا یا چمڑے کا ٹکڑا رکھ لیتیں۔ اپنے اس شرمناک فعل کے لئے دو عذر انہوں نے اور پیش کئے۔ ایک تو یہ کہ ہم نے اپنے باپ دادوں کو اس طرح ہی کرتے پایا ہے۔ دوسرا، یہ کہ اللہ نے ہمیں اس کا حکم دیا ہے۔ اللہ تعالیٰ نے اس کی تردید فرمائی کہ یہ کس طرح ہوسکتا ہے کہ اللہ تعالیٰ بے حیائی کا حکم دے ؟ یعنی تم اللہ کے ذمے وہ بات لگاتے ہو جو اس نے نہیں کہی۔ اس آیت میں ان مقلدین کے لئے بڑی زجر و توبیخ ہے جو آباپرستی، پیرپرستی اور شخصیت پرستی میں مبتلا ہیں، جب انہیں بھی حق کی بات بتلائی جاتی ہے تو اس کے مقابلے میں یہی عذر پیش کرتے ہیں کہ ہمارے بڑے یہی کرتے آئے ہیں یا ہمارے امام اور پیر وشیخ کا یہی حکم ہے۔ یہی وہ خصلت ہے جس کی وجہ سے یہودی، یہودیت پر، نصرانی نصرانیت پر اور بدعتی بدعتوں پر قائم رہے۔ (فتح القدیر)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-idhā faʿalū fāḥishatan qālū wajadnā ʿalayhā ābāanā wal-lahu amaranā bihā qul inna al-laha lā yamuru bil-faḥshāi ataqūlūna ʿalā al-lahi mā lā taʿlamūna ","translations":["And when","they do","immorality","they say","We found","on it","our forefathers","and Allah","(has) ordered us","of it","Say","Indeed","Allah","(does) not","order","immorality","Do you say","about","Allah","what","not","you know","(28)"],"transliterationArr":["wa-idhā","faʿalū","fāḥishatan","qālū","wajadnā","ʿalayhā","ābāanā","wal-lahu","amaranā","bihā","qul","inna","al-laha","lā","yamuru","bil-faḥshāi","ataqūlūna","ʿalā","al-lahi","mā","lā","taʿlamūna",null],"verseTiming":[[1,0,1010],[2,1010,1910],[3,1910,4260],[4,4260,5230],[5,5230,6310],[6,6310,7390],[7,7390,9300],[8,9300,11620],[9,11620,12750],[10,12750,13750],[11,13750,15889],[12,15889,17149],[13,17149,18169],[14,18169,18579],[15,18579,19549],[16,19549,23559],[17,23559,25039],[18,25039,25459],[19,25459,26459],[20,26459,26969],[21,26969,27359],[22,27359,30844]]}}