{"name":"7:31","price":"اے اوﻻد آدم! تم مسجد کی ہر حاضری کے وقت اپنا لباس پہن لیا کرو(1) ۔ اور خوب کھاؤ اور پیو اور حد سے مت نکلو۔ بےشک اللہ حد سے نکل جانے والوں کو پسند نہیں کرتا۔(2)","arabic":"۞ يَٰبَنِيٓ ءَادَمَ خُذُواْ زِينَتَكُمۡ عِندَ كُلِّ مَسۡجِدٖ وَكُلُواْ وَٱشۡرَبُواْ وَلَا تُسۡرِفُوٓاْۚ إِنَّهُۥ لَا يُحِبُّ ٱلۡمُسۡرِفِينَ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":985,"juzNumber":8,"footnotes":"(1) آیت میں زینت سے مراد لباس ہے۔ اس کا سبب نزول بھی مشرکین کے ننگے طواف سے متعلق ہے۔ اس لئے انہیں کہا گیا کہ لباس پہن کر اللہ کی عبادت کرو اور طواف کرو۔\n(2) ”إِسْرَافٌ“ (حد سے نکل جانا) کسی چیز میں حتیٰ کہ کھانے پینے میں بھی ناپسندیدہ ہے۔ ایک حدیث میں نبی (صلى الله عليه وسلم) نے فرمایا ”جو چاہو، کھاوء۔ جو چاہو پہنو! البتہ دو باتوں سے گریز کرو۔ اسراف اور تکبرسے“ (صحيح بخاري، كتاب اللباس، باب قول الله تعالى قل من حرم زينة الله) بعض سلف کا قول ہے، اللہ تعالیٰ نے وَكُلُوا وَاشْرَبُوا وَلا تُسْرِفُوا اس آدھی آیت میں ساری طب جمع فرمادی ہے۔ (ابن کثیر )\nبعض کہتے ہیں زینت سے وہ لباس مراد ہے جو آرائش کے لئے پہنا جائے۔ جس سے ان کے نزدیک نماز اور طواف کے وقت تزئین کا حکم نکلتا ہے۔ اس آیت سے نماز میں ستر عورت کے وجوب پر بھی استدلال کیا گیا ہے بلکہ احادیث کی رو سے ستر عورت (گھٹنوں سے لے کر ناف تک کے حصے کو ڈھانپنا) ہر حال میں ضروری ہے چاہے آدمی خلوت میں ہی ہو۔ (فتح القدیر) جمعہ اور عید کے دن خوشبو کا استعمال بھی مستحب ہے کہ یہ بھی زینت کا حصہ ہے۔ (ابن کثیر)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yābanī ādama khudhū zīnatakum ʿinda kulli masjidin wakulū wa-ish'rabū walā tus'rifū innahu lā yuḥibbu al-mus'rifīna ","translations":["O Children","(of) Adam","Take","your adornment","at","every","masjid","and eat","and drink","but (do) not","be extravagant","Indeed, He","(does) not","love","the extravagant ones","(31)"],"transliterationArr":["yābanī","ādama","khudhū","zīnatakum","ʿinda","kulli","masjidin","wakulū","wa-ish'rabū","walā","tus'rifū","innahu","lā","yuḥibbu","al-mus'rifīna",null],"verseTiming":[[1,0,2580],[2,2580,3380],[3,3380,4050],[4,4050,5320],[5,5320,6450],[6,6450,7130],[7,7130,8700],[8,8700,9610],[9,9610,10640],[10,10640,11190],[11,11190,12400],[12,12400,14600],[13,14600,15020],[14,15020,15880],[15,15880,19025]]}}