{"name":"7:40","price":"جن لوگوں نے ہماری آیتوں کو جھٹلایا اور ان سے تکبر کیا ان کے لئے آسمان کے دروازے نہ کھولے جائیں گے(1) اور وه لوگ کبھی جنت میں نہ جائیں گے جب تک کہ اونٹ سوئی کے ناکہ کے اندر سے نہ چلا جائے(2) اور ہم مجرم لوگوں کو ایسی ہی سزا دیتے ہیں۔","arabic":"إِنَّ ٱلَّذِينَ كَذَّبُواْ بِـَٔايَٰتِنَا وَٱسۡتَكۡبَرُواْ عَنۡهَا لَا تُفَتَّحُ لَهُمۡ أَبۡوَٰبُ ٱلسَّمَآءِ وَلَا يَدۡخُلُونَ ٱلۡجَنَّةَ حَتَّىٰ يَلِجَ ٱلۡجَمَلُ فِي سَمِّ ٱلۡخِيَاطِۚ وَكَذَٰلِكَ نَجۡزِي ٱلۡمُجۡرِمِينَ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":994,"juzNumber":8,"footnotes":"(1) اس سے بعض نے اعمال، بعض نے ارواح اور بعض نے دعا مراد لی ہے۔ یعنی ان کے عملوں، یا روحوں یا دعا کے لئے آسمان کے دروازے نہیں کھولے جاتے، یعنی اعمال اور دعا قبول نہیں ہوتی اور روحیں واپس زمین میں لوٹا دی جاتی ہیں (جیسا کہ مسند احمد، جلد 2، صفحہ 364، 365 کی ایک حدیث سے بھی معلوم ہوتا ہے) امام شوکانی فرماتے ہیں کہ تینوں ہی چیزیں مراد ہوسکتی ہیں۔\n(2) یہ تعلیق بالمحال ہے جس طرح اونٹ کا سوئی کے ناکے سے گذرنا ممکن نہیں، اسی طرح اہل کفر کا جنت میں داخلہ ممکن نہیں۔ اونٹ کی مثال بیان فرمائی اس لئے کہ اونٹ عربوں میں متعارف تھا اور جسمانی اعتبار سے ایک بڑا جانور تھا۔ اور سوئی کا ناکہ (سوراخ) یہ اپنے باریک اور تنگ ہونے کے اعتبار سے بے مثال ہے۔ ان دونوں کے ذکر نے اس تعلیق بالمحال کے مفہوم کو غایت درجے واضح کردیا ہے۔ تعلیق بالمحال کا مطلب ہے، ایسی چیز کے ساتھ مشروط کر دینا جو ناممکن ہو۔ جیسے اونٹ سوئی کے ناکے میں داخل نہیں ہوسکتا۔ اب کسی چیز کے وقوع کو، اونٹ کے سوئی کے ناکے میں داخل ہونے کے ساتھ مشروط کردینا، تعلیق بالمحال ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"inna alladhīna kadhabū biāyātinā wa-is'takbarū ʿanhā lā tufattaḥu lahum abwābu al-samāi walā yadkhulūna al-janata ḥattā yalija al-jamalu fī sammi al-khiyāṭi wakadhālika najzī al-muj'rimīna ","translations":["Indeed","those who","denied","Our Verses","and (were) arrogant","towards them","(will) not","be opened","for them","(the) doors","(of) the heaven","and not","they will enter","Paradise","until","passes","the camel","through","(the) eye","(of) the needle","And thus","We recompense","the criminals","(40)"],"transliterationArr":["inna","alladhīna","kadhabū","biāyātinā","wa-is'takbarū","ʿanhā","lā","tufattaḥu","lahum","abwābu","al-samāi","walā","yadkhulūna","al-janata","ḥattā","yalija","al-jamalu","fī","sammi","al-khiyāṭi","wakadhālika","najzī","al-muj'rimīna",null],"verseTiming":[[1,0,1330],[2,1330,2340],[3,2340,3290],[4,3290,4900],[5,4900,6240],[6,6240,7080],[7,7080,7380],[8,7380,8420],[9,8420,9070],[10,9070,9980],[11,9980,12800],[12,12800,13780],[13,13780,14830],[14,14830,15420],[15,15420,16330],[16,16330,18750],[17,18750,19360],[18,19360,20420],[19,20420,22050],[20,22050,22790],[21,22790,23420],[22,23420,24270],[23,24270,24650],[24,24650,26080],[25,26080,30010],[26,30010,30620],[27,30620,33645]]}}