{"name":"7:43","price":"اور جو کچھ ان کے دلوں میں (کینہ) تھا ہم اس کو دور کردیں گے(1) ۔ ان کے نیچے نہریں جاری ہوں گی۔ اور وه لوگ کہیں گے کہ اللہ کا (لاکھ لاکھ) شکر ہے جس نے ہم کو اس مقام تک پہنچایا اور ہماری کبھی رسائی نہ ہوتی اگر اللہ تعالیٰ ہم کو نہ پہنچاتا(2)۔ واقعی ہمارے رب کے پیغمبر سچی باتیں لے کر آئے تھے۔ اور ان سے پکار کر کہا جائے گا کہ اس جنت کے تم وارث بنائے گئے ہو اپنے اعمال کے بدلے۔(3)","arabic":"وَنَزَعۡنَا مَا فِي صُدُورِهِم مِّنۡ غِلّٖ تَجۡرِي مِن تَحۡتِهِمُ ٱلۡأَنۡهَٰرُۖ وَقَالُواْ ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِي هَدَىٰنَا لِهَٰذَا وَمَا كُنَّا لِنَهۡتَدِيَ لَوۡلَآ أَنۡ هَدَىٰنَا ٱللَّهُۖ لَقَدۡ جَآءَتۡ رُسُلُ رَبِّنَا بِٱلۡحَقِّۖ وَنُودُوٓاْ أَن تِلۡكُمُ ٱلۡجَنَّةُ أُورِثۡتُمُوهَا بِمَا كُنتُمۡ تَعۡمَلُونَ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":997,"juzNumber":8,"footnotes":"(1) ”غِلٍّ“ اس کینے اور بغض کو کہا جاتا ہے جو سینوں میں مستور ہو۔ اللہ تعالیٰ اہل جنت پر یہ انعام بھی فرمائے گا کہ ان کے سینوں میں ایک دوسرے کے خلاف بغض وعداوت کے جو جذبات ہوں گے، وہ دور کردے گا، پھر ان کے دل ایک دوسرے کے بارے میں آئینے کی طرح صاف ہوجائیں گے، کسی کے بارے میں دل میں کوئی کدورت اور عداوت نہیں رہے گی۔ بعض نے اس کا مطلب یہ بیان کیا ہے کہ اہل جنت کے درمیان درجات و منازل کا جو تفاوت ہوگا، اس پر وہ ایک دوسرے سے حسد نہیں کریں گے۔ پہلے مفہوم کی تائید ایک حدیث سے ہوتی ہے کہ جنتیوں کو، جنت اور دوزخ کے درمیان ایک پل پر روک لیا جائے گا اور ان کے درمیان آپس کی جو زیادتیاں ہوں گی، ایک دوسرے کو ان کا بدلہ دیا دلایا جائے گا، حتیٰ کہ جب وہ بالکل پاک صاف ہوجائیں گے تو پھر انہیں جنت میں داخلے کی اجازت دے دی جائے گی (صحیح بخاری۔ کتاب المظالم، باب قصاص المظالم۔) جیسے صحابہ کرام (رضي الله عنهم) کی باہمی رنجشیں ہیں جو سیاسی رقابت میں ان کے درمیان ہوئیں۔ حضرت علی رضی اللہ عنہ کا قول ہے مجھے امید ہے کہ میں، عثمان اور طلحہ وزبیر رضی اللہ عنہم، ان لوگوں میں سے ہوں گے جن کے بارے میں اللہ نے فرمایا ہے «وَنَزَعْنَا مَا فِي صُدُورِهِمْ مِنْ غِلٍّ»( ابن کثیر)\n(2) یعنی یہ ہدایت جس سے ہمیں ایمان اور عمل صالح کی زندگی نصیب ہوئی اور پھر انہیں بارگاہ الہیٰ میں قبولیت کا درجہ بھی حاصل ہوا۔ یہ اللہ تعالیٰ کی خاص رحمت ہے اور اس کا فضل ہے۔ اگر یہ رحمت اور فضل الٰہی نہ ہوتا تو ہم یہاں تک نہ پہنچ سکتے۔ اسی مفہوم کی یہ حدیث ہے جس میں نبی (صلى الله عليه وسلم) نے فرمایا ”یہ بات اچھی طرح جان لو کہ تم میں سے کسی کو محض اس کا عمل جنت میں نہیں لے جائے گا، جب تک کہ اللہ تعالیٰ کی رحمت نہ ہوگی۔ صحابہ (رضي الله عنهم) نے پوچھا یارسول اللہ! آپ (صلى الله عليه وسلم) بھی؟ آپ (صلى الله عليه وسلم) نے فرمایا ہاں میں بھی، اس وقت تک جنت میں نہیں جاؤں گا جب تک کہ رحمت الٰہی مجھے اپنے دامن میں نہیں سمیٹ لے گی۔“ (صحيح بخاري، كتاب الرقاق، باب القصد والمداومة على العمل - صحيح مسلم، كتاب صفة القيامة- باب لن يدخل أحد الجنة بعمله)۔\n(3) یہ تصریح پچھلی بات اور حدیث مذکور کے منافی نہیں۔ اس لئے کہ نیک عمل کی توفیق بھی بجائے خود اللہ کا فضل و احسان ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wanazaʿnā mā fī ṣudūrihim min ghillin tajrī min taḥtihimu al-anhāru waqālū al-ḥamdu lillahi alladhī hadānā lihādhā wamā kunnā linahtadiya lawlā an hadānā al-lahu laqad jāat rusulu rabbinā bil-ḥaqi wanūdū an til'kumu al-janatu ūrith'tumūhā bimā kuntum taʿmalūna ","translations":["And We will remove","whatever","(is) in","their breasts","of","malice","Flows","from","underneath them","the rivers","And they will say","All the praise","(is) for Allah","the One Who","guided us","to this","and not","we were","to receive guidance","if not","[that]","(had) guided us","Allah","Certainly","came","Messengers","(of) our Lord","with the truth","And they will be addressed","[that]","This","(is) Paradise","you have been made to inherit it","for what","you used to","do","(43)"],"transliterationArr":["wanazaʿnā","mā","fī","ṣudūrihim","min","ghillin","tajrī","min","taḥtihimu","al-anhāru","waqālū","al-ḥamdu","lillahi","alladhī","hadānā","lihādhā","wamā","kunnā","linahtadiya","lawlā","an","hadānā","al-lahu","laqad","jāat","rusulu","rabbinā","bil-ḥaqi","wanūdū","an","til'kumu","al-janatu","ūrith'tumūhā","bimā","kuntum","taʿmalūna",null],"verseTiming":[[1,0,1350],[2,1350,1720],[3,1720,2090],[4,2090,3380],[5,3380,4490],[6,4490,5530],[7,5530,6900],[8,6900,8030],[9,8030,9010],[10,9010,12500],[11,12500,13400],[12,13400,14230],[13,14230,15330],[14,15330,16200],[15,16200,17250],[16,17250,18370],[17,18370,19030],[18,19030,20660],[19,20660,22060],[20,22060,22840],[21,22840,24540],[22,24540,25310],[23,25310,28560],[24,28560,29170],[25,29170,31640],[26,31640,32320],[27,32320,33350],[28,33350,34780],[29,34780,37470],[30,37470,38490],[31,38490,39400],[32,39400,41520],[33,41520,43300],[34,43300,43940],[35,43940,45590],[36,45590,48755]]}}