{"name":"7:49","price":"کیا یہ وہی ہیں جن کی نسبت تم قسمیں کھا کھا کر کہا کرتے تھے کہ اللہ تعالیٰ ان پر(1) رحمت نہ کرے گا، ان کو یوں حکم ہوگا کہ جاؤ جنت میں تم پر نہ کچھ خوف ہے اور نہ تم مغموم ہوگے۔","arabic":"أَهَٰٓؤُلَآءِ ٱلَّذِينَ أَقۡسَمۡتُمۡ لَا يَنَالُهُمُ ٱللَّهُ بِرَحۡمَةٍۚ ٱدۡخُلُواْ ٱلۡجَنَّةَ لَا خَوۡفٌ عَلَيۡكُمۡ وَلَآ أَنتُمۡ تَحۡزَنُونَ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":1003,"juzNumber":8,"footnotes":"(1) اس سے مراد وہ اہل ایمان ہیں جو دنیا میں غریب و مسکین اور مفلس و نادار قسم کے تھے جن کا استہزا مذکورہ متکبرین اڑایا کرتے تھے اور کہا کرتے تھے کہ اگر یہ اللہ کے محبوب ہوتے تو ان کا دنیا میں یہ حال ہوتا؟ پھر مزید جسارت کرتے ہوئے دعویٰ کرتے کہ قیامت والے دن بھی اللہ کی رحمت ہم پر ہوگی (جس طرح دنیا میں ہورہی ہے) نہ کہ ان پر۔ بعض نے اس کا قائل اصحاب الاعراف کو بتلایا ہے اور بعض کہتے ہیں جب اصحاب الاعراف جہنمیوں کو یہ کہیں گے تمہارا جتھہ اور تمہارا اپنے کو بڑا سمجھنا تمہارے کچھ کام نہ آیا تو اس وقت اللہ کی طرف سے جنتیوں کی طرف اشارہ کرتے ہوئے کہا جائے گا کہ یہ وہی لوگ ہیں جن کے بارے میں تم قسمیں کھاتے تھے کہ ان پر اللہ کی رحمت نہیں ہوگی۔( تفسیر ابن کثیر)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"ahāulāi alladhīna aqsamtum lā yanāluhumu al-lahu biraḥmatin ud'khulū al-janata lā khawfun ʿalaykum walā antum taḥzanūna ","translations":["Are these","the ones whom","you had sworn","(that) not","(will) grant them","Allah","Mercy","Enter","Paradise","(There will be) no","fear","upon you","and not","you","will grieve","(49)"],"transliterationArr":["ahāulāi","alladhīna","aqsamtum","lā","yanāluhumu","al-lahu","biraḥmatin","ud'khulū","al-janata","lā","khawfun","ʿalaykum","walā","antum","taḥzanūna",null],"verseTiming":[[1,0,5169],[2,5169,6139],[3,6139,7629],[4,7629,8039],[5,8039,9399],[6,9399,10319],[7,10319,11939],[8,11939,12759],[9,12759,14809],[10,14809,15209],[11,15209,16069],[12,16069,17269],[13,17269,19059],[14,19059,20769],[15,20769,23904]]}}