{"name":"7:51","price":"جنہوں نے دنیا میں اپنے دین کو لہو ولعب بنا رکھا تھا اور جن کو دنیاوی زندگی نے دھوکہ میں ڈال رکھا تھا۔ سو ہم (بھی) آج کے روز ان کا نام بھول جائیں گے جیسا کہ وه اس دن کو بھول گئے(1) اور جیسا یہ ہماری آیتوں کا انکار کرتے تھے۔","arabic":"ٱلَّذِينَ ٱتَّخَذُواْ دِينَهُمۡ لَهۡوٗا وَلَعِبٗا وَغَرَّتۡهُمُ ٱلۡحَيَوٰةُ ٱلدُّنۡيَاۚ فَٱلۡيَوۡمَ نَنسَىٰهُمۡ كَمَا نَسُواْ لِقَآءَ يَوۡمِهِمۡ هَٰذَا وَمَا كَانُواْ بِـَٔايَٰتِنَا يَجۡحَدُونَ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":1005,"juzNumber":8,"footnotes":"(1) حدیث میں آتا ہے، قیامت والے دن اللہ تعالیٰ اس قسم کے بندے سے کہے گا ”کیا میں نے تجھے بیوی بچے نہیں دیئے تھے؟ تجھے عزت و اکرام سے نہیں نوازا تھا؟ کیا اونٹ اور گھوڑے تیرے تابع نہیں کردیئے تھے؟ اور کیا تو سرداری کرتے ہوئے لوگوں سے چنگی وصول نہیں کرتا تھا؟ وہ کہے گا کیوں نہیں؟ یااللہ یہ سب باتیں صحیح ہیں۔ اللہ تعالیٰ اس سے پوچھے گا، کیا تو میری ملاقات کا یقین رکھتا تھا؟ وہ کہے گا۔ نہیں، اللہ تعالیٰ فرمائے گا، پس جس طرح تو مجھے بھولا رہا، آﺝ میں تجھے بھول جاتا ہوں“۔ (صحیح مسلم۔ کتاب الزھد) قرآن کریم کی اس آیت سے یہ بھی معلوم ہوا کہ دین کو لہو ولعب بنانے والے وہی ہوتے ہیں جو دنیا کے فریب میں مبتلا ہوتے ہیں۔ ایسے لوگوں کے دلوں سے چونکہ آخرت کی فکر اور اللہ کا خوف نکل جاتا ہے۔ اس لئے وہ دین میں بھی اپنی طرف سے جو چاہتے ہیں، اضافہ کرلیتے ہیں اور دین کے جس حصے کو چاہتے ہیں عملاً کالعدم قرار دیتے ہیں یا انہیں کھیل کود کا رنگ دے دیتے ہیں۔ اس لیے دین میں اپنی طرف سے بدعات کا اضافہ کرکے انہی کو اصل اہمیت دینا (جیسا کہ اہل بدعت کا شیوہ ہے) یہ بڑا جرم ہے، کیونکہ اس سے دین کھیل کود بن کر رہ جاتا ہے اور احکام وفرائض پر عمل کی اہمیت ختم ہوجاتی ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"alladhīna ittakhadhū dīnahum lahwan walaʿiban wagharrathumu al-ḥayatu al-dun'yā fal-yawma nansāhum kamā nasū liqāa yawmihim hādhā wamā kānū biāyātinā yajḥadūna ","translations":["Those who","took","their religion","(as) an amusement","and play","and deluded them","the life","(of) the world","So today","We forget them","as","they forgot","(the) meeting","(of) their day","this","and [what]","(as) they used to","with Our Verses","they reject","(51)"],"transliterationArr":["alladhīna","ittakhadhū","dīnahum","lahwan","walaʿiban","wagharrathumu","al-ḥayatu","al-dun'yā","fal-yawma","nansāhum","kamā","nasū","liqāa","yawmihim","hādhā","wamā","kānū","biāyātinā","yajḥadūna",null],"verseTiming":[[1,0,1400],[2,1400,2590],[3,2590,3680],[4,3680,5020],[5,5020,7180],[6,7180,8380],[7,8380,9790],[8,9790,11140],[9,11140,12630],[10,12630,14930],[11,14930,15650],[12,15650,16330],[13,16330,18490],[14,18490,19670],[15,19670,20580],[16,20580,21240],[17,21240,22210],[18,22210,24150],[19,24150,27175]]}}