{"name":"7:58","price":"اور جو ستھری سرزمین ہوتی ہے اس کی پیداوار تو اللہ کے حکم سے خوب نکلتی ہے اور جو خراب ہے اس کی پیداوار بہت کم نکلتی ہے(1) ، اسی طرح ہم دﻻئل کو طرح طرح سے بیان کرتے ہیں، ان لوگوں کے لئے جو شکر کرتے ہیں۔","arabic":"وَٱلۡبَلَدُ ٱلطَّيِّبُ يَخۡرُجُ نَبَاتُهُۥ بِإِذۡنِ رَبِّهِۦۖ وَٱلَّذِي خَبُثَ لَا يَخۡرُجُ إِلَّا نَكِدٗاۚ كَذَٰلِكَ نُصَرِّفُ ٱلۡأٓيَٰتِ لِقَوۡمٖ يَشۡكُرُونَ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":1012,"juzNumber":8,"footnotes":"(1) علاوہ ازیں یہ تمثیل بھی ہوسکتی ہے ۔ ”الْبَلَدُ الطَّيِّبُ“ سے مراد سریع الفہم اور”الْبَلَدُ الخَبِيثُ“ سے کند ذہن، وعظ و نصیحت قبول کرنے والا دل اور اس کے برعکس دل ۔ قلب مومن یا قلب منافق یا پاکیزہ انسان اور ناپاک انسان ۔ مومن، پاکیزہ انسان اور وعظ ونصیحت قبول کرنے والا دل بارش کو قبول کرنے والی زمین کی طرح، آیات الٰہی کو سن کر ایمان وعمل صالح میں مزید پختہ ہوتا ہے اور دوسرا دل اس کے برعکس زمین شور کی طرح ہے جو بارش کا پانی قبول ہی نہیں کرتی یا کرتی ہے تو برائے نام جس سے پیداوار بھی نکمی اور برائے نام ہوتی ہے ۔ اسی کو ایک حدیث میں اس طرح بیان کیا گیا ہے ۔ رسول اللہ (صلى الله عليه وسلم) نے بیان فرمایا کہ ”مجھے اللہ تعالیٰ نے جو علم وہدایت دے کر بھیجا ہے، اس کی مثال اس موسلادھار بارش کی طرح ہے جو زمین پر برسی ۔ اس کے جو حصے زرخیز تھے، انہوں نے پانی کو اپنے اندر جذب کرکے چارہ اور گھاس خوب اگایا (یعنی بھرپور پیداوار دی) اور اس کے بعض حصے سخت تھے، جنہوں نے پانی کو تو روک لیا (اندر جذب نہیں ہوا) تاہم اس سے بھی لوگوں نے فائدہ اٹھایا، خود بھی پیا ۔ کھیتوں کو بھی سیراب کیا اور کاشت کاری کی اور زمین کا کچھ حصہ بالکل چٹیل تھا، جس نے پانی روکا اور نہ کچھ اگایا ۔ پس یہ اس شخص کی مثال ہے جس نے اللہ کی دین میں سمجھ حاصل کی اور اللہ نے مجھے جس چیز کے ساتھ بھیجا، اس سے اس نے نفع اٹھایا، پس خود بھی علم حاصل کیا اور دوسروں کو بھی سکھلایا اور مثال اس شخص کی بھی ہے جس نے کچھ نہیں سیکھا اور نہ وہ ہدایت ہی قبول کی جس کے ساتھ مجھے بھیجا گیا“۔ (صحيح بخاري ، كتاب العلم، باب فضل من علم وعلَّم)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wal-baladu al-ṭayibu yakhruju nabātuhu bi-idh'ni rabbihi wa-alladhī khabutha lā yakhruju illā nakidan kadhālika nuṣarrifu al-āyāti liqawmin yashkurūna ","translations":["And the land ","[the] pure","comes forth","its vegetation","by (the) permission","(of) its Lord","but which","is bad ","(does) not","come forth","except","(with) difficulty","Thus","We explain","the Signs","for a people","who are grateful","(58)"],"transliterationArr":["wal-baladu","al-ṭayibu","yakhruju","nabātuhu","bi-idh'ni","rabbihi","wa-alladhī","khabutha","lā","yakhruju","illā","nakidan","kadhālika","nuṣarrifu","al-āyāti","liqawmin","yashkurūna",null],"verseTiming":[[1,0,1130],[2,1130,2180],[3,2180,2990],[4,2990,4270],[5,4270,5050],[6,5050,6150],[7,6150,7100],[8,7100,7910],[9,7910,8280],[10,8280,9090],[11,9090,9840],[12,9840,10920],[13,10920,12410],[14,12410,13410],[15,13410,14760],[16,14760,16880],[17,16880,19985]]}}