{"name":"7:63","price":"اور کیا تم اس بات سے تعجب کرتے ہو کہ تمہارے پروردگار کی طرف سے تمہارے پاس ایک ایسے شخص کی معرفت، جو تمہاری ہی جنس کا ہے، کوئی نصیحت کی بات آگئی تاکہ وه شخص تم کو ڈرائے اور تاکہ تم ڈرجاؤ(1) اور تاکہ تم پر رحم کیا جائے۔","arabic":"أَوَعَجِبۡتُمۡ أَن جَآءَكُمۡ ذِكۡرٞ مِّن رَّبِّكُمۡ عَلَىٰ رَجُلٖ مِّنكُمۡ لِيُنذِرَكُمۡ وَلِتَتَّقُواْ وَلَعَلَّكُمۡ تُرۡحَمُونَ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":1017,"juzNumber":8,"footnotes":"(1) حضرت نوح (عليه السلام) اور حضرت آدم (عليه السلام) کے درمیان دس قرنوں یا دس پشتوں کا فاصلہ ہے ۔ حضرت نوح (عليه السلام) سے کچھ پہلے تک تمام لوگ اسلام پر قائم چلے آرہے تھے پھر سب سے پہلے توحید سے انحراف اس طرح آیا کہ اس قوم کے صالحین فوت ہوگئے تو ان کے عقیدت مندوں نے ان پر سجدہ گاہیں (عبادت خانے) قائم کردیں اور ان کی تصویریں بھی وہاں لٹکادیں، مقصد ان کا یہ تھا کہ اس طرح ان کی یاد سے وہ بھی اللہ کا ذکر کریں گے اور ذکرالٰہی میں ان کی مشابہت اختیار کریں گے ۔ جب کچھ وقت گزرا تو انہوں نے ان تصویروں کے مجسمے بنادئیے اور پھر کچھ اور عرصہ گزرنے کے بعد یہ مجسمے بتوں کی شکل اختیار کر گئے اور ان کی پوجا پاٹ شروع ہوگئی اور قوم نوح کے یہ صالحین وَدٌّ، سُوَاعٌ، يَعُوقُ، يَغوثُ اور نَسْرٌ معبود بن گئے ۔ ان حالات میں اللہ تعالیٰ نے حضرت نوح (عليه السلام) کو ان میں نبی بناکر بھیجا جنہوں نے ساڑھے نو سو سال تبلیغ کی ۔ لیکن تھوڑے سے لوگوں کے سوا، کسی نے آپ کی تبلیغ کا اثر قبول نہیں کیا بالآخر اہل ایمان کے سوا سب کو غرق کردیا گیا ۔ اس آیت میں بتلایا جارہا ہے کہ قوم نوح نے اس بات پر تعجب کا اظہار کیا کہ ان ہی میں کا ایک آدمی نبی بن کر آگیا جو انہیں اللہ کے عذاب سے ڈرا رہا ہے؟ یعنی ان کے خیال میں نبوت کے لئے انسان موزوں نہیں ۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"awaʿajib'tum an jāakum dhik'run min rabbikum ʿalā rajulin minkum liyundhirakum walitattaqū walaʿallakum tur'ḥamūna ","translations":["Do you wonder","that","has come to you","a reminder","from","your Lord","on","a man","among you","that he may warn you","and that you may fear","and so that you may","receive mercy","(63)"],"transliterationArr":["awaʿajib'tum","an","jāakum","dhik'run","min","rabbikum","ʿalā","rajulin","minkum","liyundhirakum","walitattaqū","walaʿallakum","tur'ḥamūna",null],"verseTiming":[[1,0,1530],[2,1530,2860],[3,2860,5470],[4,5470,6100],[5,6100,7040],[6,7040,8240],[7,8240,8870],[8,8870,9510],[9,9510,11650],[10,11650,14210],[11,14210,16270],[12,16270,17720],[13,17720,19140],[14,19140,21705]]}}