{"name":"7:81","price":"تم مردوں کے ساتھ شہوت رانی کرتے ہو(1) عورتوں کو چھوڑ کر(2)، بلکہ تم تو حد ہی سے گزر گئے ہو۔(3)","arabic":"إِنَّكُمۡ لَتَأۡتُونَ ٱلرِّجَالَ شَهۡوَةٗ مِّن دُونِ ٱلنِّسَآءِۚ بَلۡ أَنتُمۡ قَوۡمٞ مُّسۡرِفُونَ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":1035,"juzNumber":8,"footnotes":"(1) یعنی مردوں کے پاس تم اس بے حیائی کے کام کے لئے محض شہوت رانی کی غرض سے آتے ہو، اس کے علاوہ تمہاری اور کوئی غرض ایسی نہیں ہوتی جو موافق عقل ہو ۔ اس لحاظ سے وہ بالکل بہائم کی طرح تھے جو محض شہوت رانی کے لئے ایک دوسرے پر چڑھتے ہیں ۔\n(2) جو قضائے شہوت کا اصل محل اور حصول لذت کی اصل جگہ ہے ۔ یہ ان کی فطرت کے مسخ ہونے کی طرف اشارہ ہے، یعنی اللہ نے مرد کی جنسی لذت کی تسکین کے لئے عورت کی شرم گاہ کو اس کا محل اور موضع بنایا ہے اور ان ظالموں نے اس سے تجاوز کرکے مرد کی دبر کو اس کے لئے استعمال کرنا شروع کردیا ۔\n(3) لیکن اب اسی فطرت صحیحہ سے انحراف اور حدود الٰہی سے تجاوز کو مغرب کی (مہذب) قوموں نے اختیار کرلیا ہے تو یہ انسانوں کا (بنیادی حق) قرار پاگیا ہے جس سے روکنے کا کسی کو حق حاصل نہیں ہے ۔ چنانچہ اب وہاں لواطت کو قانونی تحفظ حاصل ہوگیا ہے ۔ اور یہ سرے سے جرم ہی نہیں رہا ۔ فَإِنَّا للهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ.","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"innakum latatūna al-rijāla shahwatan min dūni al-nisāi bal antum qawmun mus'rifūna ","translations":["Indeed, you","you approach","the men","lustfully","from","instead of","the women","Nay","you","(are) a people","(who) commit excesses","(81)"],"transliterationArr":["innakum","latatūna","al-rijāla","shahwatan","min","dūni","al-nisāi","bal","antum","qawmun","mus'rifūna",null],"verseTiming":[[1,0,1740],[2,1740,2940],[3,2940,3980],[4,3980,4880],[5,4880,5990],[6,5990,6900],[7,6900,7510],[8,7510,11470],[9,11470,11830],[10,11830,13360],[11,13360,14200],[12,14200,18345]]}}