{"name":"7:9","price":"اور جس شخص کا پلا ہلکا ہوگا سو یہ وه لوگ ہوں گے جنہوں نے اپنا نقصان کرلیا بسبب اس کے کہ ہماری آیتوں کے ساتھ ﻇلم کرتے تھے۔(1)","arabic":"وَمَنۡ خَفَّتۡ مَوَٰزِينُهُۥ فَأُوْلَٰٓئِكَ ٱلَّذِينَ خَسِرُوٓاْ أَنفُسَهُم بِمَا كَانُواْ بِـَٔايَٰتِنَا يَظۡلِمُونَ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":963,"juzNumber":8,"footnotes":"(1) ان آیات میں وزن اعمال کا مسئلہ بیان کیا گیا ہے جو قیامت والے دن ہوگا اور جسے قرآن کریم میں بھی متعدد جگہ اور احادیث میں بھی بیان کیا گیا ہے۔ جس کا مطلب یہ ہے کہ ترازو میں اعمال تولے جائیں گے، جس کا نیکیوں والا پلڑا بھاری ہوگا، وہ کامیاب ہوگا اور جس کا بدیوں والا پلڑا بھاری ہوگا، وہ ناکام ہوگا۔ یہ اعمال کس طرح تولے جائیں گے جب کہ یہ اعراض ہیں یعنی ان کا ظاہری وجود اور جسم نہیں ہے؟ اس بارے میں ایک رائے تو یہ ہے کہ اللہ تعالیٰ قیامت والے دن ان کو اجسام میں تبدیل فرما دے گا اور ان کا وزن ہوگا۔ دوسری رائے تو یہ ہے کہ وہ صحیفے اور رجسٹر تو لے جائیں گے جن میں انسان کے اعمال درﺝ ہوں گے۔ تیسری رائے یہ ہے کہ خود صاحب عمل کو تولا جائے گا۔ تینوں مسلکوں والوں کے پاس اپنے مسلک کی حمایت میں صحیح احادیث و آثار موجود ہیں، اس لئے امام ابن کثیر فرماتے ہیں کہ تینوں ہی باتیں صحیح ہوسکتی ہیں ممکن ہے کبھی اعمال، کبھی صحیفے اور کبھی صاحب عمل کو تولا جائے (دلائل کے لئے دیکھئے تفسیر ابن کثیر) بہرحال میزان اور وزن اعمال کا مسئلہ قرآن وحدیث سے ثابت ہے۔ اس کا انکار یا اس کی تاویل گمراہی ہے۔ اور موجودہ دور میں تو اس کے انکار کی اب مزید کوئی گنجائش نہیں کہ بے وزن چیزیں بھی تولی جانے لگی ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waman khaffat mawāzīnuhu fa-ulāika alladhīna khasirū anfusahum bimā kānū biāyātinā yaẓlimūna ","translations":["And (for) those","(will be) light","his scales","so those","(will be) the ones who","lost","themselves","because","they were","to Our Verses","(doing) injustice","(9)"],"transliterationArr":["waman","khaffat","mawāzīnuhu","fa-ulāika","alladhīna","khasirū","anfusahum","bimā","kānū","biāyātinā","yaẓlimūna",null],"verseTiming":[[1,0,710],[2,710,1580],[3,1580,3350],[4,3350,6330],[5,6330,7370],[6,7370,9850],[7,9850,12900],[8,12900,13450],[9,13450,14390],[10,14390,16120],[11,16120,19205]]}}