{"name":"82:19","price":"(وه ہے) جس دن کوئی شخص کسی شخص کے لئے کسی چیز کا مختار نہ ہوگا، اور (تمام تر) احکام اس روز اللہ کے ہی ہوں گے.(1)","arabic":"يَوۡمَ لَا تَمۡلِكُ نَفۡسٞ لِّنَفۡسٖ شَيۡـٔٗاۖ وَٱلۡأَمۡرُ يَوۡمَئِذٖ لِّلَّهِ","category":["82 (Al-Infitar)","Al-Infitar","Surah Al-Infitar","Chapter Al-Infitar","Infitar","Surah Infitar","Chapter Infitar","Al Infitar","Surah Al Infitar","Chapter Al Infitar","Surah 82","Chapter 82","The Cleaving","الإنفطار"],"ayahNumber":5848,"juzNumber":30,"footnotes":"(1) یعنی دنیا میں تو اللہ نے عارضی طور پر، آزمانے کے لئے، انسانوں کو کم وبیش کے کچھ فرق کے ساتھ اختیارات دے رکھے ہیں۔ لیکن قیامت والےدن تمام اختیارات کلیتاً صرف اور صرف اللہ کےپاس ہوں گے۔ جیسے فرمایا لِمَنِ الْمُلْكُ الْيَوْمَ لِلَّهِ الْوَاحِدِ الْقَهَّارِ ۔ ( سورۂ مؤمن:16 ) چنانچہ نبی (صلى الله عليه وسلم) نے اپنی پھوپھی حضرت صفیہ (رضی الله عنها) اور اپنی صاحبزادی حضرت فاطمہ (رضی الله عنها) کو فرما دیا تھا، ”لا أَمْلِكُ لَكُمْ مِنَ اللهِ شَيْئًا“ (صحيح مسلم، كتاب الإيمان) اور بنی ہاشم اور بنی عبدالمطلب کو بھی متنبہ فرما دیا، ”أَنْقِذُوا أَنْفُسَكُمْ مِنَ النَّارِ، وَاللهِ لا أَمْلِكُ لَكُمْ مِنَ اللهِ شَيْئًا“ (مسلم ، كتاب مذكور ، بخاري ، سورة الشعراء ) ۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yawma lā tamliku nafsun linafsin shayan wal-amru yawma-idhin lillahi ","translations":["(The) Day","not","will have power","a soul","for a soul","anything","and the Command","that Day","(will be) with Allah","(19)"],"transliterationArr":["yawma","lā","tamliku","nafsun","linafsin","shayan","wal-amru","yawma-idhin","lillahi",null],"verseTiming":[[1,0,590],[2,590,1090],[3,1090,2000],[4,2000,2670],[5,2670,4200],[6,4200,5910],[7,5910,7520],[8,7520,8790],[9,8790,12415]]}}