{"name":"83:14","price":"یوں نہیں(1) بلکہ ان کے دلوں پر ان کےاعمال کی وجہ سے زنگ (چڑھ گیا) ہے.(2)","arabic":"كَلَّاۖ بَلۡۜ رَانَ عَلَىٰ قُلُوبِهِم مَّا كَانُواْ يَكۡسِبُونَ","category":["83 (Al-Mutaffifin)","Al-Mutaffifin","Surah Al-Mutaffifin","Chapter Al-Mutaffifin","Mutaffifin","Surah Mutaffifin","Chapter Mutaffifin","Al Mutaffifin","Surah Al Mutaffifin","Chapter Al Mutaffifin","Surah 83","Chapter 83","Defrauding","المطففين"],"ayahNumber":5862,"juzNumber":30,"footnotes":"(1) یعنی یہ قرآن کہانیاں نہیں، جیسا کہ کافر کہتے اور سمجھتے ہیں۔ بلکہ یہ اللہ کا کلام اور اس کی وحی ہے جو اس کےرسول پر جبرائیل (عليه السلام) امین کے ذریعے سے نازل ہوئی ہے ۔\n(2) یعنی ان کے دل اس قرآن اور وحی الٰہی پر ایمان اس لئے نہیں لاتے کہ ان کےدلوں پر گناہوں کی کثرت کی وجہ سے پردے پڑ گئے ہیں اور وہ زنگ آلود ہوگئے ہیں رَيْنٌ، گناہوں کی وہ سیاہی ہےجو مسلسل ارتکاب گناہ کی وجہ سے اس کے دل پر چھا جاتی ہے۔ حدیث میں ہے ”بندہ جب گناہ کرتا ہے تو اس کے دل پر ایک سیاہ نکتہ پڑ جاتا ہے، اگر وہ توبہ کر لیتا ہے تو وہ سیاہی دور کر دی جاتی ہے، اور اگر توبہ کے بجائے، گناہ پر گناہ کیے جاتا ہے تو وہ سیاہی بڑھتی جاتی ہے، حتیٰ کہ اس کےپورے دل پر چھا جاتی ہے۔ یہی وہ رَيْنٌ ہے جس کا ذکر قرآن مجید میں ہے“۔ ( ترمذي، باب تفسير سورة المطففين، ابن ماجه، كتاب الزهد، باب الذنوب - مسند أحمد 2 / 297 ) ۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"kallā bal rāna ʿalā qulūbihim mā kānū yaksibūna ","translations":["Nay","But","(the) stain has covered","[over]","their hearts","(for) what","they used to","earn","(14)"],"transliterationArr":["kallā","bal","rāna","ʿalā","qulūbihim","mā","kānū","yaksibūna",null],"verseTiming":[[1,0,940],[2,940,1400],[3,1400,2260],[4,2260,2960],[5,2960,4540],[6,4540,5520],[7,5520,6390],[8,6390,9485]]}}