{"name":"83:6","price":"جس دن سب لوگ رب العالمین کے سامنے کھڑے ہوں گے.(1)","arabic":"يَوۡمَ يَقُومُ ٱلنَّاسُ لِرَبِّ ٱلۡعَٰلَمِينَ","category":["83 (Al-Mutaffifin)","Al-Mutaffifin","Surah Al-Mutaffifin","Chapter Al-Mutaffifin","Mutaffifin","Surah Mutaffifin","Chapter Mutaffifin","Al Mutaffifin","Surah Al Mutaffifin","Chapter Al Mutaffifin","Surah 83","Chapter 83","Defrauding","المطففين"],"ayahNumber":5854,"juzNumber":30,"footnotes":"(1) یہ ڈنڈی مارنے والے اس بات سے نہیں ڈرتے کہ ایک بڑا ہولناک دن آنے والا ہے جس میں سب لوگ رب العالمین کے سامنے کھڑے ہوں گے جو تمام پوشیدہ باتوں کوجانتا ہے ؟ مطلب یہ ہے کہ یہ کام وہی لوگ کرتے ہیں جن کے دلوں میں اللہ کا خوف اور قیامت کا ڈر نہیں ہے۔ احادیث میں آتا ہے، کہ جس وقت رب العالمین کے لئے کھڑے ہوں گے تو پسینہ انسانوں کے آدھے آدھے کانوں تک پہنچا ہوگا۔ ( صحيح، بخاري، تفسير سورة المطففين ) ایک اور روایت میں ہے کہ قیامت والے دن سورج مخلوق کے اتنا قریب ہوگا کہ ایک میل کی مقدار کے قریب فاصلہ ہوگا۔ حدیث کے راوی حضرت سلیم بن عامر کہتے ہیں کہ میں نہیں جانتا کہ نبی (صلى الله عليه وسلم) نے میل سے زمین کے مسافت والا میل مراد لیا ہے یا وہ سلائی جس سے سرمہ آنکھوں میں ڈالا جاتا ہے۔ پس لوگ اپنے اعمال کے مطابق پسینے میں ہوں گے، یہ پسینہ کسی کے ٹخنوں تک، کسی کے گھٹنوں تک، کسی کی کمر تک ہوگا اور کسی کے لئے یہ لگام بنا ہوا ہوگا، یعنی اس کے منہ تک پسینہ ہوگا۔ ( صحيح مسلم، صفة القيامة والجنة، باب في صفة يوم القيامة) ۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yawma yaqūmu al-nāsu lirabbi al-ʿālamīna ","translations":["(The) Day","will stand","mankind","before (the) Lord","(of) the worlds","(6)"],"transliterationArr":["yawma","yaqūmu","al-nāsu","lirabbi","al-ʿālamīna",null],"verseTiming":[[1,0,620],[2,620,1490],[3,1490,3130],[4,3130,3940],[5,3940,7905]]}}