{"name":"84:8","price":"اس کا حساب تو بڑی آسانی سے لیا جائے گا.(1)","arabic":"فَسَوۡفَ يُحَاسَبُ حِسَابٗا يَسِيرٗا","category":["84 (Al-Inshiqaq)","Al-Inshiqaq","Surah Al-Inshiqaq","Chapter Al-Inshiqaq","Inshiqaq","Surah Inshiqaq","Chapter Inshiqaq","Al Inshiqaq","Surah Al Inshiqaq","Chapter Al Inshiqaq","Surah 84","Chapter 84","The Splitting Open","الإنشقاق"],"ayahNumber":5892,"juzNumber":30,"footnotes":"(1) آسان حساب یہ ہے کہ مومن کا اعمال نامہ پیش ہوگا۔ اس کی غلطیاں بھی اس کے سامنے لائی جائیں گی، پھر اللہ تعالیٰ اپنی رحمت اور فضل وکرم سے انہیں معاف فرما دے گا۔ حضرت عائشہ (رضی الله عنها) فرماتی ہیں کہ رسول اللہ (صلى الله عليه وسلم) نے فرمایا ”جس کا حساب لیا گیا وہ ہلاک ہوگیا“۔ میں نے کہا اے اللہ کے رسول! اللہ مجھے آپ پر قربان کرے کیا اللہ تعالیٰ نے یہ نہیں فرمایا، جس کے دائیں ہاتھ میں نامہ اعمال دیا گیا، اس کا حساب آسان ہوگا۔ مطلب حضرت عائشہ (رضی الله عنها) کا یہ تھا کہ اس آیت کی رو سے حساب تو مومن کا بھی ہوگا لیکن وہ ہلاکت سےدوچار نہیں ہوگا۔ آپ (صلى الله عليه وسلم) نے وضاحت فرمائی ”یہ تو پیشی ہے“۔ یعنی مومن کے ساتھ معاملہ حساب کا نہیں ہوگا، ایک سرسری سی پیشی ہوگی مومن رب کے سامنے پیش کیے جائیں گے، جس کا مناقشہ ہوا یعنی پوچھ گچھ ہوئی وہ مارا گیا۔ ( صحيح البخاري، تفسير سورة انشقاق ) ایک اور روایت میں حضرت عائشہ (رضی الله عنها) فرماتی ہیں۔ نبی (صلى الله عليه وسلم) اپنی بعض نماز میں یہ دعا پڑھتے تھے۔ ”اللَّهُمَّ حَاسِبْنِي حِسَابًا يَسِيرًا“ (اے اللہ میرا حساب آسان فرمانا) نماز سے فراغت کے بعد میں نے پوچھا، حسابا یسیرا ”آسان حساب“ کا کیا مطلب ہے ؟ آپ (صلى الله عليه وسلم) نے فرمایا، اللہ تعالیٰ اس کا اعمال نامہ دیکھے گا اور پھر اسے معاف فرما دے گا۔۔۔ ( مسند احمد،6 / 48 ) ۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"fasawfa yuḥāsabu ḥisāban yasīran ","translations":["Then soon","his account will be taken","an account","easy","(8)"],"transliterationArr":["fasawfa","yuḥāsabu","ḥisāban","yasīran",null],"verseTiming":[[1,0,820],[2,820,1890],[3,1890,3080],[4,3080,5275]]}}