{"name":"85:8","price":"یہ لوگ ان مسلمانوں (کے کسی اور گناه کا) بدلہ نہیں لے رہے تھے، سوائے اس کے کہ وه اللہ غالب ﻻئق حمد کی ذات پر ایمان ﻻئے تھے.(1)","arabic":"وَمَا نَقَمُواْ مِنۡهُمۡ إِلَّآ أَن يُؤۡمِنُواْ بِٱللَّهِ ٱلۡعَزِيزِ ٱلۡحَمِيدِ","category":["85 (Al-Buruj)","Al-Buruj","Surah Al-Buruj","Chapter Al-Buruj","Buruj","Surah Buruj","Chapter Buruj","Al Buruj","Surah Al Buruj","Chapter Al Buruj","Surah 85","Chapter 85","The Constellations","البروج"],"ayahNumber":5917,"juzNumber":30,"footnotes":"(1) یعنی ان لوگوں کا جرم، جنہیں آگ میں جھونکا جا رہا تھا، یہ تھا کہ وہ اللہ غالب پر ایمان لے آئے تھے۔ اس واقعے کی تفصیل جو صحیح احادیث سے ثابت ہے ، ملاحظہ فرمائیں۔\nواقعہ اصحاب الاخدود :\nگزشتہ زمانے میں ایک بادشاہ کا جادوگر اور کاہن تھا، جب وہ کاہن بوڑھا ہو گیا تو اس نے بادشاہ سےکہا کہ مجھے ایک ذہین لڑکا دو، جسے میں یہ علم سکھا دوں۔ چنانچہ بادشاہ نے ایک سمجھدار لڑکا تلاش کرکے اس کے سپرد کر دیا۔ لڑکے کے راستے میں ایک راہب کا بھی مکان تھا، یہ لڑکا آتے جاتے اس کےپاس بھی بیٹھتا اور اس کی باتیں سنتا، جو اسے اچھی لگتیں۔ اسی طرح سلسلہ چلتا رہا۔ ایک مرتبہ یہ لڑکا جا رہا تھا کہ راستے میں ایک بہت بڑے جانور ( شیر یا سانپ وغیرہ ) نے لوگوں کا راستہ روک رکھا تھا۔ لڑکے نے سوچا، آج میں پتہ کرتا ہوں کہ جادوگر صحیح ہے یا راہب ؟ اس نے ایک پتھر پکڑا اور کہا اے اللہ، اگر راہب کا معاملہ، تیرے نزدیک جادوگر کے معاملے سے بہتر اور پسندیدہ ہے تو اس جانور کو مار دے، تاکہ لوگوں کی آمد ورفت جاری ہو جائے۔ یہ کہہ کر اس نے پتھر مارا اور وہ جانور مر گیا۔ لڑکے نے جا کر یہ واقعہ راہب کو بتلایا۔ راہب نے کہا، بیٹے! اب تم فضل وکمال کو پہنچ گئے ہو اور تمہاری آزمائش شروع ہونے والی ہے۔ لیکن اس دور ابتلا میں میرا نام ظاہر نہ کرنا۔ یہ لڑکا مادر زاد اندھے، برص اور دیگر بعض بیماریوں کا علاج بھی کرتا تھا، لیکن ایمان باللہ کی شرط پر، اسی شرط پر اس نے بادشاہ کے ایک نابینا مصاحب کی آنکھیں بھی، اللہ سے دعا کرکے صحیح کر دیں۔ یہ لڑکا یہی کہتا تھا کہ اگر تم ایمان لے آؤ گے تو میں اللہ سے دعا کروں گا، وہ شفا عطا فرما دے گا، چنانچہ اس کی دعا سے اللہ شفایاب فرما دیتا۔ یہ خبر بادشاہ تک بھی پہنچی تو وہ بہت پریشان ہوا۔ بعض اہل ایمان کو تو اس نے قتل کروا دیا۔ اس لڑکے کے بارے میں اس نے چند آدمیوں کو کہا کہ اسے پہاڑ کی چوٹی پر لےجا کر نیچے پھینک دو، اس نے اللہ سے دعا کی، پہاڑ میں لرزش پیدا ہوئی، جس سے وہ سب گر کر مر گئے اور اللہ نے اسے بچا لیا۔ بادشاہ نے اسےدوسرے آدمیوں کےسپرد کرکے کہا کہ ایک کشتی میں بٹھا کر سمندر کے بیچ میں لے جا کر اسے پھینک دو، وہاں بھی اس کی دعا سے کشتی الٹ گئی، جس سے وہ سب غرق ہوگئےاور یہ بچ گیا۔ اس لڑکے نے بادشاہ سے کہا، اگر مجھے ہلاک کرنا چاہتا ہے تو اس کا طریقہ یہ ہے کہ ایک کھلے میدان میں لوگوں کو جمع کرو اور ( بِسْمِ اللهِ رَبِّ الْغُلامِ ) کہہ کر مجھے تیر مار۔ بادشاہ نے ایسا ہی کیا، جس سے وہ لڑکا مر گیا لیکن سارے لوگ پکار اٹھے، کہ ہم اس لڑکے کے رب پر ایمان لائے۔ بادشاہ اور زیادہ پریشان ہوگیا۔ چنانچہ اس نے خندقیں کھدوائیں اور اس میں آگ جلوائی اور حکم دیا کہ جو ایمان سے انحراف نہ کرے، اس کو آگ میں پھینک دو۔ اس طرح ایمان دار آتے رہے اور آگ کے حوالے ہوتے رہے، حتیٰ کہ ایک عورت آئی، جس کےساتھ ایک بچہ تھا، وہ ذرا ٹھٹھکی، تو بچہ بول پڑا، اماں، صبر کر، تو حق پر ہے۔ ( صحيح مسلم، ملخصًا، كتاب الزهد والرقاق، باب قصة أصحاب الأخدود ) امام ابن کثیر نے اور بھی بعض واقعات نقل کیے ہیں اور جو اس سے مختلف ہیں اور کہا ہے، ممکن ہے اس قسم کے متعدد واقعات مختلف جگہوں پر ہوئے ہوں۔ ( تفصیل کے لئے دیکھئے تفسیر ابن کثیر)۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wamā naqamū min'hum illā an yu'minū bil-lahi al-ʿazīzi al-ḥamīdi ","translations":["And not","they resented","[of] them","except","that","they believed","in Allah","the All-Mighty","the Praiseworthy","(8)"],"transliterationArr":["wamā","naqamū","min'hum","illā","an","yu'minū","bil-lahi","al-ʿazīzi","al-ḥamīdi",null],"verseTiming":[[1,0,630],[2,630,1450],[3,1450,2250],[4,2250,4480],[5,4480,4959],[6,4959,6739],[7,6739,7839],[8,7839,8919],[9,8919,12274]]}}