{"name":"8:17","price":"سو تم نے انہیں قتل نہیں کیا لیکن اللہ تعالیٰ نے ان کو قتل کیا(1) ۔ اور آپ نے خاک کی مٹھی نہیں پھینکی بلکہ اللہ تعالیٰ نے وه پھینکی(2) اور تاکہ مسلمانوں کو اپنی طرف سے ان کی محنت کا خوب عوض دے(3) بلاشبہ اللہ تعالیٰ خوب سننے واﻻ خوب جاننے واﻻ ہے۔","arabic":"فَلَمۡ تَقۡتُلُوهُمۡ وَلَٰكِنَّ ٱللَّهَ قَتَلَهُمۡۚ وَمَا رَمَيۡتَ إِذۡ رَمَيۡتَ وَلَٰكِنَّ ٱللَّهَ رَمَىٰ وَلِيُبۡلِيَ ٱلۡمُؤۡمِنِينَ مِنۡهُ بَلَآءً حَسَنًاۚ إِنَّ ٱللَّهَ سَمِيعٌ عَلِيمٞ","category":["8 (Al-Anfal)","Al-Anfal","Surah Al-Anfal","Chapter Al-Anfal","Anfal","Surah Anfal","Chapter Anfal","Al Anfal","Surah Al Anfal","Chapter Al Anfal","Surah 8","Chapter 8","The Spoils of War","الأنفَال"],"ayahNumber":1177,"juzNumber":9,"footnotes":"(1) یعنی جنگ بدر کی ساری صورت حال تمہارے سامنے رکھ دی گئی ہے اور جس جس طرح اللہ نے تمہاری وہاں مدد فرمائی، اس کی وضاحت کے بعد تم یہ نہ سمجھ لینا کہ کافروں کا قتل، یہ تمہارا کارنامہ ہے۔ نہیں، بلکہ یہ اللہ کی اس مدد کا نتیجہ ہے جس کی وجہ سے تمہیں یہ طاقت حاصل ہوئی۔ اس لیے دراصل انہیں قتل کرنے والا اللہ تعالیٰ ہے۔\n(2) جنگ بدر میں نبی (صلى الله عليه وسلم) نے کنکریوں کی ایک مٹھی بھر کر کافروں کی طرف پھینکی تھی، جسے ایک تو اللہ تعالیٰ نے کافروں کے مونہوں اور آنکھوں تک پہنچا دیا اور دوسرے، اس میں یہ تاثیر پیدا فرما دی کہ اس سے ان کی آنکھیں چندھیا گئیں اور انہیں کچھ سجھائی نہیں دیتا تھا، یہ معجزہ بھی، جو اس وقت اللہ کی مدد سے ظاہر ہوا، مسلمانوں کی کامیابی میں بہت مددگار ثابت ہوا ۔ اللہ تعالیٰ فرما رہا ہے کہ اے پیغمبر! کنکریاں بےشک آپ نے پھینکی تھیں، لیکن اس میں تاثیر ہم نے پیدا کی تھی، اگر ہم اس میں یہ تاثیر پیدا نہ کرتے تو یہ کنکریاں کیا کرسکتی تھیں؟ اس لیے یہ بھی دراصل ہمارا ہی کام تھا نہ کہ آپ کا ۔\n(3) بلاء یہاں نعمت کے معنی میں ہے۔ یعنی اللہ کی یہ تائید ونصرت، اللہ کا انعام ہے جو مومنوں پر ہوا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"falam taqtulūhum walākinna al-laha qatalahum wamā ramayta idh ramayta walākinna al-laha ramā waliyub'liya al-mu'minīna min'hu balāan ḥasanan inna al-laha samīʿun ʿalīmun ","translations":["And not","you kill them","but","Allah","killed them","And not","you threw","when","you threw","but","Allah","threw","and that He may test","the believers","from Him","(with) a trial","good","Indeed","Allah","(is) All-Hearing","All-Knowing","(17)"],"transliterationArr":["falam","taqtulūhum","walākinna","al-laha","qatalahum","wamā","ramayta","idh","ramayta","walākinna","al-laha","ramā","waliyub'liya","al-mu'minīna","min'hu","balāan","ḥasanan","inna","al-laha","samīʿun","ʿalīmun",null],"verseTiming":[[1,0,590],[2,590,2260],[3,2260,4220],[4,4220,5170],[5,5170,6890],[6,6890,7520],[7,7520,8470],[8,8470,8840],[9,8840,9860],[10,9860,11860],[11,11860,12780],[12,12780,13490],[13,13490,15520],[14,15520,17100],[15,17100,17800],[16,17800,20070],[17,20070,21110],[18,21110,22640],[19,22640,23590],[20,23590,24790],[21,24790,27315]]}}