{"name":"8:2","price":"بس ایمان والے تو ایسے ہوتے ہیں کہ جب اللہ تعالیٰ کا ذکر آتا ہے تو ان کے قلوب ڈر جاتے ہیں اور جب اللہ کی آیتیں ان کو پڑھ کر سنائی جاتیں ہیں تو وه آیتیں ان کے ایمان کو اور زیاده کردیتی ہیں اور وه لوگ اپنے رب پر توکل کرتے ہیں۔(1)","arabic":"إِنَّمَا ٱلۡمُؤۡمِنُونَ ٱلَّذِينَ إِذَا ذُكِرَ ٱللَّهُ وَجِلَتۡ قُلُوبُهُمۡ وَإِذَا تُلِيَتۡ عَلَيۡهِمۡ ءَايَٰتُهُۥ زَادَتۡهُمۡ إِيمَٰنٗا وَعَلَىٰ رَبِّهِمۡ يَتَوَكَّلُونَ","category":["8 (Al-Anfal)","Al-Anfal","Surah Al-Anfal","Chapter Al-Anfal","Anfal","Surah Anfal","Chapter Anfal","Al Anfal","Surah Al Anfal","Chapter Al Anfal","Surah 8","Chapter 8","The Spoils of War","الأنفَال"],"ayahNumber":1162,"juzNumber":9,"footnotes":"(1) ان آیات میں اہل ایمان کی 4 صفات بیان کی گئی ہیں; 1۔ وہ اللہ اور اس کے رسول (صلى الله عليه وسلم) کی اطاعت کرتے ہیں نہ کہ صرف اللہ کی یعنی قرآن کی۔ 2۔ اللہ کا ذکر سن کر، اللہ کی جلالت وعظمت سے ان کے دل کانپ اٹھتے ہیں۔ 3۔ تلاوت قرآن سے ان کے ایمانوں میں اضافہ ہوتا ہے (جس سے معلوم ہوا کہ ایمان میں کمی بیشی ہوتی ہے، جیسا کہ محدثین کا مسلک ہے) 4۔ اور وہ اپنے رب پر توکل کرتے ہیں۔ توکل کا مطلب ہے کہ ظاہری اسباب اختیار کرنے کے بعد اللہ کی ذات پر بھروسہ کرتے ہیں۔ یعنی اسباب سے اعراض وگریز بھی نہیں کرتے کیونکہ انہیں اختیار کرنے کا حکم اللہ تعالیٰ نے ہی دیا ہے، لیکن اسباب ظاہری کو ہی سب کچھ نہیں سمجھ لیتے بلکہ ان کا یہ یقین ہوتا ہے کہ اصل کارفرما مشیت الٰہی ہی ہے، اس لیے جب تک اللہ کی مشیت بھی نہیں ہوگی، یہ ظاہری اسباب کچھ نہیں کرسکیں گے اور اس یقین واعتماد کی بنیاد پر پھر وہ اللہ کی مدد واعانت حاصل کرنے سے ایک لمحے کے لیے بھی غافل نہیں ہوتے۔ آگے ان کی مزید صفات کا تذکرہ ہے اور ان صفات کے حاملین کے لیے اللہ کی طرف سے سچے مومن ہونے کا سرٹیفکیٹ اور مغفرت ورحمت الٰہی اور رزق کریم کی نوید ہے ۔ جَعَلَنَا اللهُ مِنْهُمْ (اللہ تعالیٰ ہمیں بھی ان میں شمار فرما لے)۔\nجنگ بدر کا پس منظر: جنگ بدر، جو ٢ ہجری میں ہوئی، کافروں کے ساتھ مسلمانوں کی پہلی جنگ تھی۔ علاوہ ازیں یہ منصوبہ بندی اور تیاری کے بغیر اچانک ہوئی۔ نیز بے سروسامانی کی وجہ سے بعض مسلمان ذہنی طور پر اس کے لیے تیار بھی نہیں تھے۔ مختصراً اس کا پس منظر اس طرح ہے کہ ابوسفیان کی (جو ابھی مسلمان نہیں ہوئے تھے) سرکردگی میں ایک تجارتی قافلہ شام سے مکہ جارہا تھا، چونکہ مسلمانوں کا بھی بہت سا مال واسباب ہجرت کی وجہ سے مکہ رہ گیا تھا، یا کافروں نے چھین لیا تھا، نیز کافروں کی قوت وشوکت کو توڑنا بھی مقتضائے وقت تھا، ان تمام باتوں کے پیش نظر رسول اللہ (صلى الله عليه وسلم) نے اس تجارتی قافلے پر حملے کرنے کا پروگرام بنایا اور مسلمان اس نیت سے مدینہ سے چل پڑے۔ ابوسفیان کو بھی اس امر کی اطلاع مل گئی۔ چنانچہ انہوں نے ایک تو اپنا راستہ تبدیل کرلیا۔ دوسرے، مکہ اطلاع بھجوادی جس کی بنا پر ابوجہل ایک لشکر لے کر اپنے قافلے کی حفاظت کے لیے بدر کی جانب چل پڑا، نبی (صلى الله عليه وسلم) کو اس صورت حال کا علم ہوا تو صحابہ کرام کے سامنے معاملہ رکھ دیا اور اللہ کا وعدہ بھی بتلایا کہ ان دونوں (تجارتی قافلہ اور لشکر) میں سے ایک چیز تمہیں ضرور حاصل ہوگی۔ تاہم پھر بھی لڑائی میں بعض صحابہ نے تردد کا اظہار اور تجارتی قافلے کے تعاقب کا مشورہ دیا، جب کہ دوسرے تمام صحابہ نے رسول اللہ (صلى الله عليه وسلم) کے ساتھ لڑنے میں بھرپور تعاون کا یقین دلایا۔ اسی پس منظر میں یہ آیات نازل ہوئیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"innamā al-mu'minūna alladhīna idhā dhukira al-lahu wajilat qulūbuhum wa-idhā tuliyat ʿalayhim āyātuhu zādathum īmānan waʿalā rabbihim yatawakkalūna ","translations":["Only","the believers","(are) those who","when","is mentioned","Allah","feel fear","their hearts","and when","are recited","to them","His Verses","they increase them","(in) faith","and upon","their Lord","they put their trust","(2)"],"transliterationArr":["innamā","al-mu'minūna","alladhīna","idhā","dhukira","al-lahu","wajilat","qulūbuhum","wa-idhā","tuliyat","ʿalayhim","āyātuhu","zādathum","īmānan","waʿalā","rabbihim","yatawakkalūna",null],"verseTiming":[[1,0,1900],[2,1900,3460],[3,3460,4540],[4,4540,5230],[5,5230,5920],[6,5920,6860],[7,6860,7670],[8,7670,9000],[9,9000,9810],[10,9810,10710],[11,10710,11800],[12,11800,13300],[13,13300,14750],[14,14750,16670],[15,16670,17860],[16,17860,18720],[17,18720,19830],[18,19830,21350],[19,21350,22810],[20,22810,23990],[21,23990,25300],[22,25300,26090],[23,26090,27150],[24,27150,31015]]}}