{"name":"8:24","price":"اے ایمان والو! تم اللہ اور رسول کے کہنے کو بجا لاؤ، جب کہ رسول تم کو تمہاری زندگی بخش چیز کی طرف بلاتے ہوں(1) اور جان رکھو کہ اللہ تعالیٰ آدمی کے اور اس کے قلب کے درمیان آڑ بن جایا کرتا ہے(2) اور بلاشبہ تم سب کو اللہ ہی کے پاس جمع ہونا ہے۔","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱسۡتَجِيبُواْ لِلَّهِ وَلِلرَّسُولِ إِذَا دَعَاكُمۡ لِمَا يُحۡيِيكُمۡۖ وَٱعۡلَمُوٓاْ أَنَّ ٱللَّهَ يَحُولُ بَيۡنَ ٱلۡمَرۡءِ وَقَلۡبِهِۦ وَأَنَّهُۥٓ إِلَيۡهِ تُحۡشَرُونَ","category":["8 (Al-Anfal)","Al-Anfal","Surah Al-Anfal","Chapter Al-Anfal","Anfal","Surah Anfal","Chapter Anfal","Al Anfal","Surah Al Anfal","Chapter Al Anfal","Surah 8","Chapter 8","The Spoils of War","الأنفَال"],"ayahNumber":1184,"juzNumber":9,"footnotes":"(1) لِمَا يُحْيِيكُمْ ایسی چیزوں کی طرف جس سے تمہیں زندگی ملے۔ بعض نے اس سے جہاد مراد لیا ہے کہ اس میں تمہاری زندگی کا سروسامان ہے۔ بعض نے قرآن کے اوامر ونواہی اور احکام شرعیہ مرادلئے ہیں، جن میں جہاد بھی آجاتا ہے مطلب یہ ہے کہ صرف اللہ اور رسول (صلى الله عليه وسلم) کی بات مانو، اور اس پر عمل کرو، اسی میں تمہاری زندگی ہے۔\n(2) یعنی موت وارد کرکے۔ جس کا مزہ ہر نفس کو چکھنا ہے، مطلب یہ ہے کہ قبل اس کے کہ تمہیں موت آجائے اللہ اور رسول کی بات مان لو اور اس پر عمل کر لو ۔ بعض نے کہا ہےکہ اللہ تعالیٰ انسان کے دل کے جس طرح قریب ہے اس میں اسےبطور تمثیل بیان کیا گیا ہے اور مطلب یہ ہے کہ وہ دلوں کے بھیدوں کو جانتا ہے، اس سے کوئی چیز مخفی نہیں ۔ امام ابن جریر نے اس کا مفہوم یہ بیان کیا ہے کہ وہ اپنے بندوں کے دلوں پر پورا اختیار رکھتا ہے اور جب چاہتا ہے ان کے اور ان کے دلوں کے درمیان حائل ہو جاتا ہے۔ حتیٰ کہ انسان اس کی مشیت کے بغیر کسی چیز کو پا نہیں سکتا ۔ بعض نے اسے جنگ بدر سے متعلق قرار دیا ہے کہ مسلمان دشمن کی کثرت سے خوف زدہ تھے تو اللہ تعالیٰ نے دلوں کے درمیان حائل ہو کر مسلمانوں کے دلوں میں موجود خوف کو امن سے بدل دیا۔ امام شوکانی فرماتے ہیں کہ آیت کے یہ سارے ہی مفہوم مراد ہو سکتے ہیں (فتح القدیر) امام ابن جریر کے بیان کردہ مفہوم کی تائید ان احادیث سےہوتی ہے، جن میں دین پر ثابت قدمی کی دعائیں کرنے کی تاکید کی گئی ہے ۔ مثلا ایک حدیث میں رسول اللہ (صلى الله عليه وسلم)نے فرمایا: ”بنی آدم کے دل، ایک دل کی طرح رحمٰن کی دو انگلیوں کے درمیان ہیں۔ انہیں جس طرح چاہتا ہےپھیرتا رہتا ہے“ پھر آپ (صلى الله عليه وسلم) نے یہ دعا پڑھی ۔ «اللَّهُمَّ مُصَرِّفَ الْقُلُوبِ ، صَرِّفْ قُلُوبَنَا إِلَى طَاعَتِكَ» (صحيح مسلم- كتاب القدر، باب تصريف الله تعالى القلوب كيف شاء) ”اے دلوں کے پھیرنے والے ! ہمارے دلوں کو اپنی اطاعت کی طرف پھیر دے“۔ بعض روایات میں ثَبِّتْ قَلْبِي عَلَى دِينِكَ (سنن ترمذي - أبواب القدر) کے الفاظ ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāayyuhā alladhīna āmanū is'tajībū lillahi walilrrasūli idhā daʿākum limā yuḥ'yīkum wa-iʿ'lamū anna al-laha yaḥūlu bayna al-mari waqalbihi wa-annahu ilayhi tuḥ'sharūna ","translations":["O you","who","believe","Respond","to Allah","and His Messenger","when","he calls you","to what","gives you life","And know","that","Allah","comes","(in) between","a man","and his heart","and that","to Him","you will be gathered","(24)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","is'tajībū","lillahi","walilrrasūli","idhā","daʿākum","limā","yuḥ'yīkum","wa-iʿ'lamū","anna","al-laha","yaḥūlu","bayna","al-mari","waqalbihi","wa-annahu","ilayhi","tuḥ'sharūna",null],"verseTiming":[[1,0,2970],[2,2970,4110],[3,4110,5010],[4,5010,6380],[5,6380,7620],[6,7620,9290],[7,9290,9920],[8,9920,11130],[9,11130,11890],[10,11890,13960],[11,13960,16520],[12,16520,17689],[13,17689,18649],[14,18649,19679],[15,19679,20249],[16,20249,21219],[17,21219,22619],[18,22619,25809],[19,25809,26759],[20,26759,29384]]}}