{"name":"8:27","price":"اے ایمان والو! تم اللہ اور رسول (کے حقوق) میں جانتے ہوئے خیانت مت کرو اور اپنی قابل حفاﻇت چیزوں میں خیانت مت کرو۔(1)","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَخُونُواْ ٱللَّهَ وَٱلرَّسُولَ وَتَخُونُوٓاْ أَمَٰنَٰتِكُمۡ وَأَنتُمۡ تَعۡلَمُونَ","category":["8 (Al-Anfal)","Al-Anfal","Surah Al-Anfal","Chapter Al-Anfal","Anfal","Surah Anfal","Chapter Anfal","Al Anfal","Surah Al Anfal","Chapter Al Anfal","Surah 8","Chapter 8","The Spoils of War","الأنفَال"],"ayahNumber":1187,"juzNumber":9,"footnotes":"(1) اللہ اور رسول کے حقوق میں خیانت یہ ہے کہ جلوت میں اللہ اور رسول (صلى الله عليه وسلم) کا تابع دار بن کر رہے اور خلوت میں اس کے برعکس معصیت کار، اسی طرح یہ بھی خیانت ہے کہ فرائض میں سے کسی فرض کا ترک اور نواہی میں سے کسی بات کا ارتکاب کیا جائے ۔ اور کا مطلب ایک شخص دوسرے کے پاس جو امانت رکھواتا ہے اس میں خیانت نہ کرے۔ نبی (صلى الله عليه وسلم) نے بھی امانت کی حفاظت کی بڑی تاکید فرمائی ہے۔ حدیث میں ہے کہ نبی (صلى الله عليه وسلم) اپنے اکثر خطبوں میں یہ ضرور ارشاد فرماتے تھے: «لا إِيمَانَ لِمَنْ لا أَمَانَةَ لَهُ وَلا دِينَ لِمَنْ لا عَهْدَ لَهُ» (مسند أحمد جلد 3 صفحة 135، وقال الألباني حديث جيد، تعليقات الألباني على المشكاة) ”اس کا ایمان نہیں، جس کے اندر امانت کی پاسداری نہیں اور اس کا دین نہیں، جس کے اندر عہد کی پابندی کا احساس نہیں“۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāayyuhā alladhīna āmanū lā takhūnū al-laha wal-rasūla watakhūnū amānātikum wa-antum taʿlamūna ","translations":["O you","who","believe","(Do) not","betray","Allah","and the Messenger","or betray","your trusts","while you","know","(27)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","lā","takhūnū","al-laha","wal-rasūla","watakhūnū","amānātikum","wa-antum","taʿlamūna",null],"verseTiming":[[1,0,3310],[2,3310,4370],[3,4370,5610],[4,5610,6030],[5,6030,6960],[6,6960,7870],[7,7870,9390],[8,9390,11879],[9,11879,13719],[10,13719,15759],[11,15759,18234]]}}