{"name":"8:29","price":"اے ایمان والو! اگر تم اللہ سے ڈرتے رہو گے تو اللہ تعالیٰ تم کو ایک فیصلہ کی چیز دے گا اور تم سے تمہارے گناه دور کر دے گا اور تم کو بخش دے گا اور اللہ تعالیٰ بڑے فضل واﻻ ہے۔(1)","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِن تَتَّقُواْ ٱللَّهَ يَجۡعَل لَّكُمۡ فُرۡقَانٗا وَيُكَفِّرۡ عَنكُمۡ سَيِّـَٔاتِكُمۡ وَيَغۡفِرۡ لَكُمۡۗ وَٱللَّهُ ذُو ٱلۡفَضۡلِ ٱلۡعَظِيمِ","category":["8 (Al-Anfal)","Al-Anfal","Surah Al-Anfal","Chapter Al-Anfal","Anfal","Surah Anfal","Chapter Anfal","Al Anfal","Surah Al Anfal","Chapter Al Anfal","Surah 8","Chapter 8","The Spoils of War","الأنفَال"],"ayahNumber":1189,"juzNumber":9,"footnotes":"(1) تقویٰ کا مطلب ہے، اوامرِ الٰہی کی مخالفت اور اس کے مناہی کے ارتکاب سے بچنا، اور فرقان کے کئی معنی بیان کئے گئے ہیں مثلا ایسی چیز جس سے حق وباطل کے درمیان فرق کیا جا سکے۔ مطلب یہ ہے کہ تقویٰ کی بدولت دل مضبوط، بصیرت تیز اور ہدایت کا راستہ واضح تر ہو جاتا ہے، جس سے انسان کو ہر ایسے موقعے پر، جب عام انسان التباس واشتباہ کی وادیوں میں بھٹک رہے ہوں، صراط مستقیم کی توفیق مل جاتی ہے۔ علاوہ ازیں فتح نصرت اور نجات ومخرج بھی اس کے معنی کئے گئے ہیں۔ اور سارے ہی معانی مراد ہو سکتے ہیں، کیونکہ تقویٰ سے یقینا یہ سارے ہی فوائد حاصل ہوتے ہیں، بلکہ اس کے ساتھ تکفیر سیئات، مغفرت ذنوب اور فضل عظیم بھی حاصل ہوتا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāayyuhā alladhīna āmanū in tattaqū al-laha yajʿal lakum fur'qānan wayukaffir ʿankum sayyiātikum wayaghfir lakum wal-lahu dhū al-faḍli al-ʿaẓīmi ","translations":["O you","who","believe","If","you fear","Allah","He will grant","you","a criterion","and will remove","from you","your evil deeds","and forgive","you","And Allah","(is) the Possessor","(of) Bounty","the Great","(29)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","in","tattaqū","al-laha","yajʿal","lakum","fur'qānan","wayukaffir","ʿankum","sayyiātikum","wayaghfir","lakum","wal-lahu","dhū","al-faḍli","al-ʿaẓīmi",null],"verseTiming":[[1,0,3090],[2,3090,4100],[3,4100,6570],[4,6570,7630],[5,7630,8510],[6,8510,9400],[7,9400,10310],[8,10310,10930],[9,10930,12940],[10,12940,14180],[11,14180,15840],[12,15840,17760],[13,17760,18800],[14,18800,20040],[15,20040,21170],[16,21170,21410],[17,21410,22320],[18,22320,24965]]}}