{"name":"8:36","price":"بلاشک یہ کافر لوگ اپنے مالوں کو اس لئے خرچ کر رہے ہیں کہ اللہ کی راه سے روکیں سو یہ لوگ تو اپنے مالوں کو خرچ کرتے ہی رہیں گے، پھر وه مال ان کے حق میں باعث حسرت ہو جائیں گے۔ پھر مغلوب ہو جائیں گے اور کافر لوگوں کو دوزخ کی طرف جمع کیا جائے گا۔(1)","arabic":"إِنَّ ٱلَّذِينَ كَفَرُواْ يُنفِقُونَ أَمۡوَٰلَهُمۡ لِيَصُدُّواْ عَن سَبِيلِ ٱللَّهِۚ فَسَيُنفِقُونَهَا ثُمَّ تَكُونُ عَلَيۡهِمۡ حَسۡرَةٗ ثُمَّ يُغۡلَبُونَۗ وَٱلَّذِينَ كَفَرُوٓاْ إِلَىٰ جَهَنَّمَ يُحۡشَرُونَ","category":["8 (Al-Anfal)","Al-Anfal","Surah Al-Anfal","Chapter Al-Anfal","Anfal","Surah Anfal","Chapter Anfal","Al Anfal","Surah Al Anfal","Chapter Al Anfal","Surah 8","Chapter 8","The Spoils of War","الأنفَال"],"ayahNumber":1196,"juzNumber":9,"footnotes":"(1) جب قریش مکہ کو بدر میں شکست ہوئی اور ان کے شکست خوردہ اصحاب مکہ واپس گئے۔ ادھر سےابوسفیان بھی اپنا تجارتی قافلہ لے کر وہاں پہنچ چکے تھے تو کچھ لوگ، جن کے باپ، بیٹے یا بھائی اس جنگ میں مارے گئے تھے، ابوسفیان اور جن کا اس تجارتی سامان میں حصہ تھا، ان کے پاس گئے اور ان سے استدعا کی کہ وہ اس مال کو مسلمانوں سے بدلہ لینے کے لئے استعمال کریں۔ مسلمانوں نے ہمیں بڑا سخت نقصان پہنچایا ہے اس لئے ان سے انتقامی جنگ ضروری ہے۔ اللہ تعالیٰ نے اس آیت میں انہی لوگوں یا اسی قسم کا کردار اپنانے والوں کے بارے میں فرمایا کہ بے شک یہ لوگ اللہ کے راستے سے لوگوں کو روکنے کے لئے اپنا مال خرچ کر لیں لیکن ان کے حصے میں سوائے حسرت اور مغلوبیت کے کچھ نہیں آئےگا اور آخرت میں ان کا ٹھکانہ جہنم ہوگا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"inna alladhīna kafarū yunfiqūna amwālahum liyaṣuddū ʿan sabīli al-lahi fasayunfiqūnahā thumma takūnu ʿalayhim ḥasratan thumma yugh'labūna wa-alladhīna kafarū ilā jahannama yuḥ'sharūna ","translations":["Indeed","those who","disbelieve","they spend","their wealth","to hinder (people)","from","(the) way","(of) Allah","So they will spend it","then","it will be","for them","a regret","then","they will be overcome","And those who","disbelieve","to","Hell","they will be gathered","(36)"],"transliterationArr":["inna","alladhīna","kafarū","yunfiqūna","amwālahum","liyaṣuddū","ʿan","sabīli","al-lahi","fasayunfiqūnahā","thumma","takūnu","ʿalayhim","ḥasratan","thumma","yugh'labūna","wa-alladhīna","kafarū","ilā","jahannama","yuḥ'sharūna",null],"verseTiming":[[1,0,1300],[2,1300,2420],[3,2420,3410],[4,3410,5720],[5,5720,7290],[6,7290,8770],[7,8770,9560],[8,9560,11030],[9,11030,13730],[10,13730,16630],[11,16630,18020],[12,18020,19010],[13,19010,20200],[14,20200,22160],[15,22160,23630],[16,23630,27490],[17,27490,28710],[18,28710,31270],[19,31270,31920],[20,31920,34110],[21,34110,37795]]}}