{"name":"8:37","price":"تاکہ اللہ تعالیٰ ناپاک کو پاک سے الگ کر دے(1) اور ناپاکوں کو ایک دوسرے سے ملا دے، پس ان سب کو اکھٹا ڈھیر کر دے پھر ان سب کو جہنم میں ڈال دے۔ ایسے لوگ پورے خسارے میں ہیں۔","arabic":"لِيَمِيزَ ٱللَّهُ ٱلۡخَبِيثَ مِنَ ٱلطَّيِّبِ وَيَجۡعَلَ ٱلۡخَبِيثَ بَعۡضَهُۥ عَلَىٰ بَعۡضٖ فَيَرۡكُمَهُۥ جَمِيعٗا فَيَجۡعَلَهُۥ فِي جَهَنَّمَۚ أُوْلَٰٓئِكَ هُمُ ٱلۡخَٰسِرُونَ","category":["8 (Al-Anfal)","Al-Anfal","Surah Al-Anfal","Chapter Al-Anfal","Anfal","Surah Anfal","Chapter Anfal","Al Anfal","Surah Al Anfal","Chapter Al Anfal","Surah 8","Chapter 8","The Spoils of War","الأنفَال"],"ayahNumber":1197,"juzNumber":9,"footnotes":"(1) یہ علیحدگی یا تو آخرت میں ہوگی کہ اہل سعادت کو اہل شقاوت سے الگ کر دیا جائےگا، جیسا کہ فرمایا ۔ ”وَٱمۡتَٰزُواْ ٱلۡيَوۡمَ أَيُّهَا ٱلۡمُجۡرِمُونَ“ [يس: 59] ”اے گناہ گارو! آج الگ ہو جاؤ“، یعنی نیک لوگوں سے اور مجرموں یعنی کافروں، مشرکوں اور نافرمانوں کو اکھٹا کرکے سب کو جہنم میں ڈال دیا جائے گا۔ یا پھر اس کا تعلق دنیا سے ہے اور لام تعلیل کے لئے ہے۔ یعنی کافر اللہ کے راستے سے روکنے کے لئے جو مال خرچ کر رہے ہیں، ہم ان کو ایسا کرنے کا موقع دیں گے تاکہ اس طریقے سے اللہ تعالیٰ خبیث کو طیب سے، کافر کو مومن سے اور منافق کو مخلص سے علیحدہ کر دے۔ اس اعتبار سے آیت کے معنی ہوں گے، کفار کے ذریعے سے ہم تمہاری آزمائش کریں گے، وہ تم سےلڑیں گے اور ہم انہیں ان کے مال بھی لڑائی پر خرچ کرنے کی قدرت دیں گے تاکہ خبیث، طیب سے ممتاز ہو جائے۔ پھر وہ خبیث کو ایک دوسرے سے ملا دے گا یعنی سب کو جمع کر دے گا۔ ( ابن کثیر)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"liyamīza al-lahu al-khabītha mina al-ṭayibi wayajʿala al-khabītha baʿḍahu ʿalā baʿḍin fayarkumahu jamīʿan fayajʿalahu fī jahannama ulāika humu al-khāsirūna ","translations":["That may distinguish","Allah","the wicked","from","the good","and place","the wicked","some of them","on","others","and heap them","all together","and put them","in","Hell","Those ","they","(are) the losers","(37)"],"transliterationArr":["liyamīza","al-lahu","al-khabītha","mina","al-ṭayibi","wayajʿala","al-khabītha","baʿḍahu","ʿalā","baʿḍin","fayarkumahu","jamīʿan","fayajʿalahu","fī","jahannama","ulāika","humu","al-khāsirūna",null],"verseTiming":[[1,0,1160],[2,1160,2150],[3,2150,3340],[4,3340,3670],[5,3670,4940],[6,4940,6100],[7,6100,7250],[8,7250,8360],[9,8360,9040],[10,9040,10870],[11,10870,12420],[12,12420,14260],[13,14260,15830],[14,15830,16300],[15,16300,18340],[16,18340,21650],[17,21650,22050],[18,22050,25865]]}}