{"name":"8:45","price":"اے ایمان والو! جب تم کسی مخالف فوج سے بھڑ جاؤ تو ﺛابت قدم رہو اور بکثرت اللہ کو یاد کرو تاکہ تمہیں کامیابی حاصل ہو۔(1)","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِذَا لَقِيتُمۡ فِئَةٗ فَٱثۡبُتُواْ وَٱذۡكُرُواْ ٱللَّهَ كَثِيرٗا لَّعَلَّكُمۡ تُفۡلِحُونَ","category":["8 (Al-Anfal)","Al-Anfal","Surah Al-Anfal","Chapter Al-Anfal","Anfal","Surah Anfal","Chapter Anfal","Al Anfal","Surah Al Anfal","Chapter Al Anfal","Surah 8","Chapter 8","The Spoils of War","الأنفَال"],"ayahNumber":1205,"juzNumber":10,"footnotes":"(1) اب مسلمانوں کو لڑائی کے وہ آداب بتائے جا رہے ہیں جن کو دشمن سے مقابلے کے وقت ملحوظ رکھنا ضروری ہے۔ سب سے پہلی بات ثبات قدمی اور استقلال ہے، کیونکہ اس کے بغیر میدان جنگ میں ٹھہرنا ممکن ہی نہیں ہے تاہم اس سے تحرف اور تحیز کی وہ دونوں صورتیں مستثنیٰ ہوں گی جن کی پہلے وضاحت کی جا چکی ہے کیونکہ بعض دفعہ ثبات قدمی کے لئے بھی تحرف یا تحیز ناگزیر ہوتا ہے۔ دوسری ہدایت; اللہ کو کثرت سےیاد کرو۔ تاکہ مسلمان اگر تھوڑے ہوں تو اللہ کی مدد کے طالب رہیں اور اللہ بھی کثرت ذکر کی وجہ سے ان کی طرف متوجہ رہے اور اگر مسلمان تعداد میں زیادہ ہوں تو کثرت کی وجہ سے ان کے اندر عجب اور غرور پیدا نہ ہو، بلکہ اصل توجہ اللہ کی امداد پر ہی رہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāayyuhā alladhīna āmanū idhā laqītum fi-atan fa-uth'butū wa-udh'kurū al-laha kathīran laʿallakum tuf'liḥūna ","translations":["O you","who","believe","When","you meet","a force","then be firm","and remember","Allah","much","so that you may","(be) successful","(45)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","idhā","laqītum","fi-atan","fa-uth'butū","wa-udh'kurū","al-laha","kathīran","laʿallakum","tuf'liḥūna",null],"verseTiming":[[1,0,2900],[2,2900,3890],[3,3890,5900],[4,5900,6540],[5,6540,7470],[6,7470,9250],[7,9250,10440],[8,10440,11950],[9,11950,12790],[10,12790,13500],[11,13500,14410],[12,14410,15800],[13,15800,18775]]}}