{"name":"8:49","price":"جبکہ منافق کہہ رہے تھے اور وه بھی جن کے دلوں میں روگ تھا(1) کہ انہیں تو ان کے دین نے دھوکے میں ڈال دیا ہے(2) جو بھی اللہ پر بھروسہ کرے اللہ تعالیٰ بلا شک وشبہ غلبے واﻻ اور حکمت واﻻ ہے۔(3)","arabic":"إِذۡ يَقُولُ ٱلۡمُنَٰفِقُونَ وَٱلَّذِينَ فِي قُلُوبِهِم مَّرَضٌ غَرَّ هَٰٓؤُلَآءِ دِينُهُمۡۗ وَمَن يَتَوَكَّلۡ عَلَى ٱللَّهِ فَإِنَّ ٱللَّهَ عَزِيزٌ حَكِيمٞ","category":["8 (Al-Anfal)","Al-Anfal","Surah Al-Anfal","Chapter Al-Anfal","Anfal","Surah Anfal","Chapter Anfal","Al Anfal","Surah Al Anfal","Chapter Al Anfal","Surah 8","Chapter 8","The Spoils of War","الأنفَال"],"ayahNumber":1209,"juzNumber":10,"footnotes":"(1) اس سے مراد یا تو وہ مسلمان ہیں جو نئے نئے مسلمان ہوئے تھے اور مسلمانوں کی کامیابی کے بارے میں انہیں شک تھا، یا اس سے مراد مشرکین ہیں اور یہ بھی ممکن ہے کہ مدینہ میں رہنے والے یہودی مرادہوں۔\n(2) یعنی ان کی تعداد تو دیکھو اور سروسامان کا جو حال ہے، وہ بھی ظاہر ہے۔ لیکن یہ مقابلہ کرنے چلے ہیں مشرکین مکہ سے، جو تعداد میں بھی ان سے کہیں زیادہ ہیں اور ہر طرح کے سامان حرب اور وسائل سے مالا مال بھی ۔ معلوم ہوتا ہے کہ ان کے دین نے ان کو دھوکے اور فریب میں ڈال دیا ہے۔ اور یہ موٹی سی بات بھی ان کی سمجھ میں نہیں آرہی۔\n(3) اللہ تعالیٰ نے فرمایا: ان اہل دنیا کو اہل ایمان کے عزم وثبات کا کیا اندازہ ہو سکتا ہے جن کا توکل اللہ کی ذات پر ہے، جو غالب ہے یعنی اپنے بھروسہ کرنے والوں کو بے سہارا نہیں چھوڑتا اور حکیم بھی ہے اور اس کے ہر فعل میں حکمت بالغہ ہے جس کے ادراک سے انسانی عقلیں قاصر ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"idh yaqūlu al-munāfiqūna wa-alladhīna fī qulūbihim maraḍun gharra hāulāi dīnuhum waman yatawakkal ʿalā al-lahi fa-inna al-laha ʿazīzun ḥakīmun ","translations":["When","said","the hypocrites","and those who ","in","their hearts","(was) a disease","(Had) deluded","these (people)","their religion","But whoever","puts (his) trust","in","Allah","then indeed","Allah","(is) All-Mighty","All-Wise","(49)"],"transliterationArr":["idh","yaqūlu","al-munāfiqūna","wa-alladhīna","fī","qulūbihim","maraḍun","gharra","hāulāi","dīnuhum","waman","yatawakkal","ʿalā","al-lahi","fa-inna","al-laha","ʿazīzun","ḥakīmun",null],"verseTiming":[[1,0,460],[2,460,1330],[3,1330,3120],[4,3120,4370],[5,4370,4750],[6,4750,6060],[7,6060,7620],[8,7620,8290],[9,8290,10069],[10,10069,11898],[11,11898,13559],[12,13559,14009],[13,14009,15959],[14,15959,16379],[15,16379,17249],[16,17249,18619],[17,18619,19539],[18,19539,20599],[19,20599,23614]]}}