{"name":"8:67","price":"نبی کے ہاتھ میں قیدی نہیں چاہییں جب تک کہ ملک میں اچھی خونریزی کی جنگ نہ ہو جائے۔ تم تو دنیا کے مال چاہتے ہو اور اللہ کا اراده آخرت کا ہے(1) اور اللہ زور آور باحکمت ہے۔","arabic":"مَا كَانَ لِنَبِيٍّ أَن يَكُونَ لَهُۥٓ أَسۡرَىٰ حَتَّىٰ يُثۡخِنَ فِي ٱلۡأَرۡضِۚ تُرِيدُونَ عَرَضَ ٱلدُّنۡيَا وَٱللَّهُ يُرِيدُ ٱلۡأٓخِرَةَۗ وَٱللَّهُ عَزِيزٌ حَكِيمٞ","category":["8 (Al-Anfal)","Al-Anfal","Surah Al-Anfal","Chapter Al-Anfal","Anfal","Surah Anfal","Chapter Anfal","Al Anfal","Surah Al Anfal","Chapter Al Anfal","Surah 8","Chapter 8","The Spoils of War","الأنفَال"],"ayahNumber":1227,"juzNumber":10,"footnotes":"(1) جنگ بدر میں ستر کافر مارے گئے اور ستر ہی قیدی بنا لئے گئے۔ یہ کفر واسلام کا چونکہ پہلا معرکہ تھا۔ اس لئے قیدیوں کے بارے میں کیا طرز عمل اختیار کیا جائے؟ ان کی بابت احکام پوری طرح واضح نہیں تھے۔ چنانچہ نبی (صلى الله عليه وسلم) نے ان ستر قیدیوں کے بارے میں مشورہ کیا کہ کیا کیا جائے؟ ان کو قتل کر دیا جائے یا فدیہ لے کر چھوڑ دیا جائے ؟ جواز کی حد تک دونوں ہی باتوں کی گنجائش تھی ۔ اسی لئے دونوں ہی باتیں زیر غور آئیں۔ لیکن بعض دفعہ جواز وعدم جواز سے قطع نظر حالات وظروف کے اعتبار سے زیادہ بہتر صورت اختیار کرنے کی ضرورت ہوتی ہے۔ یہاں بھی ضرورت زیادہ بہتر صورت اختیار کرنے کی تھی۔ لیکن جواز کو سامنے رکھتے ہوئے کم تر صورت اختیار کر لی گئی، جس پر اللہ تعالیٰ کی طرف سے عتاب نازل ہوا۔ مشورے میں حضرت عمررضی اللہ عنہ وغیرہ نے یہ مشورہ دیا کہ کفر کی قوت وشوکت توڑنے کے لئے ضروری ہے کہ ان قیدیوں کو قتل کر دیا جائے، کیونکہ یہ کفر اور کافروں کے سرغنے ہیں، یہ آزاد ہو کر اسلام اور مسلمانوں کے خلاف زیادہ سازشیں کریں گے۔ جبکہ حضرت ابوبکر رضی اللہ عنہ وغیرہ کی رائے اس کے برعکس یہ تھی کہ فدیہ لے کر انہیں چھوڑ دیا جائے اس مال سے آئندہ جنگ کی تیاری کی جائے نبی (صلى الله عليه وسلم) نے بھی اسی رائے کو پسند فرمایا جس پر یہ اور اس کے بعد کی آیات نازل ہوئیں، ”حَتَّى يُثْخِنَ فِي الأَرْضِ“ کا مطلب ہے کہ اگر ملک میں کفر کا غلبہ ہے (جیسا کہ اس وقت عرب میں کفر کا غلبہ تھا) تو کافروں کی خوں ریزی کرکے کفر کی قوت کو توڑنا ضروری ہے۔ اس نکتے کو نظر انداز کرکے تم نے جو فدیہ قبول کیا ہے تو گویا، زیادہ بہتر صورت کو چھوڑ کر کم تر صورت کو اختیار کیا ہے جو تمہاری غلطی ہے۔ بعد میں جب کفر کا غلبہ ختم ہو گیا تو قیدیوں کے بارے میں امام وقت کو اختیار دے دیا گیا کہ وہ چاہے تو قتل کر دے، فدیہ لے کر چھوڑ دے یا مسلمان قیدیوں کے ساتھ تبادلہ کرلے اور چاہے تو ان کو غلام بنا لے، حالات وظروف کے مطابق کوئی بھی صورت اختیار کرنا جائز ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"mā kāna linabiyyin an yakūna lahu asrā ḥattā yuth'khina fī al-arḍi turīdūna ʿaraḍa al-dun'yā wal-lahu yurīdu al-ākhirata wal-lahu ʿazīzun ḥakīmun ","translations":["Not","is","for a Prophet","that","(there) should be","for him","prisoners of war","until","he has battled strenuously","in","the land","You desire","(the) commodities","(of) the world","but Allah","desires","(for you) the Hereafter","And Allah","(is) All-Mighty","All-Wise","(67)"],"transliterationArr":["mā","kāna","linabiyyin","an","yakūna","lahu","asrā","ḥattā","yuth'khina","fī","al-arḍi","turīdūna","ʿaraḍa","al-dun'yā","wal-lahu","yurīdu","al-ākhirata","wal-lahu","ʿazīzun","ḥakīmun",null],"verseTiming":[[1,0,580],[2,580,1230],[3,1230,2610],[4,2610,2870],[5,2870,3770],[6,3770,4530],[7,4530,6560],[8,6560,7410],[9,7410,8320],[10,8320,9180],[11,9180,9400],[12,9400,10760],[13,10760,11960],[14,11960,12590],[15,12590,13780],[16,13780,14940],[17,14940,15770],[18,15770,17500],[19,17500,18530],[20,18530,19550],[21,19550,22915]]}}