{"name":"8:73","price":"کافر آپس میں ایک دوسرے کے رفیق ہیں، اگر تم نے ایسا نہ کیا تو ملک میں فتنہ ہوگا اور زبردست فساد ہو جائے گا۔(1)","arabic":"وَٱلَّذِينَ كَفَرُواْ بَعۡضُهُمۡ أَوۡلِيَآءُ بَعۡضٍۚ إِلَّا تَفۡعَلُوهُ تَكُن فِتۡنَةٞ فِي ٱلۡأَرۡضِ وَفَسَادٞ كَبِيرٞ","category":["8 (Al-Anfal)","Al-Anfal","Surah Al-Anfal","Chapter Al-Anfal","Anfal","Surah Anfal","Chapter Anfal","Al Anfal","Surah Al Anfal","Chapter Al Anfal","Surah 8","Chapter 8","The Spoils of War","الأنفَال"],"ayahNumber":1233,"juzNumber":10,"footnotes":"(1) یعنی جس طرح کافر ایک دوسرے کے دوست اور حمایتی ہیں اسی طرح اگر تم بھی ایمان کی بنیاد پر ایک دوسرے کی حمایت اور کافروں سے عدم موالات نہ کی، تو پھر بڑا فتنہ اور فساد ہوگا۔ اور وہ یہ کہ مومن اور کافر کے باہمی اختلاط اور محبت وموالات سےدین کے معاملے میں اشتباہ اور مداہنت پیدا ہوگی۔ بعض نے ”بَعْضُهُمْ أَوْلِيَاءُ بَعْضٍ“ سے، وارث ہونا مراد لیا ہے ۔ یعنی کافر ایک دوسرے کے وارث ہیں۔ اور مطلب یہ ہے کہ ایک مسلمان کسی کافر کا اور کافر کسی مسلمان کا وارث نہیں ہے۔ جیسا کہ احادیث میں اسے وضاحت سے بیان کر دیا گیا ہے۔ اگر تم وراثت میں کفر وایمان کو نظر انداز کرکے محض قرابت کو سامنے رکھو گے تو اس سے بڑا فتنہ اور فساد پیدا ہوگا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-alladhīna kafarū baʿḍuhum awliyāu baʿḍin illā tafʿalūhu takun fit'natun fī al-arḍi wafasādun kabīrun ","translations":["And those who","disbelieve","some of them","(are) allies","(to) another","If not","you do it","(there) will be","oppression","in","the earth","and corruption","great","(73)"],"transliterationArr":["wa-alladhīna","kafarū","baʿḍuhum","awliyāu","baʿḍin","illā","tafʿalūhu","takun","fit'natun","fī","al-arḍi","wafasādun","kabīrun",null],"verseTiming":[[1,0,1370],[2,1370,2320],[3,2320,3450],[4,3450,6120],[5,6120,7230],[6,7230,8010],[7,8010,9370],[8,9370,10650],[9,10650,12520],[10,12520,12810],[11,12810,13640],[12,13640,16000],[13,16000,18655]]}}