{"name":"8:9","price":"اس وقت کو یاد کرو جب کہ تم اپنے رب سے فریاد کررہے تھے، پھر اللہ تعالیٰ نے تمہاری سن لی کہ میں تم کو ایک ہزار فرشتوں سے مدد دوں گا جو لگاتار چلے آئیں گے۔(1)","arabic":"إِذۡ تَسۡتَغِيثُونَ رَبَّكُمۡ فَٱسۡتَجَابَ لَكُمۡ أَنِّي مُمِدُّكُم بِأَلۡفٖ مِّنَ ٱلۡمَلَٰٓئِكَةِ مُرۡدِفِينَ","category":["8 (Al-Anfal)","Al-Anfal","Surah Al-Anfal","Chapter Al-Anfal","Anfal","Surah Anfal","Chapter Anfal","Al Anfal","Surah Al Anfal","Chapter Al Anfal","Surah 8","Chapter 8","The Spoils of War","الأنفَال"],"ayahNumber":1169,"juzNumber":9,"footnotes":"(1) اس جنگ میں مسلمانوں کی تعداد 313 تھی، جب کہ کافر اس سے 3 گنا (یعنی ہزار کے قریب) تھے، پھر مسلمان نہتے اور بے سروسامان تھے جب کہ کافروں کے پاس اسلحے کی بھی فراوانی تھی۔ ان حالات میں مسلمانوں کا سہارا صرف اللہ ہی کی ذات تھی، جس سے وہ گڑگڑا کر مدد کی فریادیں کررہے تھے۔ خود نبی کریم (صلى الله عليه وسلم) الگ ایک خیمے میں نہایت الحاح وزاری سے مصروف دعا تھے۔ (صحیح بخاری ۔ کتاب المغازی) چنانچہ اللہ تعالیٰ نے دعائیں قبول کیں اور ایک ہزار فرشتے ایک دوسرے کے پیچھے مسلسل لگاتار مسلمانوں کی مدد کے لیے آگئے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"idh tastaghīthūna rabbakum fa-is'tajāba lakum annī mumiddukum bi-alfin mina al-malāikati mur'difīna ","translations":["When","you were seeking help","(of) your Lord","and He answered","[to] you","Indeed, I am","going to reinforce you","with a thousand","of","the Angels","one after another","(9)"],"transliterationArr":["idh","tastaghīthūna","rabbakum","fa-is'tajāba","lakum","annī","mumiddukum","bi-alfin","mina","al-malāikati","mur'difīna",null],"verseTiming":[[1,0,530],[2,530,2210],[3,2210,3310],[4,3310,4660],[5,4660,5300],[6,5300,7130],[7,7130,9180],[8,9180,10040],[9,10040,11160],[10,11160,14270],[11,14270,17105]]}}