{"name":"91:14","price":"ان لوگوں نے اپنے پیغمبر کو جھوٹا سمجھ کر اس اونٹنی کی کوچیں کاٹ دیں(1) ، پس ان کے رب نے ان کے گناہوں کے باعث ان پر ہلاکت ڈالی(2) اور پھر ہلاکت کو عام کر دیا اور اس بستی کو برابر کردیا.(3)","arabic":"فَكَذَّبُوهُ فَعَقَرُوهَا فَدَمۡدَمَ عَلَيۡهِمۡ رَبُّهُم بِذَنۢبِهِمۡ فَسَوَّىٰهَا","category":["91 (Ash-Shams)","Ash-Shams","Surah Ash-Shams","Chapter Ash-Shams","Shams","Surah Shams","Chapter Shams","Ash Shams","Surah Ash Shams","Chapter Ash Shams","Surah 91","Chapter 91","The Sun","الشمس"],"ayahNumber":6057,"juzNumber":30,"footnotes":"(1) یہ کام ایک ہی شخص قدار نے کیا تھا۔ لیکن چوں کہ اس شرارت میں قوم بھی اس کے ساتھ تھی اس لئے اس میں سب کو برابر کا مجرم قرار دیا گیا۔ اور تکذیب اور اونٹنی کی کوچیں کاٹنے کی نسبت پوری قوم کی طرف کی گئی۔ جس سے یہ اصول معلوم ہوا کہ ایک برائی کا ارتکاب کرنے والے اگر چند ایک افراد ہوں لیکن پوری قوم اس برائی پر نکیر کرنے کے بجائے اسےپسند کرتی ہو تو اللہ کے ہاں پوری قوم اس برائی کی مرتکب قرار پائے گی اور اس جرم یا برائی میں برابر کی شریک سمجھی جائے گی۔ (2) دَمْدَمَ عَلَيْهِمْ ، ان کو ہلاک کر دیا اور ان پر سخت عذاب نازل کیا۔\n(3) عام کر دیا، یعنی اس عذاب میں سب کو برابر کر دیا، کسی کو نہیں چھوڑا، چھوٹا بڑا، سب کو نیست ونابود کر دیا گیا۔ یا زمین کو ان پر برابر کر دیا یعنی سب کو تہ خاک کر دیا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"fakadhabūhu faʿaqarūhā fadamdama ʿalayhim rabbuhum bidhanbihim fasawwāhā ","translations":["But they denied him","and they hamstrung her","So destroyed","them","their Lord","for their sin","and leveled them","(14)"],"transliterationArr":["fakadhabūhu","faʿaqarūhā","fadamdama","ʿalayhim","rabbuhum","bidhanbihim","fasawwāhā",null],"verseTiming":[[1,0,1480],[2,1480,2980],[3,2980,4080],[4,4080,5080],[5,5080,6790],[6,6790,8680],[7,8680,10555]]}}