{"name":"94:1","price":"کیا ہم نے تیرا سینہ نہیں کھول دیا.(1)","arabic":"أَلَمۡ نَشۡرَحۡ لَكَ صَدۡرَكَ","category":["94 (Ash-Sharh)","Ash-Sharh","Surah Ash-Sharh","Chapter Ash-Sharh","Sharh","Surah Sharh","Chapter Sharh","Ash Sharh","Surah Ash Sharh","Chapter Ash Sharh","Surah 94","Chapter 94","The Relief","الشرح"],"ayahNumber":6091,"juzNumber":30,"footnotes":"(1) گزشتہ سورت میں تین انعامات کا ذکر تھا، اس سورت میں مزید تین احسانات جتلائے جا رہے ہیں۔ سینہ کھول دینا، ان میں پہلا ہے۔ اس کا مطلب ہے سینے کا منور اور فراخ ہو جانا، تاکہ حق واضح بھی ہو جائے اور دل میں سما بھی جائے۔ اسی مفہوم میں قرآن کریم کی یہ آیت فَمَنْ يُرِدِ اللَّهُ أَنْ يَهْدِيَهُ يَشْرَحْ صَدْرَهُ لِلإِسْلامِ (سورة الأنعام: 125 ) ”جس کو اللہ تعالیٰ ہدایت سے نوازنے کا ارادہ کرے۔ اس کا سینہ اسلام کے لئے کھول دیتا ہے“۔ یعنی وہ اسلام کو دین حق کے طور پرپہچان بھی لیتا ہے اور اسے قبول بھی کر لیتا ہے۔ اس شرح صدر میں وہ شق صدر بھی آجاتا ہے جو معتبر روایات کی رو سے دو مرتبہ نبی (صلى الله عليه وسلم) کا کیا گیا۔ ایک مرتبہ بچپن میں، جب کہ آپ (صلى الله عليه وسلم) عمر کے چوتھے سال میں تھے۔ حضرت جبرائیل (عليه السلام) آئے اور انہوں نے آپ (صلى الله عليه وسلم) کا دل چیرا اور اس سے وہ حصہ شیطانی نکال دیا جو ہر انسان کے اندر ہے، پھر اسے دھوکر بند کر دیا، ( صحيح مسلم، كتاب الإيمان، باب الإسراء) دوسری مرتبہ معراج کے موقعے پر۔ اس موقعے پر آپ (صلى الله عليه وسلم) کا سینہ مبارک چاک کرکے دل نکالا گیا، اسے آپ زمزم سے دھوکر اپنی جگہ رکھ دیا گیااور اسےایمان وحکمت سے بھر دیا گیا۔ (صحيحين، أبواب المعراج وكتاب الصلاة) ۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"alam nashraḥ laka ṣadraka ","translations":["Have not","We expanded","for you","your breast","(1)"],"transliterationArr":["alam","nashraḥ","laka","ṣadraka",null],"verseTiming":[[1,0,750],[2,750,1500],[3,1500,1960],[4,1960,3515]]}}