{"name":"96:18","price":"ہم بھی (دوزخ کے) پیادوں کو بلالیں گے.(1)","arabic":"سَنَدۡعُ ٱلزَّبَانِيَةَ","category":["96 (Al-Alaq)","Al-Alaq","Surah Al-Alaq","Chapter Al-Alaq","Alaq","Surah Alaq","Chapter Alaq","Al Alaq","Surah Al Alaq","Chapter Al Alaq","Surah 96","Chapter 96","The Clot","العلق"],"ayahNumber":6124,"juzNumber":30,"footnotes":"(1) حدیث میں آتا ہے کہ نبی (صلى الله عليه وسلم) خانہ کعبہ کے پاس نماز پڑھ رہے تھے۔ ابوجہل گزرا تو کہا اے محمد! (صلى الله عليه وسلم) میں نے تجھے نماز پڑھنے سے منع نہیں کیا تھا؟ اور آپ (صلى الله عليه وسلم) سے سخت دھمکی آمیز باتیں کیں، آپ (صلى الله عليه وسلم) نے کڑا جواب دیا تو کہنے لگا اے محمد! (صلى الله عليه وسلم) تو مجھے کس چیز سے ڈراتا ہے؟ اللہ کی قسم، اس وادی میں سب سے زیادہ میرے حمایتی اور مجلس والے ہیں، جس پر یہ آیت نازل ہوئی۔ حضرت ابن عباس (رضي الله عنه) ما فرماتے ہیں، اگر وہ اپنے حمایتیوں کو بلاتا تو اسی وقت ملائکہ عذاب اسے اسے پکڑ لیتے۔( ترمذی، تفسیر سورۂ اقر﯋ مسند احمد، 1/ 329 وتفسیر ابن جریر) اور صحیح مسلم کے الفاظ ہیں کہ اس نے آگے بڑھ کر آپ (صلى الله عليه وسلم) کی گردن پر پیر رکھنے کا ارادہ کیا کہ ایک دم الٹے پاؤں پیچھے ہٹا اور اپنے ہاتھوں سے اپنا بچاؤ کرنے لگا، اس سے کہا گیا، کیا بات ہے؟ اس نے کہا کہ میرے اور محمد(صلى الله عليه وسلم) کے درمیان آگ کی خندق، ہولناک منظر اور بہت سارے پر ہیں۔ رسول اللہ (صلى الله عليه وسلم) نے فرمایا، اگر یہ میرے قریب ہوتا تو فرشتے اس کی بوٹی بوٹی نوچ لیتے۔ (كتاب صفة القيامة، باب إن الإنسان ليطغى) الزَّبَانِيَة، داروغے اور پولیس۔ یعنی طاقتور لشکر، جس کا کوئی مقابلہ نہیں کر سکتا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"sanadʿu al-zabāniyata ","translations":["We will call","the Angels of Hell","(18)"],"transliterationArr":["sanadʿu","al-zabāniyata",null],"verseTiming":[[1,0,860],[2,860,2875]]}}