{"name":"9:100","price":"اور جو مہاجرین اور انصار سابق اور مقدم ہیں اور جتنے لوگ اخلاص کے ساتھ ان کے پیرو ہیں(1) اللہ ان سب سے راضی ہوا اور وه سب اس سے راضی ہوئے اور اللہ نے ان کے لیے ایسے باغ مہیا کر رکھے ہیں جن کے نیچے نہریں جاری ہوں گی جن میں ہمیشہ رہیں گے(2) یہ بڑی کامیابی ہے۔","arabic":"وَٱلسَّٰبِقُونَ ٱلۡأَوَّلُونَ مِنَ ٱلۡمُهَٰجِرِينَ وَٱلۡأَنصَارِ وَٱلَّذِينَ ٱتَّبَعُوهُم بِإِحۡسَٰنٖ رَّضِيَ ٱللَّهُ عَنۡهُمۡ وَرَضُواْ عَنۡهُ وَأَعَدَّ لَهُمۡ جَنَّٰتٖ تَجۡرِي تَحۡتَهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَآ أَبَدٗاۚ ذَٰلِكَ ٱلۡفَوۡزُ ٱلۡعَظِيمُ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1335,"juzNumber":11,"footnotes":"(1) اس میں تین گروہوں کا ذکر ہے ایک مہاجرین کا جنہوں نے دین کی خاطر، اللہ اور رسول (صلى الله عليه وسلم) کے حکم پر مکہ اور دیگر علاقوں سے ہجرت کی اور سب کچھ چھوڑ چھاڑ کر مدینہ آگئے دوسرا انصار جو مدینہ میں رہائش پذیر تھے انہوں نے ہر موقع پر رسول اللہ (صلى الله عليه وسلم) کی مدد اور حفاظت فرمائی اور مدینہ آنے والے مہاجرین کی خوب پذیرائی اور تواضع کی۔ اور اپنا سب کچھ ان کی خدمت میں پیش کر دیا۔ یہاں ان دو گروہوں کے سابقون الاولون کا ذکر فرمایا ہے، یعنی دونوں گروہوں میں سے وہ افراد جنہوں نے اسلام قبول کرنے میں سب سے پہلے سبقت کی۔ اس کی تعریف میں اختلاف ہے۔ بعض کے نزدیک سابقون الاولون وہ ہیں جنہوں نے دونوں قبلوں کی طرف رخ کرکے نماز پڑھی۔ یعنی تحویل قبلہ سے پہلے مسلمان ہونے والے مہاجرین و انصار۔ بعض کے نزدیک یہ وہ صحابہ (رضي الله عنهم) ہیں جو حدیبیہ میں بیعت رضوان میں حاضر تھے۔ بعض کے نزدیک یہ اہل بدر ہیں۔ امام شوکانی فرماتےہیں کہ یہ سارے ہی مراد ہوسکتے ہیں۔ تیسری قسم وہ ہے جو ان مہاجرین و انصار کے خلوص اور احسان کے ساتھ پیروکار ہیں۔ اس گروہ سے مراد بعض کے نزدیک اصطلاحی تابعین ہیں جنہوں نے نبی (صلى الله عليه وسلم) کو نہیں دیکھا لیکن صحابہ کرام (رضي الله عنهم) کی صحبت سے مشرف ہوئے اور بعض نے اسے عام رکھا یعنی قیامت تک جتنے بھی انصار و مہاجرین سے محبت رکھنے والے اور ان کے نقش قدم پر چلنے والے مسلمان ہیں، وہ اس میں شامل ہیں۔ ان میں اصطلاحی تابعین بھی آجاتے ہیں۔\n(2) اللہ تعالٰی ان سے راضی ہوگیا کا مطلب ہے۔ کہ اللہ تعالٰی نے ان کی نیکیاں قبول فرما لیں، ان کی بشری لغزشوں کو معاف فرما دیا اور وہ ان پر ناراض نہیں۔ کیونکہ اگر ایسا نہ ہوتا تو ان کے لئے جنت کی نعمتوں کی بشارت کیوں دی جاتی؟، جو اس آیت میں دی گئی ہے۔ اس سے یہ بھی معلوم ہوا کہ یہ رضائے الٰہی مؤقت اور عارضی نہیں، بلکہ دائمی ہے اگر رسول اللہ (صلى الله عليه وسلم) کے بعد صحابہ کرام (رضي الله عنهم) کو مرتد ہوجانا تھا (جیسا کہ ایک باطل ٹولے کا عقیدہ ہے) تو اللہ تعالیٰ انہیں جنت کی بشارت سے نہ نوازتا۔ اس سے یہ بھی معلوم ہواکہ جب اللہ نے ان کی ساری لغزشیں معاف فرمادیں تو اب تنقیص و تنقید کے طور پر ان کی کوتاہیوں کا تذکرہ کرنا کسی مسلمان کی شان کے لائق نہیں، نیز یہ بھی معلوم ہوا کہ ان کی محبت اور پیروی رضائے الٰہی کا ذریعہ ہے اور ان سے عداوت اور بغض و عناد رضائے الٰہی سے محرومی کا باعث ہے۔ «فَأَيُّ الْفَرِيقَيْنِ أَحَقُّ بِالْأَمْنِ إِنْ كُنْتُمْ تَعْلَمُونَ»۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wal-sābiqūna al-awalūna mina al-muhājirīna wal-anṣāri wa-alladhīna ittabaʿūhum bi-iḥ'sānin raḍiya al-lahu ʿanhum waraḍū ʿanhu wa-aʿadda lahum jannātin tajrī taḥtahā al-anhāru khālidīna fīhā abadan dhālika al-fawzu al-ʿaẓīmu ","translations":["And the forerunners","the first","among","the emigrants","and the helpers","and those who","followed them","in righteousness","Allah is pleased","Allah is pleased","with them","and they are pleased","with Him","And He has prepared","for them","Gardens","flows","underneath it","the rivers","will abide","in it","forever","That","(is) the success","the great","(100)"],"transliterationArr":["wal-sābiqūna","al-awalūna","mina","al-muhājirīna","wal-anṣāri","wa-alladhīna","ittabaʿūhum","bi-iḥ'sānin","raḍiya","al-lahu","ʿanhum","waraḍū","ʿanhu","wa-aʿadda","lahum","jannātin","tajrī","taḥtahā","al-anhāru","khālidīna","fīhā","abadan","dhālika","al-fawzu","al-ʿaẓīmu",null],"verseTiming":[[1,0,1810],[2,1810,3530],[3,3530,3840],[4,3840,5890],[5,5890,8180],[6,8180,9470],[7,9470,11720],[8,11720,13000],[9,13000,13980],[10,13980,14940],[11,14940,15940],[12,15940,16750],[13,16750,17750],[14,17750,18830],[15,18830,19720],[16,19720,20730],[17,20730,21520],[18,21520,22340],[19,22340,23460],[20,23460,24090],[21,24090,25840],[22,25840,28360],[23,28360,30160],[24,30160,30780],[25,30780,33060],[26,33060,34720],[27,34720,35610],[28,35610,36990],[29,36990,38360],[30,38360,40620],[31,40620,41600],[32,41600,42990],[33,42990,43910],[34,43910,47155]]}}