{"name":"9:108","price":"آپ اس میں کبھی کھڑے نہ ہوں(1) ۔ البتہ جس مسجد کی بنیاد اول دن سے تقویٰ پر رکھی گئی ہے وه اس ﻻئق ہے کہ آپ اس میں کھڑے ہوں(2)، اس میں ایسے آدمی ہیں کہ وه خوب پاک ہونے کو پسند کرتے ہیں(3)، اور اللہ تعالیٰ خوب پاک ہونے والوں کو پسند کرتا ہے۔","arabic":"لَا تَقُمۡ فِيهِ أَبَدٗاۚ لَّمَسۡجِدٌ أُسِّسَ عَلَى ٱلتَّقۡوَىٰ مِنۡ أَوَّلِ يَوۡمٍ أَحَقُّ أَن تَقُومَ فِيهِۚ فِيهِ رِجَالٞ يُحِبُّونَ أَن يَتَطَهَّرُواْۚ وَٱللَّهُ يُحِبُّ ٱلۡمُطَّهِّرِينَ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1343,"juzNumber":11,"footnotes":"(1) یعنی آپ (صلى الله عليه وسلم) نے وہاں جاکر نماز پڑھنے کا جو وعدہ فرمایا، اس کے مطابق وہاں جاکر نماز نہ پڑھیں چنانچہ آپ (صلى الله عليه وسلم) نہ صرف یہ کہ وہاں نماز نہیں پڑھی بلکہ اپنے چند ساتھیوں کو بھیج کر مسجد گرا دی اور اسے ختم کر دیا اس سے علماء نے استدلال کیا ہے کہ جو مسجد اللہ کی عبادت کی بجائے، مسلمانوں کے درمیان تفریق پیدا کرنے کی غرض سے بنائی جائے، وہ مسجد ضرار ہے، اس کو ڈھا دیا جائے تاکہ مسلمانوں میں تفریق و انتشار پیدا نہ ہو۔\n(2) اس سے مراد کونسی مسجد ہے؟ اس میں اختلاف بعض نے اسے مسجد قبا اور بعض نے مسجد نبوی (صلى الله عليه وسلم) قرار دیا ہے، سلف کی ایک جماعت دونوں کی قائل رہی ہے۔ امام ابن کثیر فرماتے ہیں کہ آیت سے اگر مسجد قبا مراد ہے تو بعض احادیث میں مسجد نبوی کو «أُسِّسَ عَلَى التَّقْوَى» کا مصداق قرار دیا گیا ہے ان دونوں کے درمیان کوئی منافات نہیں۔ اس لئے کہ اگر مسجد قبا کے اندر یہ صفت پائی جاتی ہے کہ اول یوم سے ہی اس کی بنیاد تقوٰی پر رکھی گئی ہے تو مسجد نبوی تو بطریق اولی اس صفت کی حال اور اس کی مصداق ہے۔`\n(3) حدیث میں آتا ہے کہ اس سے مراد اہل قبا ہیں۔ نبی (صلى الله عليه وسلم) نے ان سے پوچھا کہ اللہ تعالٰی نے تمہاری طہارت کی تعریف فرمائی ہے، تم کیا کرتے ہو؟ انہوں نے کہا ہم ڈھیلے استعمال کرنے کے ساتھ ساتھ پانی بھی استعمال کرتے ہیں۔ (بحوالہ ابن کثیر) امام ابن کثیر فرماتے ہیں کہ یہ آیت اس بات کی دلیل ہے کہ ایسی قدیم مسجد میں نماز پڑھنا مستحب ہے جو اللہ وحدہ لا شریک کی عبادت کی غرض سے تعمیر کی گئی ہوں، نیز صالحین کی جماعت اور ایسے لوگوں کے ساتھ نماز پڑھنا مستحب ہے جو مکمل وضو کرنے اور طہارت و پاکیزگی کا صحیح صحیح اہتمام کرنے والے ہوں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"lā taqum fīhi abadan lamasjidun ussisa ʿalā al-taqwā min awwali yawmin aḥaqqu an taqūma fīhi fīhi rijālun yuḥibbūna an yataṭahharū wal-lahu yuḥibbu al-muṭahirīna ","translations":["(Do) not","stand","in it","ever","A masjid","founded","on","the righteousness","from","(the) first","day","(is) more worthy","that","you stand","in it","Within it","(are) men","who love","to","purify themselves","and Allah","loves","the ones who purify themselves","(108)"],"transliterationArr":["lā","taqum","fīhi","abadan","lamasjidun","ussisa","ʿalā","al-taqwā","min","awwali","yawmin","aḥaqqu","an","taqūma","fīhi","fīhi","rijālun","yuḥibbūna","an","yataṭahharū","wal-lahu","yuḥibbu","al-muṭahirīna",null],"verseTiming":[[1,0,500],[2,500,1220],[3,1220,1970],[4,1970,2970],[5,2970,4750],[6,4750,5730],[7,5730,6110],[8,6110,7320],[9,7320,7780],[10,7780,8690],[11,8690,9510],[12,9510,10470],[13,10470,11480],[14,11480,12430],[15,12430,14860],[16,14860,15590],[17,15590,16590],[18,16590,18480],[19,18480,18780],[20,18780,21250],[21,21250,22700],[22,22700,23600],[23,23600,27405]]}}