{"name":"9:107","price":"اور بعض ایسے ہیں جنہوں نے ان اغراض کے لیے مسجد بنائی ہے کہ ضرر پہنچائیں اور کفر کی باتیں کریں اور ایمانداروں میں تفریق ڈالیں اور اس شخص کے قیام کا سامان کریں جو اس سے پہلے سے اللہ اور رسول کا مخالف ہے(1) ، اور قسمیں کھا جائیں گے کہ بجز بھلائی کے اور ہماری کچھ نیت نہیں، اور اللہ گواه ہے کہ وه بالکل جھوٹے ہیں۔(2)","arabic":"وَٱلَّذِينَ ٱتَّخَذُواْ مَسۡجِدٗا ضِرَارٗا وَكُفۡرٗا وَتَفۡرِيقَۢا بَيۡنَ ٱلۡمُؤۡمِنِينَ وَإِرۡصَادٗا لِّمَنۡ حَارَبَ ٱللَّهَ وَرَسُولَهُۥ مِن قَبۡلُۚ وَلَيَحۡلِفُنَّ إِنۡ أَرَدۡنَآ إِلَّا ٱلۡحُسۡنَىٰۖ وَٱللَّهُ يَشۡهَدُ إِنَّهُمۡ لَكَٰذِبُونَ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1342,"juzNumber":11,"footnotes":"(1) اس میں منافقین کی ایک اور نہایت قبیح حرکت کا بیان ہے کہ انہوں نے ایک مسجد بنائی۔ اور نبی (صلى الله عليه وسلم) کو باور کرایا کہ، بارش، سردی اور اس قسم کے موقع پر بیماروں اور کمزوروں کو زیادہ دور جانے میں دقت پیش آتی ہے ان کی سہولت کے لئے ہم نے یہ مسجد بنائی ہے۔ آپ (صلى الله عليه وسلم) وہاں چل کر نماز پڑھیں تاکہ ہمیں برکت حاصل ہو۔ آپ (صلى الله عليه وسلم) اس وقت تبوک کے لئے پایہ رکاب تھے، آپ (صلى الله عليه وسلم) نے واپسی پر نماز پڑھنے کا وعدہ فرمایا۔ لیکن واپسی پر وحی کے ذریعے سے اللہ تعالٰی نے منافقین کے اصل مقاصد کو بے نقاب کر دیا کہ اس سے وہ مسلمانوں کو نقصان پہنچانا، کفر پھیلانا مسلمانوں کے درمیان تفرقہ پیدا کرنا اور اللہ اور اللہ کے رسول (صلى الله عليه وسلم) کے دشمنوں کے لئے کمین گاہ مہیا کرنا چاہتے ہیں۔\n(2) یعنی جھوٹی قسمیں کھا کر وہ نبی کو فریب دینا چاہتے تھے لیکن اللہ تعالٰی آپ (صلى الله عليه وسلم) کو ان کے مکرو فریب سے بچا لیا اور فرمایا کہ ان کی نیت صحیح نہیں اور یہ جو کچھ ظاہر کر رہے ہیں، اس میں جھوٹے ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-alladhīna ittakhadhū masjidan ḍirāran wakuf'ran watafrīqan bayna al-mu'minīna wa-ir'ṣādan liman ḥāraba al-laha warasūlahu min qablu walayaḥlifunna in aradnā illā al-ḥus'nā wal-lahu yashhadu innahum lakādhibūna ","translations":["And those who","take","a masjid","(for causing) harm","and (for) disbelief","and (for) division","among","the believers","and (as) a station","for whoever","warred","(against) Allah","and His Messenger","before","before","And surely they will swear","Not","we wish","except","the good","But Allah","bears witness","indeed, they","(are) surely liars","(107)"],"transliterationArr":["wa-alladhīna","ittakhadhū","masjidan","ḍirāran","wakuf'ran","watafrīqan","bayna","al-mu'minīna","wa-ir'ṣādan","liman","ḥāraba","al-laha","warasūlahu","min","qablu","walayaḥlifunna","in","aradnā","illā","al-ḥus'nā","wal-lahu","yashhadu","innahum","lakādhibūna",null],"verseTiming":[[1,0,1250],[2,1250,2460],[3,2460,4210],[4,4210,5880],[5,5880,7460],[6,7460,9560],[7,9560,10200],[8,10200,13850],[9,13850,16340],[10,16340,16980],[11,16980,18690],[12,18690,19990],[13,19990,20870],[14,20870,21750],[15,21750,22740],[16,22740,24270],[17,24270,25770],[18,25770,26610],[19,26610,29260],[20,29260,29730],[21,29730,32280],[22,32280,32970],[23,32970,34240],[24,34240,35750],[25,35750,36650],[26,36650,38540],[27,38540,41715]]}}