{"name":"9:118","price":"اور تین شخصوں کے حال پر بھی جن کا معاملہ ملتوی چھوڑ دیا گیا تھا(1) ۔ یہاں تک کہ جب زمین باوجود اپنی فراخی کے ان پر تنگ ہونے لگی اور وه خود اپنی جان سے تنگ آگئے(2) اور انہوں نے سمجھ لیا کہ اللہ سے کہیں پناه نہیں مل سکتی بجز اس کے کہ اسی کی طرف رجوع کیا جائے پھر ان کے حال پر توجہ فرمائی تاکہ وه آئنده بھی توبہ کرسکیں(3)۔ بیشک اللہ تعالیٰ بہت توبہ قبول کرنے واﻻ بڑا رحم واﻻ ہے۔","arabic":"وَعَلَى ٱلثَّلَٰثَةِ ٱلَّذِينَ خُلِّفُواْ حَتَّىٰٓ إِذَا ضَاقَتۡ عَلَيۡهِمُ ٱلۡأَرۡضُ بِمَا رَحُبَتۡ وَضَاقَتۡ عَلَيۡهِمۡ أَنفُسُهُمۡ وَظَنُّوٓاْ أَن لَّا مَلۡجَأَ مِنَ ٱللَّهِ إِلَّآ إِلَيۡهِ ثُمَّ تَابَ عَلَيۡهِمۡ لِيَتُوبُوٓاْۚ إِنَّ ٱللَّهَ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1353,"juzNumber":11,"footnotes":"(1) خُلِّفُوا کا وہی مطلب ہے جو مُرْجَوْنَ کا ہے یعنی جن کا معاملہ مؤخر اور ملتوی کر دیا گیا تھا اور پچاس دن کے بعد ان کی توبہ قبول ہوئی۔ یہ تین صحابہ تھے۔ کعب بن مالک، مرارہ بن ربیع اور ہلال بن امیہ (رضي الله عنهم) یہ تینوں نہایت مخلص مسلمان تھے۔ اس سے قبل ہر غزوے میں شریک ہوتے رہے۔ اس غزوہ تبوک میں صرف تساہلاً شریک نہیں ہوئے بعد میں انہیں اپنی غلطی کا احساس ہوا، تو سوچا کہ ایک غلطی (پیچھے رہنے کی) تو ہو ہی گئی ہے۔ لیکن اب منافقین کی طرح رسول اللہ (صلى الله عليه وسلم) کی خدمت میں جھوٹا عذر پیش کرنے کی غلطی نہیں کریں گے۔ چنانچہ حاضر خدمت ہو کر اپنی غلطی کا صاف اعتراف کر لیا اور اس کی سزا کے لئے اپنے آپ کو پیش کر دیا۔ نبی (صلى الله عليه وسلم) نے انکے معاملے کو اللہ تعالٰی کے سپرد کر دیا کہ وہ ان کے بارے میں کوئی حکم نازل فرمائے گا تاہم اس دوران صحابہ کرام (رضي الله عنهم) کو ان تینوں افراد سے تعلق قائم رکھنے حتٰی کے بات چیت تک کرنے سے روک دیا اور چالیس راتوں کے بعد انہیں حکم دیا گیا کہ وہ اپنی بیویوں سے بھی دور رہیں مزید دس دن گزرے تو توبہ قبول کر لی گئی اور مذکورہ آیت نازل ہوئی (اس واقعہ کی پوری تفصیل حضرت کعب بن مالک رضي الله عنه سے مروی حدیث میں موجود ہے)۔ ملاحظہ ہو ،(صحیح بخاری، کتاب المغازی باب غزوة تبوک۔ مسلم کتاب التوبة، باب حدیث توبة کعب بن مالک)\n(2) یہ ان ایام کی کیفیت کا بیان ہے۔ جس سے سوشل بائیکاٹ کی وجہ سے انہیں گزرنا پڑا۔\n(3) یعنی پچاس دن کے بعد اللہ نے ان کی آہ و زاری اور توبہ قبول فرمائی۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"waʿalā al-thalāthati alladhīna khullifū ḥattā idhā ḍāqat ʿalayhimu al-arḍu bimā raḥubat waḍāqat ʿalayhim anfusuhum waẓannū an lā malja-a mina al-lahi illā ilayhi thumma tāba ʿalayhim liyatūbū inna al-laha huwa al-tawābu al-raḥīmu ","translations":["And on","the three","(of) those who","were left behind","until","when","(was) straitened","for them","the earth","though","it was vast","And (was) straitened","for them","their own souls","and they were certain","that","(there is) no","refuge","from","Allah","except","to Him","Then","He turned (in mercy)","to them","that they may repent","Indeed","Allah","He","(is) the Acceptor of repentance","the Most Merciful","(118)"],"transliterationArr":["waʿalā","al-thalāthati","alladhīna","khullifū","ḥattā","idhā","ḍāqat","ʿalayhimu","al-arḍu","bimā","raḥubat","waḍāqat","ʿalayhim","anfusuhum","waẓannū","an","lā","malja-a","mina","al-lahi","illā","ilayhi","thumma","tāba","ʿalayhim","liyatūbū","inna","al-laha","huwa","al-tawābu","al-raḥīmu",null],"verseTiming":[[1,0,660],[2,660,2030],[3,2030,3110],[4,3110,4180],[5,4180,7170],[6,7170,7810],[7,7810,8760],[8,8760,9880],[9,9880,10830],[10,10830,11480],[11,11480,12340],[12,12340,13450],[13,13450,14590],[14,14590,16620],[15,16620,18470],[16,18470,21050],[17,21050,22330],[18,22330,22530],[19,22530,23240],[20,23240,24140],[21,24140,24490],[22,24490,25460],[23,25460,27650],[24,27650,28600],[25,28600,29790],[26,29790,30520],[27,30520,31700],[28,31700,33220],[29,33220,35110],[30,35110,36110],[31,36110,36450],[32,36450,37890],[33,37890,40605]]}}