{"name":"9:113","price":"پیغمبر کو اور دوسرے مسلمانوں کو جائز نہیں کہ مشرکین کے لیے مغفرت کی دعا مانگیں اگرچہ وه رشتہدار ہی ہوں اس امر کے ﻇاہر ہوجانے کے بعد کہ یہ لوگ دوزخی ہیں۔(1)","arabic":"مَا كَانَ لِلنَّبِيِّ وَٱلَّذِينَ ءَامَنُوٓاْ أَن يَسۡتَغۡفِرُواْ لِلۡمُشۡرِكِينَ وَلَوۡ كَانُوٓاْ أُوْلِي قُرۡبَىٰ مِنۢ بَعۡدِ مَا تَبَيَّنَ لَهُمۡ أَنَّهُمۡ أَصۡحَٰبُ ٱلۡجَحِيمِ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1348,"juzNumber":11,"footnotes":"(1) اس کی تفسیر صحیح بخاری میں اس طرح ہے کہ جب نبی (صلى الله عليه وسلم) کے عم بزرگوار ابو طالب کا آخری وقت آیا تو نبی (صلى الله عليه وسلم) ان کے پاس گئے جبکہ ان کے پاس ابو جہل اور عبد اللہ بن ابی امیہ بھی بیٹھے ہوئے تھے آپ (صلى الله عليه وسلم) نے فرمایا چچا جان ”لاَ إِلَهَ إِلاَّ اللَّهُ پڑھ لیں، تاکہ میں اللہ کے ہاں آپ کے لئے حجت پیش کر سکوں، ابو جہل اور عبد اللہ بن ابی امیہ نے کہا 'اے ابو طالب کیا عبدالمطلب کے مذہب سے انحراف کرو گے؟ (یعنی مرتے وقت یہ کیا کرنے لگے ہو؟ حتٰی کہ اسی حال میں ان کا انتقال ہوگیا) نبی (صلى الله عليه وسلم) نے فرمایا: ”جب تک اللہ تعالٰی کی طرف سے مجھے روک نہیں دیا جائے گا میں آپ کے لئے استغفار کرتا رہوں گا“، جس پر یہ آیت نازل ہوئی جس میں مشرکین کے لئے مغفرت کی دعا کرنے سے روک دیا گیا ہے (صحیح بخاری، کتاب التفسیر، سورة التوبة) اور سورہ قصص کی آیت 56 «إِنَّكَ لاَ تَهْدِي مَنْ أَحْبَبْتَ» بھی اسی سلسلے میں نازل ہوئی۔ مسند احمد کی ایک روایت میں ہے کہ نبی (صلى الله عليه وسلم )نے اپنی والدہ کے لیے مغفرت کی دعا کرنے کی اجازت طلب فرمائی، جس پر یہ آیت نازل ہوئی (مسند احمد ج ۵، ص ۳۵۵) اور نبی (صلى الله عليه وسلم) نے اپنی مشرک قوم کے لیے جو دعا فرمائی تھی «اللَّهُمَّ اغْفِرْ لِقَوْمِي فَإِنَّهُمْ لاَ يَعْلَمُونَ»۔ ”یا اللہ میری قوم بےعلم ہے اس کی مغفرت فرما دے“، یہ آیت کے منافی نہیں ہے۔ اس لیے کہ اس کامطلب ان کے لیے ہدایت کی دعا ہے۔ یعنی وہ میرے مقام و مرتبہ سے ناآشنا ہے، اسے ہدایت سے نواز دے تاکہ وہ مغفرت کی اہل ہوجائے۔ اور زندہ کفار ومشرکین کے لیے ہدایت کی دعا کرنی جائز ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"mā kāna lilnnabiyyi wa-alladhīna āmanū an yastaghfirū lil'mush'rikīna walaw kānū ulī qur'bā min baʿdi mā tabayyana lahum annahum aṣḥābu al-jaḥīmi ","translations":["Not","(it) is","for the Prophet","and those who","believe","that","they ask forgiveness","for the polytheists","even though","they be","near of kin","near of kin","after","after","[what]","has become clear","to them","that they","(are the) companions","(of) the Hellfire","(113)"],"transliterationArr":["mā","kāna","lilnnabiyyi","wa-alladhīna","āmanū","an","yastaghfirū","lil'mush'rikīna","walaw","kānū","ulī","qur'bā","min","baʿdi","mā","tabayyana","lahum","annahum","aṣḥābu","al-jaḥīmi",null],"verseTiming":[[1,0,450],[2,450,1080],[3,1080,3030],[4,3030,4220],[5,4220,6509],[6,6509,7389],[7,7389,9109],[8,9109,10889],[9,10889,11469],[10,11469,12509],[11,12509,13539],[12,13539,15809],[13,15809,16389],[14,16389,17379],[15,17379,18439],[16,18439,19129],[17,19129,19539],[18,19539,20739],[19,20739,21399],[20,21399,23609],[21,23609,24709],[22,24709,27864]]}}