{"name":"9:112","price":"وه ایسے ہیں جو توبہ کرنے والے، عبادت کرنے والے، حمد کرنے والے، روزه رکھنے والے، (یا راه حق میں سفر کرنے والے) رکوع اور سجده کرنے والے، نیک باتوں کی تعلیم کرنے والے اور بری باتوں سے باز رکھنے والے اور اللہ کی حدوں کا خیال رکھنے والے ہیں(1) اور ایسے مومنین کو آپ خوشخبری سنا دیجئے؟(2)","arabic":"ٱلتَّٰٓئِبُونَ ٱلۡعَٰبِدُونَ ٱلۡحَٰمِدُونَ ٱلسَّٰٓئِحُونَ ٱلرَّٰكِعُونَ ٱلسَّٰجِدُونَ ٱلۡأٓمِرُونَ بِٱلۡمَعۡرُوفِ وَٱلنَّاهُونَ عَنِ ٱلۡمُنكَرِ وَٱلۡحَٰفِظُونَ لِحُدُودِ ٱللَّهِۗ وَبَشِّرِ ٱلۡمُؤۡمِنِينَ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1347,"juzNumber":11,"footnotes":"(1) یہ انہیں مومنین کی مزید صفات بیان کی جا رہی ہیں جن کی جانوں اور مالوں کا سودا اللہ نے کر لیا ہے، وہ توبہ کرنے والے، یعنی گناہوں اور فواحش سے بچتے اور اپنے رب کی عبادت کرنے والے، زبان سے اللہ کی حمد اور ثنا بیان کرنے والے اور دیگر ان صفات کے حامل ہیں جو آیت میں مذکور ہیں۔ سیاحت سے مراد اکثر مفسرین نے روزے لیے ہیں اور اسی کو ابن کثیر نے صحیح ترین اور مشہور ترین قول قرار دیا ہے۔ اور بعض نے اس سے جہاد مراد لیا ہے۔ تاہم سیاحت سے زمین کی سیاحت مراد نہیں ہے جس طرح کہ بعض لوگوں نے سمجھا ہے۔ اسی طرح اللہ کی عبادت کے لیے پہاڑوں کی چوٹیوں غاروں اور سنسان بیابانوں میں جاکر ڈیرے لگا لینا بھی اس سے مراد نہیں ہے۔ کیونکہ یہ رہبانیت اور جوگی پن کا ایک حصہ ہے جو اسلام میں نہیں ہے۔ البتہ فتنوں کے ایام میں اپنے دین کو بچانے کے لیے شہروں اور آبادیوں کو چھوڑ کر جنگلوں اور بیابانوں میں جاکر رہنے کی اجازت حدیث میں دی گئی ہے۔ (صحیح بخاری۔ کتاب الایمان، باب من الدین الفرار من الفتن و کتاب الفتن باب التعرب۔ ای السکنی مع الاعراب۔ فی الفتنة)\n(2) مطلب یہ ہے کہ مومن کامل وہ ہے جو قول اور عمل اسلام کی تعلیمات کا عمدہ نمونہ ہو اور ان چیزوں سے بچنے والا ہو جن سے اللہ نے اسے روک دیا ہے اور یوں اللہ کی حدوں کو پامال نہیں، بلکہ ان کی حفاظت کرنے والا ہو۔ ایسے ہی کامل مومن خوشخبری کے مستحق ہیں یہ وہ بات ہے جسے قرآن میں «اٰ مَنُوْا وَعَمِلُوا الصّٰلِحٰتِ» کے الفاظ میں بار بار بیان کیا گیا ہے۔ یہاں اعمال صالحہ کی قدرے تفصیل بیان کر دی گئی ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"al-tāibūna al-ʿābidūna al-ḥāmidūna al-sāiḥūna al-rākiʿūna al-sājidūna al-āmirūna bil-maʿrūfi wal-nāhūna ʿani al-munkari wal-ḥāfiẓūna liḥudūdi al-lahi wabashiri al-mu'minīna ","translations":["Those who turn in repentance","those who worship","those who praise","those who go out","those who bow down","those who prostrate","those who enjoin","the right","and those who forbid","[on]","the wrong","and those who observe","(the) limits","(of) Allah","And give glad tidings","(to) the believers","(112)"],"transliterationArr":["al-tāibūna","al-ʿābidūna","al-ḥāmidūna","al-sāiḥūna","al-rākiʿūna","al-sājidūna","al-āmirūna","bil-maʿrūfi","wal-nāhūna","ʿani","al-munkari","wal-ḥāfiẓūna","liḥudūdi","al-lahi","wabashiri","al-mu'minīna",null],"verseTiming":[[1,0,3320],[2,3320,4920],[3,4920,6480],[4,6480,9630],[5,9630,11230],[6,11230,12830],[7,12830,14430],[8,14430,15980],[9,15980,18100],[10,18100,18610],[11,18610,20520],[12,20520,22320],[13,22320,23430],[14,23430,23870],[15,23870,27650],[16,27650,31475]]}}