{"name":"9:128","price":"تمہارے پاس ایک ایسے پیغمبر تشریف ﻻئے ہیں جو تمہاری جنس سے ہیں(1) جن کو تمہاری مضرت کی بات نہایت گراں گزرتی ہے(2) جو تمہاری منفعت کے بڑے خواہش مند رہتے ہیں(3) ایمان والوں کے ساتھ بڑے ہی شفیق اور مہربان ہیں۔(4)","arabic":"لَقَدۡ جَآءَكُمۡ رَسُولٞ مِّنۡ أَنفُسِكُمۡ عَزِيزٌ عَلَيۡهِ مَا عَنِتُّمۡ حَرِيصٌ عَلَيۡكُم بِٱلۡمُؤۡمِنِينَ رَءُوفٞ رَّحِيمٞ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1363,"juzNumber":11,"footnotes":"(1) سورت کے آخر میں مسلمانوں پر نبی کی صورت میں جو احسان عظیم فرمایا گیا، اس کا ذکر کیا جا رہا ہے۔ آپ (صلى الله عليه وسلم) کی پہلی صفت یہ بیان فرمائی کہ وہ تمہاری جنس سے یعنی جنس بشریت سے ہیں (وہ نور یا اور کچھ نہیں) جیسا کہ فساد عقیدہ کے شکار لوگ عوام کو اس قسم کے گورکھ دھندے میں پھنساتے ہیں۔\n(2) عَنَتٌ ایسی چیزیں جن سے انسان کو تکلیف ہو، اس میں دنیاوی مشقتیں اور آخروی عذاب دونوں آجاتے ہیں، اس پیغمبر پر، تمہاری ہر قسم کی تکلیف و مشقت گراں گزرتی ہے۔ اسی لئے آپ (صلى الله عليه وسلم) نے فرما: ”میں آسان دین حنیفی دے کر بھیجا گیا ہوں“۔ (مسند احمد۔ جلد 5، ص 266، جلد 6 ص 233) ایک اور حدیث میں فرمایا: «إِنَّ هَذَا الدِّينَ يُسْرٌ»، ”بیشک یہ دین آسان ہے“۔ (صحیح بخاری۔ کتاب الایمان)\n(3) تمہاری ہدایت اور تمہاری دینوی آخروی کے فائدے کے خواہشمند ہیں اور تمہارا جہنم میں جانا پسند نہیں فرماتے۔ اسی لئے آپ (صلى الله عليه وسلم) نے فرمایا کہ ”میں تمہیں تمہاری پشتوں سے پکڑ پکڑ کر کھنچتا ہوں لیکن تم مجھ سے دامن چھڑا کر زبردستی نار جہنم میں داخل ہوتے ہو“۔ (صحیح بخاری کتاب الرقاق باب نمبر 26 الانتهاء من المعاصی)\n(4) یہ آپ کی چوتھی صفت بیان کی گئی ہے۔ یہ ساری خوبیاں آپ کے اعلٰی اخلاق اور کریمانہ صفات کی مظہر ہیں۔ یقینا آپ (صلى الله عليه وسلم) صاحب خلق عظیم ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"laqad jāakum rasūlun min anfusikum ʿazīzun ʿalayhi mā ʿanittum ḥarīṣun ʿalaykum bil-mu'minīna raūfun raḥīmun ","translations":["Certainly","(has) come to you","a Messenger","from","yourselves","Grievous","to him","(is) what","you suffer","(he is) concerned","over you","to the believers","(he is) kind","(and) merciful","(128)"],"transliterationArr":["laqad","jāakum","rasūlun","min","anfusikum","ʿazīzun","ʿalayhi","mā","ʿanittum","ḥarīṣun","ʿalaykum","bil-mu'minīna","raūfun","raḥīmun",null],"verseTiming":[[1,0,720],[2,720,3230],[3,3230,4390],[4,4390,5570],[5,5570,7740],[6,7740,8890],[7,8890,9900],[8,9900,10280],[9,10280,11380],[10,11380,12500],[11,12500,14160],[12,14160,15180],[13,15180,16390],[14,16390,17580],[15,17580,19300],[16,19300,20100],[17,20100,23135]]}}