{"name":"9:122","price":"اور مسلمانوں کو یہ نہ چاہئے کہ سب کے سب نکل کھڑے ہوں سو ایسا کیوں نہ کیا جائے کہ ان کی ہر بڑی جماعت میں سے ایک چھوٹی جماعت جایا کرے تاکہ وه دین کی سمجھ بوجھ حاصل کریں اور تاکہ یہ لوگ اپنی قوم کو جب کہ وه ان کے پاس آئیں، ڈرائیں تاکہ وه ڈر جائیں۔(1)","arabic":"۞ وَمَا كَانَ ٱلۡمُؤۡمِنُونَ لِيَنفِرُواْ كَآفَّةٗۚ فَلَوۡلَا نَفَرَ مِن كُلِّ فِرۡقَةٖ مِّنۡهُمۡ طَآئِفَةٞ لِّيَتَفَقَّهُواْ فِي ٱلدِّينِ وَلِيُنذِرُواْ قَوۡمَهُمۡ إِذَا رَجَعُوٓاْ إِلَيۡهِمۡ لَعَلَّهُمۡ يَحۡذَرُونَ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1357,"juzNumber":11,"footnotes":"(1) بعض مفسرین کے نزدیک اس کا تعلق بھی حکم جہاد سے ہے۔ اور مطلب یہ کہ پچھلی آیت میں جب پیچھے رہنے والوں کے لئے سخت وعید اور لعنت ملامت بیان کی گئی تو صحابہ کرام (رضي الله عنهم) بڑے محتاط ہوگئے اور جب بھی جہاد کا مرحلہ آتا تو سب کے سب اس میں شریک ہونے کی کوشش کرتے۔ آیت میں انہیں حکم دیا گیا ہر جہاد اس نوعیت کا نہیں ہوتا کہ جس میں ہر شخص کی شرکت ضروری ہو (جیسا کہ تبوک میں ضروری تھا) بلکہ گروہ کی ہی شرکت کافی ہے۔ ان کے نزدیک ”لِيَتَفَقَّهُوا“ کا مخاطب پیچھے رہ جانے ولاا طائفہ ہے۔ یعنی ایک گروہ جہاد پر چلا جائے ”وَتَبْقَى طَائِفَةٌ“ (یہ مخذوف ہوگا) اور ایک گروہ پیچھے رہے، جو دین کا علم حاصل کرے۔ اور جب مجاہدین واپس آئیں تو انہیں بھی احکام دین سے آگاہ کر کے انہیں ڈرائیں۔ دوسری تفسیر اس کی یہ ہے کہ اس آیت کا تعلق جہاد سے نہیں ہے بلکہ اس میں علم دین سیکھنے کی اہمیت کا بیان، اس کی ترغیب اور طریقے کی وضاحت ہے اور وہ یہ کہ ہر بڑی جماعت یا قبیلے میں سےکچھ لوگ دین کا کا علم حاصل کرنے کے لیے اپنا گھربار چھوڑیں اور مدارس ومراکز علم میں جا کر اسے حاصل کریں اور پھر آکر اپنی قوم میں وعظ ونصیحت کریں۔ دین میں تفقہ حاصل کرنے کا مطلب اوامرونواہی کا علم حاصل کرنا ہے تاکہ اوامر الہی کو بجا لاسکے اور نواہی سے دامن کشاں رہے اور اپنی قوم کے اندر بھی امر بالمعروف ونہی عن المنکر کا فریضہ سر انجام دے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wamā kāna al-mu'minūna liyanfirū kāffatan falawlā nafara min kulli fir'qatin min'hum ṭāifatun liyatafaqqahū fī al-dīni waliyundhirū qawmahum idhā rajaʿū ilayhim laʿallahum yaḥdharūna ","translations":["And not","is","(for) the believers","that they go forth","all together","So if not","go forth","from","every","group","among them","a party","that they may obtain understanding","in","the religion","and that they may warn","their people","when","they return","to them","so that they may","beware","(122)"],"transliterationArr":["wamā","kāna","al-mu'minūna","liyanfirū","kāffatan","falawlā","nafara","min","kulli","fir'qatin","min'hum","ṭāifatun","liyatafaqqahū","fī","al-dīni","waliyundhirū","qawmahum","idhā","rajaʿū","ilayhim","laʿallahum","yaḥdharūna",null],"verseTiming":[[1,0,620],[2,620,1270],[3,1270,2920],[4,2920,5020],[5,5020,8099],[6,8099,10319],[7,10319,10989],[8,10989,12099],[9,12099,12719],[10,12719,13759],[11,13759,15489],[12,15489,18159],[13,18159,19989],[14,19989,20259],[15,20259,22879],[16,22879,24469],[17,24469,24729],[18,24729,25589],[19,25589,27669],[20,27669,28769],[21,28769,29439],[22,29439,31579],[23,31579,32609],[24,32609,33999],[25,33999,37064]]}}