{"name":"9:125","price":"اور جن کے دلوں میں روگ ہے اس سورت نے ان میں ان کی گندگی کے ساتھ اور گندگی بڑھا دی اور وه حالت کفر ہی میں مر گئے۔(1)","arabic":"وَأَمَّا ٱلَّذِينَ فِي قُلُوبِهِم مَّرَضٞ فَزَادَتۡهُمۡ رِجۡسًا إِلَىٰ رِجۡسِهِمۡ وَمَاتُواْ وَهُمۡ كَٰفِرُونَ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1360,"juzNumber":11,"footnotes":"(1) روگ سے مراد نفاق اور آیات الٰہی کے بارے میں شکوک و شبہات ہیں۔ فرمایا: البتہ یہ سورت منافقین کو ان کے نفاق اور خبث میں اور بڑھاتی اور وہ اپنے کفر و نفاق میں اس طرح پختہ تر ہو جاتے ہیں کہ انہیں توبہ کی توفیق نصیب نہیں ہوتی اور کفر پر ہی ان کا خاتمہ ہوتا ہے جس طرح اللہ تعالٰی نے دوسرے مقام پر فرمایا :”ہم قرآن میں ایسی چیزیں نازل کرتے ہیں جو مومنین کے لئے شفا اور رحمت ہیں۔ لیکن اللہ تعالٰی ان ظالموں کے خسارے میں اضافہ ہی فرماتا ہے“۔ (بنی اسرائیل: 82) یہ گویا ان کی بدبختی کی انتہا ہے کہ جس سے لوگوں کے دل ہدایت پاتے ہیں۔ وہی باتیں ان کی ضلالت و ہلاکت کا باعث ثابت ہوتی ہیں جس طرح کسی شخص کا مزاج اور معدہ بگڑ جائے، تو وہی غذائیں، جن سے لوگ قوت اور لذت حاصل کرتے ہیں، اس کی بیماری میں مزید بگاڑ اور خرابی کا باعث بنتی ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-ammā alladhīna fī qulūbihim maraḍun fazādathum rij'san ilā rij'sihim wamātū wahum kāfirūna ","translations":["But as for","those","in","their hearts","(is) a disease","(it) increases them","(in) evil","to","their evil","And they die","while they","(are) disbelievers","(125)"],"transliterationArr":["wa-ammā","alladhīna","fī","qulūbihim","maraḍun","fazādathum","rij'san","ilā","rij'sihim","wamātū","wahum","kāfirūna",null],"verseTiming":[[1,0,1790],[2,1790,2930],[3,2930,3470],[4,3470,4660],[5,4660,6230],[6,6230,8640],[7,8640,9530],[8,9530,10200],[9,10200,11350],[10,11350,12570],[11,12570,13220],[12,13220,16195]]}}