{"name":"9:17","price":"ﻻئق نہیں کہ مشرک اللہ تعالیٰ کی مسجدوں کو آباد کریں۔ درآں حالیکہ وه خود اپنے کفر کے آپ ہی گواه ہیں(1) ، ان کے اعمال غارت واکارت ہیں، اور وه دائمی طور پر جہنمی ہیں۔(2)","arabic":"مَا كَانَ لِلۡمُشۡرِكِينَ أَن يَعۡمُرُواْ مَسَٰجِدَ ٱللَّهِ شَٰهِدِينَ عَلَىٰٓ أَنفُسِهِم بِٱلۡكُفۡرِۚ أُوْلَٰٓئِكَ حَبِطَتۡ أَعۡمَٰلُهُمۡ وَفِي ٱلنَّارِ هُمۡ خَٰلِدُونَ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1252,"juzNumber":10,"footnotes":"(1) مَسَاجِدَ اللهِ سے مراد مسجد حرام ہے جمع کا لفظ اس لئے استعمال کیا گیا کہ یہ تمام مساجد کا قبلہ و مرکز ہے یا عربوں میں واحد کے لئے بھی جمع کا استعمال جائز ہے۔ مطلب یہ ہے کہ اللہ کے گھر (یعنی مسجد حرام) کو تعمیر یا آباد کرنا، یہ ایمان والوں کا کام ہے نہ کہ ان کا جو کفر و شرک کا ارتکاب اور اس کا اعتراف کرتے ہیں۔ جیسے وہ تلبیہ میں کہا کرتے تھے: «لَبَّيْكَ لا شَرِيكَ لَكَ، إِلا شَرِيكًا هُوَ لَكَ ، تَمْلِكُهُ وَمَا مَلَكَ» ( صحيح مسلم- باب التلبية) یا اس سے مراد وہ اعتراف ہے جو ہر مذہب والا کرتا ہے کہ میں یہودی، نصرانی، صابی یا مشرک ہوں۔(فتح القدیر)\n(2) یعنی ان کے وہ عمل جو بظاہر نیک لگتے ہیں، جیسے طواف و عمرہ اور حاجیوں کی خدمت وغیرہ۔ کیونکہ ایمان کے بغیر یہ اعمال ایسے درخت کی طرح ہیں جو بےثمر ہیں یا ان پھولوں کی طرح ہیں جن میں خو شبو نہیں ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"mā kāna lil'mush'rikīna an yaʿmurū masājida al-lahi shāhidīna ʿalā anfusihim bil-kuf'ri ulāika ḥabiṭat aʿmāluhum wafī al-nāri hum khālidūna ","translations":["(It) is not","(It) is not","for the polytheists","that","they maintain","(the) masajid of Allah","(the) masajid of Allah","(while) witnessing","against","themselves","[with] disbelief","(For) those","worthless","(are) their deeds","and in","the Fire","they","(will) abide forever","(17)"],"transliterationArr":["mā","kāna","lil'mush'rikīna","an","yaʿmurū","masājida","al-lahi","shāhidīna","ʿalā","anfusihim","bil-kuf'ri","ulāika","ḥabiṭat","aʿmāluhum","wafī","al-nāri","hum","khālidūna",null],"verseTiming":[[1,0,580],[2,580,1290],[3,1290,3170],[4,3170,3400],[5,3400,5560],[6,5560,6650],[7,6650,7650],[8,7650,9000],[9,9000,11080],[10,11080,13850],[11,13850,14760],[12,14760,17780],[13,17780,18790],[14,18790,20390],[15,20390,20790],[16,20790,22460],[17,22460,22930],[18,22930,26625]]}}