{"name":"9:24","price":"آپ کہہ دیجئے کہ اگر تمہارے باپ اور تمہارے لڑکےاور تمہارے بھائی اور تمہاری بیویاں اور تمہارے کنبے قبیلے اور تمہارے کمائے ہوئے مال اور وه تجارت جس کی کمی سے تم ڈرتے ہو اور وه حویلیاں جنہیں تم پسند کرتے ہو اگر یہ تمہیں اللہ سے اور اس کے رسول سے اور اس کی راه میں جہاد سے بھی زیاده عزیز ہیں، تو تم انتظار کرو کہ اللہ تعالیٰ اپنا عذاب لے آئے۔ اللہ تعالیٰ فاسقوں کو ہدایت نہیں دیتا۔(1)","arabic":"قُلۡ إِن كَانَ ءَابَآؤُكُمۡ وَأَبۡنَآؤُكُمۡ وَإِخۡوَٰنُكُمۡ وَأَزۡوَٰجُكُمۡ وَعَشِيرَتُكُمۡ وَأَمۡوَٰلٌ ٱقۡتَرَفۡتُمُوهَا وَتِجَٰرَةٞ تَخۡشَوۡنَ كَسَادَهَا وَمَسَٰكِنُ تَرۡضَوۡنَهَآ أَحَبَّ إِلَيۡكُم مِّنَ ٱللَّهِ وَرَسُولِهِۦ وَجِهَادٖ فِي سَبِيلِهِۦ فَتَرَبَّصُواْ حَتَّىٰ يَأۡتِيَ ٱللَّهُ بِأَمۡرِهِۦۗ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلۡفَٰسِقِينَ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1259,"juzNumber":10,"footnotes":"(1) اس آیت میں بھی اس مضمون کو بڑے مؤکد انداز میں بیان کیا گیا ہے ”عشیرۃ“ اسم جمع ہے، وہ قریب ترین رشتہ دار جن کے ساتھ آدمی زندگی کے شب و روز گزارتا ہے، یعنی کنبہ قبیلہ، ”اقتراف“ کسب (کمائی) کے معنی کے لئے آتا ہے، ”تجارت“ سودے کی خرید و فروخت کو کہتے ہیں جس کا مقصد نفع کا حصول ہو، ”کساد“ مندے کو کہتے ہیں یعنی سامان فروخت موجود ہو لیکن خریدار نہ ہو یا اس چیز کا وقت گز رچکا ہو، جس کی وجہ سے لوگوں کو ضرورت نہ رہے۔ دونوں صورتیں مندے کی ہیں۔ ”مساکن“ سے مراد وہ گھر ہیں جنہیں انسان موسم کے شدائد و حوادث سے بچنے آبرومندانہ طریقے سے رہنے سہنے اور اپنے بال بچوں کی حفاظت کے لئے تعمیر کرتا ہے، یہ ساری چیزیں اپنی اپنی جگہ ضروری ہیں اور ان کی اہمیت و افادیت بھی ناگزیر اور قلوب انسانی میں ان سب کی محبت بھی طبعی ہے (جو مذموم نہیں) لیکن اگر ان کی محبت اللہ اور رسول کی محبت سے زیادہ اور اللہ کی راہ میں جہاد کرنے میں مانع ہو جائے، تو یہ بات اللہ کو سخت ناپسندیدہ اور اس کی ناراضگی کا باعث ہے اور یہ وہ فسق (نافرمانی) ہے جس سے انسان اللہ کی ہدایت سے محروم ہو سکتا ہے۔ جس طرح کہ آخری الفاظ تہدید سے واضح ہے۔ احادیث میں نبی (صلى الله عليه وسلم) نے بھی اس مضمون کو وضاحت سے بیان فرمایا ہے مثلا ایک موقع پر حضرت عمر (رضي الله عنه) نے کہا: ”یا رسول اللہ! مجھے آپ، اپنے نفس کے سوا ہر چیز سے زیادہ محبوب ہیں“۔ آپ (صلى الله عليه وسلم) نے فرمایا ”جب تک میں اس کے اپنے نفس سے بھی زیادہ محبوب نہ ہوجاؤں اس وقت تک وہ مومن نہیں“، حضرت عمر (رضي الله عنه) نے کہا ”پس واللہ! اب آپ مجھے اپنے نفس سے بھی زیادہ محبوب ہیں“۔ آپ (صلى الله عليه وسلم) نے فرمایا: ”اے عمر! اب تم مومن ہو“۔ (صحيح بخاري- كتاب الأيمان والنذر - باب كيف كان يمين النبي صلى الله عليه وسلم) ایک دوسری روایت میں نبی (صلى الله عليه وسلم) نے فرمایا: ”قسم ہے اس ذات کی جس کے ہاتھ میں میری جان ہے تم میں سے کوئی شخص اس وقت تک مومن نہیں جب تک میں اس کو اس کے والد سے اس کی اولاد سے اور تمام لوگوں سے زیادہ محبوب نہ جاؤں“۔ (صحيح بخاري - كتاب الإيمان باب حب الرسول صلى الله عليه وسلم من الإيمان- ومسلم كتاب الإيمان، باب باب بيان خصال من اتصف بهن وجد حلاوة الإيمان) ایک اور حدیث میں جہاد کی اہمیت بیان کرتے ہوئے فرمایا ”جب تم بَيْعُ عِينَةٍ (کسی کو مدت معینہ کے لییے چیز ادھاردے کر پھر اس سے کم قیمت پر خرید لینا) اختیار کر لو گے اور گایوں کی دمیں پکڑ کر کھیتی باڑی پر راضی وقانع ہو جاؤ گے اور جہاد چھوڑ بیٹھو گے تو اللہ تعالٰی تم پر ایسی ذلت مسلط فرمادے گا جس سے تمام وقت تک نہ نکل سکو گے جب تک اپنے دین کی طرف نہیں لوٹو گے“۔ ( أبو داود، كتاب البيوع، باب النهي عن العينة - مسند أحمد جلد 2، ص42)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qul in kāna ābāukum wa-abnāukum wa-ikh'wānukum wa-azwājukum waʿashīratukum wa-amwālun iq'taraftumūhā watijāratun takhshawna kasādahā wamasākinu tarḍawnahā aḥabba ilaykum mina al-lahi warasūlihi wajihādin fī sabīlihi fatarabbaṣū ḥattā yatiya al-lahu bi-amrihi wal-lahu lā yahdī al-qawma al-fāsiqīna ","translations":["Say","If","are","your fathers","and your sons","and your brothers","and your spouses","and your relatives","and wealth","that you have acquired","and the commerce","you fear","a decline (in) it","and the dwellings","you delight (in) it","(are) more beloved","to you","than","Allah","and His Messenger","and striving","in","His way","then wait","until","Allah brings","Allah brings","His Command","And Allah","(does) not","guide","the people ","the defiantly disobedient","(24)"],"transliterationArr":["qul","in","kāna","ābāukum","wa-abnāukum","wa-ikh'wānukum","wa-azwājukum","waʿashīratukum","wa-amwālun","iq'taraftumūhā","watijāratun","takhshawna","kasādahā","wamasākinu","tarḍawnahā","aḥabba","ilaykum","mina","al-lahi","warasūlihi","wajihādin","fī","sabīlihi","fatarabbaṣū","ḥattā","yatiya","al-lahu","bi-amrihi","wal-lahu","lā","yahdī","al-qawma","al-fāsiqīna",null],"verseTiming":[[1,0,490],[2,490,1610],[3,1610,2370],[4,2370,5580],[5,5580,8780],[6,8780,10700],[7,10700,12650],[8,12650,14570],[9,14570,15900],[10,15900,18220],[11,18220,20260],[12,20260,21470],[13,21470,22930],[14,22930,24290],[15,24290,27240],[16,27240,28140],[17,28140,29170],[18,29170,30410],[19,30410,31420],[20,31420,33000],[21,33000,34410],[22,34410,35150],[23,35150,36750],[24,36750,38370],[25,38370,39330],[26,39330,40280],[27,40280,41250],[28,41250,44110],[29,44110,44650],[30,44650,45300],[31,45300,46230],[32,46230,50795]]}}