{"name":"9:27","price":"پھر اس کے بعد بھی جس پر چاہے اللہ تعالیٰ اپنی رحمت کی توجہ فرمائے گا(1) اللہ ہی بخشش ومہربانی کرنے واﻻ ہے۔","arabic":"ثُمَّ يَتُوبُ ٱللَّهُ مِنۢ بَعۡدِ ذَٰلِكَ عَلَىٰ مَن يَشَآءُۗ وَٱللَّهُ غَفُورٞ رَّحِيمٞ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1262,"juzNumber":10,"footnotes":"(1) حُنَیْن مکہ اور طائف کے درمیان ایک وادی ہے۔ یہاں هَوَازِن اور ثَقِیْف رہتے تھے، یہ دونوں قبیلے تیر اندازی میں مشہور تھے۔ یہ مسلمانوں کے خلاف لڑنے کی تیاری کر رہے تھے جس کا علم رسول اللہ (صلى الله عليه وسلم) کو ہوا تو آپ 12 ہزار کا لشکر لے کر ان قبیلوں سے جنگ کے لئے حنین تشریف لے گئے، یہ فتح مکہ کے 18، 19دن بعد، شوال کا واقعہ ہے۔ مذکورہ قبیلوں نے بھرپور تیاری کر رکھی تھی اور مختلف کمین گاہوں میں تیر اندازوں کو مقرر کر دیا تھا۔ ادھر مسلمانوں میں یہ عجب پیدا ہوگیا کہ آج کم از کم قلت کی وجہ سے ہم مغلوب نہیں ہونگے۔ یعنی اللہ کی مدد کے بجائے اپنی کثرت تعداد پر اعتماد زیادہ ہوگیا۔ اللہ تعالٰی کو یہ عُجب کا کلمہ پسند نہیں آیا۔ نتیجتاً جب ہوازن کے تیر اندازوں نے مختلف کمین گاہوں سے مسلمانوں کے لشکر پر یک بارگی تیر اندازی کی تو اس غیر متوقع اور اچانک تیروں کی بچھاڑ سے مسلمانوں کے قدم اکھڑ گئے اور وہ بھاگ کھڑے ہوئے۔ میدان میں صرف رسول اللہ (صلى الله عليه وسلم) اور سَو کے قریب مسلمان رہ گئے۔ آپ (صلى الله عليه وسلم) مسلمانوں کو پکار رہے تھے ”اللہ کے بندو! میرے پاس آؤ میں اللہ کا رسول ہوں“ کبھی یہ رجزیہ کلمہ پڑھتے: «أَنَا النَّبِيُّ لا كَذِبْ - أَنَا ابْنُ عَبْدُ الْمُطَّلِبْ»پھر آپ (صلى الله عليه وسلم) نے حضرت عباس (رضي الله عنه) کو (جو نہایت بلند آواز تھے) حکم دیا کہ مسلمانوں کو جمع کرنے کے لئے آوازیں دیں۔ چنانچہ ان کی ندا سن کر مسلمان سخت پشیمان ہوئے اور دوبارہ میدان میں آگئے اور پھر اس طرح جم کر لڑے کہ اللہ نے فتح عطا فرمائی، اللہ تعالٰی کی مدد بھی حاصل ہوئی، جس سے ان کے دلوں سے دشمن کا خوف دور ہو گیا، دوسرے فرشتوں کا نزول ہوا۔ اس جنگ میں مسلمانوں نے چھ ہزار کافروں کو قیدی بنایا (جنہیں بعد میں نبی (صلى الله عليه وسلم) کی درخواست پر چھوڑ دیا گیا) اور بہت سا مال غنیمت حاصل ہوا، جنگ کے بعد ان کے بہت سے سردار بھی مسلمان ہوگئے یہاں 3 آیت میں اللہ تعالٰی نے اس واقعے کا مختصر ذکر فرمایا ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"thumma yatūbu al-lahu min baʿdi dhālika ʿalā man yashāu wal-lahu ghafūrun raḥīmun ","translations":["Then","Allah accepts repentance","Allah accepts repentance","after","after","that","for","whom","He wills","And Allah","(is) Oft-Forgiving","Most Merciful","(27)"],"transliterationArr":["thumma","yatūbu","al-lahu","min","baʿdi","dhālika","ʿalā","man","yashāu","wal-lahu","ghafūrun","raḥīmun",null],"verseTiming":[[1,0,1460],[2,1460,2410],[3,2410,3430],[4,3430,4500],[5,4500,5400],[6,5400,6190],[7,6190,6960],[8,6960,7230],[9,7230,8330],[10,8330,11230],[11,11230,12970],[12,12970,14430],[13,14430,15135]]}}