{"name":"9:28","price":"اے ایمان والو! بے شک مشرک بالکل ہی ناپاک ہیں(1) وه اس سال کے بعد مسجد حرام کے پاس بھی نہ پھٹکنے پائیں(2) اگر تمہیں مفلسی کا خوف ہے تو اللہ تمہیں دولت مند کر دے گا اپنے فضل سے اگر چاہے(3) اللہ علم وحکمت واﻻ ہے۔","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِنَّمَا ٱلۡمُشۡرِكُونَ نَجَسٞ فَلَا يَقۡرَبُواْ ٱلۡمَسۡجِدَ ٱلۡحَرَامَ بَعۡدَ عَامِهِمۡ هَٰذَاۚ وَإِنۡ خِفۡتُمۡ عَيۡلَةٗ فَسَوۡفَ يُغۡنِيكُمُ ٱللَّهُ مِن فَضۡلِهِۦٓ إِن شَآءَۚ إِنَّ ٱللَّهَ عَلِيمٌ حَكِيمٞ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1263,"juzNumber":10,"footnotes":"(1) مشرک کے (پلید، ناپاک) ہونے کا مطلب، عقائد و اعمال کے لحاظ سے ناپاک ہونا ہے۔ بعض کے نزدیک مشرک ظاہر و باطن دونوں اعتبار سے ناپاک ہے۔ کیونکہ وہ طہارت (صفائی و پاکیزگی) کا اس طرح اہتمام نہیں کرتا، جس کا حکم شریعت نے دیا ہے۔\n(2) یہ وہی حکم ہے جو سن 9 ہجری میں اعلان برات کے ساتھ کیا گیا تھا، جس کی تفصیل پہلے گزر چکی ہے ممانعت بعض کے نزدیک صرف مسجد حرام کے لئے ہے۔ ورنہ حسب ضرورت مشرکین دیگر مساجد میں داخل ہو سکتے ہیں جس طرح نبی کریم (صلى الله عليه وسلم) نے ثمامہ بن اثال (رضي الله عنه) کو مسجد نبوی کے ستون سے باندھے رکھا تھا حتیٰ کہ اللہ نے ان کے دل میں اسلام کی اور نبی (صلى الله عليه وسلم) کی محبت ڈال دی اور وہ مسلمان ہوگئے۔ علاوہ ازیں اکثر علماء کے نزدیک یہاں مسجد حرام سے مراد پورا حرم ہے یعنی حدود حرم کے اندر مشرک کا داخلہ ممنوع ہے بعض آثار کی بنیاد پر اس حکم سے ذمی اور خدام کو مشثنیٰ کیا گیا ہے اسی طرح حضرت عمر بن عبدالعزیز نے اس سے استدلال کرتے ہوئے اپنے دور حکومت میں یہود و نصاریٰ کو بھی مسلمانوں کی مسجدوں میں داخلے سے ممانعت کا حکم جاری فرمایا تھا۔ (ابن کثیر)\n(3) مشرکین کی ممانعت سے بعض مسلمانوں کے دل میں یہ خیال آیا کہ حج کے موسم میں زیادہ اجتماع کی وجہ سے جو تجارت ہوتی ہے، یہ متاثر ہوگی۔ اللہ تعالٰی نے فرمایا، اس مفلسی (یعنی کاروبار کی کمی) سے ڈرنے کی ضرورت نہیں ہے، اللہ تعالٰی عنقریب اپنے فضل سے تمہیں غنی کر دے گا چنانچہ فتوحات کی وجہ سے کثرت سے مال غنیمت مسلمانوں کو حاصل ہوا۔ اور پھر بتدریج سارا عرب بھی مسلمان ہوگیا اور حج کے موسم میں حاجیوں کی ریل پیل پھر اسی طرح ہوگئی جس طرح پہلے تھی بلکہ اس سے کہیں زیادہ ہوئی اور جو مسلسل روز افزوں ہی ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāayyuhā alladhīna āmanū innamā al-mush'rikūna najasun falā yaqrabū al-masjida al-ḥarāma baʿda ʿāmihim hādhā wa-in khif'tum ʿaylatan fasawfa yugh'nīkumu al-lahu min faḍlihi in shāa inna al-laha ʿalīmun ḥakīmun ","translations":["O you who believe","O you who believe","O you who believe","Indeed","the polytheists","(are) unclean","so let them not come near","so let them not come near","Al-Masjid Al-Haraam","Al-Masjid Al-Haraam","after","this, their (final) year","this, their (final) year","And if","you fear","poverty","then soon","Allah will enrich you","Allah will enrich you","from","His Bounty","if","He wills","Indeed","Allah","(is) All-Knower","All-Wise","(28)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","innamā","al-mush'rikūna","najasun","falā","yaqrabū","al-masjida","al-ḥarāma","baʿda","ʿāmihim","hādhā","wa-in","khif'tum","ʿaylatan","fasawfa","yugh'nīkumu","al-lahu","min","faḍlihi","in","shāa","inna","al-laha","ʿalīmun","ḥakīmun",null],"verseTiming":[[1,0,3390],[2,3390,4300],[3,4300,6590],[4,6590,8040],[5,8040,9450],[6,9450,11030],[7,11030,11660],[8,11660,12460],[9,12460,13430],[10,13430,14480],[11,14480,15050],[12,15050,16090],[13,16090,17050],[14,17050,18240],[15,18240,19040],[16,19040,20850],[17,20850,21750],[18,21750,22930],[19,22930,23820],[20,23820,24170],[21,24170,27450],[22,27450,28770],[23,28770,31290],[24,31290,33500],[25,33500,34360],[26,34360,35170],[27,35170,38305]]}}