{"name":"9:29","price":"ان لوگوں سے لڑو، جو اللہ پر اور قیامت کے دن پر ایمان نہیں ﻻتے جو اللہ اور اس کے رسول کی حرام کرده شے کو حرام نہیں جانتے، نہ دین حق کو قبول کرتے ہیں ان لوگوں میں جنہیں کتاب دی گئی ہے، یہاں تک کہ وه ذلیل وخوار ہو کر اپنے ہاتھ سے جزیہ ادا کریں۔(1)","arabic":"قَٰتِلُواْ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱللَّهِ وَلَا بِٱلۡيَوۡمِ ٱلۡأٓخِرِ وَلَا يُحَرِّمُونَ مَا حَرَّمَ ٱللَّهُ وَرَسُولُهُۥ وَلَا يَدِينُونَ دِينَ ٱلۡحَقِّ مِنَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ حَتَّىٰ يُعۡطُواْ ٱلۡجِزۡيَةَ عَن يَدٖ وَهُمۡ صَٰغِرُونَ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1264,"juzNumber":10,"footnotes":"(1) مشرکین سے قتال عام کے حکم کے بعد اس آیت میں یہود و نصاریٰ سے قتال کا حکم دیا جا رہا ہے (اگر وہ اسلام نہ قبول کریں) یا پھر وہ جزیہ دے کر مسلمانوں کی ماتحتی میں رہنا قبول کرلیں جزیہ ایک متعین رقم ہے جو سالانہ ایسے غیر مسلموں سے لی جاتی ہے جو کسی اسلامی مملکت میں رہائش پذیر ہوں اس کے بدلے میں ان کی جان و مال اور عزت و آبرو کی حفاظت کی ذمے داری اسلامی مملکت کی ہوتی ہے۔ یہود و نصاریٰ باوجود اس بات کے وہ اللہ اور یوم آخرت پر ایمان رکھتے تھے، ان کی بابت کہا گیا کہ وہ اللہ اور یوم آخرت پر ایمان نہیں رکھتے تھے، اس سے واضح کر دیا گیا کہ انسان جب تک اللہ پر اس طرح ایمان نہ رکھے جس طرح اللہ نے اپنے پیغمبروں کے ذریعے سے بتلایا ہے، اس وقت تک اس کا ایمان باللہ قابل اعتبار نہیں۔ اور یہ بھی واضح ہے کہ ان کے ایمان باللہ کو غیر معتبر اس لئے قرار دیا گیا کہ یہود و نصاریٰ نے حضرت عزیز و حضرت مسیح علیہما السلام کی ابنیت (یعنی بیٹا ہونے کا) اور الوہیت کا عقیدہ گھڑ لیا تھا، جیسا کہ اگلی آیت میں ان کے عقیدے کا اظہار ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qātilū alladhīna lā yu'minūna bil-lahi walā bil-yawmi al-ākhiri walā yuḥarrimūna mā ḥarrama al-lahu warasūluhu walā yadīnūna dīna al-ḥaqi mina alladhīna ūtū al-kitāba ḥattā yuʿ'ṭū al-jiz'yata ʿan yadin wahum ṣāghirūna ","translations":["Fight","those who","(do) not","believe","in Allah","and not","in the Day","the Last","and not","they make unlawful","what","Allah has made unlawful","Allah has made unlawful","and His Messenger","and not","they acknowledge","(the) religion","(of) the truth","from","those who","were given","the Scripture","until","they pay","the jizyah","willingly","willingly","while they","(are) subdued","(29)"],"transliterationArr":["qātilū","alladhīna","lā","yu'minūna","bil-lahi","walā","bil-yawmi","al-ākhiri","walā","yuḥarrimūna","mā","ḥarrama","al-lahu","warasūluhu","walā","yadīnūna","dīna","al-ḥaqi","mina","alladhīna","ūtū","al-kitāba","ḥattā","yuʿ'ṭū","al-jiz'yata","ʿan","yadin","wahum","ṣāghirūna",null],"verseTiming":[[1,0,960],[2,960,2030],[3,2030,2410],[4,2410,3540],[5,3540,4700],[6,4700,5350],[7,5350,6430],[8,6430,7460],[9,7460,8090],[10,8090,9580],[11,9580,9970],[12,9970,10790],[13,10790,11740],[14,11740,13210],[15,13210,13800],[16,13800,15040],[17,15040,15650],[18,15650,16660],[19,16660,17890],[20,17890,19140],[21,19140,19690],[22,19690,20610],[23,20610,20990],[24,20990,22120],[25,22120,22670],[26,22670,23730],[27,23730,24590],[28,24590,25200],[29,25200,26280],[30,26280,26770],[31,26770,28670],[32,28670,29200],[33,29200,32405]]}}