{"name":"9:34","price":"اے ایمان والو! اکثر علما اور عابد، لوگوں کا مال ناحق کھا جاتے ہیں اور اللہ کی راه سے روک دیتے ہیں(1) اور جو لوگ سونے چاندی کا خزانہ رکھتے ہیں اور اللہ کی راه میں خرچ نہیں کرتے، انہیں دردناک عذاب کی خبر پہنچا دیجئے۔(2)","arabic":"۞ يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِنَّ كَثِيرٗا مِّنَ ٱلۡأَحۡبَارِ وَٱلرُّهۡبَانِ لَيَأۡكُلُونَ أَمۡوَٰلَ ٱلنَّاسِ بِٱلۡبَٰطِلِ وَيَصُدُّونَ عَن سَبِيلِ ٱللَّهِۗ وَٱلَّذِينَ يَكۡنِزُونَ ٱلذَّهَبَ وَٱلۡفِضَّةَ وَلَا يُنفِقُونَهَا فِي سَبِيلِ ٱللَّهِ فَبَشِّرۡهُم بِعَذَابٍ أَلِيمٖ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1269,"juzNumber":10,"footnotes":"(1) أَحْبَارٌ حِبْرٌ کی جمع ہے یہ ایسے شخص کو کہا جاتا ہے جو بات کو خوبصورت طریقہ سے پیش کرنے کا طریقہ رکھتا ہو خوبصورت اور منقش کپڑے کو ثَوْبٌ مُحَبَّرٌ کہا جاتا ہے مراد علماء یہود ہیں، رہبان راہب کی جمع ہے جو رہبنہ سے مشتق ہے۔ اس سے مراد علماء نصاریٰ ہیں بعض کے نزدیک یہ صوفیائے نصاریٰ ہیں۔ یہ دونوں ایک تو کلام اللہ میں تحریف و تغیر کر کے لوگوں کی خواہشات کے مطابق مسئلے بتاتے اور یوں لوگوں کو اللہ کے راستے سے روکتے ہیں، دوسرے اس طرح لوگوں سے مال اینٹھتے، جو ان کے لئے باطل اور حرام تھا۔ بدقسمتی سے بہت سے علماء مسلمین کا بھی یہی حال ہے اور یوں نبی (صلى الله عليه وسلم) کی پیش گوئی کا مصداق ہیں جس میں آپ (صلى الله عليه وسلم) نے فرمایا تھا، لَتَتَّبِعُنَّ سنَنَ مَنْ كَانَ قَبْلَكُمْ (صحيح بخاري كتاب الاعتصام میں نبی صلى الله عليه وسلم کا یہ فرمان باب کا عنوان ہے) ”تم پچھلی امتوں کے طور طریقوں کی ضرور پیروی کرو گے“۔\n(2) حضرت عبد اللہ بن عمر بفرماتے ہیں کہ یہ زکٰوۃ کے حکم سے پہلے کا حکم ہے۔ زکٰوۃ کا حکم نازل ہونے کے بعد زکٰوۃ کو اللہ تعالٰی نے مال کی طہارت کا ذریعہ بنا دیا ہے اس لئے علماء فرماتے ہیں کہ جس مال سے زکٰو ۃ ادا کر دی جائے وہ خزانہ نہیں ہے اور جس مال کی زکٰو ۃ ادا نہ کی جائے، وہ کنز (خزانہ) ہے، جس پر یہ قرآنی وعید ہے۔ چنانچہ صحیح حدیث میں ہے کہ ' جو شخص اپنے مال کی زکٰو ۃ ادا نہیں کرتا قیامت والے دن اس کے مال کو آگ کی تختیاں بنا دیا جائے گا، جس سے اس کے دونوں پہلوؤں کو، پیشانی کو اور کمر کو داغا جائے گا۔ یہ دن پچاس ہزار سال کا ہوگا اور لوگوں کے فیصلے ہو جانے تک اس کا یہی حال رہے گا اس کے بعد جنت یا جہنم میں اسے لے جایا جائے گا (صحيح مسلم- كتاب الزكاة ، باب إثم مانع الزكاة) یہ بگڑے ہوئے علماء اور صوفیا کے بعد بگڑے ہوئے اہل سرمایہ ہیں تینوں طبقے عوام کے بگاڑ میں سب سے زیادہ ذمہ دار ہیں۔ اللَّهُمَّ! احْفَظْنَا مِنْهُمْ","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāayyuhā alladhīna āmanū inna kathīran mina al-aḥbāri wal-ruh'bāni layakulūna amwāla al-nāsi bil-bāṭili wayaṣuddūna ʿan sabīli al-lahi wa-alladhīna yaknizūna al-dhahaba wal-fiḍata walā yunfiqūnahā fī sabīli al-lahi fabashir'hum biʿadhābin alīmin ","translations":["O you who believe","O you who believe","O you who believe","Indeed","many","of","the rabbis","and the monks","surely eat","(the) wealth","(of) the people","in falsehood","and hinder","from","(the) way","(of) Allah","And those who","hoard","the gold","and the silver","and (do) not","spend it","in","(the) way","(of) Allah","[so] give them tidings","of a punishment","painful","(34)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","inna","kathīran","mina","al-aḥbāri","wal-ruh'bāni","layakulūna","amwāla","al-nāsi","bil-bāṭili","wayaṣuddūna","ʿan","sabīli","al-lahi","wa-alladhīna","yaknizūna","al-dhahaba","wal-fiḍata","walā","yunfiqūnahā","fī","sabīli","al-lahi","fabashir'hum","biʿadhābin","alīmin",null],"verseTiming":[[1,0,3130],[2,3130,4010],[3,4010,6429],[4,6429,7819],[5,7819,8669],[6,8669,9699],[7,9699,10929],[8,10929,12479],[9,12479,15779],[10,15779,17179],[11,17179,18189],[12,18189,19959],[13,19959,21159],[14,21159,22599],[15,22599,23909],[16,23909,25129],[17,25129,27109],[18,27109,28879],[19,28879,30129],[20,30129,31089],[21,31089,32319],[22,32319,32919],[23,32919,35299],[24,35299,35689],[25,35689,36849],[26,36849,37429],[27,37429,39469],[28,39469,41689],[29,41689,42999],[30,42999,45664]]}}