{"name":"9:37","price":"مہینوں کا آگے پیچھے کر دینا کفر کی زیادتی ہے(1) اس سے وه لوگ گمراہی میں ڈالے جاتے ہیں جو کافر ہیں۔ ایک سال تو اسے حلال کر لیتے ہیں اور ایک سال اسی کو حرمت واﻻ کر لیتے ہیں، کہ اللہ نے جو حرمت رکھی ہے اس کے شمار میں تو موافقت کر لیں(2) پھر اسے حلال بنا لیں جسے اللہ نے حرام کیا ہے انہیں ان کے برے کام بھلے دکھادیئے گئے ہیں اور قوم کفار کی اللہ رہنمائی نہیں فرماتا۔","arabic":"إِنَّمَا ٱلنَّسِيٓءُ زِيَادَةٞ فِي ٱلۡكُفۡرِۖ يُضَلُّ بِهِ ٱلَّذِينَ كَفَرُواْ يُحِلُّونَهُۥ عَامٗا وَيُحَرِّمُونَهُۥ عَامٗا لِّيُوَاطِـُٔواْ عِدَّةَ مَا حَرَّمَ ٱللَّهُ فَيُحِلُّواْ مَا حَرَّمَ ٱللَّهُۚ زُيِّنَ لَهُمۡ سُوٓءُ أَعۡمَٰلِهِمۡۗ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلۡكَٰفِرِينَ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1272,"juzNumber":10,"footnotes":"(1) ”نَسِيءٌ“ کے معنی پیچھے کرنے کے ہیں۔ عربوں میں بھی حرمت والے مہینوں میں قتال و جدال اور لوٹ مار کو سخت ناپسندیدہ سمجھا جاتا تھا۔ لیکن مسلسل تین مہینے، ان کی حرمت کو ملحوظ رکھتے ہوئے، قتل و غارت سے اجتناب، ان کے لئے بہت مشکل تھا۔ اس لئے اس کا حل انہوں نے یہ نکال رکھا تھا جس حرمت والے مہینے میں قتل و غارت کرنا چاہتے اس میں وہ کر لیتے اور اعلان کر دیتے کہ اس کی جگہ فلاں مہینہ حرمت والا ہوگا مثلًا محرم کے مہینے کی حرمت توڑ کر اس کی جگہ صفر کو حرمت والا مہینہ قرار دے دیتے۔اس طرح حرمت والے مہینوں میں وہ تقدیم و تاخیر اور ادل بدل کرتے رہتے تھے۔ اس کو نَسِيءٌ کہا جاتا تھا۔ اللہ تعالٰی نے اس کی بابت فرمایا کہ یہ کفر میں زیادتی ہے کیونکہ اس کا ادل بدل مقصود لڑائی اور دنیاوی مفادات کے حصول کے سوا کچھ نہیں۔ اور نبی (صلى الله عليه وسلم) نے بھی اس کے خاتمے کا اعلان یہ کہہ کر فرمادیا کہ ”زمانہ گھوم گھما کر اپنی اصلی حالت میں آگیا ہے یعنی اب آئندہ مہینوں کی یہ ترتیب اسی طرح رہے گی جس طرح ابتدائے کائنات سے چلی آرہی ہے“۔\n(2) یعنی ایک مہینے کی حرمت توڑ کر اس کی جگہ دوسرے مہینے کو حرمت والا قرار دینے سے ان کا مقصد یہ ہوتا تھا کہ اللہ تعالٰی نے چار مہینے حرمت والے رکھے ہیں، ان کی گنتی پوری رہے۔ یعنی گنتی پوری کرنے میں اللہ کی موافقت کرتے تھے، لیکن اللہ نے قتال و جدال اور غارت گری سے جو منع کیا تھا، اس کی انہیں کوئی پرواہ نہ تھی، بلکہ انہیں ظالمانہ کاروائیوں کے لئے ہی وہ ادل بدل کرتے تھے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"innamā al-nasīu ziyādatun fī al-kuf'ri yuḍallu bihi alladhīna kafarū yuḥillūnahu ʿāman wayuḥarrimūnahu ʿāman liyuwāṭiū ʿiddata mā ḥarrama al-lahu fayuḥillū mā ḥarrama al-lahu zuyyina lahum sūu aʿmālihim wal-lahu lā yahdī al-qawma al-kāfirīna ","translations":["Indeed","the postponing","(is) an increase","in","the disbelief","are led astray","by it","those who","disbelieve","They make it lawful","one year","and make it unlawful","(another) year","to adjust","the number","which","Allah has made unlawful","Allah has made unlawful","and making lawful","what","Allah has made unlawful","Allah has made unlawful","Is made fair-seeming","to them","(the) evil","(of) their deeds","And Allah","(does) not","guide","the people ","the disbelievers","(37)"],"transliterationArr":["innamā","al-nasīu","ziyādatun","fī","al-kuf'ri","yuḍallu","bihi","alladhīna","kafarū","yuḥillūnahu","ʿāman","wayuḥarrimūnahu","ʿāman","liyuwāṭiū","ʿiddata","mā","ḥarrama","al-lahu","fayuḥillū","mā","ḥarrama","al-lahu","zuyyina","lahum","sūu","aʿmālihim","wal-lahu","lā","yahdī","al-qawma","al-kāfirīna",null],"verseTiming":[[1,0,1600],[2,1600,5000],[3,5000,6920],[4,6920,7340],[5,7340,8080],[6,8080,9570],[7,9570,10000],[8,10000,11030],[9,11030,11970],[10,11970,13740],[11,13740,15510],[12,15510,17640],[13,17640,18500],[14,18500,20340],[15,20340,22400],[16,22400,23400],[17,23400,23770],[18,23770,24630],[19,24630,25620],[20,25620,26980],[21,26980,27400],[22,27400,28290],[23,28290,31230],[24,31230,32180],[25,32180,32700],[26,32700,34790],[27,34790,36860],[28,36860,38030],[29,38030,38590],[30,38590,39340],[31,39340,40260],[32,40260,44825]]}}