{"name":"9:43","price":"اللہ تجھے معاف فرما دے، تو نے انہیں کیوں اجازت دے دی؟ بغیر اس کے کہ تیرے سامنے سچے لوگ کھل جائیں اور تو جھوٹے لوگوں کو بھی جان لے۔(1)","arabic":"عَفَا ٱللَّهُ عَنكَ لِمَ أَذِنتَ لَهُمۡ حَتَّىٰ يَتَبَيَّنَ لَكَ ٱلَّذِينَ صَدَقُواْ وَتَعۡلَمَ ٱلۡكَٰذِبِينَ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1278,"juzNumber":10,"footnotes":"(1) یہ نبی کریم (صلى الله عليه وسلم) کو کہا جا رہا ہے کہ جہاد میں عدم شرکت کی اجازت مانگنے والوں کو تو نے کیوں بغیر یہ تحقیق کئے کہ اس کے پاس معقول عذر بھی ہے یا نہیں؟ اجازت دے دی۔ لیکن اس توبیخ میں بھی پیار کا پہلو غالب ہے، اس لئے اس کوتاہی پر معافی کی وضاحت پہلے کر دی گئی ہے۔ یاد رہے یہ تنبیہ اس لئے کی گئی ہے کہ اجازت دینے میں عجلت کی گئی اور پورے طور پر تحقیق کی ضرورت نہیں سمجھی گئی۔ ورنہ تحقیق کے بعد ضرورت مندوں کو اجازت دینے کی آپ کو اجازت حاصل تھی۔ جیسا کہ فرمایا گیا ہے۔ «فَإِذَا اسْتَأْذَنُوكَ لِبَعْضِ شَأْنِهِمْ فَأْذَنْ لِمَنْ شِئْتَ مِنْهُمْ» ( النور -62) ”جب یہ لوگ تجھ سے اپنے بعض کاموں کی وجہ سے اجازت مانگیں، تو جس کو تو چاہے، اجازت دے دے“۔ جس کو چاہے کا مطلب یہ ہے کہ جس کے پاس معقول عذر ہو، اسے اجازت دینے کا حق تجھے حاصل ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"ʿafā al-lahu ʿanka lima adhinta lahum ḥattā yatabayyana laka alladhīna ṣadaqū wataʿlama al-kādhibīna ","translations":["(May) Allah forgive","(May) Allah forgive","you","Why (did)","you grant leave","to them","until","(became) evident","to you","those who","were truthful","and you knew","the liars","(43)"],"transliterationArr":["ʿafā","al-lahu","ʿanka","lima","adhinta","lahum","ḥattā","yatabayyana","laka","alladhīna","ṣadaqū","wataʿlama","al-kādhibīna",null],"verseTiming":[[1,0,650],[2,650,1580],[3,1580,3310],[4,3310,3710],[5,3710,5280],[6,5280,5860],[7,5860,6780],[8,6780,8090],[9,8090,8590],[10,8590,9690],[11,9690,10710],[12,10710,11720],[13,11720,15375]]}}