{"name":"9:45","price":"یہ اجازت تو تجھ سے وہی طلب کرتے ہیں جنہیں نہ اللہ پر ایمان ہے نہ آخرت کے دن کا یقین ہے جن کے دل شک میں پڑے ہوئے ہیں اور وه اپنے شک میں ہی سرگرداں ہیں۔(1)","arabic":"إِنَّمَا يَسۡتَـٔۡذِنُكَ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِ وَٱرۡتَابَتۡ قُلُوبُهُمۡ فَهُمۡ فِي رَيۡبِهِمۡ يَتَرَدَّدُونَ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1280,"juzNumber":10,"footnotes":"(1) یہ ان منافقین کا بیان ہے جنہوں نے جھو ٹے حیلے تراش کر رسول اللہ (صلى الله عليه وسلم) سے جہاد میں نہ جانے کی اجازت طلب کر لی تھی۔ ان کی بابت کہا گیا ہے کہ یہ اللہ پر اور یوم آخرت پر ایمان نہیں رکھتے۔ اس کا مطلب یہ ہے کہ اسی عدم ایمان نے انہیں جہاد سے گریز پر مجبور کیا۔ اگر ایمان ان کے دلوں میں راسخ ہوتا تو نہ جہاد سے یہ بھاگتے نہ شکوک و شبہات ان کے دلوں میں پیدا ہوتے۔\nملحوظہ: خیال رہے کہ اس جہاد میں شرکت کے معاملے میں مسلمانوں کی چار قسمیں تھیں۔\nپہلی قسم: وہ مسلمان جو بلا تامل تیار ہوگئے۔ دوسرے، وہ جنہیں ابتداء تردد ہوا اور ان کے دل ڈولے، لیکن پھر جلد ہی اس تردد سے نکل آئے۔ تیسرے، وہ جو ضعف اور بیماری یا سواری اور سفر خرچ نہ ہونے کی وجہ سے فی الواقع جانے سے معذور تھے اور جنہیں خود اللہ تعالیٰ نے اجازت دے دی تھی۔ (ان کا ذکر آیت 91- 92 میں ہے) چوتھی قسم، وہ جو محض کاہلی کی وجہ سے شریک نہیں ہوئے۔ اور جب نبی (صلى الله عليه وسلم) واپس آئے تو انہوں نے اپنے گناہ کا اعتراف کرکے اپنے آپ کو توبہ اور سزا کے لئے پیش کردیا۔ ان کے علاوہ باقی منافقین اور ان کے جاسوس تھے، یہاں مسلمانوں کے پہلے گروہ اور منافقین کا ذکر ہے۔ مسلمانوں کی باقی تین قسموں کا بیان آگے چل کر آئے گا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"innamā yastadhinuka alladhīna lā yu'minūna bil-lahi wal-yawmi al-ākhiri wa-ir'tābat qulūbuhum fahum fī raybihim yataraddadūna ","translations":["Only","ask your leave","those who","(do) not","believe","in Allah","and the Day","the Last","and (are in) doubts","their hearts","so they","in","their doubts","they waver","(45)"],"transliterationArr":["innamā","yastadhinuka","alladhīna","lā","yu'minūna","bil-lahi","wal-yawmi","al-ākhiri","wa-ir'tābat","qulūbuhum","fahum","fī","raybihim","yataraddadūna",null],"verseTiming":[[1,0,1830],[2,1830,3330],[3,3330,4530],[4,4530,4970],[5,4970,6360],[6,6360,7400],[7,7400,8540],[8,8540,9630],[9,9630,10890],[10,10890,12220],[11,12220,12950],[12,12950,13380],[13,13380,14530],[14,14530,19205]]}}