{"name":"9:46","price":"اگر ان کا اراده جہاد کے لئے نکلنے کا ہوتا تو وه اس سفر کے لئے سامان کی تیاری کر رکھتے(1) لیکن اللہ کو ان کا اٹھنا پسند ہی نہ تھا اس لئے انہیں حرکت سے ہی روک دیا(2) اور کہہ دیا گیا کہ تم بیٹھنے والوں کے ساتھ بیٹھے ہی رہو۔(3)","arabic":"۞ وَلَوۡ أَرَادُواْ ٱلۡخُرُوجَ لَأَعَدُّواْ لَهُۥ عُدَّةٗ وَلَٰكِن كَرِهَ ٱللَّهُ ٱنۢبِعَاثَهُمۡ فَثَبَّطَهُمۡ وَقِيلَ ٱقۡعُدُواْ مَعَ ٱلۡقَٰعِدِينَ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1281,"juzNumber":10,"footnotes":"(1) یہ انہیں منافقوں کے بارے میں کہا جا رہا ہے جنہوں نے جھوٹ بول کر اجازت حاصل کی تھی کہ اگر وہ جہاد میں جانے کا ارادہ رکھتے تو یقینا اس کے لئے تیاری کرتے۔\n(2) ”فَثَبَّطَهُمْ“ کے معنی ہیں انکو روک دیا، پیچھے رہنا ان کے لئے پسندیدہ بنا دیا گیا، پس وہ سست ہوگئے اور مسلمانوں کے ساتھ نہیں نکلے مطلب یہ ہے کہ اللہ کے علم میں ان کی شرارتیں اور سازشیں تھیں، اس لئے اللہ کی تقدیری مشیت یہی تھی کہ وہ نہ جائیں۔ (3) یہ یا تو اسی مشیت الٰہی کی تعبیر ہے جو تقدیرا لکھی ہوئی تھی یا بطور ناراضگی اور غضب کے رسول اللہ (صلى الله عليه وسلم) کی طرف سے کہا گیا ہے کہ اچھا ٹھیک ہے تم عورتوں، بچوں، بیماروں اور بوڑھوں کی صف میں شامل ہو کر ان کی طرح گھروں میں بیٹھے رہو۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walaw arādū al-khurūja la-aʿaddū lahu ʿuddatan walākin kariha al-lahu inbiʿāthahum fathabbaṭahum waqīla uq'ʿudū maʿa al-qāʿidīna ","translations":["And if","they had wished","(to) go forth","surely they (would) have prepared","for it","(some) preparation","But","Allah disliked","Allah disliked","their being sent","so He made them lag behind","and it was said","Sit","with","those who sit","(46)"],"transliterationArr":["walaw","arādū","al-khurūja","la-aʿaddū","lahu","ʿuddatan","walākin","kariha","al-lahu","inbiʿāthahum","fathabbaṭahum","waqīla","uq'ʿudū","maʿa","al-qāʿidīna",null],"verseTiming":[[1,0,760],[2,760,1640],[3,1640,2770],[4,2770,4120],[5,4120,4780],[6,4780,6620],[7,6620,8330],[8,8330,8960],[9,8960,9960],[10,9960,11830],[11,11830,13960],[12,13960,15520],[13,15520,16280],[14,16280,17210],[15,17210,17690],[16,17690,21375]]}}