{"name":"9:5","price":"پھر حرمت والے مہینوں(1) کے گزرتے ہی مشرکوں کو جہاں پاؤ قتل کرو(2) انہیں گرفتار کرو(3)، ان کا محاصره کرلو اور ان کی تاک میں ہر گھاٹی میں جا بیٹھو(4)، ہاں اگر وه توبہ کرلیں اور نماز کے پابند ہو جائیں اور زکوٰة ادا کرنے لگیں توتم ان کی راہیں چھوڑ دو(5)۔ یقیناً اللہ تعالیٰ بخشنے واﻻ مہربان ہے۔","arabic":"فَإِذَا ٱنسَلَخَ ٱلۡأَشۡهُرُ ٱلۡحُرُمُ فَٱقۡتُلُواْ ٱلۡمُشۡرِكِينَ حَيۡثُ وَجَدتُّمُوهُمۡ وَخُذُوهُمۡ وَٱحۡصُرُوهُمۡ وَٱقۡعُدُواْ لَهُمۡ كُلَّ مَرۡصَدٖۚ فَإِن تَابُواْ وَأَقَامُواْ ٱلصَّلَوٰةَ وَءَاتَوُاْ ٱلزَّكَوٰةَ فَخَلُّواْ سَبِيلَهُمۡۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1240,"juzNumber":10,"footnotes":"(1) ان حرمت والے مہینوں سے مراد کیا ہے؟ اس میں اختلاف ہے۔ ایک رائے تو یہ ہے اس سے مراد وہی چار مہینے ہیں جو حرمت والے ہیں۔ یعنی رجب، ذوالقعدہ، ذوالحجہ اور محرم۔ اور اعلان براءت 10 ذوالحجہ کو کیا گیا۔ اس اعتبار سے گویا یہ اعلان کے بعد پچاس دن کی مہلت انہیں دی گئی، کیونکہ حرمت والے مہینوں کے گزرنے کے بعد مشرکین کو پکڑنے اور قتل کرنے کی اجازت دے دی گئی۔ لیکن امام ابن کثیر نے کہا کہ یہاں أَشْهُرٌ حُرُمٌ سے مراد حرمت والے مہینے نہیں بلکہ 10 ذوالحجہ سے لے کر 10ربیع الثانی تک کے چار مہینے مراد ہیں۔ انہیں أَشْهُرٌ حُرُمٌ اس لیے کہا گیا ہے کہ اعلان براءت کی روسے ان چارمہینوں میں ان مشرکین سے لڑنے اور انکے خلاف کسی اقدام کی اجازت نہیں تھی۔ اعلان براءت کی رو سے یہ تاویل مناسب معلوم ہوتی ہے (واللہ اعلم بالصواب)۔\n(2) بعض مفسرین نے اس حکم کو عام رکھا یعنی حل یا حرم میں، جہاں بھی پاؤ قتل کرو۔ اور بعض مفسرین نے «وَلا تُقَاتِلُوهُمْ عِنْدَ الْمَسْجِدِ الْحَرَامِ حَتَّى يُقَاتِلُوكُمْ فِيهِ فَإِنْ قَاتَلُوكُمْ فَاقْتُلُوهُمْ» ( البقرة ۔191) ”مسجد حرام کے پاس مت لڑو! یہاں تک کہ وہ خود تم سے لڑیں، اگر وہ لڑیں تو پھر تمہیں بھی ان سے لڑنے کی اجازت ہے“۔ اس آیت سے تخصیص کی ہے اور صرف حدود حرم سے باہر حل میں قتل کرنے کی اجازت دی ہے۔ (ابن کثیر)\n(3) یعنی انہیں قیدی بنا لویا قتل کر دو۔\n(4) یعنی اس بات پر اکتفا کرو کہ وہ تمہیں کہیں ملیں تو تم کاروائی کرو، بلکہ جہاں جہاں ان کے حصار، قلعے اور پناہ گاہیں ہیں وہاں وہاں ان کی گھات میں رہو، حتٰی کہ تمہاری اجازت کے بغیر ان کے لئے نقل و حرکت ممکن نہ رہے۔\n(5) یعنی کوئی کاروائی ان کے خلاف نہ کی جائے، کیونکہ وہ مسلمان ہوگئے ہیں۔ گویا قبول اسلام کے بعد اقامت صلٰوۃ اور ادائے زکوۃ کا اہتمام ضروری ہے۔ اگر کوئی شخص ان میں سے کسی ایک کا بھی ترک کرتا ہے تو وہ مسلمان نہیں سمجھا جائے گا۔ جس طرح حضرت ابو بکر صدیق (رضي الله عنه) نے مانعین زکوۃ کے خلاف اسی آیت سے استدلال کرتے ہوئے جہاد کیا اور فرمایا: «والله لأُقَاتِلَنَّ مَنْ فَرَّقَ بَيْنَ الصَّلاة وَالزَّكَاةِ» (متفق عليه ، بحواله مشكاة كتاب الزكاة، فصل ثالث) ”اللہ کی قسم میں ان لوگوں سے ضرور لڑوں گا جو نماز اور زکوۃ کے درمیان فرق کریں گے“۔ یعنی نماز تو پڑھیں لیکن زکوۃ ادا کرنے سے گریز کریں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"fa-idhā insalakha al-ashhuru al-ḥurumu fa-uq'tulū al-mush'rikīna ḥaythu wajadttumūhum wakhudhūhum wa-uḥ'ṣurūhum wa-uq'ʿudū lahum kulla marṣadin fa-in tābū wa-aqāmū al-ṣalata waātawū al-zakata fakhallū sabīlahum inna al-laha ghafūrun raḥīmun ","translations":["Then when","have passed","the sacred months","the sacred months","then kill","the polytheists","wherever","you find them","and seize them","and besiege them","and sit (in wait)","for them","(at) every","place of ambush","But if","they repent","and establish","the prayer","and give","the zakah","then leave","their way","Indeed","Allah","(is) Oft-Forgiving","Most Merciful","(5)"],"transliterationArr":["fa-idhā","insalakha","al-ashhuru","al-ḥurumu","fa-uq'tulū","al-mush'rikīna","ḥaythu","wajadttumūhum","wakhudhūhum","wa-uḥ'ṣurūhum","wa-uq'ʿudū","lahum","kulla","marṣadin","fa-in","tābū","wa-aqāmū","al-ṣalata","waātawū","al-zakata","fakhallū","sabīlahum","inna","al-laha","ghafūrun","raḥīmun",null],"verseTiming":[[1,0,670],[2,670,2290],[3,2290,3350],[4,3350,4180],[5,4180,5030],[6,5030,6500],[7,6500,7330],[8,7330,9010],[9,9010,10360],[10,10360,11950],[11,11950,13000],[12,13000,13720],[13,13720,14330],[14,14330,15160],[15,15160,17370],[16,17370,18520],[17,18520,19530],[18,19530,20780],[19,20780,21880],[20,21880,23060],[21,23060,24080],[22,24080,26120],[23,26120,27560],[24,27560,28560],[25,28560,29420],[26,29420,32505]]}}