{"name":"9:55","price":"پس آپ کو ان کے مال واوﻻد تعجب میں نہ ڈال دیں(1) ۔ اللہ کی چاہت یہی ہے کہ اس سے انہیں دنیا کی زندگی میں ہی سزا دے(2) اور ان کے کفر ہی کی حالت میں ان کی جانیں نکل جائیں۔(3)","arabic":"فَلَا تُعۡجِبۡكَ أَمۡوَٰلُهُمۡ وَلَآ أَوۡلَٰدُهُمۡۚ إِنَّمَا يُرِيدُ ٱللَّهُ لِيُعَذِّبَهُم بِهَا فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَتَزۡهَقَ أَنفُسُهُمۡ وَهُمۡ كَٰفِرُونَ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1290,"juzNumber":10,"footnotes":"(1) اس لئے کہ یہ سب بطور آزمائش ہے، جس طرح فرمایا: «وَلا تَمُدَّنَّ عَيْنَيْكَ إِلَى مَا مَتَّعْنَا بِهِ أَزْوَاجًا مِنْهُمْ زَهْرَةَ الْحَيَاةِ الدُّنْيَا لِنَفْتِنَهُمْ فِيهِ» ( طه ۔131) ”اور کئی طرح کے لوگوں کو جو ہم نے دنیا زندگی میں آرائش کی چیزوں سے بہرہ مند کیا ہے، تاکہ ان کی آزمائش کریں، ان پر نگاہ نہ کرنا، اور فرمایا: «أَيَحْسَبُونَ أَنَّمَا نُمِدُّهُمْ بِهِ مِنْ مَالٍ وَبَنِينَ، نُسَارِعُ لَهُمْ فِي الْخَيْرَاتِ بَلْ لا يَشْعُرُونَ» ( المؤمنون. 55-56) ”کیا لوگ خیال کرتے ہیں کہ ہم جو دنیا میں ان کو مال اور بیٹوں سے مدد دیتے ہیں،(تو اس سے) ان کی بھلائی میں ہم جلدی کر رہے ہیں؟ (نہیں) بلکہ یہ سمجھتے نہیں“۔\n(2) امام ابن کثیر اور امام ابن جریر طبری نے اس سے زکٰوۃ اور نفاق فی سبیل اللہ مراد لیا ہے۔ یعنی ان منافقین سے زکٰوۃ و صدقات تو (جو وہ مسلمان ظاہر کرنے کے لئے دیتے ہیں) دنیا میں قبول کر لئے جائیں تاکہ اسی طریقے سے ان کو مالی مار بھی دنیا میں دی جائے۔\n(3) تاہم ان کی موت کفر ہی کی حالت میں آئے گی۔ اس لئے کہ وہ اللہ کے پیغمبر کو صدق دل سے ماننے کے لئے تیار نہیں اور اپنے کفر و نفاق پر ہی بدستور قائم و مصر ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"falā tuʿ'jib'ka amwāluhum walā awlāduhum innamā yurīdu al-lahu liyuʿadhibahum bihā fī al-ḥayati al-dun'yā watazhaqa anfusuhum wahum kāfirūna ","translations":["So (let) not","impress you","their wealth","and not","their children","Only","Allah intends","Allah intends","to punish them","with it","in","the life","(of) the world","and should depart","their souls","while they","(are) disbelievers","(55)"],"transliterationArr":["falā","tuʿ'jib'ka","amwāluhum","walā","awlāduhum","innamā","yurīdu","al-lahu","liyuʿadhibahum","bihā","fī","al-ḥayati","al-dun'yā","watazhaqa","anfusuhum","wahum","kāfirūna",null],"verseTiming":[[1,0,640],[2,640,1840],[3,1840,3460],[4,3460,5569],[5,5569,7939],[6,7939,9929],[7,9929,10859],[8,10859,11809],[9,11809,14339],[10,14339,14949],[11,14949,15209],[12,15209,16409],[13,16409,17559],[14,17559,18819],[15,18819,20859],[16,20859,21589],[17,21589,24994]]}}