{"name":"9:58","price":"ان میں وه بھی ہیں جو خیراتی مال کی تقسیم کے بارے میں آپ پر عیب رکھتے ہیں(1) ، اگر انہیں اس میں سے مل جائے تو خوش ہیں اور اگر اس میں سے نہ ملا تو فوراً بگڑ کھڑے ہوئے۔(2)","arabic":"وَمِنۡهُم مَّن يَلۡمِزُكَ فِي ٱلصَّدَقَٰتِ فَإِنۡ أُعۡطُواْ مِنۡهَا رَضُواْ وَإِن لَّمۡ يُعۡطَوۡاْ مِنۡهَآ إِذَا هُمۡ يَسۡخَطُونَ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1293,"juzNumber":10,"footnotes":"(1) یہ ان کی ایک اور بہت بڑی کوتاہی کا بیان ہے کہ وہ نبی (صلى الله عليه وسلم) کی ذات ستودہ صفات کو (نعوذ باللہ) صدقات و غنائم کی تقسیم میں غیر منصف باور کراتے، جس طرح ابن ذی الخویصرہ کے بارے میں آتا ہے کہ آپ (صلى الله عليه وسلم) ایک مرتبہ تقسیم فرما رہے تھے کہ اس نے کہا \"انصاف سے کام لیجئے\" آپ (صلى الله عليه وسلم) نے فرمایا: ”افسوس ہے تجھ پر، اگر میں ہی انصاف نہیں کروں گا تو پھر کون کرے گا؟“۔ (صحيح بخاري- كتاب المناقب، باب علامات النبوة صحيح مسلم- كتاب الزكاة باب ذكر الخوارج ...)۔\n(2) گویا اس الزام تراشی کا مقصد محض مالی مفادات کا حصول تھا کہ اس طرح ان سے ڈرتے ہوئے انہیں زیادہ حصہ دیا جائے، یا وہ مستحق ہوں یا نہ ہوں، انہیں حصہ ضرور دیا جائے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wamin'hum man yalmizuka fī al-ṣadaqāti fa-in uʿ'ṭū min'hā raḍū wa-in lam yuʿ'ṭaw min'hā idhā hum yaskhaṭūna ","translations":["And among them","(is he) who","criticizes you","concerning","the charities","Then if","they are given","from it","they are pleased","but if","not","they are given","from it","then","they","(are) enraged","(58)"],"transliterationArr":["wamin'hum","man","yalmizuka","fī","al-ṣadaqāti","fa-in","uʿ'ṭū","min'hā","raḍū","wa-in","lam","yuʿ'ṭaw","min'hā","idhā","hum","yaskhaṭūna",null],"verseTiming":[[1,0,1080],[2,1080,2350],[3,2350,3240],[4,3240,4290],[5,4290,4480],[6,4480,5960],[7,5960,6570],[8,6570,7550],[9,7550,8430],[10,8430,9280],[11,9280,9890],[12,9890,10290],[13,10290,11230],[14,11230,13610],[15,13610,14280],[16,14280,14760],[17,14760,18155]]}}