{"name":"9:6","price":"اگر مشرکوں میں سے کوئی تجھ سے پناه طلب کرے تو تو اسے پناه دے دے یہاں تک کہ وه کلام اللہ سن لے پھر اسے اپنی جائے امن تک پہنچا دے(1) ۔ یہ اس لئے کہ یہ لوگ بے علم ہیں۔(2)","arabic":"وَإِنۡ أَحَدٞ مِّنَ ٱلۡمُشۡرِكِينَ ٱسۡتَجَارَكَ فَأَجِرۡهُ حَتَّىٰ يَسۡمَعَ كَلَٰمَ ٱللَّهِ ثُمَّ أَبۡلِغۡهُ مَأۡمَنَهُۥۚ ذَٰلِكَ بِأَنَّهُمۡ قَوۡمٞ لَّا يَعۡلَمُونَ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1241,"juzNumber":10,"footnotes":"(1) اس آیت میں مذکورہ حربی کافروں کے بارے میں ایک رخصت دی گئی ہے کہ اگر کوئی کافر پناہ طلب کرے تو اسے پناہ دے دو، یعنی اسے اپنی حفظ و امان میں رکھو تاکہ کوئی مسلمان اسے قتل نہ کر سکے اور تاکہ اسے اللہ کی باتیں سننے اور اسلام کے سمجھنے کا موقعہ ملے، ممکن ہے اس طرح اسے توبہ اور قبول اسلام کی توفیق مل جائے۔ لیکن اگر وہ کلام اللہ سننے کے باوجود مسلمان نہیں ہوتا تو اسے اس کی جائے امن تک پہنچا دو، مطلب یہ ہے کہ اپنی امان کی پاسداری آخر تک کرنی ہے، جب تک وہ اپنے مستقر تک بخیریت واپس نہیں پہنچ جاتا، اس کی جان کی حفاظت تمہاری ذمہ داری ہے۔\n(2) یعنی پناہ کے طلبگاروں کو پناہ کی رخصت اس لئے دی گئی ہے کہ یہ بےعلم لوگ ہیں، ممکن ہے اللہ اور رسول کی باتیں ان کے علم میں آئیں اور مسلمانوں کا اخلاق و کردار وہ دیکھیں تو اسلام کی حقانیت و صداقت کے وہ قائل ہوجائیں۔ اور اسلام قبول کر کے آخرت کے عذاب سے بچ جائیں۔ جس طرح صلح حدیبیہ کے بعد بہت سے کافر امان طلب کر کے مدینہ آتے جاتے رہے تو انہیں مسلمانوں کے اخلاق و کردار کے مشاہدے سے اسلام کے سمجھنے میں بڑی مدد ملی اور بہت سے لوگ مسلمان ہوگئے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-in aḥadun mina al-mush'rikīna is'tajāraka fa-ajir'hu ḥattā yasmaʿa kalāma al-lahi thumma abligh'hu mamanahu dhālika bi-annahum qawmun lā yaʿlamūna ","translations":["And if","anyone","of","the polytheists","seek your protection","then grant him protection","until","he hears","(the) Words of Allah","(the) Words of Allah","Then","escort him","(to) his place of safety","That","(is) because they","(are) a people","(who) do not know","(who) do not know","(6)"],"transliterationArr":["wa-in","aḥadun","mina","al-mush'rikīna","is'tajāraka","fa-ajir'hu","ḥattā","yasmaʿa","kalāma","al-lahi","thumma","abligh'hu","mamanahu","dhālika","bi-annahum","qawmun","lā","yaʿlamūna",null],"verseTiming":[[1,0,710],[2,710,1500],[3,1500,2590],[4,2590,4120],[5,4120,5470],[6,5470,6550],[7,6550,7490],[8,7490,8360],[9,8360,9190],[10,9190,10140],[11,10140,11790],[12,11790,12890],[13,12890,14490],[14,14490,15440],[15,15440,17840],[16,17840,18490],[17,18490,19180],[18,19180,22735]]}}