{"name":"9:60","price":"صدقے صرف فقیروں(1) کے لئے ہیں اور مسکینوں کے لئے اور ان کے وصول کرنے والوں کے لئے اور ان کے لئے جن کے دل پرچائے جاتے ہوں اور گردن چھڑانے میں اور قرض داروں کے لئے اور اللہ کی راه میں اور راہرو مسافروں کے لئے(2)، فرض ہے اللہ کی طرف سے، اور اللہ علم وحکمت واﻻ ہے۔","arabic":"۞ إِنَّمَا ٱلصَّدَقَٰتُ لِلۡفُقَرَآءِ وَٱلۡمَسَٰكِينِ وَٱلۡعَٰمِلِينَ عَلَيۡهَا وَٱلۡمُؤَلَّفَةِ قُلُوبُهُمۡ وَفِي ٱلرِّقَابِ وَٱلۡغَٰرِمِينَ وَفِي سَبِيلِ ٱللَّهِ وَٱبۡنِ ٱلسَّبِيلِۖ فَرِيضَةٗ مِّنَ ٱللَّهِۗ وَٱللَّهُ عَلِيمٌ حَكِيمٞ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1295,"juzNumber":10,"footnotes":"(1) اس آیت میں اس طعن کا دروازہ بند کرنے کے لئے صدقات کے مستحق لوگوں کا تذکرہ کیا جا رہا ہے۔ صدقات سے مراد یہاں صدقات واجبہ یعنی زکٰوۃ ہے۔ آیت کا آغاز إنَّمَا سے کیا گیا ہے جو قصر کے صیغوں میں سے ہے اور الصقات میں لام تعریف جنس کے لیے ہے یعنی صدقات کی یہ جنس (زکوٰۃ) ان آٹھ قمسوں میں مقصور ہے جن کا ذکر آیت میں ہے ان کے علاوہ کسی اور مصرف پر زکوۃ کی رقم کا استعمال صحیح نہیں۔ اہل علم کے درمیان اس امر میں اختلاف ہے کہ کیا ان آٹھوں مصارف پر تقسیم کرنا ضروری ہے؟ امام شافعی کی رائے کی رو سے زکٰوۃ کی رقم آٹھوں مصارف پر خرچ کرنا ضروری ہے۔ یا ان میں سے جس مصرف یا مصارف پر امام یا زکوۃ ادا کرنے والا مناسب سمجھے حسب ضرورت خرچ کرسکتا ہے امام شافعی وغیرہ پہلی رائے کے قائل ہیں اور امام مالک اور امام ابو حنیفہ وغیرہما دوسری رائے کے۔ اور یہ دوسری رائے ہی زیادہ صحیح ہے امام شافعی کی رائے کی رو سے زکوۃ کی رقم آٹھوں مصارف پر خرچ کرنا ضروری ہے یعنی اقتضائے ضرورت اور مصالح دیکھے بغیر رقم کے آٹھ حصے کر کے آٹھوں جگہ پر کچھ کچھ رقم خرچ کی جائے۔ جبکہ دوسری رائے کے مطابق ضرورت اور مصالح کا اعتبار ضروری ہے جس مصرف پر رقم خرچ کرنے کی زیادہ ضرورت یا مصالح کسی ایک مصرف پر خرچ کرنے کے متقتضی ہوں، تو وہاں ضرورت اور مصالح کے لحاظ سے زکوۃ کی رقم خرچ کی جائے گی چاہے دوسرے مصارف پر خرچ کرنے کے لیے رقم نہ بچے اس رائے میں جو معقولیت ہے وہ پہلی رائے میں نہیں ہے۔\n(2) ان مصارف ثمانیہ کی مختصر تفصیل حسب ذیل ہے۔\n(ا،2) فقیر اور مسکین چونکہ قریب قریب ہیں اور ایک کا اطلاق دوسر پر بھی ہوتا ہے یعنی فقیر کو مسکین اور مسکین کو فقیر کہہ لیا جاتا ہے۔ اس لئے ان کی الگ الگ تعریف میں خاصا اختلاف ہے۔ تاہم دونوں کے مفہوم میں یہ بات تو قطعی ہے کہ جو حاجت مند ہوں اور اپنی حاجات وضروریات کو پورا کرنے کے لیے مطلوبہ رقم اور وسائل سے محروم ہوں ان کو فقیر اور مسکین کہا جاتا ہے مسکین کی تعریف میں ایک حدیث آتی ہے نبی کریم (صلى الله عليه وسلم) نے فرمایا ”مسکین وہ گھو منے پھر نے والا نہیں ہے جو ایک ایک یادو دو لقمے یا کھجور کے لیے گھر گھر پھرتا ہے بلکہ مسکین وہ ہے جس کے پاس اتنا مال بھی نہ ہو جو اسے بے نیاز کر دے نہ وہ ایسی مسکنت اپنے اوپر طاری رکھے کہ لوگ غریب اور مستحق سمجھ کر اس پر صدقہ کریں اور نہ خود لوگوں کے سامنے دست سوال دراز کرے“۔(صحیح بخاری ومسلم کتاب الزکوٰۃ) حدیث میں گویا اصل مسکین شخص مذکور کو قرار دیا گیا ہے ورنہ حضرت ابن عباس (رضي الله عنه) وغیرہ سے مسکین کی تعریف یہ منقول ہے کہ جو گداگر ہو، گھوم پھر کر اور لوگوں کے پیچھے پڑ کر مانگتا ہو اور فقیر وہ ہے جو نادار ہونے کے باوجود سوال سے بچے اور لوگوں سے کسی چیز کا سوال نہ کرے۔ (ابن کثیر)\n3۔ عاملین سے مراد حکومت کے وہ اہلکار جو زکٰو ۃ و صدقات کی وصولی و تقسیم اور اس کے حساب کتاب پر معمور ہوں۔\n4۔ مولفۃ القلوب ایک تو وہ کافر ہے جو کچھ اسلام کی طرف مائل ہو اور اس کی امداد کرنے پر امید ہو کہ وہ مسلمان ہو جائے گا۔ دوسرے، وہ نو مسلم افراد ہیں جن کو اسلام پر مضبوطی سے قائم رکھنے کے لیے امداد دینے کی ضرورت ہو۔ تیسرے وہ افراد بھی ہیں جن کی امداد دینے کی صورت میں یہ امید ہو کہ وہ اپنے علاقے کے لوگوں کو مسلمانوں پر حملہ آور ہونے سے روکیں گے اور اس طرح وہ قریب کے کمزور مسلمانوں کا تحفظ کریں۔ یہ اور اس قسم کی دیگر صورتیں تالیف قلب کی ہیں جن پر زکوۃ کی رقم خرچ کی جاسکتی ہے چاہے مذکورہ افراد مال دار ہی ہوں۔ احناف کے نزدیک یہ مصرف ختم ہوگیا ہے لیکن یہ بات صحیح نہیں حالات وظروف کے مطابق ہر دور میں اس مصرف پر زکوۃ کی رقم خرچ کرنا جائز ہے۔\n5۔ گردنیں آزاد کرانے میں۔ بعض علماء نے اس سے صرف مکاتب غلام مراد لئے ہیں اور علماء نے مکاتب وغیر مکاتب ہر قسم کے غلام مراد لئے ہیں۔ امام شوکانی نے اسی رائے کو ترجیح دی ہے۔\n6۔ غارمین سے ایک تو وہ مقروض مراد ہیں جو اپنے اہل و عیال کے نان نفقہ اور ضروریات زندگی فراہم کرنے میں لوگوں کے زیر بار ہوگئے اور ان کے پاس نقد رقم بھی نہیں ہے اور ایسا سامان بھی نہیں ہے جسے بیچ کر وہ قرض ادا کریں سکیں۔ دوسرے وہ ذمہ داراصحاب ضمانت ہیں جنہوں نے کسی کی ضمانت دی اور پھر وہ اس کی ادائیگی کے ذمہ دار قرار پاگئے یا کسی فصل تباہ یا کاروبار خسارے کا شکار ہوگیا اور اس بنیاد پر وہ مقروض ہو گیا۔ ان سب افراد کی زکوۃ کی مد سے امداد کرنا جائز ہے۔\n7۔ فی سبیل اللہ سے مراد جہاد ہے یعنی جنگی سامان و ضروریات اور مجاہد (چا ہے وہ مالدار ہی ہو) پر زکٰوۃ کی رقم خرچ کرنا جائز ہے۔ اور احادیث میں آتا ہے کہ حج اور عمرہ بھی فی سبیل اللہ میں داخل ہے اسی طرح بعض علماء کے نزدیک تبلیغ ودعوت بھی فی سبیل اللہ میں داخل ہے کیونکہ اس سے بھی مقصد جہاد کی طرح اعلائے کلمۃ اللہ ہے۔\n8۔ ابن السبیل سے مراد مسافرہے۔ یعنی اگر کوئی مسافر، سفر میں مستحق امداد ہوگیا ہے چاہے وہ اپنے گھر یا وطن میں صاحب حیثیت ہی ہو، اس کی امداد زکٰو ۃ کی رقم سے کی جاسکتی ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"innamā al-ṣadaqātu lil'fuqarāi wal-masākīni wal-ʿāmilīna ʿalayhā wal-mu-alafati qulūbuhum wafī al-riqābi wal-ghārimīna wafī sabīli al-lahi wa-ib'ni al-sabīli farīḍatan mina al-lahi wal-lahu ʿalīmun ḥakīmun ","translations":["Only","the charities","(are) for the poor","and the needy","and those who collect","them","and the ones inclined","their hearts","and in","the (freeing of) the necks","and for those in debt","and in","(the) way","(of) Allah","and the wayfarer ","and the wayfarer ","an obligation","from","Allah","And Allah","(is) All-Knowing","All-Wise","(60)"],"transliterationArr":["innamā","al-ṣadaqātu","lil'fuqarāi","wal-masākīni","wal-ʿāmilīna","ʿalayhā","wal-mu-alafati","qulūbuhum","wafī","al-riqābi","wal-ghārimīna","wafī","sabīli","al-lahi","wa-ib'ni","al-sabīli","farīḍatan","mina","al-lahi","wal-lahu","ʿalīmun","ḥakīmun",null],"verseTiming":[[1,0,2019],[2,2019,3419],[3,3419,6499],[4,6499,8119],[5,8119,9789],[6,9789,10899],[7,10899,12679],[8,12679,14099],[9,14099,14509],[10,14509,15649],[11,15649,17499],[12,17499,18069],[13,18069,19309],[14,19309,19909],[15,19909,20549],[16,20549,23659],[17,23659,24889],[18,24889,25909],[19,25909,28999],[20,28999,30069],[21,30069,30989],[22,30989,34454]]}}