{"name":"9:65","price":"اگر آپ ان سے پوچھیں تو صاف کہہ دیں گے کہ ہم تو یونہی آپس میں ہنس بول رہے تھے۔ کہہ دیجئے کہ اللہ، اس کی آیتیں اور اس کا رسول ہی تمہارے ہنسی مذاق کے لئے ره گئے ہیں؟(1)","arabic":"وَلَئِن سَأَلۡتَهُمۡ لَيَقُولُنَّ إِنَّمَا كُنَّا نَخُوضُ وَنَلۡعَبُۚ قُلۡ أَبِٱللَّهِ وَءَايَٰتِهِۦ وَرَسُولِهِۦ كُنتُمۡ تَسۡتَهۡزِءُونَ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1300,"juzNumber":10,"footnotes":"(1) منافقین آیات الٰہی کا مذاق اڑاتے، مومنین کا استہزا کرتے حتیٰ کہ رسول اللہ (صلى الله عليه وسلم) کی شان میں گستاخانہ کلمات کہنے سے گریز نہ کرتے جس کی اطلاع کسی نہ کسی طریقے سے بعض مسلمانوں کو اور پھر رسول اللہ (صلى الله عليه وسلم) کو ہو جاتی۔ لیکن جب ان سے پوچھا جاتا تو صاف مکر جاتے اور کہتے کہ ہم تو یوں ہی ہنسی مذاق کر رہے تھے۔ اللہ تعالٰی نے فرمایا ہنسی مذاق کے لئے کیا تمہارے سامنے اللہ اور اس کی آیات و رسول ہی رہ گیا ہے؟ مطلب یہ ہے کہ اگر مقصد تمہارا آپس میں ہنسی مذاق کا ہوتا تو اس میں اللہ، اس کی آیات و رسول درمیان میں کیوں آتے، یہ یقینا تمہارے اس خبث اور نفاق کا اظہار ہے جو آیات الٰہی اور ہمارے پیغمبر کے خلاف تمہارے دلوں میں موجود ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wala-in sa-altahum layaqūlunna innamā kunnā nakhūḍu wanalʿabu qul abil-lahi waāyātihi warasūlihi kuntum tastahziūna ","translations":["And if","you ask them","surely they will say","Only","we were","conversing","and playing","Say","Is it Allah","and His Verses","and His Messenger","(that) you were","mocking","(65)"],"transliterationArr":["wala-in","sa-altahum","layaqūlunna","innamā","kunnā","nakhūḍu","wanalʿabu","qul","abil-lahi","waāyātihi","warasūlihi","kuntum","tastahziūna",null],"verseTiming":[[1,0,1770],[2,1770,3150],[3,3150,5230],[4,5230,7290],[5,7290,8920],[6,8920,9970],[7,9970,11040],[8,11040,11990],[9,11990,13390],[10,13390,15230],[11,15230,16870],[12,16870,18630],[13,18630,22505]]}}