{"name":"9:67","price":"تمام منافق مرد وعورت آپس میں ایک ہی ہیں(1) ، یہ بری باتوں کا حکم دیتے ہیں اور بھلی باتوں سے روکتے ہیں اور اپنی مٹھی بند رکھتے ہیں(2)، یہ اللہ کو بھول گئے اللہ نے انہیں بھلا دیا(3)۔ بیشک منافق ہی فاسق وبدکردار ہیں۔","arabic":"ٱلۡمُنَٰفِقُونَ وَٱلۡمُنَٰفِقَٰتُ بَعۡضُهُم مِّنۢ بَعۡضٖۚ يَأۡمُرُونَ بِٱلۡمُنكَرِ وَيَنۡهَوۡنَ عَنِ ٱلۡمَعۡرُوفِ وَيَقۡبِضُونَ أَيۡدِيَهُمۡۚ نَسُواْ ٱللَّهَ فَنَسِيَهُمۡۚ إِنَّ ٱلۡمُنَٰفِقِينَ هُمُ ٱلۡفَٰسِقُونَ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1302,"juzNumber":10,"footnotes":"(1) منافقین، جو حلف اٹھا کر مسلمان باور کراتے تھے کہ ”ہم تم ہی میں سے ہیں“، اللہ تعالٰی نے اس کی تردید فرمائی، کہ ایمان والوں سے ان کا کیا تعلق؟ البتہ یہ سب منافق، چاہے مرد ہوں یا عورتیں، ایک ہی ہیں، یعنی کفر ونفاق میں ایک دوسرے سے بڑھ کر ہیں۔ آگے ان کی صفات بیان کی جا رہی ہیں جو مومنین کی صفات کے بالکل الٹ اور برعکس ہیں۔\n(2) اس سے مراد بخل ہے۔ یعنی مومن کی صفت اللہ کی راہ میں خرچ کرنا اور منافق کی اس کے برعکس بخل، یعنی اللہ کی راہ میں خرچ کرنے سے گریز کرنا ہے۔\n(3) یعنی اللہ تعالٰی بھی ان سے ایسا معاملہ کرے گا کہ گویا اس نے انہیں بھلا دیا۔ جس طرح دوسرے مقام پر فرمایا: «الْيَوْمَ نَنْسَاكُمْ كَمَا نَسِيتُمْ لِقَاءَ يَوْمِكُمْ هَذَا» ( سورة الجاثية: 34) ”آج ہم تمہیں اس طرح بھلا دیں گے جس طرح تم ہماری ملاقات کے اس دن کو بھولے ہوئے تھے“، مطلب یہ کہ جس طرح انہوں نے دنیا میں اللہ کے احکامات کو چھوڑے رکھا۔ قیامت کے دن اللہ تعالٰی انہیں اپنے فضل و کرم سے محروم رکھے گا گویا نسیان کی نسبت اللہ تعالٰی کی طرف علم بلاغت کے اصول مشاکلت کے اعتبار سے ہے ورنہ اللہ کی ذات نسیان سے پاک ہے۔ (فتح القدیر)","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"al-munāfiqūna wal-munāfiqātu baʿḍuhum min baʿḍin yamurūna bil-munkari wayanhawna ʿani al-maʿrūfi wayaqbiḍūna aydiyahum nasū al-laha fanasiyahum inna al-munāfiqīna humu al-fāsiqūna ","translations":["The hypocrite men","and the hypocrite women","some of them","(are) of","others","They enjoin","the wrong","and forbid","what","(is) the right","and they close","their hands","They forget","Allah","so He has forgotten them","Indeed","the hypocrites","they (are)","the defiantly disobedient","(67)"],"transliterationArr":["al-munāfiqūna","wal-munāfiqātu","baʿḍuhum","min","baʿḍin","yamurūna","bil-munkari","wayanhawna","ʿani","al-maʿrūfi","wayaqbiḍūna","aydiyahum","nasū","al-laha","fanasiyahum","inna","al-munāfiqīna","humu","al-fāsiqūna",null],"verseTiming":[[1,0,2050],[2,2050,4030],[3,4030,4980],[4,4980,7270],[5,7270,8610],[6,8610,9810],[7,9810,12070],[8,12070,13400],[9,13400,13860],[10,13860,15230],[11,15230,16690],[12,16690,18580],[13,18580,19030],[14,19030,19910],[15,19910,21830],[16,21830,23110],[17,23110,24970],[18,24970,25430],[19,25430,28805]]}}