{"name":"9:70","price":"کیا انہیں اپنے سے پہلے لوگوں کی خبریں نہیں پہنچیں، قوم نوح اور عاد اور ﺛمود اور قوم ابراہیم اور اہل مدین اور اہل مؤتفکات (الٹی ہوئی بستیوں کے رہنے والے) کی(1) ، ان کے پاس ان کے پیغمبر دلیلیں لے کر پہنچے(2)، اللہ ایسا نہ تھا کہ ان پر ﻇلم کرے بلکہ انہوں نے خود ہی اپنے اوپر ﻇلم کیا۔(3)","arabic":"أَلَمۡ يَأۡتِهِمۡ نَبَأُ ٱلَّذِينَ مِن قَبۡلِهِمۡ قَوۡمِ نُوحٖ وَعَادٖ وَثَمُودَ وَقَوۡمِ إِبۡرَٰهِيمَ وَأَصۡحَٰبِ مَدۡيَنَ وَٱلۡمُؤۡتَفِكَٰتِۚ أَتَتۡهُمۡ رُسُلُهُم بِٱلۡبَيِّنَٰتِۖ فَمَا كَانَ ٱللَّهُ لِيَظۡلِمَهُمۡ وَلَٰكِن كَانُوٓاْ أَنفُسَهُمۡ يَظۡلِمُونَ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1305,"juzNumber":10,"footnotes":"(1) یہاں ان چھ قوموں کا حوالہ دیا گیا ہے۔ جن کا مسکن ملک شام رہا ہے۔ یہ بلاد عرب کے قریب ہے اور ان کی کچھ باتیں انہوں نے شاید آبا واجداد سے سنی بھی ہوں قوم، نوح، جو طوفان میں غرق کر دی گئی۔ قوم عاد جو قوت اور طاقت میں ممتاز ہونے کے باوجود، باد تند سے ہلاک کر دی گئی۔ قوم ثمود جسے آسمانی چیخ سے ہلاک کیا گیا قوم ابراہیم، جس کے بادشاہ نمرود بن کنعان بن کوش کو مچھر سے مروا دیا گیا۔ اصحاب مدین (حضرت شعیب عليه السلام کی قوم) جنہیں چیخ زلزلہ اور بادلوں کے سائے کے عذاب سے ہلاک کر دیا گیا اور اہل مؤتفکات۔ اس سے مراد قوم لوط ہے جن کی بستی کا نام 'سدوم' تھا ائتفاک کے معنی ہیں انقلاب الٹ پلٹ دینا۔ ان پر آسمان سے پتھر برسائے گئے۔ دوسرے ان کی بستی کو اوپر اٹھا کر نیچے پھینکا گیا جس سے پوری بستی اوپر نیچے ہوگئی اس اعتبار سے انہیں اصحاب مؤتفکات کہا جاتا ہے۔\n(2) ان سب قوموں کے پاس، ان کے پیغمبر، جو ان ہی کی قوم ایک فرد ہوتا تھا آئے۔ لیکن انہوں نے ان کی باتوں کو کوئی اہمیت نہیں دی، بلکہ تکذیب اور عناد کا راستہ اختیار کیا، جس کا نتیجہ بالآخر عذاب الٰہی کی شکل میں نکلا۔\n(3) یعنی یہ عذاب ان کے ظلم پر استمرار اور دوام کا نتیجہ ہے یوں ہی بلاوجہ عذاب الہٰی کا شکار نہیں ہوئے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"alam yatihim naba-u alladhīna min qablihim qawmi nūḥin waʿādin wathamūda waqawmi ib'rāhīma wa-aṣḥābi madyana wal-mu'tafikāti atathum rusuluhum bil-bayināti famā kāna al-lahu liyaẓlimahum walākin kānū anfusahum yaẓlimūna ","translations":["Has not","come to them","(the) news","(of) those who","(were) before them","(were) before them","(the) people","(of) Nuh","and Aad","and Thamud","and (the) people","(of) Ibrahim","and (the) companions","(of) Madyan","and the towns overturned","Came to them","their Messengers","with clear proofs","And not","was","Allah","to wrong them","but","they were (to)","themselves","doing wrong","(70)"],"transliterationArr":["alam","yatihim","naba-u","alladhīna","min","qablihim","qawmi","nūḥin","waʿādin","wathamūda","waqawmi","ib'rāhīma","wa-aṣḥābi","madyana","wal-mu'tafikāti","atathum","rusuluhum","bil-bayināti","famā","kāna","al-lahu","liyaẓlimahum","walākin","kānū","anfusahum","yaẓlimūna",null],"verseTiming":[[1,0,630],[2,630,1770],[3,1770,2350],[4,2350,3360],[5,3360,4720],[6,4720,5760],[7,5760,6490],[8,6490,7880],[9,7880,9510],[10,9510,10630],[11,10630,11470],[12,11470,12990],[13,12990,14310],[14,14310,15230],[15,15230,19070],[16,19070,20100],[17,20100,21930],[18,21930,26360],[19,26360,26910],[20,26910,27590],[21,27590,28610],[22,28610,30210],[23,30210,32460],[24,32460,34930],[25,34930,36940],[26,36940,40525]]}}