{"name":"9:71","price":"مومن مرد وعورت آپس میں ایک دوسرے کے (مددگار ومعاون اور) دوست ہیں(1) ، وه بھلائیوں کا حکم دیتے ہیں اور برائیوں سے روکتے ہیں(2)، نمازوں کو پابندی سے بجا ﻻتے ہیں زکوٰة ادا کرتے ہیں، اللہ کی اور اس کے رسول کی بات مانتے ہیں(3)، یہی لوگ ہیں جن پر اللہ تعالیٰ بہت جلد رحم فرمائے گا بیشک اللہ غلبے واﻻ حکمت واﻻ ہے۔","arabic":"وَٱلۡمُؤۡمِنُونَ وَٱلۡمُؤۡمِنَٰتُ بَعۡضُهُمۡ أَوۡلِيَآءُ بَعۡضٖۚ يَأۡمُرُونَ بِٱلۡمَعۡرُوفِ وَيَنۡهَوۡنَ عَنِ ٱلۡمُنكَرِ وَيُقِيمُونَ ٱلصَّلَوٰةَ وَيُؤۡتُونَ ٱلزَّكَوٰةَ وَيُطِيعُونَ ٱللَّهَ وَرَسُولَهُۥٓۚ أُوْلَٰٓئِكَ سَيَرۡحَمُهُمُ ٱللَّهُۗ إِنَّ ٱللَّهَ عَزِيزٌ حَكِيمٞ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1306,"juzNumber":10,"footnotes":"(1) منافقین کی صفات مذمومہ کے مقابلے مومنین کی صفات محمودہ کا ذکر ہو رہا ہے پہلی صفت وہ ایک دوسرے کے دوست، معاون و غم خوار ہیں جس طرح حدیث میں ہے: «الْمُؤْمِنُ لِلْمُؤْمِنِ كَالْبُنْيَانِ يَشُدُّ بَعْضُهُ بَعْضًا»( صحيح بخاري- كتاب الصلاة ، باب تشبيك الأصابع في المسجد وغيره- مسلم، باب تراحم المؤمنين وتعاطفهم وتعاضدهم) ”مومن مومن کے لیے ایک دیوار کی طرح ہے جس کی ایک اینٹ دوسری اینٹ کی مضبوطی کا ذریعہ ہے“۔ دوسری حدیث میں فرمایا:«مَثَلُ الْمُؤْمِنِينَ فِي تَوَادِّهِمْ وَتَرَاحُمِهِمْ، كَمَثَلِ الْجَسَدِ الْوَاحِدِ إِذَا اشْتَكَى مِنْه عُضْوٌ ، تَدَاعَى لَه سَائِرُ الْجَسَدِ بِالْحُمّى وَالسَّهَرِ»، ( صحيح مسلم، باب مذكور، والبخاري - كتاب الأدب، باب رحمة الناس والبهائم) ”مومنوں کی مثال، آپس میں ایک دوسرے کے ساتھ محبت کرنے اور رحم کرنے میں ایک جسم کی طرح ہے جب جسم کے ایک عضو کو تکلیف ہوتی ہے تو سارا جسم تپ کا شکار ہو جاتا ہے اور بیدار رہتا ہے“۔\n(2) یہ اہل ایمان کی دوسری خاص صفت ہے معروف وہ ہے جسے شریعت نے معروف (یعنی نیکی اور بھلائی) اور منکر وہ ہے جسے شریعت نے منکر (یعنی برا) قرار دیا ہے۔ نہ کہ وہ جسے لوگ اچھا یا برا کہیں۔\n(3) نماز، حقوق اللہ میں نمایاں ترین عبادت ہے اور زکٰوۃ حقوق العباد کے لحاظ سے، امتیازی حیثیت رکھتی ہے۔ اس لئے ان دونوں کا بطور خاص تذکرہ کر کے فرما دیا گیا کہ وہ ہر معاملے میں اللہ اور رسول کی اطاعت کرتے ہیں۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wal-mu'minūna wal-mu'minātu baʿḍuhum awliyāu baʿḍin yamurūna bil-maʿrūfi wayanhawna ʿani al-munkari wayuqīmūna al-ṣalata wayu'tūna al-zakata wayuṭīʿūna al-laha warasūlahu ulāika sayarḥamuhumu al-lahu inna al-laha ʿazīzun ḥakīmun ","translations":["And the believing men","and the believing women","some of them","(are) allies","(of) others","They enjoin","the right","and forbid","from","the wrong","and they establish","the prayer","and give","the zakah","and they obey","Allah","and His Messenger","Those","Allah will have mercy on them","Allah will have mercy on them","Indeed","Allah","(is) All-Mighty","All-Wise","(71)"],"transliterationArr":["wal-mu'minūna","wal-mu'minātu","baʿḍuhum","awliyāu","baʿḍin","yamurūna","bil-maʿrūfi","wayanhawna","ʿani","al-munkari","wayuqīmūna","al-ṣalata","wayu'tūna","al-zakata","wayuṭīʿūna","al-laha","warasūlahu","ulāika","sayarḥamuhumu","al-lahu","inna","al-laha","ʿazīzun","ḥakīmun",null],"verseTiming":[[1,0,1890],[2,1890,3660],[3,3660,4760],[4,4760,7999],[5,7999,8699],[6,8699,10639],[7,10639,12199],[8,12199,13489],[9,13489,13929],[10,13929,15919],[11,15919,17359],[12,17359,18609],[13,18609,19829],[14,19829,21079],[15,21079,22569],[16,22569,23539],[17,23539,25459],[18,25459,28019],[19,28019,29579],[20,29579,32729],[21,32729,33969],[22,33969,34899],[23,34899,35989],[24,35989,39064]]}}