{"name":"9:73","price":"اے نبی! کافروں اور منافقوں سے جہاد جاری رکھو(1) ، اور ان پر سخت ہو جاؤ(2) ان کی اصلی جگہ دوزخ ہے، جو نہایت بدترین جگہ ہے۔(3)","arabic":"يَٰٓأَيُّهَا ٱلنَّبِيُّ جَٰهِدِ ٱلۡكُفَّارَ وَٱلۡمُنَٰفِقِينَ وَٱغۡلُظۡ عَلَيۡهِمۡۚ وَمَأۡوَىٰهُمۡ جَهَنَّمُۖ وَبِئۡسَ ٱلۡمَصِيرُ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1308,"juzNumber":10,"footnotes":"(1) اس آیت میں نبی کریم (صلى الله عليه وسلم) کو کفار اور منافقین سے جہاد اور ان پر سختی کرنے کا حکم دیا جا رہا ہے نبی (صلى الله عليه وسلم) کے بعد اس کے مخاطب آپ (صلى الله عليه وسلم) کی امت ہے، کافروں کے ساتھ منافقین سے بھی جہاد کرنے کا حکم ہے، اس کی بابت اختلاف ہے۔ ایک رائے تو یہی ہے کہ اگر منافقین کا نفاق اور ان کی سازشیں بےنقاب ہوجائیں تو ان سے بھی اس طرح جہاد کیا جائے، جس طرح کافروں سے کیا جاتا ہے۔ دوسری رائے یہ ہے کہ منافقین سے جہاد یہ ہے کہ انہیں زبان سے وعظ ونصیحت کی جائے۔ یا وہ اخلاقی جرائم کارتکاب کریں تو ان پر حدود نافذ کی جائیں تیسری رائے یہ ہے کہ جہاد کا حکم کفار سے متعلق ہے اور سختی کرنے کا منافقین سے امام ابن کثیر فرماتے ہیں ان آراء میں آپس میں کوئی تضاد اور منافات نہیں اس لیے کہ حالات و ظروف کے مطابق ان میں سے کسی بھی رائے پر عمل کرناجائز ہے۔\n(2) ”غِلظَة“ رَأفة کی ضد ہے، جس کے معنی نرمی اور شفقت کرنے کے ہیں۔ اس اعتبار سے غلظۃ کے معنی سختی اور قوت سے دشمنوں کے خلاف اقدام ہے۔ محض زبان کی سختی مراد نہیں ہے۔ اس لئے کہ وہ تو نبی کریم (صلى الله عليه وسلم) کے اخلاق کریمانہ کے ہی خلاف ہے، اسے آپ (صلى الله عليه وسلم) اختیار کر سکتے تھے نہ اللہ تعالٰی کی طرف سے اس کا حکم آپ کو مل سکتا تھا۔\n(3) جہاد اور سختی کے حکم کا تعلق دنیا سے ہے۔ آخرت میں ان کے لئے جہنم ہے جو بدترین جگہ ہے۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yāayyuhā al-nabiyu jāhidi al-kufāra wal-munāfiqīna wa-ugh'luẓ ʿalayhim wamawāhum jahannamu wabi'sa al-maṣīru ","translations":["O Prophet","O Prophet","Strive (against)","the disbelievers","and the hypocrites","and be stern","with them","And their abode","(is) Hell","and wretched","(is) the destination","(73)"],"transliterationArr":["yāayyuhā","al-nabiyu","jāhidi","al-kufāra","wal-munāfiqīna","wa-ugh'luẓ","ʿalayhim","wamawāhum","jahannamu","wabi'sa","al-maṣīru",null],"verseTiming":[[1,0,3050],[2,3050,5150],[3,5150,6120],[4,6120,7560],[5,7560,9530],[6,9530,10360],[7,10360,12100],[8,12100,13660],[9,13660,15570],[10,15570,16320],[11,16320,19855]]}}