{"name":"9:74","price":"یہ اللہ کی قسمیں کھا کر کہتے ہیں کہ انہوں نے نہیں کہا، حاﻻنکہ یقیناً کفر کا کلمہ ان کی زبان سے نکل چکا ہے اور یہ اپنے اسلام کے بعد کافر ہوگئے ہیں(1) اور انہوں نے اس کام کا قصد بھی کیا جو پورا نہ کر سکے(2)۔ یہ صرف اسی بات کا انتقام لے رہے ہیں کہ انہیں اللہ نے اپنے فضل سے اور اس کے رسول ﴿صلی اللہ علیہ وسلم﴾ نے دولت مند کردیا(3)، اگر یہ اب بھی توبہ کر لیں تو یہ ان کے حق میں بہتر ہے، اور اگر منھ موڑے رہیں تو اللہ تعالیٰ انہیں دنیا وآخرت میں دردناک عذاب دے گا اور زمین بھر میں ان کا کوئی حمایتی اور مددگار نہ کھڑا ہوگا۔","arabic":"يَحۡلِفُونَ بِٱللَّهِ مَا قَالُواْ وَلَقَدۡ قَالُواْ كَلِمَةَ ٱلۡكُفۡرِ وَكَفَرُواْ بَعۡدَ إِسۡلَٰمِهِمۡ وَهَمُّواْ بِمَا لَمۡ يَنَالُواْۚ وَمَا نَقَمُوٓاْ إِلَّآ أَنۡ أَغۡنَىٰهُمُ ٱللَّهُ وَرَسُولُهُۥ مِن فَضۡلِهِۦۚ فَإِن يَتُوبُواْ يَكُ خَيۡرٗا لَّهُمۡۖ وَإِن يَتَوَلَّوۡاْ يُعَذِّبۡهُمُ ٱللَّهُ عَذَابًا أَلِيمٗا فِي ٱلدُّنۡيَا وَٱلۡأٓخِرَةِۚ وَمَا لَهُمۡ فِي ٱلۡأَرۡضِ مِن وَلِيّٖ وَلَا نَصِيرٖ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1309,"juzNumber":10,"footnotes":"(1) مفسرین نے اس کی تفسیر میں متعدد واقعات نقل کئے ہیں، جن میں منافقین نے رسول اللہ (صلى الله عليه وسلم) کی شان میں گستاخانہ کلمات کہے جسے بعض مسلمانوں نے سن لیا اور انہوں نے آکر نبی (صلى الله عليه وسلم) کو بتلایا، لیکن آپ کے استفسار پر مکر گئے بلکہ حلف تک اٹھا لیا کہ انہوں نے ایسی بات نہیں کی۔ جس پر یہ آیت اتری۔ اس سے بھی معلوم ہوا کہ نبی (صلى الله عليه وسلم) کی شان میں گستاخی کرنا کفر ہے نبی (صلى الله عليه وسلم) کی شان میں گستاخی کرنے والا مسلمان نہیں رہ سکتا۔\n(2) اس کی بابت بھی بعض واقعات نقل کئے گئے ہیں۔ مثلاً تبوک کی واپسی پر منافقین نے رسول اللہ (صلى الله عليه وسلم) کے خلاف ایک سازش کی جس میں وہ کامیاب نہیں ہو سکے کہ دس بارہ منافقین ایک گھاٹی میں آپ کے پیچھے لگ گئے جہاں رسول اللہ (صلى الله عليه وسلم) باقی لشکر سے الگ تقریباً تنہا گزر رہے تھے ان کا منصوبہ یہ تھا کہ آپ پر حملہ کر کے آپ کا کام تمام کر دیں گے اس کی اطلاع وحی کے ذریعے سے آپ کو دے دی گئی جس سے آپ نے بچاؤ کر لیا۔\n(3) مسلمانوں کی ہجرت کے بعد، مدینہ کو مرکزی حیثیت حاصل ہوگئی تھی، جس کی وجہ سے وہاں تجارت اور کاروبار کو بھی فروغ ملا، اور اہل مدینہ کی معاشی حالت بہت اچھی ہوگئی تھی۔ منافقین مدینہ کو بھی اس کا خوب فائدہ حاصل ہوا اللہ تعالٰی اس آیت میں یہی فرما رہا ہے کہ کیا ان کو اس بات کی ناراضگی ہے کہ اللہ نے ان کو اپنے فضل سے غنی بنا دیا ہے، بلکہ ان کو تو اللہ تعالٰی کا شکر گزار ہونا چاہیے کہ اس نے انہیں تنگ دستی سے نکال کر خوش حال بنا دیا۔\nملحوظہ: اللہ تعالیٰ کے ساتھ رسول اللہ (صلى الله عليه وسلم) کا ذکر اس لئے ہے کہ اس غنا اور تونگری کا ظاہری سبب رسول اللہ (صلى الله عليه وسلم) کی ذات گرامی ہی بنی تھی، ورنہ حقیقت میں غنی بنانے والا تو اللہ تعالیٰ ہے تھا۔ اس لئے آیت میں من فضلہ، واحد کی ضمیر ہے کہ اللہ نے اپنے فضل سے انہیں غنی کردیا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yaḥlifūna bil-lahi mā qālū walaqad qālū kalimata al-kuf'ri wakafarū baʿda is'lāmihim wahammū bimā lam yanālū wamā naqamū illā an aghnāhumu al-lahu warasūluhu min faḍlihi fa-in yatūbū yaku khayran lahum wa-in yatawallaw yuʿadhib'humu al-lahu ʿadhāban alīman fī al-dun'yā wal-ākhirati wamā lahum fī al-arḍi min waliyyin walā naṣīrin ","translations":["They swear","by Allah","(that) they said nothing","(that) they said nothing","while certainly","they said","(the) word","(of) the disbelief","and disbelieved","after","their (pretense of) Islam","and planned","[of] what","not","they could attain","And not","they were resentful","except","that","Allah had enriched them","Allah had enriched them","and His Messenger","of","His Bounty","So if","they repent","it is","better","for them","and if","they turn away","Allah will punish them","Allah will punish them","(with) a punishment","painful","in","the world","and (in) the Hereafter","And not","for them","in","the earth","any","protector","and not","a helper","(74)"],"transliterationArr":["yaḥlifūna","bil-lahi","mā","qālū","walaqad","qālū","kalimata","al-kuf'ri","wakafarū","baʿda","is'lāmihim","wahammū","bimā","lam","yanālū","wamā","naqamū","illā","an","aghnāhumu","al-lahu","warasūluhu","min","faḍlihi","fa-in","yatūbū","yaku","khayran","lahum","wa-in","yatawallaw","yuʿadhib'humu","al-lahu","ʿadhāban","alīman","fī","al-dun'yā","wal-ākhirati","wamā","lahum","fī","al-arḍi","min","waliyyin","walā","naṣīrin",null],"verseTiming":[[1,0,1420],[2,1420,2570],[3,2570,2940],[4,2940,4000],[5,4000,4730],[6,4730,5710],[7,5710,6630],[8,6630,7500],[9,7500,8640],[10,8640,9280],[11,9280,10890],[12,10890,12940],[13,12940,13710],[14,13710,14100],[15,14100,15440],[16,15440,16720],[17,16720,18800],[18,18800,20250],[19,20250,21480],[20,21480,21910],[21,21910,23220],[22,23220,24240],[23,24240,25770],[24,25770,26280],[25,26280,28590],[26,28590,29730],[27,29730,30940],[28,30940,31460],[29,31460,32140],[30,32140,33470],[31,33470,34830],[32,34830,36130],[33,36130,37660],[34,37660,38620],[35,38620,39780],[36,39780,41670],[37,41670,41930],[38,41930,43130],[39,43130,45180],[40,45180,45840],[41,45840,46470],[42,46470,46740],[43,46740,47660],[44,47660,48660],[45,48660,50460],[46,50460,51100],[47,51100,53895]]}}