{"name":"9:80","price":"ان کے لئے تو استغفار کر یا نہ کر۔ اگر تو ستر مرتبہ بھی ان کے لئے استغفار کرے تو بھی اللہ انہیں ہرگز نہ بخشے گا(1) یہ اس لئے کہ انہوں نے اللہ سے اور اس کے رسول سے کفر کیا(2) ایسے فاسق لوگوں کو رب کریم ہدایت نہیں دیتا۔(3)","arabic":"ٱسۡتَغۡفِرۡ لَهُمۡ أَوۡ لَا تَسۡتَغۡفِرۡ لَهُمۡ إِن تَسۡتَغۡفِرۡ لَهُمۡ سَبۡعِينَ مَرَّةٗ فَلَن يَغۡفِرَ ٱللَّهُ لَهُمۡۚ ذَٰلِكَ بِأَنَّهُمۡ كَفَرُواْ بِٱللَّهِ وَرَسُولِهِۦۗ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلۡفَٰسِقِينَ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1315,"juzNumber":10,"footnotes":"(1) ستر کا عدد مبالغے اور تکثیر کے لئے ہے۔ یعنی تو کتنی ہی کثرت سے ان کے لئے استغفار کر لے اللہ تعالٰی انہیں ہرگز معاف نہیں فرمائے گا۔ یہ مطلب نہیں ہے کہ ستر مرتبہ سے زائد استغفار کرنے پر ان کو معافی مل جائے گی۔\n(2) یہ عدم مغفرت کی علت بیان کر دی گئی ہے تاکہ لوگ کسی کی سفارش کی امید پر نہ رہیں بلکہ ایمان اور عمل صالح کی پونجی لے کر اللہ کی بارگاہ میں حاضر ہوں۔ اگر یہ زاد آخرت کسی کے پاس نہیں ہوگا تو ایسے کافروں اور نافرمانوں کی کوئی شفاعت ہی نہیں کرے گا، اس لئے اللہ تعالٰی ایسے لوگوں کے لئے شفاعت کی اجازت ہی نہیں دے گا۔\n(3) اس ہدایت سے مراد وہ ہدایت ہے جو انسان کو مطلوب (ایمان) تک پہنچا دیتی ہے ورنہ ہدایت بمعنی رہنمائی یعنی راستے کی نشان دہی۔ اس کا اہتمام تو دنیا میں ہر مومن و کافر کے لیے کر دیا گیا ہے «اِنَّا هَدَيْنٰهُ السَّبِيْلَ اِمَّا شَاكِرًا وَّاِمَّا كَفُوْرًا» (الدہر: 3) «وَهَدَيْنَاهُ النَّجْدَيْنِ» (البلد: 10) ”اور ہم نے اس کو (خیروشر کے) کے دونوں راستے دکھا دیئے ہیں“۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"is'taghfir lahum aw lā tastaghfir lahum in tastaghfir lahum sabʿīna marratan falan yaghfira al-lahu lahum dhālika bi-annahum kafarū bil-lahi warasūlihi wal-lahu lā yahdī al-qawma al-fāsiqīna ","translations":["Ask forgiveness","for them","or","(do) not","ask forgiveness","for them","If","you ask forgiveness","for them","seventy","times","never","will Allah forgive","will Allah forgive","[for] them","That","(is) because they","disbelieved","in Allah","and His Messenger","and Allah","(does) not","guide","the people","the defiantly disobedient","(80)"],"transliterationArr":["is'taghfir","lahum","aw","lā","tastaghfir","lahum","in","tastaghfir","lahum","sabʿīna","marratan","falan","yaghfira","al-lahu","lahum","dhālika","bi-annahum","kafarū","bil-lahi","warasūlihi","wal-lahu","lā","yahdī","al-qawma","al-fāsiqīna",null],"verseTiming":[[1,0,1270],[2,1270,2070],[3,2070,2460],[4,2460,2910],[5,2910,4200],[6,4200,4910],[7,4910,6190],[8,6190,7430],[9,7430,8150],[10,8150,9290],[11,9290,11130],[12,11130,11730],[13,11730,13370],[14,13370,14240],[15,14240,15510],[16,15510,16420],[17,16420,18440],[18,18440,19350],[19,19350,20520],[20,20520,22300],[21,22300,23370],[22,23370,23860],[23,23860,24560],[24,24560,25430],[25,25430,29615]]}}