{"name":"9:92","price":"ہاں ان پر بھی کوئی حرج نہیں جو آپ کے پاس آتے ہیں کہ آپ انہیں سواری مہیا کر دیں تو آپ جواب دیتے ہیں کہ میں تو تمہاری سواری کے لئے کچھ بھی نہیں پاتا، تو وه رنج وغم سے اپنی آنکھوں سے آنسو بہاتے ہوئے لوٹ جاتے ہیں کہ انہیں خرچ کرنے کے لئے کچھ بھی میسر نہیں۔(1)","arabic":"وَلَا عَلَى ٱلَّذِينَ إِذَا مَآ أَتَوۡكَ لِتَحۡمِلَهُمۡ قُلۡتَ لَآ أَجِدُ مَآ أَحۡمِلُكُمۡ عَلَيۡهِ تَوَلَّواْ وَّأَعۡيُنُهُمۡ تَفِيضُ مِنَ ٱلدَّمۡعِ حَزَنًا أَلَّا يَجِدُواْ مَا يُنفِقُونَ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1327,"juzNumber":10,"footnotes":"(1) یہ مسلمانوں کے ایک دوسرے گروہ کا ذکر ہے جن کے پاس اپنی سواریاں بھی نہیں تھیں اور نبی (صلى الله عليه وسلم) نے بھی انہیں سواریاں پیش کرنے سے معذرت کی جس پر انہیں اتنا صدمہ ہوا کہ بے اختیار ان کی آنکھوں سے آنسو رواں ہوگئے، گویا مخلص مسلمان جو کسی بھی لحاظ سے معقول عذر رکھتے تھے اللہ تعالٰی نے جو ہر ظاہر باطن سے باخبر ہے ان کو جہاد میں شرکت سے مستثنٰی کر دیا۔ بلکہ حدیث میں آتا ہے کہ نبی (صلى الله عليه وسلم) نے ان معذورین کے بارے میں جہاد میں شریک لوگوں سے فرمایا کہ ”تمہارے پیچھے مدینے میں کچھ لوگ ایسے بھی ہیں کہ تم جس وادی کو بھی طے کرتے ہو اور جس راستے پر چلتے ہو، تمہارے ساتھ وہ اجر میں برابر کے شریک ہیں“ صحابہ کرام (رضي الله عنهم) نے پوچھا۔ یہ کیوں کر ہو سکتا ہے جب کہ وہ مدینے میں بیٹھے ہیں؟ آپ (صلى الله عليه وسلم) نے فرمایا حَبَسَهُمُ الْعُذْرُ ( صحيح البخاري كتاب الجهاد، باب من حبسه العذر عن الغزو- وصحيح مسلم، كتاب الإمارة باب ثواب من حبسه عن الغزو مرض ....) ”عذر نے ان کو وہاں روک دیا ہے“۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walā ʿalā alladhīna idhā mā atawka litaḥmilahum qul'ta lā ajidu mā aḥmilukum ʿalayhi tawallaw wa-aʿyunuhum tafīḍu mina al-damʿi ḥazanan allā yajidū mā yunfiqūna ","translations":["And not","on","those who","when","when","they came to you","that you provide them with mounts","you said","Not","I find","what","to mount you","on [it]","They turned back","with their eyes","flowing","[of]","(with) the tears","(of) sorrow","that not","they find","what","they (could) spend","(92)"],"transliterationArr":["walā","ʿalā","alladhīna","idhā","mā","atawka","litaḥmilahum","qul'ta","lā","ajidu","mā","aḥmilukum","ʿalayhi","tawallaw","wa-aʿyunuhum","tafīḍu","mina","al-damʿi","ḥazanan","allā","yajidū","mā","yunfiqūna",null],"verseTiming":[[1,0,620],[2,620,1060],[3,1060,2140],[4,2140,2890],[5,2890,3240],[6,3240,5419],[7,5419,7069],[8,7069,7699],[9,7699,9429],[10,9429,10169],[11,10169,11659],[12,11659,12919],[13,12919,13869],[14,13869,14969],[15,14969,16719],[16,16719,18269],[17,18269,19169],[18,19169,19529],[19,19529,20469],[20,20469,21389],[21,21389,22269],[22,22269,23159],[23,23159,23619],[24,23619,27884]]}}