{"name":"9:96","price":"یہ اس لیے قسمیں کھائیں گے کہ تم ان سے راضی ہوجاؤ۔ سو اگر تم ان سے راضی بھی ہوجاؤ تو اللہ تعالیٰ تو ایسے فاسق لوگوں سے راضی نہیں ہوتا۔(1)","arabic":"يَحۡلِفُونَ لَكُمۡ لِتَرۡضَوۡاْ عَنۡهُمۡۖ فَإِن تَرۡضَوۡاْ عَنۡهُمۡ فَإِنَّ ٱللَّهَ لَا يَرۡضَىٰ عَنِ ٱلۡقَوۡمِ ٱلۡفَٰسِقِينَ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1331,"juzNumber":11,"footnotes":"(1) ان تین آیات میں ان منافقین کا ذکر ہے جو تبوک کے سفر میں مسلمانوں کے ساتھ نہیں گئے تھے نبی (صلى الله عليه وسلم) اور مسلمانوں کو بخیریت واپسی پر اپنے عذر پیش کرکے ان کی نظروں میں وفادار بننا چاہتے تھے۔ اللہ تعالٰی نے فرمایا جب ان کے پاس آؤ گے تو یہ عذر پیش کریں گے، تم ان سے کہہ دو، کہ ہمارے سامنے عذر پیش کرنے کی ضرورت نہیں ہے اس لئے کہ اللہ تعالٰی نے تمہارے اصل حالات سے ہمیں باخبر کر دیا ہے۔ اب تمہارے جھوٹے عذروں کا ہم اعتبار کس طرح کر سکتے ہیں؟ البتہ ان عذروں کی حقیقت مستقبل قریب میں مزید واضح ہو جائے گی، تمہارا عمل، جسے اللہ تعالٰی بھی دیکھ رہا ہے اور رسول (صلى الله عليه وسلم) کی نظر بھی اس پر ہے، تمہارے عذروں کی حقیقت کو خود بے نقاب کر دے گا۔ اور اگر تم رسول اللہ (صلى الله عليه وسلم) اور مسلمانوں کو پھر بھی فریب اور مغالطہ دینے میں کامیاب رہے تو بالآخر ایک وقت وہ تو آئے گا ہی، جب تم ایسی ذات کی بارگاہ مین حاضر کئے جاؤگے جو ظاہر و باطن ہر چیز کو خوب جانتی ہے۔ اسے تو تم بہر صورت دھوکہ نہیں دے سکتے، وہ اللہ تمہارا سارا کچا چٹھا تمہارے سامنے کھول کر رکھ دے گا۔ دوسری آیت میں فرمایا کہ تمہارے لوٹنے پر یہ قسمیں کھائیں گے تاکہ تم ان سے اعراض یعنی درگزر کردو۔ پس تم انہیں ان کی حالت پر چھوڑ دو۔ یہ لوگ اپنے عقائد و اعمال کے لحاظ سے پلید ہیں، انہوں نے جو کچھ کیا ہے۔ اس کا بدلہ جہنم ہی ہے۔ تیسری آیت میں فرمایا یہ تمہیں راضی کرنے کے لئے قسمیں کھائیں گے۔ لیکن ان نادانوں کو یہ پتہ نہیں کہ اگر تم ان سے راضی ہو بھی جاؤ تو انہوں نے جس فسق یعنی اطاعت الٰہی سے گریز وفرار کا راستہ اختیار کیا ہے اس کی موجودگی میں اللہ تعالٰی ان سے راضی کیونکر ہو سکتا ہے؟۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"yaḥlifūna lakum litarḍaw ʿanhum fa-in tarḍaw ʿanhum fa-inna al-laha lā yarḍā ʿani al-qawmi al-fāsiqīna ","translations":["They swear","to you","that you may be pleased","with them","But if","you are pleased","with them","then indeed","Allah","(is) not pleased","(is) not pleased","with","the people","(who are) defiantly disobedient","(96)"],"transliterationArr":["yaḥlifūna","lakum","litarḍaw","ʿanhum","fa-in","tarḍaw","ʿanhum","fa-inna","al-laha","lā","yarḍā","ʿani","al-qawmi","al-fāsiqīna",null],"verseTiming":[[1,0,1260],[2,1260,2040],[3,2040,3190],[4,3190,4720],[5,4720,6190],[6,6190,7140],[7,7140,8070],[8,8070,9530],[9,9530,10400],[10,10400,10980],[11,10980,11930],[12,11930,12320],[13,12320,13310],[14,13310,17035]]}}