{"name":"9:97","price":"دیہاتی لوگ کفر اور نفاق میں بہت ہی سخت ہیں(1) اور ان کو ایسا ہونا ہی چاہئے کہ ان کو ان احکام کا علم نہ ہو جو اللہ تعالیٰ نے اپنے رسول پر نازل فرمائے(2) ہیں اور اللہ بڑا علم واﻻ بڑی حکمت واﻻ ہے۔","arabic":"ٱلۡأَعۡرَابُ أَشَدُّ كُفۡرٗا وَنِفَاقٗا وَأَجۡدَرُ أَلَّا يَعۡلَمُواْ حُدُودَ مَآ أَنزَلَ ٱللَّهُ عَلَىٰ رَسُولِهِۦۗ وَٱللَّهُ عَلِيمٌ حَكِيمٞ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1332,"juzNumber":11,"footnotes":"(1) مذکورہ آیات میں ان منافقین کا تذکرہ تھا جو مدینہ شہر میں رہائش پذیر تھے۔ اور کچھ منافقین وہ بھی تھے جو بادیہ نشین یعنی مدینہ کے باہر دیہاتوں میں رہتے تھے، دیہات کے ان باشندوں کو اعراب کہا جاتا ہے جو اعرابی کی جمع ہے شہریوں کے اخلاق و کردار میں درشتی اور کھردراپن زیادہ پایا جاتا ہے اس طرح ان میں جو کافر اور منافق تھے وہ کفر و نفاق میں بھی شہریوں سے زیادہ سخت اور احکام شریعت سے زیادہ بےخبر تھے اس آیت میں انہی کا تذکرہ اور انکے اسی کردار کی وضاحت ہے۔ بعض احادیث سے بھی ان کے کردار پر روشنی پڑتی ہے۔ مثلًا ایک موقع پر کچھ اعرابی رسول اللہ (صلى الله عليه وسلم) کی خدمت میں حاضر ہوئے اور انہوں نے پوچھا «اَتُقَبْلُوْنَ صِبْیَانکُمْ»، ”کیا تم اپنے بچے کو بوسہ دیتے ہو؟“، صحابہ (رضي الله عنهم) نے عرض کیا ”ہاں“ انہوں نے کہا ”واللہ! ہم تو بوسہ نہیں دیتے“ رسول اللہ (صلى الله عليه وسلم) نے سن کر فرمایا ”اگر اللہ نے تمہارے دلوں میں سے رحم و شفقت کا جذبہ نکال دیا ہے تو میرا اس میں کیا اختیار ہے؟“۔ (صحیح بخاری کتاب الأدب، باب رحمة الولد وتقبیله ومعانقته۔ صحیح مسلم، کتاب الفضائل، باب رحمته صلى الله عليه وسلم الصبیان والعیال)\n(2) اس کی وجہ یہ ہے کہ چوں کہ وہ شہر سے دور رہتے ہیں اور اللہ اور رسول (صلى الله عليه وسلم) کی باتیں سننے کا اتفاق ان کو نہیں ہوتا۔","lang":"ur","version":{"key":"urdu_junagarhi","direction":"rtl","language_iso_code":"ur","version":"1.1.2","last_update":1638182859,"title":"Urdu Translation","description":"Translation of the Quran meanings into Urdu by Muhammad Ibrahim Gunakry. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"al-aʿrābu ashaddu kuf'ran wanifāqan wa-ajdaru allā yaʿlamū ḥudūda mā anzala al-lahu ʿalā rasūlihi wal-lahu ʿalīmun ḥakīmun ","translations":["The bedouins","(are) stronger","(in) disbelief","and hypocrisy","and more likely","that not","they know","(the) limits","(of) what","Allah (has) revealed","Allah (has) revealed","to","His Messenger","And Allah","(is) All-Knower","All-Wise","(97)"],"transliterationArr":["al-aʿrābu","ashaddu","kuf'ran","wanifāqan","wa-ajdaru","allā","yaʿlamū","ḥudūda","mā","anzala","al-lahu","ʿalā","rasūlihi","wal-lahu","ʿalīmun","ḥakīmun",null],"verseTiming":[[1,0,1640],[2,1640,2590],[3,2590,4350],[4,4350,5650],[5,5650,7300],[6,7300,8190],[7,8190,9310],[8,9310,10320],[9,10320,12090],[10,12090,13670],[11,13670,14690],[12,14690,15370],[13,15370,17020],[14,17020,18100],[15,18100,19220],[16,19220,21545]]}}