{"name":"38:44","price":"44. « Prends donc, (ô Job), un faisceau de brindilles, frappes-en (ta femme) et ne te parjure point ! »[447] Nous l’avons trouvé patient à la peine. Et quel excellent serviteur ! Il aimait tant à se repentir.","arabic":"وَخُذۡ بِيَدِكَ ضِغۡثٗا فَٱضۡرِب بِّهِۦ وَلَا تَحۡنَثۡۗ إِنَّا وَجَدۡنَٰهُ صَابِرٗاۚ نِّعۡمَ ٱلۡعَبۡدُ إِنَّهُۥٓ أَوَّابٞ","category":["38 (Sad)","Sad","Surah Sad","Chapter Sad","Surah 38","Chapter 38","Saad","ص"],"ayahNumber":4014,"juzNumber":23,"footnotes":"[447] Selon Ibn Kathîr, Job avait juré de donner cent coups de fouet à sa femme aussitôt qu’il serait guéri, car elle lui avait désobéi. Ce verset montre bien que, contrairement aux allégations tendancieuses selon lesquelles le Coran incite à battre les femmes, il ne s’agit en vérité que de corrections légères et symboliques, que l’homme utilise d’ailleurs en dernier recours. Allah n’a pas ordonné à Job d’utiliser une matraque pour frapper sa femme mais des brindilles. De plus, certains exégètes rapportent qu’Allah aurait demandé à Job de réunir cent brindilles en un seul faisceau. Job put alors donner un seul coup à sa femme au lieu de cent, et il ne manqua pas à son serment.","lang":"fr","version":{"key":"french_montada","direction":"ltr","language_iso_code":"fr","version":"1.0.0","last_update":1539205200,"title":"French Translation - Noor International Center","description":"Translation of the Quran meanings into French, by Dr. Nabil Radwan, published by Noor International Center - was printed in 2017."},"meta":{"transliteration":"wakhudh biyadika ḍigh'than fa-iḍ'rib bihi walā taḥnath innā wajadnāhu ṣābiran niʿ'ma al-ʿabdu innahu awwābun ","translations":["And take","in your hand","a bunch","and strike","with it","and (do) not","break (your) oath","Indeed, We","[We] found him","patient","an excellent","slave","Indeed, he","repeatedly turned","(44)"],"transliterationArr":["wakhudh","biyadika","ḍigh'than","fa-iḍ'rib","bihi","walā","taḥnath","innā","wajadnāhu","ṣābiran","niʿ'ma","al-ʿabdu","innahu","awwābun",null],"verseTiming":[[1,0,610],[2,610,1550],[3,1550,3060],[4,3060,3840],[5,3840,4540],[6,4540,5180],[7,5180,6100],[8,6100,8279],[9,8279,9559],[10,9559,11289],[11,11289,11779],[12,11779,12699],[13,12699,16009],[14,16009,19324]]}}