{"name":"10:16","price":"Sema: Mwenyezi Mungu angeli taka nisingeli kusomeeni, wala nisingeli kujuvyeni. Kwani nalikwisha kaa nanyi umri mzima kabla yake! Basi, je! Hamzingatii?","arabic":"قُل لَّوۡ شَآءَ ٱللَّهُ مَا تَلَوۡتُهُۥ عَلَيۡكُمۡ وَلَآ أَدۡرَىٰكُم بِهِۦۖ فَقَدۡ لَبِثۡتُ فِيكُمۡ عُمُرٗا مِّن قَبۡلِهِۦٓۚ أَفَلَا تَعۡقِلُونَ","category":["10 (Yunus)","Yunus","Surah Yunus","Chapter Yunus","Surah 10","Chapter 10","Jonah","يونُس"],"ayahNumber":1380,"juzNumber":11,"footnotes":"Waambie ewe Mtume! Lau kuwa Mwenyezi Mungu angeli taka kuwa asiniteremshie Qur'ani kutoka kwake, wala mimi nisikufikishieni, asingeli teremsha, wala mimi nisingeli kusomeeni, na wala Mwenyezi Mungu asingeli kufundisheni. Lakini Yeye kateremsha, na kanituma mimi kwayo, na mimi nimekusomeeni kama alivyo niamrisha. Na mimi nilikwisha kaa nanyi wakati mrefu kabla ya kupewa Utume, na mimi sikudai Utume wakati huo, wala sikukusomeeni kitu chochote. Na nyinyi mmeshuhudia kuwa mimi ni mkweli na muaminifu. Lakini umekuja Ufunuo na nimeamrishwa niusome. Basi hebu yatieni akilini haya mambo, na myazingatie, na yakutanisheni yaliyo pita ya zamani na ya yaliopo sasa.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"qul law shāa al-lahu mā talawtuhu ʿalaykum walā adrākum bihi faqad labith'tu fīkum ʿumuran min qablihi afalā taʿqilūna ","translations":["Say","If","(had) willed","Allah","not","I (would) have recited it","to you","and not","He (would) have made it known to you","He (would) have made it known to you","Verily","I have stayed","among you","a lifetime","before it","before it","Then will not","you use reason","(16)"],"transliterationArr":["qul","law","shāa","al-lahu","mā","talawtuhu","ʿalaykum","walā","adrākum","bihi","faqad","labith'tu","fīkum","ʿumuran","min","qablihi","afalā","taʿqilūna",null],"verseTiming":[[1,0,520],[2,520,840],[3,840,2990],[4,2990,4060],[5,4060,4450],[6,4450,5870],[7,5870,7030],[8,7030,8710],[9,8710,10900],[10,10900,12290],[11,12290,12960],[12,12960,13820],[13,13820,14710],[14,14710,15530],[15,15530,17820],[16,17820,19440],[17,19440,20310],[18,20310,24045]]}}