{"name":"10:101","price":"Sema: Angalieni yaliomo mbinguni na kwenye ardhi! Na Ishara zote na maonyo hayawafai kitu watu wasio amini.","arabic":"قُلِ ٱنظُرُواْ مَاذَا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ وَمَا تُغۡنِي ٱلۡأٓيَٰتُ وَٱلنُّذُرُ عَن قَوۡمٖ لَّا يُؤۡمِنُونَ","category":["10 (Yunus)","Yunus","Surah Yunus","Chapter Yunus","Surah 10","Chapter 10","Jonah","يونُس"],"ayahNumber":1465,"juzNumber":11,"footnotes":"Ewe Nabii! Waambie hawa wenye inda: Tazameni Ishara zilizo wazi zinazo onyesha Ungu na Upweke wa Mwenyezi Mungu zilio enea katika mbingu na ardhi. Lakini Ishara, juu ya wingi wake, na maonyo na yangawa na nguvu, hayawafai kitu watu wanao kataa na wala hawatumii akili zao. Hawa wanao kanya kama hawaamini, basi hawatoangalia. Aya hii na Aya nyingi nyenginezo zinaita watu wajifunze kwa kuangalia na kuzingatia (Observation). Na inaita watu wajifunze ilimu ya ulimwengu na viliomo ndani yake, kwani huo ulimwengu umedhalilishwa kwa ajili ya mwanaadamu. Kisha hizo Aya zinataka watu waingie katika ilimu za kujaribu (Experimental Science). Kwani hiyo ni njia ya kujua kwa kuona vinavyo onekana.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"quli unẓurū mādhā fī al-samāwāti wal-arḍi wamā tugh'nī al-āyātu wal-nudhuru ʿan qawmin lā yu'minūna ","translations":["Say","See","what","(is) in","the heavens","and the earth","But not","will avail","the Signs","and the warners","to","a people","(who do) not","believe","(101)"],"transliterationArr":["quli","unẓurū","mādhā","fī","al-samāwāti","wal-arḍi","wamā","tugh'nī","al-āyātu","wal-nudhuru","ʿan","qawmin","lā","yu'minūna",null],"verseTiming":[[1,0,430],[2,430,1880],[3,1880,2760],[4,2760,3000],[5,3000,4580],[6,4580,6200],[7,6200,6810],[8,6810,7470],[9,7470,8870],[10,8870,10220],[11,10220,11560],[12,11560,12480],[13,12480,12980],[14,12980,16455]]}}