{"name":"10:19","price":"Wala watu hawakuwa ila Umma mmoja tu. Kisha wakakhitalifiana. Na lau kuwa si neno lililo kwisha tangulia kutokana na Mola wako Mlezi, hapana shaka hukumu ingeli kwisha katwa baina yao katika hayo wanayo khitalifiana.","arabic":"وَمَا كَانَ ٱلنَّاسُ إِلَّآ أُمَّةٗ وَٰحِدَةٗ فَٱخۡتَلَفُواْۚ وَلَوۡلَا كَلِمَةٞ سَبَقَتۡ مِن رَّبِّكَ لَقُضِيَ بَيۡنَهُمۡ فِيمَا فِيهِ يَخۡتَلِفُونَ","category":["10 (Yunus)","Yunus","Surah Yunus","Chapter Yunus","Surah 10","Chapter 10","Jonah","يونُس"],"ayahNumber":1383,"juzNumber":11,"footnotes":"Watu kwa maumbile yao hawakuwa ila ni Umma mmoja tu. Kisha tukawapelekea Mitume wawaongoze na wawaongoe kwa mujibu wa Ufunuo wa Mwenyezi Mungu Mtukufu. Ikawa tabia ya kibinaadamu iliyo pelekea kheri na shari ndiyo sababu ya kuwa na nguvu zaidi shari katika baadhi yao. Juu yao hao matamanio na nyendo za Shetani zikatawala, na kwa hivyo wakakhitalifiana. Na lau kuwa hukumu ya Mola wako Mlezi haikutangulia ya kuwapa muhula makafiri kwa ajili yako, Ewe Nabii, na kuakhirisha maangamizo yao mpaka siku maalumu iliyo ahidiwa, Mwenyezi Mungu angeli wapelekea upesi maangamizo na adhabu, kwa sababu ya mfarakano waliyo uingia, kama zilivyo ingia kaumu zilizo kwisha pita.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"wamā kāna al-nāsu illā ummatan wāḥidatan fa-ikh'talafū walawlā kalimatun sabaqat min rabbika laquḍiya baynahum fīmā fīhi yakhtalifūna ","translations":["And not","was","the mankind","but","a community","one","then they differed","And had (it) not been","a word","(that) preceded","from","your Lord","surely, it (would) have been judged","between them","concerning what","[therein]","they differ","(19)"],"transliterationArr":["wamā","kāna","al-nāsu","illā","ummatan","wāḥidatan","fa-ikh'talafū","walawlā","kalimatun","sabaqat","min","rabbika","laquḍiya","baynahum","fīmā","fīhi","yakhtalifūna",null],"verseTiming":[[1,0,700],[2,700,1390],[3,1390,3300],[4,3300,5400],[5,5400,8080],[6,8080,10240],[7,10240,11840],[8,11840,13530],[9,13530,15110],[10,15110,16380],[11,16380,16580],[12,16580,17740],[13,17740,18600],[14,18600,19720],[15,19720,20620],[16,20620,21420],[17,21420,25185]]}}