{"name":"10:6","price":"Hakika katika kukhitalifiana usiku na mchana, na katika alivyo umba Mwenyezi Mungu katika mbingu na ardhi, zipo Ishara kwa watu wanao mcha-Mngu.","arabic":"إِنَّ فِي ٱخۡتِلَٰفِ ٱلَّيۡلِ وَٱلنَّهَارِ وَمَا خَلَقَ ٱللَّهُ فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ لَأٓيَٰتٖ لِّقَوۡمٖ يَتَّقُونَ","category":["10 (Yunus)","Yunus","Surah Yunus","Chapter Yunus","Surah 10","Chapter 10","Jonah","يونُس"],"ayahNumber":1370,"juzNumber":11,"footnotes":"Hakika katika kufuatana usiku na mchana na kukhitalifiana kwao, kwa kuzidi na kupungua, na katika uumbaji wa mbingu na ardhi na vitu vyote viliomo humo, zipo dalili zilizo wazi na hoja zilizo dhaahiri zenye kuhakikisha Ungu wa Mwenye kuumba, na uwezo wake. Hayo ni kwa wenye kutaka kuiepuka ghadhabu yake na wakaiogopa adhabu yake. Aya hii ya 6 inaashiria hakika inayo onekana, nayo kukhitalifiana urefu wa usiku na mchana kwa mwaka mzima katika pahala popote duniani. Na kadhaalika kufuatana mchana na usiku, na kuwa mchana ni wa kuangaza na kuonana, na usiku ni giza. Na maana ya hayo ni kuwa msingi wake ni kuwa dunia inazunguka wenyewe kwa wenyewe kama pia juu ya msumari wake, na vile vile inalizunguka jua. Na yote hayo ni dalili ya uwezo wa Mwenye kuumba katika kuanzisha uumbaji. Ujuzi wa mambo hayo wakati wa Mtume s.a.w. haukuwepo. Na hii ni dalili nyengine ya kwamba haya hayakuwa ila ni wahyi, ufunuo, ulio toka kwa Mwenyezi Mungu kumpa Mtume s.a.w.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"inna fī ikh'tilāfi al-layli wal-nahāri wamā khalaqa al-lahu fī al-samāwāti wal-arḍi laāyātin liqawmin yattaqūna ","translations":["Indeed","in","(the) alternation","(of) the night","and the day","and what","(has been) created","(by) Allah","in","the heavens","and the earth","(are) Signs","for a people","who are God conscious","(6)"],"transliterationArr":["inna","fī","ikh'tilāfi","al-layli","wal-nahāri","wamā","khalaqa","al-lahu","fī","al-samāwāti","wal-arḍi","laāyātin","liqawmin","yattaqūna",null],"verseTiming":[[1,0,1530],[2,1530,1800],[3,1800,2890],[4,2890,3710],[5,3710,5600],[6,5600,6240],[7,6240,6970],[8,6970,7830],[9,7830,8020],[10,8020,9650],[11,9650,10800],[12,10800,12170],[13,12170,14680],[14,14680,18345]]}}