{"name":"10:92","price":"Leo, basi, tutakuokoa kwa mwili wako, ili uwe Ishara kwa ajili ya walio nyuma yako. Na hakika watu wengi wameghafilika na Ishara zetu.","arabic":"فَٱلۡيَوۡمَ نُنَجِّيكَ بِبَدَنِكَ لِتَكُونَ لِمَنۡ خَلۡفَكَ ءَايَةٗۚ وَإِنَّ كَثِيرٗا مِّنَ ٱلنَّاسِ عَنۡ ءَايَٰتِنَا لَغَٰفِلُونَ","category":["10 (Yunus)","Yunus","Surah Yunus","Chapter Yunus","Surah 10","Chapter 10","Jonah","يونُس"],"ayahNumber":1456,"juzNumber":11,"footnotes":"Na leo siku ulipo angamia tutautoa mwili wako baharini, na tutauweka uwe ni onyo na funzo kwa hao walio kuwa wakikuabudu, na hawakuwa wakikutarajia utapata mwisho huu wa hizaya wa machungu. Lakini watu wengi wanaghafilika na Ishara zilizo wazi na zilizo zagaa katika ulimwengu, na ambazo zinathibitisha uwezo wetu. Inaonyesha Aya hii tukufu kuwa mwili wa Firauni utabaki umehifadhiwa ili watu wauone, na wapime kwa macho yao hali ya ule mzoga wa yule aliye kuwa akijiona ni mungu, na akiwaambia watu wake wanao mnyenyekea: Hamna mungu ila mimi! Kadhaalika tujue kuwa kutoka Wana wa Israili katika nchi ya Misri kulikuwa mwishoni mwa karne ya kumi na tatu kabla ya kuzaliwa Nabii Isa a.s., katika enzi ya mmoja wa Mafirauni wa Ukoo wa kumi na tisa, naye ni Minfitah mwana wa Ramsis wa Pili, ambaye ndiye aliye wakandamiza Wana wa Israili akawalazimisha wamjengee Jiji la ufalme wake. Uvumbuzi wa machimbo ya vitu vya kale wa hivi karibuni umedhihirisha kuwa jina la mji huo ulio funikika chini ya ardhi, ni \"Bur'amsis\". Kulikuwa kutoka kwa Wana wa Israili pamoja na Musa ni kwa ajili ya wito wa Tawhidi, Umoja wa Mwenyezi Mungu, na kuikata shemere ya Firauni iliyo wadhalilisha, na ikawakutisha adhabu ya mwisho. Na ilikuwa haijuulikani na Waarabu ambao hawajui kusoma na kuandika, wala kwa wengineo, kwamba mwili wa Firauni huyu ungalipo mpaka hii leo. Lakini Qur'ani imeyataja hayo, na ukweli wake umethibiti mwaka 1900 B.K., yaani karne kumi na tatu baada ya kuteremka Qur'ani. Je, hii si dalili ya kuwa imetoka kwa Mungu?","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"fal-yawma nunajjīka bibadanika litakūna liman khalfaka āyatan wa-inna kathīran mina al-nāsi ʿan āyātinā laghāfilūna ","translations":["So today","We will save you","in your body","that you may be","for (those) who","succeed you","a sign","And indeed","many","among","the mankind","of","Our Signs","(are) surely heedless","(92)"],"transliterationArr":["fal-yawma","nunajjīka","bibadanika","litakūna","liman","khalfaka","āyatan","wa-inna","kathīran","mina","al-nāsi","ʿan","āyātinā","laghāfilūna",null],"verseTiming":[[1,0,1020],[2,1020,2380],[3,2380,3430],[4,3430,4380],[5,4380,4980],[6,4980,5860],[7,5860,7190],[8,7190,8700],[9,8700,9580],[10,9580,10660],[11,10660,12260],[12,12260,12690],[13,12690,14230],[14,14230,17635]]}}