{"name":"11:44","price":"Na ikasemwa: Ewe ardhi! Meza maji yako. Na Ewe mbingu! Jizuie. Basi maji yakadidimia chini, na amri ikapitishwa, na (jahazi) likasimama juu ya (mlima) wa Al Juudiy. Na ikasemwa: Wapotelee mbali watu walio dhulumu!","arabic":"وَقِيلَ يَٰٓأَرۡضُ ٱبۡلَعِي مَآءَكِ وَيَٰسَمَآءُ أَقۡلِعِي وَغِيضَ ٱلۡمَآءُ وَقُضِيَ ٱلۡأَمۡرُ وَٱسۡتَوَتۡ عَلَى ٱلۡجُودِيِّۖ وَقِيلَ بُعۡدٗا لِّلۡقَوۡمِ ٱلظَّٰلِمِينَ","category":["11 (Hud)","Hud","Surah Hud","Chapter Hud","Surah 11","Chapter 11","Hud","هود"],"ayahNumber":1517,"juzNumber":12,"footnotes":"Walipo kwisha hiliki makafiri kwa kuzamishwa, ikaja amri ya Mwenyezi Mungu ya maumbile. Ikasemwa kwa hukumu ya uumbaji: Ewe ardhi! Yameze maji yako, na wewe mbingu! Sita na kuteremsha maji. Yakaondoka maji kwenye ardhi, wala kisiongezeke chochote kutoka mbinguni. Hukumu ya Mwenyezi Mungu ya kuhiliki ikamalizika. Jahazi likatua na likasimama juu ya mlima uitwao Al Juudiy. Na Mwenyezi Mungu akawahukumia walio dhulumu kwa kuwatenga na rehema yake. Ikasemwa: Wateketee kaumu walio dhulumu kwa sababu ya dhulma zao. Mlima huo uko Mosal (kaskazini mwa Iraq na kusini ya Turki) Ulikuwa maarufu hapo kale.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"waqīla yāarḍu ib'laʿī māaki wayāsamāu aqliʿī waghīḍa al-māu waquḍiya al-amru wa-is'tawat ʿalā al-jūdiyi waqīla buʿ'dan lil'qawmi al-ẓālimīna ","translations":["And it was said","O earth","Swallow","your water","and O sky","Withhold","And subsided","the water","and was fulfilled","the Command","And it rested","on","the Judi","And it was said","Away","with the people","the wrongdoers","(44)"],"transliterationArr":["waqīla","yāarḍu","ib'laʿī","māaki","wayāsamāu","aqliʿī","waghīḍa","al-māu","waquḍiya","al-amru","wa-is'tawat","ʿalā","al-jūdiyi","waqīla","buʿ'dan","lil'qawmi","al-ẓālimīna",null],"verseTiming":[[1,0,910],[2,910,3590],[3,3590,4480],[4,4480,6890],[5,6890,10199],[6,10199,11229],[7,11229,12079],[8,12079,14579],[9,14579,15369],[10,15369,16249],[11,16249,17229],[12,17229,17639],[13,17639,19479],[14,19479,20339],[15,20339,21059],[16,21059,22459],[17,22459,27674]]}}