{"name":"13:41","price":"Je! Hawakuona kwamba tunaifikia ardhi tukiipunguza nchani mwake? Na Mwenyezi Mungu huhukumu, na hapana wa kupinga hukumu yake, naye ni Mwepesi wa kuhisabu.","arabic":"أَوَلَمۡ يَرَوۡاْ أَنَّا نَأۡتِي ٱلۡأَرۡضَ نَنقُصُهَا مِنۡ أَطۡرَافِهَاۚ وَٱللَّهُ يَحۡكُمُ لَا مُعَقِّبَ لِحُكۡمِهِۦۚ وَهُوَ سَرِيعُ ٱلۡحِسَابِ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd","Chapter Ar-Ra'd","Ra'd","Surah Ra'd","Chapter Ra'd","Ar Ra'd","Surah Ar Ra'd","Chapter Ar Ra'd","Surah 13","Chapter 13","The Thunder","الرَّعد"],"ayahNumber":1748,"juzNumber":13,"footnotes":"Na hakika dalili za adhabu na kushindwa zipo! Hawaangalii kwamba Sisi tunazifikia nchi walizo kuwa wakizitawala zinachukuliwa na Waumini kidogo kidogo? Na kwa hivyo tunawapunguzia wao ardhi zilio wazunguka. Na Mwenyezi Mungu peke yake ndiye wa kuhukumu kushinda na kushindwa, na thawabu na adhabu. Na wala hapana wa kuipinga hukumu yake. Na hisabu yake ni ya mbio mbio, haihitajii kupitiwa na wakati mrefu, kwani Yeye ni Mjuzi wa kila kitu. Basi ishara zipo! Aya hii ina ukweli ulio fikiliwa na uchunguzi wa kisayansi za hivi sasa, ya kwamba imethibiti kuwa dunia inazunguka, na kuwa inayo mvuto kama simaku. Hayo yamepelekea kubabataa katika ncha mbili za kaskazini na kusini, North Pole na South Pole. Na hivyo ni kupunguka katika ncha mbili za ardhi. Na kadhaalika imejuulikana kuchopoka mbio za sehemu za gasi zilizo funika huu mpira wa dunia kukipindukia nguvu za mvuto wa ardhi, basi hutoka nje ya dunia. Na haya yanatokea mfululizo, na kwa hivyo ardhi, yaani dunia, inakuwa katika hali ya kupunguka moja kwa moja katika ncha zake. Haya yanakuwa kwa kuifasiri ardhi kuwa ni dunia, si nchi ya maadui wa Waumini. Yaelekea taf siri hii kwa Aya hii tukufu, ijapo kuwa wafasiri wengi wamefasiri kuwa muradi wa \"ardhi\" ni nchi za maadui.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"awalam yaraw annā natī al-arḍa nanquṣuhā min aṭrāfihā wal-lahu yaḥkumu lā muʿaqqiba liḥuk'mihi wahuwa sarīʿu al-ḥisābi ","translations":["Did not","they see","that We","come","(to) the land","reducing it","from","its borders","And Allah","judges","(there is) no","adjuster","(of) His Judgment","And He","(is) Swift","(in) the reckoning","(41)"],"transliterationArr":["awalam","yaraw","annā","natī","al-arḍa","nanquṣuhā","min","aṭrāfihā","wal-lahu","yaḥkumu","lā","muʿaqqiba","liḥuk'mihi","wahuwa","sarīʿu","al-ḥisābi",null],"verseTiming":[[1,0,860],[2,860,1600],[3,1600,3270],[4,3270,3900],[5,3900,4840],[6,4840,6660],[7,6660,7060],[8,7060,8750],[9,8750,10200],[10,10200,11150],[11,11150,11640],[12,11640,12820],[13,12820,14260],[14,14260,14870],[15,14870,15860],[16,15860,18145]]}}