{"name":"15:22","price":"Na tunazipeleka pepo za kupandishia, na tunateremsha kutoka mbinguni maji, kisha tukakunywesheni maji hayo. Wala si nyinyi mnayo yaweka.","arabic":"وَأَرۡسَلۡنَا ٱلرِّيَٰحَ لَوَٰقِحَ فَأَنزَلۡنَا مِنَ ٱلسَّمَآءِ مَآءٗ فَأَسۡقَيۡنَٰكُمُوهُ وَمَآ أَنتُمۡ لَهُۥ بِخَٰزِنِينَ","category":["15 (Al-Hijr)","Al-Hijr","Surah Al-Hijr","Chapter Al-Hijr","Hijr","Surah Hijr","Chapter Hijr","Al Hijr","Surah Al Hijr","Chapter Al Hijr","Surah 15","Chapter 15","The Rock","الحِجر"],"ayahNumber":1824,"juzNumber":14,"footnotes":"Na Sisi tulipeleka pepo zilizo beba mvua na zilizo beba mbegu za mimea, na tukateremsha maji ya kukunywesheni. Na hayo ni kwa kufuata vile tutakavyo. Na yeyote yule hawezi kuyatenda kama hayo ila awe nayo kwake kama mahodhi au mabirika. Aya hii imeitangulia sayansi kwa kusema kuwa upepo unafanya kazi kubwa katika kubeba pollen, chembe dume za kupandishia mimea, kupelekea sehemu za uke za mimea mingine, na kwa hivyo yakazalikana mazao. Na pia haikujuulikana ila mwanzo wa karne hii tuliyo nayo kwamba upepo unazalisha mawingu yanayo nyesha mvua. Kwani \"Nucleons\" ambazo juu yake hujumuika sehemu za mvuke wa maji na zikawa chembe chembe za maji ndani ya wingu, ndizo chanzo cha mvua inayo chukuliwa na pepo kupelekwa kwenye majimbo yanayo fikiwa na mawingu. Misingi ya hizo \"Nucleons\" ni chumvi ya bahari, na vinavyo chukuliwa na upepo juu ya uso wa ardhi, na \"Oxides\" na vumbi vumbi, n.k. Na vyote hivyo ni lazima kwa ajili ya mvua. \"Wala si nyinyi mnayo yaweka\". Imethibiti kwa sayansi ya kisasa kuwa mvua inaanza kwa mvuke kutokana na uso wa ardhi na bahari, kisha inarejea hali ile ile tena kama ilivyo tajwa. Ikinya mvua hunywesha kila kilicho na uhai katika ardhi, na huinywesha ardhi yenyewe. Wala haiwezekani kuzuilika, kwa sababu ikichuruzika kutokana na vyote vyenye uhai na katika ardhi ikaingia baharini, tena kisha huanza kuzunguka mara ya pili kwa kupanda mvuke kutoka baharini. Basi hali ni hivyo mzunguko. Hapa ndio inabainika maana ya Aya \"Wala si nyinyi mnayo yaweka.\"","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"wa-arsalnā al-riyāḥa lawāqiḥa fa-anzalnā mina al-samāi māan fa-asqaynākumūhu wamā antum lahu bikhāzinīna ","translations":["And We have sent","the winds","fertilizing","and We sent down","from","the sky","water","and We gave it to you to drink","And not","you","of it","(are) retainers","(22)"],"transliterationArr":["wa-arsalnā","al-riyāḥa","lawāqiḥa","fa-anzalnā","mina","al-samāi","māan","fa-asqaynākumūhu","wamā","antum","lahu","bikhāzinīna",null],"verseTiming":[[1,0,1250],[2,1250,2400],[3,2400,3450],[4,3450,5700],[5,5700,6060],[6,6060,8390],[7,8390,10670],[8,10670,14940],[9,14940,17200],[10,17200,18970],[11,18970,20570],[12,20570,21200],[13,21200,23825]]}}