{"name":"16:15","price":" Na kaweka katika ardhi milima ili ardhi isiyumbe yumbe nanyi.Na mito, na njia ili mpate kuongoka.","arabic":"وَأَلۡقَىٰ فِي ٱلۡأَرۡضِ رَوَٰسِيَ أَن تَمِيدَ بِكُمۡ وَأَنۡهَٰرٗا وَسُبُلٗا لَّعَلَّكُمۡ تَهۡتَدُونَ","category":["16 (An-Nahl)","An-Nahl","Surah An-Nahl","Chapter An-Nahl","Nahl","Surah Nahl","Chapter Nahl","An Nahl","Surah An Nahl","Chapter An Nahl","Surah 16","Chapter 16","The Bee","النَّحل"],"ayahNumber":1916,"juzNumber":14,"footnotes":"Na Mwenyezi Mungu amefanya katika ardhi milima iliyo simama imara, ili kuizuia isiyumbe yumbe.(Mwaka 1956 wataalamu wa geology, ilimu ya tabaka za ardhi, wamegundua kuwa kweli milima inasaidia kuizuia ardhi isitaharaki na kuachana. Wamevumbua kuwa mabara, continents, yamo katika kutaharaki. Kwa mfano kusini ya Amerika iliambatana na Afrika ya Magharibi, na ilisota mpaka ikafanyikana milima ya Andes. Hali kadhaalika Milima ya Himalaya ikazuia kusota kwa Bara Hindi. Pia wamegundua kuwa maki ya gamba la ardhi kwa kawaida halizidi kilomita 6, lakini chini ya milima hufika hata kilomita 35. Basi ni kweli kuwa milima ni kama vigingi vya kuzuia ardhi isiyumbe, kama ilivyo sema Qur'ani miaka 1400 iliyo pita.) Na Mwenyezi Mungu amefanya katika ardhi mito inayo pita na maji yanayo faa kunywa na kunyweshea makulima, na njia zilizo tengenezwa ili mpate kuzipitia kwendea mtakako.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"wa-alqā fī al-arḍi rawāsiya an tamīda bikum wa-anhāran wasubulan laʿallakum tahtadūna ","translations":["And He has cast","in","the earth","firm mountains","lest","it should shake","with you","and rivers","and roads","so that you may","be guided","(15)"],"transliterationArr":["wa-alqā","fī","al-arḍi","rawāsiya","an","tamīda","bikum","wa-anhāran","wasubulan","laʿallakum","tahtadūna",null],"verseTiming":[[1,0,1200],[2,1200,1400],[3,1400,2340],[4,2340,3470],[5,3470,4680],[6,4680,5700],[7,5700,6510],[8,6510,8160],[9,8160,9260],[10,9260,10900],[11,10900,13825]]}}