{"name":"16:124","price":"Hakika siku ya Sabato (Jumaamosi) waliwekewa wale walio khitalifiana kwa ajili yake. Na hakika Mola wako Mlezi bila ya shaka atahukumu baina yao Siku ya Kiyama katika yale waliyo kuwa wakikhitalifiana.","arabic":"إِنَّمَا جُعِلَ ٱلسَّبۡتُ عَلَى ٱلَّذِينَ ٱخۡتَلَفُواْ فِيهِۚ وَإِنَّ رَبَّكَ لَيَحۡكُمُ بَيۡنَهُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ فِيمَا كَانُواْ فِيهِ يَخۡتَلِفُونَ","category":["16 (An-Nahl)","An-Nahl","Surah An-Nahl","Chapter An-Nahl","Nahl","Surah Nahl","Chapter Nahl","An Nahl","Surah An Nahl","Chapter An Nahl","Surah 16","Chapter 16","The Bee","النَّحل"],"ayahNumber":2025,"juzNumber":14,"footnotes":"Wala sio kuitukuza siku ya Ijumaa na kuiacha Jumaamosi kama ilivyo katika Uislamu kuwa ni kukhitalifiana na alivyo kuwa akifanya Ibrahim, kama wanavyo dai Mayahudi. Kwani kuharimishwa kuvua (na kufanya kazi nyengine) siku ya Jumaamosi, ndio Siku ya Sabato, kwa sababu ya kuitukuza haikuwamo katika sharia ya Ibrahim. Hayo walilazimishwa Mayahudi tu (ambao hata hawakuwapo zama za Ibrahim). Na juu ya hivyo hawakuitukuza, bali baadhi yao waliacha kutukuza huko, na wakenda kinyume na amri ya Mola wao Mlezi. Basi yawaje hata wanawatia makosani wengine kwa kutolazimishwa kutukuza jambo ambalo wao walio lazimishwa wameliasi? Ewe Nabii! Kuwa na yakini kuwa Mola wako Mlezi atawahukumu hao Siku ya Kiyama katika hayo mambo wanayo khitalifiana kwayo, na atamlipa kila mmoja wao kwa vitendo vyake.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"innamā juʿila al-sabtu ʿalā alladhīna ikh'talafū fīhi wa-inna rabbaka layaḥkumu baynahum yawma al-qiyāmati fīmā kānū fīhi yakhtalifūna ","translations":["Only","was appointed","the Sabbath","for","those who","differed","in it","And indeed","your Lord","will surely judge","between them","(on) the Day","(of) the Resurrection","in what","they used (to)","[in it]","differ","(124)"],"transliterationArr":["innamā","juʿila","al-sabtu","ʿalā","alladhīna","ikh'talafū","fīhi","wa-inna","rabbaka","layaḥkumu","baynahum","yawma","al-qiyāmati","fīmā","kānū","fīhi","yakhtalifūna",null],"verseTiming":[[1,0,1890],[2,1890,2450],[3,2450,3400],[4,3400,3800],[5,3800,4820],[6,4820,5960],[7,5960,8430],[8,8430,9830],[9,9830,10730],[10,10730,11810],[11,11810,12820],[12,12820,13360],[13,13360,14770],[14,14770,15550],[15,15550,16460],[16,16460,17220],[17,17220,20145]]}}