{"name":"16:92","price":"Wala msiwe kama mwanamke anaye uzongoa uzi wake baada ya kwisha usokota ukawa mgumu. Mnavifanya viapo vyenu kuwa ni njia ya kudanganyana baina yenu kwa kuwa ati taifa moja lina nguvu zaidi kuliko jengine? Hakika Mwenyezi Mungu anakujaribuni kwa njia hiyo. Na bila ya shaka atakubainishieni Siku ya Kiyama mliyo kuwa mkikhitalifiana.","arabic":"وَلَا تَكُونُواْ كَٱلَّتِي نَقَضَتۡ غَزۡلَهَا مِنۢ بَعۡدِ قُوَّةٍ أَنكَٰثٗا تَتَّخِذُونَ أَيۡمَٰنَكُمۡ دَخَلَۢا بَيۡنَكُمۡ أَن تَكُونَ أُمَّةٌ هِيَ أَرۡبَىٰ مِنۡ أُمَّةٍۚ إِنَّمَا يَبۡلُوكُمُ ٱللَّهُ بِهِۦۚ وَلَيُبَيِّنَنَّ لَكُمۡ يَوۡمَ ٱلۡقِيَٰمَةِ مَا كُنتُمۡ فِيهِ تَخۡتَلِفُونَ","category":["16 (An-Nahl)","An-Nahl","Surah An-Nahl","Chapter An-Nahl","Nahl","Surah Nahl","Chapter Nahl","An Nahl","Surah An Nahl","Chapter An Nahl","Surah 16","Chapter 16","The Bee","النَّحل"],"ayahNumber":1993,"juzNumber":14,"footnotes":"Wala msiwe katika kwenda kinyume na viapo vyenu baada ya kuvithibitisha mfano wa mwanamke mwendawazimu anaye sokoto sufi, ikisha kuwa nyuzi akazifumua tena. Mkafanya viapo vyenu kuwa ni njia ya kudanganya na kukhadaa watu, na huku mkijitafutia udhuru kwa kuwa ama nyinyi ni wengi zaidi au mna nguvu zaidi kuliko wao, au mnakusudia kuwaunga mkono maadui wenye nguvu zaidi kuliko wao, au kwa kuwa mnataraji kuzidi nguvu kwa khiana! Na hakika Mwenyezi Mungu anakufanyieni mtihani. Mkikhiari kutimiza ahadi mtapata mavuno ya duniani na Akhera. Mkielekea khiana, basi ni khasara yenu. Na hakika Siku ya Kiyama atakubainishieni ukweli wa khitilafu zenu za duniani, na atakulipeni kwa mujibu wa vitendo vyenu. Aya mbili hizi zinaonyesha kuwa msingi wa makhusiano baina ya Waislamu na wengineo pamoja na uadilifu ni kutimiza ahadi, na kwamba makhusiano baina ya mataifa hayasimami sawa ila kwa kutimiza ahadi, na kwamba dola za Kiislamu zikijifunga kwa mapatano basi zijifunge kwa jina la Mwenyezi Mungu. Maana ya hayo ni kuwa inakuwapo yamini ya Mwenyezi Mungu na kuwa Yeye ndiye dhamini. Na Aya inafahamisha mambo matatu, ambayo lau kuwa mataifa yangeli yatimiza basi amani ingeli enea: Kwanza: Haifai mapatano kuwa ndio njia ya kufanya khadaa. Ikiwa hivyo inakuwa ni udanganyifu. Na udanganyifu haufai katika makhusiano baina ya wanaadamu, sawa sawa ikiwa baina ya mtu na mtu, au kikundi na kikundi, au baina ya madola. Pili: Kutimiza ahadi peke yake ni nguvu. Na mwenye kuvunja ahadi ni kama mwenye kuvunja alicho kijenga kwa sababu za nguvu. Basi anakuwa kama mpumbavu anaye tatua uzi wake kila akisha usokota. Tatu: Haimfalii mtu kuvunja ahadi kwa sababu ya kutafuta nguvu au kutaka kuzidisha kipande cha ardhi.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"walā takūnū ka-allatī naqaḍat ghazlahā min baʿdi quwwatin ankāthan tattakhidhūna aymānakum dakhalan baynakum an takūna ummatun hiya arbā min ummatin innamā yablūkumu al-lahu bihi walayubayyinanna lakum yawma al-qiyāmati mā kuntum fīhi takhtalifūna ","translations":["And (do) not","be","like her who","untwists","her spun yarn","after","after","strength","(into) untwisted strands","you take","your oaths","(as) a deception","between you","because","is","a community","[it]","more numerous","than","(another) community","Only","Allah tests you","Allah tests you","by it","And He will make clear","to you","(on) the Day","(of) the Resurrection","what","you used (to)","in it","differ","(92)"],"transliterationArr":["walā","takūnū","ka-allatī","naqaḍat","ghazlahā","min","baʿdi","quwwatin","ankāthan","tattakhidhūna","aymānakum","dakhalan","baynakum","an","takūna","ummatun","hiya","arbā","min","ummatin","innamā","yablūkumu","al-lahu","bihi","walayubayyinanna","lakum","yawma","al-qiyāmati","mā","kuntum","fīhi","takhtalifūna",null],"verseTiming":[[1,0,620],[2,620,1680],[3,1680,2720],[4,2720,3550],[5,3550,4610],[6,4610,5580],[7,5580,6140],[8,6140,7200],[9,7200,9570],[10,9570,11060],[11,11060,13080],[12,13080,14370],[13,14370,15880],[14,15880,17150],[15,17150,18200],[16,18200,19180],[17,19180,20060],[18,20060,21430],[19,21430,21850],[20,21850,22660],[21,22660,23100],[22,23100,25060],[23,25060,26560],[24,26560,27710],[25,27710,28590],[26,28590,29370],[27,29370,31600],[28,31600,32180],[29,32180,32710],[30,32710,34050],[31,34050,34440],[32,34440,36040],[33,36040,36750],[34,36750,39625]]}}