{"name":"18:16","price":"Na mkijitenga nao na vile wanavyo viabudu badala ya Mwenyezi Mungu, basi kimbilieni pangoni, akufungulieni Mola wenu Mlezi rehema yake, na akutengenezeeni ya kukufaeni katika mambo yenu.","arabic":"وَإِذِ ٱعۡتَزَلۡتُمُوهُمۡ وَمَا يَعۡبُدُونَ إِلَّا ٱللَّهَ فَأۡوُۥٓاْ إِلَى ٱلۡكَهۡفِ يَنشُرۡ لَكُمۡ رَبُّكُم مِّن رَّحۡمَتِهِۦ وَيُهَيِّئۡ لَكُم مِّنۡ أَمۡرِكُم مِّرۡفَقٗا","category":["18 (Al-Kahf)","Al-Kahf","Surah Al-Kahf","Chapter Al-Kahf","Kahf","Surah Kahf","Chapter Kahf","Al Kahf","Surah Al Kahf","Chapter Al Kahf","Surah 18","Chapter 18","The Cave","الكَهف"],"ayahNumber":2156,"juzNumber":15,"footnotes":"Na wakaambiana wao kwa wao: Maadamu sisi tumejitenga nao hao katika ukafiri wao na ushirikina wao, basi kimbilieni pangoni mlinde Dini yenu. Mola wenu Mlezi atakukunjulieni maghfira yake, na atakusahilishieni mambo yenu kwa njia za kukufaeni katika maisha yenu. Haijuulikani kwa hakika ni nani hao Ahlil Kahf, wala zama zao, wala hilo pango lipo wapi walilo kimbilia hao vijana. Pamoja na hayo hapana ubaya kuchunguza, huenda pakapatikana mwangaza japo kidogo juu yake. Ilivyo kuwa Qur'ani Tukufu imetaja kuwa hao walikuwa ni vijana walio muamini Mola wao Mlezi basi hapana budi kuwa wao na watu wao waliteswa kwa sababu ya Dini, hata wakaona hao vijana wakimbilie pangoni kujificha. Na Taarikhi ya zamani inataja kuwa yalikuwako mateso ya dini katika nchi za Mashariki ya kale yaliyo tokea nyakati mbali mbali. Tutataja katika yafuatayo mateso mawili huenda moja wapo likaelekea na kisa hichi:- Ya kwanza yalitokea zama za mfalme wa Kisaluki, Antiokhus IV, aliye itwa kwa jina la kupanga Nabivanis (kiasi ya 176-84 K.K.). Huyo alipo shika ufalme wa Shamu, na akawa amemili mno kwenye ustaarabu wa Kigiriki na ilimu zake, aliwalazimisha Mayahudi wa Palistina, nayo ilikuwa chini ya Shamu tangu mwaka 194 K.K. washike dini ya Kigiriki, na akavunja sharia zao, na akanajisi Hekalu lao kwa kuweka humo sanamu la Zeus, mungu mkuu wa Magiriki, juu ya madhibahu (kibulani), na kumtolea mihanga ya nguruwe humo. Tena huyo mfalme aliteketeza kwa moto nakla za Taurati zote alizo zipata. Kwa mwangaza huu yaonekana kuwa hawa vijana walikuwa ni Mayahudi, na kwao ni popote katika Palastina, au khasa ni katika Yerusalemu. Na ikawa wakaamka mnamo mwaka 126 B.K. zama za utawala wa Warumi wa Mashariki. Yaani kabla ya kuzaliwa Mtume Muhammad s.a.w. (nako kulikuwa kiasi mwaka 571 B.K.) kwa kiasi ya miaka mia nne na arubaini na tano takriban. Ama mateso ya pili yalitokea zama za Mfalme wa Ufalme wa Kirumi, Hadriatus (117-138). Mfalme huyu aliwatenda Mayahudi kama alivyo watendea Antiokhus tuliye kwisha mtaja sawa sawa. Matokeo ya hayo ni kuwa Mayahudi walitangaza uasi dhidi ya utawala wa Kirumi mwaka 132. Wakawafukuza askari wa ulinzi wa Kirumi, wakaiteka Yerusalemu, na wakatoa sarafu yao ya makumbusho ya ugombozi wa Mji Mtakatifu. Wakashika khatamu za utawala kwa muda wa miaka mitatu. Mwishoni Hadriatus na jeshi lake wakagutuka, wakaushinda uasi, na wakairudisha Palastina chini ya ut'iifu, na wakairudisha Yerusalemu, na wakauvunjilia mbali uwananchi wa Kiyahudi kabisa. Viongozi wa Mayahudi wakauwawa na Mayahudi wakauzwa sokoni kuwa watumwa. Matokeo ya hayo ni kuwa mambo yote ya Kiyahudi aliyapiga marfuku Hadriatus na akapiga marfuku mafunzo ya Kiyahudi na sharia zao. Kwa mujibu wa mwangaza huu wa taarikhi yaonekana kuwa vijana hawa walikuwa ni Mayahudi, na pahala pao ni popote katika Mashariki ya kale, au katika Yerusalemu yenyewe. Yaonekana kuwa waliamshwa mnamo mwaka 435 B.K., yaani kabla ya kuzaliwa Mtume wetu s.a.w. kwa miaka mia na thalathini. Yaonekana kuwa yale mateso ya mwanzo yameelekeana zaidi na kisa hichi cha Watu wa Pangoni, kwa sababu yalikuwa ni ya shida zaidi. Ama mateso ya Kikristo hayaelekeani na kuzaliwa kwa Mtume s.a.w.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"wa-idhi iʿ'tazaltumūhum wamā yaʿbudūna illā al-laha fawū ilā al-kahfi yanshur lakum rabbukum min raḥmatihi wayuhayyi lakum min amrikum mir'faqan ","translations":["And when","you withdraw from them","and what","they worship","except","Allah","then retreat","to","the cave","Will spread","for you","your Lord","of","His Mercy","and will facilitate","for you","[from]","your affair","(in) ease","(16)"],"transliterationArr":["wa-idhi","iʿ'tazaltumūhum","wamā","yaʿbudūna","illā","al-laha","fawū","ilā","al-kahfi","yanshur","lakum","rabbukum","min","raḥmatihi","wayuhayyi","lakum","min","amrikum","mir'faqan",null],"verseTiming":[[1,0,620],[2,620,2580],[3,2580,3230],[4,3230,4440],[5,4440,5100],[6,5100,5980],[7,5980,8270],[8,8270,8620],[9,8620,9530],[10,9530,11000],[11,11000,12130],[12,12130,13720],[13,13720,14370],[14,14370,15610],[15,15610,16140],[16,16140,17660],[17,17660,18850],[18,18850,19490],[19,19490,20630],[20,20630,21680],[21,21680,24005]]}}