{"name":"21:32","price":"Na tukaifanya mbingu kuwa dari iliyo hifadhiwa, lakini wanazipuuza Ishara zake.","arabic":"وَجَعَلۡنَا ٱلسَّمَآءَ سَقۡفٗا مَّحۡفُوظٗاۖ وَهُمۡ عَنۡ ءَايَٰتِهَا مُعۡرِضُونَ","category":["21 (Al-Anbiya)","Al-Anbiya","Surah Al-Anbiya","Chapter Al-Anbiya","Anbiya","Surah Anbiya","Chapter Anbiya","Al Anbiya","Surah Al Anbiya","Chapter Al Anbiya","Surah 21","Chapter 21","The Prophets","الأنبيَاء"],"ayahNumber":2515,"juzNumber":17,"footnotes":"Na tumeifanya mbingu kama dari iliyo nyanyuliwa, na tukailinda isianguke, au visianguke viliomo humo. Na juu ya hayo, wao hawazioni wala hawaziingatii Ishara zetu zenye kuonyesha uweza wetu na hikima yetu na rehema yetu. Maoni ya wataalamu juu ya Aya 32: \"Na tukaifanya mbingu kuwa dari iliyo hifadhiwa lakini wanazipuuza Ishara zake. \": Aya hii tukufu imethibitisha kuwa mbingu na vyote viliomo ndani yake vimehifadhiwa visiwe na ila yoyote, na vimehifadhiwa visidondoke juu ya ardhi. Na mbingu ni kila kilicho juu yetu, kuanzia kifuniko hichi cha hewa inayo walinda walioko juu ya ardhi na khatari nyingi za angani ambazo zinazuia maisha, mfano wa vimondo vya nyota za mkia, na miyale. Na juu ya ardhi pana kifuniko cha hewa kinacho linda ardhi kwa nguvu za mvutano, na haifai kukosekana hivyo bila ya maangamizo kabisa. Na juu ya kifuniko cha hewa ndio kuna hizo sayari za mbinguni, na zipo kwa umbali mbali mbali kufuatana na nyendo zao tangu mwanzo. \"Na tukaifanya mbingu kuwa dari iliyo hifadhiwa\" yaani hizo sayari na vyote vilio mbinguni vyaonekana kwa nadhari yetu kama kwamba ni dari, na tunaona vilio juu ya vichwa vyetu kama ni vidogo kuliko vilioko upeo wa macho. Na hayo ni kiini macho tu, kama tunapo liona jua kubwa wakati wa kuchomoza na kuchwa kuliko adhuhuri. Na hili qubba la mbingu lina sifa zake, zinazo khitalifiana kila ukizidi mnyanyuko wa ardhi, kama hizo sayari za mbinguni kwa mujibu wa jicho linavyo ona katika qubba la mbingu.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"wajaʿalnā al-samāa saqfan maḥfūẓan wahum ʿan āyātihā muʿ'riḍūna ","translations":["And We made","the sky","a roof","protected","But they","from","its Signs","turn away","(32)"],"transliterationArr":["wajaʿalnā","al-samāa","saqfan","maḥfūẓan","wahum","ʿan","āyātihā","muʿ'riḍūna",null],"verseTiming":[[1,0,1060],[2,1060,3460],[3,3460,4230],[4,4230,6570],[5,6570,7120],[6,7120,7550],[7,7550,9060],[8,9060,11465]]}}