{"name":"21:30","price":"Je! Hao walio kufuru hawakuona kwamba mbingu na ardhi zilikuwa zimeambatana, kisha Sisi tukazibabandua? Na tukajaalia kwa maji kila kilicho hai? Basi je, hawaamini?","arabic":"أَوَلَمۡ يَرَ ٱلَّذِينَ كَفَرُوٓاْ أَنَّ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ كَانَتَا رَتۡقٗا فَفَتَقۡنَٰهُمَاۖ وَجَعَلۡنَا مِنَ ٱلۡمَآءِ كُلَّ شَيۡءٍ حَيٍّۚ أَفَلَا يُؤۡمِنُونَ","category":["21 (Al-Anbiya)","Al-Anbiya","Surah Al-Anbiya","Chapter Al-Anbiya","Anbiya","Surah Anbiya","Chapter Anbiya","Al Anbiya","Surah Al Anbiya","Chapter Al Anbiya","Surah 21","Chapter 21","The Prophets","الأنبيَاء"],"ayahNumber":2513,"juzNumber":17,"footnotes":"Wenye kukufuru wamepofuka, na hawaoni kuwa mbingu na ardhi hapo mwanzo zilikuwa zimeshikamana. Kwa uwezo wetu tukazibambandua mbali mbali. Na tukajaalia kutokana na maji, ambayo hayo si kitu hai, kila chenye uhai kutokana na hayo hayo. Basi je! Baada ya yote haya wangali kupuuza tu, na hawaamini kuwa bila ya shaka yoyote hapana mungu isipo kuwa Sisi? \"Je! Hao walio kufuru hawakuona kwamba mbingu na ardhi zilikuwa zimeambatana, kisha Sisi tukazibabandua? Na tukajaalia kwa maji kila kilicho hai? Basi je, hawaamini?\" Aya hii ina maana ya kisayansi yenye kutilia nguvu nadhariya ya ilimu za kisasa katika kuumbwa sayari na ardhi. Nayo ni kuwa mbingu na ardhi asili yao zilikuwa zimeshikamana. Na ukweli wa sayansi zinazo kubaliwa ni kuwa hakika ziliambatana, na sayansi mbali mbali zinathibitisha hayo. Na zipo nadhariya nyengine kadhaa wa kadhaa ambazo kwazo zaweza kuelezea dhaahiri ya mambo haya. Lakini bado kuthibiti nadhariya mojapo kwa njia ya mkato kwa wanazuoni kwa kuwafikiana wote. Kwa kuonyesha mfano tutaja nadhariya mbili: Nadhariya ya Kwanza: Imekhusu kuumbwa kwa mfumo wa jua (Solar System). Kwa mfano imethibiti kuwa mawingu au umande ulio zunguka jua ulianza kuenea kwenye anga lilio baridi, na chembechembe za gasi zinazo fanya hayo mawingu au moshi zikakusanyika kwenye chembechembe za vumbi linalo kwenda kwa kasi kubwa. Kisha chembechembe hizo zikawa zinagongana na zinarindika, na huku ndani yake zikawamo gasi nzito, na kukazidi kurindika na kujumuika kwa kupita mamilioni na mamilioni ya makarne mpaka zikafanyika sayari na mwezi na ardhi kwa umbali unao stahiki. Na yajuulikana kuwa huko kukusanyika na kurindika huzidisha mbinyo (Pressure), na huo huzidisha joto. Na gamba la ardhi lilipo ingia kupoa, na wakati zilipo ripuka volkano ardhi ikapata mvuke wa maji na gasi ya Carbon dioxide ilio tokana na miripuko ya volkano...na katika iliyo saidia kupatikana Oxygen katika hewa baada ya hapo ni nishati na nguvu za miyale ya jua kwa njia ya mwanga juu ya mimea na majani ya mwanzo. Ama Nadhariya ya Pili: Imekhusiana na uumbaji wa ulimwengu kwa jumla, ambao kwa mukhtasari unaelezwa na kauli yake Mtukufu: \"Zilikuwa zimeambatana\", yaani zimeshikamana na kuwa kitu kimoja. Na hayo ndiyo yaliyo fikilia mwishoni ilimu za sayansi katika uumbaji wa ulimwengu. Nayo ni kwamba kabla ya kufikilia sura yake hii ya sasa ulikuwa kama donge lilio kusanyika lenye kutisha, la mkusanyiko wa chembechembe zenye kuambatana chini ya mbinyo pressure, hata akili haiwezi kuifikiria. Na hizi sayari zote na nyota zilioko mbinguni hivi leo tunazo ziita mfumo wa jua solar system zilikuwa ni mkusanyiko wa donge moja lisilo zidi 1/2 diameter yake maili milioni tatu. Na neno lake Mwenyezi Mungu: \"Tukazibambandua\" linafahamisha ule mripuko mkubwa wa mwanzo wa ki-nuclear ukazalisha uumbaji wa anga na sayari za namna mbali mbali tunazo ziita kwa pamoja \"Mfumo wa Jua\" au Solar System. \"Na tukajaalia kwa maji kila kilicho hai\": Aya hii imethibitisha uhakika wa kisayansi ulio thibitishwa na ncha mbali mbali za ilimu. Imethibitisha Cytology, sayansi ya \"cells\", (khalaya), kwamba maji ni muhimu kabisa katika ujengaji wa \"cells\" zote za vitu vilivyo hai, ikiwa mimea au wanyama. Na ilimu ya \"Kimyaa\", Chemistry kwamba maji ni lazima yapatikane katika vitendo na mageuko yoyote katika viumbe vilivyo hai. Basi hayo maji ama yawe ni kiungo, kitu cha kusaidia, au cha kuwamo ndani ya kitendo, au ni matokeo yake. Na imethibitisha ilimu ya viungo physiology kwamba maji ni dharura kwa viungo kufanya kazi yao. Bila ya hayo maji hautodhihiri uhai katika viungo.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"awalam yara alladhīna kafarū anna al-samāwāti wal-arḍa kānatā ratqan fafataqnāhumā wajaʿalnā mina al-māi kulla shayin ḥayyin afalā yu'minūna ","translations":["Do not","see","those who","disbelieved","that","the heavens","and the earth","were","a joined entity","then We parted them","and We made","from","[the] water","every","living thing","living thing","Then will not","they believe","(30)"],"transliterationArr":["awalam","yara","alladhīna","kafarū","anna","al-samāwāti","wal-arḍa","kānatā","ratqan","fafataqnāhumā","wajaʿalnā","mina","al-māi","kulla","shayin","ḥayyin","afalā","yu'minūna",null],"verseTiming":[[1,0,900],[2,900,1250],[3,1250,2230],[4,2230,4380],[5,4380,5310],[6,5310,6870],[7,6870,7870],[8,7870,8760],[9,8760,9970],[10,9970,12130],[11,12130,14050],[12,14050,14350],[13,14350,17110],[14,17110,17660],[15,17660,18510],[16,18510,19320],[17,19320,20110],[18,20110,22725]]}}