{"name":"21:31","price":"Na tukaweka katika ardhi milima iliyo thibiti ili isiwayumbishe, na tukaweka humo njia pana ili wapate kuongoka.","arabic":"وَجَعَلۡنَا فِي ٱلۡأَرۡضِ رَوَٰسِيَ أَن تَمِيدَ بِهِمۡ وَجَعَلۡنَا فِيهَا فِجَاجٗا سُبُلٗا لَّعَلَّهُمۡ يَهۡتَدُونَ","category":["21 (Al-Anbiya)","Al-Anbiya","Surah Al-Anbiya","Chapter Al-Anbiya","Anbiya","Surah Anbiya","Chapter Anbiya","Al Anbiya","Surah Al Anbiya","Chapter Al Anbiya","Surah 21","Chapter 21","The Prophets","الأنبيَاء"],"ayahNumber":2514,"juzNumber":17,"footnotes":"Na katika dalili za uweza wetu ni kuwa tumeifanya milima imesimama imara kwenye ardhi ili isiyumbeyumbe nao watu, na tumefanya humo njia pana, za kupitia kwa wasaa, ili waweze kuongoza njia humo kwa makusudio yao. Maoni ya wataalamu juu ya Aya ya 31: \"Na tukaweka katika ardhi milima iliyo thibiti ili isiwayumbishe, na tukaweka humo njia pana ili wapate kuongoka.\" Ilivyo kuwa ndani ya ardhi kila kitu kimeyayuka, na lau kuwa milima imewekwa tu katika baadhi ya sehemu za huu mpira wa dunia kama majabali yaliyo nyanyuka juu tu, uzito wao ungeli sabibisha gamba la dunia liyumbe, au lipindane na kupasuka. Kwa hivyo Mwenyezi Mungu kwa utukufu wa shani yake ameifanya milima isimame imara kwa kuwa na mizizi iliyo zama kwenye gamba la ardhi mpaka chini kwenye kina kirefu kulingana na urefu wake kwendea juu. Kwa hivyo imekuwa hiyo milima kama vigingi, kama alivyo jaalia eneo la minyanyuka hii na mizizi ni duni kuliko maeneo ya gamba lilio zunguka. Yote haya ni kwa ajili ya kueneza sawa uzito wa juu ya gamba kwa pande zote ili pasiwepo kuyumbayumba na kupasuka. Kwani hakika kuenezwa kwa uzito juu ya uso wa dunia yakaribia kuwa hakuleti athari kubwa ya kutajika. Na ilimu za kisasa zimethibitisha kuwa kuenezwa kwa nchi kavu na maji juu ya ardhi, na kuwepo mfululizo wa milima juu yake ni katika yanayo hakikisha hali ilivyo ardhi, na imethibitika kuwa chini ya milima mizito kuna vitu vyepesi kubungunyika, na chini ya maji ya bahari kuu vipo vitu vizito. Kwa kuenezwa uzani wa namna hiyo mbali mbali katika dunia, na mgawanyo huu wa milima, makusudio yake ni kusawizisha uzani wa mpira huu wa ardhi. Na ilivyo nyanyuka milima zikatokea nyanda na mabonde na njia baina ya milima na mwambao na bahari na minyanyuko, na zikawa njia.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"wajaʿalnā fī al-arḍi rawāsiya an tamīda bihim wajaʿalnā fīhā fijājan subulan laʿallahum yahtadūna ","translations":["And We (have) placed","in","the earth","firmly set mountains","lest","it (should) shake","with them","and We made","therein","broad passes","(as) ways","so that they may","(be) guided","(31)"],"transliterationArr":["wajaʿalnā","fī","al-arḍi","rawāsiya","an","tamīda","bihim","wajaʿalnā","fīhā","fijājan","subulan","laʿallahum","yahtadūna",null],"verseTiming":[[1,0,1370],[2,1370,1600],[3,1600,2410],[4,2410,3510],[5,3510,4420],[6,4420,5260],[7,5260,6000],[8,6000,7160],[9,7160,8010],[10,8010,9550],[11,9550,10200],[12,10200,11640],[13,11640,13975]]}}