{"name":"21:44","price":"Bali tuliwastarehesha hawa na baba zao mpaka umri ukawa mrefu kwao. Je, hawaoni ya kwamba Sisi tunaifikia ardhi tukiipunguza ncha zake? Basi je! Hao ni wenye kushinda?","arabic":"بَلۡ مَتَّعۡنَا هَٰٓؤُلَآءِ وَءَابَآءَهُمۡ حَتَّىٰ طَالَ عَلَيۡهِمُ ٱلۡعُمُرُۗ أَفَلَا يَرَوۡنَ أَنَّا نَأۡتِي ٱلۡأَرۡضَ نَنقُصُهَا مِنۡ أَطۡرَافِهَآۚ أَفَهُمُ ٱلۡغَٰلِبُونَ","category":["21 (Al-Anbiya)","Al-Anbiya","Surah Al-Anbiya","Chapter Al-Anbiya","Anbiya","Surah Anbiya","Chapter Anbiya","Al Anbiya","Surah Al Anbiya","Chapter Al Anbiya","Surah 21","Chapter 21","The Prophets","الأنبيَاء"],"ayahNumber":2527,"juzNumber":17,"footnotes":"Sisi hatufanyi haraka kuwaadhibu hawa kwa ukafiri wao, lakini tunawapururia na kuwastarehesha katika uhai wa dunia, kama tulivyo wastarehesha baba zao kabla yao, mpaka umri ukawa mrefu kwao. Je! Wanajitia upofu hawaoni yanao wazunguka wakaona kuwa Sisi tunaiendea nchi na tukaipunguza ncha zake kwa ushindi wa Waumini? Ni wao ndio wenye kushinda au Waumini ambao Mwenyezi Mungu amewaahidi kuwasaidia na kuwaunga mkono? Maoni ya wataalamu juu ya Aya 44: \"Je, hawaoni ya kwamba Sisi tunaifikia ardhi tukiipunguza mipaka yake? Basi je! Hao ni wenye kushinda?\": Aya hii ni katika Aya za miujiza ya kisayansi katika Qur'ani Tukufu. Hii inaonyesha kuwa dunia si mduwara kaamili. Na wataalamu wa sayansi hawakutamakani kupima masafa ya dunia baraabara mpaka kiasi ya miaka 250 tu takriban, walipo ingia kikundi cha mabingwa walio khusika na ilimu ya kupima marefu baina ya daraja mbili za urefu longitudes. Na hayo kwa pahala mbali mbali duniani. Katika kupima huku ikadhihiri kuwa nusu ya kati ya dunia kwenye equator inazidi kuliko nusu ya poles kwa takriban kilomita 21.5. Yaani dunia imepungua katika ncha zake, yaani katika poles. Na inajuulikana maalumu kuwa sura ya dunia na masafa yake ndio msingi katika kuchorwa kwa ramani.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"bal mattaʿnā hāulāi waābāahum ḥattā ṭāla ʿalayhimu al-ʿumuru afalā yarawna annā natī al-arḍa nanquṣuhā min aṭrāfihā afahumu al-ghālibūna ","translations":["Nay","We gave provision","(to) these","and their fathers","until","grew long","for them","the life","Then do not","they see","that We","We come","(to) the land","We reduce it","from","its borders","So is (it) they","(who will be) overcoming","(44)"],"transliterationArr":["bal","mattaʿnā","hāulāi","waābāahum","ḥattā","ṭāla","ʿalayhimu","al-ʿumuru","afalā","yarawna","annā","natī","al-arḍa","nanquṣuhā","min","aṭrāfihā","afahumu","al-ghālibūna",null],"verseTiming":[[1,0,540],[2,540,1710],[3,1710,5850],[4,5850,8810],[5,8810,9620],[6,9620,10340],[7,10340,11360],[8,11360,13500],[9,13500,14280],[10,14280,15570],[11,15570,16500],[12,16500,17350],[13,17350,19040],[14,19040,19380],[15,19380,20990],[16,20990,22200],[17,22200,25465]]}}