{"name":"22:39","price":"Wameruhusiwa kupigana wale wanao pigwa vita kwa sababu wamedhulumiwa - na kwa yakini Mwenyezi Mungu ni Muweza wa kuwasaidia .","arabic":"أُذِنَ لِلَّذِينَ يُقَٰتَلُونَ بِأَنَّهُمۡ ظُلِمُواْۚ وَإِنَّ ٱللَّهَ عَلَىٰ نَصۡرِهِمۡ لَقَدِيرٌ","category":["22 (Al-Hajj)","Al-Hajj","Surah Al-Hajj","Chapter Al-Hajj","Hajj","Surah Hajj","Chapter Hajj","Al Hajj","Surah Al Hajj","Chapter Al Hajj","Surah 22","Chapter 22","The Pilgrimage","الحَجّ"],"ayahNumber":2634,"juzNumber":17,"footnotes":"Mwenyezi Mungu amewaruhusu Waumini wanao pigwa vita na washirikina wawarejezee uadui wao, kwa sababu ya dhulma iliyo wapata nao wakasubiri kwa muda mrefu. Na hakika Mwenyezi Mungu ni Mwenye kuweza kuwanusuru vipenzi vyake Waumini. \" Wameruhusiwa kupigana wale wanao pigwa vita kwa sababu wamedhulumiwa - na kwa yakini Mwenyezi Mungu ni Muweza wa kuwasaidia\" Yaliyo tajwa na Qur'ani Tukufu kukhusu hukumu iliomo katika Aya 39 yamezitangulia kanuni zilizo kuja kuwekwa na madola baada yake, nayo ni kuwa mtu kujitetea nafsi yake ni sharia vyovyote vile itavyo kuwa matokeo yake. Na kwamba mwenye kuitetea nafsi yake, na mali yake, na nchi yake, hawi ni mkosa mbele ya Mwenyezi Mungu na mbele ya uadilifu, ijapo kuwa ameuwa mtu au ameteketeza roho nyingi. Aya hii imepasisha kuwa Waislamu wanayo ruhusa kujitetea pindi wakivamiwa. Na kwa hivyo tunafahamu kuwa vita vya Waislamu vilikuwa vita vya utetezi na kujilinda si vita vya kushambulia na kuvamia. Na kwamba Waislamu waliusimamisha Uislamu na wakaupa nguvu kwa hoja zilizo wazi, na dalili zilizo dhaahiri.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"udhina lilladhīna yuqātalūna bi-annahum ẓulimū wa-inna al-laha ʿalā naṣrihim laqadīrun ","translations":["Permission is given","to those who","are being fought","because they","were wronged","And indeed","Allah","for","their victory","(is) surely Able","(39)"],"transliterationArr":["udhina","lilladhīna","yuqātalūna","bi-annahum","ẓulimū","wa-inna","al-laha","ʿalā","naṣrihim","laqadīrun",null],"verseTiming":[[1,0,700],[2,700,1960],[3,1960,3560],[4,3560,5670],[5,5670,6780],[6,6780,8730],[7,8730,9690],[8,9690,10400],[9,10400,11500],[10,11500,14105]]}}