{"name":"22:65","price":"Je! Huoni kwamba Mwenyezi Mungu amevidhalilisha kwenu viliomo katika ardhi, na marikebu zipitazo baharini kwa amri yake, na amezishika mbingu zisianguke juu ya ardhi ila kwa idhini yake. Hakika Mwenyezi Mungu ni Mwenye huruma kwa watu, Mwenye kurehemu.","arabic":"أَلَمۡ تَرَ أَنَّ ٱللَّهَ سَخَّرَ لَكُم مَّا فِي ٱلۡأَرۡضِ وَٱلۡفُلۡكَ تَجۡرِي فِي ٱلۡبَحۡرِ بِأَمۡرِهِۦ وَيُمۡسِكُ ٱلسَّمَآءَ أَن تَقَعَ عَلَى ٱلۡأَرۡضِ إِلَّا بِإِذۡنِهِۦٓۚ إِنَّ ٱللَّهَ بِٱلنَّاسِ لَرَءُوفٞ رَّحِيمٞ","category":["22 (Al-Hajj)","Al-Hajj","Surah Al-Hajj","Chapter Al-Hajj","Hajj","Surah Hajj","Chapter Hajj","Al Hajj","Surah Al Hajj","Chapter Al Hajj","Surah 22","Chapter 22","The Pilgrimage","الحَجّ"],"ayahNumber":2660,"juzNumber":17,"footnotes":"Ewe mwenye akili! Huyaangalii yaonekanayo kwa macho ya uwezo wa Mwenyezi Mungu, ukaona anavyo wasahilishia watu wote kunafiika na ardhi na viliomo ndani yake? Na akawatengenezea bahari za kwendea ndani yake marikebu kwa mujibu apendavyo Yeye? Na akazishika sayari zote ziliomo angani kwa kudra yake hata zisikosee mpango wake, au zikaangukia kwenye ardhi, isipo kuwa akitaka kwa mapenzi yake. Hakika Mwenyezi Mungu Aliye takasika ni Mwingi wa huruma na rehema kwa waja wake. Kwa hivyo amewatengenezea kila njia za maisha mema. Huwaje basi baada ya haya yote hamumsafii niya Yeye kwa kumshukuru na kumuabudu? \"Je! Huoni kwamba Mwenyezi Mungu amevidhalilisha kwenu viliomo katika ardhi, na marikebu zipitazo baharini kwa amri yake, na amezishika mbingu zisianguke juu ya ardhi ila kwa idhini yake. Hakika Mwenyezi Mungu ni Mwenye huruma kwa watu, Mwenye kurehemu.\" Aya hii tukufu inakusanya maana za kisayansi za ndani. Mbingu, nayo ni kila kilicho juu yetu, inaanza kwa kuifunika ardhi kwa hewa, tena kwa anga, tena kwa vyombo vya mbinguni vinavyo toa mwanga kama nyota n.k. na visio toa mwanga wake mwenyewe kama mwezi, na sayari nyengine, na nyota mkia, na vumbi la ulimwengu, n.k. Vyote hivi vinakuwa vilivyo na vinashikana kwa athari ya nguvu mbali mbali. Muhimu wa hizo ni mvuto na nguvu inayo tokana na kule kuzunguka kwao. Yamedhihiri mapenzi ya Mwenyezi Mungu na huruma zake kwa waja wake kuwa katengeneza kifuniko cha angani kina namna za gasi mbali mbali ambazo ni dharura kwa uhai. Kama pia anawalinda wakaazi wa duniani na mianga na vimondo n.k. vinavyo zunguka angani na ambavyo vinapo karibia kwenye ardhi huungua kabla havijafika chini. Na katika mapenzi yake na rehema yake Mwenyezi Mungu ni kuwa hivyo vimondo vinavyo anguka kwenye ardhi ni nadra sana kutokea, na hutokea mwahala wasipo kaa watu. Jambo hili la dhaahiri laonyesha huruma na rehema ya Mwenyezi Mungu kwa waja wake. Na haya yanatilia nguvu na kusadikisha kauli yake Mwenyezi Mungu: \" na amezishika mbingu zisianguke juu ya ardhi ila kwa idhini yake. Hakika Mwenyezi Mungu ni Mwenye huruma kwa watu, Mwenye kurehemu.\"","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"alam tara anna al-laha sakhara lakum mā fī al-arḍi wal-ful'ka tajrī fī al-baḥri bi-amrihi wayum'siku al-samāa an taqaʿa ʿalā al-arḍi illā bi-idh'nihi inna al-laha bil-nāsi laraūfun raḥīmun ","translations":["Do not","you see","that","Allah","(has) subjected","to you","what","(is) in","the earth","and the ships","that sail","through","the sea","by His Command","And He withholds","the sky","lest","it falls","on","the earth","except","by His permission","Indeed","Allah","to mankind","(is) Full of Kindness","Most Merciful","(65)"],"transliterationArr":["alam","tara","anna","al-laha","sakhara","lakum","mā","fī","al-arḍi","wal-ful'ka","tajrī","fī","al-baḥri","bi-amrihi","wayum'siku","al-samāa","an","taqaʿa","ʿalā","al-arḍi","illā","bi-idh'nihi","inna","al-laha","bil-nāsi","laraūfun","raḥīmun",null],"verseTiming":[[1,0,610],[2,610,1070],[3,1070,2080],[4,2080,2970],[5,2970,3850],[6,3850,4360],[7,4360,5360],[8,5360,5620],[9,5620,6460],[10,6460,7430],[11,7430,8230],[12,8230,8510],[13,8510,9340],[14,9340,10800],[15,10800,11780],[16,11780,12570],[17,12570,12840],[18,12840,13690],[19,13690,14810],[20,14810,15880],[21,15880,18420],[22,18420,19410],[23,19410,20240],[24,20240,20440],[25,20440,21290],[26,21290,22060],[27,22060,23550],[28,23550,24820],[29,24820,25620],[30,25620,27310],[31,27310,28300],[32,28300,30865]]}}