{"name":"23:18","price":"Na tumeteremsha kutoka mbinguni maji kwa kiasi na tukayatuliza katika ardhi. Na hakika Sisi tunaweza kuyaondoa.","arabic":"وَأَنزَلۡنَا مِنَ ٱلسَّمَآءِ مَآءَۢ بِقَدَرٖ فَأَسۡكَنَّٰهُ فِي ٱلۡأَرۡضِۖ وَإِنَّا عَلَىٰ ذَهَابِۭ بِهِۦ لَقَٰدِرُونَ","category":["23 (Al-Mu'minun)","Al-Mu'minun","Surah Al-Mu'minun","Chapter Al-Mu'minun","Mu'minun","Surah Mu'minun","Chapter Mu'minun","Al Mu'minun","Surah Al Mu'minun","Chapter Al Mu'minun","Surah 23","Chapter 23","The Believers","المُؤمِنُون"],"ayahNumber":2691,"juzNumber":18,"footnotes":"Na Sisi tumeteremsha kutoka mbinguni mvua kwa hikima na kipimo katika umbo lake na kuteremka kwake. Na kusahilisha kwa ajili ya manufaa tumeijaalia ikae juu ya uso wa ardhi na ndani yake chini. Na Sisi hakika ni wenye kuweza kuiondoa wasipate kunafiika nayo. Lakini hatukufanya hayo kwa kukuoneeni huruma. Basi muaminini Mwenye kuiumba na mumshukuru. \"Na tumeteremsha kutoka mbinguni maji kwa kiasi na tukayatuliza katika ardhi. Na hakika Sisi tunaweza kuyaondoa.\" Aya hii tukufu inaashiria maana ya kisayansi yenye kukhusu mzunguko wa maji katika ardhi. Yajuulikana kuwa mvuke unao paa kutoka baharini hupelekea kufanyika mawingu ambayo ndiyo huteremsha mvua. Na hivyo ndio chanzo cha maji matamu juu ya uso wa ardhi, na ndio chombo cha msingi cha uhai wa ardhini. Kutokana na mvua ndio huzuka mito inayo zua uhai katika sehemu kamwe zisio pitikiwa na mvua. Kisha hiyo mito inamiminika baharini, na khulka inarejea tena kutoka baharini kwenda angani na kwendea nchi kavu, na kisha kuingia baharini mara ya pili. Isipo kuwa baadhi ya hayo maji ya mvua yanatulia na yanazama kuhifadhika katika mahodhi ya chini ya ardhi, yakawekeka kwa muda mrefu. Mfano wa hayo ni hayo maji yanayo patikana chini ya Jangwa la Magharibi katika Libya, ambayo yamegunduliwa na watafiti hivi karibuni kutokana na asli yake ya kale. Na huenda maji kama haya yalio hifadhika chini yakapatwa na mabadiliko ya joto wanayo yaita wataalamu wa ilimu ya t'abaka za ardhi (Geology) kuwa ni Mikondo ya Jiolojia, ikenda hiyo na maji mpaka pahala pengine pakavu, ikaleta uhai baada ya kuwa ni maiti. Na Aya hii inaonyesha hikima kubwa ya uenezaji wa maji kwa kipimo, yaani kipimo cha haki na hikima, kwa ajili ya kuleta manufaa na kupinga madhara. Na tena maana nyengine ya Aya tukufu ni kufahamisha apendavyo Mwenye Kuumba, Aliye tukuka, navyo ni kujaalia yawepo maji ya kiasi maalumu katika bahari za ulimwengu kutosha kuwepo mizani ya joto la kufaa katika sayari hii, na ili isiwepo khitilafu kubwa mno baina ya joto la siku za joto, na baridi ya siku za baridi, hata ikawa ni muhali kubakia uhai, kama ilivyo katika sayari nyengine na katika mwezi. Kadhaalika maji ya ardhi yanateremka kwa kiasi maalumu, hayazidi yakafunika ardhi yote, wala hayatindikii sana hata yasipatikane hata kidogo kunyweshea baadhi ya nchi kavu.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"wa-anzalnā mina al-samāi māan biqadarin fa-askannāhu fī al-arḍi wa-innā ʿalā dhahābin bihi laqādirūna ","translations":["And We send down","from","the sky","water","in (due) measure","then We cause it to settle","in","the earth","And indeed, We","on","taking it away","taking it away","surely (are) Able","(18)"],"transliterationArr":["wa-anzalnā","mina","al-samāi","māan","biqadarin","fa-askannāhu","fī","al-arḍi","wa-innā","ʿalā","dhahābin","bihi","laqādirūna",null],"verseTiming":[[1,0,2430],[2,2430,2780],[3,2780,5180],[4,5180,7870],[5,7870,8709],[6,8709,11929],[7,11929,12179],[8,12179,13489],[9,13489,15439],[10,15439,16099],[11,16099,17139],[12,17139,18609],[13,18609,21784]]}}