{"name":"23:20","price":"Na mti utokao katika mlima wa Sinai, unatoa mafuta na kuwa kitoweo kwa walao.","arabic":"وَشَجَرَةٗ تَخۡرُجُ مِن طُورِ سَيۡنَآءَ تَنۢبُتُ بِٱلدُّهۡنِ وَصِبۡغٖ لِّلۡأٓكِلِينَ","category":["23 (Al-Mu'minun)","Al-Mu'minun","Surah Al-Mu'minun","Chapter Al-Mu'minun","Mu'minun","Surah Mu'minun","Chapter Mu'minun","Al Mu'minun","Surah Al Mu'minun","Chapter Al Mu'minun","Surah 23","Chapter 23","The Believers","المُؤمِنُون"],"ayahNumber":2693,"juzNumber":18,"footnotes":"Na tumekuumbieni mti wa zaituni unao ota katika jimbo la Mlima wa Sinai. Katika matunda yake yanapatikana mafuta yanayo kufaeni. Na hizo zaituni ni kitoweo cha chakula kwa wanao kula. \"Na mti utokao katika mlima wa Sinai, unatoa mafuta na kuwa kitoweo kwa walao.\" Aya hii tukufu inathibitisha kuwa mti wa zaituni ni miongoni mwa neema alizo mneemesha Mwenyezi Mungu binaadamu na ambazo baadhi yake zimetajwa katika Aya zilizo tangulia. Na la kuongeza kwenye Aya hii ni kuwa mzaituni ni miongoni mwa miti ya mbao inayo ishi muda mrefu sana, zaidi ya mamia ya miaka. Kwa hivyo hauhitajii juhudi kubwa kwa mtu, bali huendelea kuzaa wenyewe mfululizo. Kadhaalika una sifa ya kuwa daima kijani, unapendeza kuutazama. Uchunguzi wa kisayansi unaonyesha kwamba zaituni ni katika chakula kizuri. Kwani ndani yake imo Protein nyingi. Vile vile zimo chumvi za Calcium, chuma na Phospohorous. Na hivi ni muhimu na vya kutegemewa katika chakula cha binaadamu. Na juu ya hivyo zaituni inayo Vitamin A na Vitamin B. Na kutokana na tunda lake hutolewa mafuta ya zaituni, ambayo ni mafuta bora ya mafuta mepesi. Mafuta haya hutumiwa katika chakula. Uchunguzi wa kitabibu unaongeza kusema kuwa zipo faida nyengine katika mafuta ya zaituni, nazo ni kuwa zinasaidia kwa jumla katika viungo vya usagaji wa chakula, na khasa maini. Nayo yanashinda ubora mafuta yote yanayo tokana na mimea na wanyama, kwa kuwa hayasabibishi maradhi ya mishipa ya damu kama mafuta mengineyo, na kadhaalika yanalainisha ngozi. Na mafuta ya zaituni yana matumizi mengine mengi katika sanaa (ufundi), kwani yanatumiwa katika kufanya sabuni nzuri kabisa, na vitu vinginevyo katika ufanyaji wa vyakula na vitu vya sanaa.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"washajaratan takhruju min ṭūri saynāa tanbutu bil-duh'ni waṣib'ghin lil'ākilīna ","translations":["And a tree","(that) springs forth","from","Mount Sinai","Mount Sinai","(which) produces","oil","and a relish","for those who eat","(20)"],"transliterationArr":["washajaratan","takhruju","min","ṭūri","saynāa","tanbutu","bil-duh'ni","waṣib'ghin","lil'ākilīna",null],"verseTiming":[[1,0,2130],[2,2130,3060],[3,3060,4410],[4,4410,4930],[5,4930,7150],[6,7150,8760],[7,8760,9760],[8,9760,10680],[9,10680,14095]]}}