{"name":"23:5","price":"Na ambao wanazilinda tupu zao!","arabic":"وَٱلَّذِينَ هُمۡ لِفُرُوجِهِمۡ حَٰفِظُونَ","category":["23 (Al-Mu'minun)","Al-Mu'minun","Surah Al-Mu'minun","Chapter Al-Mu'minun","Mu'minun","Surah Mu'minun","Chapter Mu'minun","Al Mu'minun","Surah Al Mu'minun","Chapter Al Mu'minun","Surah 23","Chapter 23","The Believers","المُؤمِنُون"],"ayahNumber":2678,"juzNumber":18,"footnotes":"Nao wanajihifadhi nafsi zao wasiingiane na wanawake. \"Na ambao wanazilinda tupu zao, isipo kuwa kwa wake zao au kwa iliyo wamiliki mikono yao ya kulia. Kwani hao si wenye kulaumiwa. Lakini anaye taka kinyume cha haya, basi hao ndio warukao mipaka.\" Aya hizi zinaambatana na Aya nyengine ziliomo katika Suratun Nur zilio anzia: \"Mzinifu mwanamke na mzinifu mwanamume, mpigeni kila mmoja wao bakora mia.\" Hakika Aya hizi tukufu zilizo tajwa zinaashiria maovu ya katika umma yanayo tokea kwa uzinzi. Ama katika umma ni kuvurugika nasaba ya watoto isijuulikane, ama katika siha ni sehemu mbili. KWANZA ni katika mwili, mfano wa kisonono, tego, AIDS n.k. Kisonono huweza kuzalisha maradhi ya urithi kwa watoto hata huweza kuleta upofu. Ama tego (Syphilis) huenea katika mishipa ya damu na ya hisiya na huweza kuishia wazimu, na pia huenea mpaka kwa vizazi, na huenda mtoto akafa tumboni au akatoka na kilema. Ama maradhi ya AIDS (Ukimwi) hayo ni maafa yasiyo semeka, Mwenyezi Mungu atulinde nayo. PILI ni kuathirika mishipa ya hisiya na akili, kwani uzinzi huweza kuathiri dhamiri ya mtu, na kuadhibika nayo, na hata mwishoe huweza kuingia wazimu.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"wa-alladhīna hum lifurūjihim ḥāfiẓūna ","translations":["And those who","[they]","of their modesty","(are) guardians","(5)"],"transliterationArr":["wa-alladhīna","hum","lifurūjihim","ḥāfiẓūna",null],"verseTiming":[[1,0,1380],[2,1380,1720],[3,1720,3330],[4,3330,7575]]}}