{"name":"23:71","price":"Na lau kuwa Haki ingeli fuata matamanio yao, basi zingeli haribika mbingu na ardhi na waliomo ndani. Bali tumewaletea ukumbusho wao, nao wanajitenga mbali na ukumbusho wao.","arabic":"وَلَوِ ٱتَّبَعَ ٱلۡحَقُّ أَهۡوَآءَهُمۡ لَفَسَدَتِ ٱلسَّمَٰوَٰتُ وَٱلۡأَرۡضُ وَمَن فِيهِنَّۚ بَلۡ أَتَيۡنَٰهُم بِذِكۡرِهِمۡ فَهُمۡ عَن ذِكۡرِهِم مُّعۡرِضُونَ","category":["23 (Al-Mu'minun)","Al-Mu'minun","Surah Al-Mu'minun","Chapter Al-Mu'minun","Mu'minun","Surah Mu'minun","Chapter Mu'minun","Al Mu'minun","Surah Al Mu'minun","Chapter Al Mu'minun","Surah 23","Chapter 23","The Believers","المُؤمِنُون"],"ayahNumber":2744,"juzNumber":18,"footnotes":"Ingeli kuwa Haki inafuata matamanio yao ufisadi ungeli enea ulimwenguni, na hawa za nafsi zingeli pambana wenyewe kwa wenyewe. Lakini Sisi tumewapelekea Qur'ani ambayo inawakumbusha haki ambayo inapasa wote wajumuike juu yake. Na juu ya hivyo wao wanayapuuza hayo. \"Na lau kuwa Haki ingeli fuata matamanio yao, basi zingeli haribika mbingu na ardhi na waliomo ndani. Bali tumewaletea ukumbusho wao, nao wanajitenga mbali na ukumbusho wao.\" Hilo neno \"Haki\" ni tamko lenye maana kadhaa. Huweza kuwa maana yake ni \"Mwenyezi Mungu\" Subhanahu wa Taa'la , mfano wa kauli yake Mtukufu: \"Ametukuka Mwenyezi Mungu wa Haki\". Pengine huwa maana yake ni \"Qur'ani\" , kwa mfano :\"Hakika Sisi tumekutuma kwa Haki\". Na huenda kukusudiwa \"Dini yote\", yaani miongoni mwake ni Qur'ani na Sunna (Hadithi) Sahihi, mfano wa kauli yake: \"Na sema: Imekuja Haki na uwongo umetoweka\". Na iliyo dhaahiri katika tamko la Haki hapa ni kuwa makusudio yake ni ile maana ya kwanza, yaani \"Mwenyezi Mungu\" Aliye takasika na kutukuka. Na kwa hivyo maana iliyo kusudiwa na Aya ni: Lau kuwa mwenendo wa Mwenyezi Mungu unafuatana na watakayo na wanayo yapendekeza makafiri mpango usingeli bakia katika hali iliyo simamia shani ya mpango wa mbingu na ardhi na wa viumbe viliomo ndani yake. Lakini Mwenyezi Mungu Mwenye hikima kuu na uwezo wa kutenda na ujuzi wake ulio enea kwa viumbe vyake na hikima yake ikadhamini kwa mpango madhubuti, na Qur'ani kusema kwa uwazi ya kwamba mbingu zina viumbe, anatuelekeza tufahamu: Kwanza kuwa Kuamini hayo kwa jumla ni yakini, tuache tafsili yake mpaka apendavyo Mwenyezi Mungu Subhanahu kuidhihirisha kwa kuambatana na kauli yake: \"Tutawaonyesha Ishara zetu angani na katika nafsi zao.\" Pili: Anatuelekeza kwenye utafiti wa kisayansi kama tunaweza \"kwani kufikilia hakika hii inatutilia nguvu Imani yetu. Na Imani ndiyo lengo muhimu katika kuelekea kwetu kwenye Ishara hizo.\"","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"walawi ittabaʿa al-ḥaqu ahwāahum lafasadati al-samāwātu wal-arḍu waman fīhinna bal ataynāhum bidhik'rihim fahum ʿan dhik'rihim muʿ'riḍūna ","translations":["But if","(had) followed","the truth","their desires","surely (would) have been corrupted","the heavens","and the earth","and whoever","(is) therein","Nay","We have brought them","their reminder","but they","from","their reminder","(are) turning away","(71)"],"transliterationArr":["walawi","ittabaʿa","al-ḥaqu","ahwāahum","lafasadati","al-samāwātu","wal-arḍu","waman","fīhinna","bal","ataynāhum","bidhik'rihim","fahum","ʿan","dhik'rihim","muʿ'riḍūna",null],"verseTiming":[[1,0,760],[2,760,1560],[3,1560,2340],[4,2340,5240],[5,5240,6240],[6,6240,7740],[7,7740,8680],[8,8680,10110],[9,10110,12030],[10,12030,13020],[11,13020,15130],[12,15130,16310],[13,16310,16900],[14,16900,17960],[15,17960,19040],[16,19040,22705]]}}