{"name":"23:80","price":"Na Yeye ndiye anaye huisha na kufisha, na yake Yeye mabadiliko ya usiku na mchana. Basi je! Hamfahamu?","arabic":"وَهُوَ ٱلَّذِي يُحۡيِۦ وَيُمِيتُ وَلَهُ ٱخۡتِلَٰفُ ٱلَّيۡلِ وَٱلنَّهَارِۚ أَفَلَا تَعۡقِلُونَ","category":["23 (Al-Mu'minun)","Al-Mu'minun","Surah Al-Mu'minun","Chapter Al-Mu'minun","Mu'minun","Surah Mu'minun","Chapter Mu'minun","Al Mu'minun","Surah Al Mu'minun","Chapter Al Mu'minun","Surah 23","Chapter 23","The Believers","المُؤمِنُون"],"ayahNumber":2753,"juzNumber":18,"footnotes":"Na Yeye ndiye anaye huisha na kufisha, na kwa amri yake na sharia zake ndio usiku na mchana zinapitishana. Na kukhitalifiana kwazo kwa urefu na ufupi, hamzingatii hiyo kuwa ni dalili ya uwezo wake na kupasa kumuamini Yeye na kuamini kufufuliwa? \"Na Yeye ndiye anaye huisha na kufisha, na yake Yeye mabadiliko ya usiku na mchana. Basi je! Hamfahamu?\" Aya zenye kutaja usiku na mchana zimekuja mwahala mwingi katika Qur'ani tukufu, na haya yanaonyesha kuwa Mwenyezi Mungu wa Haki, Aliye takasika na kutukuka, anawakumbusha waja wake kwa Ishara hii ya uumbaji; na kwa kuwa yamo maana ya ndani inawapelekea wenye kufikiri wazidi kuzingatia na kuchungua. Na kukhitalifiana usiku na mchana kunatokana na pande mbili kubwa: Kwanza: Kukhitalifiana kwa wakati, urefu na ufupi. Na Pili: Kukhitalifiana kwa dhaahiri ya tabia na isiyo onekana. Kwanza - Khitilafu kwa nyakati: Mchana ni kipindi cha wakati baina ya kudhihiri ncha ya jua na inapo potea upeo wa macho, pale linapoonekana kwa jicho kama linagusa uso wa ardhi. Na ilivyo kuwa kwa hakika pale pahali pake pa kuzama jua sipo hapo upeo wa macho, bali tunaona tu hivyo kwa kuwa miale inayo tokana na jua inapinda inapo pita katika matabaka ya anga mpaka inapo fikilia kwenye jicho la mtazamaji, na yeye akaliona jua kama lipo huko upeo wa macho. Lilio kweli ni kuwa kuzama huku kuko chini kuliko upeo wa macho kwa kadri ya dakika 35 kwa kipimo cha mduara. Na Usiku ni kipindi cha kutimiliza wakati wa mchana mpaka kitimilie kipindi cha mzunguko wa ardhi juu ya nafsi yake kutoka magharibi kwendea mashariki. Na baina ya Usiku na Mchana vipo vipindi viwili, navyo vya magharibi na mapambazuko. Na kipindi cha mchana kinakhitalifiana kwa mujibu wa hali ya uwazi wa pahala na musimu wa mwaka. Hali kadhaalika kipindi cha usiku kinakhitalifiana hivyo hivyo kwa kufuatana haya. Na nyakati za Swala na Saumu zinawekwa kufuatana na matulio ya jua huko upeo wa macho. Pili - Khitilafu katika yanayo dhihiri katika tabia: Na madhaahiri haya ni ya namna nyingi, na yanazalikana kutokana na michanganyiko ya miale ya jua, inayo onekana na isiyo onekana, na vitu vilio beba nguvu za umeme pamoja na vifuniko vya anga na nyuso za bahari na majangwa n.k. Kadhaalika yapo mambo ya kuonekana kama kupatwa kwa jua na mwezi, na nyota zenye kufanya mikia, nyota za dasturi na nyota ziendazo na mawingu meupe, na nyota zinazo anguka, na ambazo hufumbwa na ukali wa anga la jua kuonekana mchana, ilhali usiku huonekana wazi. Na muhimu kabisa katika yanayo onekana kuwa ni khitilafu baina ya usiku na mchana ni huu mwangaza wa mchana. Na sababu yake ni kuwa miale inayo toka kwenye jua inapo piga juu ya funiko la anga, ambalo kwa hakika ni sehemu ndogo ndogo zenye chembe chembe ndogo mno za vumbi, hizo hurejesha mwangaza na kuutawanya pande mbali mbali. Ikiwa hali ya anga ni safi, na vile vichembe chembe vya vumbi ni vidogo sana, na jua liko upeo wa macho, basi rangi inayo enea zaidi na inayo onekana kwa macho zaidi, inakuwa ya kibuluu. Ama wakati wa kuchomoza jua au kuchwa basi mbingu huonekana na rangi ya machungwa yenye kupiga wekundu, na mwangu wa kibuluu unatawanyika. Nz kwa hivyo mbingu utosini huelekea kuwa kibuluu khafifu. Na wakati wa kuchwa jua tunaona rangi ya kijani kiasi ya nukta moja hivi au akali pembezoni mwake. Huu huitwa mmetuko wa kijani, na aghlabu yake huonekana unapo kuwa baharini, au nyuma ya kilele cha mlima, au hata kwenye kuta za majumba. Na asli ya kuonekana hivi ni kwa ajili ya kugeuka na kutawanyika miale ya jua hata ikatoa rangi mbali mbali katika hizo kijani. Mukhtasari wa haya ni kuwa miale ya jua ina rangi zinazo onekana na zisizo onekana. Na zinakhitalifiana kwa urefu wa mawimbi yake na kufuata kwake sifa hiyo. Kwa hivyo ndio tunaona kwa migongano hiyo mwangaza wa mchana, mazigazi (sarabi), upinde wa mvua, na rangi za aina mbali mbali zinazo zunguka jua, na mengineyo katika Ishara za mbinguni za ulimwengu tuuonao. Na linapo potea jua jioni mbingu inaonekana kwa rangi mbali mbali kwa sababu ya kuparaganyika mwangaza katika matabaka ya anga la juu. Na kila jua likiteremka unapungua mwangaza wa jioni, na zinapungua zile rangi zake za tabia, mpaka likifikilia daraja ya duara 18.5 mbingu inakuwa kiza. Na wataalamu wa nyakati wameweka kuwa huu ndio wakati wa kuambiwa kuwa usiku umekuwa giza na kwa hivyo ndio wakati wa kuadhinia Sala ya Isha. Na wakati huo khasa ndio huanza mwangaza wa nyota kama sura ya mnara wa sukari na tako lake liko upeo wa magharibi. Na hivyo huendelea katika masiku safi ya siku za baridi mpaka kilele cha ile \"cone\" au \"makhruut'\" yaani sura ya mnara wa sukari kifikie utosini. Na kati kati ya usiku hudhihiri rangi za kuchomoza jua kidogo kidogo wakati wa mapambazuko kwanza kama kilele cha ile \"cone\" au \"makhruut'\" . Kilele chake hicho huzidi kupanda , na tako lake hutanuka kwenye upeo wa mashariki mpaka inapo dhihiri alfajiri, yaani linapo kuwa jua liko chini ya upeo wa macho wa mashariki kwa kadri ya daraja 18.5 za duara. Na hapo ndio wakati wa kuadhiniwa Swala ya Alfajiri. Na rangi za mapambazuko huanza kudhihiri kwa taratibu kinyume na zile za kuchwea jua magharibi. Na imedhihiri karibuni kuwa jua lina kifuniko chembamba kimetanda angani takriban kimekaribia kufunika anga lote la ardhi. Kifuniko hichi chembemba ndicho kinacho sabibisha kuleta rangi mbali mbali za katika anga. Mambo haya mbali mbali ambayo tumeyataja kama ni mifano isiyo na ukomo imetuonyesha vipi mbingu inavyo kuwa pindi ikiwa hapana mawingu wala hapana pepo za mchanga. Kwani hapo tena huwa ni kiza. Na ikiwa mawingu yamebeba matone ya maji ya mvua basi hayo hupambana na miale ya jua, na hufanyika kama huo upinde wa mvua katika hali maalumu. Na ikiwa mawingu yenyewe ni ya namna fulani ambayo yanabeba maji yaliyo ganda (crystals) \"kristali\" zenye pande sita, basi maji hayo huingiana na miale ya jua na hiyo miale huvunjika ndani ya hayo maji (kama mwaangaza upitavyo katika kigae cha thuraya, \"prism\") kisha mwangaza huo ukatoka nje kwa rangi mbali mbali. Na katika hali fulani fulani ndio hutokea rangi nzuri nzuri kulizunguka jua. Na wakati wa weusi wa usiku utaziona nyota kama kwamba zipo karibu nasi na kwa hakika hizo ziko mbali kwa masafa makubwa sana ya kukisiwa kwa miaka na miaka ya mwendo wa mwanga. Vile vile tunaona katika anga hili nyota na sayari na nyota mkia na vimondo kama kwamba zipo karibu, utadhani kuwa khitilafu ya masafa imeondoka kabisa. Na haya ndiyo yanayo tupelekea tutambue maana iliyo fichikana ya kauli ya Mwenyezi Mungu Mtukufu: \"Na tumeifanya mbingu kama dari iliyo hifadhiwa; nao wamezipuuza Ishara zetu.\" Kama tulivyo kwisha eleza kuwa juu ya miale inayo tokana na jua kuna miale inayo tokana na vitu vingine vya eneo la jua vyenye nishat'i ya nguvu, na vyenye kubeba nguvu za umeme. Kadhaalika inatokana na hizo miale iliyo juu ya zambarau Ultra Violet Rays. Vitu hivi na miale hii inapambana na matabaka ya anga la juu, na huathirika kwa mvuto wa smaku kuizunguka dunia. Kwa hivyo hulitibua anga la kaskazini na kusini, na huleta kiza katika mbingu ya kaskaazini kama kwamba ni pazia kuzuia mianga yenye rangi nzuri nzuri za kijani zenye kumili kwenye wekundu na kibuluu. Sura hizi hubaki pengine muda wa saa kadhaa katika mbingu ya kaskazini, na zaidi waweza kuziona masiku kadhaa wa kadhaa linapo kuwa jua linashitadi. Mapazia haya si kama unayaona kaskazini tu, bali hata pia katika kati kati ya dunia. Na katika mbingu vipo vibebaji nguvu za umeme katika mawingu na anga ambavyo huzalikana kutokana navyo radi na mimetuko katika anga la juu. Mambo yote haya yanayo onekana ambayo tunayashuhudia yanatupelekea tufahama maana ya ndani ya kauli yake Subhanahu wa Taa'la: \"Hakika katika kuumbwa kwa mbingu na ardhi na kukhitalifana usiku na mchana pana Ishara kwa wenye akili.\" Kutokana na yaliyo pita kwa mambo ya dhaahiri ya maumbile inabainikana kwamba haya yanakuwa kwa sababu ambazo hayumkini mwanaadamu kuingilia ndani yake. Na hakika ni Mwenyezi Mungu, Aliye tukuka shani yake, ndiye mwenye kuleta hizo khitilafu za usiku na mchana, wala hawezi binaadamu kabisa siku yoyote kuweza kugeuza usiku wala mchana. Na Yeye Mwenyezi Mungu Aliye tukuka shani yake ndiye anaye zifuatanisha usiku na mchana kwa mizani madhubuti na vipimo baraabara, na anaendesha siku zote mwaka ingia mwaka toka.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"wahuwa alladhī yuḥ'yī wayumītu walahu ikh'tilāfu al-layli wal-nahāri afalā taʿqilūna ","translations":["And He","(is) the One Who","gives life","and causes death","and for Him","(is the) alternation","(of) the night","and the day","Then will not","you reason","(80)"],"transliterationArr":["wahuwa","alladhī","yuḥ'yī","wayumītu","walahu","ikh'tilāfu","al-layli","wal-nahāri","afalā","taʿqilūna",null],"verseTiming":[[1,0,590],[2,590,1440],[3,1440,2270],[4,2270,3280],[5,3280,3830],[6,3830,4770],[7,4770,5580],[8,5580,9299],[9,9299,10509],[10,10509,14184]]}}