{"name":"24:45","price":"Na Mwenyezi Mungu ameumba kila kinyama kutokana na maji. Wengine katika wao huenda kwa matumbo yao, na wengine huenda kwa miguu miwili, na wengine huenda kwa miguu mine. Mwenyezi Mungu huumba ayatakayo. Hakika Mwenyezi Mungu ni Muweza wa kila kitu.","arabic":"وَٱللَّهُ خَلَقَ كُلَّ دَآبَّةٖ مِّن مَّآءٖۖ فَمِنۡهُم مَّن يَمۡشِي عَلَىٰ بَطۡنِهِۦ وَمِنۡهُم مَّن يَمۡشِي عَلَىٰ رِجۡلَيۡنِ وَمِنۡهُم مَّن يَمۡشِي عَلَىٰٓ أَرۡبَعٖۚ يَخۡلُقُ ٱللَّهُ مَا يَشَآءُۚ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ","category":["24 (An-Nur)","An-Nur","Surah An-Nur","Chapter An-Nur","Nur","Surah Nur","Chapter Nur","An Nur","Surah An Nur","Chapter An Nur","Surah 24","Chapter 24","The Light","النُّور"],"ayahNumber":2836,"juzNumber":18,"footnotes":"Mwenyezi Mungu ndiye Muumba wa kila kitu. Na ndiye aliye anzisha kila kitu kwa kupenda kwake. Na akaumba kila kilicho hai kutokana na asili moja ya shirika, nayo ni maji. Na kwa hivyo kila kihai hakiachi kuwa na maji. Kisha zinawakhitalifisha khitilafu nyengine kwa namna, na uwezo, na sura, na kadhaalika. Katika wanyama wapo wanao tambaa kwa matumbo yao, kama samaki, na nyoka. Na wapo wanao kwenda kwa miguu miwili kama wanaadamu na ndege. Na wapo wanao kwenda kwa miguu mine kama mahayawani wengi wa kufugwa na wa mwituni. Mwenyezi Mungu huumba apendavyo kwa njia mbali mbali, kuonyesha uwezo wake na ujuzi wake. Kwani ni Mwenye kutaka atakacho, na Mwenye kukhitari apendacho. Na Yeye ni Muweza wa kila kitu. \"Na Mwenyezi Mungu ameumba kila kinyama kutokana na maji. Wengine katika wao huenda kwa matumbo yao, na wengine huenda kwa miguu miwili, na wengine huenda kwa miguu mine. Mwenyezi Mungu huumba ayatakayo. Hakika Mwenyezi Mungu ni Muweza wa kila kitu.\" Maji katika Aya hii tukufu ni maji ya uzazi, yaani vinyama vinavyo toa manii. Na Aya hii si kama imetangulia msafara wa sayansi katika kubainisha kuzalikana mtu kutokana na tone la manii, kama ilivyo kuja katika kauli yake Aliye tukuka: \"Hebu naajitazame mtu, ameummbwa kwa kitu gani? Ameumbwa kwa maji yatokayo kwa kuchupa.\" (Sura Att'ariq 5,6), bali imetangulia pia katika kubainisha kwamba kila kinyama kinacho kwenda kwenye ardhi kimeumbwa kwa njia ya kuzalikana na vinyama vya manii, na vinga khitalifiana hivyo vinyama vya manii na sifa zao katika kila namna mnamo hizo namna za vinyama. Katika maana za kisayansi ambazo zaweza kuwa nazo hii Aya ni kuwa maji ni msingi wa kila kiumbe kilicho hai. Kwa mfano mwili wa mtu umekusanya 70% ya uzito wake kuwa ni maji. Yaani mtu mwenye uzito wa kilo 70, kiasi kilo 50 ni maji. Na kabla ya kuteremka Qur'ani haya hayakuwa yakijuulikana kabisa ya kuwa mtu ana sehemu hii kubwa ya mwili wake kuwa ni maji. Na maji ndio chakula cha dharura kabisa kwa mwanaadamu. Kwani hali mtu yamkini aishi siku 60 bila ya kula chakula chochote, hawezi kuishi bila ya maji kwa zaidi kuliko siku 3 mpaka 10 mwisho wake. Na maji ndio msingi wa kufanyika damu, na maji ya limfo, na ya katika ubongo wa mifupa, vimwagavyo na mwili, kama mkojo, na jasho, na machozi, na mate, na nyongo, na maziwa, na maji yanayo patikana katika viungo, na ambayo ndiyo sababu ya ulaini wa mwili. Na yakikosekana 20% ya maji yake basi mwanaadamu hukabiliwa na mauti. Na maji huyayusha vyakula vikasahilika kufyonzeka. Na kadhaalika huyayusha makombo yenye asili ya vilivyo hai au maadini katika mkojo na jasho. Na kwa namna hii maji yana sehemu kubwa zaidi na muhimu kabisa katika kuumbwa kwa mwili. Na kwa hivyo yamkini kusema kwamba kila kiumbe kilicho hai kimeumbwa kutokana na maji.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"wal-lahu khalaqa kulla dābbatin min māin famin'hum man yamshī ʿalā baṭnihi wamin'hum man yamshī ʿalā rij'layni wamin'hum man yamshī ʿalā arbaʿin yakhluqu al-lahu mā yashāu inna al-laha ʿalā kulli shayin qadīrun ","translations":["And Allah","created","every","moving creature","from","water","Of them","(is a kind) who","walks","on","its belly","and of them","(is a kind) who","walks","on","two legs","and of them","(is a kind) who","walks","on","four","Allah creates","Allah creates","what","He wills","Indeed","Allah","on","every","thing","(is) All-Powerful","(45)"],"transliterationArr":["wal-lahu","khalaqa","kulla","dābbatin","min","māin","famin'hum","man","yamshī","ʿalā","baṭnihi","wamin'hum","man","yamshī","ʿalā","rij'layni","wamin'hum","man","yamshī","ʿalā","arbaʿin","yakhluqu","al-lahu","mā","yashāu","inna","al-laha","ʿalā","kulli","shayin","qadīrun",null],"verseTiming":[[1,0,1220],[2,1220,1980],[3,1980,2550],[4,2550,6060],[5,6060,7280],[6,7280,10640],[7,10640,11610],[8,11610,12490],[9,12490,14139],[10,14139,14829],[11,14829,15949],[12,15949,16919],[13,16919,17859],[14,17859,19559],[15,19559,20229],[16,20229,21349],[17,21349,22309],[18,22309,23159],[19,23159,24829],[20,24829,26779],[21,26779,27669],[22,27669,29099],[23,29099,30049],[24,30049,30419],[25,30419,33079],[26,33079,34199],[27,34199,35349],[28,35349,36109],[29,36109,36819],[30,36819,38669],[31,38669,41694]]}}