{"name":"24:4","price":"Na wanao wasingizia wanawake mahashumu, kisha wasilete mashahidi wane, basi watandikeni bakora thamanini, na msiwakubalie ushahidi wao tena. Na hao ndio wapotovu .","arabic":"وَٱلَّذِينَ يَرۡمُونَ ٱلۡمُحۡصَنَٰتِ ثُمَّ لَمۡ يَأۡتُواْ بِأَرۡبَعَةِ شُهَدَآءَ فَٱجۡلِدُوهُمۡ ثَمَٰنِينَ جَلۡدَةٗ وَلَا تَقۡبَلُواْ لَهُمۡ شَهَٰدَةً أَبَدٗاۚ وَأُوْلَٰٓئِكَ هُمُ ٱلۡفَٰسِقُونَ","category":["24 (An-Nur)","An-Nur","Surah An-Nur","Chapter An-Nur","Nur","Surah Nur","Chapter Nur","An Nur","Surah An Nur","Chapter An Nur","Surah 24","Chapter 24","The Light","النُّور"],"ayahNumber":2795,"juzNumber":18,"footnotes":"Na wanao watuhumu wanawake wenye hishima zao wasio na makosa kwa tuhuma ya uzinzi bila ya kuleta mashahidi wane wa kuthibitisha tuhuma yao, waadhibuni kwa kuwapiga fimbo thamanini, na wala ushahidi wao usikubaliwe tena kwa jambo lolote muda wa uhai wao. Basi hawa ndio wanao faa kuitwa kwa jina la walio toka vibaya kwenye mipaka ya Dini. Maoni ya Wataalamu juu ya Aya 2-4 \" Mzinifu mwanamke na mzinifu mwanamume, mtandikeni kila mmoja katika wao bakora mia. Wala isikushikeni huruma kwa ajili yao katika hukumu ya Mwenyezi Mungu, ikiwa nyinyi mnamuamini Mwenyezi Mungu na Siku ya Mwisho. Na lishuhudie adhabu yao kundi la Waumini. Mwanamume mzinifu hamwoi ila mwanamke mzinifu au mwanamke mshirikina. Na mwanamke mzinifu haolewi ila na mwanamume mzinifu au mshirikina. Na hayo yameharimishwa kwa Waumini. Na wanao wasingizia wanawake mahashumu, kisha wasilete mashahidi wane, basi watandikeni bakora thamanini, na msiwakubalie ushahidi wao tena. Na hao ndio wapotovu.\" Makosa katika Sharia ya Kiislamu ni mambo yaliyo harimishwa na Mwenyezi Mungu akayakemea kwa kuyawekea adhabu au izara ya kufedhehesha. Na maharimishwa hayo ama ni kutenda kilicho katazwa kukitenda, au kuacha kutenda kilicho amrishwa na Sharia kutendwa. Na sababu ya kuharimishwa haya yaliyo katazwa ni kuwa hayo ni kupiga vita moja katika maslaha yanayo kubaliwa katika Uislamu. Na maslaha hayo yanayo kubaliwa ni matano, nayo ni: 1. Kuhifadhi nafsi. 2. Kuhifadhi Dini. 3. Kuhifadhi akili. 4. Kuhifadhi mali 5. Kuhifadhi hishima. Kuuwa kwa mfano ni kuipiga vita nafsi. Na kurtadi, kutoka katika Uislamu, ni kuipiga vita Dini. Na kutumia vinavyo levya ni kuipiga vita akili. Na wizi ni kuyapiga vita mali. Na uzinzi ni kuipiga vita hishima. Na wanazuoni wa ilimu ya Fiqhi (Sharia) wameyagawa makosa sehemu mbali mbali. Lakini sisi yatutosha kwa sababu ya kueleza Aya hizi kugawa kwa mujibu wa uzito wa adhabu zake, na namna ya kiasi chake. Nayo yamegawika mafungu matatu: 1. H'udud, yaani Adhabu. 2. Kisasi au Diya 3. Izara, au Fedheha. Ama H'udud, au Adhabu, ni makosa ambayo yanaonekana kuwa yanaingilia kuvunja Haki ya Mwenyezi Mungu, au kuwa Haki ya Mwenyezi Mungu ni kubwa zaidi ndani yake kuliko haki ya binaadamu. Na kwa hivyo ndio Mwenyezi Mungu akaiwekea MIPAKA ndio maana khasa ya H'udud. Kaiwekea mipaka adhabu yake katika Qur'ani au katika Sunna za Mtume s.a.w. Ama makosa ya Kisasi na Diya ni makosa ambayo baadhi kubwa yake yamewakhusu wenyewe waja. Mwenyezi Mungu amewekea adhabu za baadhi yake katika Qur'ani au katika Sunna za Mtume s.a.w., na amewaachilia mengine wapime wenyewe wenye madaraka. Mfano wa hayo makosa ya kumwaga damu, kama kuuwa na kukata viungo, na kujuruhu. Ama makosa ya Izara, Uislamu umejitosheleza kwa kutaja mwisho wa ukali na mwisho wa upole katika adhabu zao, na kuachia yaliyo baki wenye kutawala wahukumie kwa kila kosa kwa mujibu wa hali na zama yanapo tokea makosa. Makosa ya H'udud ni saba: 1. Uzinzi. 2. Kuzulia wanawake mahashumu wasio na makosa. 3. Udhalimu. 4. Wizi. 5. Uharamia. 6.Ulevi. 7. Kurtadi. (Kutoka katika Uislamu). Mwenyezi Mungu ameyawekea mipaka yote makosa hayo na ameyaleta kwa hisabu yake katika Qur'ani, kama alivyo wekea adhabu zake katika Qur'ani vile vile, isipo kuwa adhabu ya mwenye kuzini naye amewahi kuoa, yaani Zaani Muh's'an, ambaye hupigwa mawe, na mlevi na adhabu yake ni fimbo thamanini, na adhabu ya mwenye kurtadi ambaye jaza yake ni kuuwawa. Hayo yamekuja katika Sunna. Na zimezoea hizi kanuni za kuundwa na watu katika kupinga makosa ya uzinzi kwa adhabu khafifu kama vile kifungo, hata ndio uchafu ukaenea kati ya watu, na fiski na ukahaba ukazagaa, na hishima zikapotea, na maradhi yakakithiri, na nasaba za ukoo zikachanganyika. Katika jambo la ajabu ni kuwa hizi kanuni za kisasa za nchi zinazo ambiwa za kistaarabu ndio zinazo yalinda makosa haya. Katika kanuni za adhabu za Kifaransa, kwa mfano, wazinzi wasio oa wala kuolewa hawapati adhabu yoyote maadamu wao wakiwa wamekwisha fikilia utu uzima. Kwa kuwa ati uhuru wao wa binafsi unataka waachiliwe wajifanyie wenyewe watakalo. Ama mzinzi mwanamume aliye na mke, au mwanamke mwenye mume, basi huyo adhabu yake ni kifungo. Lakini mwana sharia wa serikali haingii kuchunguza ila akipata mashtaka kutokana na mume au mke. Na inaonyesha kuwa ni haki ya mume tu kuwa hilo kosa limetokea au la, kwani ikiwa yeye ndiye aliye fikisha mashtaka, basi yeye anaweza kuyafuta pia, na uchunguzi utasita. Na yeye anaweza kumsamehe mkewe akatoka gerezani kabla ya kutimiza muda wa kifungo chake ijapo kuwa hukumu ilikuwa ni juu yake huyo mwanamke mwishoni. Na wapo baadhi ambao ati wanaushutumu Uislamu kwa ukali wake kushadidia kwake kuadhibiwa wazinifu. Yaliyo elekea zaidi ni kuwa lau wangeli zingatia kuwa kama ilivyo kuwa adhabu ni kali, hali kadhaalika umeshadidiwa ushahidi kwa jambo hili. Kwani ijapo kuwa katika kosa la mauwaji yatosha ushahidi wa mashahidi wawili waadilifu, katika uzinzi ni lazima wapatikane mashahidi wane waadilifu walio ona kitendo hicho kwa macho yao, au aungame mkosa! Hayo, na tunaona kuwa Qur'ani Tukufu imelazimisha kuwa kupigwa hizo fimo kuwe jahara ili mkosa ajuulikane, na iwe ni onyo kuwakhofisha wenginewe.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"wa-alladhīna yarmūna al-muḥ'ṣanāti thumma lam yatū bi-arbaʿati shuhadāa fa-ij'lidūhum thamānīna jaldatan walā taqbalū lahum shahādatan abadan wa-ulāika humu al-fāsiqūna ","translations":["And those who","accuse","the chaste women","then","not","they bring","four","witnesses","then flog them","(with) eighty","lashe(s)","and (do) not","accept","their","testimony","ever","And those","they","(are) the defiantly disobedient","(4)"],"transliterationArr":["wa-alladhīna","yarmūna","al-muḥ'ṣanāti","thumma","lam","yatū","bi-arbaʿati","shuhadāa","fa-ij'lidūhum","thamānīna","jaldatan","walā","taqbalū","lahum","shahādatan","abadan","wa-ulāika","humu","al-fāsiqūna",null],"verseTiming":[[1,0,1430],[2,1430,2520],[3,2520,4210],[4,4210,5470],[5,5470,5970],[6,5970,6910],[7,6910,8230],[8,8230,10720],[9,10720,13000],[10,13000,14570],[11,14570,15930],[12,15930,16930],[13,16930,18110],[14,18110,18620],[15,18620,19760],[16,19760,20430],[17,20430,21870],[18,21870,23590],[19,23590,26530],[20,26530,26930],[21,26930,31375]]}}