{"name":"24:40","price":"Au ni kama giza katika bahari kuu, iliyo funikwa na mawimbi juu ya mawimbi, na juu yake yapo mawingu. Giza juu ya giza. Akiutoa mtu mkono wake anakaribia asiuone. Na ambaye Mwenyezi Mungu hakumjaalia kuwa na nuru hawi na nuru.","arabic":"أَوۡ كَظُلُمَٰتٖ فِي بَحۡرٖ لُّجِّيّٖ يَغۡشَىٰهُ مَوۡجٞ مِّن فَوۡقِهِۦ مَوۡجٞ مِّن فَوۡقِهِۦ سَحَابٞۚ ظُلُمَٰتُۢ بَعۡضُهَا فَوۡقَ بَعۡضٍ إِذَآ أَخۡرَجَ يَدَهُۥ لَمۡ يَكَدۡ يَرَىٰهَاۗ وَمَن لَّمۡ يَجۡعَلِ ٱللَّهُ لَهُۥ نُورٗا فَمَا لَهُۥ مِن نُّورٍ","category":["24 (An-Nur)","An-Nur","Surah An-Nur","Chapter An-Nur","Nur","Surah Nur","Chapter Nur","An Nur","Surah An Nur","Chapter An Nur","Surah 24","Chapter 24","The Light","النُّور"],"ayahNumber":2831,"juzNumber":18,"footnotes":"Na huu mfano mwengine wa vitendo vya makafiri. Mfano wake ni mfano wa giza la bahari kubwa iliyo tanda yenye kina kirefu. Mawimbi yake yanapigana na kusukumana wenyewe kwa wenyewe. Nayo yamefunikwa na mawingu mazito meusi hayapitishi mwangaza. Katika giza hili lililo rundikana msafiri wa baharini hawezi kuuona mkono wake hata akiukurubisha machoni. Basi anabaki ameduwaa amebabaika hajijui. Na vipi ataona kitu atokane na butaa hili bila ya kupata Nuru ya kumwongoa katika mwendo wake, na kumwokoa na kugongana na kuhiliki. Na basi kama hali hiyo hiyo makafiri hawapati faida katika vitendo vyao, wala hawatoki katika upofu wao na upotovu wao, wala hawajiokoi nafsi zao, ila kwa Nuru ya Imani. Kwani hana Nuru ya kumwongoa kwenye Njia Iliyo Nyooka. Basi atakuwa katika walio teketea. \"Na walio kufuru vitendo vyao ni kama sarabi (mazigazi) uwandani. Mwenye kiu huyadhania ni maji. Hata akiyaendea hapati chochote. Na atamkuta Mwenyezi Mungu hapo naye amlipe hisabu yake sawa sawa. Na Mwenyezi Mungu ni Mwepesi wa kuhisabu.\" Sarabi si chochote ila mandhari ya mwangaza yanayo sabibishwa na marejeo (reflection) ya miale inayo toka kwenye vitu vyenye kutoa mwanga. Na hiyo hurejeshwa tena kutokana na ardhi pana tupu, yaani uwanda, na kupanda kidogo kidogo mkabala na uso wa ardhi, na joto linapo panda wakati wa mchana, basi miale hiyo inayo rejea ikifika kwa jicho la mwenye kuangalia huona vile vitu vimegeuka juu chini kama kwamba kwenye kiyoo kikubwa kilicho tanda. Na kadhaalika mbingu safi ya rangi ya kibuluu huonekana kama kwamba ni ziwa la maji juu ya uso wa ardhi. Na vile vitu vingine kama miti miti na mitende iliyo onekana juu chini inazidi kuonyesha kama kwamba ni vivuli kwenye maji. Na hii Sarabi huzidi kudhihiri kwa uwazi kabisa inapo kuwa khitilafu ni kubwa baina ya joto la uso wa ardhi na angani katika hewa. Na hayo huonekana zaidi majangwani na nyandani na kwenye barabara za jangwani za lami zilio nyooka. Kwa maelezo hayo inaonekana kuwa Sarabi ni kiini macho tu. Maoni ya wataalamu juu ya Aya 40: \" Au ni kama giza katika bahari kuu, iliyo funikwa na mawimbi juu ya mawimbi, na juu yake yapo mawingu. Giza juu ya giza. Akiutoa mtu mkono wake anakaribia asiuone. Na ambaye Mwenyezi Mungu hakumjaalia kuwa na nuru hawi na nuru.\" Aya hii tukufu imekusanya yaliyo muhimu kabisa katika midharuba ya baharini. Ni maarufu kuwa midharuba ya bahari kuu huwa na mawimbi yanayo khitalifiana urefu wao na ukubwa wao au mnyanyuko wao, hata inaonekana kama kwamba hayo mawimbi yanapandana moja juu ya mwenzie, na kwa hivyo yakaziba mwangaza wa jua kwa vile hiyo midharuba inasabibisha kurundika kwa mawingu mazito ambayo nayo huuziba mwangaza wa jua, na kwa hivyo husabibisha giza mtu asiweze kuona kitu juu ya kuwa macho yake mazima. Na ilivyo kuwa Mtume s.a.w. kazaliwa na kakulia jangwani, kuja maelezo kama haya ya undani ya ki-ilimu kwa ulimi wake kuwa ni ufunuo ulio tokana na Mwenyezi Mungu, ni ushahidi kuwa Qur'ani inatoka kwa Mwenyezi Mungu, na kuwa ni muujiza wa Mtume huyu mtukufu.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"aw kaẓulumātin fī baḥrin lujjiyyin yaghshāhu mawjun min fawqihi mawjun min fawqihi saḥābun ẓulumātun baʿḍuhā fawqa baʿḍin idhā akhraja yadahu lam yakad yarāhā waman lam yajʿali al-lahu lahu nūran famā lahu min nūrin ","translations":["Or","(is) like (the) darkness[es]","in","a sea","deep","covers it","a wave","on it","on it","a wave","on it","on it","a cloud","darkness[es]","some of it","on","others","When","he puts out","his hand","hardly","hardly","he (can) see it","And (for) whom","not","Allah (has) made","Allah (has) made","for him","a light","then not","for him","(is) any","light","(40)"],"transliterationArr":["aw","kaẓulumātin","fī","baḥrin","lujjiyyin","yaghshāhu","mawjun","min","fawqihi","mawjun","min","fawqihi","saḥābun","ẓulumātun","baʿḍuhā","fawqa","baʿḍin","idhā","akhraja","yadahu","lam","yakad","yarāhā","waman","lam","yajʿali","al-lahu","lahu","nūran","famā","lahu","min","nūrin",null],"verseTiming":[[1,0,560],[2,560,2160],[3,2160,3580],[4,3580,4350],[5,4350,6730],[6,6730,7820],[7,7820,8450],[8,8450,9570],[9,9570,11580],[10,11580,12350],[11,12350,13340],[12,13340,15200],[13,15200,17840],[14,17840,20220],[15,20220,21370],[16,21370,22010],[17,22010,23040],[18,23040,25070],[19,25070,25970],[20,25970,26830],[21,26830,27280],[22,27280,27910],[23,27910,29190],[24,29190,29990],[25,29990,30680],[26,30680,31640],[27,31640,32520],[28,32520,33210],[29,33210,34330],[30,34330,35520],[31,35520,36180],[32,36180,36440],[33,36440,39775]]}}