{"name":"24:58","price":"Enyi mlio amini! Nawakutakeni idhini iliyo wamiliki mikono yenu ya kulia na walio bado kubaalighi miongoni mwenu mara tatu - kabla ya Sala ya alfajiri, na wakati mnapo vua nguo zenu adhuhuri, na baada ya Sala ya isha. Hizi ni nyakati tatu za faragha kwenu. Si vibaya kwenu wala kwao baada ya nyakati hizi, kuzungukiana nyinyi kwa nyinyi. Hivyo ndivyo Mwenyezi Mungu anavyo kuelezeni Aya zake, na Mwenyezi Mungu ni Mjuzi Mwenye hikima.","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لِيَسۡتَـٔۡذِنكُمُ ٱلَّذِينَ مَلَكَتۡ أَيۡمَٰنُكُمۡ وَٱلَّذِينَ لَمۡ يَبۡلُغُواْ ٱلۡحُلُمَ مِنكُمۡ ثَلَٰثَ مَرَّٰتٖۚ مِّن قَبۡلِ صَلَوٰةِ ٱلۡفَجۡرِ وَحِينَ تَضَعُونَ ثِيَابَكُم مِّنَ ٱلظَّهِيرَةِ وَمِنۢ بَعۡدِ صَلَوٰةِ ٱلۡعِشَآءِۚ ثَلَٰثُ عَوۡرَٰتٖ لَّكُمۡۚ لَيۡسَ عَلَيۡكُمۡ وَلَا عَلَيۡهِمۡ جُنَاحُۢ بَعۡدَهُنَّۚ طَوَّٰفُونَ عَلَيۡكُم بَعۡضُكُمۡ عَلَىٰ بَعۡضٖۚ كَذَٰلِكَ يُبَيِّنُ ٱللَّهُ لَكُمُ ٱلۡأٓيَٰتِۗ وَٱللَّهُ عَلِيمٌ حَكِيمٞ","category":["24 (An-Nur)","An-Nur","Surah An-Nur","Chapter An-Nur","Nur","Surah Nur","Chapter Nur","An Nur","Surah An Nur","Chapter An Nur","Surah 24","Chapter 24","The Light","النُّور"],"ayahNumber":2849,"juzNumber":18,"footnotes":"Enyi mlio amini! Yakupaseni muamrishe watumishi wenu na vijana wenu ambao bado hawajabalighi wasikuingilieni vyumbani mwenu ila baada ya kutaka idhini katika nyakati tatu, nazo ni kabla ya Swala ya alfajiri, na pale mnapo punguza nguo zenu wakati wa kupumzika mchana, na baada ya Swala ya Isha mnapo jitayarisha kulala. Kwani nyakati hizi mtu hubadilisha mavazi ya kulalia badala ya mavazi ya kutokea, na huonekana sehemu za mwili ambazo hazifai kuonekana. Wala hapana ubaya kwenu wala kwao kuingia bila ya ruhusa nyakati nyenginezo, kwa sababu ni jamba la ada watu wa nyumbani kupitiana kwa maslaha yao. Na kwa uwazi wa namna hii Mwenyezi Mungu anakubainishieni Aya za Qur'ani ili akuwekeeni wazi hukumu. Na Mwenyezi Mungu Subhanahu ni Mkunjufu wa ujuzi, Mkubwa wa hikima, anajua yanayo silihi kwa waja wake, na anawatungia Sharia zinazo wanasibu, na kwa kadri ya haja yao. \"Enyi mlio amini! Nawakutakeni idhini iliyo wamikiliki mikono yenu ya kulia na walio bado kubaalighi miongoni mwenu mara tatu - kabla ya Swala ya alfajiri, na wakati mnapo vua nguo zenu adhuhuri, na baada ya Swala ya isha. Hizi ni nyakati tatu za faragha kwenu. Si vibaya kwenu wala kwao baada ya nyakati hizi, kuzungukiana nyinyi kwa nyinyi. Hivyo ndivyo Mwenyezi Mungu anavyo kuelezeni Aya zake, na Mwenyezi Mungu ni Mjuzi Mwenye hikima.\" Aya hii tukufu ni moja katika Aya zinazo elekeza nadhari ya watu wazingatie yaliyo laiki katika jamii za watu khasa ndani ya ukoo. Nayo kuwa kuchanganyika kwa watumishi na watoto katika aila yao huenda kukapindukia mipaka ya hishima za maingiano, wakawa wanawaingilia wenginewe bila ya kutaka idhini katika nyakati maalumu zilizo tajwa katika Aya. Na kwa kuwa nyakati hizo ni nyakati za faragha na uhuru wa binafsi, na kuvua nguo nzito nzito, Aya hii imekusudia kuweka Sharia ya kutaka idhini katika nyakati hizo kutokana na watumishi na vijana ili wasione ambayo yanahisabiwa kuwa ni siri, ambayo ni kama utupu ambao wapasa kusitiriwa. Na kwa hivyo wanaelekezwa watu wa ukoo wavae mavazi yanayo kuwa laiki ya kukabiliana hata wao kwa wao, ili hishima yao ibaki imehifadhika, na uhuru wao umedhaminika, na adabu zao zimechungika. Na Qur'ani ndio inaayo faa khasa kutuongoza tufuate mwendo ulio bora na wa juu. (Ikiwa watoto wa nyumbani haiwafalii kuwaingilia watu katika nyakati hizo za faragha zilizo tajwa, seuze watu mbali!)","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"yāayyuhā alladhīna āmanū liyastadhinkumu alladhīna malakat aymānukum wa-alladhīna lam yablughū al-ḥuluma minkum thalātha marrātin min qabli ṣalati al-fajri waḥīna taḍaʿūna thiyābakum mina al-ẓahīrati wamin baʿdi ṣalati al-ʿishāi thalāthu ʿawrātin lakum laysa ʿalaykum walā ʿalayhim junāḥun baʿdahunna ṭawwāfūna ʿalaykum baʿḍukum ʿalā baʿḍin kadhālika yubayyinu al-lahu lakumu al-āyāti wal-lahu ʿalīmun ḥakīmun ","translations":["O you who believe","O you who believe","O you who believe","Let ask your permission","those whom","possess","your right hands","and those who","(have) not","reached","puberty","among you","(at) three","times","before","before","(the) prayer","(of) dawn","and when","you put aside","your garments","at","noon","and after","and after","(the) prayer","(of) night","(These) three","(are) times of privacy","for you","Not","on you","and not","on them","any blame","after that","(as) moving about","among you","some of you","among","others","Thus","Allah makes clear","Allah makes clear","for you","the Verses","and Allah","(is) All-Knower","All-Wise","(58)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","liyastadhinkumu","alladhīna","malakat","aymānukum","wa-alladhīna","lam","yablughū","al-ḥuluma","minkum","thalātha","marrātin","min","qabli","ṣalati","al-fajri","waḥīna","taḍaʿūna","thiyābakum","mina","al-ẓahīrati","wamin","baʿdi","ṣalati","al-ʿishāi","thalāthu","ʿawrātin","lakum","laysa","ʿalaykum","walā","ʿalayhim","junāḥun","baʿdahunna","ṭawwāfūna","ʿalaykum","baʿḍukum","ʿalā","baʿḍin","kadhālika","yubayyinu","al-lahu","lakumu","al-āyāti","wal-lahu","ʿalīmun","ḥakīmun",null],"verseTiming":[[1,0,2710],[2,2710,3800],[3,3800,4800],[4,4800,7340],[5,7340,8410],[6,8410,9210],[7,9210,10620],[8,10620,11840],[9,11840,12230],[10,12230,13000],[11,13000,13840],[12,13840,15110],[13,15110,15980],[14,15980,17760],[15,17760,19570],[16,19570,20860],[17,20860,21690],[18,21690,22430],[19,22430,23520],[20,23520,24650],[21,24650,25600],[22,25600,26940],[23,26940,28080],[24,28080,28620],[25,28620,29540],[26,29540,32330],[27,32330,33770],[28,33770,34800],[29,34800,36200],[30,36200,36810],[31,36810,37940],[32,37940,38580],[33,38580,39660],[34,39660,41500],[35,41500,43270],[36,43270,45180],[37,45180,46920],[38,46920,48330],[39,48330,49030],[40,49030,49990],[41,49990,51180],[42,51180,52240],[43,52240,53170],[44,53170,53810],[45,53810,57060],[46,57060,58090],[47,58090,59150],[48,59150,61655]]}}