{"name":"25:38","price":"Na tuliwaangamiza kina A'di na Thamudi na watu wa Rass na vizazi vingi vilivyo kuwa kati yao.","arabic":"وَعَادٗا وَثَمُودَاْ وَأَصۡحَٰبَ ٱلرَّسِّ وَقُرُونَۢا بَيۡنَ ذَٰلِكَ كَثِيرٗا","category":["25 (Al-Furqan)","Al-Furqan","Surah Al-Furqan","Chapter Al-Furqan","Furqan","Surah Furqan","Chapter Furqan","Al Furqan","Surah Al Furqan","Chapter Al Furqan","Surah 25","Chapter 25","The Criterion","الفُرقان"],"ayahNumber":2893,"juzNumber":19,"footnotes":"Na kadhaalika tuliwahiliki A'di na Thamudi na watu wa Rass  walipo wakanusha Mitume wao. Na tuliziangamiza kaumu nyingi baina ya kaumu ya Nuhu na baina ya A'di, yakawapata malipo ya wenye kudhulumu. Rass, kama ilivyo elezwa katika Mufradaat ya Raaghib Al-As'fahani, ni bonde, na akatolea ushahidi ubeti wa shairi: (Nao ni bonde la Rass, kama mkono kwa mdomo.) Hao watu wa Rass, kama ilivyo kuja katika Aya tukufu, ni watu walio kuwa wakiabudu masanamu. Mwenyezi Mungu aliwatumia Shuaib. Basi hao ndio walio pelekewa Mtume Shuaib a.s. Na Mwenyezi Mungu Aliye takasika amewaeleza hao kaumu ya Shuaib kuwa ni Watu wa Vichakani (Al-Aykat), napo ni pahali penye miti mingi panasifika kwa neema, na mara nyengine wanaitwa Watu wa Rass, nalo ni bonde lenye kheri kubwa, kuonesha neema alizo waneemesha Mwenyezi Mungu. Nao wakazikufuru neema za Mwenyezi Mungu, wakaabudu masanamu.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"waʿādan wathamūdā wa-aṣḥāba al-rasi waqurūnan bayna dhālika kathīran ","translations":["And Ad","and Thamud","and (the) dwellers","(of) Ar-rass","and generations","between","that","many","(38)"],"transliterationArr":["waʿādan","wathamūdā","wa-aṣḥāba","al-rasi","waqurūnan","bayna","dhālika","kathīran",null],"verseTiming":[[1,0,1820],[2,1820,2840],[3,2840,4150],[4,4150,5110],[5,5110,6950],[6,6950,7620],[7,7620,8480],[8,8480,10295]]}}