{"name":"25:45","price":"Je! Huoni jinsi Mola wako Mlezi anavyo kitandaza kivuli. Na angeli taka angeli kifanya kikatulia tu. Kisha tumelifanya jua kuwa ni kiongozi wake.","arabic":"أَلَمۡ تَرَ إِلَىٰ رَبِّكَ كَيۡفَ مَدَّ ٱلظِّلَّ وَلَوۡ شَآءَ لَجَعَلَهُۥ سَاكِنٗا ثُمَّ جَعَلۡنَا ٱلشَّمۡسَ عَلَيۡهِ دَلِيلٗا","category":["25 (Al-Furqan)","Al-Furqan","Surah Al-Furqan","Chapter Al-Furqan","Furqan","Surah Furqan","Chapter Furqan","Al Furqan","Surah Al Furqan","Chapter Al Furqan","Surah 25","Chapter 25","The Criterion","الفُرقان"],"ayahNumber":2900,"juzNumber":19,"footnotes":"Tumesimamisha dalili za Tawhidi, Upweke wa Mwenyezi Mungu, za kuwaongoa wenye akili. Hebu kiangalie kivuli. Mwenyezi Mungu amekitandaza na akakifanya kimetulia mwanzo wa mchana. Kisha tukalipeleka jua likaondoa pahala pake kwa mwako wake. Likawa jua ni kama ndio linaongoza kivuli. Bila ya jua, kivuli kisingeli juulikana. Na lau kuwa Mwenyezi Mungu ange penda angeli kifanya kivuli kitulie vile vile kimewang'ang'ania watu, na yakawaharibikia maslaha yao na mambo yao. \" Je! Huoni jinsi Mola wako Mlezi anavyo kitandaza kivuli. Na angeli taka angeli kifanya kikatulia tu. Kisha tumelifanya jua kuwa ni kiongozi wake.\" Aya hii inadhihirisha hima ya Muumba na uwezo wake. Kwani kutandaza kivuli kunaonyesha mzunguko wa dunia na kuinama kwa msumari-kati (axis) wake. Na lau kuwa ardhi, yaani dunia, ingeli tulia tu, haitaharaki kulizunguka jua, na pia ikawa haizunguki wenyewe kwa wenyewe juu ya msumari-kati wake, basi kivuli kingeli tulia, na mwako wa jua ungeli piga juu ya nusu ya dunia, na nusu ya pili ikabaki ni usiku, moja kwa moja. Hayo yangeli leta khitilafu kubwa za baridi na joto, na ingeli pelekea kutoweka uhai kabisa katika dunia. Na kadhaalika ingeli kuwa hii ni hali ya dunia basi kivuli kingeli tulia. Na haya pia yange tokea ikiwa muda wa kuzunguka ardhi juu ya msumari-kati wake ndio muda ule ule muda wa kuzunguka kwake kulizunguka jua, yaani siku moja ikawa sawa na mwaka mzima. Lakini hapana awezaye kufanya hayo isipo kuwa Mwenyezi Mungu. Haya licha ya kuwa kivuli nafsi yake ni neema miongoni mwa neema za Mwenyezi Mungu. Na lau kuwa Mwenyezi Mungu aliviumba vitu vyote vyapenyeza mwangaza (transparent) kisingeli kuwapo kivuli, na vitu visingeli pata fursa ya kuwepo ambavyo vinahitajia vivuli.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"alam tara ilā rabbika kayfa madda al-ẓila walaw shāa lajaʿalahu sākinan thumma jaʿalnā al-shamsa ʿalayhi dalīlan ","translations":["Do you not","see","[to]","your Lord","how","He extends","the shadow","And if","He willed","surely He (could) have made it","stationary","Then","We made","the sun","for it","an indication","(45)"],"transliterationArr":["alam","tara","ilā","rabbika","kayfa","madda","al-ẓila","walaw","shāa","lajaʿalahu","sākinan","thumma","jaʿalnā","al-shamsa","ʿalayhi","dalīlan",null],"verseTiming":[[1,0,640],[2,640,1130],[3,1130,1650],[4,1650,2500],[5,2500,3170],[6,3170,3820],[7,3820,4700],[8,4700,5200],[9,5200,7550],[10,7550,8690],[11,8690,10450],[12,10450,11800],[13,11800,12610],[14,12610,13490],[15,13490,14380],[16,14380,15985]]}}