{"name":"25:59","price":". Ambaye ameziumba mbingu na ardhi, na viliomo ndani yake kwa siku sita. Kisha akatawala juu ya A'rshi, Arrahman, Mwingi wa Rehema! Uliza khabari zake kwa wamjuaye.","arabic":"ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ وَمَا بَيۡنَهُمَا فِي سِتَّةِ أَيَّامٖ ثُمَّ ٱسۡتَوَىٰ عَلَى ٱلۡعَرۡشِۖ ٱلرَّحۡمَٰنُ فَسۡـَٔلۡ بِهِۦ خَبِيرٗا","category":["25 (Al-Furqan)","Al-Furqan","Surah Al-Furqan","Chapter Al-Furqan","Furqan","Surah Furqan","Chapter Furqan","Al Furqan","Surah Al Furqan","Chapter Al Furqan","Surah 25","Chapter 25","The Criterion","الفُرقان"],"ayahNumber":2914,"juzNumber":19,"footnotes":"Na Mwenyezi Mungu ndiye aliye ziumba mbingu na ardhi na vilio baina yao kwa siku sita. Naye ametawala juu ya A'rshi, Kiti cha Enzi, cha Ufalme wote, na madaraka yake yameenea kila kitu. Na Yeye ndiye Mwingi wa Rehema, Arrahman. Na ukitaka lolote katika sifa zake muulize ajuae atakujibu. Naye ni Mwenyezi Mungu Mwenye hikima. \"Ambaye ameziumba mbingu na ardhi, na viliomo ndani yake kwa siku sita. Kisha akatawala juu ya A'rshi, Arrahman, Mwingi wa Rehema! Ulize khabari zake kwa wamjuaye.\" Hizo Siku Sita ni usemi wa Mwenyezi Mungu, Mtukufu Aliye tukuka, kueleza wakati. Na Yeye Mtukufu ndiye Mwenye kujua zaidi kipimo cha hiyo Siku. Na kwa upande wa kiilimu za sayansi kazi ya kuumba ulimwengu unahitaji kupita vipindi na viwango mbali mbali. Na \"Mbingu na ardhi na viliomo ndani yake\" ni ishara ya vyombo vyote vya mbinguni, nyota, majua, sayari, miezi, mavumbi, gesi za namna mbali mbali, na nishat'i, Energy , na vyote hivyo vinavyo fanya ndio ulimwengu wa duniani na angani. Na kwa kuupanga ulimwengu wote, yaani uumbaji wote, kwa tafsili ya ukamilifu inayo kusanya kila kitu, ndio inaweka wazi, Utawala wa Mwenyezi Mungu, Subhanahu juu ya ulimwengu kwa jumla na kwa tafsili. \"Uliza khabari zake kwa ajuaye\". Katika kifungu hichi cha Aya hii tukufu pana uwongozi wa kisayansi kutokana na Mwenyezi Mungu kuonyesha dharura ya uchunguzi na utafiti wa mambo yanayo onekana ya uumbaji na mipango yake tuyaangalie ya ndani, ili tujue siri za uweza wa Mwenyezi Mungu katika kuanzisha huu ulimwengu.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"alladhī khalaqa al-samāwāti wal-arḍa wamā baynahumā fī sittati ayyāmin thumma is'tawā ʿalā al-ʿarshi al-raḥmānu fasal bihi khabīran ","translations":["The One Who","created","the heavens","and the earth","and whatever","(is) between them","in","six","periods","then","He established Himself","over","the Throne ","the Most Gracious","so ask","Him","(as He is) All-Aware","(59)"],"transliterationArr":["alladhī","khalaqa","al-samāwāti","wal-arḍa","wamā","baynahumā","fī","sittati","ayyāmin","thumma","is'tawā","ʿalā","al-ʿarshi","al-raḥmānu","fasal","bihi","khabīran",null],"verseTiming":[[1,0,980],[2,980,1670],[3,1670,3220],[4,3220,4270],[5,4270,4890],[6,4890,6110],[7,6110,6550],[8,6550,7480],[9,7480,9310],[10,9310,10550],[11,10550,11400],[12,11400,11810],[13,11810,12510],[14,12510,14490],[15,14490,15270],[16,15270,15840],[17,15840,17645]]}}