{"name":"25:61","price":"Ametukuka aliye zijaalia nyota mbinguni, na akajaalia humo taa na mwezi unao ng'ara.","arabic":"تَبَارَكَ ٱلَّذِي جَعَلَ فِي ٱلسَّمَآءِ بُرُوجٗا وَجَعَلَ فِيهَا سِرَٰجٗا وَقَمَرٗا مُّنِيرٗا","category":["25 (Al-Furqan)","Al-Furqan","Surah Al-Furqan","Chapter Al-Furqan","Furqan","Surah Furqan","Chapter Furqan","Al Furqan","Surah Al Furqan","Chapter Al Furqan","Surah 25","Chapter 25","The Criterion","الفُرقان"],"ayahNumber":2916,"juzNumber":19,"footnotes":"Ametukuka Arrahman, Mwingi wa Rehema, na zimezidi fadhila zake. Ameziumba sayari mbinguni na akazijaalia na vituo vyake vya kupitia, na katika hizo akaumba jua kuwa ni taa yenye mwangaza, na mwezi wenye nuru. \"Ametukuka aliye zijaalia nyota mbinguni, na akajaalia humo taa na mwezi unao ng'ara.\" Aya hii tukufu inaashiria maana za ki-ilimu za sayansi zenye kukusanywa katika mpango wa ulimwengu alio uumba Mwenyezi Mungu, Aliye takasika, Aliye tukuka, na zikazidi fadhila zake. Na sisi tunashuhudia nyota za mbinguni kwa sura ya makundi ambayo takriban hayageuki sura na yangapitiliwa na karne, na Buruuj nayo ndio hayo makundi ya nyota, ni yale yale yanayo pitiwa mbele yake na jua katika mzunguko wake unavyo dhihiri kuizunguka ardhi. Hizo Buruuj ni kama vituo vya jua katika mzunguko wake katika mwaka. Na kila tatu katika hizo huwa ni musimu katika misimu ya mwaka. Nazo kwa kuzitaja moja moja kuanzia msimu wa Rabii' (Spring) unao kuja baina ya siku za baridi na joto, ni kama ifuatavyo kwa majina ya Kiarabu na Kizungu: Alh'aml (Aries, or Ram), Ath-thawr (Taurus), Aljawzaa' (Gemini), Assarat'aan (Cancer), Al Asad (Leo), Assunbulah (Spica), Al Miizaan (Libra), Al-A'qrab (Scorpion), Al Jadyu (Capricorn), Addalwu (Aquarius), Alh'uut (Pisces). Na jua ni moja katika nyota zenye nguvu za kati na kati. Nalo kama nyota zilizo baki lina mwangaza wake mwenyewe wa dhati kwa vituko vya kichembechembe (atomic reaction) vinavyo tokea ndani yake. Basi miale ya jua inayo toka kwenye nguvu hizo huangukia juu ya sayari, na ardhi, na miezi, na vyombo vilio baki vya mbinguni ambavyo havina mwanga wa nafsi yao. Kwa hivyo navyo hutoa nuru. Basi jua ndio Taa inayo waka kwa nafsi yake. Ama mwezi unarudisha nuru ya mwanga wa jua kutokana na uso wake, kama kiyoo. Hakika kwa kusifiwa Jua kuwa ni Taa, na ukasifiwa mwezi kuwa unatoa nuru, ni ishara ya kuwa Jua ndio chanzo cha nguvu, nishati, (T'aaqah, Energy) za joto.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"tabāraka alladhī jaʿala fī al-samāi burūjan wajaʿala fīhā sirājan waqamaran munīran ","translations":["Blessed is He","Who","has placed","in","the skies","constellations","and has placed","therein","a lamp","and a moon","shining","(61)"],"transliterationArr":["tabāraka","alladhī","jaʿala","fī","al-samāi","burūjan","wajaʿala","fīhā","sirājan","waqamaran","munīran",null],"verseTiming":[[1,0,1130],[2,1130,1990],[3,1990,2720],[4,2720,2840],[5,2840,5140],[6,5140,6250],[7,6250,7800],[8,7800,8580],[9,8580,9610],[10,9610,10970],[11,10970,13485]]}}