{"name":"26:165","price":"Je! Katika viumbe vyote mnawaingilia wanaume?.","arabic":"أَتَأۡتُونَ ٱلذُّكۡرَانَ مِنَ ٱلۡعَٰلَمِينَ","category":["26 (Ash-Shu'ara)","Ash-Shu'ara","Surah Ash-Shu'ara","Chapter Ash-Shu'ara","Shu'ara","Surah Shu'ara","Chapter Shu'ara","Ash Shu'ara","Surah Ash Shu'ara","Chapter Ash Shu'ara","Surah 26","Chapter 26","The Poets","الشُّعَرَاء"],"ayahNumber":3097,"juzNumber":19,"footnotes":"Lut'i alisema: Nyinyi mnastarehea kuwaingilia wanaume mkaacha wanawake? Kwa hayo anakusudia kuyakanya yale waliyo yazoea ya vitendo vichafu. \"Je! Katika viumbe vyote mnawaingilia wanaume?\" Yaani kazi ya liwat'i, ambayo tangu asli yake ni ukosefu muovu, unao chusha hata kuusikia, kinyume na maumbile, unao mteremsha mwanaadamu chini kabisa. Na lau kuwa unaenea basi huharibu sunna ya kuoa, nayo ni sunna ya maumbile, hata uzazi ukatike na ulimwengu usite kuendelea. Na kwa liwat'i huenea maradhi kama yanavyo enea kwa uzinzi kama tego, kisonono, donda ndugu, maradhi ya ngozi kama ukurutu, na hutokea ishara za kudhoofika nyama za nyuma hata ikawa mtu hawezi kujizuia kutokwa na choo ovyo. Na nyuma kwake mtu huchanua kukawa kama mdomo wa tarumbeta. Na huko nyuma hujaa vijidudu vya maradhi na hivyo humuambukiza mwenye kumuingilia na yeye hivyo vijidudu vikenda mletea maradhi mengine ya njia za mkojo. Na huenda huyo mwenye kufanywa mambo hayo akawa mpumbavu hafai kitu, ikiwa kaanza tangu utotoni. Na huenda akajidai kuonesha ujanadume mwingi kuliko kiasi kwa kutaka kuficha upungufu wake wa uume. (Karibuni imedhihiri kuwa maradhi ya khatari kabisa ya AIDS [Ukimwi] yameenea zaidi sana kwa watendao kitendo hichi na watumiao madawa ya ulevi, ijapo kuwa na wazinzi nao hupata!). Na Mwenyezi Mungu Subhanahu wa Taa'la ameukemea ukosefu huu katika Aya kadhaa wa kadhaa, na akabainisha hikima ya Mwenye kuhukumu kwa kuharimisha huku, kwa kusema: \" Je! Katika viumbe vyote mnawaingilia wanaume? Na mnaacha alicho kuumbieni Mola wenu Mlezi katika wake zenu? Ama kweli nyinyi ni watu mnao ruka mipaka!\"","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"atatūna al-dhuk'rāna mina al-ʿālamīna ","translations":["Do you approach","the males","among","the worlds","(165)"],"transliterationArr":["atatūna","al-dhuk'rāna","mina","al-ʿālamīna",null],"verseTiming":[[1,0,1160],[2,1160,2550],[3,2550,2870],[4,2870,6215]]}}