{"name":"27:18","price":"Mpaka walipo fika kwenye bonde la wadudu chungu, alisema mdudu chungu mmoja: Enyi wadudu chungu! Ingieni majumbani mwenu, asikupondeni Sulaiman na majeshi yake bila ya wao kutambua.","arabic":"حَتَّىٰٓ إِذَآ أَتَوۡاْ عَلَىٰ وَادِ ٱلنَّمۡلِ قَالَتۡ نَمۡلَةٞ يَٰٓأَيُّهَا ٱلنَّمۡلُ ٱدۡخُلُواْ مَسَٰكِنَكُمۡ لَا يَحۡطِمَنَّكُمۡ سُلَيۡمَٰنُ وَجُنُودُهُۥ وَهُمۡ لَا يَشۡعُرُونَ","category":["27 (An-Naml)","An-Naml","Surah An-Naml","Chapter An-Naml","Naml","Surah Naml","Chapter Naml","An Naml","Surah An Naml","Chapter An Naml","Surah 27","Chapter 27","The Ant","النَّمْل"],"ayahNumber":3177,"juzNumber":19,"footnotes":"Hata walipo fika kwenye bonde la wadudu chungu, mdudu chungu mmoja akasema: Enyi wadudu chungu! Ingieni vishimoni mwenu, asije Sulaiman na askari wake wakakuuweni na wao wala hawahisi kuwa nyinyi mpo. \"Mpaka walipo fika kwenye bonde la wadudu chungu, alisema mdudu chungu mmoja: Enyi wadudu chungu! Ingieni majumbani mwenu, asikupondeni Sulaiman na majeshi yake bila ya wao kutambua.\" Inafahamikana wazi katika Aya hii kuwa wadudu chungu wanaishi kwa makundi, yaani wana umoja, na moja katika sifa zao ni kuwa macho na kutahadhari. Na inajuulikana tangu zamani kuwa wadudu chungu wana sifa kadhaa wa kadhaa makhsusi ambazo zinaonyesha kuwa wana umoja wenye nidhamu madhubuti katika hukumu, na wana kiasi kikubwa cha akili, na werevu, na nguvu za kukumbuka, na kupenda kazi na kukakamia, na juhudi isiyo jua kunyong'onyea wala kukata tamaa. Kama wanavyo juulikana kuwa wana wingi wa hila za kuendesha kazi zao. Na dalili ya hayo ni kuwa jamaa wa wadudu chungu ni peke yao baada ya binaadamu ndio wanao zika maiti wao. Na makundi mbali mbali yao yanashughulikia kukutana pahala pamoja kwa nyakati maalumu. Kwa ajili ya hayo zimewekwa siku makhsusi za kusimamisha soko wanapo kusanyika makundi yote kwa kubadilishana bidhaa na kujuana. Na makundi haya yanapo kutana hutokea mazungumzo kwa hima kubwa, na huulizana masuala yaliyo khusiana na mambo yao. Katika yanayo onekana yaliyo fungamana na mikusanyiko hiyo ni kuzuka mashauri yaliyo khusu umma wao, kama kutengeneza barabara ndefu, kwa subira na kukakamia kunako staajabisha. Wala makundi haya hayatosheki na kufanya kazi mchana tu, bali huendeleza kazi zao katika masiku ya mbaamwezi; ama masiku ya kiza hubaki mwahala mwao. Na jamaa wa makundi haya wana njia za pekee za kukusanya na kubeba na kuhifadhi vifaa vyao vya kula. Akishindwa mdudu kuchukua chakula alicho kikusanya kwa mdomo wake hukisukuma kwa miguu yake ya nyuma, na akakinyanyua kwa mikono yake. Na katika mtindo wao ni kuzing'ong'ona mbegu, na kuzipasua baadhi ya nafaka kabla ya kuzirindika ili zisije kuchipua. Na mbegu kubwa kubwa huzigawa vipande vipande ili iwe wepesi kuziingiza katika ghala zao. Na pindi zikiroana kwa mvua huzitoa zipate upepo na jua zikauke.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"ḥattā idhā ataw ʿalā wādi al-namli qālat namlatun yāayyuhā al-namlu ud'khulū masākinakum lā yaḥṭimannakum sulaymānu wajunūduhu wahum lā yashʿurūna ","translations":["Until","when","they came","to","(the) valley","(of) the ants","said","an ant","O","ants","Enter","your dwellings","lest not crush you","lest not crush you","Sulaiman","and his hosts","while they","(do) not perceive","(do) not perceive","(18)"],"transliterationArr":["ḥattā","idhā","ataw","ʿalā","wādi","al-namli","qālat","namlatun","yāayyuhā","al-namlu","ud'khulū","masākinakum","lā","yaḥṭimannakum","sulaymānu","wajunūduhu","wahum","lā","yashʿurūna",null],"verseTiming":[[1,0,2100],[2,2100,4410],[3,4410,5050],[4,5050,5700],[5,5700,6300],[6,6300,7800],[7,7800,8670],[8,8670,9650],[9,9650,13270],[10,13270,14650],[11,14650,15510],[12,15510,16980],[13,16980,17400],[14,17400,19840],[15,19840,20630],[16,20630,23070],[17,23070,25230],[18,25230,26620],[19,26620,28160],[20,28160,28750],[21,28750,28910],[22,28910,31685]]}}