{"name":"27:22","price":"Basi (Hud-hud) akakaa si mbali na akasema: Nimegundua usilo gundua wewe, na ninakujia hivi kutoka nchi ya Sabai, na nakuletea khabari za yakini.","arabic":"فَمَكَثَ غَيۡرَ بَعِيدٖ فَقَالَ أَحَطتُ بِمَا لَمۡ تُحِطۡ بِهِۦ وَجِئۡتُكَ مِن سَبَإِۭ بِنَبَإٖ يَقِينٍ","category":["27 (An-Naml)","An-Naml","Surah An-Naml","Chapter An-Naml","Naml","Surah Naml","Chapter Naml","An Naml","Surah An Naml","Chapter An Naml","Surah 27","Chapter 27","The Ant","النَّمْل"],"ayahNumber":3181,"juzNumber":19,"footnotes":"Na Hud-hud alikuwa kakaa si pahala mbali kwa muda usio kuwa mrefu. Kisha akamjia Sulaiman, akamwambia: Nimejua jambo ulilo kuwa wewe hujalijua, na nimekujia kutoka nchi ya Sabai na khabari muhimu sana, nayo ni ya kweli kwa yakini. \"Basi hakukaa mbali, na akasema: Nimegundua usilo gundua wewe, na ninakujia hivi kutoka nchi ya Sabai, na nakuletea khabari za yakini. Hakika mimi nimemkuta mwanamke anawatawala, naye amepewa kila kitu, na anacho kiti cha enzi kikubwa.Nimemkuta yeye na watu wake wanalisujudia jua badala ya Mwenyezi Mungu; na Shetani amewapambia vitendo vyao na akawazuilia Njia. Kwa hivyo hawakuongoka.\" Hizi ndizo Aya khasa zilizo khusu Ufalme wa Sabai. Na hii Sabai ni moja katika falme za kusini ya Arabuni, inayo itwa Yaman, na ambayo zamani ilikuwa ni maarufu kwa jina la \"Arabia Iliyo Neemeka\". Na jina hili la mwisho linaonyesha maendeleo yake na utajiri wake. Kwani kwa hakika ilikuwa nchi hiyo ina ustaarabu wa juu tangu miaka elfu mbili kabla ya kuzaliwa Nabii Isa a.s. Ikitegemea makulima, kwa sababu ya rutuba ya ardhi yake, na uzuri wa hali yake ya hewa. Na pia ikitegemea biashara kwa kuwa ipo kati baina ya Bara Hindi, na Uhabeshi, na Somalia, na Sham, na Iraq. Na kwa hakika mahodhi yaliyo jengwa kuwekea maji na kuyatumia, na maarufu yao yote ni Hodhi Maa'rib (Tazama Aya 16 Surat Sabai) na miji iliyo jengewa ngome, na makasri, na mahekalu, yanashuhudia mpaka hii leo maendeleo ya kijamii ya utajiri ulio kuwako katika nchi hii. Na hakika nakshi walizo zinakishi watawala wao, na baina ya nakshi hizo zipo kanuni za kuendesha mambo ya ujenzi na mengineyo, yanaonyesha kwa kila dalili ukomo wa ustaarabu ulio nawiri walio ufikilia. Na huu ufalme wa Sabai ambao ulifikilia kilele cha kustawi kwake katika siku za Sulaiman a.s. kiasi ya karne kumi kabla ya kuzaliwa Nabii Isa a.s. ulikuwa ni ufalme kama wa kabla yake, yaani watoto wakiwarithi baba zao. Na kwa hivyo alikuwa akihukumu wakati wa Sulaiman a.s. Malkia. Wataalamu wa taarikhi wamekhitalifiana juu ya jina la Malkia huyo. Waarabu wakimwita Balqiis; akisaidiwa na wazee wahishimiwa kama ni Baraza la Mashauri lake. (Tazama Aya 28-33 katika Surat An-naml.) Wala haikuthibitisha taarikh (historia) kuwa Ufalme wa Sabai ulikuwa dola ya kuteka nchi, bali ulikuwa ufalme wa biashara, na misafara. Katika mabaki yake hatuoni kutajwa vita au kuteka nchi isipo kuwa kwa uchache. Na haya ni kuwa umuhimu wa majeshi yake ulikuwa ni kuhifadhi ngome zake na kuzihami, na kulinda misafara yake kwa aghlabu. Na wananchi wa Sabai walikuwa ni mapagani, makafiri, wakiliabudu jua, kama ilivyo kuja katika Aya tukufu nambari 24 katika Sura hii. Pia wakiabudu mwezi. Na hao ndio miungu yao muhimu kabisa. Na walikuwa wakiwatolea sadaka na wakifukiza ubani katika mahekalu yao.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"famakatha ghayra baʿīdin faqāla aḥaṭtu bimā lam tuḥiṭ bihi waji'tuka min saba-in binaba-in yaqīnin ","translations":["So he stayed","not","long","and he said","I have encompassed","that which","not","you have encompassed","it","and I have come to you","from","Saba","with news","certain","(22)"],"transliterationArr":["famakatha","ghayra","baʿīdin","faqāla","aḥaṭtu","bimā","lam","tuḥiṭ","bihi","waji'tuka","min","saba-in","binaba-in","yaqīnin",null],"verseTiming":[[1,0,900],[2,900,1560],[3,1560,3250],[4,3250,4230],[5,4230,5070],[6,5070,5750],[7,5750,6140],[8,6140,6830],[9,6830,7560],[10,7560,8560],[11,8560,8870],[12,8870,11100],[13,11100,12070],[14,12070,12950],[15,12950,15415]]}}