{"name":"27:88","price":"Na unaiona milima unaidhunia imetulia; nayo inakwenda kama mwendo wa mawingu. Huo ndio ufundi wa Mwenyezi Mungu aliye tengeneza vilivyo kila kitu. Hakika Yeye anazo khabari za yote myatendayo.","arabic":"وَتَرَى ٱلۡجِبَالَ تَحۡسَبُهَا جَامِدَةٗ وَهِيَ تَمُرُّ مَرَّ ٱلسَّحَابِۚ صُنۡعَ ٱللَّهِ ٱلَّذِيٓ أَتۡقَنَ كُلَّ شَيۡءٍۚ إِنَّهُۥ خَبِيرُۢ بِمَا تَفۡعَلُونَ","category":["27 (An-Naml)","An-Naml","Surah An-Naml","Chapter An-Naml","Naml","Surah Naml","Chapter Naml","An Naml","Surah An Naml","Chapter An Naml","Surah 27","Chapter 27","The Ant","النَّمْل"],"ayahNumber":3247,"juzNumber":20,"footnotes":"Na unaiona, ewe Mtume, milima na unadhani haitaharaki imetulia tu, lakini kwa hakika inakwenda mbio kama mawingu. Na haya ni katika uundaji wa Mwenyezi Mungu aliye umba kila kitu na akakizua. Hakika Yeye, Subhanahu, ni Mwenye kutimia ujuzi wake kwa yote wayatendayo watu, ya ut'iifu na maasi. Naye atawalipa kwayo. \"Na unaiona milima unaidhunia imetulia; nayo inakwenda kama mwendo wa mawingu. Huo ndio ufundi wa Mwenyezi Mungu aliye tengeneza vilivyo kila kitu. Hakika Yeye anazo khabari za yote myatendayo.\" Aya hii inathibitisha kuwa vitu vyote vinavyo fuata mvutano wa ardhi, kama milima, bahari, na funiko la anga n.k. vinashirikiana na dunia katika mzunguko wake wa kila siku juu ya msumari-kati wake, na mzunguko wake wa kila mwaka kulizunguka jua. Lakini mzunguko huu hauonekani. Ni kama kwenda kwa mawingu angani. Wanao tazama wanayaona, lakini hawasikii sauti yao, wala hawayagusi. Inaonyesha Aya hii tukufu kwamba Mwenyezi Mungu Mtukufu aliye tukuka, ameumba ulimwengu na mipango yake ya kuiendeshea. Naye ni Muweza wa kuifanya hii dunia imetulia tu haizunguki juu ya msumari-kati wake, au akaifanya kuzunguka juu ya msumari-kati wake sawa sawa na kuzunguka kwake kulizunguka jua. Na kwa hivyo ingeli kuwa nusu ya dunia imo kizani totoro kwa muda wa miezi sita, na kwa muda wa miezi sita ikawa nusu ya pili imo katika mwangaza moja kwa moja wa mchana. Na haya yangeli pelekea kuharibika mizani ya joto katika dunia yote. Na kwa hivyo uhai ulioko ungeli toweka duniani. Na Mwenyezi Mungu, Subhanahu wa Taa'la, ndiye aliye panga mpango huu uliopo kwa rehema yake na huruma zake kwa waja wake. Na juu ya kuwa Aristakhoris, mtaalamu wa ilimu ya falaki wa Iskandaria (Alexandria) katika Misri, aliandika (310-230 K.K.) juu ya kuzunguka dunia wenyewe kwa wenyewe, maandishi haya ya kisayansi ya kale yalikuwa hayajawafikia Waarabu wakati wa Mtume Muhammad s.a.w. au kabla yake. Bali wa mwanzo wa kuashiria mambo haya katika wao alikuwa Albiruni katika mwaka 1000 B.K. (Baada ya Kuzaliwa Nabii Isa), baada ya kuingia kufasiriwa vitabu vya ilimu za zamani kwa lugha ya Kiarabu ulio kuweko katika enzi za Banul Abbas. Basi kutokea haya kwa ulimi wa Mtume Muhammad s.a.w. ambaye aliye kuwa hajapata ilimu hiyo, ni dalili kuwa haya yalifunuliwa kwake na Mwenyezi Mungu.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"watarā al-jibāla taḥsabuhā jāmidatan wahiya tamurru marra al-saḥābi ṣun'ʿa al-lahi alladhī atqana kulla shayin innahu khabīrun bimā tafʿalūna ","translations":["And you see","the mountains","thinking them","firmly fixed","while they","will pass","(as the) passing","(of) the clouds","(The) Work","(of) Allah","Who","perfected","all","things","Indeed, He","(is) All-Aware","of what","you do","(88)"],"transliterationArr":["watarā","al-jibāla","taḥsabuhā","jāmidatan","wahiya","tamurru","marra","al-saḥābi","ṣun'ʿa","al-lahi","alladhī","atqana","kulla","shayin","innahu","khabīrun","bimā","tafʿalūna",null],"verseTiming":[[1,0,630],[2,630,1760],[3,1760,2790],[4,2790,5020],[5,5020,5560],[6,5560,6500],[7,6500,6990],[8,6990,9810],[9,9810,10820],[10,10820,11610],[11,11610,14040],[12,14040,14880],[13,14880,15440],[14,15440,17730],[15,17730,19430],[16,19430,21220],[17,21220,21930],[18,21930,25835]]}}