{"name":"28:73","price":"Na ni katika rehema zake amekufanyieni usiku na mchana mpate kupumzika humo na mtafute fadhila zake, na ili mpate kushukuru.","arabic":"وَمِن رَّحۡمَتِهِۦ جَعَلَ لَكُمُ ٱلَّيۡلَ وَٱلنَّهَارَ لِتَسۡكُنُواْ فِيهِ وَلِتَبۡتَغُواْ مِن فَضۡلِهِۦ وَلَعَلَّكُمۡ تَشۡكُرُونَ","category":["28 (Al-Qasas)","Al-Qasas","Surah Al-Qasas","Chapter Al-Qasas","Qasas","Surah Qasas","Chapter Qasas","Al Qasas","Surah Al Qasas","Chapter Al Qasas","Surah 28","Chapter 28","The Stories","القَصَص"],"ayahNumber":3325,"juzNumber":20,"footnotes":"Na miongoni mwa rehema za Mwenyezi Mungu kwa viumbe vyake ni kuwa kawaumbia usiku na mchana, inayo fuatana, ili wapate kupumzika usiku, na washughulikie kutafuta riziki zao na manufaa yao mengine wakati wa mchana, na watambue fadhila za Mwenyezi Mungu juu yao wapate kumshukuru. \"Sema: Mwaonaje, Mwenyezi Mungu angeli ufanya usiku umekukalieni moja kwa moja, mungu gani asiye kuwa Mwenyezi Mungu atakaye kuleteeni mwangaza? Basi je, hamsikii? Sema: Mwaonaje, Mwenyezi Mungu angeli ufanya mchana umekukalieni moja kwa moja mpaka Siku ya Kiyama, mungu gani asiye kuwa Mwenyezi Mungu ataye kuleteeni usiku mkapumzika humo? Basi je, hamwoni? Na ni katika rehema zake amekufanyieni usiku na mchana mpate kupumzika humo na mtafute fadhila zake, na ili mpate kushukuru.\" Hapana shaka kuwa kuumbwa kwa dunia kwa namna yake ilivyo sasa na ilivyo wekwa kwa mnasaba wa jua, na kuzunguka kwake wenyewe kwa wenyewe kila siku, na kulizunguka jua kila mwaka, hapana shaka kwamba haya yanaonyesha dhaahiri uwezo wa Mwenyezi Mungu na upweke wake. Na Aya tukufu inawazindua watu watambue ukweli ambao yawapasa wauelewe, nao ni kwamba Yeye Mtukufu lau kuwa aliumba dunia iwe na usiku wa milele, au iwe na mchana wa milele, basi hapanapo mungu mwengine anaye weza kuwaneemesha watu kwa mchana na usiku wa kufuatana kama hivi. Na hivyo ni kuwa lau kuwa dunia inazunguka juu ya msumari-kati wake na pia kulizunguka jua kwa kiwango kimoja kiasi ya siku 365 takriban, yangeli tokea mabadiliko makubwa mno. Miongoni mwao ni kudumu giza katika nusu ya dunia, na kudumu mwangaza katika nusu ya pili takriban. Na kwa hivi joto lingeli panda katika nusu yenye mwangaza kwa kiasi kisicho weza kuchukulika. Na nusu yenye giza ingeganda kwa barafu. Na pande zote mbili zisingeweza kuchukua kitu chochote chenye uhai. Ama huu mpango ulivyo sasa unapelekea kupishana usiku na mchana, na kwa hivyo kunapatikana mapumziko na utulivu wakati wa usiku, na kushughulika wakati wa mchana. Na hali ya hewa inasilihi uhai wa binaadamu, na wanyama, na mimea. Na haya ni katika fadhila za Mwenyezi Mungu juu ya waja wake, ambazo zinapelekea tukubali uwezo wake, na tudumu kumshukuru.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"wamin raḥmatihi jaʿala lakumu al-layla wal-nahāra litaskunū fīhi walitabtaghū min faḍlihi walaʿallakum tashkurūna ","translations":["And from","His Mercy","He made","for you","the night","and the day","that you may rest","therein","and that you may seek","from","His Bounty","and so that you may","be grateful","(73)"],"transliterationArr":["wamin","raḥmatihi","jaʿala","lakumu","al-layla","wal-nahāra","litaskunū","fīhi","walitabtaghū","min","faḍlihi","walaʿallakum","tashkurūna",null],"verseTiming":[[1,0,390],[2,390,1900],[3,1900,2560],[4,2560,3120],[5,3120,4000],[6,4000,5550],[7,5550,6700],[8,6700,7370],[9,7370,8800],[10,8800,9610],[11,9610,11610],[12,11610,13020],[13,13020,13400],[14,13400,15240],[15,15240,16660],[16,16660,19815]]}}