{"name":"2:104","price":"Enyi mlio amini! Msiseme: \"Raa'ina\", na semeni: \"Ndhurna\". Na sikieni! Na makafiri watapata adhabu chungu.","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَقُولُواْ رَٰعِنَا وَقُولُواْ ٱنظُرۡنَا وَٱسۡمَعُواْۗ وَلِلۡكَٰفِرِينَ عَذَابٌ أَلِيمٞ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":111,"juzNumber":1,"footnotes":"Enyi mlio amini! Tahadharini na hawa Mayahudi. Msimwambie Mtume pale anapo kusomeeni ufunuo: \"Raa'ina\" kwa kukusudia akuwekeni pahala pa uangalizi wake, yaani (Tuchunge, Turai), na akupeni muda katika kusoma kwake mpaka mzingatie na mhifadhi. Kwani watu makhabithi miongoni mwa Mayahudi husaidiana kutaka kukuigeni na kupindua ndimi zao kwa neno hilo mpaka likawa neno la matusi wanalo lijua wao. Na wao humkabili Mtume kwa neno hilo kwa kumfanyia maskhara. Lakini nyinyi tumieni neno jingine wasilo weza Mayahudi kulipatia njia ya kufanya ukhabithi wao na maskhara yao. Tumieni neno: \"Ndhurna\" yaani \"Tuangalie\". Na sikilizeni vyema anayo kusomeeni Mtume. Na Mwenyezi Mungu anawadundulizia adhabu kali kwa Siku ya Kiyama hawa wanao mfanyia maskhara Mtume. Katika lugha ya Kiyahudi ya Kiebrania lipo neno \"Rai'nu\" ambalo limejengwa na neno \"Ra'\" kwa maana ya \"Shari\" na neno \"nu\" linaonesha jamii, wingi. Na maana ya neno lote ni kuwa \"Wewe ni shari yetu\", wakikusudia kumwambia Mtume hayo.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"yāayyuhā alladhīna āmanū lā taqūlū rāʿinā waqūlū unẓur'nā wa-is'maʿū walil'kāfirīna ʿadhābun alīmun ","translations":["O you","who","believe[d]","(Do) not","say","Raina","and say","Unzurna","and listen","And for the disbelievers","(is) a punishment","painful","(104)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","lā","taqūlū","rāʿinā","waqūlū","unẓur'nā","wa-is'maʿū","walil'kāfirīna","ʿadhābun","alīmun",null],"verseTiming":[[1,0,2860],[2,2860,3770],[3,3770,4720],[4,4720,5050],[5,5050,6060],[6,6060,7020],[7,7020,7950],[8,7950,9410],[9,9410,10570],[10,10570,12590],[11,12590,13590],[12,13590,15805]]}}