{"name":"2:178","price":"Enyi mlio amini! Mmepewa ruhusa kulipa kisasi katika walio uwawa - muungwana kwa muungwana, na mtumwa kwa mtumwa, na mwanamke kwa mwanamke. Na anaye samehewa na ndugu yake chochote basi ashikwe kulipa kwa wema, na yeye alipe kwa ihsani. Huko ni kupunguziwa kuliko tokana na Mola wenu Mlezi, na ni rehema. Na atakaye vuka mipaka baada ya haya, basi yeye atapata adhabu chungu.","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ كُتِبَ عَلَيۡكُمُ ٱلۡقِصَاصُ فِي ٱلۡقَتۡلَىۖ ٱلۡحُرُّ بِٱلۡحُرِّ وَٱلۡعَبۡدُ بِٱلۡعَبۡدِ وَٱلۡأُنثَىٰ بِٱلۡأُنثَىٰۚ فَمَنۡ عُفِيَ لَهُۥ مِنۡ أَخِيهِ شَيۡءٞ فَٱتِّبَاعُۢ بِٱلۡمَعۡرُوفِ وَأَدَآءٌ إِلَيۡهِ بِإِحۡسَٰنٖۗ ذَٰلِكَ تَخۡفِيفٞ مِّن رَّبِّكُمۡ وَرَحۡمَةٞۗ فَمَنِ ٱعۡتَدَىٰ بَعۡدَ ذَٰلِكَ فَلَهُۥ عَذَابٌ أَلِيمٞ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":185,"juzNumber":2,"footnotes":"Katika Sharia tulizo walazimisha Waumini ni hukumu za mauwaji ya makusudi. Tumewaandikia kisasi kwa mauwaji. Na wala msichukulie dhulma za kijahiliya , walipo kuwa wakimuuwa muungwana asiye uwa kwa ajili ya mtumwa, na wakimuuwa mwanamume asiye uwa kwa ajili ya mwanamke, na mkuu asiye uwa badala ya mwenginewe aliye uwa, akaachiliwa aliye uwa khasa. (Kwa kila ukoo kujiona bora). Yatakikana yule aliye uwa auwawe yeye, akiwa ni muungwana, au mtumwa, au mwanamke. Msingi wa sharia ya kisasi ni kuondoa kufanyiana uadui kwa kumuuwa yule yule aliye uwa ili kuuzima moto wa kulipizana na kuondoa uadui. Walio uliwa mtu wao wakiacha kisasi, wakapendelea kuwasamehe wenzao, watakuwa na haki ya kupewa fidia kwa maiti wao. Na wao inatakikana wawe wasemehevu bila ya kumkahirisha aliye uwa. Na juu ya mwenye kuuwa alipe fidia bila ya kujikurupusha. Katika hukumu ya mauwaji kama tulivyo ilazimisha pana wepesi kwa Waumini ukilinganisha na hukumu ya Taurati inayo lazimisha kisasi tu, na kama ilivyo kuwa ni rehema ukilinganisha na watakavyo wenginewe kuwa muuwaji aachiliwe bure bila ya kumtaaradhi. Basi mwenye kuivuka hukumu hii baada ya hayo atapata adhabu chungu duniani na Akhera. Waarabu zama za jahiliya walikuwa hawafanyi usawa baina ya watukufu na wanyonge. Akiuliwa mwongozi hawatosheki na kumuuwa muuwaji bali huyo huachwa akenda kulipizwa kisasi kwa mwongozi wa kabila ya muuwaji. Kwao roho si sawa, na damu si sawa. Uislamu haukukubali haya, lakini ukapasisha Kisasi, roho kwa roho, mwenye kuuwa huuwawa. Muuwaji yeyote awaye atauliwa akiwa muungwana, mtumwa au mwanamke. Haya ni kwa ajili ya usawa katika damu; hapana mwenye damu tukufu na damu isiyo tukufu. Na inafahamika kwa ishara kuwa nafsi kwa nafsi. Na hii ni sharia ya milele, ilikuwako katika Taurat, na Injil na Qur'ani. Na Mwenyezi Mungu Mtukufu amesema: \"Na tuliwaandikia kuwa nafsi kwa nafsi...\" (taz. sura Almaida ). Na Mtume s.a.w. amesema: \"Damu za Waislamu ni sawa.\" Na amesema: \"Nafsi kwa nafsi\". Zingatia: Uislamu kwa sharia ya kisasi ina nadhari nyengine, sio kama kanuni za kutungwa. Imewapa wenye kuuliwa mtu wao haki ya kutaka muuwaji auwawe, kuondoa fitna na umwagaji wa damu mkubwa. Imewapa haki ya kusamehe au kulipwa kisasi, wala haizuilii serikali kumfedhehi aliye uwa ikiona hivyo ni maslaha. Uislamu hauzingatii sababu ya kuuwa, kwani mwenye kuuwa amedhulumu hata ikiwa sababu gani. Na huenda ukitafuta sababu akaonewa huruma mkosa, na kumpuuza mkoswa. Na hayo hupelekea mchafuko wa watu kuchukua kisasi mkononi mwao, na kuzalikana makosa juu ya makosa ya kuuwa, kwa kutoridhika wale walio uliwa mtu wao. Nadharia hii ya Kiislamu sasa inadurusiwa katika vyuo vikuu vya Ulaya.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"yāayyuhā alladhīna āmanū kutiba ʿalaykumu al-qiṣāṣu fī al-qatlā al-ḥuru bil-ḥuri wal-ʿabdu bil-ʿabdi wal-unthā bil-unthā faman ʿufiya lahu min akhīhi shayon fa-ittibāʿun bil-maʿrūfi wa-adāon ilayhi bi-iḥ'sānin dhālika takhfīfun min rabbikum waraḥmatun famani iʿ'tadā baʿda dhālika falahu ʿadhābun alīmun ","translations":["O you","who","believe[d]","Prescribed","for you","(is) the legal retribution","in","(the matter of) the murdered","the freeman","for the freeman","and the slave","for the slave","and the female","for the female","But whoever","is pardoned","[for it]","from","his brother","anything","then follows up","with suitable","[and] payment","to him","with kindness","That (is)","a concession","from","your Lord","and mercy","Then whoever","transgresses","after","that","then for him","(is) a punishment","painful","(178)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","kutiba","ʿalaykumu","al-qiṣāṣu","fī","al-qatlā","al-ḥuru","bil-ḥuri","wal-ʿabdu","bil-ʿabdi","wal-unthā","bil-unthā","faman","ʿufiya","lahu","min","akhīhi","shayon","fa-ittibāʿun","bil-maʿrūfi","wa-adāon","ilayhi","bi-iḥ'sānin","dhālika","takhfīfun","min","rabbikum","waraḥmatun","famani","iʿ'tadā","baʿda","dhālika","falahu","ʿadhābun","alīmun",null],"verseTiming":[[1,0,2600],[2,2600,3450],[3,3450,4410],[4,4410,4990],[5,4990,5880],[6,5880,6800],[7,6800,7000],[8,7000,8520],[9,8520,9400],[10,9400,10270],[11,10270,11190],[12,11190,12090],[13,12090,13850],[14,13850,15880],[15,15880,16750],[16,16750,17400],[17,17400,17830],[18,17830,18220],[19,18220,18920],[20,18920,20080],[21,20080,21710],[22,21710,23000],[23,23000,25290],[24,25290,26080],[25,26080,28680],[26,28680,29420],[27,29420,30570],[28,30570,31340],[29,31340,32530],[30,32530,33760],[31,33760,34300],[32,34300,35040],[33,35040,35620],[34,35620,36330],[35,36330,37040],[36,37040,38010],[37,38010,40085]]}}