{"name":"2:172","price":"Enyi mlio amini! Kuleni vizuri tulivyo kuruzukuni, na mumshukuru Mwenyezi Mungu, ikiwa kweli mnamuabudu Yeye tu.","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ كُلُواْ مِن طَيِّبَٰتِ مَا رَزَقۡنَٰكُمۡ وَٱشۡكُرُواْ لِلَّهِ إِن كُنتُمۡ إِيَّاهُ تَعۡبُدُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":179,"juzNumber":2,"footnotes":"Na Sisi tumewaruhusu watu kula kila kilicho halali tulicho waumbia katika ardhi. Na tumewakataza wasifuate nyayo za Shetani. Wakifanya hivyo watakuwa wameongokewa, lakini wakikataa basi Sisi tunawakhusisha Waumini tu kwa uwongofu wetu, na tunawabainishia wao kilicho halali na haramu. Basi enyi Waumini! Mmeruhusiwa kula kila chakula kitamu kilicho chema, sio kichafu. Basi mshukuruni Mwenyezi Mungu aliye kuwekeeni wazi neema ya kumakinika kwa vitu vizuri na kukuhalalishieni, na kwa neema ya ut'iifu na kufuata amri yake ili ibada zenu zitimie. Qurani imeutangulia utibabu wa kisasa kwa kukataza kula mzoga, kwani kifacho kwa ukongwe au ugonjwa husabibishwa na sumu inayo mdhuru mlaji. Kadhaalika cha kunyongwa au maradhi huinajisi damu, na ndani yake huwamo vingi vya kudhuru kama jasho na mkojo. Na nguruwe husabibisha maradhi ya khatari kama TRICHINOSIS ambayo khatimaye huharibu moyo na mapafu na husabibisha mauti.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"yāayyuhā alladhīna āmanū kulū min ṭayyibāti mā razaqnākum wa-ush'kurū lillahi in kuntum iyyāhu taʿbudūna ","translations":["O you","who","believe[d]","Eat","from","(the) good","(of) what","We have provided you","and be grateful","to Allah","if","you","alone","worship Him","(172)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","kulū","min","ṭayyibāti","mā","razaqnākum","wa-ush'kurū","lillahi","in","kuntum","iyyāhu","taʿbudūna",null],"verseTiming":[[1,0,2650],[2,2650,3530],[3,3530,4400],[4,4400,4990],[5,4990,5840],[6,5840,6990],[7,6990,7280],[8,7280,8640],[9,8640,9460],[10,9460,11830],[11,11830,12690],[12,12690,13610],[13,13610,14610],[14,14610,16010],[15,16010,16880],[16,16880,19815]]}}