{"name":"2:189","price":"Wanakuuliza khabarai ya miezi. Sema: Hiyo ni vipimo vya nyakati kwa ajili ya watu na Hija. Wala sio wema kuziingia nyumba kwa nyuma. Bali mwema ni mwenye kuchamngu. Na ingieni majumbani kupitia milangoni. Na mcheni Mwenyezi Mungu ili mpate kufanikiwa.","arabic":"۞ يَسۡـَٔلُونَكَ عَنِ ٱلۡأَهِلَّةِۖ قُلۡ هِيَ مَوَٰقِيتُ لِلنَّاسِ وَٱلۡحَجِّۗ وَلَيۡسَ ٱلۡبِرُّ بِأَن تَأۡتُواْ ٱلۡبُيُوتَ مِن ظُهُورِهَا وَلَٰكِنَّ ٱلۡبِرَّ مَنِ ٱتَّقَىٰۗ وَأۡتُواْ ٱلۡبُيُوتَ مِنۡ أَبۡوَٰبِهَاۚ وَٱتَّقُواْ ٱللَّهَ لَعَلَّكُمۡ تُفۡلِحُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":196,"juzNumber":2,"footnotes":"Na watu wanakuuliza khabari za mwezi, unaanza mwezi mchanga kama uzi, kisha unakua mpaka unatimia kaamili. Tena unapungua mpaka unakuwa kama ulivyo anza. Haukai katika hali moja kama jua. Nini maana ya kugeuka huku hata inakuwa kila siku 29 au 30 unakuja mwezi mpya? Waambie: Huku kutokea hivi kuandama mwezi na kugeuka yapo ndani yake maslaha ya Dini na dunia pia. Hizi ni alama za kuonyesha nyakati  za mambo ya maisha yenu. Zinaonyesha nyakati za Hija, ambayo ni moja katika Nguzo za Dini yenu. Na lau kuwa mwezi ungeli baki namna moja tu kama jua, msingeli tambua nyakati za maisha yenu na Hija zenu. Wala huko kutojua hikima ya kugeuka mwezi kusikupelekeeni kutilia shaka hikima ya Muumba. Wala sio wema kuziingilia nyumba kwa nyuma, kinyume na wafanyavyo watu wote. Lakini wema ni kumchamngu katika nyoyo na kumsafishia niya, na kuziingilia nyumba kwa kupitia milangoni kama wafanyavyo watu wote. Na mtake Haki na dalili iliyo sawa. Basi takeni radhi ya Mwenyezi Mungu, na muiogope adhabu yake na kwa hivyo ndio mtaraji kufanikiwa kwenu, na kufuzu kwenu na kuepuka adhabu ya Moto. Uislamu unahisabu mwezi unapo andama na kugeuka sura kwa watu kupimia nyakati za ibada, na pia kwa mambo yao ya kidunia, kwa sababu hayo ni mambo ya kuonekana, na kwa hivyo taarikhi inajuulikana kwa sura ya mwezi. Mwezi kwa hakika ni kama kioo kinacho onyesha mwangaza wa jua huku duniani. Mwezi ukiwa kati baina ya jua na dunia hauonekani, na baadae mwezi mchanga unaandama na wakaazi wa dunia wanajua kuwa mwezi mpya umeanza. Ukifika mwezi katika upande unao kabiliana baina ya jua na dunia ndio unapo kuwa wakati wa mbaamwezi, mwezi mpevu. Khalafu unaendelea kupungua kama ulivyo kuwa kwanza ukizidi kukua. Kwa hivyo taarikhi inaanza tangu pale ulipo kuwa mwezi mchanga. Pale unapo onekana mwezi mchanga kama uzi ndio mwezi umeandama, huonekana upande wa magharibi, hata kwa dakika chache baada ya kuchwa jua nao hupotea. Hivyo hivyo siku baada ya siku huhisabiwa mpaka zipite siku 29 au 30.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"yasalūnaka ʿani al-ahilati qul hiya mawāqītu lilnnāsi wal-ḥaji walaysa al-biru bi-an tatū al-buyūta min ẓuhūrihā walākinna al-bira mani ittaqā watū al-buyūta min abwābihā wa-ittaqū al-laha laʿallakum tuf'liḥūna ","translations":["They ask you","about","the new moons","Say","They","(are) indicators of periods","for the people","and (for) the Hajj","And it is not","[the] righteousness","that","you come","(to) the houses","from","their backs","[and] but","[the] righteous","(is one) who","fears (Allah)","And come","(to) the houses","from","their doors","And fear","Allah","so that you may","(be) successful","(189)"],"transliterationArr":["yasalūnaka","ʿani","al-ahilati","qul","hiya","mawāqītu","lilnnāsi","wal-ḥaji","walaysa","al-biru","bi-an","tatū","al-buyūta","min","ẓuhūrihā","walākinna","al-bira","mani","ittaqā","watū","al-buyūta","min","abwābihā","wa-ittaqū","al-laha","laʿallakum","tuf'liḥūna",null],"verseTiming":[[1,0,1410],[2,1410,1770],[3,1770,3390],[4,3390,3660],[5,3660,4090],[6,4090,5240],[7,5240,6770],[8,6770,8100],[9,8100,8800],[10,8800,9620],[11,9620,10680],[12,10680,11280],[13,11280,12240],[14,12240,13250],[15,13250,14440],[16,14440,16180],[17,16180,16960],[18,16960,17370],[19,17370,18700],[20,18700,19230],[21,19230,20210],[22,20210,20570],[23,20570,22020],[24,22020,23210],[25,23210,23970],[26,23970,25060],[27,25060,27515]]}}