{"name":"2:199","price":"Kisha miminikeni kutoka pale wanapo miminika watu, na muombeni Mwenyezi Mungu msamaha: hakika Mwenyezi Mungu ni Mwenye kusamehe Mwenye kurehemu.","arabic":"ثُمَّ أَفِيضُواْ مِنۡ حَيۡثُ أَفَاضَ ٱلنَّاسُ وَٱسۡتَغۡفِرُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":206,"juzNumber":2,"footnotes":"Makureshi walikuwa hawasimami na watu wengine katika A'rafat juu ya kuwa wakijua kuwa baba yao Ibrahim akisimama hapo. Na hayo ni kwa kujitukuza wasiwe sawa na wengineo na hali wao ati ni watu wa Nyumba ya Mwenyezi Mungu na ni wakaazi wa katika pahala patakatifu. Wakidai kuwa hayo ni kuitukuza Makka wasitoke kwenda A'rafat ambako si kutakatifu kama Makka. Mwenyezi Mungu akawalazimisha wazing'olee mbali hizo ada za kijinga, na wasimame katika A'rafat, na watoke huko kama watokavyo watu wote. Kwani hapana yeyote aliye bora kuliko mwengine katika utendaji wa ibada. Na inawapasa wamwombe Mwenyezi Mungu maghfira katika mwahala humu mwenye baraka. Hayo ndiyo yana maelekeo zaidi Mwenyezi Mungu kuwasamehe dhambi na makosa yao, na akawarehemu kwa fadhila yake.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"thumma afīḍū min ḥaythu afāḍa al-nāsu wa-is'taghfirū al-laha inna al-laha ghafūrun raḥīmun ","translations":["Then","depart","from","wherever","depart","the people","and ask forgiveness","(of) Allah","Indeed","Allah","(is) Oft-Forgiving","Most Merciful","(199)"],"transliterationArr":["thumma","afīḍū","min","ḥaythu","afāḍa","al-nāsu","wa-is'taghfirū","al-laha","inna","al-laha","ghafūrun","raḥīmun",null],"verseTiming":[[1,0,1150],[2,1150,2160],[3,2160,2550],[4,2550,3080],[5,3080,3810],[6,3810,5630],[7,5630,6630],[8,6630,9370],[9,9370,10410],[10,10410,11260],[11,11260,11980],[12,11980,14515]]}}