{"name":"2:195","price":"Na toeni katika njia ya Mwenyezi Mungu, wala msijitie kwa mikono yenu katika maangamizo. Na fanyeni wema. Hakika Mwenyezi Mungu huwapenda wafanyao wema.","arabic":"وَأَنفِقُواْ فِي سَبِيلِ ٱللَّهِ وَلَا تُلۡقُواْ بِأَيۡدِيكُمۡ إِلَى ٱلتَّهۡلُكَةِ وَأَحۡسِنُوٓاْۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُحۡسِنِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":202,"juzNumber":2,"footnotes":"Kupambana na makafiri kunahitaji kutoa roho kama ilivyo kutoa mali. Basi toeni kwa kuandaa vita, na jueni kuwa kupigana na hawa ni kupigana katika Njia ya Mwenyezi Mungu. Basi msikae tu. Toeni mali kwa ajili yake, kwani mkitofanya na mkafanya ubakhili adui atakupandeni na atakudhilini. Hapo itakuwa kama mlio jitokomeza wenyewe kwenye maangamio. Tendeni lilio kuwajibikieni kwa uzuri na vilivyo, kwani Mwenyezi Mungu hupenda anapo fanya jambo mtu alifanye vizuri. Aya 190 mpaka 195 zinaeleza sharia ya vita katika Uislamu. Nazo zinaeleza kwa matamshi yalio wazi haya yafuatayo: 1. Ruhusa ya kupigana imetolewa kwa ajili ya kujilinda na uvamizi wa vita wa vitendo khasa, au zikidhihiri dalili kuwa maadui wanataka vita. Vita havikulazimishwa kwa ajili ya vita wala kwa sababu ya kutaka kuwasilimisha watu kwa kuwauwa na kuwapiga vita. 2. Kunakatazwa kuvamia au kuanza uadui kwa njia yoyote ile. Basi hapana ruhusa kufanyiwa uadui asiye pigana, wala hapana ruhusa kuvuka mipaka ya uadui wakati wa vita: basi hauliwi asiye chukua silaha, wala hakhusiani na vita bali ni mwenye kukumbwa tu na vita. Wala hauliwi mwenye kusalimu amri na akatupa silaha. Wala hapana ruhusa kuwavunjia watu nyumba zao, huko ni kupita mpaka. 3. Mzingatie fadhila iliyo onyeshwa kwa kuamrishwa kuchamngu. Basi msivunje heshima ya wanawake kuwanajisi, hata washirikina wakifanya hayo. Wala msiwakatekate walio uwawa hata ikiwa makafiri wakiwafanyia hayo Waumini. Washirikina walimfanyia hayo Bwana wa Mashahidi, Hamza, wala Mtume s.a.w. hakutoa ruhusa kumfanyia hayo maiti yeyote, bali alikataza akasema:\"Tahadharini msiwakatekate maiti\". 4. Vita vinakwisha wakiacha washirikina kuwafitini Waumini katika Dini yao, na Dini inakuwa inataka akili na nyoyo zimwelekee Mwenyezi Mungu kwa uhuru. 5. Hapana vita katika mwezi mtukufu, nayo ni miezi ya Hija na Umra. Ikiwa washirikina watapigana katika miezi hiyo, basi Waumini nao yawapasa wapigane. 6. Kuacha kutoka kwenda pigana na maadui wanauwa pasina nasi kupigana nao ni kuipoteza kheri na wema. Kwa haya inadhihiri kuwa vita vya Islamu vina fadhila katika sababu zinazo pelekea kuanza kwake, na vina uadilifu katika kuviendesha. Viwapi hivi na vita vya mataifa mengine ya zamani na ya sasa! Vita vyao hao ni vya uchafu, na vita vya Islamu ni vya Haki na vyenye fadhila.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"wa-anfiqū fī sabīli al-lahi walā tul'qū bi-aydīkum ilā al-tahlukati wa-aḥsinū inna al-laha yuḥibbu al-muḥ'sinīna ","translations":["And spend","in","(the) way","(of) Allah","and (do) not","throw (yourselves)","[with your hands]","into","[the] destruction","And do good","indeed","Allah","loves","the good-doers","(195)"],"transliterationArr":["wa-anfiqū","fī","sabīli","al-lahi","walā","tul'qū","bi-aydīkum","ilā","al-tahlukati","wa-aḥsinū","inna","al-laha","yuḥibbu","al-muḥ'sinīna",null],"verseTiming":[[1,0,1860],[2,1860,2240],[3,2240,3050],[4,3050,3790],[5,3790,4310],[6,4310,5050],[7,5050,6450],[8,6450,6930],[9,6930,7950],[10,7950,9050],[11,9050,10460],[12,10460,11310],[13,11310,12120],[14,12120,15495]]}}