{"name":"2:222","price":"Na wanakuuliza juu ya hedhi. Waambie, huo ni uchafu. Basi jitengeni na wanawake wakati wa hedhi. Wala msiwaingilie mpaka wat'ahirike. Wakisha t'ahirika basi waendeeni alivyo kuamrisheni Mwenyezi Mungu. Hakika Mwenyezi Mungu huwapenda wanao tubu na huwapenda wanao jisafisha.","arabic":"وَيَسۡـَٔلُونَكَ عَنِ ٱلۡمَحِيضِۖ قُلۡ هُوَ أَذٗى فَٱعۡتَزِلُواْ ٱلنِّسَآءَ فِي ٱلۡمَحِيضِ وَلَا تَقۡرَبُوهُنَّ حَتَّىٰ يَطۡهُرۡنَۖ فَإِذَا تَطَهَّرۡنَ فَأۡتُوهُنَّ مِنۡ حَيۡثُ أَمَرَكُمُ ٱللَّهُۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلتَّوَّٰبِينَ وَيُحِبُّ ٱلۡمُتَطَهِّرِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":229,"juzNumber":2,"footnotes":"Na wanakuuliza juu ya kuwaingilia wake zenu wakati wanapo kuwa na damu ya mwezi, hedhi. Waambie kuwa hedhi ni uchafu. Basi jizuieni kuwaingilia wakati wake mpaka wat'ahirike (wasafike). Wakit'ahirika basi ingianeni nao katika njia za maumbile. Na ikiwa mtu amefanya makosa katika haya, basi na atubu, na Mwenyezi Mungu anapenda waja wake wakithiri toba na usafi kutokana na uchafu. Ilimu ya kisasa zimethibitisha kuwa wakati wa hedhi yanaweza kuwa madhara kwa kuwa zalio huweza kupata maradhi pindi likiingiliwa na vidudu vya maradhi, ambavyo ni vyepesi kuingia wakati wa kuingiliana na mwanamume. Maradhi hayo huenda yakasababisha mwanamke asiweze kuzaa. Mwanamume naye huambukia maradhi hayo kutokana na mwanamke kwa kupitia njia za mkojo, na maradhi yakapanda juu mpaka mafigo yakaharibika, na kuathirika vyombo vya uzazi, na mwanamume naye akawa hawezi kutia mimba. Maradhi haya huleta machungu makubwa. Watu walikuwa hawajui, lakini Mwenyezi Mungu anajua kila kitu. Na mwanamke anapo kuwa na damu anakuwa hana raghba ya kuingiliwa, basi kumuingilia wakati huo huenda kukamletea hali ya nafsi mbaya na chuki kwa jambo hilo.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"wayasalūnaka ʿani al-maḥīḍi qul huwa adhan fa-iʿ'tazilū al-nisāa fī al-maḥīḍi walā taqrabūhunna ḥattā yaṭhur'na fa-idhā taṭahharna fatūhunna min ḥaythu amarakumu al-lahu inna al-laha yuḥibbu al-tawābīna wayuḥibbu al-mutaṭahirīna ","translations":["And they ask you","about","[the] menstruation","Say","It","(is) a hurt","so keep away (from)","[the] women","during","(their) [the] menstruation","And (do) not","approach them","until","they are cleansed","Then when","they are purified","then come to them","from","where","has ordered you","Allah","Indeed","Allah","loves","those who turn in repentance","and loves","those who purify themselves","(222)"],"transliterationArr":["wayasalūnaka","ʿani","al-maḥīḍi","qul","huwa","adhan","fa-iʿ'tazilū","al-nisāa","fī","al-maḥīḍi","walā","taqrabūhunna","ḥattā","yaṭhur'na","fa-idhā","taṭahharna","fatūhunna","min","ḥaythu","amarakumu","al-lahu","inna","al-laha","yuḥibbu","al-tawābīna","wayuḥibbu","al-mutaṭahirīna",null],"verseTiming":[[1,0,1510],[2,1510,1890],[3,1890,3970],[4,3970,4840],[5,4840,5160],[6,5160,6510],[7,6510,7370],[8,7370,9850],[9,9850,10060],[10,10060,12040],[11,12040,13130],[12,13130,15110],[13,15110,15880],[14,15880,17300],[15,17300,18010],[16,18010,19130],[17,19130,21030],[18,21030,21370],[19,21370,21960],[20,21960,22900],[21,22900,25150],[22,25150,26380],[23,26380,27180],[24,27180,27930],[25,27930,29450],[26,29450,30220],[27,30220,33445]]}}