{"name":"2:22","price":"(Mwenyezi Mungu) ambaye amekufanyieni hii ardhi kuwa kama tandiko, na mbingu kama paa, na akateremsha maji kutoka mbinguni, na kwayo akatoa matunda yawe riziki zenu. Basi msimfanyizie Mwenyezi Mungu washirika, na hali nyinyi mnajua.","arabic":"ٱلَّذِي جَعَلَ لَكُمُ ٱلۡأَرۡضَ فِرَٰشٗا وَٱلسَّمَآءَ بِنَآءٗ وَأَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗ فَأَخۡرَجَ بِهِۦ مِنَ ٱلثَّمَرَٰتِ رِزۡقٗا لَّكُمۡۖ فَلَا تَجۡعَلُواْ لِلَّهِ أَندَادٗا وَأَنتُمۡ تَعۡلَمُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":29,"juzNumber":1,"footnotes":"Ni Yeye Mwenyezi Mungu peke yake ndiye aliye itandika ardhi kwa kudra yake, na akaikunjua ili isahilike kwenu kuweza kuikalia na kunafiika kwayo. Akajaalia juu yenu mbingu zilio nyanyuka na sayari zake mfano wa jengo lililo jengwa vilivyo, na akakuleteeni njia za uhai na neema - nayo ni maji - aliyo yateremsha kutoka mbinguni, akayafanya ndiyo sababu ya kutoa mimea na miti ya matunda ambayo amekuruzukuni faida yake. Basi haifai baada ya haya mkawaza kuwa Mwenyezi Mungu ana washirika mkawaabudu kama kumuabudu Yeye, kwani Yeye hana mfano wake wala mshirika. Na nyinyi kwa maumbile yenu mnajua kwa yakini kuwa Yeye hana mfano wala mshirika. Basi msiyaharibu maumbile haya. Katika Aya hii ipo sehemu ya kuonesha muujiza wa Qur'ani Tukufu: nayo ni kauli yake Mtukufu \"mbingu kama paa\". Haya asingeyajua Nabii asiyejua kusoma ila kwa ufunuo wa Mwenyezi Mungu, nayo ni kuwa mbingu kwa kisayansi ni kila kilicho izunguka dunia pande zote, na kwa ukomo wowote, na kwa sura yoyote katika anga, mpaka huko juu kabisa kwenye sayari nyenginezo, zilizoenea zisio na mwisho. Zote hizo zinazunguka kwa mpango wa ajabu, na sisi tunapata uvukuto na mn'gao wake, nazo zinakwenda kwa nguvu ya mvutano kama smaku. Katika sehemu ya mwanzo ya mbingu iliyo tuzunguka lipo anga linalo tukinga kama paa na mianga inayo dhuru kutokana na hizo sayari. Na tabaka hizo huachilia mianga yenye faida tu, ndipo penye mawingu yaletayo mvua.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"alladhī jaʿala lakumu al-arḍa firāshan wal-samāa bināan wa-anzala mina al-samāi māan fa-akhraja bihi mina al-thamarāti riz'qan lakum falā tajʿalū lillahi andādan wa-antum taʿlamūna ","translations":["The One Who","made","for you","the earth","a resting place","and the sky","a canopy","and sent down","from","the sky","water","then brought forth","therewith","[of]","the fruits","(as) provision","for you","So (do) not","set up","to Allah","rivals","while you","[you] know","(22)"],"transliterationArr":["alladhī","jaʿala","lakumu","al-arḍa","firāshan","wal-samāa","bināan","wa-anzala","mina","al-samāi","māan","fa-akhraja","bihi","mina","al-thamarāti","riz'qan","lakum","falā","tajʿalū","lillahi","andādan","wa-antum","taʿlamūna",null],"verseTiming":[[1,0,960],[2,960,1530],[3,1530,1960],[4,1960,2700],[5,2700,3460],[6,3460,6410],[7,6410,8760],[8,8760,11110],[9,11110,13360],[10,13360,13640],[11,13640,15720],[12,15720,18139],[13,18139,19059],[14,19059,19599],[15,19599,19939],[16,19939,21079],[17,21079,21689],[18,21689,22749],[19,22749,23279],[20,23279,24159],[21,24159,25049],[22,25049,26739],[23,26739,28619],[24,28619,30974]]}}