{"name":"2:228","price":"Na wanawake walio achwa wangoje peke yao mpaka t'ahara (au hedhi) tatu zipite. Wala haiwajuzii kuficha alicho umba Mwenyezi Mungu katika matumbo yao, ikiwa wanamuamini Mwenyezi Mungu na Siku ya Mwisho. Na waume wao wana haki ya kuwarejesha katika muda huo, kama wakitaka kufanya sulhu. Nao wanawake wanayo haki kwa Sharia kama ile haki iliyo juu yao. Na wanaume wana daraja zaidi kuliko wao. Na Mwenyezi Mungu ni Mwenye nguvu na Mwenye hikima.","arabic":"وَٱلۡمُطَلَّقَٰتُ يَتَرَبَّصۡنَ بِأَنفُسِهِنَّ ثَلَٰثَةَ قُرُوٓءٖۚ وَلَا يَحِلُّ لَهُنَّ أَن يَكۡتُمۡنَ مَا خَلَقَ ٱللَّهُ فِيٓ أَرۡحَامِهِنَّ إِن كُنَّ يُؤۡمِنَّ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِۚ وَبُعُولَتُهُنَّ أَحَقُّ بِرَدِّهِنَّ فِي ذَٰلِكَ إِنۡ أَرَادُوٓاْ إِصۡلَٰحٗاۚ وَلَهُنَّ مِثۡلُ ٱلَّذِي عَلَيۡهِنَّ بِٱلۡمَعۡرُوفِۚ وَلِلرِّجَالِ عَلَيۡهِنَّ دَرَجَةٞۗ وَٱللَّهُ عَزِيزٌ حَكِيمٌ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":235,"juzNumber":2,"footnotes":"Yawapasa wat'alaka wangojee bila ya kufanya pupa ya kuolewa muda wa hedhi tatu , ili kuhakikisha hawana mimba na kujipa nafasi ya kumkinika kurejeana. Wala si halali kwao kuficha mimba au damu ya hedhi. Huo ndio mwendo wa wanawake wanao muamini Mwenyezi Mungu na kukutana naye Siku ya Akhera. Na waume zao wanayo haki kuwarejea katika ule muda wa eda. Na wanaume wanapo tumia haki wakusudie kupatana si kudhuru. Wanawake nao wana haki mfano wa jukumu lilio juu yao katika mambo yasio kuwa kinyume na Sharia Tukufu (2). Na wanaume wana daraja juu yao ya ulinzi na kuyahifadhi maisha ya nyumbani na mambo ya watoto. Mwenyezi Mungu Subhanahu yuko juu ya waja wake, na Yeye ndiye anawatungia sharia zinazo wafikiana na hikima. (1) Zingatia: Khabari ya eda ya mt'alaka limefasiriwa neno \"Qurui\" na wanazuoni wengi kuwa ni \"Hedhi\". Na wamefasiri Shafii (na Malik) kuwa ni \"T'ahara\". Khabari nyengine za eda zitakuja baadae. Sharia ya eda imekuja ili kuhakikisha kuwa ipo mimba au hapana, kwani hayo hayawezi kuhakikishwa ila baada ya kupita hedhi (au t'ahara) tatu, kwani mbegu za uzazi haziwezi kuishi baada ya hedhi tatu. Mwenye mimba kwa kawaida hatoki hedhi, na akitoka ni mara moja au sana mara mbili. Kwani hakika hapo ile mimba huwa imepevuka kwa muda huo hata kufikia kujaza eneo lote la tumbo la uzazi, na kwa hivyo ikazuia kuteremka damu ya mwezi. Hiyo ni kudra ya Mwenyezi Mungu katika kuumba kwake, na hayakuwa hayo yanajuulikana na Waarabu, na wala hayakuwa yajuulikaane na Nabii asiye jua kusoma. Lakini Mwenyezi Mungu alimteremshia Qur'ani, akamfunza yeye na akaufunza umma wake. Na sababu ya pili ya sharia ya eda ni kumpa fursa ya mt'alaka kurejea kwa mumewe baada ya kuwaza na kufikiri na kutua. Na hapo ni mume kusema: \"Nimekurejea\". Lakini hii itahisabiwa ni moja katika t'alaka tatu.  Mwenyezi Mungu amempa mwanamke haki kama zile zinazo mwajibikia yeye. Na mwanamume amepewa cheo cha ulinzi na kuhifadhi. Na juu yake ni waajibu wa uadilifu. Uislamu ndio ulio mpa mwanamke haki ambazo hakupata kupewa na mila zote zilizo tangulia. Kwa Warumi mwanamke alikuwa ni kijikazi wa nyumba ya mumewe. Ana jukumu, lakini hana haki. Hali kadhaalika kwa Waajemi. (Na vivyo hivyo katika dini za Kiyahudi, Kikristo na Kibaniani.)  Paulo ameandika katika 1 Korintho: \"Wanawake na wanyamaze katika kanisa, maana hawana ruhusa kunena bali watii, kama vile inenavyo torati nayo. Na wakitaka kujifunza neno lo lote, na wawaulize waume zao wenyewe nyumbani mwao; maana ni aibu kunena katika kanisa.\" - 1 Korinth. 14.34-35. \"Kwa maana kweli haimpasi mwanamume kufunikwa kichwa, kwa sababu yeye ni mfano na utukufu wa Mungu. Lakini mwanamke ni utukufu wa mwanamume. Maana mwanamume hakutoka katika mwanamke, bali mwanamke katika mwanamume. Wala mwanamume hakuumbwa kwa ajili ya mwanamke, bali mwanamke kwa ajili ya mwanamume.\" 1 Korinth. 11.7.9 \"Mwanamke na ajifunze katika utulivu, akitii kwa kila namna. Simpi mwanamke ruhusa ya kufundisha, wala kumtawala mwanamume, bali awe katika utulivu. Kwa maana Adamu ndiye aliyeumbwa kwanza, na Hawa baadaye. Wala Adamu hakudanganywa, mwanamke alidanganywa kabisa akaingia katika hali ya kukosa..\" 1 Timotheo 2.11-14. Na hapana popote katika Biblia panapo kataza Mayahudi au Wakristo kuoa wake wengi, isipo kuwa kauli moja tu ya Paulo inayo mpendekeza Askofu aoe mke asiye zidi mmoja. Kauli hiyo iko katika Waraka wa Kwanza wa Paulo kwa Timotheo 3.2: \"Basi imempasa askofu awe mtu asiyelaumika, mume wa mke mmoja, mwenye kiasi na busara, mtu wa utaratibu, n.k.\" Je, ni Uislamu au Ukristo ulio mweka chini mwanamke?)","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"wal-muṭalaqātu yatarabbaṣna bi-anfusihinna thalāthata qurūin walā yaḥillu lahunna an yaktum'na mā khalaqa al-lahu fī arḥāmihinna in kunna yu'minna bil-lahi wal-yawmi al-ākhiri wabuʿūlatuhunna aḥaqqu biraddihinna fī dhālika in arādū iṣ'lāḥan walahunna mith'lu alladhī ʿalayhinna bil-maʿrūfi walilrrijāli ʿalayhinna darajatun wal-lahu ʿazīzun ḥakīmun ","translations":["And the women who are divorced","shall wait","concerning themselves","(for) three","monthly periods","And (it is) not","lawful","for them","that","they conceal","what","(has been) created","(by) Allah","in","their wombs","if","they","believe","in Allah","and the Day","[the] Last","And their husbands","(have) better right","to take them back","in","that (period)","if","they wish","(for) reconciliation","And for them","(is the) like","(of) that which","(is) on them","in a reasonable manner","and for the men","over them","(is) a degree","And Allah","(is) All-Mighty","All-Wise","(228)"],"transliterationArr":["wal-muṭalaqātu","yatarabbaṣna","bi-anfusihinna","thalāthata","qurūin","walā","yaḥillu","lahunna","an","yaktum'na","mā","khalaqa","al-lahu","fī","arḥāmihinna","in","kunna","yu'minna","bil-lahi","wal-yawmi","al-ākhiri","wabuʿūlatuhunna","aḥaqqu","biraddihinna","fī","dhālika","in","arādū","iṣ'lāḥan","walahunna","mith'lu","alladhī","ʿalayhinna","bil-maʿrūfi","walilrrijāli","ʿalayhinna","darajatun","wal-lahu","ʿazīzun","ḥakīmun",null],"verseTiming":[[1,0,1710],[2,1710,3030],[3,3030,5570],[4,5570,6570],[5,6570,8790],[6,8790,9320],[7,9320,10060],[8,10060,11290],[9,11290,11700],[10,11700,13050],[11,13050,13440],[12,13440,14030],[13,14030,14730],[14,14730,16090],[15,16090,18160],[16,18160,19170],[17,19170,20330],[18,20330,21880],[19,21880,22860],[20,22860,23810],[21,23810,24670],[22,24670,27400],[23,27400,28200],[24,28200,29940],[25,29940,30360],[26,30360,31080],[27,31080,31440],[28,31440,33510],[29,33510,34860],[30,34860,36650],[31,36650,37130],[32,37130,37890],[33,37890,39410],[34,39410,41679],[35,41679,43320],[36,43320,44980],[37,44980,46130],[38,46130,47050],[39,47050,47980],[40,47980,50005]]}}