{"name":"31:13","price":"Na Luqman alipo mwambia mwanawe kwa kumpa mawaidha: Ewe mwanangu! Usimshirikishe Mwenyezi Mungu. Kwani hakika ushirikina bila ya shaka ni dhulma iliyo kubwa.","arabic":"وَإِذۡ قَالَ لُقۡمَٰنُ لِٱبۡنِهِۦ وَهُوَ يَعِظُهُۥ يَٰبُنَيَّ لَا تُشۡرِكۡ بِٱللَّهِۖ إِنَّ ٱلشِّرۡكَ لَظُلۡمٌ عَظِيمٞ","category":["31 (Luqman)","Luqman","Surah Luqman","Chapter Luqman","Surah 31","Chapter 31","Luqman","لقمَان"],"ayahNumber":3482,"juzNumber":21,"footnotes":"Taja pale Luqman alipo mwambia mwanawe: Ewe mwanangu! Usimshirikishe Mwenyezi Mungu na yeyote. Hakika kumshirikisha Mwenyezi Mungu ni dhulma kubwa, kuwaweka sawa Mwenye kustahiki na asiye stahiki. Waarabu walikuwa wanawajua watu wawili kwa jina hili. Mmoja wapo ni Luqman bin A'adi. Nao walikuwa wakimtukuza cheo kwa werevu wake, uraisi, ujuzi, ufasihi na ujanja. Na walikithiri sana kumtaja na kumpigia mithali, kama inavyo onekana katika vitabu vya Kiarabu vingi. Ama mwengine ni huyo anaye itwa Luqman Alhakim, (Mwenye hikima), aliye kuwa mashuhuri kwa hikima yake na mifano yake, na ambaye Sura hii ya Qur'ani imeitwa kwa jina lake. Na hikima zake zilikuwa zimeenea kwa Waarabu. Ibn Hisham amesimulia kwamba Suwaid bin Ass'amit alifika Makka. Naye alikuwa mtu mtukufu kwa watu wake. Mtume s.a.w. akamtaka asilimu. Suwaid akasema: Huenda labda uliyo nayo wewe ndiyo kama niliyo nayo mimi. Mtume s.a.w. akasema: Nini ulicho nacho? Akasema: Majalla ya Luqman. Mtume s.a.w. akasema: Nisomee. Akamsomea. Tena akasema: Hakika haya maneno mazuri. Na niliyo nayo mimi ni bora zaidi, nayo ni Qur'ani aliyo niteremshia Mwenyezi Mungu, nayo ni Uwongofu na Nuru. Mtume s.a.w. akamsomea Qur'ani na akamtaka asilimu. Na pia Imam Malik ametaja kwa wingi hikima za Luqman katika kitabu chake, Al Muwatt'a. Na baadhi ya vitabu vya Tafsiri ya Qur'ani na Adab (maandishi ya ufasihi wa lugha) vimetaja namna mbali mbali katika hikima hizo. Kisha baadae ikakusanywa mithali kwa visa katika kitabu chenye jina la Mithali za Luqman. Lakini kwa sababu ya udhaifu wa mpango wake, na wingi wa makosa ya nahau na sarfu, na kuwa kutopokewa kitabu cha jina hili katika vitabu vya Waarabu wa kale, yatilia nguvu kuwa hichi kimezuliwa tu katika zama za mwisho. Na maoni yanayo gongana juu ya uhakika wa Luqman Al-hakim: ni kuwa yeye ni Mnubi katika watu wa Abla au Uhabeshi, au mtu mweusi wa Sudan ya Misri, au ni Muibrani. Na wengi walio mtaja wanakubaliana kuwa hakuwa Nabii. Wachache tu ndio wanasema kuwa alikuwa Nabii. Na tunalo weza kutambua katika yaliyo tajwa ni kuwa hakuwa Mwaarabu, kwa sababu wote wamewafikiana kwa hayo. Na kwamba alikuwa ni mtu mwenye hikima, na hakuwa Nabii, na kwamba ameingiza miongoni mwa Waarabu hikima mpya zikawa zinatajwa mara nyingi kama ilivyo onekana baadae katika vitabu.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"wa-idh qāla luq'mānu li-ib'nihi wahuwa yaʿiẓuhu yābunayya lā tush'rik bil-lahi inna al-shir'ka laẓul'mun ʿaẓīmun ","translations":["And when","said","Luqman","to his son","while he","(was) instructing him","O my son","(Do) not","associate partners","with Allah","Indeed","associating partners","(is) surely an injustice","great","(13)"],"transliterationArr":["wa-idh","qāla","luq'mānu","li-ib'nihi","wahuwa","yaʿiẓuhu","yābunayya","lā","tush'rik","bil-lahi","inna","al-shir'ka","laẓul'mun","ʿaẓīmun",null],"verseTiming":[[1,0,650],[2,650,1210],[3,1210,2090],[4,2090,3080],[5,3080,3660],[6,3660,4690],[7,4690,5950],[8,5950,6270],[9,6270,7070],[10,7070,9890],[11,9890,11040],[12,11040,11860],[13,11860,12810],[14,12810,15855]]}}