{"name":"34:28","price":"Na hatukukutuma ila kwa watu wote, uwe mbashiri, na mwonyaji. Lakini watu wengi hawajui.","arabic":"وَمَآ أَرۡسَلۡنَٰكَ إِلَّا كَآفَّةٗ لِّلنَّاسِ بَشِيرٗا وَنَذِيرٗا وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يَعۡلَمُونَ","category":["34 (Saba)","Saba","Surah Saba","Chapter Saba","Surah 34","Chapter 34","Sheba","سَبَأ"],"ayahNumber":3634,"juzNumber":22,"footnotes":"Na Sisi hatukukutuma ewe Muhammad, ila kwa watu wote. Uwe ni mwenye kuwabashiria Waumini kuwa watapata kheri, na mwenye kuwaonya makafiri kuwa watapata shari. Lakini aghlabu ya watu hawaujui ukweli wako, wala kuwa Utume wako ni wa kwa watu wote. (Haya ni kwa sababu hapana Mtume aliye kuja kwa watu wote ila huyu Nabii Muhammad s.a.w. Nabii Musa alikuja kwa Wana wa Israili kuwatoa Misri. Nabii Isa, Yesu Kristo, pia kaja kwa Wana wa Israili tu, kama isemavyo Qur'ani 3.49, na Injili ya Mathayo 10.5-6 Yesu alipo sema: \"Afadhali shikeni njia kuwaendea kondoo waliopotea wa nyumba ya Israeli.\" Na 15.24 alipo sema: \"Sikutumwa ila kwa kondoo waliopotea wa nyumba ya Israeli.\" Na Injili ya Yohana 17.9)","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"wamā arsalnāka illā kāffatan lilnnāsi bashīran wanadhīran walākinna akthara al-nāsi lā yaʿlamūna ","translations":["And not","We have sent you","except","comprehensively","to mankind","(as) a giver of glad tidings","and (as) a warner","But","most","[the] people","(do) not","know","(28)"],"transliterationArr":["wamā","arsalnāka","illā","kāffatan","lilnnāsi","bashīran","wanadhīran","walākinna","akthara","al-nāsi","lā","yaʿlamūna",null],"verseTiming":[[1,0,2140],[2,2140,3400],[3,3400,4050],[4,4050,7240],[5,7240,8930],[6,8930,10250],[7,10250,11860],[8,11860,13410],[9,13410,14180],[10,14180,15460],[11,15460,15760],[12,15760,18135]]}}