{"name":"35:12","price":"Na bahari mbili haziwi sawa; haya ni matamu yenye ladha, mazuri kunywa. Na haya ni ya chumvi, machungu. Na kutokana na bahari zote mnakula nyama mpya (isiyo chacha). Na mnatoa mapambo mnayo yavaa. Na unaona ndani yake marikebu zinakata maji ili mtafute fadhila zake, na ili mpate kushukuru.","arabic":"وَمَا يَسۡتَوِي ٱلۡبَحۡرَانِ هَٰذَا عَذۡبٞ فُرَاتٞ سَآئِغٞ شَرَابُهُۥ وَهَٰذَا مِلۡحٌ أُجَاجٞۖ وَمِن كُلّٖ تَأۡكُلُونَ لَحۡمٗا طَرِيّٗا وَتَسۡتَخۡرِجُونَ حِلۡيَةٗ تَلۡبَسُونَهَاۖ وَتَرَى ٱلۡفُلۡكَ فِيهِ مَوَاخِرَ لِتَبۡتَغُواْ مِن فَضۡلِهِۦ وَلَعَلَّكُمۡ تَشۡكُرُونَ","category":["35 (Fatir)","Fatir","Surah Fatir","Chapter Fatir","Surah 35","Chapter 35","The Originator","فَاطِر"],"ayahNumber":3672,"juzNumber":22,"footnotes":"Na haziwi sawa bahari mbili katika ujuzi wetu na makadirio yetu, ijapo kuwa zinashirikiana katika baadhi ya manufaa yao. Haya maji matamu yanakata kiu kwa uzuri wake, na utamu wake, na wepesi wake kuyanywa. Na haya mengine ni maji ya chumvi, uchumvi wake mkali. Na kutokana na namna zote mbili mnakula nyama mpya (fresh, haikuchacha) nayo ni samaki mnao wavua. Na mnatoa kutoka maji ya chumvi mapambo mnayo yavaa, kama lulu na marijani. Na wewe, mwenye kutazama, unaona vipi vyombo vya baharini vinavyo kwenda, vikipasua maji kwa mwendo wake, ili mkatafute baadhi ya fadhila za Mwenyezi Mungu kwa kufanya biashara, na ili asaa mpate kumshukuru Mola wenu Mlezi kwa neema hizi. Na katika Ishara za Mwenyezi Mungu ambazo anawaitia watu wazizingatie na ambazo amewaneemesha fadhila zake ni mwendo wa marikebu na kukata kwake maji baharini kwa mujibu wa kawaida zake alizo ziwekea katika tabia za maumbile, nazo ni hizo sharia za vitu kuelea, (The law of boayancy). Ni maarufu kuwa baadhi ya mapambo yanapatikana kutoka maji ya chumvi, na baadhi ya watu labda wanaona haiwi maji matamu kutoa mapambo vile vile. Lakini ilimu na mambo yalivyo yamethibitisha kinyume cha hivyo. Ama lulu kama zinavyo patikana katika maji ya chumvi, basi vile vile zinapatikana kwenye namna fulani nyengine za chaza wa mitoni. Hupatikana lulu katika maji matamu katika Uingereza, Scotland, Wales. Czechoslovakia na Japan.. n.k. mbali na lulu za baharini maarufu. Na pia vinaingia katika vinavyo patikana katika maji matamu maadini thamini ngumu kama almasi, zinazo patikana katika udongo unao tupwa na mito. Hupatikana pia Yaakuti, katika mito ya Mojok karibu na Andalas katika Burma ya juu. Ama katika Siam (Thailand) na Sri Lanka hupatikana Yaakuti katika mito. Na katika mawe ambayo yashabihiana na ya ghali na hutumiwa kwa pambo ni Topaz. Na hupatikana pia kwenye mito mwahali mwingi katika Brazil na Urusi (Ural na Siberia) Fluro-sylicate of aluminium. Aghlabu hiyo huwa ya manjano au rangi ya kahawia. Circom ni jiwe thamini linavutia. Sifa zake zinakaribia za Almasi. Namna zake nyingi hupatikana kwenye mito. (Kadhaalika dhahabu, ambayo inaitwa Alluvial gold yaani dhahabu ya mtoni, hupatikana nchi nyingi, mojawapo ni Zaire.)","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"wamā yastawī al-baḥrāni hādhā ʿadhbun furātun sāighun sharābuhu wahādhā mil'ḥun ujājun wamin kullin takulūna laḥman ṭariyyan watastakhrijūna ḥil'yatan talbasūnahā watarā al-ful'ka fīhi mawākhira litabtaghū min faḍlihi walaʿallakum tashkurūna ","translations":["And not","are alike","the two seas","This","(is) fresh","sweet","pleasant","its drink","and this","salty","(and) bitter","And from","each","you eat","meat","fresh","and you extract","ornaments","you wear them","and you see","the ships","in it","cleaving","so that you may seek","of","His Bounty","and that you may","be grateful","(12)"],"transliterationArr":["wamā","yastawī","al-baḥrāni","hādhā","ʿadhbun","furātun","sāighun","sharābuhu","wahādhā","mil'ḥun","ujājun","wamin","kullin","takulūna","laḥman","ṭariyyan","watastakhrijūna","ḥil'yatan","talbasūnahā","watarā","al-ful'ka","fīhi","mawākhira","litabtaghū","min","faḍlihi","walaʿallakum","tashkurūna",null],"verseTiming":[[1,0,750],[2,750,1530],[3,1530,2620],[4,2620,3330],[5,3330,4400],[6,4400,6390],[7,6390,9070],[8,9070,10530],[9,10530,11470],[10,11470,12280],[11,12280,14680],[12,14680,16710],[13,16710,17610],[14,17610,19160],[15,19160,20720],[16,20720,22370],[17,22370,23910],[18,23910,25610],[19,25610,27300],[20,27300,28560],[21,28560,29320],[22,29320,29910],[23,29910,30820],[24,30820,31910],[25,31910,32190],[26,32190,33810],[27,33810,35170],[28,35170,37615]]}}