{"name":"35:27","price":"Je! Huoni kwamba Mwenyezi Mungu ameteremsha maji kutoka mbinguni, na kwayo tumeyatoa matunda yenye rangi mbali mbali. Na katika milima imo mistari myeupe na myekundu yenye rangi mbali mbali, na myeusi sana.","arabic":"أَلَمۡ تَرَ أَنَّ ٱللَّهَ أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗ فَأَخۡرَجۡنَا بِهِۦ ثَمَرَٰتٖ مُّخۡتَلِفًا أَلۡوَٰنُهَاۚ وَمِنَ ٱلۡجِبَالِ جُدَدُۢ بِيضٞ وَحُمۡرٞ مُّخۡتَلِفٌ أَلۡوَٰنُهَا وَغَرَابِيبُ سُودٞ","category":["35 (Fatir)","Fatir","Surah Fatir","Chapter Fatir","Surah 35","Chapter 35","The Originator","فَاطِر"],"ayahNumber":3687,"juzNumber":22,"footnotes":"Ewe mwenye akili! Huoni kwamba Mwenyezi Mungu anayateremsha maji kutoka mbinguni, na kwa maji hayo anatoa mazao yanayo khitalifiana rangi zake? Mengine ni mekundu na manjano, na matamu na machungu, mazuri na mabaya. Na katika milima, ipo milima yenye njia na mistari myeupe na myekundu, yenye kukhitalifiana pia kwa kukoza na kufifia. Ya kustaajabisha kitaalamu katika Aya hii tukufu sio tu kwa kukhitalifiana rangi mbali mbali katika milima, ambazo zinatokana na hizo sehemu za maadini zilizo fanya majabali, kama vile chuma huonyesha rangi yake nyekundu, na manganese na makaa ya mawe huonekana kwa rangi nyeusi, au shaba ambayo hudhihirisha rangi ya kijani n.k. Lakini ya kustaajabisha khasa ni kuunganisha baina ya kutoa matunda ya namna mbali mbali na hali miti yake inanyweshwa maji yale yale, na kuumbwa milima myekundu, na myeupe, na myeusi, na yote yana asli moja kwa kuundwa kwake. Wataalamu wa ilimu za t'abaka za ardhi, Jiolojia, wanaita Magma. Na hii Magma moja inapo chomoza pahala mbali mbali katika ardhi, na penye vina mbali mbali (kwenda chini) katika ardhi kutoka juu basi hupatikana khitilafu katika muundo wake na hukusanyika kwa kurindika kuwa ni milima yenye maadini ya rangi mbali mbali. Na huu basi mwendo wa Mwenyezi Mungu ni mmoja. Kwani hakika asli ni moja, na matawi ndiyo yanakhitalifiana kwa kuonekana. Na katika haya yanapatikana manufaa na faida kwa binaadamu.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"alam tara anna al-laha anzala mina al-samāi māan fa-akhrajnā bihi thamarātin mukh'talifan alwānuhā wamina al-jibāli judadun bīḍun waḥum'run mukh'talifun alwānuhā wagharābību sūdun ","translations":["Do not","you see","that","Allah","sends down","from","the sky","water","then We bring forth","therewith","fruits","(of) various","[their] colors","And in","the mountains","(are) tracts","white","and red","(of) various","[their] colors","and intensely black","and intensely black","(27)"],"transliterationArr":["alam","tara","anna","al-laha","anzala","mina","al-samāi","māan","fa-akhrajnā","bihi","thamarātin","mukh'talifan","alwānuhā","wamina","al-jibāli","judadun","bīḍun","waḥum'run","mukh'talifun","alwānuhā","wagharābību","sūdun",null],"verseTiming":[[1,0,560],[2,560,950],[3,950,2170],[4,2170,2900],[5,2900,4430],[6,4430,4690],[7,4690,6980],[8,6980,9910],[9,9910,11200],[10,11200,11730],[11,11730,12730],[12,12730,14560],[13,14560,15930],[14,15930,17030],[15,17030,18020],[16,18020,19220],[17,19220,19760],[18,19760,21250],[19,21250,22920],[20,22920,24220],[21,24220,25330],[22,25330,27815]]}}