{"name":"36:68","price":"Na tunaye mzeesha tunamrudisha nyuma katika umbo. Basi je! hawazingatii?","arabic":"وَمَن نُّعَمِّرۡهُ نُنَكِّسۡهُ فِي ٱلۡخَلۡقِۚ أَفَلَا يَعۡقِلُونَ","category":["36 (Ya-Sin)","Ya-Sin","Surah Ya-Sin","Chapter Ya-Sin","Sin","Surah Sin","Chapter Sin","Ya Sin","Surah Ya Sin","Chapter Ya Sin","Surah 36","Chapter 36","Ya-Sin","يس"],"ayahNumber":3773,"juzNumber":23,"footnotes":"Na tunaye mfanyia umri wake ukawa mrefu, tunamrudisha, kutoka nguvu akawa dhaifu. Basi je hawayazingatii haya wakayatia akilini ya uweza wetu kuyafanya haya, na wao wakajua kuwa dunia ni nyumba ya kupita ina mwisho wake, na kuwa Akhera ndiyo nyumba ya kubaki na kudumu? Na tunaye mfanyia umri wake uwe mrefu tunamrejesha awe kinyume na alivyo kuwa. Yaani baada ya kuwa na nguvu anakuwa dhaifu. Hayo ni kwa kuwa maisha ya mwanaadamu yanapitia vipindi vitatu, kukua, kutimia kukua; na ukongwe unaanza kwa kunywea kwa mafigo, ini, Ghudda Ddarqiya au Thyroid gland, na Pancreas, yaani Dongoronya. Na haya huleta athari katika kudhoofika mwili wote. Mishipa ya damu nayo huanza kukacha na kunywea, na kwa hivyo hupunguka damu inayo kwenda katika viungo vyote vya mwili, basi ndio huzidi udhaifu juu ya udhaifu. Na katika sababu za kukonga ni kuzidi nguvu za kubomoka kuliko kujengeka katika mwili, yaani Metabolism. Na hayo ni kwa kuwa Khalaya au Cells, za mwili zote zimo katika hali ya kugeuka, na pia Khalaya za damu, isipo kuwa Khalaya za ubongo wa kichwani na wa katika mifupa. Hizo hazigeuki muda wote wa uhai. Ikiwa kiasi ya kuundika upya ni sawa ya kiasi cha kuharibika, basi hapana madhara yanayo tokea. Lakini ikiwa kuharibika ni kukubwa kuliko kujengeka katika kiungo chochote basi hapo hudhihiri madhara kwenye kiungo hicho. Na kwa hivyo kila umri ukiwa mkubwa kiasi cha kujengeka kinapungua na kinazidi kiasi cha kubomoka kwa Khalaya, na kunadhihiri kunywea, na kupungua nguvu kote. Na hukhitalifiana kiasi cha kujengeka kwa mnasaba wa kubomoka kwa kukhitalifiana namna ya mfumo (Nasiij, Texture). Katika hayo yanayo dhihiri kama ngozi iliyo funika mwili, na zilio funika paipu za kusaga chakula, na paipu za Ghudad, Glands, zinachakaa kwa upesi zaidi kila miaka ya binaadamu ikipita. Na hii ni sababu ya kuonekana upesi alama za kuzeeka.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"waman nuʿammir'hu nunakkis'hu fī al-khalqi afalā yaʿqilūna ","translations":["And (he) whom","We grant him long life","We reverse him","in","the creation","Then will not","they use intellect","(68)"],"transliterationArr":["waman","nuʿammir'hu","nunakkis'hu","fī","al-khalqi","afalā","yaʿqilūna",null],"verseTiming":[[1,0,560],[2,560,3530],[3,3530,4730],[4,4730,4970],[5,4970,5810],[6,5810,6640],[7,6640,10295]]}}