{"name":"36:80","price":"Aliye kujaalieni kupata moto kutokana na mti wa kijani nanyi mkawa kwa huo mnawasha.","arabic":"ٱلَّذِي جَعَلَ لَكُم مِّنَ ٱلشَّجَرِ ٱلۡأَخۡضَرِ نَارٗا فَإِذَآ أَنتُم مِّنۡهُ تُوقِدُونَ","category":["36 (Ya-Sin)","Ya-Sin","Surah Ya-Sin","Chapter Ya-Sin","Sin","Surah Sin","Chapter Sin","Ya Sin","Surah Ya Sin","Chapter Ya Sin","Surah 36","Chapter 36","Ya-Sin","يس"],"ayahNumber":3785,"juzNumber":23,"footnotes":"Aliye kuumbieni moto kutoka mti mbichi, baada ya kwisha kauka. Nguvu za jua zinaingia ndani ya mimea kwa wasita wa mwangaza. Khalaya zenye madda ya kijani katika mimea Chlorophyl ndizo zinafyonza Carbon dioxide kutokana na hewa, na hii huchanganyika na maji yanayo fonzwa na mimea, na kufanyika Carbohydrates kwa kuathiriwa na nguvu zinazo tokana na mwangaza wa jua. Tena hufanyika mbao, kuni, ambazo sehemu kubwa ni muundo wa kimyaa wa Carbon na Hydrogen na Oxygen. Na kutokana na kuni hizi hufanyika makaa haya ya miti tuyatumiayo. Ukiyachoma makaa hutoka nguvu zilizo kuwamo ndani yake kwa ajili ya kupikia, na kwa kazi nyingi nyenginezo. Na makaa ya mawe si chochote ila ni hiyo hiyo mimea na miti iliyo kuwa na kufanyika kama ilivyo elezwa, na kisha ikazikika kwa njia fulani na kugeuka baada ya kupita mamilioni ya miaka kuwa makaa ya mawe, kwa kuathirika na hali za geology kama joto au mdidimizo au menginewe. Na yapasa kuzingatia kuwa kutajwa katika Aya hii \"mti wa kijani\" si bure, bali ni ishara ya hiyo Chlorophyll ya kijani ambayo ni lazima kwa ajili ya kuimeza Carbon dioxide katika mimea.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"alladhī jaʿala lakum mina al-shajari al-akhḍari nāran fa-idhā antum min'hu tūqidūna ","translations":["The One Who","made","for you","from","the tree","[the] green ","fire","and behold","You","from it","ignite","(80)"],"transliterationArr":["alladhī","jaʿala","lakum","mina","al-shajari","al-akhḍari","nāran","fa-idhā","antum","min'hu","tūqidūna",null],"verseTiming":[[1,0,1100],[2,1100,1760],[3,1760,2310],[4,2310,3110],[5,3110,3990],[6,3990,4990],[7,4990,6400],[8,6400,8660],[9,8660,10200],[10,10200,11560],[11,11560,14665]]}}