{"name":"37:5","price":"Mola Mlezi wa mbingu na ardhi, na yaliyomo kati yao, na ni Mola Mlezi wa mashariki zote.","arabic":"رَّبُّ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَمَا بَيۡنَهُمَا وَرَبُّ ٱلۡمَشَٰرِقِ","category":["37 (As-Saffat)","As-Saffat","Surah As-Saffat","Chapter As-Saffat","Saffat","Surah Saffat","Chapter Saffat","As Saffat","Surah As Saffat","Chapter As Saffat","Surah 37","Chapter 37","Those Who Set The Ranks","الصَّافَات"],"ayahNumber":3793,"juzNumber":23,"footnotes":"Yeye - peke yake - ndiye Muumba mbingu na ardhi na viliomo baina yao, na ndiye Mwenye kupanga mambo, na ndiye Mwenye kutawala mashariki za kila chenye mashariki. Mwenyezi Mungu ndiye Muumba mbingu saba na viliomo baina yao, navyo ni hivyo vyombo vya mbinguni na nyota zake. Naye ndiye Mwenye kusimamisha, Mwenye kulinda vile vile juu ya mwahali zinapo chomozea jua na nyota zote. Na Yeye ndiye anaye vionyesha hivyo kila siku katika pahala huko upeo wa macho, kila siku pahala mbali na vilipo dhihiri siku iliyo tangulia. Na hayo ni kwa mwendo wa mpango wa jua maalumu kwa inavyo zunguka dunia juu ya msumari-kati wake kutoka magharibi kwendea mashariki kila siku na wakati huo huo inavyo lizunguka jua katika njia yake katika falaki. Na jua na nyota huonekana na wakaazi wa ardhi kila siku kama zinachomoza mwahala mbali mbali. Na kila ardhi ikigeuza mahala pake katika safari yake katika mbingu linaonekana jua linachomoza pahala pengine. Ukiliangalia jua kwa utulivu kuanzia mwishoni wa mwezi wa Machi, yaani linapo kuwa jua lipo kati ya mstari wa Ikweta mwanzo wa musimu wa Rabii, yaani Spring, kwa nusu ya kaskazini ya dunia, utaliona linachomoza pahala katika mashariki juu ya upeo wa macho. Kwa mwenye kupeleleza kila siku ikipita ataona kuchomoza kwake kunajongelea kaskazini. Na mwishoni mwa mwezi wa Juni utaona linachomozea mwisho wa kukaribia kaskazini. Kisha baada ya hapo utaliona jua linarejea linafuata kugeuka kule kule mpaka mwisho wa Septemba (wakati wa kuwa sawa wakati wa Khariif yaani Autumn) utaliona jua linachomoza pale pale lilipo chomoza mwanzo wa Machi. Kisha litaendelea kuelekea kusini kuchomoza kwake mpaka mwisho wa Desemba linakuwa linachomoza karibu kabisa na kusini. Baada ya hapo huanza tena kurejea kuelekea kaskazini mpaka limalize safari yake ya kufika kati sawa katika Rabii ya pili. Na safari hii yote inachukua siku 365 na robo siku. Na inaonekana kuwa nyota nazo zinachomoza mwahala mbali mbali katika upeo wa macho inapo kuwa dunia imo katika safari yake ya mbinguni, na khasa nyota za buruji (au vituo) 12 vinavyo pitiwa na jua katika mwendo wake wa mwaka.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"rabbu al-samāwāti wal-arḍi wamā baynahumā warabbu al-mashāriqi ","translations":["Lord","(of) the heavens","and the earth","and what","(is) between both of them","and Lord","(of) each point of sunrise","(5)"],"transliterationArr":["rabbu","al-samāwāti","wal-arḍi","wamā","baynahumā","warabbu","al-mashāriqi",null],"verseTiming":[[1,0,720],[2,720,2390],[3,2390,3480],[4,3480,3950],[5,3950,5410],[6,5410,6300],[7,6300,8125]]}}