{"name":"39:7","price":"Mkikufuru basi Mwenyezi Mungu si mwenye haja nanyi, lakini hafurahii kufuru kwa waja wake. Na mkishukuru Yeye hufurahika nanyi. Wala mbebaji habebi mzigo wa mwingine. Kisha marejeo yenu ni kwa Mola wenu Mlezi. Hapo atakwambieni mliyo kuwa mkiyafanya. Hakika Yeye ni Mwenye kuyajua vyema yaliyomo vifuani.","arabic":"إِن تَكۡفُرُواْ فَإِنَّ ٱللَّهَ غَنِيٌّ عَنكُمۡۖ وَلَا يَرۡضَىٰ لِعِبَادِهِ ٱلۡكُفۡرَۖ وَإِن تَشۡكُرُواْ يَرۡضَهُ لَكُمۡۗ وَلَا تَزِرُ وَازِرَةٞ وِزۡرَ أُخۡرَىٰۚ ثُمَّ إِلَىٰ رَبِّكُم مَّرۡجِعُكُمۡ فَيُنَبِّئُكُم بِمَا كُنتُمۡ تَعۡمَلُونَۚ إِنَّهُۥ عَلِيمُۢ بِذَاتِ ٱلصُّدُورِ","category":["39 (Az-Zumar)","Az-Zumar","Surah Az-Zumar","Chapter Az-Zumar","Zumar","Surah Zumar","Chapter Zumar","Az Zumar","Surah Az Zumar","Chapter Az Zumar","Surah 39","Chapter 39","The Troops","الزُّمَر"],"ayahNumber":4065,"juzNumber":23,"footnotes":"Enyi watu! Mkizikataa neema za Mwenyezi Mungu, basi Yeye hakika si mhitaji wa imani yenu na shukrani zenu. Lakini Yeye hapendi waja wake wakufuru, kwa sababu hayo yanawadhuru wenyewe. Na mkimshukuru kwa ajili ya neema zake, Yeye huwa radhi nanyi kwa shukra hiyo. Wala mtu mwenye madhambi hayabebi madhambi ya mwenginewe. Kisha marejeo yenu ni kwa Mola wenu Mlezi, na hapo atakwambieni mliyo kuwa mkiyatenda duniani. Hakika Yeye anayajua mnayo yaficha katika nyoyo zenu ziliomo vifuani. Haya yaliomo katika Qur'ani Tukufu yanaweka wazi msingi wa kutoa adhabu, kama ilivyo vile vile katika Surat Yusuf katika kauli yake Mtukufu: \"Akasema: Mwenyezi Mungu apishe mbali sisi kumshika yeyote ila tuliye yakuta mali yetu kwake; hivyo basi tutakuwa madhaalimu.\" Na haya katika Qur'ani ni kusimamisha msingi ulio kwisha tajwa, nao ni msingi ambao haukuthibiti katika kanuni (sharia) za kutungwa na binaadamu ila katika zama za karibuni. (Haya ni kinyume cha ilivyo katika imani aliyo itumbukiza Paulo katika Ukristo, kwamba wanaadamu wamerithi dhambi ya Adam, wanayo ita \"Dhambi ya asili\", na kwamba Nabii Isa, Yesu, kafa msalabani kwa kubeba dhambi za wanaadamu. Biblia yenyewe inapinga haya. Tazama: Jeremiah 31:29-30; Ezekieli 18 Kwa nadhariya ya Paulo Mungu amedhulumu mara mbili: 1. Kutubandika wanaadamu wote dhambi za Adam, 2. Kumbebesha \"mwanawe\" Yesu dhambi za walimwengu wote!)","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"in takfurū fa-inna al-laha ghaniyyun ʿankum walā yarḍā liʿibādihi al-kuf'ra wa-in tashkurū yarḍahu lakum walā taziru wāziratun wiz'ra ukh'rā thumma ilā rabbikum marjiʿukum fayunabbi-ukum bimā kuntum taʿmalūna innahu ʿalīmun bidhāti al-ṣudūri ","translations":["If","you disbelieve","then indeed","Allah","(is) free from need","of you","And not","He likes","in His slaves","ungratefulness","And if","you are grateful","He likes it","in you","And not","will bear","bearer of burdens","(the) burden","(of) another","Then","to","your Lord","(is) your return","then He will inform you","about what","you used to","do","Indeed, He","(is) the All-Knower","of what (is) in the breasts","of what (is) in the breasts","(7)"],"transliterationArr":["in","takfurū","fa-inna","al-laha","ghaniyyun","ʿankum","walā","yarḍā","liʿibādihi","al-kuf'ra","wa-in","tashkurū","yarḍahu","lakum","walā","taziru","wāziratun","wiz'ra","ukh'rā","thumma","ilā","rabbikum","marjiʿukum","fayunabbi-ukum","bimā","kuntum","taʿmalūna","innahu","ʿalīmun","bidhāti","al-ṣudūri",null],"verseTiming":[[1,0,820],[2,820,2560],[3,2560,3920],[4,3920,4900],[5,4900,5700],[6,5700,8440],[7,8440,9110],[8,9110,9980],[9,9980,11300],[10,11300,11980],[11,11980,14040],[12,14040,15130],[13,15130,15980],[14,15980,17080],[15,17080,17670],[16,17670,18440],[17,18440,20430],[18,20430,21000],[19,21000,22500],[20,22500,23780],[21,23780,24400],[22,24400,25390],[23,25390,27270],[24,27270,29770],[25,29770,30290],[26,30290,32040],[27,32040,35210],[28,35210,37040],[29,37040,39030],[30,39030,39930],[31,39930,43445]]}}