{"name":"3:123","price":"Na Mwenyezi Mungu alikwisha kunusuruni katika Badri nanyi mlikuwa wanyonge. Basi mcheni Mwenyezi Mungu ili mpate kushukuru.","arabic":"وَلَقَدۡ نَصَرَكُمُ ٱللَّهُ بِبَدۡرٖ وَأَنتُمۡ أَذِلَّةٞۖ فَٱتَّقُواْ ٱللَّهَ لَعَلَّكُمۡ تَشۡكُرُونَ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":416,"juzNumber":4,"footnotes":"Mwenyezi Mungu amewakumbusha Waumini ile neema ya nusura aliyo wapa katika vita vya Badri waliposubiri. Akawahakikishia kuwa Yeye ndiye aliye wapa ushindi katika vita vile na ingawa walikuwa wachache na wapungufu wa silaha; akawataka wamt'ii kuwa ni shukrani kwa neema hiyo. Badri ipo mwendo wa kiasi ya maili 120 kusini magharibi ya Madina. Mpambano hapo baina ya Waislamu na Makureshi ulikuwa siku ya Jumaane 17 Ramadhani mwaka wa pili wa Hijra (13 Machi 624 B.K.). Mtume s.a.w. na Masahaba wake walitoka Madina taarikh 8-9 ya Ramadhani mwaka wa pili wa Hijra (5 Machi 624 B.K.) Idadi ya wapiganaji wa Kiislamu katika vita hivi ilikuwa kiasi watu mia tatu au zaidi kidogo, na Washirikina walizidi mara tatu kuliko hao. Mwenyezi Mungu alitimiza ahadi yake katika vita hivi, Waumini wakashinda juu ya kuwa ni wachache, kwa kuwa Imani yao juu ya haki na uadilifu ilikuwa kubwa. Na kuungwa mkono na Mwenyezi Mungu pamoja na kuwa na moyo wenyewe kulikuwa ni sababu za ushindi kuliko wingi wa watu na ubora wa silaha. Ushindi huu ulio dhaahiri ukawa ndio sababu ya kuenea Neno la Imani na kutukuka likawa juu. Na hichi ni chanzo cha yaliyo kuja baadae, na kivuli cha Uislamu kikatanda Arabuni kote, na kisha kwengineko ulimwenguni.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"walaqad naṣarakumu al-lahu bibadrin wa-antum adhillatun fa-ittaqū al-laha laʿallakum tashkurūna ","translations":["And certainly","helped you","Allah","in Badr","while you (were)","weak","So fear","Allah","so that you may","(be) grateful","(123)"],"transliterationArr":["walaqad","naṣarakumu","al-lahu","bibadrin","wa-antum","adhillatun","fa-ittaqū","al-laha","laʿallakum","tashkurūna",null],"verseTiming":[[1,0,950],[2,950,2060],[3,2060,2950],[4,2950,4680],[5,4680,6650],[6,6650,8150],[7,8150,9010],[8,9010,9880],[9,9880,11310],[10,11310,14335]]}}