{"name":"3:190","price":"Hakika katika kuumbwa mbingu na ardhi na kukhitalifiana usiku na mchana ziko Ishara kwa wenye akili.","arabic":"إِنَّ فِي خَلۡقِ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَٱخۡتِلَٰفِ ٱلَّيۡلِ وَٱلنَّهَارِ لَأٓيَٰتٖ لِّأُوْلِي ٱلۡأَلۡبَٰبِ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":483,"juzNumber":4,"footnotes":"Hakika katika kuumbwa mbingu na ardhi na viliomo ndani yao kwa vile vilivyo umbwa tangu mwanzo na mipango yake, na kukhitalifiana usiku na mchana kwa mwangaza na giza, kwa urefu wake na ufupi, zipo dalili na ishara zilizo wazi kwa watu wenye akili na kutambua za kuthibitisha Umoja wa Mwenyezi Mungu na Uwezo wake. \"Hakika katika kuumbwa mbingu na ardhi, na kukhitalifiana usiku na mchana ziko ishara kwa wenye akili\" - Aya hii ina ukweli unao onyeshea taadhima ya Muumba. Mbingu ni moja katika Ishara za Mwenyezi Mungu inayo tubainikia kwetu kwa miale ya jua inayo piga juu ya anga linalo izunguka dunia. Miale hii inapo angukia chembe chembe na vumbi vumbi jembamba liliopo angani humulika mianga hiyo na kutawanyika kila upande. Huu mwanga mweupe kwa hakika ni mkusanyiko wa rangi zote zionekanazo. Hizi chembe chembe za angani huzimeza baadhi ya hizo rangi. Imedhihiri kuwa rangi yenye kuenea zaidi ni rangi ya kibuluu. Na hii inazidi kuzagaa linapo kuwa jua liko utosini, na ubuluu wake unapungua kidogo kidogo mpaka jua linapo kuwa upeo wa macho wakati wa magharibi au alfajiri. Wakati huo ile miale ya jua inakwenda masafa makubwa zaidi kabisa. Kwa hivyo zile chembe chembe za angani huzimeza rangi zote isipo kuwa rangi nyekundu. Usafi wa maneno ni: mwangaza wa mchana unahitaji miale ya jua na kuwepo vumbi la kutosha katika anga. Dalili ya hayo ni yale yaliyo tokea mwaka 1944 mbingu ilipo ingia kiza ghafla kati ya mchana. Jinsi ya kiza mchana ukawa kama usiku. Kwa wakati mfupi yakawa hayo, kisha mbingu ikawa nyekundu, kisha kidogo kidogo ikawa rangi ya machungwa, na kisha ya manjano mpaka mbingu ikarejea rangi yake ya tabia, baada ya saa au zaidi. Baadae ilibainika kuwa mambo hayo yalitokana na mripuko mbinguni likatokea jivu, likachukuliwa na upepo mbali mpaka Afrika ya kati na kaskazini, na kufika magharibi ya Asia. Huko ndiko ikaonekana hali hiyo katika pande za Syria. Maelezo yake ni kuwa vumbi lilioko hewani liliifunika nuru ya jua. Lilipo pungua jivu ulidhihiri mwangaza mwekundu na baadae wa manjano n.k. Mwanaadamu akipaa angani katika chombo atapitia matabaka yanayo khitalifiana sifa. Ataiona mbingu inazidi ubuluu mpaka akifika kwenye anga la nje lisio kuwa na hayo mavumbi n.k. ataona mbingu yote ni kiza kitupu kama kwamba ni usiku juu ya kuwa jua lipo juu. Kwa ufupi ni kuwa zipo mbingu nyingi si moja ziliyo pandana tabaka kwa tabaka kama maqubba, zinazo khitalifiana katika sifa zake na rangi zake. Haya ni katika Ishara za Mwenyezi Mungu Mtukufu Aliye takasika kuwa vyote viliomo mbinguni na ardhini vinamtukuza Yeye. Ama kukhitalifiana usiku na mchana, tumekwisha fahamu kuwa mwanga wa mchana unategemea miale ya jua kuanguka juu ya hili funiko la anga, lenye chembe chembe za vumbi kwa kiasi maalumu. Mwangaza huu ni mkali hata unaficha mwangaza unao toka kwenye nyota n.k. Ama wakati wa usiku mwangaza wa jua unapo fichika, inakuwa hapana katika anga isipo kuwa vumbi linalo tuzunguka na mianga dhaifu ya nyota. Kupishana usiku na mchana ni kwa sababu ya kuzunguka dunia kwa nafsi yake wenyewe, na tafauti ya misimu na kurefuka na kufupika usiku na mchana ni kwa mzunguko wa hii dunia kulizunguka jua. Na katika hikima yake Mwenyezi Mungu na uwezo wake ni kuwa kubadilika usiku na mchana, na kubadilika misimu ya joto na baridi, ni kutengeneza hali ya hewa iwe wastani, yaani kati na kati, kwa kusilihi maisha ya vilivyo hai.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"inna fī khalqi al-samāwāti wal-arḍi wa-ikh'tilāfi al-layli wal-nahāri laāyātin li-ulī al-albābi ","translations":["Indeed","in","(the) creation","(of) the heavens","and the earth","and (in the) alternation","(of) the night","and the day","(are) surely Signs","for men","(of) understanding","(190)"],"transliterationArr":["inna","fī","khalqi","al-samāwāti","wal-arḍi","wa-ikh'tilāfi","al-layli","wal-nahāri","laāyātin","li-ulī","al-albābi",null],"verseTiming":[[1,0,1220],[2,1220,1600],[3,1600,2210],[4,2210,3720],[5,3720,4660],[6,4660,5870],[7,5870,6640],[8,6640,8360],[9,8360,9650],[10,9650,10460],[11,10460,13045]]}}