{"name":"3:200","price":"Enyi mlio amini! Subirini, na shindaneni kusubiri, na kuweni macho, na mcheni Mwenyezi Mungu, ili mpate kufanikiwa.","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱصۡبِرُواْ وَصَابِرُواْ وَرَابِطُواْ وَٱتَّقُواْ ٱللَّهَ لَعَلَّكُمۡ تُفۡلِحُونَ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":493,"juzNumber":4,"footnotes":"Enyi mlio amini! Shikamaneni na subira, na mwashinde maadui zenu katika kusubiri. Na kaeni macho kuilinda mipaka, na mkhofini Mola Mlezi wenu. Katika haya yote ndio mtaraji kufanikiwa. (Jee! Baada ya kuijua Qur'ani yamfalia Muislamu kusema kuwa dini ni kitu mbali na siyasa? Vipi uamrishe mema, ukataze maovu, uhukumu, ukatibiane mikataba na dola nyengine, ukusanye zaka na kuzigawa, upigane Jihadi, ulinde mipaka n.k., n.k. na uiepuke siyasa? Amesema Prof. Khurshid Ahmad: \"Uislamu si dini kwa maana ya ovyo ovyo kama lilivyo potoshwa neno hilo, yaani kuwa umemkhusu mtu maisha yake ya binafsi tu. Ni mwendo kaamili wa maisha, unao angalia kila midani ya uhai wa binaadamu. Uislamu ni uwongozi katika kila nyendo za maisha - za binafsi na za jamii, za kimwili na kiroho, za uchumi na siyasa, za sharia na mila, za taifa na za mataifa.\"--Uislamu, Maana na Ujumbe wake uk. 37)","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"yāayyuhā alladhīna āmanū iṣ'birū waṣābirū warābiṭū wa-ittaqū al-laha laʿallakum tuf'liḥūna ","translations":["O you","who","believe[d]","Be steadfast","and [be] patient","and [be] constant","and fear","Allah","so that you may","(be) successful","(200)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","iṣ'birū","waṣābirū","warābiṭū","wa-ittaqū","al-laha","laʿallakum","tuf'liḥūna",null],"verseTiming":[[1,0,2733],[2,2733,3880],[3,3880,4772],[4,4772,5674],[5,5674,6705],[6,6705,8145],[7,8145,9715],[8,9715,11105],[9,11105,12655],[10,12655,13485],[11,13485,14475],[12,14475,15885],[13,15885,21120]]}}