{"name":"41:9","price":"Sema: Hivyo nyinyi mnamkataa aliye umba ardhi katika siku mbili, na mnamfanyia washirika? Huyu ndiye Mola Mlezi wa walimwengu wote.","arabic":"۞ قُلۡ أَئِنَّكُمۡ لَتَكۡفُرُونَ بِٱلَّذِي خَلَقَ ٱلۡأَرۡضَ فِي يَوۡمَيۡنِ وَتَجۡعَلُونَ لَهُۥٓ أَندَادٗاۚ ذَٰلِكَ رَبُّ ٱلۡعَٰلَمِينَ","category":["41 (Fussilat)","Fussilat","Surah Fussilat","Chapter Fussilat","Surah 41","Chapter 41","Explained in Detail","فُصِّلَت"],"ayahNumber":4227,"juzNumber":24,"footnotes":"Ewe Mtume! Waambie hawa washirikina: Ama nyinyi mnastaajabisha! Mnamkataa Mwenyezi Mungu aliye iumba ardhi kwa siku mbili, na huku juu ya hayo, mnamfanyia washirika wa kushirikiana naye huyo Muumba ardhi, Mmiliki wa walimwengu wote na Mlezi wao? Zimetajwa Siku moja au Siku nyingi katika Sura nyengine. Katika Surat Al-Hajj, Aya 47 Mwenyezi Mungu Mtukufu amesema: \"Na kwa hakika siku moja kwa Mola wako Mlezi ni kama miaka elfu mnavyo hisabu nyinyi.\" Na katika Surat Assajdah, Aya 5 amesema Mtukufu: \"Anapitisha mambo yote yaliyo baina ya mbingu na ardhi, kisha yanapanda kwake kwa siku moja tu ambayo kipimo chake ni miaka elfu mnayo hisabu.\" Na katika Surat Al-Ma'arij Mtukufu amesema: \"Malaika na Roho hupanda kwake katika siku iliyo kadiri yake ni miaka elfu khamsini.\" Maoni ya kitaalamu: Vipimo vya wakati wanavyo vitumia watu vimefungamana na dunia na inavyo zunguka juu ya msumari-kati wake na kulizunguka jua. Mtu akitoka kwenye ardhi (dunia) akenda kwenye sayari nyengine za mbinguni vipimo hivyo vya nyakati vinabadilika kwa kuzidi au kwa kupungua. Na hizi Aya tukufu zinaonyesha ishara ya ukweli huu wa ki-ilimu, na ya kwamba zama au nyakati ni jambo la mlinganisho tu. Na bila ya shaka ipo miaka ya ki-ilimu ya Falaki ya kulinganisha yenye kumkinika kuifarikisha baina yao. Mwaka wa ki-jua wa duniani huhisabiwa kwa kupimwa wakati ambao dunia inachukua kulizunguka jua kwa ukamilifu mnamo siku 365, na ilhali sayari zilio karibu na jua kama U't'aarid (Mercury) humaliza safari yake ya kulizunguka jua mnamo siku 88, na upande mwengine sayari ya Blutu (Pluto) ambayo ndiyo sayari iliyo mbali mno na jua, na ndiyo inazunguka taratibu mno inachukua kuzunguka kwake mnamo miaka 250 kwa mujibu wa miaka yetu sisi.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"qul a-innakum latakfurūna bi-alladhī khalaqa al-arḍa fī yawmayni watajʿalūna lahu andādan dhālika rabbu al-ʿālamīna ","translations":["Say","Do you indeed","[surely] disbelieve","in the One Who","created","the earth","in","two periods","and you set up","with Him","rivals","That","(is the) Lord","(of) the worlds","(9)"],"transliterationArr":["qul","a-innakum","latakfurūna","bi-alladhī","khalaqa","al-arḍa","fī","yawmayni","watajʿalūna","lahu","andādan","dhālika","rabbu","al-ʿālamīna",null],"verseTiming":[[1,0,350],[2,350,2030],[3,2030,3460],[4,3460,4330],[5,4330,4930],[6,4930,5730],[7,5730,6140],[8,6140,7020],[9,7020,8370],[10,8370,10160],[11,10160,12479],[12,12479,13769],[13,13769,14369],[14,14369,17924]]}}