{"name":"43:4","price":"Na hakika hiyo imo katika Asili ya Maandiko yalioko kwetu, ni tukufu na yenye hikima.","arabic":"وَإِنَّهُۥ فِيٓ أُمِّ ٱلۡكِتَٰبِ لَدَيۡنَا لَعَلِيٌّ حَكِيمٌ","category":["43 (Az-Zukhruf)","Az-Zukhruf","Surah Az-Zukhruf","Chapter Az-Zukhruf","Zukhruf","Surah Zukhruf","Chapter Zukhruf","Az Zukhruf","Surah Az Zukhruf","Chapter Az Zukhruf","Surah 43","Chapter 43","The Gold Adornments","الزُّخْرُف"],"ayahNumber":4329,"juzNumber":25,"footnotes":"Na hakika hii Qur'ani iliyo thibiti katika Lauhun Mahfuudh, Ubao ulio hifadhiwa, ulioko kwetu, bila ya shaka, ina cheo cha juu, na imepangwa kwa mpango wa hikima, katika mwisho wa ufasihi. (Vitabu vyote vya mbinguni asili yake anayo Mwenyezi Mungu, katika Ujuzi wake wa tokea azali, Al- I'lmu al-azaliy au Ubao Ulio Hifadhiwa Al-lauhu al-mahfuudh au Asili ya Maandiko Ummu-l-kitabi. Kwa sababu ya kuwa Vitabu vilivyo kuja zamani, ikiwa Taurati, Zaburi, Injili n.k. vilikuwa ni vya muda fulani, na kwa mataifa fulani, basi haikuwepo dharura vibaki kwa usafi kila neno lake. Ni makusudio yake tu yabakie, yaliyo kuwa ya msingi. Ama ulipo fika wakati wa kudumisha Ujumbe wa Mwenyezi Mungu kwa zama zote, na kwa watu wote, ndio ikaja Qur'ani ambayo imehifadhiwa kila neno lake. Na ndio siri ya kuletwa kwa lugha ya Kiarabu na ikalindwa kwa lugha ile, ijapo kuwa itatarajumiwa katika lugha nyengine. Mzozano wowote unao tokea unarejezwa kwenye asli ile ya Kiarabu ambayo haikubadilika hata chembe, wala haitabadilika mpaka Siku ya Kiyama. Huo peke yake ni muujiza. Ama vitabu vya Biblia ni kama maji yaliyo tibuliwa na ng'ombe mpaka kwenye chemchem yake. Chemchem ya Qur'ani haikutibuliwa. Ijapo kuwa wanyama na watu wanaweza kunywa maji yake huku chini, kwenye kitovu cha chemchem hakuguswi. Huko ni kwenye Qur'ani hiyo ya Kiarabu, safi kama ilivyo kwenye Ubao Ulio Hifadhiwa.)","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"wa-innahu fī ummi al-kitābi ladaynā laʿaliyyun ḥakīmun ","translations":["And indeed, it","(is) in","(the) Mother","(of) the Book","with Us","surely exalted","full of wisdom","(4)"],"transliterationArr":["wa-innahu","fī","ummi","al-kitābi","ladaynā","laʿaliyyun","ḥakīmun",null],"verseTiming":[[1,0,1640],[2,1640,3670],[3,3670,4700],[4,4700,5760],[5,5760,6980],[6,6980,8130],[7,8130,10695]]}}