{"name":"51:48","price":"Na ardhi tumeitandaza; basi watandazaji wazuri namna gani Sisi!","arabic":"وَٱلۡأَرۡضَ فَرَشۡنَٰهَا فَنِعۡمَ ٱلۡمَٰهِدُونَ","category":["51 (Adh-Dhariyat)","Adh-Dhariyat","Surah Adh-Dhariyat","Chapter Adh-Dhariyat","Dhariyat","Surah Dhariyat","Chapter Dhariyat","Adh Dhariyat","Surah Adh Dhariyat","Chapter Adh Dhariyat","Surah 51","Chapter 51","The Winnowing Winds","الذَّاريَات"],"ayahNumber":4723,"juzNumber":27,"footnotes":"Na ardhi tumeikunjua, na Sisi ni wenye kuitengeneza vizuri kama kitanda. Aya hii tukufu inaashiria maana za kitaalamu nyingi; miongoni mwazo ni kwamba Mwenyezi Mungu Subhanahu wa Taa'la ameumba ulimwengu huu mkunjufu kwa nguvu. Na Yeye ni Muweza kwa atakayo. Na maana ya mbingu katika Aya hii ni kila kilicho juu ya kitu na kikakifunika. Basi kila kilicho zunguka sayari na nyota na mkusanyiko wa jua katika sehemu hii inayo onekana ya ulimwengu kimetanda kupita inavyo kadirika na akili, wala haiwezi kupimika. Kwani masafa yao hukisiwa kwa mamilioni ya miaka ya mwangaza. Na mwaka mmoja wa mwangaza kwa ilivyo thibiti kwa ilimu za kisasa katika karne hii ya ishirini ni masafa yanayo kwenda mwangaza kwa mbio za kilomita 300,000 kwa nukta moja ya dakika. Na ibara ya Aya tukufu (Na hakika Sisi ndio twenye kuutanua) inaashiria hayo, yaani kutanda huko kwa ulimwengu kunako staajabisha tangu kuumbwa kwake. Kama vile vile kuwa kukunjuka huko kungali kunaendelea, na hayo sayansi ya sasa imethibitisha vile vile. Na imejuulikana kwa nadhariya ya kutanda ambayo katika mwanzo mwanzo wa karne hii imethibiti kuwa ni kweli kiilimu, na ufupi wake ni kuwa ulimwengu unaendelea kukua na kupanuka, na kila sayari za mbinguni zinajitenga wenyewe kwa wenyewe.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"wal-arḍa farashnāhā faniʿ'ma al-māhidūna ","translations":["And the earth","We have spread it","how excellent","(are) the Spreaders","(48)"],"transliterationArr":["wal-arḍa","farashnāhā","faniʿ'ma","al-māhidūna",null],"verseTiming":[[1,0,1170],[2,1170,2730],[3,2730,3570],[4,3570,7025]]}}