{"name":"53:49","price":"Na kwamba hakika Yeye ndiye Mola Mlezi wa nyota ya Shii'ra.","arabic":"وَأَنَّهُۥ هُوَ رَبُّ ٱلشِّعۡرَىٰ","category":["53 (An-Najm)","An-Najm","Surah An-Najm","Chapter An-Najm","Najm","Surah Najm","Chapter Najm","An Najm","Surah An Najm","Chapter An Najm","Surah 53","Chapter 53","The Star","النجم"],"ayahNumber":4833,"juzNumber":27,"footnotes":"Na hakika Yeye ndiye Mola Mlezi wa hii nyota kubwa inayo itwa Shii'ra (Sirius, Dog Star). Makusudio hapa ni Nyota hiyo inayo itwa Ash-shi'ra Alyamaaniya, au wanavyo ita Wazungu Sirius au Dog Star. Nyota hii inang'ara kwa nguvu zaidi kuliko nyota zote ziliomo katika kikundi cha nyota kinacho itwa Alkalbu l-akbar, kwa Kizungu Canis Major au Greater Dog. Nyota hiyo ndiyo inayo zagaa sana mbinguni, na huonekana kusini ya mstari wa kati wa mbinguni kiasi ya daraja 18. Na kwa jina hilo la Nyota ya Mbwa ikijuulikana hata miaka elfu tatu ilio pita. Katika mabaki ya michoro ya Mafirauni wa Misri imeashiriwa pia. Mwenyezi Mungu ameitaja khasa kwa kuwa Waarabu walikuwa wakiiabudu hapo kale, na pia Wamisri wa zamani, kwani kutokea kwake upande wa mashariki katikati ya mwezi wa Julai kabla ya kuchomoza jua kulikuwa kunawafikiana na wakati wa mafuriko ya Misri ya kati, yaani katika tukio muhimu kabisa katika ulimwengu huo wa kale. Na tukio hili huenda ndilo lilio fanya kuanzisha kuwekea kiwango urefu wa mwaka katika dunia nzima. Kwani kudhihiri Nyota ya Shiira kabla ya kuchomoza jua hakutokei ila mara moja tu katika mwaka. Basi huu ndio mwanzo wa mwaka mpya.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"wa-annahu huwa rabbu al-shiʿ'rā ","translations":["And that He","[He]","(is the) Lord","(of) Sirius","(49)"],"transliterationArr":["wa-annahu","huwa","rabbu","al-shiʿ'rā",null],"verseTiming":[[1,0,1770],[2,1770,2140],[3,2140,2850],[4,2850,4415]]}}