{"name":"56:6","price":"Iwe mavumbi yanayo peperushwa!","arabic":"فَكَانَتۡ هَبَآءٗ مُّنۢبَثّٗا","category":["56 (Al-Waqi'ah)","Al-Waqi'ah","Surah Al-Waqi'ah","Chapter Al-Waqi'ah","Waqi'ah","Surah Waqi'ah","Chapter Waqi'ah","Al Waqi'ah","Surah Al Waqi'ah","Chapter Al Waqi'ah","Surah 56","Chapter 56","The Inevitable","الواقعة"],"ayahNumber":4985,"juzNumber":27,"footnotes":"Ikawa vumbi la kupeperushwa, Aya hizi tukufu zinaeleza hadi gani vitakuwa vitisho vitavyo uteremkia ulimwengu kitapo fika Kiyama. Na katika vitisho hivyo ni hayo masaibu ya dunia yatakayo athiri ardhi na mat'abaka yake. Kwani hii ardhi tunayo ishi juu ya mgongo wake si yenye kutulia na kukaa sawa kwa utimilivu. Kwani hiyo imeundwa kwa mat'abaka ya majabali yaliyo ingiliana ovyo. Huenda baadhi yao yakateremka yakaachana na mengineyo yaliyo jirani nayo. Na huwa hiyo inayo itwa kupasuka kwa mat'abaka ya ardhi, Geological cleavage kama inavyo tokea katika maeneo kadhaa wa kadhaa. Mpasuko huu ulikuwa na ungali kuwa ndio asili ya chini kabisa ya zilzala, mitetemeko, mikubwa kwa kuathirika na nguvu za kudidimiza na kuvuta zinazo fuatana na mat'abaka ya ardhi yanapo vunjika. Basi mizani ya utulivu ya nguvu hizi inapo geuka kwa kuathirika na mambo mengineyo ya nje huenda zikafunguka nguvu za mtikiso mkubwa ndio ikatokea mitetemeko na mitikisiko ya ardhi, ambayo hubomoa kila kitu kiliopo juu ya ardhi karibu na ilipo anzia hiyo zilzala. Na hapo tena hutokea uharibifu mkubwa mno. Na hayo maelezo ya kisayansi hayageuzi kitu, wala hayako mbali na nadhari ya kidini. Kwani hakika Mwenyezi Mungu Mtukufu huenda akajaalia sababu za maumbile za kawaida zikajumuika kwa njia tusiyo izoea sisi ili zikiingiliana kwa njia ya kutisha ndio sababu ya kuharibika dunia. Hapo maelezo ya kisayansi yanafuatana na Aya zenye kuonya kwa vitisho hivyo vikuu. Na yote hayo yanatokana kwa Mwenyezi Mungu. Na hutokea kwa idhini yake Mwenyezi Mungu kutimiza hukumu yake katika dunia yetu.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"fakānat habāan munbathan ","translations":["So they become","dust particles","dispersing","(6)"],"transliterationArr":["fakānat","habāan","munbathan",null],"verseTiming":[[1,0,1140],[2,1140,3470],[3,3470,6825]]}}