{"name":"56:76","price":"Na hakika bila ya shaka hichi ni kiapo kikubwa, laiti mngeli jua!","arabic":"وَإِنَّهُۥ لَقَسَمٞ لَّوۡ تَعۡلَمُونَ عَظِيمٌ","category":["56 (Al-Waqi'ah)","Al-Waqi'ah","Surah Al-Waqi'ah","Chapter Al-Waqi'ah","Waqi'ah","Surah Waqi'ah","Chapter Waqi'ah","Al Waqi'ah","Surah Al Waqi'ah","Chapter Al Waqi'ah","Surah 56","Chapter 56","The Inevitable","الواقعة"],"ayahNumber":5055,"juzNumber":27,"footnotes":"Na hakika bila ya shaka hicho ni kiapo kikubwa chenye maana ya kufikia mbali, lau kuwa mnafikiri makusudio yake. Aya mbili hizi zinabainisha hadi ya umuhimu wa kiapo hichi kikubwa. Kwani nyota ni vitu vyenye kutoa mwangaza wenyewe, na nyota ya karibu mno kwetu sisi, nayo ni jua, ni kiasi ya masafa ya miaka 500 ya mwangaza. Na nyota ifuatayo kwa ukaribu iko mbali nasi kwa kiasi cha miaka 4 ya mwangaza takriban. Basi nguvu tunazo zitumia kutokana na jua ndizo zinazo tuwezesha kuishi. Lau kuwa umbali wa jua kutokana na ardhi ni duni ya hivyo au zaidi ya hivyo basi hapana shaka kuwa maisha yangeli kuwa taabu, bali ni muhali. Kadhaalika ukubwa wa nyota unakhitalifiana. Zipo nyota kubwa mno hata ukubwa wake unaweza kukusanya hii ardhi na jua juu ya umbali wao. Vipo vikundi vya nyota vinavyo itwa A'naqiid vinaogelea angani zikivuka Njia ya Maziwa The Milky Way mara kwa mara. Wakati wa kupita kwake zikasadifiana kukutana na kikundi cha jua na zikagongana basi hakika hapo itakuwa ndio maangamizo na kumalizika kwa kweli. Hata ikikaribia nyota moja katika nyota zitokazo kwenye jua basi hayo pia yataleta kuharibika mizani na kupelekea maangamizo na kumalizika ulimwengu. Kwa hivyo basi hakika Ishara za mazingatio na uweza wa Mwenyezi Mungu zinaonekana katika ulimwengu huu alio uumba Mwenyezi Mungu Subhanahu wa Taala na akaupanga.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"wa-innahu laqasamun law taʿlamūna ʿaẓīmun ","translations":["And indeed, it","(is) surely an oath","if","you know ","great","(76)"],"transliterationArr":["wa-innahu","laqasamun","law","taʿlamūna","ʿaẓīmun",null],"verseTiming":[[1,0,1950],[2,1950,2890],[3,2890,3590],[4,3590,4910],[5,4910,8615]]}}