{"name":"58:1","price":"MWENYEZI MUNGU amekwisha sikia usemi wa mwanamke anaye jadiliana nawe juu ya mumewe, na anamshitakia Mwenyezi Mungu. Na Mwenyezi Mungu anayasikia majibizano yenu. Hakika Mwenyezi Mungu ni Mwenye kusikia, Mwenye kuona.","arabic":"قَدۡ سَمِعَ ٱللَّهُ قَوۡلَ ٱلَّتِي تُجَٰدِلُكَ فِي زَوۡجِهَا وَتَشۡتَكِيٓ إِلَى ٱللَّهِ وَٱللَّهُ يَسۡمَعُ تَحَاوُرَكُمَآۚ إِنَّ ٱللَّهَ سَمِيعُۢ بَصِيرٌ","category":["58 (Al-Mujadila)","Al-Mujadila","Surah Al-Mujadila","Chapter Al-Mujadila","Mujadila","Surah Mujadila","Chapter Mujadila","Al Mujadila","Surah Al Mujadila","Chapter Al Mujadila","Surah 58","Chapter 58","The Pleading Woman","المجادلة"],"ayahNumber":5105,"juzNumber":28,"footnotes":"Mwenyezi Mungu amekwisha sikia kauli ya huyo mwanamke anaye kurejea wewe kwa shauri ya mumewe aliye jitenga naye kwa kudai ati anamwona kama mgongo wa mama yake, na akamlalamikia Mwenyezi Mungu. Na Mwenyezi Mungu anayasikia hayo maneno mnayo jibizana. Hakika Mwenyezi Mungu anayasikia vyema yote ya kusikiwa, anayaona vyema yote ya kuonekana. Imepokelewa kuwa Sahaba mmoja, aitwaye Aus bin Ass'amit, aliudhika na mkewe aitwaye, Khola bint Tha'labah, akamwambia: \"Wewe kwangu mimi kama mgongo wa mama yangu.\" Na katika siku za Ujahiliya ilikuwa ndio mwanamke kesha harimika kwa mumewe. Mwanamke akenda kumpa khabari Nabii s.a.w., na Mtume akamwambia: \"Sijaamrishwa kitu katika kesi yako. Na sioni ila ni kuwa kweli umekwisha harimika kwake.\" Mwanamke akajadiliana na Mtume s.a.w. na akamrejea tena, na akawa anamshitakia Mwenyezi Mungu Mtukufu kwa kukhofu kufarikiana na mume na kupotea mwanawe. Haukupita muda ila ikateremka Aya hii na tatu zilizo baada yake.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"qad samiʿa al-lahu qawla allatī tujādiluka fī zawjihā watashtakī ilā al-lahi wal-lahu yasmaʿu taḥāwurakumā inna al-laha samīʿun baṣīrun ","translations":["Indeed","Allah has heard","Allah has heard","(the) speech","(of one) who","disputes with you","concerning","her husband","and she directs her complaint","to","Allah","And Allah","hears","(the) dialogue of both of you","Indeed","Allah","(is) All-Hearer","All-Seer","(1)"],"transliterationArr":["qad","samiʿa","al-lahu","qawla","allatī","tujādiluka","fī","zawjihā","watashtakī","ilā","al-lahi","wal-lahu","yasmaʿu","taḥāwurakumā","inna","al-laha","samīʿun","baṣīrun",null],"verseTiming":[[1,0,370],[2,370,900],[3,900,1770],[4,1770,2310],[5,2310,3020],[6,3020,4120],[7,4120,4470],[8,4470,5450],[9,5450,7680],[10,7680,8000],[11,8000,8700],[12,8700,9690],[13,9690,10450],[14,10450,12120],[15,12120,13850],[16,13850,14610],[17,14610,16120],[18,16120,18735]]}}