{"name":"5:103","price":"Mwenyezi Mungu hakujaalia uharamu wowote juu ya \"Bahira\" wala \"Saiba\" wala \"Wasila\" wala \"Hami\". Lakini walio kufuru humzulia uwongo Mwenyezi Mungu, na wengi wao hawatumii akili.","arabic":"مَا جَعَلَ ٱللَّهُ مِنۢ بَحِيرَةٖ وَلَا سَآئِبَةٖ وَلَا وَصِيلَةٖ وَلَا حَامٖ وَلَٰكِنَّ ٱلَّذِينَ كَفَرُواْ يَفۡتَرُونَ عَلَى ٱللَّهِ ٱلۡكَذِبَۖ وَأَكۡثَرُهُمۡ لَا يَعۡقِلُونَ","category":["5 (Al-Ma'idah)","Al-Ma'idah","Surah Al-Ma'idah","Chapter Al-Ma'idah","Ma'idah","Surah Ma'idah","Chapter Ma'idah","Al Ma'idah","Surah Al Ma'idah","Chapter Al Ma'idah","Surah 5","Chapter 5","The Table Spread","المَائدة"],"ayahNumber":772,"juzNumber":7,"footnotes":"Mwenyezi Mungu hakukupeni ruhusa kuharimisha kitu alicho kuhalalishieni, na kwa hivyo mkenda mkawapasua ngamia masikio yao, na mkajizuia kuwatumia mkawaita \"Bahira\" mkawawacha kwa kuwekea nadhiri, na mkawaita \"Saiba\"; na mkaharimisha kula kondoo dume, na mkawatoa kuwa tunza kwa masanamu; na hata kondoo akizaa dume na jike mkamwita \"Wasila\", na mkakataa kumchinja dume lake. Wala Mwenyezi Mungu hakukufanyieni sharia ya kukuharimishieni msimtumie ngamia dume baada wakisha zalikana kutokana naye matumbo kumi, naye mkamwita \"Hami\"! Mwenyezi Mungu hakukutungieni sharia yoyote ya namna hiyo. Lakini walio kufuru wanazua uwongo na wanamsingizia Mwenyezi Mungu. Na wengi wao hawatumii akili. Wakati wa Jahiliya, kabla ya Uislamu, Waarabu wakijiharimshia wenyewe asiyo yaharimisha Mwenyezi Mungu. Katika hizo ni kuwa:- 1. Ngamia akizaa mara tano na mtoto wa mwisho akawa dume, basi wakimpasua sikio lake na wakaharimisha kumpanda, na akawa haijuzu kumfukuza kwenye kunywa maji au kula machunga. Na wakimwita: \"Bahira\", yaani aliyepasuliwa sikio. 2. Ilikuwa mtu husema: Nikirejea safarini, au nikipona maradhi yangu, basi ngamia wangu ni \"Saiba\", yaani aliye achwa, na anakuwa kama \"Bahira\". 3. Na walikuwa kondoo akizaa jike humfanya huyo mtoto ni wao, na akizaa dume humfanya ni wa miungu yao; na akizaa dume na jike basi hawamtoi mhanga huyo dume tena kwa miungu yao, na humwita huyo kondoo jike: \"Wa'sila\", yaani amemuwasilia nduguye dume. 4. Na pia walikuwa akitokana na fahali mizao kumi basi husema mgongo wake umehamika,yaani umehifadhika, na wakamwita \"Hami\". Huwa basi hapandwi, wala hatwikiwi mizigo.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"mā jaʿala al-lahu min baḥīratin walā sāibatin walā waṣīlatin walā ḥāmin walākinna alladhīna kafarū yaftarūna ʿalā al-lahi al-kadhiba wa-aktharuhum lā yaʿqilūna ","translations":["Not","has (been) made","(by) Allah","of","a Bahirah","and not","a Saibah","and not","a Wasilah","and not","a Hami","[And] but","those who","disbelieved","they invent","against","Allah","the lie","and most of them","(do) not","use reason","(103)"],"transliterationArr":["mā","jaʿala","al-lahu","min","baḥīratin","walā","sāibatin","walā","waṣīlatin","walā","ḥāmin","walākinna","alladhīna","kafarū","yaftarūna","ʿalā","al-lahi","al-kadhiba","wa-aktharuhum","lā","yaʿqilūna",null],"verseTiming":[[1,0,620],[2,620,1190],[3,1190,2130],[4,2130,3110],[5,3110,5030],[6,5030,5570],[7,5570,8700],[8,8700,9260],[9,9260,10970],[10,10970,11480],[11,11480,12700],[12,12700,14260],[13,14260,15350],[14,15350,16240],[15,16240,17440],[16,17440,17860],[17,17860,18800],[18,18800,19680],[19,19680,21090],[20,21090,21510],[21,21510,24545]]}}