{"name":"5:91","price":"Hakika Shet'ani anataka kutia kati yenu uadui na chuki kwa ulevi na kamari, na akuzuieni kumkumbuka Mwenyezi Mungu na kusali. Basi je, mmeacha?","arabic":"إِنَّمَا يُرِيدُ ٱلشَّيۡطَٰنُ أَن يُوقِعَ بَيۡنَكُمُ ٱلۡعَدَٰوَةَ وَٱلۡبَغۡضَآءَ فِي ٱلۡخَمۡرِ وَٱلۡمَيۡسِرِ وَيَصُدَّكُمۡ عَن ذِكۡرِ ٱللَّهِ وَعَنِ ٱلصَّلَوٰةِۖ فَهَلۡ أَنتُم مُّنتَهُونَ","category":["5 (Al-Ma'idah)","Al-Ma'idah","Surah Al-Ma'idah","Chapter Al-Ma'idah","Ma'idah","Surah Ma'idah","Chapter Ma'idah","Al Ma'idah","Surah Al Ma'idah","Chapter Al Ma'idah","Surah 5","Chapter 5","The Table Spread","المَائدة"],"ayahNumber":760,"juzNumber":7,"footnotes":"Bila ya shaka Shetani hana atakalo kwa kukushawishini kunywa ulevi na kucheza kamari ila kuleta khitilafu na ugomvi na kuchukiana baina yenu ili mdhoofike kwa kuondoka masikizano, na uvunjike umoja wenu, kwa sababu anavyo kukupendeleeni mnywe ulevi na mcheze kamari. Na hayo ili mpate kuacha kumuabudu Mwenyezi Mungu, na muache Swala, ili Akhera yenu iwe ovu kama ilivyo dunia yenu. Basi jee! Baada ya nyinyi kujua maovu haya hamyatupilii mbali ninayo kukutazeni, mkamkosesha Iblisi makusudio yake? Mwenyezi Mungu Mtukufu Aliye takasika ametaja mambo mane yaliyo pelekea kuharimishwa ulevi na kamari: La Kwanza - Kuwa nafsi yake ni uchafu na uovu, kwani hayumkiniki kusifika kuwa ni mambo mazuri, kwa kuwa madhara yake yanaonekana wazi. Katika ulevi kuna uharibifu wa akili, na katika kamari ni kupoteza mali, na kwa yote mawili hayo upo uharibifu wa moyo. Na Shetani ndiye mwenye kuyapamba hayo. La pili - Hayo hueneza uadui na chuki. Kamari humalizikia ugomvi, na kama haifikii hayo basi huleta chuki na bughdha. Na ulevi ndio Mama wa Maasi. Utamwona mtu mwenye adabu zake mpole, akisha kunywa hugeuka nyama mwitu, akatenda mambo ya ukhalifu, kwani ulevi huidhoofisha sauti ya utu inayo mkataza mwanaadamu kutenda maovu. Utamwona mtu anajizuia kufanya kitendo kiovu, lakini akisha kunywa ulevi, au akavuta bangi, japo kidogo, huiendea shari bila ya kujali. Basi si kama ulevi unaharibu akili tu, bali unalaza dhamiri ya mtu. Anakuwa hana junaha. La tatu: Ni kuwa kamari na ulevi huuwa moyo. Mtu huwa hamkumbuki Mwenyezi Mungu, na kumkumbuka Mwenyezi Mungu ndiko kunako huisha nyoyo. Lane: Maasi hayo yanamzuilia mtu na Swala. Kamari na ulevi humsahaulisha Muumini na Swala zake, na akiwa anasali hatimizi nguzo zake kama zitakikanavyo. Basi inakuwa Swala zake ni kuinama na kuinuka bila ya kufuatana na moyo. Kwa hivyo basi imethibiti kuwa kuharimishwa mvinyo, pombe, tembo, bangi n.k. si kwa sababu ya kulevya kwake tu, bali ni kwa kumziba mtu fahamu zake, kumgubika asitambue atendalo. Na kwa hivyo ndio imepokewa kuwa kinacho levya kwa wingi wake, basi hata kidogo chake ni haramu, kwani hicho kidogo nacho kinapumbaza akili. Na juu ya haya pana madhara ya mwili kama madaktari walivyo thibitisha. Kwa hivyo ulevi hata kidogo ni haramu. Mwenyezi Mungu Subhanahu ametaja sababu mbili za kuharimisha ulevi, na udaktari umezidisha kuwa ulevi kidogo haupotezi akili, lakini huzidisha uchangamfu au husabibisha hali ya huzuni na kuona dhiki ya moyo. Na katika hali zote mbili anakuwa mtu amepungukiwa na ukamilifu wa akili yake kubeba jukumu, na kwa hivyo hutenda vitendo ambavyo kwa dhahiri ni sawa kumbe ni madhara. Ama kuuzoea ulevi hudhuru maini, matumbo, na mishipa ya akili na hisiya, na hurithisha madhara mpaka kwa vizazi.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"innamā yurīdu al-shayṭānu an yūqiʿa baynakumu al-ʿadāwata wal-baghḍāa fī al-khamri wal-maysiri wayaṣuddakum ʿan dhik'ri al-lahi waʿani al-ṣalati fahal antum muntahūna ","translations":["Only","intends","the Shaitaan","to","cause","between you","[the] enmity","and [the] hatred","through","intoxicants","and gambling","and hinders you","from","(the) remembrance","(of) Allah","and from","the prayer","So will","you","(be) the ones who abstain","(91)"],"transliterationArr":["innamā","yurīdu","al-shayṭānu","an","yūqiʿa","baynakumu","al-ʿadāwata","wal-baghḍāa","fī","al-khamri","wal-maysiri","wayaṣuddakum","ʿan","dhik'ri","al-lahi","waʿani","al-ṣalati","fahal","antum","muntahūna",null],"verseTiming":[[1,0,1960],[2,1960,2750],[3,2750,4050],[4,4050,4400],[5,4400,6070],[6,6070,7100],[7,7100,8430],[8,8430,11280],[9,11280,11480],[10,11480,12330],[11,12330,13640],[12,13640,15520],[13,15520,16930],[14,16930,17970],[15,17970,18620],[16,18620,19440],[17,19440,20030],[18,20030,21180],[19,21180,21780],[20,21780,23719],[21,23719,27524]]}}