{"name":"67:5","price":"Na kwa hakika tumeipamba mbingu ya karibu kwa mataa, na tumeyafanya ili kuwapigia mashetani, na tumewaandalia adhabu ya Moto uwakao kwa nguvu.","arabic":"وَلَقَدۡ زَيَّنَّا ٱلسَّمَآءَ ٱلدُّنۡيَا بِمَصَٰبِيحَ وَجَعَلۡنَٰهَا رُجُومٗا لِّلشَّيَٰطِينِۖ وَأَعۡتَدۡنَا لَهُمۡ عَذَابَ ٱلسَّعِيرِ","category":["67 (Al-Mulk)","Al-Mulk","Surah Al-Mulk","Chapter Al-Mulk","Mulk","Surah Mulk","Chapter Mulk","Al Mulk","Surah Al Mulk","Chapter Al Mulk","Surah 67","Chapter 67","The Sovereignty","الملك"],"ayahNumber":5246,"juzNumber":29,"footnotes":"Na hakika Sisi tumeipamba mbingu hii ya karibu, unayo iona kwa macho, tumeipamba kwa nyota zinazo ng'aa. Na tumefanya katika hizo vimondo vya kuwapopolea mashetani; na Akhera tumewaandalia adhabu ya moto unao waka. Mbingu ni kila kilicho juu yetu kikatufunika. Amesema Ibn Sayyidih: Hiyo ni bahari ya anga na vyombo vyote viliomo ndani yake na vimondo. Na sura wanayo iona wakaazi wa duniani katika masiku yaliyo safi ni kama qubba la kibuluu lilio pambwa kwa nyota na sayari kama kwamba ni taa, kama unavyo ziona nyota za mkia, au vimondo, vinakwenda angani vikiungua huko juu ya ardhi. Na hilo qubba la kibuluu si chochote ila ni matokeo ya mwangaza wa jua na nyota pamoja na takataka za vumbi zinazo ning'inia katika hewa, na sehemu za hewa molecules zinazo tawanyika. Haya mbali na yanayo onekana katika mwangaza nafsi yake ambayo huipamba mbingu hii ya karibu, kama vile zile rangi nzuri nzuri za wakati wa kuchwa jua, au wakati wa kuchomoza jua alfajiri, na mianga ya njia za nyota, miangaza ya kaskazini, na miangaza ya katika sehema za Polar regions. Na hayo yote yanayo onekana ni matokeo ya kuingiliana mwanga pamoja na funiko la anga la ardhi na uwanja wake wa smaku, magnetic field.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"walaqad zayyannā al-samāa al-dun'yā bimaṣābīḥa wajaʿalnāhā rujūman lilshayāṭīni wa-aʿtadnā lahum ʿadhāba al-saʿīri ","translations":["And certainly","We have beautified","the heaven","nearest","with lamps","and We have made them","(as) missiles","for the devils","and We have prepared","for them","punishment","(of) the Blaze","(5)"],"transliterationArr":["walaqad","zayyannā","al-samāa","al-dun'yā","bimaṣābīḥa","wajaʿalnāhā","rujūman","lilshayāṭīni","wa-aʿtadnā","lahum","ʿadhāba","al-saʿīri",null],"verseTiming":[[1,0,860],[2,860,2450],[3,2450,5010],[4,5010,6180],[5,6180,7730],[6,7730,9330],[7,9330,10200],[8,10200,13900],[9,13900,15310],[10,15310,15820],[11,15820,16560],[12,16560,19775]]}}