{"name":"6:1","price":"Sifa njema zote ni za Mwenyezi Mungu aliye umba mbingu na ardhi, na akafanya giza na mwangaza. Tena baada ya haya walio kufuru wanawafanya wengine sawa na Mola wao Mlezi.","arabic":"ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ وَجَعَلَ ٱلظُّلُمَٰتِ وَٱلنُّورَۖ ثُمَّ ٱلَّذِينَ كَفَرُواْ بِرَبِّهِمۡ يَعۡدِلُونَ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":790,"juzNumber":7,"footnotes":"Kuhimidiwa, yaani kusifiwa na kutajwa kwa wema, ni kwa Mwenyezi Mungu aliye ziumba mbingu na ardhi, na akaumba, kwa kudra yake, giza na mwangaza, kwa manufaa ya waja wake, na kuambatana na hikima yake. Tena pamoja na neema zote hizi nzuri hawa makafiri wanakwenda mshirikisha Mwenyezi Mungu, na wakawafanya wengineo ni washirika wa Mwenyezi Mungu katika ibada!! Aya hii tukufu ni ishara ya ubora wa kuumba, na ubora wa kuumba unaonyesha Umoja na Upweke wa Mwenye kuumba na utukufu wake. Kwani mbingu na nyota zake, na sayari zake, na jua, na mwezi - vyote hivyo ni ushahidi wa Umoja wake. Na ardhi na viliomo ndani yake, navyo ni wanyama, mimea na visio na uhai, na milima na mabonde, na rutuba na ukame, na viliomo chini ya ardhi maadeni magumu na yanayo tiririka, na bahari na viliomo ndani yake kama lulu na vilio hai - vyote hivyo vinaonyesha Umoja wa Mwenye kuumba. Na giza la kila namna, kama giza la jabali, na bahari, na mapango, na ukungu ulio funga moja kwa moja hata mtu akiutoa mkono wake anakaribia kuwa asiouone - pia vyote hivyo vinaonyesha ujuzi usio kuwa na mfano, wa kuanzisha kuumba, wa Mwenyezi Mungu Aliye viumba. Hali kadhaalika nuru, na sababu zake mbali mbali, kama nuru ya jua, na mwangaza wa mwezi, na mwangaza wa nyota ... vyote hivyo vinaonyesha uanzishaji wa Mwenyezi Mungu wa kuumba bila ya kiigizo.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"al-ḥamdu lillahi alladhī khalaqa al-samāwāti wal-arḍa wajaʿala al-ẓulumāti wal-nūra thumma alladhīna kafarū birabbihim yaʿdilūna ","translations":["(All) the praises and thanks","(be) to Allah","the One Who","created","the heavens","and the earth","and made","the darkness[es]","and the light","Then","those who","disbelieved","in their Lord","equate others with Him","(1)"],"transliterationArr":["al-ḥamdu","lillahi","alladhī","khalaqa","al-samāwāti","wal-arḍa","wajaʿala","al-ẓulumāti","wal-nūra","thumma","alladhīna","kafarū","birabbihim","yaʿdilūna",null],"verseTiming":[[1,0,1050],[2,1050,2070],[3,2070,2820],[4,2820,3490],[5,3490,4990],[6,4990,6130],[7,6130,6970],[8,6970,8320],[9,8320,12110],[10,12110,13360],[11,13360,14430],[12,14430,15280],[13,15280,16550],[14,16550,19775]]}}