{"name":"6:59","price":"Na ziko kwake funguo za ghaibu; hakuna azijuaye ila Yeye tu. Na Yeye anajua kilioko nchi kavu na baharini. Na halidondoki jani ila analijua. Wala punje katika giza la ardhi, wala kinyevu, wala kikavu ila kimo katika Kitabu kinacho bainisha.","arabic":"۞ وَعِندَهُۥ مَفَاتِحُ ٱلۡغَيۡبِ لَا يَعۡلَمُهَآ إِلَّا هُوَۚ وَيَعۡلَمُ مَا فِي ٱلۡبَرِّ وَٱلۡبَحۡرِۚ وَمَا تَسۡقُطُ مِن وَرَقَةٍ إِلَّا يَعۡلَمُهَا وَلَا حَبَّةٖ فِي ظُلُمَٰتِ ٱلۡأَرۡضِ وَلَا رَطۡبٖ وَلَا يَابِسٍ إِلَّا فِي كِتَٰبٖ مُّبِينٖ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":848,"juzNumber":7,"footnotes":"Ni Mwenyezi Mungu ndiye Mwenye ujuzi wa milango yote ya vilio ghaibu, visio juulikana na wengine. Hapana Mwenye kukusanya ujuzi wa hivyo ila Yeye, na anao wataka kuwapa baadhi yake. Naye ujuzi wake umekusanya vitu vyote vilioko nchi kavu na vilioko baharini. Wala halidondoki jani, jani lolote lile, ila Yeye analijua, wala haianguki mbegu chini ya ardhi, wala chochote kilicho kinyevu au kikavu, ila Yeye Subhanahu anakijua kwa utimilifu. Kauli hii inafahamisha kuwa kujua mambo ya ghaibu kuko kwa Mwenyezi Mungu, na funguo za hayo ziko kwake tu. Na mambo ya ghaibu ni mafungu mawili: Ghaibu Mut'laq ambayo hayumkini kutambulikana na akili, kama mambo yatakayo mfikia mtu katika mustakbali. Na Ghaib Nisbiy hizi ni siri za ulimwengu na viliomo ndani yake, na kuweza kuvitumia kwa maslaha ya watu. Ujuzi wa hayo huweza kughibu kwa vizazi kadhaa, kisha ukadhihiri.. Na funguo ya hizi pia ziko kwa Mwenyezi Mungu, humwezesha amtakaye katika waja wake wale wanao zama kuusoma ulimwengu. Na katika hayo ni haya ya uvumbuzi ambao tunauona anao ufikilia mwanaadamu kwa kuwezeshwa na Mwenyezi Mungu Mtukufu.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"waʿindahu mafātiḥu al-ghaybi lā yaʿlamuhā illā huwa wayaʿlamu mā fī al-bari wal-baḥri wamā tasquṭu min waraqatin illā yaʿlamuhā walā ḥabbatin fī ẓulumāti al-arḍi walā raṭbin walā yābisin illā fī kitābin mubīnin ","translations":["And with Him","(are the) keys","(of) the unseen","no (one)","knows them","except","Him","And He knows","what","(is) in","the land","and in the sea","And not","falls","of","any leaf","but","He knows it","And not","a grain","in","the darkness[es]","(of) the earth","and not","moist","and not","dry","but","(is) in","a Record","Clear","(59)"],"transliterationArr":["waʿindahu","mafātiḥu","al-ghaybi","lā","yaʿlamuhā","illā","huwa","wayaʿlamu","mā","fī","al-bari","wal-baḥri","wamā","tasquṭu","min","waraqatin","illā","yaʿlamuhā","walā","ḥabbatin","fī","ẓulumāti","al-arḍi","walā","raṭbin","walā","yābisin","illā","fī","kitābin","mubīnin",null],"verseTiming":[[1,0,2830],[2,2830,4040],[3,4040,5040],[4,5040,5560],[5,5560,8410],[6,8410,9340],[7,9340,9930],[8,9930,11780],[9,11780,12200],[10,12200,12480],[11,12480,13350],[12,13350,14300],[13,14300,15780],[14,15780,16750],[15,16750,17760],[16,17760,18890],[17,18890,19790],[18,19790,21220],[19,21220,21880],[20,21880,23210],[21,23210,24220],[22,24220,25400],[23,25400,27020],[24,27020,27630],[25,27630,29250],[26,29250,30090],[27,30090,31280],[28,31280,32170],[29,32170,32820],[30,32820,34540],[31,34540,35100],[32,35100,36300],[33,36300,37120],[34,37120,37580],[35,37580,38600],[36,38600,42695]]}}