{"name":"6:9","price":"Na kama tungeli mfanya Malaika bila ya shaka tungeli mfanya kama binaadamu, na tungeli watilia matatizo yale wanayo yatatiza wao.","arabic":"وَلَوۡ جَعَلۡنَٰهُ مَلَكٗا لَّجَعَلۡنَٰهُ رَجُلٗا وَلَلَبَسۡنَا عَلَيۡهِم مَّا يَلۡبِسُونَ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":798,"juzNumber":7,"footnotes":"Na lau kuwa tunge jaalia huyo wa kumuunga mkono Mtume ni Malaika kama watakavyo hao, basi tungeli mfanya katika sura ya mwanaadamu, ili wapate kumwona na kufahamiana naye. Kwani wao hawawezi kumwona Malaika katika sura yake ya asili. Tena mambo yangeli watatiza na kuwadanganyikia kwa kupelekwa kwa sura ya mwanaadamu, na tungeli watia katika makosa yale yale yalio wazonga. Kauli hii inaashiria maana ambayo wenye ilimu za kisasa wanaitaja. Wenye ilimu za mambo ya kiroho wanasema kuwa roho zina mwili khafifu, mwembamba na mwepesi, mfano wa ng'amba. Nazo hazidhihiri wala hazionekani. Na hayumkiniki kuonekana roho ila zikivaa huo mwili. Na Malaika hawana kiwiliwili. Katika viumbe vyote vya kiroho Malaika ndio khafifu kabisa kushinda vyote. Na hayumkini kuonekana ila kwa sura ya mwili. Na huu mwili ndio unakuwa kama mwanaadamu.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"walaw jaʿalnāhu malakan lajaʿalnāhu rajulan walalabasnā ʿalayhim mā yalbisūna ","translations":["And if","We had made him","an Angel","certainly We (would) have made him","a man","and certainly We (would) have obscured","to them","what","they are obscuring","(9)"],"transliterationArr":["walaw","jaʿalnāhu","malakan","lajaʿalnāhu","rajulan","walalabasnā","ʿalayhim","mā","yalbisūna",null],"verseTiming":[[1,0,3148],[2,3148,4434],[3,4434,5266],[4,5266,6762],[5,6762,7897],[6,7897,9524],[7,9524,10804],[8,10804,12113],[9,12113,15380]]}}