{"name":"70:41","price":"Kuwabadili kwa walio bora kuliko wao; na Sisi hatushindwi.","arabic":"عَلَىٰٓ أَن نُّبَدِّلَ خَيۡرٗا مِّنۡهُمۡ وَمَا نَحۡنُ بِمَسۡبُوقِينَ","category":["70 (Al-Ma'arij)","Al-Ma'arij","Surah Al-Ma'arij","Chapter Al-Ma'arij","Ma'arij","Surah Ma'arij","Chapter Ma'arij","Al Ma'arij","Surah Al Ma'arij","Chapter Al Ma'arij","Surah 70","Chapter 70","The Ascending Stairways","المعارج"],"ayahNumber":5416,"juzNumber":29,"footnotes":"Na kuwaleta walio wat'iifu zaidi kwa Mwenyezi Mungu kuliko wao. Wala Sisi hatushindwi kubadilisha huko. Huenda ikawa inakusudiwa kwa \"mashariki zote\" na \"magharibi zote\" ni maeneo ya mamlaka ya Mwenyezi Mungu yote ambayo hayana mpaka kama ilivyo ashiriwa katika Aya 137 ya Surat Al-A'araf: \"Na tukawarithisha watu walio kuwa wanadharauliwa mashariki za nchi na magharibi zake ambayo tuliitia baraka\", kuonyesha sehemu zote za hiyo nchi inayo tajwa. Na huenda ikawa makusudio yake ni mashariki za jua na mwezi na nyota zote na sayari, na magharibi zao, kwa ajili ya kuonyesha vile vile ufalme wa Mwenyezi Mungu wote. Na kwa hivyo inadhihirika kwetu kuwa vyombo vinavyo kwenda katika qubba la mbingu vinachomoza kwenye upeo wa mashariki na kuchwa kwenye upeo wa magharibi, au kwa uchache vinazunguka kutoka mashariki kwendea magharibi kuizunguka nyota ya Pole, katika sehemu ya kaskazini ya dunia. Kwani umbali wa Pole kwa nyota ni mdogo kuliko pahala unapo angalia, basi nyota hapo haichomozi wala haichwi, bali hupiga duru ndogo kuizunguka North Pole. Na kwa hiyo Aya inaashiria saa za usiku. Rejea kwenye kauli ya Mwenyezi Mungu Mtukufu: \" Na alama na kwa nyota wao wanaongoka.\" Na kwa udhaahiri wa kuchomoza na kuchwa ipo ishara ya kuzunguka kwa dunia, na hiyo ni neema kubwa kabisa katika neema za Mwenyezi Mungu juu ya maisha katika sayari hii. Kwani bila ya kuzunguka kwa dunia juu ya msumari-kati wake nusu ya dunia ingeli pigwa na jua mfululizo muda wa nusu mwaka kaamili, na ingeli nyimwa mwangaza kabisa nusu nyengine. Kwa hivyo uhai kama tulivyo uzoea usinge kuwako. Na tukifanya hizo mashariki na hizo magharibi ni za jua peke yake, wachilia mbali nyota nyengine na sayari, basi itakuwa ishara ni kule kuchomoza jua kila siku pahala pengine na kuchwa pahala pengine kila siku, au hata katika kila dakika linapo pita juu ya dunia. Kwani jua kila dakika linakuchwa pahala na linachomoza pahala papili mfululizo. Na haya ni katika mipango ya Mwenyezi Mungu na miujiza ya uweza wake. Tazama pia maoni ya wataalamu juu ya Aya ya 5 katika Surat Assaffat, na Aya 17 ya Surat Arrah'man.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"ʿalā an nubaddila khayran min'hum wamā naḥnu bimasbūqīna ","translations":["[On]","to","[We] replace","(with) better","than them","and not","We","(are) to be outrun","(41)"],"transliterationArr":["ʿalā","an","nubaddila","khayran","min'hum","wamā","naḥnu","bimasbūqīna",null],"verseTiming":[[1,0,1960],[2,1960,2310],[3,2310,3890],[4,3890,4530],[5,4530,6210],[6,6210,6760],[7,6760,7370],[8,7370,10855]]}}