{"name":"7:172","price":"Na pale Mola wako Mlezi alipo waleta katika wanaadamu kutoka migongoni mwao kizazi chao, na akawashuhudisha juu ya nafsi zao, akawaambia: Je, Mimi si Mola Mlezi wenu? Wakasema: Kwani! Tumeshuhudia. Msije mkasema Siku ya Kiyama sisi tulikuwa tumeghafilika na hayo.","arabic":"وَإِذۡ أَخَذَ رَبُّكَ مِنۢ بَنِيٓ ءَادَمَ مِن ظُهُورِهِمۡ ذُرِّيَّتَهُمۡ وَأَشۡهَدَهُمۡ عَلَىٰٓ أَنفُسِهِمۡ أَلَسۡتُ بِرَبِّكُمۡۖ قَالُواْ بَلَىٰ شَهِدۡنَآۚ أَن تَقُولُواْ يَوۡمَ ٱلۡقِيَٰمَةِ إِنَّا كُنَّا عَنۡ هَٰذَا غَٰفِلِينَ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":1126,"juzNumber":9,"footnotes":"Hapa Mwenyezi Mungu amebainisha hidaya ya wanaadamu kwa kusimamisha dalili katika viumbe, baada ya kwisha bainisha kwa njia za Mitume na Vitabu. Alisema: Ewe Nabii! Waambie watu pale Mola wako Mlezi alipo watoa kutoka migongo ya wanaadamu na watoto wao na wanao zaliwa karne baada ya karne, kisha akwasimamishia dalili za Ungu wake, na akawapa akili na nadhari ya kuwawezesha kuzijua, na kwa hizo akili na nadhari waweze kutambua Tawhidi na Rubuubiya, yaani kuwa Mwenyezi Mungu ni Mmoja Pekee na ni Mola Mlezi wa viumbe vyote, hata wakawa hao wanaadamu kama walio ulizwa: Je, Mimi siye Mola wenu Mlezi? Nao wakajibu: Kwani, Wewe ndiye Mola Mlezi wetu. Tunajishuhudia hayo juu ya nafsi zetu...Haya ni kwa kuwa kumkini kwao kupata kujua hizo hoja na dalili, na kutamakani kwao katika hayo imekuwa kama kwamba ni kukiri na kuungama. Na Sisi tumefanya haya ili msije kusema Siku ya Kiyama: Hakika sisi tulikuwa tumeghafilika na hiyo Tawhidi, na tulikuwa hatuijui. Katika Aya hii inaonyesha kuwa watoto asili yake wanatoka kwenye uti wa mgongo. Na ilimu ya kisasa imethibitisha kuwa kokwa za khaswa zinakuwa katika sehemu ya mgongo chini ya mafigo. Na zinakaa hapa mpaka katika miezi ya mwisho ya mimba ndio huteremka pale pahali pake pa kawaida panapo onekana. Na pengine hata hivyo huchelewa kuteremka hata baada ya mtoto kuzaliwa. Kadhaalika mayai ya mwanamke yanafanyika chini ya figo khasa, kisha ndio huteremka pahala pake karibu na tumbo la uzazi.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"wa-idh akhadha rabbuka min banī ādama min ẓuhūrihim dhurriyyatahum wa-ashhadahum ʿalā anfusihim alastu birabbikum qālū balā shahid'nā an taqūlū yawma al-qiyāmati innā kunnā ʿan hādhā ghāfilīna ","translations":["And when","(was) taken","(by) your Lord","from","(the) Children","(of) Adam ","from","their loins ","their descendants","and made them testify","over","themselves","Am I not","your Lord","They said","Yes","we have testified","Lest","you say","(on the) Day","(of) the Resurrection","Indeed","we were","about","this","unaware","(172)"],"transliterationArr":["wa-idh","akhadha","rabbuka","min","banī","ādama","min","ẓuhūrihim","dhurriyyatahum","wa-ashhadahum","ʿalā","anfusihim","alastu","birabbikum","qālū","balā","shahid'nā","an","taqūlū","yawma","al-qiyāmati","innā","kunnā","ʿan","hādhā","ghāfilīna",null],"verseTiming":[[1,0,590],[2,590,1250],[3,1250,2080],[4,2080,3110],[5,3110,4900],[6,4900,5750],[7,5750,6820],[8,6820,8170],[9,8170,9970],[10,9970,11850],[11,11850,13210],[12,13210,14760],[13,14760,16760],[14,16760,17610],[15,17610,18910],[16,18910,19690],[17,19690,20430],[18,20430,23480],[19,23480,24340],[20,24340,25440],[21,25440,26050],[22,26050,27470],[23,27470,28680],[24,28680,30330],[25,30330,30660],[26,30660,31530],[27,31530,34735]]}}