{"name":"7:54","price":"Hakika Mola Mlezi wenu ni Mwenyezi Mungu aliye ziumba mbingu na ardhi katika siku sita. Kisha akatawala juu ya Kiti cha Enzi. Huufunika usiku kwa mchana, ufuatao upesi upesi. Na jua, na mwezi, na nyota zinazo tumika kwa amri yake. Fahamuni! Kuumba na amri ni zake. Ametukuka kabisa Mwenyezi Mungu, Mola Mlezi wa viumbe vyote.","arabic":"إِنَّ رَبَّكُمُ ٱللَّهُ ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ فِي سِتَّةِ أَيَّامٖ ثُمَّ ٱسۡتَوَىٰ عَلَى ٱلۡعَرۡشِۖ يُغۡشِي ٱلَّيۡلَ ٱلنَّهَارَ يَطۡلُبُهُۥ حَثِيثٗا وَٱلشَّمۡسَ وَٱلۡقَمَرَ وَٱلنُّجُومَ مُسَخَّرَٰتِۭ بِأَمۡرِهِۦٓۗ أَلَا لَهُ ٱلۡخَلۡقُ وَٱلۡأَمۡرُۗ تَبَارَكَ ٱللَّهُ رَبُّ ٱلۡعَٰلَمِينَ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":1008,"juzNumber":8,"footnotes":"Hakika Mola Mlezi wenu ambaye Mitume wake wanakuiteni mwende kwenye Haki, na kuiamini Siku ya Mwisho na Malipo, ndiye Muumba ulimwengu, naye ndiye aliye uanza. Kaumba mbingu na ardhi kwa viwango sita, vinavyo shabihiana na siku sita, katika siku za dunia. Kisha akatawala juu ya Ufalme ulio kamilika. Naye ndiye anaye ufanya usiku uufunike mchana kwa kiza chake, na usiku unafuatia mchana kwa upesi na mpango na kufuatana kusikosita, kama anavyo taka Yeye. Naye Mwenyezi Mungu Subhana ameliumba jua, na mwezi, na nyota. Na vyote hivyo vinamnyenyekea Mwenyezi Mungu Mtukufu, vinakwenda kwa amri yake. Na Yeye peke yake ndiye Mwenye kuumba na Mwenye amri ya kuitikiwa. Baraka za Mwenye kuanzisha ulimwengu na viliomo ndani yake zimetukuka. Aya hii tukufu imekusanya maana tatu: Ya kwanza ni kuwa mbingu na ardhi ameziumba Mwenyezi Mungu Mtukufu mnamo siku sita. Na hizi siku sio muradi wake hizi tuzionazo sasa, na tunazo zihisabu. Bali muradi wake ni kubadilika hali, baina ya giza totoro, na giza-giza la alfajiri, na mpambazuko wa asubuhi, na mchana, na adhuhuri, na jioni. Na haya yamekusanya hali sita zinazo badilika. Na giza-giza la magharibi linakitangulia kiza cha usiku. Na hizo hali sita au vipindi sita, ambavyo vimeitwa \"siku\" ndivyo wanavyo vitaja wanachuoni wa sayansi, navyo ni: Kipindi cha \"Ether\", kilicho elezwa katika Surat Ad-dukhan ya 44 ya kuwa ni moshi. Kisha kutokana na hiyo \"Ether\" yakatokea majua, ambayo moja lake ni hili jua letu. Kisha kutokana na jua zikawa sayari, na miongoni mwa sayari hizo ni hii dunia yetu. Tena katika ardhi zikawamo maadini mbali mbali. Tena ndio kikawa kipindi cha Ardhi, na baadae ukatokea uhai juu yake. Maana ya pili ya Aya hii ni kuwa kila kiliomo ulimwenguni kimo chini ya ufalme wa Mwenyezi Mungu peke yake, wala hapana ufalme usipo kuwa wake Yeye. Na nguvu zozote anazo pewa mtu hatoweza kuuendesha ulimwengu atakavyo. Ukomo wa uwezo wake ni kunufaika na vilivyo umbwa na akajua baadhi ya siri ziliomo ulimwenguni ambazo zilikuwa zimefichika. Kwa hivyo Mwenyezi Mungu pekee ndiye aliye tuwa na kutawala juu ya A'rshi iliyo juu ya vyote vilivyo umbwa, na kwamba nyota na vitu vyote haviendi ila kwa amri yake peke yake. Maana ya tatu ni kuwa kupishana usiku na mchana kumetokea baada ya kwisha umbwa ardhi na mbingu. Basi hizo ni hali zenye kukhusika na asli ya uumbaji wa dunia, na makhusiano ya baina mbingu na ardhi na kuzunguka kwao na Mwenyewe Subhana Mwenye kuumiliki ufalme na utukufu na ukarimu.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"inna rabbakumu al-lahu alladhī khalaqa al-samāwāti wal-arḍa fī sittati ayyāmin thumma is'tawā ʿalā al-ʿarshi yugh'shī al-layla al-nahāra yaṭlubuhu ḥathīthan wal-shamsa wal-qamara wal-nujūma musakharātin bi-amrihi alā lahu al-khalqu wal-amru tabāraka al-lahu rabbu al-ʿālamīna ","translations":["Indeed","your Lord","(is) Allah","the One Who","created","the heavens","and the earth","in","six","epochs","then","He ascended","on","the Throne","He covers","the night","(with) the day","seeking it","rapidly","and the sun","and the moon","and the stars ","subjected","by His command","Unquestionably","for Him","(is) the creation","and the command","blessed","(is) Allah","Lord","(of) the worlds","(54)"],"transliterationArr":["inna","rabbakumu","al-lahu","alladhī","khalaqa","al-samāwāti","wal-arḍa","fī","sittati","ayyāmin","thumma","is'tawā","ʿalā","al-ʿarshi","yugh'shī","al-layla","al-nahāra","yaṭlubuhu","ḥathīthan","wal-shamsa","wal-qamara","wal-nujūma","musakharātin","bi-amrihi","alā","lahu","al-khalqu","wal-amru","tabāraka","al-lahu","rabbu","al-ʿālamīna",null],"verseTiming":[[1,0,1720],[2,1720,2750],[3,2750,3790],[4,3790,4400],[5,4400,4990],[6,4990,6530],[7,6530,7540],[8,7540,7860],[9,7860,8720],[10,8720,10690],[11,10690,11920],[12,11920,12830],[13,12830,13250],[14,13250,14400],[15,14400,16270],[16,16270,17240],[17,17240,17640],[18,17640,18510],[19,18510,19110],[20,19110,19960],[21,19960,21570],[22,21570,22760],[23,22760,24580],[24,24580,25570],[25,25570,26690],[26,26690,28490],[27,28490,30290],[28,30290,32420],[29,32420,33030],[30,33030,33390],[31,33390,34360],[32,34360,35650],[33,35650,36610],[34,36610,37510],[35,37510,38090],[36,38090,41095]]}}