{"name":"7:65","price":"Na kwa A'adi tulimpeleka ndugu yao, Huud. Akasema: Enyi watu wangu! Muabuduni Mwenyezi Mungu. Nyinyi hamna mungu ila Yeye. Basi je, hamumchi?","arabic":"۞ وَإِلَىٰ عَادٍ أَخَاهُمۡ هُودٗاۚ قَالَ يَٰقَوۡمِ ٱعۡبُدُواْ ٱللَّهَ مَا لَكُم مِّنۡ إِلَٰهٍ غَيۡرُهُۥٓۚ أَفَلَا تَتَّقُونَ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":1019,"juzNumber":8,"footnotes":"Kama tulivyo mtuma Nuhu kwa kaumu yake kuwalingania Tawhidi, kadhaalika tuliwatumia kina 'Aad Nabii Huud,naye ni mmoja wao, makhusiano yake nao ni kama ndugu kwa ndugu. Akawaambia: Enyi watu wangu! Muabuduni Mwenyezi Mungu peke yake, nanyi hamna Mungu asiye kuwa Yeye. Na hii ndiyo njia ya kujikinga na shari na adhabu. Nayo ndiyo Njia Iliyo Nyooka. Basi je, mtaifuata njia mjikinge na shari na upotovu? 'Aad ni katika kabila yenye nguvu katika matumbo ya Taifa la Sam, na ni katika mat'abaka ya kwanza katika Waarabu wa jangwani. Ama makaazi yao yalikuwa katika Al-ah'qaaf iliyo tajwa katika Kitabu kitukufu katika Sura ya Al-ah'qaaf Aya 21. Wamewafikiana wanachuoni wa Kiislamu wa kutegemewa kuwa hiyo Ah'qaaf ipo katika nchi ya Yaman, ijapo kuwa wamekhitalifiana kidogo wapi khasa pahala penyewe. Kwa mujibu wa Yaaqut Al-h'amawy ni bonde baina ya Oman na nchi ya Mahara. Na kwa mujibu wa Is-haaq akimnukulu Ibn Abbas na Ibn Khaldun ni sehemu ya mchanga baina ya Oman na Hadhramaut. Kwa mujibu wa Qutaada ni sehemu ya mchanga karibu na bahari katika Shajar katika nchi ya Yaman. Na yafaa kutaja kuwa nchi ya 'Aad kwa mujibu wa baadhi ya Wamagharibi wa zamani ipo pande za juu za Hijaz katika jimbo la Husmaa, na karibu na makaazi ya Thamud. Vyo vyote ilivyo si mbali kuwa hao kaumu ya 'Aad walisafiri wakahamia jimbo hili wakati mmoja wapo.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"wa-ilā ʿādin akhāhum hūdan qāla yāqawmi uʿ'budū al-laha mā lakum min ilāhin ghayruhu afalā tattaqūna ","translations":["And to","Aad","(We sent) their brother","Hud","He said","O my people","Worship","Allah","not","for you","any","god","other than Him","Then will not","you fear (Allah)","(65)"],"transliterationArr":["wa-ilā","ʿādin","akhāhum","hūdan","qāla","yāqawmi","uʿ'budū","al-laha","mā","lakum","min","ilāhin","ghayruhu","afalā","tattaqūna",null],"verseTiming":[[1,0,1020],[2,1020,1840],[3,1840,2900],[4,2900,4370],[5,4370,4980],[6,4980,5930],[7,5930,6570],[8,6570,7420],[9,7420,7840],[10,7840,8530],[11,8530,9600],[12,9600,10600],[13,10600,11840],[14,11840,12650],[15,12650,16355]]}}