{"name":"88:17","price":"Je! Hawamtazami ngamia jinsi alivyo umbwa?","arabic":"أَفَلَا يَنظُرُونَ إِلَى ٱلۡإِبِلِ كَيۡفَ خُلِقَتۡ","category":["88 (Al-Ghashiyah)","Al-Ghashiyah","Surah Al-Ghashiyah","Chapter Al-Ghashiyah","Ghashiyah","Surah Ghashiyah","Chapter Ghashiyah","Al Ghashiyah","Surah Al Ghashiyah","Chapter Al Ghashiyah","Surah 88","Chapter 88","The Overwhelming Event","الغاشية"],"ayahNumber":5984,"juzNumber":30,"footnotes":"Je! Wanapuuza kuzingatia Ishara, basi hebu na wamuangalie ngamia, vipi alivyo umbwa kwa namna ya peke yake kwa uweza wa Mwenyezi Mungu? Katika kuumbwa ngamia zipo Ishara na miujiza yenye kuthibitisha uweza wa Mwenyezi Mungu ambao yafaa wenye kuzingatia wauzingatie. Katika sifa zake zinazo onekana ni hizo zinazo mfanya kweli awe ni jahazi ya jangwani. Macho yake yamenyanyuka yako juu ya kichwa, na yanaelekea nyuma, na tena yana kope za kuyakinga na mchanga na vumbi. Kadhaalika pua na masikio yamefunikwa na nywele kwa sababu hiyo hiyo. Ukivuma mdharuba wa mchanga pua hufunga na masikio hupinda, juu ya kuwa tokea hapo ni madogo na si yenye kudhihiri mno, ukilinganisha na mwili wake. Ama miguu ni mirefu kwa kusaidia wepesi wa kwenda, pamoja na kunasibiana na urefu wa shingo yake. Ama nyayo ni pana zimetanda kwa ukhafifu ili kumwezesha ngamia kwenda juu ya mchanga laini. Na ngamia kwa jumla chini ya kifua chake na chini ya viungo vyake vya miguu pana kama mito inayo msaidia ngamia kupiga magoti na kulala juu ya ardhi ngumu na imoto, kama vile vile pande zote mbili za mkia wake yapo manyoya marefu ya kumlinda sehemu zake za nyuma na vitu vya kumuudhi. Ama vipawa alivyo pewa ngamia kwa ajili ya kazi yake ni vya ajabu zaidi. Siku za baridi hahitajii maji, bali anaweza asinywe maji muda wa miezi miwili mfululizo, ikiwa chakula kimajimaji na laini, au wiki mbili ikiwa kikavu. Pia anaweza kustahamili kiu hata siku za joto muda wa wiki au wiki mbili, na hupungua muda huo zaidi ya thuluthi mbili ya uzito wake. Na anapo yapata maji huyagugumia maji kwa wingi mno arejeshe uzito wake wa zamani kwa dakika chache tu. Na ngamia hayarimbiki maji katika tumbo lake kama ilivyo kuwa ikidhaniwa, bali katika mfumo wa mwili wake, na huyatumia kwa uangalifu mkubwa mno. Kwa hivyo kabisa hapumui kama anavyo pumua mbwa, mathalan, wala hatoi pumzi kwa mdomo wake, wala hatoki majasho kwenye ngozi yake ila kwa uchache kabisa. Na hayo ni kuwa daraja ya joto ya mwili wake inakuwa chini sana asubuhi mapema. Kisha hupanda kidogo kidogo zaidi ya daraja sita kabla ya kuhitajia kuipoza kwa jasho na kutoa mvuke. Na juu ya maji mengi mno yanayo toka katika mwili baada ya kiu kirefu kwa hakika uzito wa damu hauathiriki ila kwa kiasi tu, na kwa hivyo kiu hakina athari kitu juu yake. Na imethibiti mafuta ya nunudu yaliyo khaziniwa kwa ajili ya nishat'i yanamkifu kumkinga na machungu ya njaa, lakini hayamfaidishi sana kwa haja ya maji ambayo ni lazima kwa mwili wake. Na bado wataalamu wangali wanagundua mapya katika ngamia kila wakichungua ya kuhakikisha hadhi aliyo mpa Mwenyezi Mungu Mtukufu kuwa atazamwe katika uumbaji wake wa muujiza.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"afalā yanẓurūna ilā al-ibili kayfa khuliqat ","translations":["Then do not","they look","towards","the camels","how","they are created","(17)"],"transliterationArr":["afalā","yanẓurūna","ilā","al-ibili","kayfa","khuliqat",null],"verseTiming":[[1,0,840],[2,840,2740],[3,2740,3130],[4,3130,4050],[5,4050,4670],[6,4670,5995]]}}