{"name":"8:11","price":"Alipo kufunikeni kwa usingizi uwe ni uaminisho kutoka kwake, na akakuteremshieni maji kutoka mbinguni ili kukusafisheni kwayo na kukuondoleeni uchafu wa Shet'ani, na kuzipa nguvu nyoyo zenu, na kuitia imara miguu yenu.","arabic":"إِذۡ يُغَشِّيكُمُ ٱلنُّعَاسَ أَمَنَةٗ مِّنۡهُ وَيُنَزِّلُ عَلَيۡكُم مِّنَ ٱلسَّمَآءِ مَآءٗ لِّيُطَهِّرَكُم بِهِۦ وَيُذۡهِبَ عَنكُمۡ رِجۡزَ ٱلشَّيۡطَٰنِ وَلِيَرۡبِطَ عَلَىٰ قُلُوبِكُمۡ وَيُثَبِّتَ بِهِ ٱلۡأَقۡدَامَ","category":["8 (Al-Anfal)","Al-Anfal","Surah Al-Anfal","Chapter Al-Anfal","Anfal","Surah Anfal","Chapter Anfal","Al Anfal","Surah Al Anfal","Chapter Al Anfal","Surah 8","Chapter 8","The Spoils of War","الأنفَال"],"ayahNumber":1171,"juzNumber":9,"footnotes":"Enyi Waumini! Kumbukeni wakati mlipo ingiwa khofu kwa upungufu wa maji, na kuwaogopa maadui. Mwenyezi Mungu alikupeni utulivu, kwa kukuleteeni usingizi, mkalala mkatua. Akakuteremshieni maji kutoka mbinguni mkajisafishia, na mkauondoa wasiwasi wa Shetani, na nyoyo zenu zikawa imara kwa msaada wa Rahmani na pia ardhi ikashikamana kwa hayo maji, na miguu yenu ikaweza kukanyaga bila ya kudidimia katika mchanga. Aya hii inaashiria fadhila ya Mwenyezi Mungu Mtukufu juu ya wapiganaji Waumini kwa kupatikana hali ya amani kwa kupumzika kwa usingizi, na kuteremka mvua kwa kujitahirisha na kukoga, na kushikamana mchanga kwa kuwepo maji, basi nyayo zikasimama imara. Inajuulikana kuwa mchanga laini unawaletea taabu wapiganaji na unakuwa pingamizi katika kwenda huku na huko ambako ni katika dharura za vita muhimu. Na aya ya pili inaeleza maneno ya Mwenyezi Mungu Mtukufu kuwaambia Malaika wawathibitishe Waumini na watie khofu katika nyoyo za makafiri. Na ni maarufu kuwa khofu ikiwatawala askari katika midani huwaletea kuemewa. Na katika Aya hii tukufu panaashiriwa pahali pa kupiga napo ni juu ya shingo na kuvikata vidole vinavyo kamata silaha mkononi.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"idh yughashīkumu al-nuʿāsa amanatan min'hu wayunazzilu ʿalaykum mina al-samāi māan liyuṭahhirakum bihi wayudh'hiba ʿankum rij'za al-shayṭāni waliyarbiṭa ʿalā qulūbikum wayuthabbita bihi al-aqdāma ","translations":["When","He covered you","with [the] slumber","a security","from Him","and sent down","upon you","from","the sky","water","so that He may purify you","with it","and take away","from you","evil (suggestions)","(of) the Shaitaan","And to strengthen","[on]","your hearts","and make firm","with it","your feet","(11)"],"transliterationArr":["idh","yughashīkumu","al-nuʿāsa","amanatan","min'hu","wayunazzilu","ʿalaykum","mina","al-samāi","māan","liyuṭahhirakum","bihi","wayudh'hiba","ʿankum","rij'za","al-shayṭāni","waliyarbiṭa","ʿalā","qulūbikum","wayuthabbita","bihi","al-aqdāma",null],"verseTiming":[[1,0,440],[2,440,1890],[3,1890,3750],[4,3750,4630],[5,4630,6170],[6,6170,7370],[7,7370,8350],[8,8350,9470],[9,9470,12500],[10,12500,14700],[11,14700,17330],[12,17330,17970],[13,17970,19130],[14,19130,20840],[15,20840,21460],[16,21460,22870],[17,22870,24400],[18,24400,24810],[19,24810,26710],[20,26710,28310],[21,28310,28860],[22,28860,30330],[23,30330,31650],[24,31650,32140],[25,32140,34265]]}}