{"name":"8:9","price":"Mlipo kuwa mkimuomba msaada Mola wenu Mlezi, naye akakujibuni kuwa: Kwa yakini Mimi nitakusaidieni kwa Malaika elfu wanao fuatana mfululizo.","arabic":"إِذۡ تَسۡتَغِيثُونَ رَبَّكُمۡ فَٱسۡتَجَابَ لَكُمۡ أَنِّي مُمِدُّكُم بِأَلۡفٖ مِّنَ ٱلۡمَلَٰٓئِكَةِ مُرۡدِفِينَ","category":["8 (Al-Anfal)","Al-Anfal","Surah Al-Anfal","Chapter Al-Anfal","Anfal","Surah Anfal","Chapter Anfal","Al Anfal","Surah Al Anfal","Chapter Al Anfal","Surah 8","Chapter 8","The Spoils of War","الأنفَال"],"ayahNumber":1169,"juzNumber":9,"footnotes":"Na enyi Waumini! Kumbukeni nanyi mnagawana ngawira na mnakhitalifiana, mlipo omba uwokovu na msaada, na mkaandikiwa kuwa hapana la kukuepusheni na vita. Mwenyezi Mungu alikuitikieni maombi yenu, akakuungeni mkono kwa kukuleteeni (Malaika) Roho zilizo safi nyingi zinazo fika elfu zinazo fuatana, zikija moja baada ya moja. Walipo jua wapiganaji Waumini kuwa hapana njia ya kuepukana na vita wakaomba msaada kwa Mwenyezi Mungu, naye Mwenyezi Mungu Mtukufu akawaitikia, na akawaunga mkono kwa Malaika elfu walio fuatana. Yaani alianza kwa kupeleka msaada kwa vikosi vilivyo fuatana ili iwe wepesi kwa kila kikosi kuelekea pahala pake katika vita pasiwepo kukaa bure au kupigana makumbo. Na ifikapo misaada ya majeshi ya vita roho hufurahi na moyo huingia nguvu. Na hayo ndiyo aliyo yakusudia Mwenyezi Mungu Mtukufu kwa kauli yake: \"Na Mwenyezi Mungu hakufanya haya ila kuwa ni bishara na ili nyoyo zenu zituwe.\" Na ushindi daima unatokana na Mwenyezi Mungu.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"idh tastaghīthūna rabbakum fa-is'tajāba lakum annī mumiddukum bi-alfin mina al-malāikati mur'difīna ","translations":["When","you were seeking help","(of) your Lord","and He answered","[to] you","Indeed, I am","going to reinforce you","with a thousand","of","the Angels","one after another","(9)"],"transliterationArr":["idh","tastaghīthūna","rabbakum","fa-is'tajāba","lakum","annī","mumiddukum","bi-alfin","mina","al-malāikati","mur'difīna",null],"verseTiming":[[1,0,530],[2,530,2210],[3,2210,3310],[4,3310,4660],[5,4660,5300],[6,5300,7130],[7,7130,9180],[8,9180,10040],[9,10040,11160],[10,11160,14270],[11,14270,17105]]}}