{"name":"9:41","price":"Nendeni mtoke, mkiwa wepesi na wazito, na piganeni Jihadi kwa mali yenu na nafsi zenu katika Njia ya Mwenyezi Mungu. Haya ni kheri kwenu mkiwa mnajua.","arabic":"ٱنفِرُواْ خِفَافٗا وَثِقَالٗا وَجَٰهِدُواْ بِأَمۡوَٰلِكُمۡ وَأَنفُسِكُمۡ فِي سَبِيلِ ٱللَّهِۚ ذَٰلِكُمۡ خَيۡرٞ لَّكُمۡ إِن كُنتُمۡ تَعۡلَمُونَ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1276,"juzNumber":10,"footnotes":"Enyi Waumini! Akinadi mwenye kunadi kuwa kuna Jihadi, basi itikieni wito huo, mkiwa mmoja mmoja au kwa makundi. Kila mmoja kwa kadri ya uwezo wake, na hali mna uchangamfu kwa nguvu na salama na silaha. Na muwanie Jihadi kwa mali na nafsi katika Njia ya Mwenyezi Mungu kwa ajili ya kulitukuza Neno la Mwenyezi Mungu. Katika hayo upo utukufu na kheri kwenu, ikiwa nyinyi ni watu wenye ujuzi ulio baraabara na mnaijua Haki. Na katika maana yaliyo kusudiwa hapa ni: kuwa nendeni mmepanda au kwa miguu, mna silaha nyepesi na nyengine nzito. Na hivi ni katika mbinu maarufu za kisasa. Silaha nyepesi kama panga ni za kuuwana na askari, na silaha nzito ni za kubomoa ngome za maadui.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"infirū khifāfan wathiqālan wajāhidū bi-amwālikum wa-anfusikum fī sabīli al-lahi dhālikum khayrun lakum in kuntum taʿlamūna ","translations":["Go forth","light","or heavy","and strive","with your wealth","and your lives","in","(the) way","(of) Allah","That","(is) better","for you","if","you","know","(41)"],"transliterationArr":["infirū","khifāfan","wathiqālan","wajāhidū","bi-amwālikum","wa-anfusikum","fī","sabīli","al-lahi","dhālikum","khayrun","lakum","in","kuntum","taʿlamūna",null],"verseTiming":[[1,0,1920],[2,1920,4090],[3,4090,5910],[4,5910,7110],[5,7110,8980],[6,8980,11050],[7,11050,11460],[8,11460,12660],[9,12660,15070],[10,15070,16170],[11,16170,17050],[12,17050,17750],[13,17750,19010],[14,19010,20840],[15,20840,24535]]}}