{"name":"9:60","price":"Wa kupewa sadaka ni mafakiri, na masikini, na wanao zitumikia, na wa kutiwa nguvu nyoyo zao, na katika kukomboa watumwa, na wenye madeni, na katika Njia ya Mwenyezi Mungu, na wasafiri. Huu ni waajibu ulio faridhiwa na Mwenyezi Mungu. Na Mwenyezi Mungu ni Mwenye kujua Mwenye hikima.","arabic":"۞ إِنَّمَا ٱلصَّدَقَٰتُ لِلۡفُقَرَآءِ وَٱلۡمَسَٰكِينِ وَٱلۡعَٰمِلِينَ عَلَيۡهَا وَٱلۡمُؤَلَّفَةِ قُلُوبُهُمۡ وَفِي ٱلرِّقَابِ وَٱلۡغَٰرِمِينَ وَفِي سَبِيلِ ٱللَّهِ وَٱبۡنِ ٱلسَّبِيلِۖ فَرِيضَةٗ مِّنَ ٱللَّهِۗ وَٱللَّهُ عَلِيمٌ حَكِيمٞ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1295,"juzNumber":10,"footnotes":"Zaka iliyo faridhiwa haitumiwi ila kwa mafakiri wasio pata cha kuwatosha, na masikini wagonjwa ambao hawawezi kazi wala hawana mali, na wale wanao itumikia kwa kuikusanya, na wanao tiwa moyo kwa sababu wanatarajiwa kusilimu na kupatikana kwao manufaa kwa utumishi wao na kuunusuru Uislamu, na wale wanao eneza Uislamu na kufanya tabshiri (Da'awa), na katika kuwakomboa waliomo utumwani na walio tekwa, na kuwatoa waliomo katika unyonge na utawala wa madhila, na katika kuwalipia wenye madeni walio shindwa kuyalipa ikiwa hayo madeni hayakutokana na madhambi au dhulma au upumbavu, na katika kuzatiti Jihadi katika Njia ya Mwenyezi Mungu, na katika mambo kama hayo yaliyomo katika njia za kheri na wema, na katika kusaidia wasafiri walio katikiwa kupata msaada wa mali yao na watu wao. Mwenyezi Mungu ameyatungia sharia hayo kuwa ni waajibu kwa ajili ya maslaha ya waja wake. Na Mwenyezi Mungu Subhanahu ni Mwenye kujua vyema maslaha ya viumbe vyake, na Mwenye hikima kwa anayo yafanyia sharia. Zaka ni mpango ulio wekwa wa kukusanya mali kutokana na matajiri na kurudishiwa mafakiri. Kwa hivyo ni haki ya mafakiri katika mali ya matajiri. Na huyakusanya mtawala na huyatumilia kwa njia zake ambazo zinahisabiwa kuwa ndio muhimu kabisa na bora hizo ni kupiga vita athari za ufakiri kwa mafakiri. Hupewa mafakiri, masikini, wasafiri, kusaidiwa mwenye deni aliye kopa kwa jambo la halali si kwa uharibifu, na katika hayo ipo njia ya kupewa mkopo \"kardhan hasanan\" (mkopo kwa Lillahi). Katika mwanzo wa Uislamu ilivyo kuwa Zaka inatozwa na kutumiwa vilivyo hapakuwapo katika umma mtu anaye lala na njaa, wala mwombaji aliye dhalilika kwa haja. Ilifika hadi hata wenye kutumikia Zaka wakashitaki kuwa jinsi ya kuenea neema hapana wa kustahiki kupewa. Alishitaki mmoja wapo katika Afrika kumshitakia Khalifa Umar bin Abdulaziz kuwa hakumpata fakiri wa kumpa Zaka. Umar akamwambia walipie wenye madeni. Akawalipia. Bado akashitaki tena. Akamwambia wanunue watumwa uwape uhuru wao. Huo basi ndio utumiwaji wa Zaka. Na ukitaka kweli, ni kuwa lau kuwa Zaka zikikusanywa kwa inavyo faa, na zikatumiliwa zinavyo stahiki basi huo bila ya shaka ungeli kuwa ni mpango bora kabisa wa kudhamini maisha ya umma yasipate shida ya umasikini.","lang":"sw","version":{"key":"swahili_barawani","direction":"ltr","language_iso_code":"sw","version":"1.0.0","last_update":1615237200,"title":"Swahili translation - Ali Muhsen Alberwany","description":"Translation of the Quran meanings into Swahili by Ali Muhsen Alberwany"},"meta":{"transliteration":"innamā al-ṣadaqātu lil'fuqarāi wal-masākīni wal-ʿāmilīna ʿalayhā wal-mu-alafati qulūbuhum wafī al-riqābi wal-ghārimīna wafī sabīli al-lahi wa-ib'ni al-sabīli farīḍatan mina al-lahi wal-lahu ʿalīmun ḥakīmun ","translations":["Only","the charities","(are) for the poor","and the needy","and those who collect","them","and the ones inclined","their hearts","and in","the (freeing of) the necks","and for those in debt","and in","(the) way","(of) Allah","and the wayfarer ","and the wayfarer ","an obligation","from","Allah","And Allah","(is) All-Knowing","All-Wise","(60)"],"transliterationArr":["innamā","al-ṣadaqātu","lil'fuqarāi","wal-masākīni","wal-ʿāmilīna","ʿalayhā","wal-mu-alafati","qulūbuhum","wafī","al-riqābi","wal-ghārimīna","wafī","sabīli","al-lahi","wa-ib'ni","al-sabīli","farīḍatan","mina","al-lahi","wal-lahu","ʿalīmun","ḥakīmun",null],"verseTiming":[[1,0,2019],[2,2019,3419],[3,3419,6499],[4,6499,8119],[5,8119,9789],[6,9789,10899],[7,10899,12679],[8,12679,14099],[9,14099,14509],[10,14509,15649],[11,15649,17499],[12,17499,18069],[13,18069,19309],[14,19309,19909],[15,19909,20549],[16,20549,23659],[17,23659,24889],[18,24889,25909],[19,25909,28999],[20,28999,30069],[21,30069,30989],[22,30989,34454]]}}