{"name":"24:11","price":"Sesungguhnya orang-orang yang membawa berita bohong itu adalah dari golongan kamu (juga). Janganlah kamu mengira berita itu buruk bagi kamu, bahkan itu baik bagi kamu. Setiap orang dari mereka mendapat balasan dari dosa yang diperbuatnya. Dan barangsiapa di antara mereka yang mengambil bagian terbesar (dari dosa yang diperbuatnya), dia mendapat azab yang besar (pula).560)","arabic":"إِنَّ ٱلَّذِينَ جَآءُو بِٱلۡإِفۡكِ عُصۡبَةٞ مِّنكُمۡۚ لَا تَحۡسَبُوهُ شَرّٗا لَّكُمۖ بَلۡ هُوَ خَيۡرٞ لَّكُمۡۚ لِكُلِّ ٱمۡرِيٕٖ مِّنۡهُم مَّا ٱكۡتَسَبَ مِنَ ٱلۡإِثۡمِۚ وَٱلَّذِي تَوَلَّىٰ كِبۡرَهُۥ مِنۡهُمۡ لَهُۥ عَذَابٌ عَظِيمٞ","category":["24 (An-Nur)","An-Nur","Surah An-Nur","Chapter An-Nur","Nur","Surah Nur","Chapter Nur","An Nur","Surah An Nur","Chapter An Nur","Surah 24","Chapter 24","The Light","النُّور"],"ayahNumber":2802,"juzNumber":18,"footnotes":"*560) Berita bohong ini mengenai istri Rasulullah -ṣallallāhu 'alaihi wa sallam- Aisyah -raḍiyallāhu 'anhā- Ummul Mukminin, setelah perang dengan Bani Musṭaliq pada bulan Syaban 5 H. Peperangan itu diikuti kaum munafik dan turut pula Aisyah -raḍiyallāhu 'anhā- dengan Nabi -ṣallallāhu 'alaihi wa sallam- berdasarkan undian yang diadakan di antara istri-istri beliau. Dalam perjalanan kembali dari peperangan, mereka berhenti pada suatu tempat. Aisyah -raḍiyallāhu 'anhā- keluar dari sekedupnya untuk suatu keperluan, kemudian kembali. Tiba-tiba dia merasa kalungnya hilang, lalu dia pergi lagi mencarinya. Sementara itu, rombongan berangkat dengan anggapan bahwa Aisyah -raḍiyallāhu 'anhā- masih ada dalam sekedup. Setelah Aisyah -raḍiyallāhu 'anhā- mengetahui sekedupnya sudah berangkat, dia duduk di tempatnya dan mengharapkan sekedup itu akan kembali menjemputnya. Kebetulan, lewat di tempat itu seorang sahabat Nabi -ṣallallāhu 'alaihi wa sallam-, Safwan ibnu Mu'aṭṭal -raḍiyallāhu 'anhu-, ditemukannya seseorang sedang tidur sendirian dan dia terkejut seraya mengucapkan, “Innā lillāhi wa innā ilaihi rāji'ūn, istri Rasul!” Aisyah terbangun. Lalu dia dipersilahkan oleh Safwan mengendarai untanya. Safwan berjalan menuntun unta sampai mereka tiba di Madinah. Orang-orang yang melihat mereka membicarakannya menurut pendapat masing-masing. Mulailah timbul desas-desus. Kemudian kaum munafik membesar-besarkannya, maka fitnah atas Aisyah -raḍiyallāhu 'anhā- itu pun bertambah luas, sehingga menimbulkan keguncangan di kalangan kaum muslimin.","lang":"id","version":{"key":"indonesian_affairs","direction":"ltr","language_iso_code":"id","version":"1.0.1","last_update":1617483600,"title":"Indonesian Translation - Ministry of Islamic Affairs","description":"Translation of the Quran meanings into Indonesian by Indonesian Ministry of Islamic Affairs. Notice: Some referred translated verses corrected by Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"inna alladhīna jāū bil-if'ki ʿuṣ'batun minkum lā taḥsabūhu sharran lakum bal huwa khayrun lakum likulli im'ri-in min'hum mā ik'tasaba mina al-ith'mi wa-alladhī tawallā kib'rahu min'hum lahu ʿadhābun ʿaẓīmun ","translations":["Indeed","those who","brought","the lie","(are) a group","among you","(Do) not","think it","bad","for you","nay","it","(is) good","for you","For every","person","among them","(is) what","he earned","of","the sin","and the one who","took upon himself a greater share of it","took upon himself a greater share of it","among them ","for him","(is) a punishment","great","(11)"],"transliterationArr":["inna","alladhīna","jāū","bil-if'ki","ʿuṣ'batun","minkum","lā","taḥsabūhu","sharran","lakum","bal","huwa","khayrun","lakum","likulli","im'ri-in","min'hum","mā","ik'tasaba","mina","al-ith'mi","wa-alladhī","tawallā","kib'rahu","min'hum","lahu","ʿadhābun","ʿaẓīmun",null],"verseTiming":[[1,0,1480],[2,1480,2480],[3,2480,4850],[4,4850,5810],[5,5810,6620],[6,6620,8730],[7,8730,9110],[8,9110,10340],[9,10340,11000],[10,11000,12270],[11,12270,12670],[12,12670,13100],[13,13100,13800],[14,13800,15160],[15,15160,15900],[16,15900,16600],[17,16600,18090],[18,18090,19010],[19,19010,19880],[20,19880,20190],[21,20190,20920],[22,20920,22490],[23,22490,23490],[24,23490,24540],[25,24540,25420],[26,25420,25980],[27,25980,26920],[28,26920,29455]]}}