{"name":"105:1","price":"Vallë, a nuk ke dëgjuar ti se si bëri Zoti yt me njerëzit e elefantit?[429]","arabic":"أَلَمۡ تَرَ كَيۡفَ فَعَلَ رَبُّكَ بِأَصۡحَٰبِ ٱلۡفِيلِ","category":["105 (Al-Fil)","Al-Fil","Surah Al-Fil","Chapter Al-Fil","Fil","Surah Fil","Chapter Fil","Al Fil","Surah Al Fil","Chapter Al Fil","Surah 105","Chapter 105","The Elephant","الفيل"],"ayahNumber":6189,"juzNumber":30,"footnotes":"[429] Në vitin 570 (ose 571), Ebreha, guvernatori abisinas i Jemenit, u betua se do të shkatërronte Qabenë, të cilën e quante një tempull pagan, në mënyrë që të vendoste dominimin e krishterë në të gjithë Gadishullin Arabik. Ai mblodhi një ushtri të fuqishme, në krye të së cilës marshonte një elefant i madh dhe u drejtua për nga Meka. Kur ushtria iu afrua Mekës, elefanti u ul dhe nuk pranonte të ecte në atë drejtim. Kur i ndërronin drejtim, ai ecte. Kjo ishte shenjë që ushtria e Ebrehasë të mos e sulmonte Mekën, por Ebrehaja s’ia vuri veshin asaj. Prandaj, Allahu i Madhëruar i goditi ashpërsisht njerëzit e elefantit nëpërmjet tufash të panumërta me zogj, që lëshonin një lloj guri të fortë e vdekjeprurës. Morali ishte i qartë për fisin Kurejsh: Allahu i Madhëruar e kishte mbrojtur Faltoren e Tij, ashtu edhe ata vetë, prandaj duhej të ishin mirënjohës për këtë.","lang":"sq","version":{"key":"albanian_nahi","direction":"ltr","language_iso_code":"sq","version":"1.1.0","last_update":1576962000,"title":"Albanian Translation - Hasan Nahi","description":"Translation of the Quran meanings into Albanian by Hasan Nahi, published by Albanian Institute of Islamic Thought and Civilization, printed in 2006."},"meta":{"transliteration":"alam tara kayfa faʿala rabbuka bi-aṣḥābi al-fīli ","translations":["Have not","you seen","how","dealt","your Lord","with (the) Companions","(of the) Elephant","(1)"],"transliterationArr":["alam","tara","kayfa","faʿala","rabbuka","bi-aṣḥābi","al-fīli",null],"verseTiming":[[1,0,550],[2,550,1120],[3,1120,1700],[4,1700,2420],[5,2420,3290],[6,3290,4590],[7,4590,7895]]}}