{"name":"114:1","price":"Thuaj: “Kërkoj mbështetje te Zoti i njerëzve,[444]","arabic":"قُلۡ أَعُوذُ بِرَبِّ ٱلنَّاسِ","category":["114 (An-Nas)","An-Nas","Surah An-Nas","Chapter An-Nas","Nas","Surah Nas","Chapter Nas","An Nas","Surah An Nas","Chapter An Nas","Surah 114","Chapter 114","Mankind","الناس"],"ayahNumber":6231,"juzNumber":30,"footnotes":"[444] Sipas disa transmetimeve nga Ibn Abbasi dhe Aishja, një magjistar hebre me emrin Lebid që jetonte në Medinë, ishte ngarkuar t’i bënte Profetit Muhamed (a.s.) një magji vdekjeprurëse. Magjistari arriti të siguronte disa fije nga flokët e Profetit (a.s.) dhe me to bëri njëmbëdhjetë nyje. Bijat e tij frynin në secilën prej këtyre nyjave, duke thënë mallkime të frikshme. Pastaj, magjinë e mbështollën, duke i shtuar një filiz palme hurmash dhe e hodhën në një pus. Profeti (a.s.) filloi të ndiente shqetësime të çuditshme si: humbje të kujtesës, dobësi, humbje të oreksit etj. dhe gjendja e tij po përkeqësohej, derisa Allahu i Madhëruar ia zbuloi në ëndërr shkakun e shqetësimeve të tij dhe vendin, ku ishte fshehur magjia. Kur Profeti (a.s.) u zgjua, atij i erdhi Xhebraili (a.s.) dhe i dha dy sure, njëra me pesë vargje dhe tjetra me gjashtë. Profeti (a.s.) dërgoi Aliun te pusi me detyrën për të lexuar këto dy sure. Ndërsa ai lexonte suret, nyjat zgjidheshin njëra pas tjetrës dhe Muhamedi (a.s.) rifitonte forcat dhe kthjelltësinë e humbur. Dy suret në fjalë janë ato me të cilat mbyllet Kurani i Madhërishëm. Këto sure kanë një rëndësi të madhe rituale dhe myslimanët i recitojnë ato shpesh për t’u ruajtur nga çdo e keqe, fizike apo shpirtërore qoftë.","lang":"sq","version":{"key":"albanian_nahi","direction":"ltr","language_iso_code":"sq","version":"1.1.0","last_update":1576962000,"title":"Albanian Translation - Hasan Nahi","description":"Translation of the Quran meanings into Albanian by Hasan Nahi, published by Albanian Institute of Islamic Thought and Civilization, printed in 2006."},"meta":{"transliteration":"qul aʿūdhu birabbi al-nāsi ","translations":["Say","I seek refuge","in (the) Lord","(of) mankind","(1)"],"transliterationArr":["qul","aʿūdhu","birabbi","al-nāsi",null],"verseTiming":[[1,0,330],[2,330,1230],[3,1230,2050],[4,2050,6085]]}}