{"name":"18:9","price":"Vallë, a mendon ti se banorët e Shpellës[180] dhe Rakimit[181] ishin një çudi nga mrekullitë Tona?","arabic":"أَمۡ حَسِبۡتَ أَنَّ أَصۡحَٰبَ ٱلۡكَهۡفِ وَٱلرَّقِيمِ كَانُواْ مِنۡ ءَايَٰتِنَا عَجَبًا","category":["18 (Al-Kahf)","Al-Kahf","Surah Al-Kahf","Chapter Al-Kahf","Kahf","Surah Kahf","Chapter Kahf","Al Kahf","Surah Al Kahf","Chapter Al Kahf","Surah 18","Chapter 18","The Cave","الكَهف"],"ayahNumber":2149,"juzNumber":15,"footnotes":"[180] Banorët e Shpellës ishin disa të rinj monoteistë, të arratisur nga qyteti i tyre, për t’i shpëtuar persekutimit të një tirani pagan, që donte t’i detyronte të hiqnin dorë nga besimi i tyre. Për të ruajtur pastërtinë e këtij besimi, ata u strehuan në një shpellë jashtë qytetit dhe iu dorëzuan mëshirës hyjnore. Allahu i Madhëruar i bëri të flenë për treqind vjet dhe i zgjoi, kur gjendja në qytet kishte ndryshuar: banorët e tij ishin bërë monoteistë dhe qyteti qeverisej nga një mbret i urtë e i devotshëm. Ringjalljen e tyre Allahu e bëri mrekulli për banorët e qytetit (dhe për tërë njerëzimin) që vërtetonte ringjalljen e plotë, ngaqë ata ishin ndarë në dy grupe: njëri grup thoshte se ishte veç shpirti ai që ringjallej, kurse grupi tjetër thoshte se ringjallej edhe trupi.\n[181] Rakim mund të jetë emri i një lumi që kalonte pranë Shpellës ose një tabelë në hyrje të Shpellës me emrat e banorëve të saj, ose emri i qenit të tyre.","lang":"sq","version":{"key":"albanian_nahi","direction":"ltr","language_iso_code":"sq","version":"1.1.0","last_update":1576962000,"title":"Albanian Translation - Hasan Nahi","description":"Translation of the Quran meanings into Albanian by Hasan Nahi, published by Albanian Institute of Islamic Thought and Civilization, printed in 2006."},"meta":{"transliteration":"am ḥasib'ta anna aṣḥāba al-kahfi wal-raqīmi kānū min āyātinā ʿajaban ","translations":["Or","have you thought","that","(the) companions","(of) the cave","and the inscription","were","among","Our Signs","a wonder","(9)"],"transliterationArr":["am","ḥasib'ta","anna","aṣḥāba","al-kahfi","wal-raqīmi","kānū","min","āyātinā","ʿajaban",null],"verseTiming":[[1,0,490],[2,490,1440],[3,1440,2310],[4,2310,3290],[5,3290,4260],[6,4260,5450],[7,5450,6240],[8,6240,6640],[9,6640,8050],[10,8050,9465]]}}