{"name":"1:1","price":"Me emrin e Allahut, të Gjithëmëshirshmit, Mëshirëplotit![1]","arabic":"بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah","Chapter Al-Fatihah","Fatihah","Surah Fatihah","Chapter Fatihah","Al Fatihah","Surah Al Fatihah","Chapter Al Fatihah","Surah 1","Chapter 1","The Opening","الفَاتِحَة"],"ayahNumber":1,"juzNumber":1,"footnotes":"[1] Kjo formulë quhet El-Besmele në terminologjinë islame dhe ndodhet në fillim të çdo sureje të Kuranit, përveç sures së nëntë. Ajo është një thirrje që i drejtohet Allahut të Madhëruar, në mënyrë që Ai ta pranojë dhe ta bekojë veprimin që nis me këtë formulë. Besmele-ja përbëhet nga dy pjesë: përmendja e emrit të Allahut (bismil-lâh) dhe përmendja e dy prej cilësive të Tij, me të cilat Ai ka dashur që robërit e Vet ta identifikojnë: Er-Rahmân dhe Er-Rahîm (i Gjithëmëshirshmi, Mëshirëploti). Kur shqipton pjesën e parë të formulës, myslimani thotë: “Me emrin e Allahut e nis leximin”. Më pas vazhdon me dy cilësitë: Er-Rahmân dhe Er-Rahîm, të cilët rrjedhin nga e njëjta rrënjë rahima që do të thotë “të mëshirosh”. Në lidhje me dallimin midis këtyre dy emrave të Allahut janë bërë trajtesa të shumta e të gjata, sepse, siç ndodh gjithmonë, para Madhështisë së Allahut dituria dhe njohuria njerëzore kanë gjithnjë diçka për të thënë. Sipas disa komenteve, emri Er-Rahmân do të thotë “i Mëshirshëm dhe Përdëllyes për të gjitha krijesat”, prandaj është përkthyer “I Gjithëmëshirshmi”, kurse emri Er-Rahîm, edhe pse tregon një mëshirë të pakufishme, sipas komentuesve të Kuranit, kjo mëshirë është e veçantë vetëm për besimtarët. Ky emër është përkthyer “Mëshirëploti”.","lang":"sq","version":{"key":"albanian_nahi","direction":"ltr","language_iso_code":"sq","version":"1.1.0","last_update":1576962000,"title":"Albanian Translation - Hasan Nahi","description":"Translation of the Quran meanings into Albanian by Hasan Nahi, published by Albanian Institute of Islamic Thought and Civilization, printed in 2006."},"meta":{"transliteration":"bis'mi al-lahi al-raḥmāni al-raḥīmi ","translations":["In (the) name","(of) Allah","the Most Gracious","the Most Merciful","(1)"],"transliterationArr":["bis'mi","al-lahi","al-raḥmāni","al-raḥīmi",null],"verseTiming":[[1,0,580],[2,580,1409],[3,1409,2502],[4,2502,5840]]}}