{"name":"2:1","price":"Elif, Lâm, Mîm.[7]","arabic":"الٓمٓ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":8,"juzNumber":1,"footnotes":"[7] Elif-i, Lâm-i dhe Mîm-i janë tri shkronja të veçanta të alfabetit arab. Shkronja të tilla të veçanta ndodhen në të njëjtin pozicion në 29 sure të tjera. Në lidhje me kuptimin e tyre, dijetarët komentues të Kuranit, kanë dhënë shumë interpretime, por asnjëri prej tyre nuk ka arritur një konsensus të tillë të përgjithshëm që të konsiderohet si interpretimi më i besueshëm. Gjithsesi, shumë komentues kanë mendimin se kuptimin e vërtetë të këtyre shkronjave e di vetëm Allahu dhe se ato bëjnë pjesë në ato vargje, për të cilat vargu i shtatë i sures Ali Imran thotë: “Është Ai që të ka shpallur ty (Muhamed) Librin, disa vargje të të cilit janë të qarta e me kuptim të drejtpërdrejtë. Ato janë themelet e Librit. Kurse disa (vargje) të tjera janë jo krejtësisht të qarta (me kuptime alegorike). Ata, zemrat e të cilëve priren nga e pavërteta, ndjekin vargjet më pak të qarta, duke kërkuar të krijojnë pështjellim dhe duke kërkuar t’i komentojnë sipas dëshirës së vet. Por, kuptimin e tyre të vërtetë e di vetëm Allahu. Ndërsa ata që janë thelluar në dijeni, thonë: “Ne i besojmë (Kuranit). Të gjitha këto (vargje të qarta e alegorike) janë nga Zoti ynë!” Nëse secila nga shkronjat e veçanta të përdorura në fillimet e 30 sureve, llogaritet vetëm një herë, atëherë numri i tyre është katërmbëdhjetë, po aq sa gjysma e shkronjave të alfabetit arab.","lang":"sq","version":{"key":"albanian_nahi","direction":"ltr","language_iso_code":"sq","version":"1.1.0","last_update":1576962000,"title":"Albanian Translation - Hasan Nahi","description":"Translation of the Quran meanings into Albanian by Hasan Nahi, published by Albanian Institute of Islamic Thought and Civilization, printed in 2006."},"meta":{"transliteration":"alif-lam-meem ","translations":["Alif Laam Meem","(1)"],"transliterationArr":["alif-lam-meem",null],"verseTiming":[[1,0,7595]]}}