{"name":"2:2","price":"Ky është Libri në të cilin nuk ka dyshim[8]. Ai është udhërrëfyes[9] për të devotshmit,[10]","arabic":"ذَٰلِكَ ٱلۡكِتَٰبُ لَا رَيۡبَۛ فِيهِۛ هُدٗى لِّلۡمُتَّقِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":9,"juzNumber":1,"footnotes":"[8] Pra, nuk ka dyshim se ky Libër – Kurani – është Fjala e Allahut. Kurani ndryshon nga shkrimet e tjera të shenjta, sepse çdo shkronjë dhe çdo fjalë e tij është e Zotit dhe se ai është i ruajtur në pastërtinë e vet origjinale.\n[9] Pra, Kurani është libër ndriçues që tregon rrugën e drejtë të besimit dhe të sjelljes dhe jo libër letërsie, historie apo shkencash fizike. Edhe pse ai është shkruar në stilin më të lartë letrar në gjuhën arabe, edhe pse përmban të dhëna të sakta historike apo shkencore, para së gjithash ai është një libër i shenjtë që përmban urdhërime, ligje dhe mësime hyjnore, sipas të cilave njerëzit duhet të formojnë jetën e tyre.\n[10] “të devotshmit”: ky është përkthimi i fjalës “muttekûn”, e cila fjalë për fjalë do të thotë: “ata që i ruhen Allahut dhe që kanë frikë prej Atij”. Frika prej Allahut nuk është e tillë që ta tmerrojë besimtarin apo ta terrorizojë atë, por është një frikë e përzier me ndjenjën e dashurisë, adhurimit, respektit dhe dorëzimit para Atij. Myslimani qan nga frika prej Allahut, por më së shumti është ëmbëlsia që ndien nga dashuria për Atë, dhe jo ankthi, ajo që ia shkrin zemrën, ia djeg kraharorin dhe e bën që t’i rrjedhin lotët.","lang":"sq","version":{"key":"albanian_nahi","direction":"ltr","language_iso_code":"sq","version":"1.1.0","last_update":1576962000,"title":"Albanian Translation - Hasan Nahi","description":"Translation of the Quran meanings into Albanian by Hasan Nahi, published by Albanian Institute of Islamic Thought and Civilization, printed in 2006."},"meta":{"transliteration":"dhālika al-kitābu lā rayba fīhi hudan lil'muttaqīna ","translations":["That","(is) the book","no","doubt","in it","a Guidance","for the God-conscious","(2)"],"transliterationArr":["dhālika","al-kitābu","lā","rayba","fīhi","hudan","lil'muttaqīna",null],"verseTiming":[[1,0,900],[2,900,1800],[3,1800,2180],[4,2180,2750],[5,2750,5010],[6,5010,5310],[7,5310,8905]]}}