{"name":"2:238","price":"Faleni rregullisht namazin, sidomos atë të mesmin dhe qëndroni me devotshmëri para Allahut, duke iu lutur Atij.[40]","arabic":"حَٰفِظُواْ عَلَى ٱلصَّلَوَٰتِ وَٱلصَّلَوٰةِ ٱلۡوُسۡطَىٰ وَقُومُواْ لِلَّهِ قَٰنِتِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":245,"juzNumber":2,"footnotes":"[40] Me këtë varg Zoti na urdhëron të falim namazin, sepse, mosfalja e tij është gjynah i madh. Duhet penduar dhe kërkuar falje shumë herë prej Zotit. Ndër kushtet e fesë islame, i pari është besimi që Zoti është Një dhe se Muhamedi (a.s.), është Profeti i Tij. Kushti i dytë, është falja e namazit; kushti i tretë është dhënia e zekatit (lëmoshës së detyrueshme). Falja e namazit është lutja më e madhe e anës shpirtërore. Zekati është mirësia më e madhe shoqërore. Ai që e studion domethënien e zekatit, e kupton hollësisht këtë gjest të madh shoqëror e fetar të pashembullt. Prandaj, zekati e namazi përmenden krahas në Kuran, në më se 60 vende. Në shumë pjesë të tjera të Kuranit, ato përmenden veç e veç (përkthyesi).","lang":"sq","version":{"key":"albanian_nahi","direction":"ltr","language_iso_code":"sq","version":"1.1.0","last_update":1576962000,"title":"Albanian Translation - Hasan Nahi","description":"Translation of the Quran meanings into Albanian by Hasan Nahi, published by Albanian Institute of Islamic Thought and Civilization, printed in 2006."},"meta":{"transliteration":"ḥāfiẓū ʿalā al-ṣalawāti wal-ṣalati al-wus'ṭā waqūmū lillahi qānitīna ","translations":["Guard strictly","[on]","the prayers","and the prayer ","[the] middle","and stand up","for Allah","devoutly obedient","(238)"],"transliterationArr":["ḥāfiẓū","ʿalā","al-ṣalawāti","wal-ṣalati","al-wus'ṭā","waqūmū","lillahi","qānitīna",null],"verseTiming":[[1,0,940],[2,940,1260],[3,1260,2440],[4,2440,3540],[5,3540,4480],[6,4480,5350],[7,5350,6290],[8,6290,8495]]}}