{"name":"2:3","price":"të cilët besojnë në të fshehtën,[11] falin namazin[12] dhe japin[13] nga ajo që u kemi dhënë Ne;","arabic":"ٱلَّذِينَ يُؤۡمِنُونَ بِٱلۡغَيۡبِ وَيُقِيمُونَ ٱلصَّلَوٰةَ وَمِمَّا رَزَقۡنَٰهُمۡ يُنفِقُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":10,"juzNumber":1,"footnotes":"[11] “të fshehtën”: ky është përkthimi i fjalës “gajb” që përfshin gjithçka që është përtej perceptimeve njerëzore dhe e pakapshme nga arsyeja e thjeshtë, si p.sh.: ringjallja, Xheneti (Parajsa), Xhehenemi (Ferri), paracaktimi hyjnor etj. Të gjitha këto gjëra janë përtej mendjes sonë dhe zbulohen vetëm nëpërmjet Shpalljes Hyjnore.\n[12] Namazi është shtylla e dytë e Islamit. Ai është një ritual i posaçëm i përbërë nga leximi i pjesëve të caktuara prej Kuranit dhe nga recitime lavdesh e lutjesh për Zotin, të kombinuara me lëvizje të veçanta. Namazi është i detyrueshëm të kryhet nga çdo besimtar pesë herë në ditë në kohë të caktuara.\n[13] Vargu bën fjalë për çdo lloj shpenzimi në të mirë të njerëzve, përfshirë këtu edhe zekatin – 1/40 e pasurisë –, që është detyrim financiar për çdo mysliman të pasur.","lang":"sq","version":{"key":"albanian_nahi","direction":"ltr","language_iso_code":"sq","version":"1.1.0","last_update":1576962000,"title":"Albanian Translation - Hasan Nahi","description":"Translation of the Quran meanings into Albanian by Hasan Nahi, published by Albanian Institute of Islamic Thought and Civilization, printed in 2006."},"meta":{"transliteration":"alladhīna yu'minūna bil-ghaybi wayuqīmūna al-ṣalata wamimmā razaqnāhum yunfiqūna ","translations":["Those who","believe","in the unseen","and establish","the prayer","and out of what","We have provided them","they spend","(3)"],"transliterationArr":["alladhīna","yu'minūna","bil-ghaybi","wayuqīmūna","al-ṣalata","wamimmā","razaqnāhum","yunfiqūna",null],"verseTiming":[[1,0,1040],[2,1040,2190],[3,2190,3090],[4,3090,4260],[5,4260,5220],[6,5220,6580],[7,6580,7990],[8,7990,11365]]}}