{"name":"2:73","price":"Ne ju thamë: “Prekeni të vrarin me një copë të lopës së flijuar!”[22] Dhe kështu, Allahu do t’i ngjallë të vdekurit dhe do t’ju tregojë mrekullitë e veta, që ju të kuptoni.","arabic":"فَقُلۡنَا ٱضۡرِبُوهُ بِبَعۡضِهَاۚ كَذَٰلِكَ يُحۡيِ ٱللَّهُ ٱلۡمَوۡتَىٰ وَيُرِيكُمۡ ءَايَٰتِهِۦ لَعَلَّكُمۡ تَعۡقِلُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":80,"juzNumber":1,"footnotes":"[22] Sipas komentuesve, një nga bijtë e Israilit vrau të birin e xhaxhait, për t’i marrë pasurinë dhe këtë vrasje ia veshi një fisi tjetër. Këto dy fise u çuan për të luftuar njëri-tjetrin dhe përbënin një të gjashtën e bijve të Israilit. Ata iu drejtuan Musait (a.s.) për ta sqaruar këtë çështje. Në fillim, duke u mbështetur në mendimin e vet të natyrshëm, populli nuk e pranoi menjëherë urdhrin e Zotit për të therur një lopë. Pastaj, u detyrua dhe e pranoi atë. Ata e therën lopën dhe e prekën të vrarin me mishin e saj. Ai u ngjall dhe tregoi se kush e kishte vrarë. Nga kjo ngjarje kuptojmë se Zoti është Fuqiplotë, ka fuqi t’i ringjallë të vdekurit; është Mëshirues i Madh dhe dërgon profetë për t’i udhëzuar njerëzit. Po ashtu, historia na tregon se populli i bijve të Israilit shpesh nuk e dëgjonte profetin e vet, Musain a.s. (përkthyesi).","lang":"sq","version":{"key":"albanian_nahi","direction":"ltr","language_iso_code":"sq","version":"1.1.0","last_update":1576962000,"title":"Albanian Translation - Hasan Nahi","description":"Translation of the Quran meanings into Albanian by Hasan Nahi, published by Albanian Institute of Islamic Thought and Civilization, printed in 2006."},"meta":{"transliteration":"faqul'nā iḍ'ribūhu bibaʿḍihā kadhālika yuḥ'yī al-lahu al-mawtā wayurīkum āyātihi laʿallakum taʿqilūna ","translations":["So We said","Strike him","with a part of it","Like this","revives","Allah","the dead","and shows you","His Signs","perhaps you may","use your intellect","(73)"],"transliterationArr":["faqul'nā","iḍ'ribūhu","bibaʿḍihā","kadhālika","yuḥ'yī","al-lahu","al-mawtā","wayurīkum","āyātihi","laʿallakum","taʿqilūna",null],"verseTiming":[[1,0,920],[2,920,2000],[3,2000,3220],[4,3220,4600],[5,4600,5230],[6,5230,5980],[7,5980,6960],[8,6960,8140],[9,8140,9490],[10,9490,10680],[11,10680,13255]]}}