{"name":"33:30","price":"O gratë e të Dërguarit! Ato prej jush që bëjnë ndonjë turp të hapur, do të kenë ndëshkim të dyfishtë; kjo për Allahun është e lehtë.[261]","arabic":"يَٰنِسَآءَ ٱلنَّبِيِّ مَن يَأۡتِ مِنكُنَّ بِفَٰحِشَةٖ مُّبَيِّنَةٖ يُضَٰعَفۡ لَهَا ٱلۡعَذَابُ ضِعۡفَيۡنِۚ وَكَانَ ذَٰلِكَ عَلَى ٱللَّهِ يَسِيرٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab","Chapter Al-Ahzab","Ahzab","Surah Ahzab","Chapter Ahzab","Al Ahzab","Surah Al Ahzab","Chapter Al Ahzab","Surah 33","Chapter 33","The Combined Forces","الأحزَاب"],"ayahNumber":3563,"juzNumber":21,"footnotes":"[261] Zoti i këshillon femrat, duke marrë shembull, së pari, gratë e Profetit a.s., e mandej edhe të gjitha gratë e besimtarëve. Ai i urdhëroi ato që të mos e kundërshtonin Profetin a.s. në asnjë mënyrë. Kështu, ato gra të Profetit që bënin vepra të mira, shpërbleheshin dyfish. Gratë e Profetit, meqë kishin mësuar në shtëpinë e tij, kanë pasur për detyrë që t’i këshillonin gratë e popullit. Nga këto kuptojmë se njerëzit e mëdhenj të fesë, kur bëjnë një punë të mirë, shpërblehen dyfish. Nga ana tjetër, për një punë të keqe - dënohen dyfish. Pra, burrat e gratë që janë shembull në popull, në pikëpamje të fesë, për ata shpërblimi, si dhe dënimi është i dyfishtë. Kurse, të gjithë të tjerët - burra e gra, - janë në pozitë të barabartë (përkthyesi).","lang":"sq","version":{"key":"albanian_nahi","direction":"ltr","language_iso_code":"sq","version":"1.1.0","last_update":1576962000,"title":"Albanian Translation - Hasan Nahi","description":"Translation of the Quran meanings into Albanian by Hasan Nahi, published by Albanian Institute of Islamic Thought and Civilization, printed in 2006."},"meta":{"transliteration":"yānisāa al-nabiyi man yati minkunna bifāḥishatin mubayyinatin yuḍāʿaf lahā al-ʿadhābu ḍiʿ'fayni wakāna dhālika ʿalā al-lahi yasīran ","translations":["O wives","(of) the Prophet","Whoever","commits","from you","immorality","clear","will be doubled","for her","the punishment","two fold","And that is","And that is","for","Allah","easy","(30)"],"transliterationArr":["yānisāa","al-nabiyi","man","yati","minkunna","bifāḥishatin","mubayyinatin","yuḍāʿaf","lahā","al-ʿadhābu","ḍiʿ'fayni","wakāna","dhālika","ʿalā","al-lahi","yasīran",null],"verseTiming":[[1,0,2560],[2,2560,4150],[3,4150,4450],[4,4450,5720],[5,5720,7840],[6,7840,9010],[7,9010,11130],[8,11130,12450],[9,12450,12850],[10,12850,13840],[11,13840,14840],[12,14840,17040],[13,17040,17840],[14,17840,18100],[15,18100,18960],[16,18960,20295]]}}