{"name":"4:34","price":"Meshkujt kanë autoritet mbi gratë, meqë Allahu u ka dhënë disa cilësi mbi ato dhe, meqë ata shpenzojnë për mbajtjen e tyre. Gra të mira janë ato të dëgjueshmet, që ruajnë fshehtësitë që ka urdhëruar Allahu. Sa i përket grave që ju i druheni mosbindjes dhe sjelljes së keqe nga ana e tyre, këshillojini, (e, nëse kjo s’bën dobi) mos i pranoni në shtrat dhe (në fund) i rrihni ato (lehtas). Por, nëse ato ju binden, atëherë mos i ndëshkoni më. Allahu, me të vërtetë, është i Lartësuar dhe i Madhëruar![61]","arabic":"ٱلرِّجَالُ قَوَّٰمُونَ عَلَى ٱلنِّسَآءِ بِمَا فَضَّلَ ٱللَّهُ بَعۡضَهُمۡ عَلَىٰ بَعۡضٖ وَبِمَآ أَنفَقُواْ مِنۡ أَمۡوَٰلِهِمۡۚ فَٱلصَّٰلِحَٰتُ قَٰنِتَٰتٌ حَٰفِظَٰتٞ لِّلۡغَيۡبِ بِمَا حَفِظَ ٱللَّهُۚ وَٱلَّٰتِي تَخَافُونَ نُشُوزَهُنَّ فَعِظُوهُنَّ وَٱهۡجُرُوهُنَّ فِي ٱلۡمَضَاجِعِ وَٱضۡرِبُوهُنَّۖ فَإِنۡ أَطَعۡنَكُمۡ فَلَا تَبۡغُواْ عَلَيۡهِنَّ سَبِيلًاۗ إِنَّ ٱللَّهَ كَانَ عَلِيّٗا كَبِيرٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":527,"juzNumber":5,"footnotes":"[61] Deri para disa kohësh, në shumë vende të botës ndalohej shkurorëzimi (i gruas), kurse feja islame e ka lejuar shkurorëzimin (e gruas), qysh para 14 shekujsh. Por, kjo vepër është shumë e urryer nga Zoti dhe Ai ka përcaktuar disa norma për ta penguar këtë akt. Këto janë: 1. këshillimi i gruas; 2. të larguarit prej dhomës së saj, për një kohë të shkurtër; 3. qortimi i gruas në mënyrë edukuese; 4. nëse mosmarrëveshja është më e madhe ndërmjet tyre, duhet formuar një këshill të përbashkët pajtimi prej anës së burrit e të gruas, për t’i pajtuar ata; 5. nëse nuk kanë sukses as këto masa, atëherë arsyetohet shkurorëzimi; 6. nëse pajtohen e kurorëzohen përsëri, ndërsa pas pak kohe shkurorëzohen për së dyti, prapë lejohet kurorëzimi. Nëse shkurorëzimi ndodh tri herë, ata nuk mund të kurorëzohen për të katërtën herë, pa u martuar me njerëz prej familjesh të tjera (përkthyesi).","lang":"sq","version":{"key":"albanian_nahi","direction":"ltr","language_iso_code":"sq","version":"1.1.0","last_update":1576962000,"title":"Albanian Translation - Hasan Nahi","description":"Translation of the Quran meanings into Albanian by Hasan Nahi, published by Albanian Institute of Islamic Thought and Civilization, printed in 2006."},"meta":{"transliteration":"al-rijālu qawwāmūna ʿalā al-nisāi bimā faḍḍala al-lahu baʿḍahum ʿalā baʿḍin wabimā anfaqū min amwālihim fal-ṣāliḥātu qānitātun ḥāfiẓātun lil'ghaybi bimā ḥafiẓa al-lahu wa-allātī takhāfūna nushūzahunna faʿiẓūhunna wa-uh'jurūhunna fī al-maḍājiʿi wa-iḍ'ribūhunna fa-in aṭaʿnakum falā tabghū ʿalayhinna sabīlan inna al-laha kāna ʿaliyyan kabīran ","translations":["[The] men","(are) protectors","of","the women","because","(has) bestowed","Allah","some of them","over","others","and because","they spend","from","their wealth","So the righteous women","(are) obedient","guarding","in the unseen","that which","(orders) them to guard","(by) Allah","And those (from) whom","you fear","their ill-conduct","then advise them","and forsake them","in","the bed","and [finally] strike them","Then if","they obey you","then (do) not","seek","against them","a way","Indeed","Allah","is","Most High","Most Great","(34)"],"transliterationArr":["al-rijālu","qawwāmūna","ʿalā","al-nisāi","bimā","faḍḍala","al-lahu","baʿḍahum","ʿalā","baʿḍin","wabimā","anfaqū","min","amwālihim","fal-ṣāliḥātu","qānitātun","ḥāfiẓātun","lil'ghaybi","bimā","ḥafiẓa","al-lahu","wa-allātī","takhāfūna","nushūzahunna","faʿiẓūhunna","wa-uh'jurūhunna","fī","al-maḍājiʿi","wa-iḍ'ribūhunna","fa-in","aṭaʿnakum","falā","tabghū","ʿalayhinna","sabīlan","inna","al-laha","kāna","ʿaliyyan","kabīran",null],"verseTiming":[[1,0,1450],[2,1450,2890],[3,2890,3300],[4,3300,6219],[5,6219,6769],[6,6769,7549],[7,7549,8509],[8,8509,9529],[9,9529,10239],[10,10239,11629],[11,11629,13699],[12,13699,15099],[13,15099,15499],[14,15499,16889],[15,16889,18949],[16,18949,20309],[17,20309,21669],[18,21669,22929],[19,22929,23469],[20,23469,24039],[21,24039,26649],[22,26649,27879],[23,27879,29149],[24,29149,30879],[25,30879,32979],[26,32979,34979],[27,34979,35199],[28,35199,36519],[29,36519,38759],[30,38759,39819],[31,39819,41109],[32,41109,41719],[33,41719,42649],[34,42649,44659],[35,44659,46229],[36,46229,47509],[37,47509,48419],[38,48419,49029],[39,49029,50639],[40,50639,52324]]}}