{"name":"9:37","price":"Vërtet, muaji shtesë është vetëm shtesë në mosbesim. Për shkak të tij jobesimtarët shkojnë në humbje: një vit e quajnë të lejueshëm e vitin tjetër, të ndaluar, për të plotësuar numrin e muajve që i ka ndaluar Allahu.[124] Kështu, ata lejojnë atë që ka ndaluar Allahu. Atyre u duken të bukura veprat e tyre të shëmtuara. Allahu nuk i udhëzon në rrugë të drejtë njerëzit jobesimtarë.","arabic":"إِنَّمَا ٱلنَّسِيٓءُ زِيَادَةٞ فِي ٱلۡكُفۡرِۖ يُضَلُّ بِهِ ٱلَّذِينَ كَفَرُواْ يُحِلُّونَهُۥ عَامٗا وَيُحَرِّمُونَهُۥ عَامٗا لِّيُوَاطِـُٔواْ عِدَّةَ مَا حَرَّمَ ٱللَّهُ فَيُحِلُّواْ مَا حَرَّمَ ٱللَّهُۚ زُيِّنَ لَهُمۡ سُوٓءُ أَعۡمَٰلِهِمۡۗ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلۡكَٰفِرِينَ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1272,"juzNumber":10,"footnotes":"[124] Ky varg është themelor për sa i përket përkufizimit islam të ndarjes së kohës. Kalendari hënor përmban 354 ditë, 11 më pak se ai diellor (12 kur viti është i brishtë). Për këtë arsye, astronomët e periudhës paraislame shtonin një muaj në çdo tre vjet, duke rivënë harmoninë midis kalendarit hënor dhe atij diellor. Përveç arsyeve astronomike, ky muaj shtesë shërbente për t’u ndërfutur edhe midis muajve të shenjtë – gjatë të cilëve nuk lejohej lufta – me qëllim që plaçkitësit të kishin pretekst për të sulmuar karvanët e haxhilerëve, duke pretenduar se ishin në kohën që lejohej lufta. Një aspekt tjetër i kësaj reforme të kalendarit, është muaji i agjërimit, ramazani, i cili çdo vit fillon 11-12 ditë më herët se vitin paraardhës, duke bërë që në 33 vjet, ai të bëjë një xhiro të plotë të kalendarit diellor. Me vendosjen e këtij ligji që ka vlerë të përgjithshme, Allahu i Madhëruar, me dijen e Tij, ka zhdukur çdo mundësi pabarazie në trajtim midis myslimanëve që jetojnë në pjesë të ndryshme të botës. Nëse muaji i agjërimit do të ecte sipas kalendarit diellor, disa besimtarë do të agjëronin gjithnjë në periudha të nxehta me ditë të gjata, kurse disa të tjerë do të agjëronin në ditë të freskëta e të shkurtra, pra, me më pak angazhim dhe meritë.","lang":"sq","version":{"key":"albanian_nahi","direction":"ltr","language_iso_code":"sq","version":"1.1.0","last_update":1576962000,"title":"Albanian Translation - Hasan Nahi","description":"Translation of the Quran meanings into Albanian by Hasan Nahi, published by Albanian Institute of Islamic Thought and Civilization, printed in 2006."},"meta":{"transliteration":"innamā al-nasīu ziyādatun fī al-kuf'ri yuḍallu bihi alladhīna kafarū yuḥillūnahu ʿāman wayuḥarrimūnahu ʿāman liyuwāṭiū ʿiddata mā ḥarrama al-lahu fayuḥillū mā ḥarrama al-lahu zuyyina lahum sūu aʿmālihim wal-lahu lā yahdī al-qawma al-kāfirīna ","translations":["Indeed","the postponing","(is) an increase","in","the disbelief","are led astray","by it","those who","disbelieve","They make it lawful","one year","and make it unlawful","(another) year","to adjust","the number","which","Allah has made unlawful","Allah has made unlawful","and making lawful","what","Allah has made unlawful","Allah has made unlawful","Is made fair-seeming","to them","(the) evil","(of) their deeds","And Allah","(does) not","guide","the people ","the disbelievers","(37)"],"transliterationArr":["innamā","al-nasīu","ziyādatun","fī","al-kuf'ri","yuḍallu","bihi","alladhīna","kafarū","yuḥillūnahu","ʿāman","wayuḥarrimūnahu","ʿāman","liyuwāṭiū","ʿiddata","mā","ḥarrama","al-lahu","fayuḥillū","mā","ḥarrama","al-lahu","zuyyina","lahum","sūu","aʿmālihim","wal-lahu","lā","yahdī","al-qawma","al-kāfirīna",null],"verseTiming":[[1,0,1600],[2,1600,5000],[3,5000,6920],[4,6920,7340],[5,7340,8080],[6,8080,9570],[7,9570,10000],[8,10000,11030],[9,11030,11970],[10,11970,13740],[11,13740,15510],[12,15510,17640],[13,17640,18500],[14,18500,20340],[15,20340,22400],[16,22400,23400],[17,23400,23770],[18,23770,24630],[19,24630,25620],[20,25620,26980],[21,26980,27400],[22,27400,28290],[23,28290,31230],[24,31230,32180],[25,32180,32700],[26,32700,34790],[27,34790,36860],[28,36860,38030],[29,38030,38590],[30,38590,39340],[31,39340,40260],[32,40260,44825]]}}