{"name":"2:115","price":"A Allahov je i istok i zapad; kuda god se okrenete, pa - tamo je Allahova kibla i strana. [1] Allah je, doista, neizmjerno darežljiv i Sveznajući.","arabic":"وَلِلَّهِ ٱلۡمَشۡرِقُ وَٱلۡمَغۡرِبُۚ فَأَيۡنَمَا تُوَلُّواْ فَثَمَّ وَجۡهُ ٱللَّهِۚ إِنَّ ٱللَّهَ وَٰسِعٌ عَلِيمٞ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":122,"juzNumber":1,"footnotes":"[1] Allahu pripada vlast nad istokom i zapadom i nad onim između istoka i zapada, pa u kojem god pravcu da se okrenete, vi se ka Njemu okrećete. Ako vam naredi da se okrenete prema Kudsu ili prema Kabi, ili pogriješite u određivanju pravca kible, ili vam je teško da se okrenete ka kibli, nećete biti koreni zbog toga, jer svi pravci pripadaju Allahu. Allah je neizmjerno darežljiv, sva Svoja stvorenja obuhvata milošću i svima olakšava. On zna njihove namjere i ono što čine. Riječ vedžh koja se spominje ovdje, odnosi se, dakle na Allahovu kiblu i stranu, ali ne isključuje i značenje koje se odnosi na Allahovo lice koje je onako kako Njemu dolikuje.","lang":"bs","version":{"key":"bosnian_rwwad","direction":"ltr","language_iso_code":"bs","version":"2.0.2","last_update":1706781490,"title":"Bosnian translation - Rowwad Translation Center","description":"Translation of the Quran meanings into Bosnian by Rowwad Translation Center with cooperation with Islamhouse.com"},"meta":{"transliteration":"walillahi al-mashriqu wal-maghribu fa-aynamā tuwallū fathamma wajhu al-lahi inna al-laha wāsiʿun ʿalīmun ","translations":["And for Allah","(is) the east","and the west","so wherever","you turn","[so] there","(is the) face","(of) Allah","Indeed","Allah","(is) All-Encompassing","All-Knowing","(115)"],"transliterationArr":["walillahi","al-mashriqu","wal-maghribu","fa-aynamā","tuwallū","fathamma","wajhu","al-lahi","inna","al-laha","wāsiʿun","ʿalīmun",null],"verseTiming":[[1,0,1350],[2,1350,2270],[3,2270,3500],[4,3500,5010],[5,5010,6020],[6,6020,7450],[7,7450,7960],[8,7960,10740],[9,10740,11770],[10,11770,12680],[11,12680,13660],[12,13660,15755]]}}