{"name":"16:90","price":"90. Iš tiesų, Allahas įsako Al-Adl (t. y. teisingumą ir negarbinimą nieko kito, tik Allahą Vienintelį – islamiškąjį monoteizmą) ir Al-Ihsan [t. y. būti kantriems, atliekant savo pareigas Allahui, absoliučiai tik dėl Allaho ir pagal Pranašo ﷺ sunną (teisines tradicijas) tobuliausiu būdu] ir (pagalbos) davimą pažįstamiems ir giminėms [5] (t. y. viso to, ką Allahas įsakė jums jiem suteikti, pvz. turtą, jų lankymą, jų priežiūrą ir globą bei bet kokią kitą pagalbą), ir draudžia Al-Fahša (t. y. visus blogus poelgius, pvz. neleistinus lytinius santykius, nepaklusnumą tėvams, daugiadievystę, melavimą, melagingus liudijimus, neteisėtą gyvybės atėmimą) ir Al-Munkar (t. y. viską, ką draudžia islamo teisė – visų rūšių daugiadievystę, netikėjimą ir visų rūšių blogus poelgius) ir Al-Baghi (t. y. visų rūšių priespaudą). Jis perspėja jus tam, kad būtumėte atidūs.","arabic":"۞ إِنَّ ٱللَّهَ يَأۡمُرُ بِٱلۡعَدۡلِ وَٱلۡإِحۡسَٰنِ وَإِيتَآيِٕ ذِي ٱلۡقُرۡبَىٰ وَيَنۡهَىٰ عَنِ ٱلۡفَحۡشَآءِ وَٱلۡمُنكَرِ وَٱلۡبَغۡيِۚ يَعِظُكُمۡ لَعَلَّكُمۡ تَذَكَّرُونَ","category":["16 (An-Nahl)","An-Nahl","Surah An-Nahl","Chapter An-Nahl","Nahl","Surah Nahl","Chapter Nahl","An Nahl","Surah An Nahl","Chapter An Nahl","Surah 16","Chapter 16","The Bee","النَّحل"],"ayahNumber":1991,"juzNumber":14,"footnotes":"[5] Giminystės eiliškumas: visų pirma, jūsų tėvai, tada jūsų palikuonys, tada jūsų broliai ir seserys, tada jūsų dėdės ir tetos iš tėvo pusės, tada jūsų dėdės ir tetos iš motinos pusės, o tada kiti giminaičiai.","lang":"lt","version":{"key":"lithuanian_rwwad","direction":"ltr","language_iso_code":"lt","version":"1.0.5","last_update":1686208518,"title":"Lithuanian Translation","description":"Translation of the Quran meanings into Lithuanian By Rowwad Translation Center with cooperation with Islamhouse.com"},"meta":{"transliteration":"inna al-laha yamuru bil-ʿadli wal-iḥ'sāni waītāi dhī al-qur'bā wayanhā ʿani al-faḥshāi wal-munkari wal-baghyi yaʿiẓukum laʿallakum tadhakkarūna ","translations":["Indeed","Allah","commands","justice","and the good","and giving","(to) relatives","(to) relatives","and forbids","[from]","the immorality","and the bad","and the oppression","He admonishes you","so that you may","take heed","(90)"],"transliterationArr":["inna","al-laha","yamuru","bil-ʿadli","wal-iḥ'sāni","waītāi","dhī","al-qur'bā","wayanhā","ʿani","al-faḥshāi","wal-munkari","wal-baghyi","yaʿiẓukum","laʿallakum","tadhakkarūna",null],"verseTiming":[[1,0,1150],[2,1150,1990],[3,1990,2890],[4,2890,3900],[5,3900,5250],[6,5250,8130],[7,8130,8330],[8,8330,9310],[9,9310,10280],[10,10280,10660],[11,10660,13690],[12,13690,15660],[13,15660,16370],[14,16370,18130],[15,18130,19450],[16,19450,22365]]}}