{"name":"21:98","price":"98. Be abejonės jūs (netikintieji) ir tie, ką jūs dabar garbinate šalia Allaho, yra (tik) pakuros Pragarui! (Iš tiesų), jūs į jį įžengsite. [4]","arabic":"إِنَّكُمۡ وَمَا تَعۡبُدُونَ مِن دُونِ ٱللَّهِ حَصَبُ جَهَنَّمَ أَنتُمۡ لَهَا وَٰرِدُونَ","category":["21 (Al-Anbiya)","Al-Anbiya","Surah Al-Anbiya","Chapter Al-Anbiya","Anbiya","Surah Anbiya","Chapter Anbiya","Al Anbiya","Surah Al Anbiya","Chapter Al Anbiya","Surah 21","Chapter 21","The Prophets","الأنبيَاء"],"ayahNumber":2581,"juzNumber":17,"footnotes":"[4] Kai buvo apreikštas šis Allaho teiginys: „Be abejonės jūs (netikintieji) ir tie, ką jūs dabar garbinate šalia Allaho, yra (tik) pakuros Pragarui! (Iš tiesų), jūs į jį įžengsite.“ Kuraiš pagonys nudžiugo ir tarė: „Mes pamaloninti būti su savo dievais Pragaro Liepsnose, nes stabai bus stabmeldžiais (Pragare), o Isa (Jėzus), Marjamos (Marijos) sūnus bus su savo garbintojais (t. y. Pragare) ir t.t.“ Taigi (paaiškindamas klaidingą supratimą) Allahas apreiškė kitą eilutę (kad paneigtų ir atmestų jų teiginį): „Iš tiesų, tie, kuriems Mūsų gėris tapo pirmesnis, jie bus atitolinti toli nuo to (Pragaro) [t. y. Isa (Jėzus, Marjamos (Marijos) sūnus, Uzair (Ezra)].“ (21:101)","lang":"lt","version":{"key":"lithuanian_rwwad","direction":"ltr","language_iso_code":"lt","version":"1.0.5","last_update":1686208518,"title":"Lithuanian Translation","description":"Translation of the Quran meanings into Lithuanian By Rowwad Translation Center with cooperation with Islamhouse.com"},"meta":{"transliteration":"innakum wamā taʿbudūna min dūni al-lahi ḥaṣabu jahannama antum lahā wāridūna ","translations":["Indeed, you","and what","you worship","besides Allah","besides Allah","besides Allah","(are) firewood","(of) Hell","You","to it","will come","(98)"],"transliterationArr":["innakum","wamā","taʿbudūna","min","dūni","al-lahi","ḥaṣabu","jahannama","antum","lahā","wāridūna",null],"verseTiming":[[1,0,1660],[2,1660,2260],[3,2260,3390],[4,3390,4380],[5,4380,5400],[6,5400,6210],[7,6210,6900],[8,6900,8350],[9,8350,9770],[10,9770,10470],[11,10470,13425]]}}