{"name":"2:3","price":"3. kurie tiki į Ghaib [1] ir atlieka As-Salat (Ikamat-as-Salat), [2] ir leidžia iš to, ką Mes jiems suteikėme [t. y. duoda Zakat [3], leidžia savo, savo tėvų, vaikų, žmonų ir t. t. naudai, ir taip pat duoda labdarą neturtingiesiems ir taip pat dėl Allaho atlieka Džihadą [4] ir pan.].","arabic":"ٱلَّذِينَ يُؤۡمِنُونَ بِٱلۡغَيۡبِ وَيُقِيمُونَ ٱلصَّلَوٰةَ وَمِمَّا رَزَقۡنَٰهُمۡ يُنفِقُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":10,"juzNumber":1,"footnotes":"[1] Al-Ghaib: tiesiogiai tai reiškia „nematomas daiktas“, tačiau šis žodis turi daug prasmių – tai tikėjimas Allahą, angelus, Knygas, Allaho pasiuntinius, Prikėlimo dieną ir Al-Kadar (Dieviškąjį Nulėmimą). Jo reikšmė taip pat apima tai, ką Allahas ir Jo Pasiuntinys ﷺ pranešė apie praeities, dabarties ir ateities dalykus, t. y. žinios apie dangų ir žemės sukūrimą, augmenijos ir gyvūnijos gyvenimą, žinios apie buvusias tautas bei apie Rojų ir Pragarą.\n[2] Ikamat-as-Salat: salat (maldų) atlikimas.\n[3] Zakat: nuo tam tikros nustatytos turto dalies, o taip pat ir nuo kiekvienos nuosavybės rūšies musulmonas turi kasmet mokėti zakat musulmonų bendruomenės neturtingųjų naudai. Zakat mokėjimas yra privalomas, nes tai vienas iš penkių islamo ramsčių. Zakat yra svarbi ekonominė priemonė, kuri užtikrina socialinį teisingumą ir suteikia musulmonų bendruomenei klestėjimą bei saugumą. (Žr. Sahih Al-Bukhari, t. 2, „Zakat knyga“, hadisas Nr. 24).\n[4] Džihadas: reiškia stengimąsi arba pastangas. Pirmiausia, tai yra kiekvieno musulmono asmeninės pastangos kovojant su savo vidiniu aš, stengimasis skatinant tai, kas yra gera ir draudžiant tai, kas yra bloga. Antra, tai gali reikšti fizines pastangas.","lang":"lt","version":{"key":"lithuanian_rwwad","direction":"ltr","language_iso_code":"lt","version":"1.0.5","last_update":1686208518,"title":"Lithuanian Translation","description":"Translation of the Quran meanings into Lithuanian By Rowwad Translation Center with cooperation with Islamhouse.com"},"meta":{"transliteration":"alladhīna yu'minūna bil-ghaybi wayuqīmūna al-ṣalata wamimmā razaqnāhum yunfiqūna ","translations":["Those who","believe","in the unseen","and establish","the prayer","and out of what","We have provided them","they spend","(3)"],"transliterationArr":["alladhīna","yu'minūna","bil-ghaybi","wayuqīmūna","al-ṣalata","wamimmā","razaqnāhum","yunfiqūna",null],"verseTiming":[[1,0,1040],[2,1040,2190],[3,2190,3090],[4,3090,4260],[5,4260,5220],[6,5220,6580],[7,6580,7990],[8,7990,11365]]}}