{"name":"1:1","price":"(1) In the name of Allāh,[2] the Entirely Merciful, the Especially Merciful.[3]","arabic":"بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah","Chapter Al-Fatihah","Fatihah","Surah Fatihah","Chapter Fatihah","Al Fatihah","Surah Al Fatihah","Chapter Al Fatihah","Surah 1","Chapter 1","The Opening","الفَاتِحَة"],"ayahNumber":1,"juzNumber":1,"footnotes":"[2]- Allāh is a proper name belonging only to the one Almighty God, Creator and Sustainer of the heavens and the earth and all that is within them, the Eternal and Absolute, to whom alone all worship is due.\n[3]- Ar-Raḥmān and ar-Raḥeem are two names of Allāh derived from the word \"raḥmah\" (mercy) . In Arabic grammar both are intensive forms of \"merciful\" (i.e., extremely merciful) . A complimentary and comprehensive meaning is intended by using both together. Raḥmān is used only to describe Allāh, while raḥeem might be used to describe a person as well. The Prophet (ﷺ) was described in the Qur’ān as raḥeem. Raḥmān is above the human level (i.e., intensely merciful) . Since one usually understands intensity to be something of short duration, Allāh describes Himself also as raḥeem (i.e., continually merciful) . Raḥmān also carries a wider meaning - merciful to all creation. Justice is a part of this mercy. Raḥeem includes the concept of speciality - especially and specifically merciful to the believers. Forgiveness is a part of this mercy. In addition, Raḥmān is adjectival, referring to an attribute of Allāh and is part of His essence. Raḥeem is verbal, indicating what He does: i.e., bestowing and implementing mercy.","lang":"en","version":{"key":"english_saheeh","direction":"ltr","language_iso_code":"en","version":"1.1.1","last_update":1658318019,"title":"English Translation - Saheeh International","description":"Translation of the Quran meanings into English - Saheeh International - Al-Muntada Al-Islami (Islamic Forum)"},"meta":{"transliteration":"bis'mi al-lahi al-raḥmāni al-raḥīmi ","translations":["In (the) name","(of) Allah","the Most Gracious","the Most Merciful","(1)"],"transliterationArr":["bis'mi","al-lahi","al-raḥmāni","al-raḥīmi",null],"verseTiming":[[1,0,580],[2,580,1409],[3,1409,2502],[4,2502,5840]]}}