{"name":"12:106","price":"La mayoría de los que creen en Dios caen en dedicarle actos de adoración a otros.","arabic":"وَمَا يُؤۡمِنُ أَكۡثَرُهُم بِٱللَّهِ إِلَّا وَهُم مُّشۡرِكُونَ","category":["12 (Yusuf)","Yusuf","Surah Yusuf","Chapter Yusuf","Surah 12","Chapter 12","Joseph","يوسُف"],"ayahNumber":1702,"juzNumber":13,"footnotes":"El objetivo del monoteísmo (Tauhid) no es la sola afirmación del Dominio y el Señorío (Tauhid Ar-Rububiah), es decir, creer en la existencia de Dios y que solo Él es el Creador del Universo, tal como afirman algunos filósofos y teósofos. Éstos consideran que al afirmar este concepto con pruebas han alcanzado, de hecho, el objetivo del monoteísmo en su totalidad. Pero la persona que afirme la existencia de la divinidad y Sus atributos divinos, negando de él cualquier imperfección, no será un monoteísta verdadero hasta que afirme que nada ni nadie merece ser adorado salvo Dios, sin asociados. Porque la palabra “divinidad” implica que merece ser adorado, y no significa solamente que posee el poder de crear. Los que limitan el significado de la palabra “divinidad” al hecho de poseer el poder de crear, haciendo el objetivo del monoteísmo esta sola afirmación, no comprenden la realidad del monoteísmo que enseñó el Profeta Mujámmad, que la paz y las bendiciones de Dios sean con él, porque los árabes politeístas e idólatras de su época afirmaban que Dios era el Creador de todas las cosas, y a pesar de eso el Corán seguía refiriéndose a ellos como idólatras e incrédulos, porque invocaban y adoraban a sus ídolos junto con Dios.","lang":"es","version":{"key":"spanish_garcia","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1681560818,"title":"Spanish Translation - Isa Garcia","description":"Translation of the Quran meanings into Spanish by Muhammad Isa Garcia - Printed in 1433 H."},"meta":{"transliteration":"wamā yu'minu aktharuhum bil-lahi illā wahum mush'rikūna ","translations":["And not","believe","most of them","in Allah","except","while they","associate partners with Him","(106)"],"transliterationArr":["wamā","yu'minu","aktharuhum","bil-lahi","illā","wahum","mush'rikūna",null],"verseTiming":[[1,0,730],[2,730,1600],[3,1600,3480],[4,3480,4480],[5,4480,5370],[6,5370,6090],[7,6090,10375]]}}