{"name":"15:26","price":"He creado al ser humano de arcilla, un barro maleable.","arabic":"وَلَقَدۡ خَلَقۡنَا ٱلۡإِنسَٰنَ مِن صَلۡصَٰلٖ مِّنۡ حَمَإٖ مَّسۡنُونٖ","category":["15 (Al-Hijr)","Al-Hijr","Surah Al-Hijr","Chapter Al-Hijr","Hijr","Surah Hijr","Chapter Hijr","Al Hijr","Surah Al Hijr","Chapter Al Hijr","Surah 15","Chapter 15","The Rock","الحِجر"],"ayahNumber":1828,"juzNumber":14,"footnotes":"Existen numerosas referencias en el Corán a que el ser humano ha sido “creado de arcilla (tin طِين )” o “de tierra (turab تُراب )”, y ambos términos apuntan al humilde origen biológico del ser humano, así como al hecho de que su cuerpo está compuesto de diversas substancias orgánicas e inorgánicas que existen, en otras combinaciones o en sus formas elementales, sobre la tierra o en su interior. El término salsal صَلصَال , que aparece en tres versículos de este capítulo y también en 55:14, añade una nueva dimensión a este concepto. Según la mayoría de los expertos en filología árabe, denota “arcilla seca que produce sonido” (al ser golpeada); y dado que se emplea en el Corán exclusivamente con referencia a la creación del ser humano, parece contener una alusión a su capacidad para el “lenguaje articulado”. Mientras que hama’ حَماء es un “barro” mezcla de tierra y agua, que son otros dos componentes que se mencionan en el Corán relacionados a la creación del ser humano, a lo que se suma el adjetivo masnún مَسْنُون que significa “moldeado” o “maleable”. ","lang":"es","version":{"key":"spanish_garcia","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1681560818,"title":"Spanish Translation - Isa Garcia","description":"Translation of the Quran meanings into Spanish by Muhammad Isa Garcia - Printed in 1433 H."},"meta":{"transliteration":"walaqad khalaqnā al-insāna min ṣalṣālin min ḥama-in masnūnin ","translations":["And verily","We created","humankind","(out) of","sounding clay","from","black mud","altered","(26)"],"transliterationArr":["walaqad","khalaqnā","al-insāna","min","ṣalṣālin","min","ḥama-in","masnūnin",null],"verseTiming":[[1,0,770],[2,770,1570],[3,1570,3550],[4,3550,4890],[5,4890,6060],[6,6060,7240],[7,7240,8010],[8,8010,11485]]}}