{"name":"17:15","price":"Quien siga la guía será en beneficio propio, pero quien se desvíe solo se perjudicará a sí mismo. Nadie cargará con pecados ajenos. No he castigado a ningún pueblo sin antes haberle enviado un Mensajero.","arabic":"مَّنِ ٱهۡتَدَىٰ فَإِنَّمَا يَهۡتَدِي لِنَفۡسِهِۦۖ وَمَن ضَلَّ فَإِنَّمَا يَضِلُّ عَلَيۡهَاۚ وَلَا تَزِرُ وَازِرَةٞ وِزۡرَ أُخۡرَىٰۗ وَمَا كُنَّا مُعَذِّبِينَ حَتَّىٰ نَبۡعَثَ رَسُولٗا","category":["17 (Al-Isra)","Al-Isra","Surah Al-Isra","Chapter Al-Isra","Isra","Surah Isra","Chapter Isra","Al Isra","Surah Al Isra","Chapter Al Isra","Surah 17","Chapter 17","The Night Journey","الإسرَاء"],"ayahNumber":2044,"juzNumber":15,"footnotes":"Acorde a la teología islámica, la persona que oye y comprende correctamente el mensaje del Islam, y conscientemente lo niega o rechaza, es considerado un incrédulo (kafir) y ha de morar eternamente en el fuego del Infierno, y no ha de tener excusa el Día de Resurrección. Pero aquellos que no alcancen a escuchar y comprender el mensaje del Islam por cualquier razón, como vivir en áreas remotas o porque tenían un impedimento físico o psicológico, o porque el mensaje del Islam los alcanzó cuando eran demasiado ancianos para comprender, no serán castigados en el Día de la Resurrección hasta que hayan sido probados. Se menciona en la Tradición Profética que el Mensajero de Dios, que la paz y las bendiciones de Dios sean con él, dijo: “Existen cuatro personas que serán excusadas en el Día de Resurrección: el sordo, el deficiente mental, el anciano, y quien no haya sido alcanzado por el mensaje. El sordo dirá: ‘¡Señor! El mensaje del Islam llegó, pero no pude oírlo’. El deficiente mental dirá: ‘¡Señor! El Islam llegó, pero los jóvenes se burlaban de mí’. El anciano dirá: ‘¡Señor! El Islam llegó, pero yo ya no podía comprender’. Aquel que no tuvo acceso al mensaje dirá: ‘¡Señor! Ningún Mensajero llegó hasta mí’. Entonces Dios les hará jurar obediencia, y luego les ordenará ingresar al fuego [esa será la prueba]. Y por aquel en cuyas manos se encuentra el alma de Mujámmad, cuando entren en él, éste será fresco y seguro para ellos”. Registrado por Ahmad en su libro Al Musnad.","lang":"es","version":{"key":"spanish_garcia","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1681560818,"title":"Spanish Translation - Isa Garcia","description":"Translation of the Quran meanings into Spanish by Muhammad Isa Garcia - Printed in 1433 H."},"meta":{"transliteration":"mani ih'tadā fa-innamā yahtadī linafsihi waman ḍalla fa-innamā yaḍillu ʿalayhā walā taziru wāziratun wiz'ra ukh'rā wamā kunnā muʿadhibīna ḥattā nabʿatha rasūlan ","translations":["Whoever","(is) guided","then only","he is guided","for his soul","And whoever","goes astray","then only","he goes astray","against it","And not","will bear","a bearer of burden","burden","(of) another","And not","We","are to punish","until","We have sent","a Messenger","(15)"],"transliterationArr":["mani","ih'tadā","fa-innamā","yahtadī","linafsihi","waman","ḍalla","fa-innamā","yaḍillu","ʿalayhā","walā","taziru","wāziratun","wiz'ra","ukh'rā","wamā","kunnā","muʿadhibīna","ḥattā","nabʿatha","rasūlan",null],"verseTiming":[[1,0,470],[2,470,1320],[3,1320,3130],[4,3130,4240],[5,4240,5600],[6,5600,7100],[7,7100,7870],[8,7870,9670],[9,9670,10630],[10,10630,11830],[11,11830,12820],[12,12820,13510],[13,13510,15520],[14,15520,16230],[15,16230,17480],[16,17480,18060],[17,18060,19670],[18,19670,21060],[19,21060,22030],[20,22030,22900],[21,22900,24645]]}}