{"name":"18:65","price":"Encontraron a uno de Mis siervos [Al Jidr] a quien había agraciado con Mi misericordia y enseñado ciertos conocimientos [que Moisés no poseía].","arabic":"فَوَجَدَا عَبۡدٗا مِّنۡ عِبَادِنَآ ءَاتَيۡنَٰهُ رَحۡمَةٗ مِّنۡ عِندِنَا وَعَلَّمۡنَٰهُ مِن لَّدُنَّا عِلۡمٗا","category":["18 (Al-Kahf)","Al-Kahf","Surah Al-Kahf","Chapter Al-Kahf","Kahf","Surah Kahf","Chapter Kahf","Al Kahf","Surah Al Kahf","Chapter Al Kahf","Surah 18","Chapter 18","The Cave","الكَهف"],"ayahNumber":2205,"juzNumber":15,"footnotes":"Al Jidr: Al Jidr fue un siervo piadoso que compartió un viaje con el Profeta Moisés. Los sabios consideran que se trataba de un Profeta contemporáneo a Moisés por varias causas: Primero, porque Dios dice que le concedió una misericordia y un conocimiento especial, lo que en lenguaje coránico se utiliza para describir la profecía. Segundo, porque le dijo a Moisés: “Si me sigues, no me preguntes sobre nada que haga hasta que yo te haga mención de ello”. Si no fuera Profeta, no hubiera estado protegido de cometer errores, y no hubiera tenido Moisés –que era uno de los grandes Profetas y un noble Mensajero y estaba exento de errores en la transmisión del Mensaje– que permanecer callado ante las acciones de Al Jidr, que contravenían la legislación que él había recibido de Dios. Tercero, porque Al Jidr quitó la vida a un joven, y esto no podría ser sino por revelación de Dios, porque una persona piadosa no puede decidir quitarle la vida a alguien debido a que sus pensamientos no están exentos del error. Cuarto, porque cuando Al Jidr le explicó sus acciones a Moisés, le aclaró que no había actuado por iniciativa propia, es decir, que no lo había hecho por propia decisión, sino que le había sido ordenado por inspiración.","lang":"es","version":{"key":"spanish_garcia","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1681560818,"title":"Spanish Translation - Isa Garcia","description":"Translation of the Quran meanings into Spanish by Muhammad Isa Garcia - Printed in 1433 H."},"meta":{"transliteration":"fawajadā ʿabdan min ʿibādinā ātaynāhu raḥmatan min ʿindinā waʿallamnāhu min ladunnā ʿil'man ","translations":["Then they found","a servant","from","Our servants","whom We had given","mercy","from","Us","and We had taught him","from","Us","a knowledge","(65)"],"transliterationArr":["fawajadā","ʿabdan","min","ʿibādinā","ātaynāhu","raḥmatan","min","ʿindinā","waʿallamnāhu","min","ladunnā","ʿil'man",null],"verseTiming":[[1,0,1120],[2,1120,1770],[3,1770,2830],[4,2830,5780],[5,5780,7450],[6,7450,8320],[7,8320,9410],[8,9410,11000],[9,11000,12840],[10,12840,13050],[11,13050,14920],[12,14920,16475]]}}