{"name":"18:83","price":"Te preguntan [¡oh, Mujámmad!] acerca de Dhul Qarnain. Diles: \"Voy a relatarles una parte de su historia\".","arabic":"وَيَسۡـَٔلُونَكَ عَن ذِي ٱلۡقَرۡنَيۡنِۖ قُلۡ سَأَتۡلُواْ عَلَيۡكُم مِّنۡهُ ذِكۡرًا","category":["18 (Al-Kahf)","Al-Kahf","Surah Al-Kahf","Chapter Al-Kahf","Kahf","Surah Kahf","Chapter Kahf","Al Kahf","Surah Al Kahf","Chapter Al Kahf","Surah 18","Chapter 18","The Cave","الكَهف"],"ayahNumber":2223,"juzNumber":16,"footnotes":"Dhul Qarnain: Dhul Qarnain significa “el bicorne” o “el de las dos épocas”, ya que el nombre árabe qarn  قَرْن significa tanto “cuerno” como “generación”, “época”, “era” o “siglo”. Los comentaristas clásicos se inclinan por el primero de estos significados. Los “dos cuernos” podrían designar las dos fuentes de poder de que estaba dotado Dhul Qarnain: el poder mundanal y la fuerza espiritual, fruto de su fe en Dios. Esto hace que sea imposible identificar a Dhul Qarnain, como hacen algunos comentaristas, con Alejandro Magno, quien aparece representado en algunos retratos o monedas de la época con dos cuernos, ya que lo que es conocido de ese personaje histórico es que era pagano y, como tal, adoraba a una pluralidad de divinidades, mientras que el Corán representa a Dhul Qarnain como un creyente firme en el Dios Único. Y Dios sabe más.\n","lang":"es","version":{"key":"spanish_garcia","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1681560818,"title":"Spanish Translation - Isa Garcia","description":"Translation of the Quran meanings into Spanish by Muhammad Isa Garcia - Printed in 1433 H."},"meta":{"transliteration":"wayasalūnaka ʿan dhī al-qarnayni qul sa-atlū ʿalaykum min'hu dhik'ran ","translations":["And they ask you","about","Dhul-qarnain","Dhul-qarnain","Say","I will recite","to you","about him","a remembrance","(83)"],"transliterationArr":["wayasalūnaka","ʿan","dhī","al-qarnayni","qul","sa-atlū","ʿalaykum","min'hu","dhik'ran",null],"verseTiming":[[1,0,1770],[2,1770,2810],[3,2810,2960],[4,2960,4290],[5,4290,4700],[6,4700,5870],[7,5870,6800],[8,6800,8440],[9,8440,9795]]}}