{"name":"18:9","price":"¿Acaso consideras [¡oh, Mujámmad!] que la historia de los jóvenes de la caverna y [su devoción por] la escritura fue uno de Mis milagros más sorprendentes?","arabic":"أَمۡ حَسِبۡتَ أَنَّ أَصۡحَٰبَ ٱلۡكَهۡفِ وَٱلرَّقِيمِ كَانُواْ مِنۡ ءَايَٰتِنَا عَجَبًا","category":["18 (Al-Kahf)","Al-Kahf","Surah Al-Kahf","Chapter Al-Kahf","Kahf","Surah Kahf","Chapter Kahf","Al Kahf","Surah Al Kahf","Chapter Al Kahf","Surah 18","Chapter 18","The Cave","الكَهف"],"ayahNumber":2149,"juzNumber":15,"footnotes":"Los exégetas del Corán mencionan distintas interpretaciones sobre la identidad de estos jóvenes creyentes. Una de las versiones es que se trataría de un grupo de judíos, de los siglos inmediatamente anteriores o posteriores al advenimiento de Jesús: la Hermandad de los Esenios y en particular a una de sus ramas, que tenía su asentamiento en las inmediaciones del mar Muerto, apartada de la sociedad, y a la que se ha dado, a raíz del descubrimiento de los Rollos del mar Muerto, el nombre de “la comunidad de Qumrán”. La expresión ar-raqimالرَّقيم que aparece en este versículo coránico, y que he traducido como “escritura”, confirmaría esta interpretación. Así lo menciona el exégeta At-Tabari, que Ibn Abbas consideraba esta expresión sinónima de marqum مَرْقُوم \" algo escrito”, y por ende de kitab كِتَاب \"una escritura” o “un libro”. Dado que está históricamente probado que los miembros de la comunidad de Qumrán estaban dedicados por entero a estudiar, copiar y preservar las sagradas escrituras.","lang":"es","version":{"key":"spanish_garcia","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1681560818,"title":"Spanish Translation - Isa Garcia","description":"Translation of the Quran meanings into Spanish by Muhammad Isa Garcia - Printed in 1433 H."},"meta":{"transliteration":"am ḥasib'ta anna aṣḥāba al-kahfi wal-raqīmi kānū min āyātinā ʿajaban ","translations":["Or","have you thought","that","(the) companions","(of) the cave","and the inscription","were","among","Our Signs","a wonder","(9)"],"transliterationArr":["am","ḥasib'ta","anna","aṣḥāba","al-kahfi","wal-raqīmi","kānū","min","āyātinā","ʿajaban",null],"verseTiming":[[1,0,490],[2,490,1440],[3,1440,2310],[4,2310,3290],[5,3290,4260],[6,4260,5450],[7,5450,6240],[8,6240,6640],[9,6640,8050],[10,8050,9465]]}}