{"name":"1:1","price":"En el nombre de Dios, el Compasivo con toda la creación, el Misericordioso con los creyentes.","arabic":"بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ","category":["1 (Al-Fatihah)","Al-Fatihah","Surah Al-Fatihah","Chapter Al-Fatihah","Fatihah","Surah Fatihah","Chapter Fatihah","Al Fatihah","Surah Al Fatihah","Chapter Al Fatihah","Surah 1","Chapter 1","The Opening","الفَاتِحَة"],"ayahNumber":1,"juzNumber":1,"footnotes":"Dios:  Al-lah  الله : Es un nombre propio exclusivo de Dios, el Único y Todopoderoso, Creador y Sustentador de los cielos y la Tierra y de todo lo que hay en ellos, el Eterno y Absoluto, el merecedor de toda forma de adoración. La forma de pronunciarlo es la siguiente: “Al-laj”, con la “jota andaluza” suave y aspirada, o la hache inglesa, enfatizando en la pronunciación de la “L”. Es sabido que cada idioma tiene uno o varios términos para referirse a Dios y, en ocasiones, para otras deidades. Éste no es el caso de “Al-lah”. “Al-lah” (del árabe al-ilah: el Dios) es el único nombre de Dios, no tiene género ni plural; por tanto, es un término que señala la unidad de lo designado. Cuando los contemporáneos del Profeta le preguntaron acerca de Dios, él recibió como revelación del capítulo 112, que resume la esencia del monoteísmo y unicidad de Dios: no ha engendrado, no ha sido engendrado, nada ni nadie es semejante a Él. El Islam rechaza cualquier intento de caracterizar a Dios, y menos aun tomando rasgos humanos que hagan prevalecer a una raza sobre las demás. \n\nel Compasivo con toda la creación, el Misericordioso con los creyentes: Ar-Rahman الرحمن y Ar-Rahim  الرحيم son dos palabras derivadas del árabe rahma  رحم , que significa misericordia. En la lengua árabe ambos tienen el significado superlativo de “Misericordiosísimo”. Mediante la cita de ambos nombres se intenta dar un significado más completo. Ar-Rahman, traducido como el Compasivo, implica un significado más amplio, que es misericordioso hacia toda la creación. La justicia es parte de esta compasión. Ar-Rahim, traducido como Misericordioso, incluye el concepto de especificidad, es decir, una forma especial de misericordia concedida solamente a los creyentes. El perdón es parte de esta misericordia. ","lang":"es","version":{"key":"spanish_garcia","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1681560818,"title":"Spanish Translation - Isa Garcia","description":"Translation of the Quran meanings into Spanish by Muhammad Isa Garcia - Printed in 1433 H."},"meta":{"transliteration":"bis'mi al-lahi al-raḥmāni al-raḥīmi ","translations":["In (the) name","(of) Allah","the Most Gracious","the Most Merciful","(1)"],"transliterationArr":["bis'mi","al-lahi","al-raḥmāni","al-raḥīmi",null],"verseTiming":[[1,0,580],[2,580,1409],[3,1409,2502],[4,2502,5840]]}}