{"name":"20:5","price":"el Compasivo, que se estableció sobre el Trono.","arabic":"ٱلرَّحۡمَٰنُ عَلَى ٱلۡعَرۡشِ ٱسۡتَوَىٰ","category":["20 (Ta-Ha)","Ta-Ha","Surah Ta-Ha","Chapter Ta-Ha","Ha","Surah Ha","Chapter Ha","Ta Ha","Surah Ta Ha","Chapter Ta Ha","Surah 20","Chapter 20","Ta-Ha","طه"],"ayahNumber":2353,"juzNumber":16,"footnotes":"el Trono: El Trono es la creación más grande y colosal. Dios ha mencionado en siete oportunidades en el Corán Su establecimiento sobre el Trono. Dios nos informa que el Trono tiene portadores, y que estos piden perdón por los creyentes. Esto refuta la opinión de quienes afirmaron que el Trono representa la Soberanía o el dominio de Dios. Nosotros ignoramos cómo Dios se ha establecido sobre Su Trono, porque ignoramos cómo es la esencia misma de nuestro Señor, pero sabemos el significado lingüístico de la palabra “establecerse” (istaua إستوى ) en el idioma árabe. Cuando los árabes utilizan el vocablo istaua seguido de la preposición ‘ala, expresan cuatro posibles significados: establecerse, subirse, elevarse y ascender, tal como lo afirmó Ibn Al Qaiim. Abu Al Hasan Al Ash‘ari narró que fue la secta Mu‘tazilah la primera en interpretar la frase “Luego, se estableció sobre el Trono” (57:4) como “tomó mando del Trono”. Quien interprete esta frase coránica de esta manera debe saber que sus predecesores son precisamente la secta Mu‘tazilah. Ibn Al ‘Arabi dijo: “Él se encuentra sobre Su Trono, tal como nos ha informado”. Este le respondió: “¡Ibn Al ‘Arabi! Significa que ha tomado el dominio del Trono (istaula إستولى )”. Pero Ibn Al ‘Arabi le dijo: “¿Cómo puedes decir eso? Los árabes no dicen que alguien ha tomado el dominio de algo (istaula) a menos que se lo haya arrebatado a un adversario, y solo quien vence es aquel que toma dominio de aquello por lo que luchaba”. El exégeta Al Qurtubi dijo: “Las primeras generaciones (As-Salaf) no negaban la dirección (elevada en que se encuentra Dios), pero tampoco utilizaban esa palabra. Sino que afirmaban todo esto de la misma forma que Dios o Su Profeta lo habían descrito. Ninguno de ellos negó que Dios se hubiese elevado sobre Su Trono en realidad (y no metafóricamente), y solamente ignoraban cómo se elevó, porque sabían que ello es inalcanzable para la mente humana. Dijo el Imam Málik: “La palabra establecerse (istiua‘) es conocida (en su significado lingüístico), el cómo es desconocido, creer en ello es una obligación, pero preguntar sobre ello es una innovación”. Esta misma frase fue pronunciada por Umm Salamah (esposa del Profeta), y eso es para nosotros suficiente”. (Tafsir Al Qurtubi, 2/219)","lang":"es","version":{"key":"spanish_garcia","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1681560818,"title":"Spanish Translation - Isa Garcia","description":"Translation of the Quran meanings into Spanish by Muhammad Isa Garcia - Printed in 1433 H."},"meta":{"transliteration":"al-raḥmānu ʿalā al-ʿarshi is'tawā ","translations":["The Most Gracious","over","the Throne","is established","(5)"],"transliterationArr":["al-raḥmānu","ʿalā","al-ʿarshi","is'tawā",null],"verseTiming":[[1,0,1670],[2,1670,2070],[3,2070,2970],[4,2970,3975]]}}