{"name":"21:30","price":"¿Acaso los que se niegan a creer no reparan en que los cielos y la Tierra formaban una masa homogénea y la disgregué, y que creé del agua a todo ser vivo? ¿Es que aún después de esto no van a creer?","arabic":"أَوَلَمۡ يَرَ ٱلَّذِينَ كَفَرُوٓاْ أَنَّ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ كَانَتَا رَتۡقٗا فَفَتَقۡنَٰهُمَاۖ وَجَعَلۡنَا مِنَ ٱلۡمَآءِ كُلَّ شَيۡءٍ حَيٍّۚ أَفَلَا يُؤۡمِنُونَ","category":["21 (Al-Anbiya)","Al-Anbiya","Surah Al-Anbiya","Chapter Al-Anbiya","Anbiya","Surah Anbiya","Chapter Anbiya","Al Anbiya","Surah Al Anbiya","Chapter Al Anbiya","Surah 21","Chapter 21","The Prophets","الأنبيَاء"],"ayahNumber":2513,"juzNumber":17,"footnotes":" una masa homogénea y la disgregué:Esta información suministrada por el Corán concuerda exactamente con los descubrimientos de la ciencia contemporánea. La conclusión a la que la astrofísica ha llegado actualmente es que la totalidad del universo, junto con las dimensiones de materia y tiempo, se manifestaron como resultado de una gran explosión que ocurrió fuera del acontecer temporal. Este evento, conocido como el Big Bang, demuestra que el universo fue creado de la nada como resultado de la explosión de un solo punto. Antes del Big Bang no existía lo que denominamos materia. Desde una condición de no-existencia –en la cual ni la materia ni la energía ni incluso el tiempo existían, y que solo puede describirse metafísicamente– materia, energía y tiempo fueron creados en un instante. Este hecho, descubierto solo recientemente por la física moderna, nos fue anunciado en el Corán hace 1.400 años.\n\ncreé del agua a todo ser vivo:El agua precedió la existencia de todos los seres vivos. Los estudios geológicos han probado que la edad de la Tierra es de aproximadamente 4.600 millones de años, cuando la edad de los restos fósiles más antiguos datan de 3.800 millones de años. Eso significa que nuestro planeta Tierra necesitó más de 800 millones de años de preparación para que su superficie fuera capaz de sustentar vida. Dios es capaz de todas las cosas, y si Dios hubiera querido habría podido crear a un ser humano adulto sobre una tierra completamente vacía. Sin embargo, sabemos que Dios no obra de esa manera, sino progresivamente, de una forma mucho más compleja y asombrosa. Los estudios paleontológicos indican que la vida acuática (en un entorno marino) predominó la Tierra por más de 3.360 millones de años, antes de la creación de las primeras especies de plantas sobre tierra firme. Estos son hechos que la humanidad no habría podido descubrir antes del siglo XX; sin embargo, están mencionados en el Corán de una forma breve y concisa, lo que prueba que el Corán es la palabra de Dios y que Mujámmad fue Su último Profeta, que la paz y las bendiciones de Dios sean con él.\n  ","lang":"es","version":{"key":"spanish_garcia","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1681560818,"title":"Spanish Translation - Isa Garcia","description":"Translation of the Quran meanings into Spanish by Muhammad Isa Garcia - Printed in 1433 H."},"meta":{"transliteration":"awalam yara alladhīna kafarū anna al-samāwāti wal-arḍa kānatā ratqan fafataqnāhumā wajaʿalnā mina al-māi kulla shayin ḥayyin afalā yu'minūna ","translations":["Do not","see","those who","disbelieved","that","the heavens","and the earth","were","a joined entity","then We parted them","and We made","from","[the] water","every","living thing","living thing","Then will not","they believe","(30)"],"transliterationArr":["awalam","yara","alladhīna","kafarū","anna","al-samāwāti","wal-arḍa","kānatā","ratqan","fafataqnāhumā","wajaʿalnā","mina","al-māi","kulla","shayin","ḥayyin","afalā","yu'minūna",null],"verseTiming":[[1,0,900],[2,900,1250],[3,1250,2230],[4,2230,4380],[5,4380,5310],[6,5310,6870],[7,6870,7870],[8,7870,8760],[9,8760,9970],[10,9970,12130],[11,12130,14050],[12,14050,14350],[13,14350,17110],[14,17110,17660],[15,17660,18510],[16,18510,19320],[17,19320,20110],[18,20110,22725]]}}