{"name":"21:33","price":"Él es Quien creó la noche y el día, el Sol y la Luna. Cada uno recorre su órbita.","arabic":"وَهُوَ ٱلَّذِي خَلَقَ ٱلَّيۡلَ وَٱلنَّهَارَ وَٱلشَّمۡسَ وَٱلۡقَمَرَۖ كُلّٞ فِي فَلَكٖ يَسۡبَحُونَ","category":["21 (Al-Anbiya)","Al-Anbiya","Surah Al-Anbiya","Chapter Al-Anbiya","Anbiya","Surah Anbiya","Chapter Anbiya","Al Anbiya","Surah Al Anbiya","Chapter Al Anbiya","Surah 21","Chapter 21","The Prophets","الأنبيَاء"],"ayahNumber":2516,"juzNumber":17,"footnotes":"Dios hace referencia a que el Sol y la Luna se mueven en una órbita definida, y en otro versículo se menciona que el Sol no es estático, sino que se mueve en una órbita determinada: “El Sol orbita como le fue designado; ello es un decreto del Poderoso, el que todo lo sabe” (36:38). Dichas realidades comunicadas por el Corán han sido constatadas a través de la observación astronómica contemporánea. Según los cálculos de los especialistas, el Sol viaja a la enorme velocidad de 720 mil kilómetros por hora en dirección a su ápice, la estrella Vega. Esto significa que el Sol viaja aproximadamente 17‘280.000 km/día, al igual que todos los planetas y satélites de su sistema. El conjunto de las estrellas del universo viajan de manera similar. El Corán se refiere a que todo el cosmos está lleno de senderos y órbitas: “¡Por el cielo surcado de órbitas!” (51:7). En el universo existen alrededor de 250 mil millones de galaxias y cada una tiene unos 200 millones de estrellas. Muchas de éstas poseen planetas y la mayoría de éstos satélites. Todos los cuerpos celestes, e incluso conjuntos de cuerpos, como las galaxias, se mueven en órbitas precisas. No cabe duda alguna de que cuando fue revelado el Corán la humanidad no poseía los telescopios y las técnicas de observación de hoy, capaces de abarcar millones de kilómetros, ni los conocimientos actuales de física o astronomía. Por consiguiente, es imposible que en esa época se hubiese podido determinar que el espacio “está lleno de senderos y órbitas”, como lo expresa el versículo. Evidentemente, es una prueba más de que el Corán es la palabra de Dios.","lang":"es","version":{"key":"spanish_garcia","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1681560818,"title":"Spanish Translation - Isa Garcia","description":"Translation of the Quran meanings into Spanish by Muhammad Isa Garcia - Printed in 1433 H."},"meta":{"transliteration":"wahuwa alladhī khalaqa al-layla wal-nahāra wal-shamsa wal-qamara kullun fī falakin yasbaḥūna ","translations":["And He","(is) the One Who","created","the night","and the day","and the sun","and the moon","each","in","an orbit","floating","(33)"],"transliterationArr":["wahuwa","alladhī","khalaqa","al-layla","wal-nahāra","wal-shamsa","wal-qamara","kullun","fī","falakin","yasbaḥūna",null],"verseTiming":[[1,0,470],[2,470,1400],[3,1400,1990],[4,1990,2820],[5,2820,4780],[6,4780,5730],[7,5730,6790],[8,6790,7970],[9,7970,8410],[10,8410,9860],[11,9860,12675]]}}