{"name":"21:32","price":"Hice del cielo un techo protector, pero aun así los que se niegan a creer rechazan reflexionar en Mis signos.","arabic":"وَجَعَلۡنَا ٱلسَّمَآءَ سَقۡفٗا مَّحۡفُوظٗاۖ وَهُمۡ عَنۡ ءَايَٰتِهَا مُعۡرِضُونَ","category":["21 (Al-Anbiya)","Al-Anbiya","Surah Al-Anbiya","Chapter Al-Anbiya","Anbiya","Surah Anbiya","Chapter Anbiya","Al Anbiya","Surah Al Anbiya","Chapter Al Anbiya","Surah 21","Chapter 21","The Prophets","الأنبيَاء"],"ayahNumber":2515,"juzNumber":17,"footnotes":"un techo protector: Dios llama nuestra atención en el Corán sobre un importante atributo del cielo: Esta propiedad del cielo ha sido descubierta por la ciencia en el siglo XX. La atmósfera que rodea la tierra cumple funciones importantes en la conservación de la vida. Al destruir por la fricción muchos meteoros, grandes y pequeños, que se aproximan a la Tierra, impide que estos lleguen al suelo y dañen a los seres vivientes. Además, la atmósfera filtra las radiaciones provenientes del espacio exterior que son perjudiciales para los seres vivos. La característica más sorprendente de la atmósfera es que solo permite que pasen a través de ella radiaciones inocuas y útiles, como la luz visible, la radiación ultravioleta de baja longitud de onda y las ondas de radio. Toda esta radiación es vital para la vida. La radiación ultravioleta de baja longitud de onda, que la atmósfera deja entrar solo parcialmente, es muy importante para la fotosíntesis de las plantas y para la supervivencia de todos los seres vivos. La mayoría de la radiación ultravioleta intensa emitida por el Sol es filtrada por la capa de ozono de la atmósfera, y solo una parte limitada —y esencial— de su espectro alcanza la tierra. La función protectora de la atmósfera no termina allí. Protege también a la tierra del intenso frío del espacio exterior, que alcanza los -270° C. Aparte de ella el cinturón de Van Allen, una capa originada por el campo magnético de la Tierra, sirve también como escudo contra la radiación perjudicial que amenaza nuestro planeta. Esta radiación, emitida por el Sol y otras estrellas, es mortal para los seres vivos. Si el cinturón de Van Allen no existiera, los estallidos masivos de energía llamados erupciones solares, que ocurren frecuentemente en el Sol, destruirían toda la vida en la Tierra.\n","lang":"es","version":{"key":"spanish_garcia","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1681560818,"title":"Spanish Translation - Isa Garcia","description":"Translation of the Quran meanings into Spanish by Muhammad Isa Garcia - Printed in 1433 H."},"meta":{"transliteration":"wajaʿalnā al-samāa saqfan maḥfūẓan wahum ʿan āyātihā muʿ'riḍūna ","translations":["And We made","the sky","a roof","protected","But they","from","its Signs","turn away","(32)"],"transliterationArr":["wajaʿalnā","al-samāa","saqfan","maḥfūẓan","wahum","ʿan","āyātihā","muʿ'riḍūna",null],"verseTiming":[[1,0,1060],[2,1060,3460],[3,3460,4230],[4,4230,6570],[5,6570,7120],[6,7120,7550],[7,7550,9060],[8,9060,11465]]}}