{"name":"21:31","price":"Afirmé la Tierra con montañas para que no tiemble, y dispuse caminos para que encuentren guía.","arabic":"وَجَعَلۡنَا فِي ٱلۡأَرۡضِ رَوَٰسِيَ أَن تَمِيدَ بِهِمۡ وَجَعَلۡنَا فِيهَا فِجَاجٗا سُبُلٗا لَّعَلَّهُمۡ يَهۡتَدُونَ","category":["21 (Al-Anbiya)","Al-Anbiya","Surah Al-Anbiya","Chapter Al-Anbiya","Anbiya","Surah Anbiya","Chapter Anbiya","Al Anbiya","Surah Al Anbiya","Chapter Al Anbiya","Surah 21","Chapter 21","The Prophets","الأنبيَاء"],"ayahNumber":2514,"juzNumber":17,"footnotes":"para que no tiemble: Como podemos ver, en el versículo se afirma que las montañas tienen la función de prevenir movimientos sísmicos. Este hecho era totalmente desconocido en la época en que el Corán fue revelado. Es algo que salió a la luz recientemente debido a los hallazgos de la geología moderna. Según estos descubrimientos, las montañas emergen como resultado del movimiento y colisión de enormes placas tectónicas que conforman la corteza terrestre. Cuando dos placas chocan, la más fuerte se desliza debajo de la otra, y la que queda encima se pliega y forma alturas y montañas. La capa inferior sigue avanzando debajo del suelo y se extiende a gran profundidad. En otro versículo este rol de las montañas es descrito comparándolo con “estacas”. “¿No he hecho de la tierra un lecho y de las montañas estacas?” (Corán 78:6-7). Dicho en otras palabras, las montañas “remachan” las placas en la corteza terrestre que se extienden por encima y por debajo de la superficie, fijándolas en los puntos de conjunción de las mismas. Este rol vital de las montañas, descubierto por la geología moderna y la investigación del fenómeno sísmico, fue revelado en el Corán hace siglos, como un ejemplo de sabiduría suprema en la creación de Dios.","lang":"es","version":{"key":"spanish_garcia","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1681560818,"title":"Spanish Translation - Isa Garcia","description":"Translation of the Quran meanings into Spanish by Muhammad Isa Garcia - Printed in 1433 H."},"meta":{"transliteration":"wajaʿalnā fī al-arḍi rawāsiya an tamīda bihim wajaʿalnā fīhā fijājan subulan laʿallahum yahtadūna ","translations":["And We (have) placed","in","the earth","firmly set mountains","lest","it (should) shake","with them","and We made","therein","broad passes","(as) ways","so that they may","(be) guided","(31)"],"transliterationArr":["wajaʿalnā","fī","al-arḍi","rawāsiya","an","tamīda","bihim","wajaʿalnā","fīhā","fijājan","subulan","laʿallahum","yahtadūna",null],"verseTiming":[[1,0,1370],[2,1370,1600],[3,1600,2410],[4,2410,3510],[5,3510,4420],[6,4420,5260],[7,5260,6000],[8,6000,7160],[9,7160,8010],[10,8010,9550],[11,9550,10200],[12,10200,11640],[13,11640,13975]]}}