{"name":"22:42","price":"Si te desmienten [¡oh, Mujámmad!], sabe que ya antes habían desmentido los pueblos de Noé, ‘Ad, Zamud,","arabic":"وَإِن يُكَذِّبُوكَ فَقَدۡ كَذَّبَتۡ قَبۡلَهُمۡ قَوۡمُ نُوحٖ وَعَادٞ وَثَمُودُ","category":["22 (Al-Hajj)","Al-Hajj","Surah Al-Hajj","Chapter Al-Hajj","Hajj","Surah Hajj","Chapter Hajj","Al Hajj","Surah Al Hajj","Chapter Al Hajj","Surah 22","Chapter 22","The Pilgrimage","الحَجّ"],"ayahNumber":2637,"juzNumber":17,"footnotes":"‘Ad : A comienzos de 1990 aparecieron titulares en importantes periódicos con frases como: “Ha sido descubierta una legendaria ciudad árabe perdida”, “se ha encontrado la ciudad árabe de la leyenda”, “Ubar, la Atlántida de las arenas”. Lo que ha vuelto más sorprendente este hallazgo arqueológico es el hecho de que esta ciudad estaba mencionada en el Corán. Fue Nicholas Clapp, un arqueólogo aficionado, quien encontró esta ciudad legendariat mencionada en el Corán. Como amante de la civilización árabe y premiado director de documentales, Clapp se había topado con un libro muy interesante durante sus investigaciones en historia de los árabes. Ese libro era Arabia Felix, escrito por el investigador inglés Bertram Thomas en 1932. “Arabia feliz” era el nombre que los romanos le daban al extremo sur de la Península Árabe que hoy incluye al Yemen y parte de Omán. Los griegos llamaban a esta región “Eudaimon Arabia” y los eruditos árabes del medioevo la denominaban “AlYaman As-Sa’ida”. El investigador británico Thomas describía a esas “afortunadas” tribus in extenso, y afirmaba que había encontrado rastros de una ciudad antigua fundada por esos pueblos. Era la ciudad conocida como “Ubar” por los beduinos. Clapp, que examinó lo que había escrito el investigador inglés, estaba convencido de la existencia de la ciudad perdida descrita en el libro. Clapp utilizó dos caminos para probar la existencia de Ubar. Primero, encontró las sendas que los beduinos decían que existían. Recurrió a la NASA para obtener imágenes satelitales del área. Clapp siguió con el estudio de antiguos manuscritos y mapas de la Biblioteca Huntington en California. Su objetivo era encontrar un mapa de la región. Después de una breve búsqueda encontró uno. Era un mapa trazado por el conocido geógrafo greco-egipcio Ptolomeo en el 200 d.C. En el mapa figuraba la ubicación de una antigua ciudad en la región y los caminos que conducían a ella. En las fotos satelitales tomadas por la NASA se distinguían algunos senderos de caravanas que era difícil identificar a ojo desnudo y que solo podían apreciarse en su totalidad desde una visión satelital. Comparando estas fotos con el viejo mapa que tenía en sus manos, Clapp finalmente llegó al resultado que anhelaba: los senderos del mapa se correspondían con los que se veían en las fotos tomadas desde el satélite. El destino final de estos senderos era un solar amplio en donde se presumía que alguna vez hubo una ciudad. En poco tiempo empezaron las excavaciones y comenzaron a emerger de las arenas los restos de una antigua ciudad. Fue por eso que esta ciudad perdida fue descrita como “Ubar, la Atlántida de las arenas”. A partir del momento mismo en que comenzaron a desenterrarse las ruinas, quedó claro que las mismas pertenecían al pueblo de ‘Ad y eran los pilares de Iram referidos en el Corán, porque entre las estructuras desenterradas se encontraron las torres allí mencionadas. Un miembro del equipo de investigadores que conducía la excavación, el Dr. Zarins, dijo que al ser las torres la característica distintiva de Ubar, y siendo que Iram es mencionada como una ciudad caracterizada por tener pilares o torres, esto constituye la prueba más contundente de que las ruinas descubiertas pertenecían a esa ciudad del pueblo de ‘Ad descrita en el Corán. El Corán menciona a Iram como sigue: “¿No has visto cómo tu Señor castigó al pueblo de ‘Ád en Iram?, el de las [construcciones con grandes] columnas, que no tenía similar entre los otros pueblos [en su opulencia]” (Corán 89:6-8). Como puede verse, el hecho de que la información suministrada por el Corán sobre acontecimientos del pasado confirme los datos históricos recientemente obtenidos, es una evidencia más de que es la Palabra de Dios.\n","lang":"es","version":{"key":"spanish_garcia","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1681560818,"title":"Spanish Translation - Isa Garcia","description":"Translation of the Quran meanings into Spanish by Muhammad Isa Garcia - Printed in 1433 H."},"meta":{"transliteration":"wa-in yukadhibūka faqad kadhabat qablahum qawmu nūḥin waʿādun wathamūdu ","translations":["And if","they deny you","so verily","denied","before them","(the) people","(of) Nuh","and Aad","and Thamud","(42)"],"transliterationArr":["wa-in","yukadhibūka","faqad","kadhabat","qablahum","qawmu","nūḥin","waʿādun","wathamūdu",null],"verseTiming":[[1,0,1150],[2,1150,2670],[3,2670,3350],[4,3350,4520],[5,4520,5640],[6,5640,6270],[7,6270,7680],[8,7680,9630],[9,9630,12545]]}}