{"name":"25:53","price":"Él es Quien ha hecho confluir las dos masas de agua, una dulce y la otra salada. Entre ambas puso un espacio intermedio y una barrera infranqueable.","arabic":"۞ وَهُوَ ٱلَّذِي مَرَجَ ٱلۡبَحۡرَيۡنِ هَٰذَا عَذۡبٞ فُرَاتٞ وَهَٰذَا مِلۡحٌ أُجَاجٞ وَجَعَلَ بَيۡنَهُمَا بَرۡزَخٗا وَحِجۡرٗا مَّحۡجُورٗا","category":["25 (Al-Furqan)","Al-Furqan","Surah Al-Furqan","Chapter Al-Furqan","Furqan","Surah Furqan","Chapter Furqan","Al Furqan","Surah Al Furqan","Chapter Al Furqan","Surah 25","Chapter 25","The Criterion","الفُرقان"],"ayahNumber":2908,"juzNumber":19,"footnotes":"La ciencia moderna ha descubierto que en los lugares donde se unen dos mares diferentes, existe una barrera entre ambos. Esa barrera divide a los dos mares para que cada mar tenga su propia temperatura, salinidad y densidad. ¿Por qué menciona el Corán al espacio intermedio cuando habla del divisor entre el agua dulce y la salada, pero no lo menciona cuando habla del divisor entre los dos mares, como en Corán 55:19-20? La ciencia moderna ha descubierto que en los estuarios, donde el agua dulce y la salada se encuentran, la situación es en cierta manera diferente a la que se encuentra en los lugares en los que dos mares se encuentran. Se ha descubierto que lo que distingue al agua dulce de la salada en los estuarios (o deltas de un río) es una zona picnoclina que posee una marcada discontinuidad en su densidad, que separa las dos capas. Esta partición o división (zona de separación), tiene una salinidad diferente a la del agua dulce y a la de la salada.","lang":"es","version":{"key":"spanish_garcia","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1681560818,"title":"Spanish Translation - Isa Garcia","description":"Translation of the Quran meanings into Spanish by Muhammad Isa Garcia - Printed in 1433 H."},"meta":{"transliteration":"wahuwa alladhī maraja al-baḥrayni hādhā ʿadhbun furātun wahādhā mil'ḥun ujājun wajaʿala baynahumā barzakhan waḥij'ran maḥjūran ","translations":["And He","(is) the One Who","(has) released","the two seas","[this] (one)","palatable","and sweet","and [this] (one)","salty","(and) bitter","and He has made","between them","a barrier","and a partition","forbidden","(53)"],"transliterationArr":["wahuwa","alladhī","maraja","al-baḥrayni","hādhā","ʿadhbun","furātun","wahādhā","mil'ḥun","ujājun","wajaʿala","baynahumā","barzakhan","waḥij'ran","maḥjūran",null],"verseTiming":[[1,0,590],[2,590,1540],[3,1540,2140],[4,2140,3470],[5,3470,4250],[6,4250,5660],[7,5660,7170],[8,7170,8400],[9,8400,9230],[10,9230,10860],[11,10860,11680],[12,11680,12980],[13,12980,14410],[14,14410,15640],[15,15640,17440],[16,17440,18230],[17,18230,21045]]}}