{"name":"28:56","price":"Tú no puedes guiar a quien amas, sino que Dios guía a quien Él quiere. Él sabe quiénes seguirán la guía.","arabic":"إِنَّكَ لَا تَهۡدِي مَنۡ أَحۡبَبۡتَ وَلَٰكِنَّ ٱللَّهَ يَهۡدِي مَن يَشَآءُۚ وَهُوَ أَعۡلَمُ بِٱلۡمُهۡتَدِينَ","category":["28 (Al-Qasas)","Al-Qasas","Surah Al-Qasas","Chapter Al-Qasas","Qasas","Surah Qasas","Chapter Qasas","Al Qasas","Surah Al Qasas","Chapter Al Qasas","Surah 28","Chapter 28","The Stories","القَصَص"],"ayahNumber":3308,"juzNumber":20,"footnotes":"El motivo de la revelación de este versículo es la muerte del tío del Mensajero de Dios, Abu Talib, quien seguía la religión de sus ancestros. Ibn Kazir dijo: “Dice Dios a su Profeta: ¡Mujámmad! Tú no puedes guiar a quien deseas, porque la guía no está en tus manos, sino que a ti te corresponde difundir el Mensaje y Dios ha de guiar a quien Él quiera. A Dios pertenece la sabiduría infinita, tal como dijo en el Corán: ‘No es tu obligación [¡oh, Mujámmad!] que sigan la guía, sino que Dios guía a quien quiere’ (2:272); y ‘la mayoría de los seres humanos, aunque lo anheles, no serán creyentes’ (12:103)”. La guía mencionada en este versículo es la concesión de la guía (hidaiat at-taufiq), porque esta se encuentra en poder de Dios. En cuanto a la guía mencionada en el siguiente versículo: “Y tú guías a un sendero recto” (42:52), es la invitación hacia la guía (hidaiat al-irshad), porque el Mensajero de Dios es quien llama hacia Dios, Su religión y Su legislación.","lang":"es","version":{"key":"spanish_garcia","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1681560818,"title":"Spanish Translation - Isa Garcia","description":"Translation of the Quran meanings into Spanish by Muhammad Isa Garcia - Printed in 1433 H."},"meta":{"transliteration":"innaka lā tahdī man aḥbabta walākinna al-laha yahdī man yashāu wahuwa aʿlamu bil-muh'tadīna ","translations":["Indeed, you","(can) not","guide","whom","you love","but","Allah","guides","whom","He wills","And He","(is) most knowing","(of) the guided ones","(56)"],"transliterationArr":["innaka","lā","tahdī","man","aḥbabta","walākinna","al-laha","yahdī","man","yashāu","wahuwa","aʿlamu","bil-muh'tadīna",null],"verseTiming":[[1,0,1520],[2,1520,1910],[3,1910,2850],[4,2850,3260],[5,3260,4290],[6,4290,6000],[7,6000,6890],[8,6890,7830],[9,7830,8090],[10,8090,12040],[11,12040,12590],[12,12590,13500],[13,13500,17925]]}}