{"name":"28:88","price":"No invoques a nada ni nadie junto con Dios. Nadie tiene derecho a ser adorado salvo Él. Todo ha de perecer excepto Su rostro. Suyo es el juicio y ante Él comparecerán.","arabic":"وَلَا تَدۡعُ مَعَ ٱللَّهِ إِلَٰهًا ءَاخَرَۘ لَآ إِلَٰهَ إِلَّا هُوَۚ كُلُّ شَيۡءٍ هَالِكٌ إِلَّا وَجۡهَهُۥۚ لَهُ ٱلۡحُكۡمُ وَإِلَيۡهِ تُرۡجَعُونَ","category":["28 (Al-Qasas)","Al-Qasas","Surah Al-Qasas","Chapter Al-Qasas","Qasas","Surah Qasas","Chapter Qasas","Al Qasas","Surah Al Qasas","Chapter Al Qasas","Surah 28","Chapter 28","The Stories","القَصَص"],"ayahNumber":3340,"juzNumber":20,"footnotes":"Su rostro: Al igual que otros atributos, el rostro de Dios es Único y acorde a su Divinidad. Nosotros afirmamos su existencia y creemos en él, porque Dios nos ha informado sobre ello en Su Libro y Su Mensajero lo ha declarado en sus dichos. Dios dice en Corán 55:27: “Y solo el majestuoso y noble rostro de tu Señor perdurará por siempre”. El exégeta coránico Ibn Yarir At-Tabari dijo sobre este versículo: “El rostro es el que es descrito como Majestuoso y Noble”. (Tafsir AtTabari. Ver Tafsir 55:27.) Algunas personas en la antigüedad negaron que Dios tuviese rostro, y alegaron que las palabras “Majestuoso y Noble” aluden directamente a Dios y no a Su generoso Rostro. Pero esa afirmación fue refutada por Ibn Juzaimah, quien dijo: “Ésta afirmación solo puede ser hecha por un ignorante en el idioma árabe, porque Dios dice: ‘Y solo el majestuoso y noble rostro de tu Señor ha de perdurar por siempre’ (55:27); y la palabra ‘rostro’ es nominativa (marfu’), mientras que la palabra ‘Señor’ se encuentra en genitivo (mayrur)...”. At-Tauhid por Ibn Juzaimah, pág. 21. En Al-Bujari y Muslim se ha registrado de ‘Utban Ibn Málik que el Profeta, que la paz y las bendiciones de Dios sean con él, dijo: “Dios ha prohibido al Fuego tocar a aquellos que afirmen que nada ni nadie tiene derecho a ser adorado salvo Dios, si buscan con ello encontrar el Rostro de Dios”. Registrado por Al-Bujari y Muslim. El Profeta, que la paz y las bendiciones de Dios sean con él, mencionó que las palabras “una gracia aún mayor” en el siguiente versículo: “Quienes obren el bien obtendrán la mejor recompensa [el Paraíso] y una gracia aún mayor” (10:26), significan contemplar el rostro de Dios. Asimismo, se narra que Abu Bakr, Hudhaifah y muchos otros Sahabah interpretaron el versículo de igual forma. (Al Asma’ wa As-Sifat, por Al- Baihaqi) ","lang":"es","version":{"key":"spanish_garcia","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1681560818,"title":"Spanish Translation - Isa Garcia","description":"Translation of the Quran meanings into Spanish by Muhammad Isa Garcia - Printed in 1433 H."},"meta":{"transliteration":"walā tadʿu maʿa al-lahi ilāhan ākhara lā ilāha illā huwa kullu shayin hālikun illā wajhahu lahu al-ḥuk'mu wa-ilayhi tur'jaʿūna ","translations":["And (do) not","invoke","with","Allah","god","other","(There is) no","god","except","Him","Every","thing","(will be) destroyed","except","His Face","To Him","(is) the Decision","and to Him","you will be returned","(88)"],"transliterationArr":["walā","tadʿu","maʿa","al-lahi","ilāhan","ākhara","lā","ilāha","illā","huwa","kullu","shayin","hālikun","illā","wajhahu","lahu","al-ḥuk'mu","wa-ilayhi","tur'jaʿūna",null],"verseTiming":[[1,0,560],[2,560,1170],[3,1170,1610],[4,1610,2580],[5,2580,3550],[6,3550,4350],[7,4350,6979],[8,6979,7859],[9,7859,8769],[10,8769,9309],[11,9309,10319],[12,10319,11319],[13,11319,12459],[14,12459,13299],[15,13299,14739],[16,14739,15199],[17,15199,16299],[18,16299,17439],[19,17439,21264]]}}