{"name":"2:43","price":"Cumplan con la oración, paguen el zakat y prostérnense con los que se prosternan [adorando a Dios].","arabic":"وَأَقِيمُواْ ٱلصَّلَوٰةَ وَءَاتُواْ ٱلزَّكَوٰةَ وَٱرۡكَعُواْ مَعَ ٱلرَّٰكِعِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":50,"juzNumber":1,"footnotes":"el zakat: Contribución social anual destinada a mejorar la condición de ciertos sectores de la sociedad, como los pobres, los necesitados, los endeudados, los viajeros insolventes, etc. (ver Corán 9:60), que deben dar aquellos cuyos bienes ahorrados alcanzan un monto determinado pasado un año. El objetivo del zakat no consiste solamente en reunir bienes materiales y donárselos a los pobres y necesitados. El objetivo principal es que el ser humano logre superar su ambición por los bienes materiales; para que estén al servicio del ser humano y no el ser humano al servicio de ellos. El zakat fue prescripto para purificar a quien lo da y a quien lo recibe. Aunque el zakat parezca una disminución en los bienes de quien lo da, en realidad es un crecimiento por las bendiciones que recaen sobre los bienes restantes y el incremento en la fe de quien cumple con esta obligación. El zakat también implica un crecimiento en el carácter y en los modales de la persona, pues es esfuerzo y entrega. El zakat consiste en dar en caridad algo muy querido para la persona, como lo son sus bienes, con la esperanza de obtener algo más querido aún: la complacencia de Dios. El sistema económico en el Islam se basa en reconocer que Dios es el único y original dueño de todos los bienes materiales y que tiene la exclusiva potestad de dictar las formas de adquisición de estos bienes y los deberes y derechos que conlleva esta adquisición, su cuantificación, su especificación, sus fuentes y sus destinatarios. El zakat es un poderoso puente que une a ricos y pobres, purifica el ego, enriquece el corazón y logra el establecimiento de la justicia social, la fraternidad y la seguridad. ","lang":"es","version":{"key":"spanish_garcia","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1681560818,"title":"Spanish Translation - Isa Garcia","description":"Translation of the Quran meanings into Spanish by Muhammad Isa Garcia - Printed in 1433 H."},"meta":{"transliteration":"wa-aqīmū al-ṣalata waātū al-zakata wa-ir'kaʿū maʿa al-rākiʿīna ","translations":["And establish","the prayer","and give","zakah","and bow down","with","those who bow down","(43)"],"transliterationArr":["wa-aqīmū","al-ṣalata","waātū","al-zakata","wa-ir'kaʿū","maʿa","al-rākiʿīna",null],"verseTiming":[[1,0,1030],[2,1030,2060],[3,2060,2770],[4,2770,3800],[5,3800,4710],[6,4710,5080],[7,5080,7915]]}}