{"name":"30:4","price":"dentro de tres a nueve años. Todo ocurre por voluntad de Dios, tanto la anterior derrota [de los bizantinos] como su victoria futura. Ese día los creyentes se alegrarán","arabic":"فِي بِضۡعِ سِنِينَۗ لِلَّهِ ٱلۡأَمۡرُ مِن قَبۡلُ وَمِنۢ بَعۡدُۚ وَيَوۡمَئِذٖ يَفۡرَحُ ٱلۡمُؤۡمِنُونَ","category":["30 (Ar-Rum)","Ar-Rum","Surah Ar-Rum","Chapter Ar-Rum","Rum","Surah Rum","Chapter Rum","Ar Rum","Surah Ar Rum","Chapter Ar Rum","Surah 30","Chapter 30","The Romans","الرُّوم"],"ayahNumber":3413,"juzNumber":21,"footnotes":"de tres a nueve años: El ejército bizantino recibió una dura derrota en Antioquía en el 613 d.C., y como resultado de eso los persas empezaron a empujar y avanzar en todos los frentes. En aquel momento, hubiera sido muy difícil imaginar que los bizantinos irían a derrotar a los persas, pero el Corán prometió que ellos serían victoriosos en el espacio de 3 a 9 años. En el año 622 d.C, nueve años después de la derrota bizantina, las dos fuerzas (bizantinos y persas), se enfrentaron en las tierras de Armenia y el resultado de la batalla fue la victoria decisiva de los bizantinos sobre los persas, por primera vez, después de su derrota en el 613. La promesa fue cumplida tal y como Dios dijo. (Fuente: History of the Byzantine State [Historia del Estado Bizantino], Ostrogorsky, pp. 100-101; y History of Persia [Historia de Persia], Sykes, vol. 1, pp. 483-484.) ","lang":"es","version":{"key":"spanish_garcia","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1681560818,"title":"Spanish Translation - Isa Garcia","description":"Translation of the Quran meanings into Spanish by Muhammad Isa Garcia - Printed in 1433 H."},"meta":{"transliteration":"fī biḍ'ʿi sinīna lillahi al-amru min qablu wamin baʿdu wayawma-idhin yafraḥu al-mu'minūna ","translations":["Within","a few","years","For Allah","(is) the command","before","before","and after","and after","And that day","will rejoice","the believers","(4)"],"transliterationArr":["fī","biḍ'ʿi","sinīna","lillahi","al-amru","min","qablu","wamin","baʿdu","wayawma-idhin","yafraḥu","al-mu'minūna",null],"verseTiming":[[1,0,570],[2,570,1190],[3,1190,4210],[4,4210,5250],[5,5250,6080],[6,6080,7320],[7,7320,7950],[8,7950,8780],[9,8780,9880],[10,9880,12230],[11,12230,13010],[12,13010,16825]]}}