{"name":"33:26","price":"Luego hizo salir de sus fortalezas a la gente del Libro que había ayudado [a los idólatras], e infundió el terror en sus corazones. Por Su orden unos fueron ejecutados y otros hechos prisioneros.","arabic":"وَأَنزَلَ ٱلَّذِينَ ظَٰهَرُوهُم مِّنۡ أَهۡلِ ٱلۡكِتَٰبِ مِن صَيَاصِيهِمۡ وَقَذَفَ فِي قُلُوبِهِمُ ٱلرُّعۡبَ فَرِيقٗا تَقۡتُلُونَ وَتَأۡسِرُونَ فَرِيقٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab","Chapter Al-Ahzab","Ahzab","Surah Ahzab","Chapter Ahzab","Al Ahzab","Surah Al Ahzab","Chapter Al Ahzab","Surah 33","Chapter 33","The Combined Forces","الأحزَاب"],"ayahNumber":3559,"juzNumber":21,"footnotes":"gente del Libro:Los judíos de Banu Quraidhah, que traicionaron su pacto de no agresión ni colaboración con los enemigos, y ayudaron a los aliados contra los musulmanes. \n\nprisioneros:Los judíos de Banu Quraidhah habían firmado un pacto con los musulmanes de defenderse mutuamente en caso de agresión extranjera, y no solamente no lo cumplieron, sino que confabularon con los idólatras para exterminar a los musulmanes, ya que habían acordado con los idólatras atacar Medina cuando estuviera desprotegida y matar a quienes quedaran en ella, que eran unos pocos guardias y miles de mujeres, niños y ancianos, lo que hubiera significado un genocidio. Por lo que fueron juzgados y condenados por planear y confabularse para cometer un genocidio.  Cuando los judíos de Banu Quraidhah se rindieron, rechazaron arrogantemente que el Profeta Mujámmad, que la paz y las bendiciones de Dios sean con él, los juzgara, y pidieron que Sa’ad Ibn Mu’ad, quien había sido un aliado de ellos antes de convertirse al Islam, juzgara sobre su caso de acuerdo con las leyes de la Tora, pensando que este juzgaría a su favor, pero Sa’ad los condenó. ","lang":"es","version":{"key":"spanish_garcia","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1681560818,"title":"Spanish Translation - Isa Garcia","description":"Translation of the Quran meanings into Spanish by Muhammad Isa Garcia - Printed in 1433 H."},"meta":{"transliteration":"wa-anzala alladhīna ẓāharūhum min ahli al-kitābi min ṣayāṣīhim waqadhafa fī qulūbihimu al-ruʿ'ba farīqan taqtulūna watasirūna farīqan ","translations":["And He brought down","those who","backed them","among","(the) People","(of) the Scripture","from","their fortresses","and cast","into","their hearts","[the] terror","a group","you killed","and you took captive","a group","(26)"],"transliterationArr":["wa-anzala","alladhīna","ẓāharūhum","min","ahli","al-kitābi","min","ṣayāṣīhim","waqadhafa","fī","qulūbihimu","al-ruʿ'ba","farīqan","taqtulūna","watasirūna","farīqan",null],"verseTiming":[[1,0,1760],[2,1760,2730],[3,2730,4250],[4,4250,5080],[5,5080,5600],[6,5600,6570],[7,6570,7020],[8,7020,9090],[9,9090,9870],[10,9870,10150],[11,10150,11270],[12,11270,12540],[13,12540,13340],[14,13340,13620],[15,13620,14840],[16,14840,15680],[17,15680,17270],[18,17270,18690],[19,18690,19990],[20,19990,21555]]}}