{"name":"3:159","price":"[Oh, Mujámmad] Por misericordia de Dios eres compasivo con ellos. Si hubieras sido rudo y de corazón duro se habrían alejado de ti; perdónalos, pide perdón por ellos, y consulta con ellos los asuntos [de interés público]. Pero cuando hayas tomado una decisión encomiéndate a Dios, porque Dios ama a los que se encomiendan a Él.","arabic":"فَبِمَا رَحۡمَةٖ مِّنَ ٱللَّهِ لِنتَ لَهُمۡۖ وَلَوۡ كُنتَ فَظًّا غَلِيظَ ٱلۡقَلۡبِ لَٱنفَضُّواْ مِنۡ حَوۡلِكَۖ فَٱعۡفُ عَنۡهُمۡ وَٱسۡتَغۡفِرۡ لَهُمۡ وَشَاوِرۡهُمۡ فِي ٱلۡأَمۡرِۖ فَإِذَا عَزَمۡتَ فَتَوَكَّلۡ عَلَى ٱللَّهِۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلۡمُتَوَكِّلِينَ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":452,"juzNumber":4,"footnotes":" consulta con ellos los asuntos [de interés público]: Pedir la guía de Dios y el consejo a la gente sobre un asunto lícito es recomendable. No se arrepiente quien pide la guía a Dios o un consejo a la gente. Sobre pedir guía y consejo a Dios, el Profeta enseñó una oración para pedir el bien llamada Al-Istijarah. Yabir dijo: “El Profeta, que la paz y las bendiciones de Dios sean con él, solía enseñarnos a consultar a Dios en todos los asuntos y situaciones, tanto como nos enseñaba un capítulo del Corán, y decía: ‘Si a alguno de ustedes lo aqueja algún asunto, que realice una oración voluntaria, fuera de las oraciones obligatorias, y luego diga: ¡Oh, Dios! Te consulto por Tu sabiduría, recurro a Ti por Tu poder y Te pido de Tu generosidad infinita; Tú eres, en efecto, capaz y yo no lo soy; Tú sabes y yo no sé. Tú eres el Conocedor de lo Oculto. ¡Oh, Dios! Si Tú sabes que este asunto… es bueno para mí en mi religión y mi vida presente y futura, destínamelo, facilítamelo y bendícelo para mí; pero si sabes que este asunto es un mal para mí en mi religión y mi vida presente y futura, aléjalo de mí y aléjame de él. Destíname el bien donde se encuentre, y luego haz que yo esté complacido de él”. Registrado por Al-Bujari.\n\nDios ama a los que se encomiendan a Él: La confianza en Dios es hacer el corazón dependiente de Él para conseguir lo que anhela y evitar lo que detesta. La confianza en Dios no prohíbe utilizar los medios materiales que Dios nos ha proporcionado para conseguir ese objetivo. No depositar la confianza en Dios implica una enfermedad en el monoteísmo; mientras que no utilizar los medios materiales disponibles implica falta de visión y contacto con la realidad. El momento indicado para este acto es antes de realizar una obra, y su fruto es la certeza. Existen tres tipos de confianza: 1) la obligatoria, que es la confianza en Dios, anhelando solo de Él la ayuda. 2) La permitida, que es confiar en que alguien hará algo por ti dentro de sus capacidades. 3) La prohibida, que es de dos tipos, (a) el politeísmo mayor, que es confiar totalmente en las causas y efectos, creyendo que las cosas suceden de manera independiente a la voluntad de Dios para traer beneficios o provocar daños; (b) el politeísmo menor, que es confiar en que una persona puede proveer el sustento, aunque no cree que lo hace de manera independiente a la voluntad de Dios, sino a través de un acto sobrenatural. ","lang":"es","version":{"key":"spanish_garcia","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1681560818,"title":"Spanish Translation - Isa Garcia","description":"Translation of the Quran meanings into Spanish by Muhammad Isa Garcia - Printed in 1433 H."},"meta":{"transliteration":"fabimā raḥmatin mina al-lahi linta lahum walaw kunta faẓẓan ghalīẓa al-qalbi la-infaḍḍū min ḥawlika fa-uʿ'fu ʿanhum wa-is'taghfir lahum washāwir'hum fī al-amri fa-idhā ʿazamta fatawakkal ʿalā al-lahi inna al-laha yuḥibbu al-mutawakilīna ","translations":["So because","(of) Mercy","from","Allah","you dealt gently","with them","And if","you had been","rude","(and) harsh","(at) [the] heart","surely they (would have) dispersed","from","around you","Then pardon","[from] them","and ask forgiveness","for them","and consult them","in","the matter","Then when","you have decided","then put trust","on","Allah","Indeed","Allah","loves","the ones who put trust (in Him)","(159)"],"transliterationArr":["fabimā","raḥmatin","mina","al-lahi","linta","lahum","walaw","kunta","faẓẓan","ghalīẓa","al-qalbi","la-infaḍḍū","min","ḥawlika","fa-uʿ'fu","ʿanhum","wa-is'taghfir","lahum","washāwir'hum","fī","al-amri","fa-idhā","ʿazamta","fatawakkal","ʿalā","al-lahi","inna","al-laha","yuḥibbu","al-mutawakilīna",null],"verseTiming":[[1,0,950],[2,950,1830],[3,1830,2740],[4,2740,3690],[5,3690,5180],[6,5180,6340],[7,6340,6870],[8,6870,8230],[9,8230,9060],[10,9060,9700],[11,9700,10880],[12,10880,12690],[13,12690,13120],[14,13120,14390],[15,14390,14930],[16,14930,15890],[17,15890,17090],[18,17090,17770],[19,17770,19280],[20,19280,19490],[21,19490,20220],[22,20220,21470],[23,21470,22340],[24,22340,23560],[25,23560,23950],[26,23950,26980],[27,26980,27970],[28,27970,28800],[29,28800,29690],[30,29690,33095]]}}