{"name":"3:175","price":"Así [es la estrategia del] demonio, que intenta atemorizar a quienes lo siguen. Pero no le teman a él, sino que témanme a Mí, si son verdaderamente creyentes.","arabic":"إِنَّمَا ذَٰلِكُمُ ٱلشَّيۡطَٰنُ يُخَوِّفُ أَوۡلِيَآءَهُۥ فَلَا تَخَافُوهُمۡ وَخَافُونِ إِن كُنتُم مُّؤۡمِنِينَ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":468,"juzNumber":4,"footnotes":"El temor reverencial es un acto de adoración y, por consiguiente, debe ser dedicado y entregado solamente a Dios. El temor puede dividirse en tres clases: 1. El temor reverencial que se experimenta por otro que no sea Dios, ya sea un ídolo o un Tagut, temiendo que éste cause algún perjuicio. Esto es lo que muestran los que adoran tumbas u otros ídolos, les temen y atemorizan a los monoteístas que los invitan a la adoración sincera de Dios único. Una expresión de esto es cuando una persona abandona aquello que le es obligatorio por temor a alguien, lo que muestra la imperfección de su monoteísmo (Tawhid). Dice un hadiz: “Dios ha de decirle al siervo en el Día de la Resurrección: ‘¿Qué te impidió al ver un acto reprobable intentar corregirlo?’ Contestará: ‘¡Oh Señor! Temí la reprobación de la gente’. Dirá: ‘Yo tenía más derecho a ser temido’ ”. Registrado por Ahmad. 2. El temor natural o normal que se experimenta ante el enemigo o un animal salvaje; esta clase de temor no es reprochable. Dijo Dios: “Presuroso, Moisés se alejó de la ciudad con temor y cautela”. (Corán 28:21)","lang":"es","version":{"key":"spanish_garcia","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1681560818,"title":"Spanish Translation - Isa Garcia","description":"Translation of the Quran meanings into Spanish by Muhammad Isa Garcia - Printed in 1433 H."},"meta":{"transliteration":"innamā dhālikumu al-shayṭānu yukhawwifu awliyāahu falā takhāfūhum wakhāfūni in kuntum mu'minīna ","translations":["(It is) only","that","the Shaitaan","frightens (you)","(of) his allies","So (do) not","fear them","but fear Me","if","you are","believers","(175)"],"transliterationArr":["innamā","dhālikumu","al-shayṭānu","yukhawwifu","awliyāahu","falā","takhāfūhum","wakhāfūni","in","kuntum","mu'minīna",null],"verseTiming":[[1,0,2100],[2,2100,3230],[3,3230,4660],[4,4660,5837],[5,5837,8971],[6,8971,11061],[7,11061,14051],[8,14051,14691],[9,14691,16331],[10,16331,17701],[11,17701,18031],[12,18031,20291],[13,20291,23956]]}}