{"name":"3:7","price":"Él es Quien te ha revelado el Libro [¡oh, Mujámmad!]. En él hay versículos categóricos de significado evidente, que son la base del Libro, y otros que aceptan interpretaciones. Los que tienen el corazón extraviado siguen solo los interpretables con el fin de sembrar la discordia y hacer una interpretación interesada. Pero Dios conoce su verdadero significado. Los que tienen un conocimiento afirmado, dicen: \"Creemos en todos los versículos por igual, todos proceden de nuestro Señor. Aunque solo los dotados de intelecto tienen esto presente.","arabic":"هُوَ ٱلَّذِيٓ أَنزَلَ عَلَيۡكَ ٱلۡكِتَٰبَ مِنۡهُ ءَايَٰتٞ مُّحۡكَمَٰتٌ هُنَّ أُمُّ ٱلۡكِتَٰبِ وَأُخَرُ مُتَشَٰبِهَٰتٞۖ فَأَمَّا ٱلَّذِينَ فِي قُلُوبِهِمۡ زَيۡغٞ فَيَتَّبِعُونَ مَا تَشَٰبَهَ مِنۡهُ ٱبۡتِغَآءَ ٱلۡفِتۡنَةِ وَٱبۡتِغَآءَ تَأۡوِيلِهِۦۖ وَمَا يَعۡلَمُ تَأۡوِيلَهُۥٓ إِلَّا ٱللَّهُۗ وَٱلرَّٰسِخُونَ فِي ٱلۡعِلۡمِ يَقُولُونَ ءَامَنَّا بِهِۦ كُلّٞ مِّنۡ عِندِ رَبِّنَاۗ وَمَا يَذَّكَّرُ إِلَّآ أُوْلُواْ ٱلۡأَلۡبَٰبِ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":300,"juzNumber":3,"footnotes":"En lengua árabe el término mujkam مُحْكَم significa perfeccionado y claro. En este sentido todo el Corán es mujkam, ya que a través de sus versículos, puede distinguirse lo verídico de lo falso. El término mutashabih مُتَشَابِه significa que tiene más de un sentido, uno que concuerda con el mujkam y otro que no. La metodología correcta según este versículo implica interpretar los versículos de esta categoría con base en los versículos mujkam. Quien hace lo contrario, comete un gran error que lo llevará al desvío. Los “arraigados en el conocimiento” son los que siguen el camino de la Verdad, interpretando los versículos mutashabih basados en los versículos mujkam. En cambio, quienes buscan interpretaciones rebuscadas basándose solamente en su comprensión y pasión, se desvían y desvían a otros. Dijo el Profeta Mujámmad, que la paz y las bendiciones de Dios sean con él, después de recitar este versículo: “Cuando vean a los que buscan recurrir a los versículos mutashabih, tengan cuidado de ellos”. Registrado por Al-Bujari ","lang":"es","version":{"key":"spanish_garcia","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1681560818,"title":"Spanish Translation - Isa Garcia","description":"Translation of the Quran meanings into Spanish by Muhammad Isa Garcia - Printed in 1433 H."},"meta":{"transliteration":"huwa alladhī anzala ʿalayka al-kitāba min'hu āyātun muḥ'kamātun hunna ummu al-kitābi wa-ukharu mutashābihātun fa-ammā alladhīna fī qulūbihim zayghun fayattabiʿūna mā tashābaha min'hu ib'tighāa al-fit'nati wa-ib'tighāa tawīlihi wamā yaʿlamu tawīlahu illā al-lahu wal-rāsikhūna fī al-ʿil'mi yaqūlūna āmannā bihi kullun min ʿindi rabbinā wamā yadhakkaru illā ulū al-albābi ","translations":["He","(is) the One Who","revealed","to you","the Book","of it","(are) Verses","absolutely clear ","they (are)","the foundation","(of) the Book","and others","(are) allegorical","Then as for","those","in","their hearts","(is) perversity ","[so] they follow","what","(is) allegorical","of it","seeking","[the] discord","and seeking","its interpretation","And not","knows","its interpretation","except","Allah","And those firm","in","[the] knowledge","they say","We believe","in it","All","(is)","from","our Lord","And not","will take heed","except","men","(of) understanding","(7)"],"transliterationArr":["huwa","alladhī","anzala","ʿalayka","al-kitāba","min'hu","āyātun","muḥ'kamātun","hunna","ummu","al-kitābi","wa-ukharu","mutashābihātun","fa-ammā","alladhīna","fī","qulūbihim","zayghun","fayattabiʿūna","mā","tashābaha","min'hu","ib'tighāa","al-fit'nati","wa-ib'tighāa","tawīlihi","wamā","yaʿlamu","tawīlahu","illā","al-lahu","wal-rāsikhūna","fī","al-ʿil'mi","yaqūlūna","āmannā","bihi","kullun","min","ʿindi","rabbinā","wamā","yadhakkaru","illā","ulū","al-albābi",null],"verseTiming":[[1,0,410],[2,410,2870],[3,2870,4280],[4,4280,5110],[5,5110,6220],[6,6220,6830],[7,6830,7940],[8,7940,10090],[9,10090,11150],[10,11150,12190],[11,12190,13240],[12,13240,14100],[13,14100,16910],[14,16910,18920],[15,18920,19940],[16,19940,20210],[17,20210,21680],[18,21680,22930],[19,22930,24850],[20,24850,25300],[21,25300,26450],[22,26450,27040],[23,27040,29210],[24,29210,30310],[25,30310,33060],[26,33060,34640],[27,34640,35510],[28,35510,36350],[29,36350,39180],[30,39180,39720],[31,39720,42410],[32,42410,44000],[33,44000,44230],[34,44230,44990],[35,44990,46310],[36,46310,48040],[37,48040,48690],[38,48690,49360],[39,49360,50450],[40,50450,51850],[41,51850,53110],[42,53110,54110],[43,54110,55330],[44,55330,57620],[45,57620,57990],[46,57990,60565]]}}