{"name":"43:11","price":"Él hace descender agua del cielo en la medida justa, y así vuelve a dar vida a un territorio árido; de la misma manera serán resucitados.","arabic":"وَٱلَّذِي نَزَّلَ مِنَ ٱلسَّمَآءِ مَآءَۢ بِقَدَرٖ فَأَنشَرۡنَا بِهِۦ بَلۡدَةٗ مَّيۡتٗاۚ كَذَٰلِكَ تُخۡرَجُونَ","category":["43 (Az-Zukhruf)","Az-Zukhruf","Surah Az-Zukhruf","Chapter Az-Zukhruf","Zukhruf","Surah Zukhruf","Chapter Zukhruf","Az Zukhruf","Surah Az Zukhruf","Chapter Az Zukhruf","Surah 43","Chapter 43","The Gold Adornments","الزُّخْرُف"],"ayahNumber":4336,"juzNumber":25,"footnotes":"en la medida: Esa “medida” en la cantidad de lluvia ha sido descubierta por la investigación científica moderna. Se estima que en un segundo se evaporan de la superficie terrestre unos 16 millones de toneladas de agua, lo que representa unos 513 billones de toneladas por año. Una cantidad similar es la que desciende en el mismo tiempo. Esto significa que la evaporación y la precipitación se cumplen de acuerdo a una “medida”. La vida sobre la Tierra depende de ese ciclo, que los seres humanos nunca podríamos reproducir de manera artificial. Una desviación mínima en esa “medida” o equilibrio crearía un desastre ecológico capaz de exterminar la vida sobre la Tierra. Sin embargo, bajo condiciones regulares, se mantiene ese ciclo como ha revelado el Corán. \n\nde la misma manera: De la misma manera que la tierra árida y muerta revive con la lluvia, los seres humanos también serán traídos de la muerte a la vida. Todo es fácil y posible para Dios.","lang":"es","version":{"key":"spanish_garcia","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1681560818,"title":"Spanish Translation - Isa Garcia","description":"Translation of the Quran meanings into Spanish by Muhammad Isa Garcia - Printed in 1433 H."},"meta":{"transliteration":"wa-alladhī nazzala mina al-samāi māan biqadarin fa-ansharnā bihi baldatan maytan kadhālika tukh'rajūna ","translations":["And the One Who","sends down","from","the sky","water","in (due) measure","then We revive","with it","a land","dead","thus","you will be brought forth","(11)"],"transliterationArr":["wa-alladhī","nazzala","mina","al-samāi","māan","biqadarin","fa-ansharnā","bihi","baldatan","maytan","kadhālika","tukh'rajūna",null],"verseTiming":[[1,0,1110],[2,1110,1870],[3,1870,2200],[4,2200,4670],[5,4670,7889],[6,7889,8819],[7,8819,10389],[8,10389,12259],[9,12259,13199],[10,13199,15179],[11,15179,16659],[12,16659,19904]]}}