{"name":"51:47","price":"Yo soy Quien construí el universo con [Mi] poder [creador]; y soy Yo quien lo expande continuamente.","arabic":"وَٱلسَّمَآءَ بَنَيۡنَٰهَا بِأَيۡيْدٖ وَإِنَّا لَمُوسِعُونَ","category":["51 (Adh-Dhariyat)","Adh-Dhariyat","Surah Adh-Dhariyat","Chapter Adh-Dhariyat","Dhariyat","Surah Dhariyat","Chapter Dhariyat","Adh Dhariyat","Surah Adh Dhariyat","Chapter Adh Dhariyat","Surah 51","Chapter 51","The Winnowing Winds","الذَّاريَات"],"ayahNumber":4722,"juzNumber":27,"footnotes":"En el Corán, revelado hace catorce siglos, en una época en que la ciencia astronómica era todavía muy primitiva, la expansión del universo está descrita de esta forma: La palabra “samaa سماء “, como figura en el versículo, es utilizada en varios lugares del Corán con el significado de cielo, espacio y universo. Aquí se utiliza con este último sentido y estableciendo que el universo se “expande” como lo describe la palabra “lamusi’un لموسعون “. Y esta es precisamente la conclusión a la cual ha llegado la ciencia actualmente. A comienzos del siglo XX, el físico ruso Alexander Friedmann y el cosmólogo belga Georges Lemaitre, calcularon teóricamente que el universo está en movimiento continuo y que se está expandiendo. Este hecho fue probado también mediante observaciones directas en 1929. Observando el cielo con un telescopio, Edwin Hubble, astrónomo estadounidense, descubrió que las estrellas y galaxias están separándose constantemente unas de otras. Un universo en donde todo está separándose implica un cosmos en expansión. Las observaciones realizadas en los años siguientes corroboran que el universo está expandiéndose constantemente. Este hecho fue explicado en el Corán cuando todavía era desconocido para todos, porque el Corán es la Palabra de Dios, el Creador y Soberano del universo.","lang":"es","version":{"key":"spanish_garcia","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1681560818,"title":"Spanish Translation - Isa Garcia","description":"Translation of the Quran meanings into Spanish by Muhammad Isa Garcia - Printed in 1433 H."},"meta":{"transliteration":"wal-samāa banaynāhā bi-aydin wa-innā lamūsiʿūna ","translations":["And the heaven","We constructed it","with strength","and indeed, We","(are) surely (its) Expanders","(47)"],"transliterationArr":["wal-samāa","banaynāhā","bi-aydin","wa-innā","lamūsiʿūna",null],"verseTiming":[[1,0,3050],[2,3050,4580],[3,4580,6360],[4,6360,8150],[5,8150,11375]]}}