{"name":"66:9","price":"¡Profeta! Haz frente a los que rechazaron el Mensaje y a los hipócritas, y sé riguroso con ellos. [Si no se arrepienten ante Dios] tendrán el Infierno por morada. ¡Qué pésimo destino!","arabic":"يَٰٓأَيُّهَا ٱلنَّبِيُّ جَٰهِدِ ٱلۡكُفَّارَ وَٱلۡمُنَٰفِقِينَ وَٱغۡلُظۡ عَلَيۡهِمۡۚ وَمَأۡوَىٰهُمۡ جَهَنَّمُۖ وَبِئۡسَ ٱلۡمَصِيرُ","category":["66 (At-Tahrim)","At-Tahrim","Surah At-Tahrim","Chapter At-Tahrim","Tahrim","Surah Tahrim","Chapter Tahrim","At Tahrim","Surah At Tahrim","Chapter At Tahrim","Surah 66","Chapter 66","The Prohibition","التحريم"],"ayahNumber":5238,"juzNumber":28,"footnotes":"Haz frente: Literalmente yaahid جاهد , esta palabra implica una amplia gama de significados, que van desde esforzarse intelectual y físicamente por una causa, a combatir por medio de las armas. Mi elección en este caso de la traducción “haz frente”, se basa en que el contexto habla de dos clases de personas: los hipócritas y los no musulmanes que convivían con los musulmanes en Medina, y son dos clases de personas que el Profeta Mujámmad, que la paz y las bendiciones de Dios sean con él, jamás combatió por las armas, sino que los enfrentó con argumentos y razonamientos. Existe una palabra específica en el Corán para el combate armado, y esta es qaatil ( قاتل ), que puede encontrarse en: “Y combatan por la causa de Dios a quienes los agredan, pero no se excedan, porque Dios no ama a los agresores” (2:190), lo que circunscribe el combate a la defensa ante fuerzas agresoras. Esto evidencia que la idea tan promocionada de que el Islam se expandió por la espada o que los musulmanes tenemos por mandato religioso combatir a través de las armas a todos los que no sean musulmanes hasta convertirlos, no es más que un mito. ","lang":"es","version":{"key":"spanish_garcia","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1681560818,"title":"Spanish Translation - Isa Garcia","description":"Translation of the Quran meanings into Spanish by Muhammad Isa Garcia - Printed in 1433 H."},"meta":{"transliteration":"yāayyuhā al-nabiyu jāhidi al-kufāra wal-munāfiqīna wa-ugh'luẓ ʿalayhim wamawāhum jahannamu wabi'sa al-maṣīru ","translations":["O","Prophet","Strive","(against) the disbelievers","and the hypocrites","and be stern","with them","And their abode","(is) Hell","and wretched is","the destination","(9)"],"transliterationArr":["yāayyuhā","al-nabiyu","jāhidi","al-kufāra","wal-munāfiqīna","wa-ugh'luẓ","ʿalayhim","wamawāhum","jahannamu","wabi'sa","al-maṣīru",null],"verseTiming":[[1,0,2680],[2,2680,4250],[3,4250,5110],[4,5110,6460],[5,6460,8180],[6,8180,8940],[7,8940,10410],[8,10410,11730],[9,11730,13390],[10,13390,14200],[11,14200,17235]]}}