{"name":"70:37","price":"en grupos, por la derecha y por la izquierda?","arabic":"عَنِ ٱلۡيَمِينِ وَعَنِ ٱلشِّمَالِ عِزِينَ","category":["70 (Al-Ma'arij)","Al-Ma'arij","Surah Al-Ma'arij","Chapter Al-Ma'arij","Ma'arij","Surah Ma'arij","Chapter Ma'arij","Al Ma'arij","Surah Al Ma'arij","Chapter Al Ma'arij","Surah 70","Chapter 70","The Ascending Stairways","المعارج"],"ayahNumber":5412,"juzNumber":29,"footnotes":"Quienes buscan por todos los medios negar a Dios, no pueden mantenerse consecuentes al no tener fundamentos sólidos para dar coherencia a su forma de vida, con su visión del mundo y con sus normas éticas, las que suelen transgredir y transformar a voluntad. Su ideología, su filosofía de vida y su política cotidiana suelen ser volubles y estar desfasadas una de otra. Por ello, se agitan (“corren de un lado a otro”) en confusión espiritual, cuando se enfrentan a la fortaleza moral de quien declara su fe en Dios. Buscan paliar esta confusión y justificar lo endeble de su cosmogonía y de su estilo de vida, intentando destruir las premisas de la fe del creyente con argumentos de gran elaboración intelectual, pero que resultan contradictorios. Su afán de “demostrar” que el creyente está errado los lleva a “dirigirse presurosos” a atacarlo, pero deben hacerlo en grupos, en tropel, pues solo pueden basarse en opiniones mayoritarias para tratar de desacreditar argumentos mucho más profundos y verdaderamente sólidos. No pueden destruir los argumentos del creyente por la vía de la lógica sencilla y la evidencia natural, así que buscan hacerlo a partir del señalamiento, la descalificación, y recurriendo a inflamar los temores y a acrecentar la ignorancia; y puesto que toda su fuerza proviene de su conformidad con opiniones superficiales pero mayoritarias, solo pueden hacer esto “en grupos”. ","lang":"es","version":{"key":"spanish_garcia","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1681560818,"title":"Spanish Translation - Isa Garcia","description":"Translation of the Quran meanings into Spanish by Muhammad Isa Garcia - Printed in 1433 H."},"meta":{"transliteration":"ʿani al-yamīni waʿani al-shimāli ʿizīna ","translations":["On","the right","and on","the left","(in) separate groups","(37)"],"transliterationArr":["ʿani","al-yamīni","waʿani","al-shimāli","ʿizīna",null],"verseTiming":[[1,0,450],[2,450,1420],[3,1420,1990],[4,1990,2950],[5,2950,5635]]}}