{"name":"7:58","price":"En una buena tierra crece vegetación abundante por voluntad de su Señor, mientras que en un territorio desértico no brota sino poco. Así explico los signos a la gente agradecida.","arabic":"وَٱلۡبَلَدُ ٱلطَّيِّبُ يَخۡرُجُ نَبَاتُهُۥ بِإِذۡنِ رَبِّهِۦۖ وَٱلَّذِي خَبُثَ لَا يَخۡرُجُ إِلَّا نَكِدٗاۚ كَذَٰلِكَ نُصَرِّفُ ٱلۡأٓيَٰتِ لِقَوۡمٖ يَشۡكُرُونَ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":1012,"juzNumber":8,"footnotes":"Abu Musa relató que el Profeta, que la paz y las bendiciones de Dios sean con él, dijo: “La guía y la sabiduría que Dios envió conmigo es como una lluvia abundante que cae a la tierra. Parte de ésta tierra es fértil, absorbe el agua y produce vegetación y pastos en abundancia. Otra parte es dura y conserva el agua, conteniéndola para beneficio de la gente, que la usa para beber, para sus animales y para riego de los cultivos. Otra porción de la tierra alcanzada era tan estéril que no contuvo el agua ni produjo vegetación. (El primero) es el caso de la persona que comprende la religión de Dios y se beneficia de lo que Dios reveló a través de mí, lo aprende y lo enseña. Y la persona que no se interesa ni acepta la Guía de Dios que reveló a través de mí (es como la tierra estéril)”. Registrado por Al-Bujari ","lang":"es","version":{"key":"spanish_garcia","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1681560818,"title":"Spanish Translation - Isa Garcia","description":"Translation of the Quran meanings into Spanish by Muhammad Isa Garcia - Printed in 1433 H."},"meta":{"transliteration":"wal-baladu al-ṭayibu yakhruju nabātuhu bi-idh'ni rabbihi wa-alladhī khabutha lā yakhruju illā nakidan kadhālika nuṣarrifu al-āyāti liqawmin yashkurūna ","translations":["And the land ","[the] pure","comes forth","its vegetation","by (the) permission","(of) its Lord","but which","is bad ","(does) not","come forth","except","(with) difficulty","Thus","We explain","the Signs","for a people","who are grateful","(58)"],"transliterationArr":["wal-baladu","al-ṭayibu","yakhruju","nabātuhu","bi-idh'ni","rabbihi","wa-alladhī","khabutha","lā","yakhruju","illā","nakidan","kadhālika","nuṣarrifu","al-āyāti","liqawmin","yashkurūna",null],"verseTiming":[[1,0,1130],[2,1130,2180],[3,2180,2990],[4,2990,4270],[5,4270,5050],[6,5050,6150],[7,6150,7100],[8,7100,7910],[9,7910,8280],[10,8280,9090],[11,9090,9840],[12,9840,10920],[13,10920,12410],[14,12410,13410],[15,13410,14760],[16,14760,16880],[17,16880,19985]]}}