{"name":"7:99","price":"¿Acaso se sentían a salvo del plan de Dios? Solo se sienten a salvo del plan de Dios los que están perdidos.","arabic":"أَفَأَمِنُواْ مَكۡرَ ٱللَّهِۚ فَلَا يَأۡمَنُ مَكۡرَ ٱللَّهِ إِلَّا ٱلۡقَوۡمُ ٱلۡخَٰسِرُونَ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":1053,"juzNumber":9,"footnotes":"El versículo muestra que sentirse seguro contra el designio de Dios y perder la esperanza en la ayuda y el socorro de Dios, representan pecados muy graves que anulan la perfección del monoteísmo. Este concepto indica también que el siervo debe dirigirse a Dios entre la esperanza y el temor. Dios nos indica a través de este versículo que los habitantes de aquel pueblo desmintieron a los Profetas, impulsados por la sensación de sentirse seguros contra los designios de Dios y por la inexistencia del temor reverencial. Dijo Al Hasan Al Basri: “A quien Dios atesta de opulencia, y no percibe que ello es una prueba, es una persona sin discernimiento”. Dijo el Profeta, que la paz y las bendiciones de Dios sean con él: “Si ven que el siervo continúa recibiendo gracias y bondades a pesar de sus continuas desobediencias, no lo duden, está siendo llevado gradualmente a la ruina”. [Ibn Yarir 7/115] ","lang":"es","version":{"key":"spanish_garcia","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1681560818,"title":"Spanish Translation - Isa Garcia","description":"Translation of the Quran meanings into Spanish by Muhammad Isa Garcia - Printed in 1433 H."},"meta":{"transliteration":"afa-aminū makra al-lahi falā yamanu makra al-lahi illā al-qawmu al-khāsirūna ","translations":["Then did they feel secure","(from the) plan","(of) Allah","But not","feel secure","(from the) plan","(of) Allah","except","the people","(who are) the losers","(99)"],"transliterationArr":["afa-aminū","makra","al-lahi","falā","yamanu","makra","al-lahi","illā","al-qawmu","al-khāsirūna",null],"verseTiming":[[1,0,1350],[2,1350,1880],[3,1880,5260],[4,5260,5880],[5,5880,6710],[6,6710,7270],[7,7270,8260],[8,8260,8800],[9,8800,9610],[10,9610,13095]]}}