{"name":"9:23","price":"¡Oh, creyentes! No tomen a sus padres y hermanos como aliados si estos prefieren la incredulidad a la fe; quien de ustedes los tome a ellos por aliados será de los opresores.","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَّخِذُوٓاْ ءَابَآءَكُمۡ وَإِخۡوَٰنَكُمۡ أَوۡلِيَآءَ إِنِ ٱسۡتَحَبُّواْ ٱلۡكُفۡرَ عَلَى ٱلۡإِيمَٰنِۚ وَمَن يَتَوَلَّهُم مِّنكُمۡ فَأُوْلَٰٓئِكَ هُمُ ٱلظَّٰلِمُونَ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1258,"juzNumber":10,"footnotes":"La obediencia absoluta es debida únicamente a Dios, dice en el Corán: “Deben obediencia absoluta a Dios y a Su Mensajero, y tengan cuidado [de desobedecerlos]. Pero quien se rehúse, sepa que Mi Mensajero solo tiene la obligación de transmitir [el Mensaje] con claridad.” (5:92). Mientras que la obediencia a los padres, es una obediencia condicionada, como dice en el Corán: “Si tus padres se esfuerzan por hacer que caigas en la idolatría de dedicar actos de adoración a otro que Dios, lo cual es algo que no te he enseñado, no los obedezcan pero trátenlos con respeto. Sigan el camino de los piadosos, pues ante Mí comparecerán y les informaré lo que hacían” (31:15). Es decir, que debemos honrar y obedecer a los padres siempre que no nos pidan algo que claramente contradiga las normas islámicas. De lo contrario, les debemos respeto y atención permanente, pero no obediencia, porque todo lo que provenga de un ser humano debe ser analizado a la luz de las enseñanzas islámicas, ya que Dios dice en el Corán: ¡Oh, creyentes! Obedezcan a Dios, obedezcan al Mensajero y a aquellos de ustedes que tengan autoridad y conocimiento. Si realmente creen en Dios y en el Día del Juicio, cuando tengan discrepancias remítanlas al juicio de Dios y del Mensajero, porque en ello hay bien y es el camino correcto” (4:59). Lo que significa que la obediencia a los seres creados está limitada por la obediencia al Creador. Cabe mencionar también, a modo de reflexión, que Dios cuestionó severamente y criticó a aquellos que siguen a sus padres sin cuestionarse si sus enseñanzas son correctas o no, dice en el Corán: “Y cuando se les dice: “Sigan lo que Dios reveló”, argumentan: “No, seguimos la tradición de nuestros padres”. ¿Acaso imitan a sus padres a pesar de que ellos no seguían una lógica ni una revelación?” (2:170).","lang":"es","version":{"key":"spanish_garcia","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1681560818,"title":"Spanish Translation - Isa Garcia","description":"Translation of the Quran meanings into Spanish by Muhammad Isa Garcia - Printed in 1433 H."},"meta":{"transliteration":"yāayyuhā alladhīna āmanū lā tattakhidhū ābāakum wa-ikh'wānakum awliyāa ini is'taḥabbū al-kuf'ra ʿalā al-īmāni waman yatawallahum minkum fa-ulāika humu al-ẓālimūna ","translations":["O you","who","believe","(Do) not","take","your fathers","and your brothers","(as) allies","if","they prefer","[the] disbelief","over","[the] belief","And whoever","takes them as allies","among you","then those","[they]","(are) the wrongdoers","(23)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","lā","tattakhidhū","ābāakum","wa-ikh'wānakum","awliyāa","ini","is'taḥabbū","al-kuf'ra","ʿalā","al-īmāni","waman","yatawallahum","minkum","fa-ulāika","humu","al-ẓālimūna",null],"verseTiming":[[1,0,3210],[2,3210,4300],[3,4300,5420],[4,5420,5830],[5,5830,8460],[6,8460,11720],[7,11720,13440],[8,13440,16070],[9,16070,16480],[10,16480,17620],[11,17620,18560],[12,18560,18980],[13,18980,21730],[14,21730,22770],[15,22770,25100],[16,25100,28040],[17,28040,30949],[18,30949,31409],[19,31409,34844]]}}