{"name":"9:29","price":"Luchen contra quienes no creen en Dios ni en el Día del Juicio, no respetan lo que Dios y Su Mensajero han vedado y no siguen la verdadera religión [el Islam] de entre aquellos de la Gente del Libro [que los hayan agredido], a menos que acepten pagar un impuesto con humildad.","arabic":"قَٰتِلُواْ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱللَّهِ وَلَا بِٱلۡيَوۡمِ ٱلۡأٓخِرِ وَلَا يُحَرِّمُونَ مَا حَرَّمَ ٱللَّهُ وَرَسُولُهُۥ وَلَا يَدِينُونَ دِينَ ٱلۡحَقِّ مِنَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ حَتَّىٰ يُعۡطُواْ ٱلۡجِزۡيَةَ عَن يَدٖ وَهُمۡ صَٰغِرُونَ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1264,"juzNumber":10,"footnotes":"impuesto: Lit. Yizia جِزِية , traducido aquí como “impuesto”, aparece solo una vez en el Corán, pero su significado y propósito han sido expuestos claramente por el Profeta Mujámmad, que la paz y las bendiciones de Dios sean con él en su Sunnah. En un Estado Islámico, todo musulmán adulto y sano está obligado a tomar las armas para participar en la defensa de su sociedad, si es atacado por una potencia extranjera, y así defender el derecho a la autodeterminación de su sociedad. Dado que esto es, esencialmente, una obligación religiosa, a los ciudadanos no musulmanes que viven en una sociedad islámica, que no comparten la ideología del Islam, no se les puede exigir, por justicia, que participen de esta batalla. Solo aquellos ciudadanos no musulmanes que podrían participar de un ejército son los que están obligados a pagar este impuesto. Por consiguiente, todos aquellos ciudadanos no musulmanes cuya condición o situación personal los eximiría de ir a la guerra, están legalmente exentos del pago del yizia, como las mujeres, los que no hayan alcanzado la madurez, los ancianos, los hombres enfermos o inválidos, los sacerdotes y los monjes. Ni en el Corán ni en la Sunnah auténtica se determina la cuota a pagar en este impuesto, pero sí está establecido que se trata de una cantidad menor que el zakat (uno de los pilares del Islam) que están obligados a pagar los musulmanes y del que, por ser un deber religioso específicamente islámico, están naturalmente exentos los no musulmanes. Algunos orientalistas sugirieron equivocadamente que algunas conversiones al Islam habrían ocurrido para evitar pagar este impuesto, pero tal afirmación es falsa, porque si un no musulmán que paga el Yizia se convirtiera al Islam, tendría que pagar el zakat, que es más elevado. ","lang":"es","version":{"key":"spanish_garcia","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1681560818,"title":"Spanish Translation - Isa Garcia","description":"Translation of the Quran meanings into Spanish by Muhammad Isa Garcia - Printed in 1433 H."},"meta":{"transliteration":"qātilū alladhīna lā yu'minūna bil-lahi walā bil-yawmi al-ākhiri walā yuḥarrimūna mā ḥarrama al-lahu warasūluhu walā yadīnūna dīna al-ḥaqi mina alladhīna ūtū al-kitāba ḥattā yuʿ'ṭū al-jiz'yata ʿan yadin wahum ṣāghirūna ","translations":["Fight","those who","(do) not","believe","in Allah","and not","in the Day","the Last","and not","they make unlawful","what","Allah has made unlawful","Allah has made unlawful","and His Messenger","and not","they acknowledge","(the) religion","(of) the truth","from","those who","were given","the Scripture","until","they pay","the jizyah","willingly","willingly","while they","(are) subdued","(29)"],"transliterationArr":["qātilū","alladhīna","lā","yu'minūna","bil-lahi","walā","bil-yawmi","al-ākhiri","walā","yuḥarrimūna","mā","ḥarrama","al-lahu","warasūluhu","walā","yadīnūna","dīna","al-ḥaqi","mina","alladhīna","ūtū","al-kitāba","ḥattā","yuʿ'ṭū","al-jiz'yata","ʿan","yadin","wahum","ṣāghirūna",null],"verseTiming":[[1,0,960],[2,960,2030],[3,2030,2410],[4,2410,3540],[5,3540,4700],[6,4700,5350],[7,5350,6430],[8,6430,7460],[9,7460,8090],[10,8090,9580],[11,9580,9970],[12,9970,10790],[13,10790,11740],[14,11740,13210],[15,13210,13800],[16,13800,15040],[17,15040,15650],[18,15650,16660],[19,16660,17890],[20,17890,19140],[21,19140,19690],[22,19690,20610],[23,20610,20990],[24,20990,22120],[25,22120,22670],[26,22670,23730],[27,23730,24590],[28,24590,25200],[29,25200,26280],[30,26280,26770],[31,26770,28670],[32,28670,29200],[33,29200,32405]]}}