{"name":"9:31","price":"Tomaron [los judíos] a sus rabinos y [los cristianos] a sus monjes y al Mesías, hijo de María, por divinidades en lugar de Dios. Pero solo se les había ordenado [en la Tora y el Evangelio] adorar a Dios, la única divinidad. No existe nada ni nadie con derecho a ser adorado salvo Él. ¡Glorificado sea! ¡Cómo pueden dedicar actos de adoración a otros!","arabic":"ٱتَّخَذُوٓاْ أَحۡبَارَهُمۡ وَرُهۡبَٰنَهُمۡ أَرۡبَابٗا مِّن دُونِ ٱللَّهِ وَٱلۡمَسِيحَ ٱبۡنَ مَرۡيَمَ وَمَآ أُمِرُوٓاْ إِلَّا لِيَعۡبُدُوٓاْ إِلَٰهٗا وَٰحِدٗاۖ لَّآ إِلَٰهَ إِلَّا هُوَۚ سُبۡحَٰنَهُۥ عَمَّا يُشۡرِكُونَ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1266,"juzNumber":10,"footnotes":"por divinidades: Este versículo evidencia que quien obedece a una persona, negándose a obedecer al Corán y la Sunnah, haciendo lícito lo prohibido o viceversa, y obedeciéndolo en lo que sabe es una desobediencia a Dios, toma a esa persona como una divinidad junto a Dios, transformándolo en asociado o copartícipe, y esto anula el auténtico monoteísmo (Tauhid), porque Dios denominó tal obediencia como adoración. Dijo el Sheij Al Islam Ibn Taimiah sobre el significado de “han tomado a sus sacerdotes y a sus monjes”: “Estas personas han tomado a sus sacerdotes y monjes como divinidades por haberlos obedecido en cuanto legislaron permitiendo lo que había prohibido Dios y prohibiendo lo que había permitido Dios. Esto puede darse de dos maneras: La primera es que sepan que sus líderes han cambiado la religión tal como la reveló Dios, pero de todas maneras los siguen sabiendo que contradicen las enseñanzas proféticas, considerando lícito lo prohibido e ilícito lo permitido. Esto es, sin dudas, incredulidad (Kufr). Dios y Su Mensajero lo consideran una forma de idolatría, aunque no se postren ante ellos. De la misma manera, aquellos que sigan a algún erudito sabiendo que al hacerlo están contradiciendo a Dios y a Su Mensajero, habrán cometido, tal como los primeros, un acto de idolatría. La segunda es que consideren en su fe que lo prohibido es ilícito (haram) y lo permitido es lícito (halal), pero siguen a sus líderes sabiendo que esto es una desobediencia a Dios. Quien hace esto es igual que aquel musulmán que comete desobediencias (pecados), por lo que son pecadores desobedientes. Sobre esto dijo el Mensajero de Dios, que la paz y las bendiciones de Dios sean con él: “La obediencia es obligatoria solo en lo lícito”. ","lang":"es","version":{"key":"spanish_garcia","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1681560818,"title":"Spanish Translation - Isa Garcia","description":"Translation of the Quran meanings into Spanish by Muhammad Isa Garcia - Printed in 1433 H."},"meta":{"transliteration":"ittakhadhū aḥbārahum waruh'bānahum arbāban min dūni al-lahi wal-masīḥa ib'na maryama wamā umirū illā liyaʿbudū ilāhan wāḥidan lā ilāha illā huwa sub'ḥānahu ʿammā yush'rikūna ","translations":["They have taken","their rabbis","and their monks","(as) Lords","besides","besides","Allah","and the Messiah","son","(of) Maryam","And not","they were commanded","except","that they worship","One God","One God","(There) is no","god","except","Him","Glory be to Him","from what","they associate (with Him)","(31)"],"transliterationArr":["ittakhadhū","aḥbārahum","waruh'bānahum","arbāban","min","dūni","al-lahi","wal-masīḥa","ib'na","maryama","wamā","umirū","illā","liyaʿbudū","ilāhan","wāḥidan","lā","ilāha","illā","huwa","sub'ḥānahu","ʿammā","yush'rikūna",null],"verseTiming":[[1,0,2690],[2,2690,4190],[3,4190,5800],[4,5800,6940],[5,6940,8890],[6,8890,9710],[7,9710,10610],[8,10610,11890],[9,11890,12410],[10,12410,13280],[11,13280,15130],[12,15130,15850],[13,15850,17300],[14,17300,18350],[15,18350,20850],[16,20850,23010],[17,23010,23930],[18,23930,26510],[19,26510,28260],[20,28260,29660],[21,29660,32399],[22,32399,33309],[23,33309,34259],[24,34259,34809],[25,34809,36659],[26,36659,38669],[27,38669,42004]]}}