{"name":"9:5","price":"Pero cuando hayan pasado los meses sagrados, maten a esos idólatras dondequiera que los encuentren, captúrenlos, sítienlos y acéchenlos en todo lugar. Pero si se arrepienten [y aceptan el Islam], cumplen con la oración prescrita y pagan el zakat, déjenlos en paz. Dios es Absolvedor, Misericordioso.","arabic":"فَإِذَا ٱنسَلَخَ ٱلۡأَشۡهُرُ ٱلۡحُرُمُ فَٱقۡتُلُواْ ٱلۡمُشۡرِكِينَ حَيۡثُ وَجَدتُّمُوهُمۡ وَخُذُوهُمۡ وَٱحۡصُرُوهُمۡ وَٱقۡعُدُواْ لَهُمۡ كُلَّ مَرۡصَدٖۚ فَإِن تَابُواْ وَأَقَامُواْ ٱلصَّلَوٰةَ وَءَاتَوُاْ ٱلزَّكَوٰةَ فَخَلُّواْ سَبِيلَهُمۡۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1240,"juzNumber":10,"footnotes":" meses sagrados: Mujárram, Rayab, Dhul-Qa‘dah y Dhul-Jíyyah, en los cuales es prohibido el combate. \n\n maten a esos idólatras: Los que persiguieron y mataron a los creyentes debido a su fe, ya que al ser crímenes de lesa humanidad no prescriben ni ingresan dentro de ninguna amnistía. \n\ndéjenlos en paz: Cada versículo del Corán debe ser leído e interpretado dentro del contexto global del Corán. Este versículo, que habla de una posible conversión al Islam por parte de “aquellos que atribuyen divinidad a otros junto con Dios” con los cuales los creyentes están en guerra, debe, por tanto, ser considerado en conjunción con varios preceptos fundamentales del Corán. Uno de ellos, “no se puede forzar a nadie a creer” (2:256), prohíbe categóricamente cualquier intento de convertir a los no musulmanes por la fuerza, lo que excluye la posibilidad de que los musulmanes exijan o esperen que un enemigo vencido acepte el Islam a cambio de inmunidad. En segundo lugar, el Corán ordena: “Combatan por la causa de Dios a quienes los agredan, pero no se excedan, porque Dios no ama a los agresores” (2:190); y: “Cada vez que su pueblo los incita a combatir contra ustedes se precipitan a agredirlos. A estos, si no dan la palabra de que no combatirán contra ustedes, proponen la paz y contienen la agresión, aprésenlos y ajustícienlos [en el curso del combate] donde quiera que los encuentren. A ellos se les permite combatirlos” (4:91). La guerra es solo permisible en defensa propia, con la condición adicional de que: “Pero si ellos cesan de combatirlos, sepan que Dios es Absolvedor, Misericordioso” (2:192), y: “Pero si ellos cesan de combatir, que no haya más hostilidades” (2:193). Los versículos 4 y 6 aclaran aún más la actitud que deben adoptar los creyentes hacia aquellos no musulmanes que no sean hostiles. Ver también Corán 60:8-9.\n","lang":"es","version":{"key":"spanish_garcia","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1681560818,"title":"Spanish Translation - Isa Garcia","description":"Translation of the Quran meanings into Spanish by Muhammad Isa Garcia - Printed in 1433 H."},"meta":{"transliteration":"fa-idhā insalakha al-ashhuru al-ḥurumu fa-uq'tulū al-mush'rikīna ḥaythu wajadttumūhum wakhudhūhum wa-uḥ'ṣurūhum wa-uq'ʿudū lahum kulla marṣadin fa-in tābū wa-aqāmū al-ṣalata waātawū al-zakata fakhallū sabīlahum inna al-laha ghafūrun raḥīmun ","translations":["Then when","have passed","the sacred months","the sacred months","then kill","the polytheists","wherever","you find them","and seize them","and besiege them","and sit (in wait)","for them","(at) every","place of ambush","But if","they repent","and establish","the prayer","and give","the zakah","then leave","their way","Indeed","Allah","(is) Oft-Forgiving","Most Merciful","(5)"],"transliterationArr":["fa-idhā","insalakha","al-ashhuru","al-ḥurumu","fa-uq'tulū","al-mush'rikīna","ḥaythu","wajadttumūhum","wakhudhūhum","wa-uḥ'ṣurūhum","wa-uq'ʿudū","lahum","kulla","marṣadin","fa-in","tābū","wa-aqāmū","al-ṣalata","waātawū","al-zakata","fakhallū","sabīlahum","inna","al-laha","ghafūrun","raḥīmun",null],"verseTiming":[[1,0,670],[2,670,2290],[3,2290,3350],[4,3350,4180],[5,4180,5030],[6,5030,6500],[7,6500,7330],[8,7330,9010],[9,9010,10360],[10,10360,11950],[11,11950,13000],[12,13000,13720],[13,13720,14330],[14,14330,15160],[15,15160,17370],[16,17370,18520],[17,18520,19530],[18,19530,20780],[19,20780,21880],[20,21880,23060],[21,23060,24080],[22,24080,26120],[23,26120,27560],[24,27560,28560],[25,28560,29420],[26,29420,32505]]}}