{"name":"9:60","price":"El zakat debe ser distribuido entre los pobres, los menesterosos, los que trabajan en su recaudación y distribución, aquellos de los que se desea ganar sus corazones, la liberación de los prisioneros, los endeudados, la causa de Dios y el viajero insolvente. Esto es un deber prescrito por Dios, y Dios lo sabe todo, es Sabio.","arabic":"۞ إِنَّمَا ٱلصَّدَقَٰتُ لِلۡفُقَرَآءِ وَٱلۡمَسَٰكِينِ وَٱلۡعَٰمِلِينَ عَلَيۡهَا وَٱلۡمُؤَلَّفَةِ قُلُوبُهُمۡ وَفِي ٱلرِّقَابِ وَٱلۡغَٰرِمِينَ وَفِي سَبِيلِ ٱللَّهِ وَٱبۡنِ ٱلسَّبِيلِۖ فَرِيضَةٗ مِّنَ ٱللَّهِۗ وَٱللَّهُ عَلِيمٌ حَكِيمٞ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1295,"juzNumber":10,"footnotes":"los pobres: Son los que no poseen nada y no alcanzan a vivir con dignidad. \n\nlos menesterosos: Son los que poseen apenas lo mínimo para vivir con dignidad. \n\nlos que trabajan en su recaudación y distribución, aquellos de los que se desea ganar sus corazones: Son personas de prestigio entre los suyos, y de quienes se espera que acepten el Islam, detengan su hostilidad, refuercen su fe y su Islam, o se islamice alguno de los suyos.\n \nla liberación de los prisioneros: Son los esclavos que están negociando su manumisión con sus amos. Se les ayuda del zakat para lograr su libertad. También aplicable al rescate de cautivos, secuestrados y prisioneros de guerra en campo enemigo. \n\nlos endeudados: Estos son de dos clases: a) Los que se han endeudado para conciliar entre dos personas en disputa. Se les entrega lo suficiente para saldar su deuda. b) Los que se han endeudado por motivos personales y no pueden saldar sus deudas. \n\nla causa de Dios: Son las personas que se dedican a elevar la palabra de Dios, como los que luchan por alguna de sus causas o los que divulgan el Islam. \n\nel viajero insolvente: Es el viajero que ha perdido sus posesiones durante el viaje y no puede volver a su tierra. A esta persona se le debe dar lo que necesite para poder regresar a su país, aunque sea rico en su tierra. ","lang":"es","version":{"key":"spanish_garcia","direction":"ltr","language_iso_code":"es","version":"1.0.0","last_update":1681560818,"title":"Spanish Translation - Isa Garcia","description":"Translation of the Quran meanings into Spanish by Muhammad Isa Garcia - Printed in 1433 H."},"meta":{"transliteration":"innamā al-ṣadaqātu lil'fuqarāi wal-masākīni wal-ʿāmilīna ʿalayhā wal-mu-alafati qulūbuhum wafī al-riqābi wal-ghārimīna wafī sabīli al-lahi wa-ib'ni al-sabīli farīḍatan mina al-lahi wal-lahu ʿalīmun ḥakīmun ","translations":["Only","the charities","(are) for the poor","and the needy","and those who collect","them","and the ones inclined","their hearts","and in","the (freeing of) the necks","and for those in debt","and in","(the) way","(of) Allah","and the wayfarer ","and the wayfarer ","an obligation","from","Allah","And Allah","(is) All-Knowing","All-Wise","(60)"],"transliterationArr":["innamā","al-ṣadaqātu","lil'fuqarāi","wal-masākīni","wal-ʿāmilīna","ʿalayhā","wal-mu-alafati","qulūbuhum","wafī","al-riqābi","wal-ghārimīna","wafī","sabīli","al-lahi","wa-ib'ni","al-sabīli","farīḍatan","mina","al-lahi","wal-lahu","ʿalīmun","ḥakīmun",null],"verseTiming":[[1,0,2019],[2,2019,3419],[3,3419,6499],[4,6499,8119],[5,8119,9789],[6,9789,10899],[7,10899,12679],[8,12679,14099],[9,14099,14509],[10,14509,15649],[11,15649,17499],[12,17499,18069],[13,18069,19309],[14,19309,19909],[15,19909,20549],[16,20549,23659],[17,23659,24889],[18,24889,25909],[19,25909,28999],[20,28999,30069],[21,30069,30989],[22,30989,34454]]}}