{"name":"10:87","price":"87 Nous avons révélé à Moïse et son frère : « Faites dresser en Egypte, pour votre peuple, des tentes orientées vers la direction de la prière que vous accomplirez assidûment[590]. Et fais heureuse annonce aux croyants ! »","arabic":"وَأَوۡحَيۡنَآ إِلَىٰ مُوسَىٰ وَأَخِيهِ أَن تَبَوَّءَا لِقَوۡمِكُمَا بِمِصۡرَ بُيُوتٗا وَٱجۡعَلُواْ بُيُوتَكُمۡ قِبۡلَةٗ وَأَقِيمُواْ ٱلصَّلَوٰةَۗ وَبَشِّرِ ٱلۡمُؤۡمِنِينَ","category":["10 (Yunus)","Yunus","Surah Yunus","Chapter Yunus","Surah 10","Chapter 10","Jonah","يونُس"],"ayahNumber":1451,"juzNumber":11,"footnotes":"[590] Demeures temporaires, différentes de leurs maisons habituelles, en préparation à leur sortie d’Egypte, explique Ibn ‛Achour sur lequel nous nous sommes appuyé pour la traduction de ce verset. Selon l’exégète tunisien, ce verset coranique ferait référence à ce passage biblique du début du chapitre 14 de l’Exode, qui précède justement le récit de la sortie d’Egypte : L’Eternel parla à Moïse, et dit : « Parle aux enfants d’Israël. Qu’ils se détournent et qu’ils campent devant Pi Hahiroth, entre Migdol et la mer, vis-à-vis de Baal Tsephon. C’est en face de ce lieu que vous camperez, près de la mer. » Or, la suite de ce passage coranique, le verset 90 en particulier, semble bien situer ce verset peu avant la sortie d’Egypte. Autre interprétation retenue par de nombreux exégètes : choisissez pour votre peuple des demeures en Egypte dont vous ferez vos temples (afin d’éviter les persécutions des Egyptiens) et où vous accomplirez vos prières.","lang":"fr","version":{"key":"french_rashid","direction":"ltr","language_iso_code":"fr","version":"1.0.0","last_update":1622974081,"title":"French Translation - Rashid Maash","description":"Translation of the Quran meanings into French by Rashid Maash"},"meta":{"transliteration":"wa-awḥaynā ilā mūsā wa-akhīhi an tabawwaā liqawmikumā bimiṣ'ra buyūtan wa-ij'ʿalū buyūtakum qib'latan wa-aqīmū al-ṣalata wabashiri al-mu'minīna ","translations":["And We inspired","to","Musa","and his brother","that","Settle","your people","in Egypt","(in) houses","and make","your houses","(as) places of worship","and establish","the prayer","And give glad tidings","(to) the believers","(87)"],"transliterationArr":["wa-awḥaynā","ilā","mūsā","wa-akhīhi","an","tabawwaā","liqawmikumā","bimiṣ'ra","buyūtan","wa-ij'ʿalū","buyūtakum","qib'latan","wa-aqīmū","al-ṣalata","wabashiri","al-mu'minīna",null],"verseTiming":[[1,0,1490],[2,1490,3050],[3,3050,3620],[4,3620,4350],[5,4350,5470],[6,5470,6380],[7,6380,7600],[8,7600,9010],[9,9010,9850],[10,9850,11490],[11,11490,12390],[12,12390,13650],[13,13650,15270],[14,15270,16210],[15,16210,18710],[16,18710,20170],[17,20170,23595]]}}