{"name":"16:66","price":"66 Vous avez dans les bestiaux matière à méditer. De ce qui se trouve à l’intérieur de leur corps, Nous vous abreuvons d’un lait pur et agréable à boire qui provient de la conjonction entre le contenu de l’intestin et le sang[705].","arabic":"وَإِنَّ لَكُمۡ فِي ٱلۡأَنۡعَٰمِ لَعِبۡرَةٗۖ نُّسۡقِيكُم مِّمَّا فِي بُطُونِهِۦ مِنۢ بَيۡنِ فَرۡثٖ وَدَمٖ لَّبَنًا خَالِصٗا سَآئِغٗا لِّلشَّٰرِبِينَ","category":["16 (An-Nahl)","An-Nahl","Surah An-Nahl","Chapter An-Nahl","Nahl","Surah Nahl","Chapter Nahl","An Nahl","Surah An Nahl","Chapter An Nahl","Surah 16","Chapter 16","The Bee","النَّحل"],"ayahNumber":1967,"juzNumber":14,"footnotes":"[705] Voici le commentaire que fit le docteur Maurice Bucaille de ce verset dans son ouvrage intitulé La Bible, le Coran et la science : « Du point de vue scientifique, il faut faire appel à des notions de physiologie pour saisir le sens de ce verset. Les substances essentielles qui assurent la nutrition de l’organisme en général proviennent de transformations chimiques qui s’opèrent tout au long du tube digestif. Ces substances proviennent d’éléments présents dans le contenu de l’intestin. Lorsque, dans l’intestin, elles arrivent au stade voulu de transformation chimique, elles passent à travers la paroi de celui-ci vers la circulation générale. Ce passage se fait de deux façons : ou bien directement par ce qu’on appelle les vaisseaux lymphatiques, ou bien indirectement par la circulation porte qui les conduit d’abord dans le foie où elles subissent des modifications ; elles en émergent pour rejoindre enfin la circulation générale. De cette manière, tout transite finalement par la circulation sanguine. Les constituants du lait sont sécrétés par les glandes mammaires. Celles-ci se nourrissent, si l’on peut dire, des produits de la digestion des aliments qui leur sont apportés par le sang circulant. Le sang joue donc un rôle de collecteur et de transporteur de matériaux extraits des aliments pour apporter la nutrition aux glandes mammaires productrices de lait, comme à n’importe quel autre organe. Ici, tout procède au départ d’une mise en présence du contenu intestinal et du sang au niveau même de la paroi intestinale. Cette notion précise relève des acquisitions de la chimie et de la physiologie de la digestion. Elle était rigoureusement inconnue au temps du Prophète Muhammad : sa connaissance remonte à la période moderne. Quant à la découverte de la circulation du sang, elle est l’œuvre de Harvey et se situe dix siècles environ après la Révélation coranique. »","lang":"fr","version":{"key":"french_rashid","direction":"ltr","language_iso_code":"fr","version":"1.0.0","last_update":1622974081,"title":"French Translation - Rashid Maash","description":"Translation of the Quran meanings into French by Rashid Maash"},"meta":{"transliteration":"wa-inna lakum fī al-anʿāmi laʿib'ratan nus'qīkum mimmā fī buṭūnihi min bayni farthin wadamin labanan khāliṣan sāighan lilshāribīna ","translations":["And indeed","for you","in","the cattle","(is) a lesson","We give you to drink","from what","(is) in","their bellies","from","between","bowels","and blood","milk","pure","palatable","to the drinkers","(66)"],"transliterationArr":["wa-inna","lakum","fī","al-anʿāmi","laʿib'ratan","nus'qīkum","mimmā","fī","buṭūnihi","min","bayni","farthin","wadamin","labanan","khāliṣan","sāighan","lilshāribīna",null],"verseTiming":[[1,0,1410],[2,1410,2020],[3,2020,2270],[4,2270,3580],[5,3580,5040],[6,5040,6450],[7,6450,8300],[8,8300,8750],[9,8750,10140],[10,10140,11370],[11,11370,12060],[12,12060,13520],[13,13520,14240],[14,14240,15260],[15,15260,16580],[16,16580,17850],[17,17850,19090],[18,19090,22470],[19,22470,25595]]}}