{"name":"38:24","price":"24 David répondit : « Ton frère t’a lésé en te réclamant ta brebis pour l’ajouter aux siennes. » Les gens[1171] sont souvent injustes les uns envers les autres dans leurs relations, à l’exception de ceux, bien rares, qui croient et accomplissent de bonnes œuvres. Comprenant que Nous l’avions mis à l’épreuve, David se jeta face contre terre, implorant le pardon de son Seigneur et se repentant de son erreur[1172]. ","arabic":"قَالَ لَقَدۡ ظَلَمَكَ بِسُؤَالِ نَعۡجَتِكَ إِلَىٰ نِعَاجِهِۦۖ وَإِنَّ كَثِيرٗا مِّنَ ٱلۡخُلَطَآءِ لَيَبۡغِي بَعۡضُهُمۡ عَلَىٰ بَعۡضٍ إِلَّا ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ وَقَلِيلٞ مَّا هُمۡۗ وَظَنَّ دَاوُۥدُ أَنَّمَا فَتَنَّٰهُ فَٱسۡتَغۡفَرَ رَبَّهُۥ وَخَرَّۤ رَاكِعٗاۤ وَأَنَابَ۩","category":["38 (Sad)","Sad","Surah Sad","Chapter Sad","Surah 38","Chapter 38","Saad","ص"],"ayahNumber":3994,"juzNumber":23,"footnotes":"[1171] Les associés, selon la majorité des commentateurs.\n[1172] De nombreux exégètes mentionnent au niveau de ce récit tout ou partie d’une histoire tirée de l’Ancien Testament - dont le croyant est en droit de douter - selon laquelle David, qui disposait déjà d’un grand nombre de femmes, aurait convoité l’épouse de l’un de ses lieutenants qu’il aurait même envoyé se faire tuer au combat afin de pouvoir l’épouser. L’irruption des deux plaideurs dans son oratoire aurait donc eu pour seul objectif de lui faire prendre conscience de son erreur, la brebis symbolisant ici la femme. Toutefois, si ce récit fait bien allusion à cet épisode, les termes du Coran indiquent seulement que David a été blâmé pour avoir demandé à cet homme de répudier sa femme afin de pouvoir l’épouser ou de se désister en sa faveur, si le mariage n’avait pas encore été célébré. On est donc loin des péchés que la Bible attribue à David et à d’autres prophètes qui, selon le Coran, sont les êtres les plus vertueux, si bien que, s’il leur arrive de commettre une faute vénielle, ils s’empressent de s’en repentir. C’est le cas notamment d’Adam qui, selon le Coran, s’est repenti de sa faute, tandis que les chrétiens - et non la Bible - font du péché originel, justifiant la Rédemption par la crucifixion du Christ, le fondement de leur religion.","lang":"fr","version":{"key":"french_rashid","direction":"ltr","language_iso_code":"fr","version":"1.0.0","last_update":1622974081,"title":"French Translation - Rashid Maash","description":"Translation of the Quran meanings into French by Rashid Maash"},"meta":{"transliteration":"qāla laqad ẓalamaka bisuāli naʿjatika ilā niʿājihi wa-inna kathīran mina al-khulaṭāi layabghī baʿḍuhum ʿalā baʿḍin illā alladhīna āmanū waʿamilū al-ṣāliḥāti waqalīlun mā hum waẓanna dāwūdu annamā fatannāhu fa-is'taghfara rabbahu wakharra rākiʿan wa-anāba ","translations":["He said","Certainly","he has wronged you","by demanding","your ewe","to","his ewes","And indeed","many","of","the partners","certainly oppress","some of them","[on]","another","except","those who","believe","and do","righteous deeds","and few","(are) they","(are) they","And became certain","Dawood","that","We (had) tried him","and he asked forgiveness","(of) his Lord","and fell down","bowing","and turned in repentance","(24)"],"transliterationArr":["qāla","laqad","ẓalamaka","bisuāli","naʿjatika","ilā","niʿājihi","wa-inna","kathīran","mina","al-khulaṭāi","layabghī","baʿḍuhum","ʿalā","baʿḍin","illā","alladhīna","āmanū","waʿamilū","al-ṣāliḥāti","waqalīlun","mā","hum","waẓanna","dāwūdu","annamā","fatannāhu","fa-is'taghfara","rabbahu","wakharra","rākiʿan","wa-anāba",""],"verseTiming":[[1,0,660],[2,660,1160],[3,1160,2010],[4,2010,3000],[5,3000,4020],[6,4020,4640],[7,4640,6210],[8,6210,7550],[9,7550,8460],[10,8460,9470],[11,9470,12160],[12,12160,13130],[13,13130,14080],[14,14080,14690],[15,14690,15540],[16,15540,16090],[17,16090,17040],[18,17040,18200],[19,18200,18900],[20,18900,20070],[21,20070,22160],[22,22160,23749],[23,23749,25379],[24,25379,26479],[25,26479,27759],[26,27759,28759],[27,28759,30479],[28,30479,32459],[29,32459,33789],[30,33789,34819],[31,34819,35619],[32,35619,36439],[33,36439,37989],[34,37989,40304]]}}