{"name":"11:18","price":"18਼ ਉਸ ਵਿਅਕਤੀ ਤੋਂ ਵਧਕੇ ਜ਼ਾਲਮ ਕੌਣ ਹੋਵੇਗਾ ਜਿਹੜਾ ਅੱਲਾਹ ’ਤੇ ਹੀ ਝੂਠ ਜੜੇ ? ਇਹ ਸਾਰੇ ਲੋਕ ਅੱਲਾਹ ਦੇ ਹਜ਼ੂਰ ਪੇਸ਼ ਕੀਤੇ ਜਾਣਗੇ ਅਤੇ (ਫ਼ਰਿਸ਼ਤੇ) ਗਵਾਹੀ ਦੇਣਗੇ ਕਿ ਇਹ ਉਹ ਲੋਕ ਹਨ ਜਿਨ੍ਹਾਂ ਨੇ ਆਪਣੇ ਰੱਬ ’ਤੇ ਝੂਠ ਜੜ੍ਹਿਆ ਸੀ। ਸੁਣ ਲਓ। ਅੱਲਾਹ ਦੀ ਫਿਟਕਾਰ ਜ਼ਾਲਮਾਂ ਲਈ ਹੈ।2","arabic":"وَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبًاۚ أُوْلَٰٓئِكَ يُعۡرَضُونَ عَلَىٰ رَبِّهِمۡ وَيَقُولُ ٱلۡأَشۡهَٰدُ هَٰٓؤُلَآءِ ٱلَّذِينَ كَذَبُواْ عَلَىٰ رَبِّهِمۡۚ أَلَا لَعۡنَةُ ٱللَّهِ عَلَى ٱلظَّٰلِمِينَ","category":["11 (Hud)","Hud","Surah Hud","Chapter Hud","Surah 11","Chapter 11","Hud","هود"],"ayahNumber":1491,"juzNumber":12,"footnotes":"2 ਇਸ ਦੀ ਪੁਸ਼ਟੀ ਇਹ ਹਦੀਸ ਕਰਦੀ ਹੈ ਜਿਸ ਨੂੰ ਸਫ਼ਵਾਨ ਬਿਨ ਮੁਹੱਰਰ ਦੱਸਿਆ ਹੈ ਕਿ ਅਬਦੁੱਲਾ ਬਿਨ ਉਮਰ (ਰ:ਅ:) ਤਵਾਫ਼ ਕਰ ਰਹੇ ਸੀ ਕਿ ਇਕ ਵਿਅਕਤੀ ਆਇਆ ਤੇ ਆਖਣ ਲੱਗਾ, ਕੀ ਤੁਸੀਂ ਨਬੀ (ਸ:) ਦੇ ਬਾਰੇ ਕੁਝ ਸੁਣਿਆ ਹੈ? ਇਬਨੇ-ਉਮਰ (ਰ:ਅ:) ਨੇ ਆਖਿਆ ਕਿ ਮੈਨੇ ਨਬੀ ਕਰੀਮ (ਸ:) ਤੋਂ ਇਹ ਸੁਣਿਆ ਹੈ ਕਿ ਮੋਮਿਨ ਨੂੰ ਅੱਲਾਹ ਦੇ ਨੇੜੇ ਲਿਆਂਦਾ ਜਾਵੇਗਾ। ਹੱਸ਼ਾਮ ਦਾ ਕਹਿਣਾ ਹੈ ਕਿ ਮੋਮਿਨ ਆਪਣੇ ਰੱਬ ਦੇ ਇੱਨਾ ਨੇੜੇ ਹੋ ਜਾਵੇਗਾ ਕਿ ਅੱਲਾਹ ਉਸ ਉੱਤੇ ਆਪਣਾ ਪੱਟ ਰੱਖ ਦੇਵੇਗਾ ਅਤੇ ਉਸ ਤੋਂ ਉਸ ਦੇ ਗੁਨਾਹਾਂ ਦੀ ਪੁਸ਼ਟੀ ਕਰਾਵਾਏਗਾ (ਅੱਲਾਹ ਉਸ ਨੂੰ ਆਖੇਗਾ) ਕੀ ਤੈਨੂੰ ਆਪਣਾ ਫਲਾਨਾ ਗੁਨਾਹ ਯਾਦ ਹੈ? ਉਹ ਮੋਮਿਨ ਦੋ ਬਾਰ ਆਖੇਗਾ ਕਿ ਮੈਂ ਜਾਣਦਾ ਹਾਂ ਹੇ ਮੇਰੇ ਰੱਬ ਮੈਂ ਜਾਣਦਾ ਹਾਂ। ਉਸ ਸਮੇਂ ਅੱਲਾਹ ਆਖੇਗਾ ਕਿ ਮੈਨੇ ਸੰਸਾਰ ਵਿਚ ਤੇਰੇ ਗੁਨਾਹਾਂ ਉੱਤੇ ਪੜਦਾ ਪਾਇਆ ਸੀ ਅਤੇ ਅੱਜ ਮੈਂ ਉਹਨਾਂ ਨੂੰ ਤੇਰੇ ਲਈ ਮਾਫ਼ ਕਰਦਾ ਹਾਂ। ਫਿਰ ਇਸ ਦੀ ਨੇਕੀਆਂ ਦਾ ਰਜਿਸਟਰ ਬੰਦ ਕਰ ਦਿੱਤਾ ਜਾਵੇਗਾ। ਅਤੇ ਦੂਜੇ ਲੋਕਾ ਦਾ ਜਾਂ ਕਾਫ਼ਿਰਾਂ ਦਾ ਹਾਲ ਇਹ ਹੋਵੇਗਾ ਕਿ ਗੁਵਾਹਾਂ ਦੇ ਸਾਮਣੇ ਖੁਲੱਮ ਖੱਲਾ ਆਖਿਆ ਜਾਵੇਗਾ ਕਿ ਇਹ ਉਹ ਲੋਕ ਹਨ ਜਿਨ੍ਹਾਂ ਨੇ ਆਪਣੇ ਰੱਬ ਉੱਤੇ ਝੂਠ ਮੜ੍ਹਿਆ ਸੀ। (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 4685)","lang":"pa","version":{"key":"punjabi_arif","direction":"ltr","language_iso_code":"pa","version":"1.0.0","last_update":1666783255,"title":"Punjabi translation","description":"Translation of the Quran meanings into Punjabi by Arif Halim, published by Darussalam"},"meta":{"transliteration":"waman aẓlamu mimmani if'tarā ʿalā al-lahi kadhiban ulāika yuʿ'raḍūna ʿalā rabbihim wayaqūlu al-ashhādu hāulāi alladhīna kadhabū ʿalā rabbihim alā laʿnatu al-lahi ʿalā al-ẓālimīna ","translations":["And who","(is) more unjust","than (he) who","invents","against","Allah","a lie","Those","will be presented","before","their Lord","and will say","the witnesses","These (are)","those who","lied","against","their Lord","No doubt","(The) curse of Allah","(The) curse of Allah","(is) on","the wrongdoers","(18)"],"transliterationArr":["waman","aẓlamu","mimmani","if'tarā","ʿalā","al-lahi","kadhiban","ulāika","yuʿ'raḍūna","ʿalā","rabbihim","wayaqūlu","al-ashhādu","hāulāi","alladhīna","kadhabū","ʿalā","rabbihim","alā","laʿnatu","al-lahi","ʿalā","al-ẓālimīna",null],"verseTiming":[[1,0,710],[2,710,1530],[3,1530,3370],[4,3370,4290],[5,4290,4690],[6,4690,5590],[7,5590,7220],[8,7220,9680],[9,9680,10850],[10,10850,11520],[11,11520,12600],[12,12600,13650],[13,13650,14990],[14,14990,19060],[15,19060,20100],[16,20100,21030],[17,21030,21660],[18,21660,23410],[19,23410,24050],[20,24050,24860],[21,24860,25780],[22,25780,26210],[23,26210,30135]]}}