{"name":"13:28","price":"28਼ ਜਿਹੜੇ ਲੋਕੀ ਈਮਾਨ ਲਿਆਏ ਉਹਨਾਂ ਦੇ ਹਿਰਦਿਆਂ ਨੂੰ ਅੱਲਾਹ ਦੇ ਸਿਮਰਨ ਨਾਲ ਹੀ ਸ਼ਾਂਤੀ ਪ੍ਰਾਪਤ ਹੁੰਦੀ ਹੈ। (ਹੇ ਲੋਕੋ!) ਚੇਤੇ ਰੱਖੋ ਕਿ ਅੱਲਾਹ ਦਾ ਸਿਮਰਨ ਕਰਨ ਨਾਲ ਹੀ ਮਨਾਂ ਨੂੰ ਸ਼ਾਂਤੀ ਪ੍ਰਾਪਤ ਹੁੰਦੀ ਹੈ।2","arabic":"ٱلَّذِينَ ءَامَنُواْ وَتَطۡمَئِنُّ قُلُوبُهُم بِذِكۡرِ ٱللَّهِۗ أَلَا بِذِكۡرِ ٱللَّهِ تَطۡمَئِنُّ ٱلۡقُلُوبُ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd","Chapter Ar-Ra'd","Ra'd","Surah Ra'd","Chapter Ra'd","Ar Ra'd","Surah Ar Ra'd","Chapter Ar Ra'd","Surah 13","Chapter 13","The Thunder","الرَّعد"],"ayahNumber":1735,"juzNumber":13,"footnotes":"1 ਅੱਲਾਹ ਦਾ ਸਿਮਰਨ ਕਰਨ ਅਤੇ ਉਸ ਦੀ ਪਵਿੱਤਰਤਾ ਤੇ ਵਡਿਆਈ ਦੀ ਚਰਚਾ ਕਰਨ ਦੇ ਸੰਬੰਧ ਵਿਚ ਅੱਲਾਹ ਦੇ ਰਸੂਲ (ਸ:) ਨੇ ਫ਼ਰਮਾਇਆ, ਉਸ ਵਿਅਕਤੀ ਦੀ ਉਦਾਹਰਨ, ਜਿਹੜਾ ਆਪਣੇ ਰੱਬ ਦਾ ਸਿਮਰਨ ਕਰਦਾ ਹੈ, ਉਸ ਵਿਅਕਤੀ ਦੇ ਮੁਕਾਬਲੇ ਵਿਚ ਜਿਹੜਾ ਸਿਮਰਨ ਨਹੀਂ ਕਰਦਾ, ਇੰਜ ਹੈ ਜਿਵੇਂ ਮੋਏ ਦੇ ਮੁਕਾਬਲੇ ਵਿਚ ਜਿਊਂਦਾ ਵਿਅਕਤੀ। (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 6407) ● ਅੱਲਾਹ ਦੇ ਰਸੂਲ ਨੇ ਫ਼ਰਮਾਇਆ, ਜਿਹੜਾ ਵੀ ਕੋਈ ਦਿਨ ਵਿਚ ਸੋ ਵਾਰ “ਸੁਬਹਾਨੱਲਾਹੀ ਵਬੀ ਹਮਦੀਹੀ” ਆਖੇਗਾ, ਉਸ ਦੇ ਸਾਰੇ ਛੋਟੇ ਗੁਨਾਹ ਮੁਆਫ਼ ਕਰ ਦਿੱਤੇ ਜਾਣਗੇ, ਭਾਵੇਂ ਉਹ ਸਮੁੰਦਰ ਦੀ ਝੱਗ ਜਿੱਨੇ ਹੀ ਕਿਉਂ ਨਾ ਹੋਣ। (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 6405) ● ਇਕ ਦੂਜੀ ਹਦੀਸ ਵਿਚ ਹੈ, ਜਿਹੜਾ ਵਿਅਕਤੀ ਦਿਨ ਵਿਚ ਸੌ ਵਾਰ “ਲਾ ਇਲਾਹਾ ਇਲੱਲ ਲਾਹੋ ਵਾਹਦਾਹੂ ਲਾ ਸ਼ਰੀਕਲਾਹੂ ਲਹੂਲ ਮਲਕੁ ਵਲਾ ਹੁਲ ਹਮਦੂ ਵਾਹੂਵਾ ਅਲਾ ਕੁੱਲੀ ਸ਼ੈਅ ਇਨ ਕਦੀਰ” (ਭਾਵ ਅੱਲਾਹ ਤੋਂ ਛੁੱਟ ਹੋਰ ਕੋਈ ਇਸ਼ਟ ਨਹੀਂ, ਉਹ ਇਕੱਲਾ ਹੀ ਹੈ, ਉਸ ਦਾ ਕੋਈ ਸਾਂਝੀ ਨਹੀਂ, ਪਾਤਸ਼ਾਹੀ ਉਸੇ ਲਈ ਹੈ ਅਤੇ ਸਾਰੀਆਂ ਤਾਰੀਫ਼ਾਂ ਵੀ ਉਸੇ ਲਈ ਹਨ ਅਤੇ ਹਰੇਕ ਚੀਜ਼ ਉਸੇ ਦੇ ਕਬਜ਼ੇ ਵਿਚ ਹੈ।) ਆਖੇਗਾ, ਤਾਂ ਉਸ ਨੂੰ ਦਸ ਗ਼ੁਲਾਮ ਆਜ਼ਾਦ ਕਰਨ ਜਿੱਨਾ ਸਵਾਬ ਮਿਲੇਗਾ ਅਤੇ ਉਸ ਦੇ ਖਾਤੇ ਵਿਚ ਸੌ ਨੇਕੀਆਂ ਲਿਖ ਦਿੱਤੀਆਂ ਜਾਂਦੀਆਂ ਹਨ ਅਤੇ ਉਸ ਦੇ ਖਾਤੇ ਵਿੱਚੋਂ ਦਸ ਬੁਰਾਈਆਂ ਨੂੰ ਮਿਟਾ ਦਿੱਤਾ ਜਾਂਦਾ ਹੈ, ਅਤੇ ਉਸ ਦਾ ਇਹ ਅਮਲ ਉਸ ਨੂੰ ਸ਼ੈਤਾਨ ਦੀਆਂ ਸ਼ਰਾਰਤਾਂ ਤੋਂ ਸੁਰੱਖਿਅਤ ਰੱਖਦਾ ਹੈ ਅਤੇ ਕੋਈ ਵੀ ਵਿਅਕਤੀ ਉਸ ਦਿਨ ਉਸੇ ਵਿਅਕਤੀ ਤੋਂ ਵੱਧ ਕੇ ਨੇਕ ਕੰਮ ਕਰਨ ਵਾਲਾ ਨਹੀਂ ਹੋਵੇਗਾ, ਛੁੱਟ ਉਸ ਤੋਂ ਜਿੰਨ੍ਹੇ ਇਹ ਕਰਮ ਉਸ ਤੋਂ ਵੱਧ ਕੀਤਾ ਹੋਵੇ। (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 6403)","lang":"pa","version":{"key":"punjabi_arif","direction":"ltr","language_iso_code":"pa","version":"1.0.0","last_update":1666783255,"title":"Punjabi translation","description":"Translation of the Quran meanings into Punjabi by Arif Halim, published by Darussalam"},"meta":{"transliteration":"alladhīna āmanū wataṭma-innu qulūbuhum bidhik'ri al-lahi alā bidhik'ri al-lahi taṭma-innu al-qulūbu ","translations":["Those who","believed","and find satisfaction","their hearts","in the remembrance","(of) Allah","No doubt","in the remembrance","(of) Allah","find satisfaction","the hearts","(28)"],"transliterationArr":["alladhīna","āmanū","wataṭma-innu","qulūbuhum","bidhik'ri","al-lahi","alā","bidhik'ri","al-lahi","taṭma-innu","al-qulūbu",null],"verseTiming":[[1,0,1360],[2,1360,2720],[3,2720,4740],[4,4740,6740],[5,6740,7560],[6,7560,8360],[7,8360,10060],[8,10060,10920],[9,10920,11570],[10,11570,12530],[11,12530,13470],[12,13470,15550],[13,15550,17975]]}}