{"name":"14:37","price":"37਼ ਹੇ ਸਾਡੇ ਰੱਬਾ! ਬੇਸ਼ੱਕ ਮੈਂ ਨੇ ਆਪਣੇ ਪਰਿਵਾਰ ਦਾ ਇਕ ਭਾਗ ਤੇਰੇ ਪਵਿੱਤਰ ਘਰ (ਖ਼ਾਨਾ- ਕਾਅਬਾ) ਦੇ ਲਾਗੇ ਇਕ ਰੋਹੀ ਬਿਆਬਾਨ ਵਿਚ ਲਿਆ ਵਸਾਇਆ ਹੈ।1 ਹੇ ਸਾਡੇ ਰੱਬਾ! (ਇਹ ਮੈਂ ਇਸ ਲਈ ਕੀਤਾ ਹੈ) ਕਿ ਉਹ (ਉੱਥੇ) ਨਮਾਜ਼ ਕਾਇਮ ਕਰਨ, ਇਸ ਲਈ ਤੂੰ ਵੀ ਕੁੱਝ ਲੋਕਾਂ ਦੇ ਦਿਲਾਂ ਨੂੰ ਇਸ ਵਿਚ ਰਹਿਣ ਦਾ ਇੱਛੁਕ ਬਣਾ ਦੇ ਅਤੇ ਇਹਨਾਂ ਨੂੰ ਹਰ ਤਰ੍ਹਾਂ ਦੇ ਫਲਾਂ ਦੁਆਰਾ ਰਿਜ਼ਕ ਦੇ, ਤਾਂ ਜੋ ਇਹ (ਤੇਰੇ) ਧੰਨਵਾਦੀ ਹੋਣ।","arabic":"رَّبَّنَآ إِنِّيٓ أَسۡكَنتُ مِن ذُرِّيَّتِي بِوَادٍ غَيۡرِ ذِي زَرۡعٍ عِندَ بَيۡتِكَ ٱلۡمُحَرَّمِ رَبَّنَا لِيُقِيمُواْ ٱلصَّلَوٰةَ فَٱجۡعَلۡ أَفۡـِٔدَةٗ مِّنَ ٱلنَّاسِ تَهۡوِيٓ إِلَيۡهِمۡ وَٱرۡزُقۡهُم مِّنَ ٱلثَّمَرَٰتِ لَعَلَّهُمۡ يَشۡكُرُونَ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim","Chapter Ibrahim","Surah 14","Chapter 14","Abraham","إبراهيم"],"ayahNumber":1787,"juzNumber":13,"footnotes":"1 ਇਸ ਵਿਚ ਉਸ ਘਟਨਾ ਦੀ ਚਰਚਾ ਕੀਤੀ ਗਈ ਹੈ ਜਦੋਂ ਹਜ਼ਰਤ ਇਬਰਾਹੀਮ ਨੇ ਅੱਲਾਹ ਦੇ ਹੁਕਮ ਨਾਲ ਆਪਣੀ ਪਤਨੀ ਸਨੇ ਆਪਣੇ ਦੁੱਧ ਪੀਂਦੇ ਬੱਚੇ ਇਸਮਾਈਲ ਨੂੰ ਇਕ ਵਿਰਾਨੇ ਵਿਚ ਛੱਡ ਆਏ ਸੀ। ਇਕ ਵਿਸਥਾਰਪੂਰਵਕ ਹਦੀਸ ਦੀ ਚਰਚਾ ਕਰਦੇ ਹੋਏ ਇਬਨੇ ਅੱਬਾਸ ਫ਼ਰਮਾਉਂਦੇ ਹਨ ਕਿ ਜਦੋਂ ਹਜ਼ਰਤ ਇਬਰਾਹੀਮ ਨੇ ਇਸਮਾਈਲ ਅਤੇ ਉਹਨਾਂ ਦੀ ਮਾਤਾ ਜਿਹੜੀ ਅਜੇ ਇਸਮਾਈਲ ਨੂੰ ਆਪਣਾ ਦੁੱਧ ਪਿਆਉਂਦੀ ਸੀ ਖ਼ਾਨਾ ਕਾਅਬਾ ਦੇ ਨੇੜੇ ਜ਼ਮਜ਼ਮ ਦੇ ਕੋਲ ਆਬਾਦ ਕੀਤਾ ਅਤੇ ਉਹਨਾਂ ਦੋਨਾਂ ਦੇ ਕੋਲ ਇਕ ਥੈਲੇ ਵਿਚ ਖ਼ਜੂਰਾਂ ਅਤੇ ਮਸ਼ਕ ਵਿਚ ਪਾਣੀ ਰੱਖ ਦਿੱਤਾ ਉਸ ਸਮੇਂ ਉਸ ਮੱਕੇ ਵਿਚ ਕੋਈ ਮਨੁੱਖੀ ਆਬਾਦੀ ਨਹੀਂ ਸੀ ਅਤੇ ਨਾ ਹੀ ਪਾਣੀ ਸੀ। ਜਦੋਂ ਹਜ਼ਰਤ ਇਬਰਾਹੀਮ ਉਨ੍ਹਾਂ ਦੋਹਾਂ ਨੂੰ ਛੱਡ ਕੇ ਮੁੜਨ ਲੱਗੇ ਤਾਂ ਇਸਮਾਈਲ ਦੀ ਮਾਤਾ ਨੇ ਉਨ੍ਹਾਂ ਨੂੰ ਆਖਿਆ ਕਿ ਹੇ ਇਬਰਾਹੀਮ ਤੁਸੀਂ ਸਾਨੂੰ ਇਕ ਐਸੀ ਬਸਤੀ ਵਿਚ ਛੱਡ ਕੇ ਜਾ ਰਹੇ ਹੋ ਜਿੱਥੇ ਨਾ ਕੋਈ ਮਨੁੱਖ ਹੈ ਅਤੇ ਨਾ ਹੀ ਕੋਈ ਹੋਰ ਚੀਜ਼। ਇਬਰਾਹੀਮ ਨੇ ਜਵਾਬ ਦਿੱਤਾ ਕਿ ਅੱਲਾਹ ਨੇ ਮੈਨੂੰ ਇਹੋ ਹੁਕਮ ਦਿੱਤਾ ਹੈ। ਜਦੋਂ ਇਹ ਖ਼ਜੂਰਾਂ ਤੇ ਪਾਣੀ ਮੁੱਕ ਗਿਆ ਤਾਂ ਬੀਬੀ ਹਾਜਰਾ ਪਾਣੀ ਦੀ ਭਾਲ ਵਿਚ ਸਫ਼ਾ ਤੇ ਮਰਵਾ ਵਿਚ ਬੇਚੇਨੀ ਨਾਲ ਚੱਕਰ ਲਾਉਣ ਲੱਗ ਪਈਆਂ ਤਾਂ ਜੋ ਪਾਣੀ ਆਦਿ ਮਿਲ ਸਕੇ। ਅੰਤ ਅੱਲਾਹ ਦੇ ਹੁਕਮ ਨਾਲ ਇਕ ਫ਼ਰਿਸ਼ਤੇ ਨੇ ਉਸ ਥਾਂ ਆਪਣੀ ਅੱਡੀ ਜਾਂ ਪੈਰ ਮਾਰਿਆ ਜਿਸ ਤੋਂ ਜ਼ਮਜ਼ਮ ਦਾ ਸੋਮਾ ਫੁੱਟ ਪਿਆ। ਇਸੇ ਪਾਣੀ ਕਾਰਨ ਉੱਥੇ ਇਕ ਕਬੀਲਾ ਵੀ ਆਬਾਦ ਹੋਇਆ ਅਤੇ ਇਸੇ ਕਬੀਲੇ ਦੀ ਦੋ ਲੜਕੀਆਂ ਨਾਲ ਇਕ ਤੋਂ ਬਾਅਦ ਦੂਜੀ ਨਾਲ ਹਜ਼ਰਤ ਇਸਮਾਈਲ ਨੇ ਵਿਵਾਹ ਕੀਤਾ। ਕੁਝ ਸਮੇਂ ਬਾਅਦ ਹਜ਼ਰਤ ਇਬਰਾਹੀਮ ਉਨ੍ਹਾਂ ਦੀ ਖ਼ਬਰ ਲੈਣ ਲਈ ਆਏ ਫੇਰ ਦੋਵੇਂ ਪਿਓ ਪੁੱਤਰ ਨੇ ਖ਼ਾਨਾ ਕਾਅਬਾ ਦੀ ਉਸਾਰੀ ਸ਼ੁਰੂ ਕੀਤੀ। ਹਜ਼ਰਤ ਇਸਮਾਈਲ ਪੱਥਰ ਚੁੱਕ ਕੇ ਲਿਆਉਂਦੇ ਸੀ ਅਤੇ ਹਜ਼ਰਤ ਇਬਰਾਹੀਮ ਉਸਾਰੀ ਕਰਦੇ ਸੀ। ਅਤੇ ਦੋਵੇਂ ਅੱਲਾਹ ਤੋਂ ਇਹ ਅਰਦਾਸ ਕਰਦੇ ਸੀ ਕਿ ਹੇ ਸਾਡੇ ਰੱਬਾ ਸਾਡੀ ਇਹ ਸੇਵਾ ਕਬੂਲ ਕਰ ਬੇਸ਼ੱਕ ਤੂੰ ਹੀ ਸੁਨਣ ਵਾਲਾ ਤੇ ਜਾਨਣ ਵਾਲਾ ਹੈ। (ਸੂਰਤ ਅਲ-ਬਕਰਹ : 127/2) ਅੱਲਾਹ ਦੇ ਰਸੂਲ ਨੇ ਫ਼ਰਮਾਇਆ ਕਿ ਦੋਨੋਂ ਇਬਰਾਹੀਮ ਅਤੇ ਇਸਮਾਈਲ ਅੱਲਾਹ ਦੇ ਘਰ ਦੀ ਉਸਾਰੀ ਕਰਦੇ ਰਹੇ ਅਤੇ ਉਸ ਦੇ ਆਲੇ ਦੁਆਲੇ ਤਵਾਫ਼ ਕਰਦੇ ਹੋਏ ਇਹੀ ਦੁਆ ਕਰਦੇ ਸੀ। (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 3364)","lang":"pa","version":{"key":"punjabi_arif","direction":"ltr","language_iso_code":"pa","version":"1.0.0","last_update":1666783255,"title":"Punjabi translation","description":"Translation of the Quran meanings into Punjabi by Arif Halim, published by Darussalam"},"meta":{"transliteration":"rabbanā innī askantu min dhurriyyatī biwādin ghayri dhī zarʿin ʿinda baytika al-muḥarami rabbanā liyuqīmū al-ṣalata fa-ij'ʿal afidatan mina al-nāsi tahwī ilayhim wa-ur'zuq'hum mina al-thamarāti laʿallahum yashkurūna ","translations":["Our Lord","Indeed, I","[I] have settled","(some) of","my offsprings","in a valley","not","with","cultivation","near","Your Sacred House","Your Sacred House","our Lord","That they may establish","the prayers","So make","hearts","of","the men","incline","towards them","and provide them","with","the fruits","so that they may","be grateful","(37)"],"transliterationArr":["rabbanā","innī","askantu","min","dhurriyyatī","biwādin","ghayri","dhī","zarʿin","ʿinda","baytika","al-muḥarami","rabbanā","liyuqīmū","al-ṣalata","fa-ij'ʿal","afidatan","mina","al-nāsi","tahwī","ilayhim","wa-ur'zuq'hum","mina","al-thamarāti","laʿallahum","yashkurūna",null],"verseTiming":[[1,0,2460],[2,2460,3675],[3,3675,5252],[4,5252,5660],[5,5660,7736],[6,7736,8954],[7,8954,9915],[8,9915,10413],[9,10413,10982],[10,10982,12028],[11,12028,12844],[12,12844,14317],[13,14317,16043],[14,16043,17026],[15,17026,18262],[16,18262,19144],[17,19144,20174],[18,20174,21502],[19,21502,22497],[20,22497,23871],[21,23871,26486],[22,26486,27429],[23,27429,29144],[24,29144,31216],[25,31216,32257],[26,32257,33172],[27,33172,34538],[28,34538,37159]]}}