{"name":"16:126","price":"126਼ ਜੇ ਤੁਸੀਂ ਬਦਲਾ ਲੈਣਾ ਵੀ ਹੋਵੇ ਤਾਂ ਉੱਨਾ ਹੀ ਬਦਲਾ ਲਓ ਜਿੰਨੀ ਤੁਹਾਡੇ ਨਾਲ ਵਧੀਕੀ ਕੀਤੀ ਗਈ ਹੈ,2 ਪਰ ਜੇ ਤੁਸੀਂ ਸਬਰ ਕਰ ਲਵੋ ਤਾਂ ਸਬਰ ਕਰਨ ਵਾਲਿਆਂ ਲਈ ਇਹੋ ਵਧੀਆ ਗੱਲ ਹੈ।","arabic":"وَإِنۡ عَاقَبۡتُمۡ فَعَاقِبُواْ بِمِثۡلِ مَا عُوقِبۡتُم بِهِۦۖ وَلَئِن صَبَرۡتُمۡ لَهُوَ خَيۡرٞ لِّلصَّٰبِرِينَ","category":["16 (An-Nahl)","An-Nahl","Surah An-Nahl","Chapter An-Nahl","Nahl","Surah Nahl","Chapter Nahl","An Nahl","Surah An Nahl","Chapter An Nahl","Surah 16","Chapter 16","The Bee","النَّحل"],"ayahNumber":2027,"juzNumber":14,"footnotes":"2 ਬਦਲਾ ਲੈਣ ਦੀਆਂ ਕਈ ਸ਼ਕਲਾਂ ਹਨ ਜਿਵੇਂ ਉੱਮੇ-ਮਆਵੀਆ ਹਿੰਦਾ ਰ:ਅ: ਨੇ ਅੱਲਾਹ ਦੇ ਰਸੂਲ ਨੂੰ ਬੇਨਤੀ ਕੀਤੀ ਕਿ ਅਬੂ-ਸੁਫ਼ਿਯਾਨ ਰ:ਅ: ਇਕ ਕੰਜੂਸ ਵਿਅਕਤੀ ਹੈ, ਜੇ ਉਸ ਨੂੰ ਬਿਨਾਂ ਦੱਸੇ ਉਸ ਦੇ ਮਾਲ ’ਚੋਂ ਖ਼ਰਚ ਕਰ ਲਵਾਂ, ਤਾਂ ਕੀ ਗੁਨਾਹ ਹੋਵੇਗਾ ? ਆਪ (ਸ:) ਨੇ ਫ਼ਰਮਾਇਆ ਤੂੰ ਅਤੇ ਤੇਰੇ ਬੱਚੇ ਆਪਣੇ ਗੁਜ਼ਾਰੇ ਲਈ ਵਧੀਆ ਤਰੀਕੇ ਨਾਲ ਬਿਨਾਂ ਕੋਈ ਫਾਲਤੂ ਖ਼ਰਚੇ ਤੋਂ ਲੈ ਸਕਦੇ ਹੋ। (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 2) ● ਰਸੂਲ (ਸ:) ਤੋਂ ਪੁੱਛਿਆ ਗਿਆ, ਜਦੋਂ ਤੁਸੀਂ ਸਾਨੂੰ ਬਾਹਰ ਭੇਜਦੇ ਹੋ ਤਾਂ ਕਦੇ ਇੰਜ ਵੀ ਹੰਦਾ ਹੈ ਕਿ ਅਸੀਂ ਅਜਿਹੇ ਲੋਕਾਂ ਕੋਲ ਜਾ ਕੇ ਠਹਿਰਦੇ ਹਾਂ ਜਿਹੜੇ ਸਾਡੀ ਮਹਿਮਾਨਦਾਰੀ ਨਹੀਂ ਕਰਦੇ, ਤਾਂ ਇਸ ਸੰਬੰਧ ਵਿਚ ਤੁਹਾਡਾ ਕੀ ਵਿਚਾਰ ਹੈ ? ਆਪ (ਸ:) ਨੇ ਫ਼ਰਮਾਇਆ ਜੇ ਤੁਸੀਂ ਕਿਸੇ ਐਸੀ ਥਾਂ ਰੁਕੋ ਅਤੇ ਉਹ ਤੁਹਾਡੀ ਇਸ ਤਰ੍ਹਾਂ ਮਹਿਮਾਨਦਾਰੀ ਕਰਨ ਜਿੱਦਾਂ ਉਹਨਾਂ ਨੂੰ ਕਰਨੀ ਚਾਹੀਦੀ ਹੈ ਤਾਂ ਉਹਨਾਂ ਦੀ ਮਹਿਮਾਨਦਾਰੀ ਕਬੂਲ ਕਰ ਲੈਣੀ ਚਾਹੀਦੀ ਹੈ ਜੇ ਉਹ ਇੰਜ ਨਾ ਕਰਨ ਤਾਂ ਉਹਨਾਂ ਤੋਂ ਆਪਣਾ ਮਹਿਮਾਨਦਾਰੀ ਦਾ ਹੱਕ ਪ੍ਰਾਪਤ ਕਰੋ। (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 2461)","lang":"pa","version":{"key":"punjabi_arif","direction":"ltr","language_iso_code":"pa","version":"1.0.0","last_update":1666783255,"title":"Punjabi translation","description":"Translation of the Quran meanings into Punjabi by Arif Halim, published by Darussalam"},"meta":{"transliteration":"wa-in ʿāqabtum faʿāqibū bimith'li mā ʿūqib'tum bihi wala-in ṣabartum lahuwa khayrun lilṣṣābirīna ","translations":["And if","you retaliate","then retaliate","with the like","of what","you were afflicted","with [it]","But if","you are patient","surely (it) is","better","for those who are patient","(126)"],"transliterationArr":["wa-in","ʿāqabtum","faʿāqibū","bimith'li","mā","ʿūqib'tum","bihi","wala-in","ṣabartum","lahuwa","khayrun","lilṣṣābirīna",null],"verseTiming":[[1,0,630],[2,630,1950],[3,1950,3260],[4,3260,4140],[5,4140,4520],[6,4520,6700],[7,6700,7640],[8,7640,9220],[9,9220,10390],[10,10390,11060],[11,11060,11720],[12,11720,15755]]}}