{"name":"17:1","price":"1਼ ਪਾਕ ਜ਼ਾਤ ਹੈ ਉਹ (ਅੱਲਾਹ) ਜਿਹੜਾ ਆਪਣੇ ਬੰਦੇ (ਮੁਹੰਮਦ ਸ:) ਨੂੰ ਰਾਤ ਦੇ ਇਕ ਹਿੱਸੇ ਵਿਚ ਹੀ ਸਤਿਕਾਰਯੋਗ ਮਸੀਤ (ਖ਼ਾਨਾ-ਕਾਅਬਾ) ਤੋਂ ਮਸਜਿਦੇ- ਅਕਸਾ (ਯਰੋਸ਼ਲਮ ਵਿਖੇ ਬੈਤੁਲ-ਮੁਕੱਦਸ) ਤਕ ਲੈ ਗਿਆ, ਜਿਸ ਦੇ ਆਲੇ-ਦੁਆਲੇ ਅਸੀਂ ਬਰਕਤਾਂ ਰੱਖੀਆਂ ਹਨ, ਤਾਂ ਜੋ ਅਸੀਂ ਉਸ (ਮੁਹੰਮਦ) ਨੂੰ ਆਪਣੀਆਂ ਕੁੱਝ ਨਿਸ਼ਾਨੀਆਂ ਵਿਖਾਈਏ।1 ਬੇਸ਼ੱਕ ਉਹੀਓ (ਅੱਲਾਹ) ਸਭ ਕੁੱਝ ਸੁਣਨ ਵਾਲਾ ਤੇ ਵੇਖਣ ਵਾਲਾ ਹੈ।","arabic":"سُبۡحَٰنَ ٱلَّذِيٓ أَسۡرَىٰ بِعَبۡدِهِۦ لَيۡلٗا مِّنَ ٱلۡمَسۡجِدِ ٱلۡحَرَامِ إِلَى ٱلۡمَسۡجِدِ ٱلۡأَقۡصَا ٱلَّذِي بَٰرَكۡنَا حَوۡلَهُۥ لِنُرِيَهُۥ مِنۡ ءَايَٰتِنَآۚ إِنَّهُۥ هُوَ ٱلسَّمِيعُ ٱلۡبَصِيرُ","category":["17 (Al-Isra)","Al-Isra","Surah Al-Isra","Chapter Al-Isra","Isra","Surah Isra","Chapter Isra","Al Isra","Surah Al Isra","Chapter Al Isra","Surah 17","Chapter 17","The Night Journey","الإسرَاء"],"ayahNumber":2030,"juzNumber":15,"footnotes":"1 ਇਸ ਸੂਰਤ ਵਿਚ ਅੱਲਾਹ ਨੇ ਇਸਰਾ, ਭਾਵ ਖ਼ਾਨਾ-ਕਾਅਬਾ ਤੋਂ ਬੈਤੁਲ ਮੁਕੱਦਸ ਤੱਕ ਮੁਹੰਮਦ (ਸ:) ਨੂੰ ਇਕ ਰਾਤ ਦੇ ਕੁੱਝ ਹਿੱਸੇ ਵਿਚ ਲੈ ਜਾਣ ਦੀ ਚਰਚਾ ਕੀਤੀ ਹੈ ਅਤੇ ਮਿਅਰਾਜ ਭਾਵ ਅਕਾਸ਼ਾਂ ਦੇ ਉੱਪਰ ਲੈਕੇ ਜਾਣ ਦੀ ਚਰਚਾ ਸੂਰਤ ਨਜਮ 53 ਵਿਚ ਕੀਤੀ ਗਈ ਹੈ। ਇਹ ਮਿਅਰਾਜ ਦੀ ਪੂਰੀ ਯਾਤਰਾ ਅੱਲਾਹ ਦਾ ਵੱਡਮੁੱਲਾ ਮੁਅਜਜ਼ਾ (ਚਮਤਕਾਰ) ਹੈ। ਮੁਅਜਜ਼ਾ ਉਸ ਨੂੰ ਕਿਹਾ ਜਾਂਦਾ ਹੈ ਜਿਹੜਾ ਕੇਵਲ ਅੱਲਾਹ ਦੀ ਕੁਦਰਤ ਵੱਲੋਂ ਹੀ ਪ੍ਰਗਟ ਹੰਦਾ ਹੈ, ਨਬੀ ਦੀ ਕੁੱਝ ਵੀ ਇੱਛਾ ਇਸ ਵਿਚ ਉੱਕਾ ਹੀ ਨਹੀਂ ਹੁੰਦੀ। ਇਸ ਲਈ ਇਸ ਘਟਨਾ ਨੂੰ ਰੂਹਾਨੀ ਸੈਰ ਜਾਂ ਸੁਪਨਾ ਆਖਣਾ ਉੱਕਾ ਹੀ ਗ਼ਲਤ ਹੈ। ਆਪ (ਸ:) ਨੂੰ ਮਿਅਰਾਜ ਜਾਗਣ ਦੀ ਹਾਲਤ ਵਿਚ ਹੀ ਕਰਾਈ ਗਈ ਸੀ। ਇਹ ਸੁਪਨਾ ਆਦਿ ਨਹੀਂ ਸੀ ਜੇ ਇੰਜ ਹੁੰਦਾ ਤਾਂ ਕਾਫ਼ਿਰਾਂ ਨੂੰ ਇਸ ਨੂੰ ਝੁਠਲਾਉਣ ਦੀ ਕੀ ਲੋੜ ਪਈ ਸੀ? ਪਰ ਕਾਫ਼ਿਰਾਂ ਨੇ ਇਸ ਨੂੰ ਝੁਠਲਾਇਆ ਅਤੇ ਨਬੀ (ਸ:) ਨੂੰ ਉਹਨਾਂ ਦੇ ਤੀਖੇ ਸਵਾਲਾ ਨੂੰ ਬਰਦਾਸ਼ਤ ਕਰਨਾ ਪਿਆ। ਜੇ ਇਹ ਸੁਪਣਾ ਹੰਦਾ ਤਾਂ ਨਬੀ (ਸ:) ਆਸਾਨੀ ਨਾਲ ਇਹ ਕਹਿ ਕੇ ਪਿੱਛਾ ਛੁੜਾ ਸਕਦੇ ਸੀ ਕਿ ਮੈਂ ਤਾਂ ਆਪਣਾ ਸੁਪਨਾ ਦੱਸ ਰਿਹਾ ਹਾਂ ਤੁਸੀਂ ਮੈਥੋਂ ਇਹ ਸਵਾਲ ਕਿਉਂ ਕਰ ਰਹੇ ਹੋ ? ਪਰ ਆਪ (ਸ:) ਨੇ ਇਹ ਨਹੀਂ ਕਿਹਾ ਸਗੋਂ ਜਵਾਬ ਦੇਣ ਵਿਚ ਅੜੀਕਾ ਲੱਗ ਰਿਹਾ ਸੀ ਜਿਸ ਕਰਕੇ ਅੱਲਾਹ ਨੇ ਬੇਤੁਲ ਮੁਕੱਦਸ ਨੂੰ ਹੀ ਆਪ ਜੀ ਦੇ ਸਾਹਮਣੇ ਕਰ ਦਿੱਤਾ। ਜਿਵੇਂ ਹਦੀਸ ਵਿਚ ਹੈ ਜਦੋਂ ਕੁਰੈਸ਼ ਨੇ ਮੈਨੂੰ ਝੁਠਲਾਇਆ ਤਾਂ ਮੈਂ ਹਤੀਮ (ਇਕ ਥਾਂ ਦਾ ਨਾਂ) ਵਿਚ ਖੜ੍ਹਾ ਹੋ ਗਿਆ ਤਾਂ ਅੱਲਾਹ ਨੇ ਬੈਤੁਲ ਮੁਕੱਦਸ ਮੇਰੇ ਅੱਗੇ ਕਰ ਦਿੱਤਾ ਮੈਂ ਉਹਨਾਂ ਕੁਰੈਸ਼ੀਆਂ ਨੂੰ ਉਸ ਦੀ ਨਿਸ਼ਾਨੀਆਂ ਦੱਸਣੀਆਂ ਸ਼ੁਰੂ ਕਰ ਦਿੱਤੀਆਂ ਜਦੋਂ ਮੈਂ ਉਸ ਦੇ ਵੱਲ ਵੇਖ ਰਿਹਾ ਸੀ। (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 3886)","lang":"pa","version":{"key":"punjabi_arif","direction":"ltr","language_iso_code":"pa","version":"1.0.0","last_update":1666783255,"title":"Punjabi translation","description":"Translation of the Quran meanings into Punjabi by Arif Halim, published by Darussalam"},"meta":{"transliteration":"sub'ḥāna alladhī asrā biʿabdihi laylan mina al-masjidi al-ḥarāmi ilā al-masjidi al-aqṣā alladhī bāraknā ḥawlahu linuriyahu min āyātinā innahu huwa al-samīʿu al-baṣīru ","translations":["Exalted","(is) the One Who","took","His servant","(by) night","from","Al-Masjid Al-Haraam","Al-Masjid Al-Haraam","to","Al-Masjid Al-Aqsa","Al-Masjid Al-Aqsa","which","We blessed","its surroundings","that We may show him","of","Our Signs","Indeed He","He","(is) the All-Hearer","the All-Seer","(1)"],"transliterationArr":["sub'ḥāna","alladhī","asrā","biʿabdihi","laylan","mina","al-masjidi","al-ḥarāmi","ilā","al-masjidi","al-aqṣā","alladhī","bāraknā","ḥawlahu","linuriyahu","min","āyātinā","innahu","huwa","al-samīʿu","al-baṣīru",null],"verseTiming":[[1,0,1080],[2,1080,3130],[3,3130,3940],[4,3940,5260],[5,5260,5860],[6,5860,6890],[7,6890,7990],[8,7990,9050],[9,9050,9380],[10,9380,10450],[11,10450,11260],[12,11260,12080],[13,12080,13330],[14,13330,14450],[15,14450,15660],[16,15660,16070],[17,16070,17570],[18,17570,20100],[19,20100,20510],[20,20510,21630],[21,21630,24165]]}}