{"name":"17:45","price":"45਼ (ਹੇ ਮੁਹੰਮਦ!) ਜਦੋਂ ਤੁਸੀਂ .ਕੁਰਆਨ ਪੜ੍ਹਦੇ ਹੋ ਤਾਂ ਅਸੀਂ ਤੁਹਾਡੇ ਅਤੇ ਉਹਨਾਂ ਵਿਚਕਾਰ ਜਿਹੜੇ ਆਖ਼ਿਰਤ ’ਤੇ ਵਿਸ਼ਵਾਸ ਨਹੀਂ ਰੱਖਦੇ, ਇਕ ਬਰੀਕ ਜਿਹਾ ਪੜਦਾ ਤਾਨ ਦਿੰਦੇ ਹਨ।1","arabic":"وَإِذَا قَرَأۡتَ ٱلۡقُرۡءَانَ جَعَلۡنَا بَيۡنَكَ وَبَيۡنَ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱلۡأٓخِرَةِ حِجَابٗا مَّسۡتُورٗا","category":["17 (Al-Isra)","Al-Isra","Surah Al-Isra","Chapter Al-Isra","Isra","Surah Isra","Chapter Isra","Al Isra","Surah Al Isra","Chapter Al Isra","Surah 17","Chapter 17","The Night Journey","الإسرَاء"],"ayahNumber":2074,"juzNumber":15,"footnotes":"1 ਸਈਦ ਬਿਨ ਜਬੀਰ ਰ:ਅ: ਦਾ ਕਹਿਣਾ ਹੈ ਕਿ ਜਦੋਂ ਸੂਰਤ ਲਹਬ ਉੱਤਰੀ ਤਾਂ ਅਬੂ-ਲਹਬ ਦੀ ਪਤਨੀ ਨਬੀ (ਸ:) ਕੋਲ ਆਈ ਜਦੋਂ ਕਿ ਉੱਥੇ ਅਬੂ-ਬਕਰ (ਰ:ਅ:) ਵੀ ਬੈਠੇ ਹੋਏ ਸੀ ਅਬੂ-ਬਕਰ ਨੇ ਆਪ (ਸ:) ਨੂੰ ਕਿਹਾ ਕਿ (ਹੇ ਨਬੀ!) ਤੁਸੀਂ ਪਰਾਂ ਹੋ ਜਾਓ ਉਹ ਅਬੁ ਲਹਬ ਦੀ ਪਤਨੀ ਕੀਤੇ ਤੁਹਾਡੇ ਨਾਲ ਕੋਈ ਅਜਿਹੀ ਗੱਲ ਨਾ ਕਰੇ ਜਿਸ ਤੋਂ ਤੁਹਾਨੂੰ ਤਕਲੀਫ਼ ਹੋਵੇ ਉਹ ਭੈੜੀ ਜ਼ੁਬਾਨ ਵਾਲੀ ਜ਼ਨਾਨੀ ਹੈ। ਨਬੀ (ਸ:) ਨੇ ਫ਼ਰਮਾਇਆ ਮੇਰੇ ਅਤੇ ਉਸ ਦੇ ਵਿਚਾਲੇ ਪੜਦਾ ਪਾ ਦਿੱਤਾ ਜਾਵੇਗਾ ਜਦ ਉਹ ਆਪ (ਸ:) ਨੂੰ ਵੇਖ ਨਾ ਸਕੀ ਉਸ ਨੇ ਅਬੂ-ਬਕਰ ਨੂੰ ਆਖਿਆ ਕਿ ਤੁਹਾਡੇ ਸਾਥੀ ਨੇ ਸਾਡੀ ਬੇਜ਼ਤੀ ਕੀਤੀ ਹੈ ਅਬੂ-ਬਕਰ ਨੇ ਆਖਿਆ ਕਿ ਅੱਲਾਹ ਦੀ ਸੁੰਹ ਉਹ ਸ਼ੇਅਰ ਨਹੀਂ ਕਹਿੰਦਾ ਉਸ ਨੇ ਪੁੱਛਿਆ ਕਿ ਤੂੰ ਇਸ ਦੀ ਪੁਸ਼ਟੀ ਕਰਦਾ ਹੈ ? ਫੇਰ ਉਹ ਉਥਿਓਂ ਚੱਲੀ ਗਈ। ਅਬੂ-ਬਕਰ ਨੇ ਅਰਜ਼ ਕੀਤਾ ਹੇ ਅੱਲਾਹ ਦੇ ਰਸੂਲ! ਕੀ ਉਸ ਨੇ ਤੁਹਾਨੂੰ ਨਹੀਂ ਵੇਖਿਆ? ਨਬੀ (ਸ:) ਨੇ ਫ਼ਰਮਾਇਆ, ਨਹੀਂ। ਉਹ ਦੇ ਜਾਣ ਤਕ ਇਕ ਫ਼ਰਿਸ਼ਤਾ ਮੇਰੇ ਤੇ ਉਸ ਦੇ ਵਿਚਾਲੇ ਖੜ੍ਹਾ ਸੀ ਅਤੇ ਉਸ ਨੇ ਮੈਨੂੰ ਆਪਣੀ ਓਟ ਵਿਚ ਲਿਆ ਹੋਇਆ ਸੀ। (ਤਫ਼ਸੀਰ ਕੁਰਤਬੀ 269/10 ਮੁਸਨਦ ਅਬੂ-ਯਾਅਲੀ 54/1)","lang":"pa","version":{"key":"punjabi_arif","direction":"ltr","language_iso_code":"pa","version":"1.0.0","last_update":1666783255,"title":"Punjabi translation","description":"Translation of the Quran meanings into Punjabi by Arif Halim, published by Darussalam"},"meta":{"transliteration":"wa-idhā qarata al-qur'āna jaʿalnā baynaka wabayna alladhīna lā yu'minūna bil-ākhirati ḥijāban mastūran ","translations":["And when","you recite","the Quran","We place","between you","and between","those who","(do) not","believe","in the Hereafter","a barrier","hidden","(45)"],"transliterationArr":["wa-idhā","qarata","al-qur'āna","jaʿalnā","baynaka","wabayna","alladhīna","lā","yu'minūna","bil-ākhirati","ḥijāban","mastūran",null],"verseTiming":[[1,0,880],[2,880,1730],[3,1730,3050],[4,3050,4140],[5,4140,5110],[6,5110,5860],[7,5860,7050],[8,7050,7460],[9,7460,8770],[10,8770,10210],[11,10210,11070],[12,11070,13505]]}}