{"name":"17:67","price":"67਼ ਜਦੋਂ ਸਮੁੰਦਰ ਵਿਚ ਤੁਹਾਨੂੰ ਕੋਈ ਭੀੜ ਆ ਪੈਂਦੀ ਹੈ ਤਾਂ ਅੱਲਾਹ ਨੂੰ ਛੱਡ ਕੇ ਜਿਨ੍ਹਾਂ ਨੂੰ ਤੁਸੀਂ (ਮਦਦ ਲਈ) ਪੁਕਾਰਿਆ ਕਰਦੇ ਹੋ ਉਹਨਾਂ ਸਾਰਿਆਂ ਨੂੰ ਭੁੱਲ ਜਾਂਦੇ ਹੋ।1 ਜਦੋਂ ਉਹ ਤੁਹਾਨੂੰ ਖ਼ੁਸ਼ਕੀ (ਭਾਵ ਧਰਤੀ) ਵੱਲ ਬਚਾ ਲਿਆਉਂਦਾ ਹੈ ਫੇਰ ਤੁਸੀਂ ਉਸ ਤੋਂ ਮੂੰਹ ਮੋੜ ਲੈਂਦੇ ਹੋ। ਮਨੁੱਖ ਬੜਾ ਹੀ ਨਾ-ਸ਼ੁਕਰਾ।","arabic":"وَإِذَا مَسَّكُمُ ٱلضُّرُّ فِي ٱلۡبَحۡرِ ضَلَّ مَن تَدۡعُونَ إِلَّآ إِيَّاهُۖ فَلَمَّا نَجَّىٰكُمۡ إِلَى ٱلۡبَرِّ أَعۡرَضۡتُمۡۚ وَكَانَ ٱلۡإِنسَٰنُ كَفُورًا","category":["17 (Al-Isra)","Al-Isra","Surah Al-Isra","Chapter Al-Isra","Isra","Surah Isra","Chapter Isra","Al Isra","Surah Al Isra","Chapter Al Isra","Surah 17","Chapter 17","The Night Journey","الإسرَاء"],"ayahNumber":2096,"juzNumber":15,"footnotes":"1 ਮੱਕੇ ਦੀ ਜਿਤ ਹੋਣ ’ਤੇ ਅਕਰਮਾਂ ਬਿਨ ਅਬੀ ਜਹਿਲ ਰਸੂਲ (ਸ:) ਤੋਂ ਡਰ ਕੇ ਭੱਜ ਗਿਆ ਅਤੇ ਹਬਸ਼ਾ ਜਾਣ ਵਾਲੀ ਬੇੜੀ ਵਿਚ ਸਵਾਰ ਹੋ ਗਿਆ ਉਦੋਂ ਹੀ ਬੇੜੀ ਤੂਫ਼ਾਨ ਵਿਚ ਫਸ ਗਈ ਬੇੜੀ ਦੇ ਸਵਾਰ ਲੋਕੀ ਇਕ ਦੂਜੇ ਨੂੰ ਆਖਣ ਲੱਗੇ ਕਿ ਅੱਲਾਹ ਤੋਂ ਛੁੱਟ ਤੁਹਾਨੂੰ ਕੌਣ ਬਚਾ ਸਕਦਾ ਹੈ? ਸੋ ਤੁਸੀਂ ਸਾਰੇ ਮਨੋਂ ਅਰਦਾਸ ਕਰੋ ਅਕਰਮਾਂ ਨੇ ਆਪਣੇ ਮਨ ਵਿਚ ਕਿਹਾ ਕਿ ਅੱਲਾਹ ਦੀ ਸੁੰਹ ਜੇ ਸਮੁੰਦਰ ਵਿਚ ਅੱਲਾਹ ਤੋਂ ਛੁੱਟ ਹੋਰ ਕੋਈ ਲਾਭ ਨਹੀਂ ਪਹੁੰਚਾ ਸਕਦਾ ਤਾਂ ਫੇਰ ਧਰਤੀ ’ਤੇ ਵੀ ਉਸ ਤੋਂ ਛੁੱਟ ਕੋਈ ਲਾਭ ਨਹੀਂ ਦੇ ਸਕਦਾ। ਹੇ ਅੱਲਾਹ! ਮੈਂ ਤੇਰੇ ਹਜ਼ੂਰ ਇਹ ਪ੍ਰਣ ਕਰਦਾ ਹਾਂ ਕਿ ਜੇ ਤੇਨੈ ਮੈਨੂੰ ਬਚਾ ਲਿਆ ਤਾਂ ਮੈਂ ਸਿੱਧਾ ਅੱਲਾਹ ਦੇ ਰਸੂਲ ਕੋਲ ਜਾਵਾਂਗਾ ਅਤੇ ਉਹਨਾਂ ਦੇ ਹੱਥ ਵਿਚ ਆਪਣਾ ਹੱਥ ਦੇ ਦੇਵਾਂਗਾ ਅਤੇ ਉਹ ਲਾਜ਼ਮਨ ਮੇਰੇ ਨਾਲ ਮਿਹਰਬਾਨੀ ਤੇ ਮੁਹੱਬਤ ਵਾਲਾ ਵਰਤਾਓ ਕਰਨਗੇ ਜਦੋਂ ਉਹ ਬਚ ਕੇ ਸਮੁੰਦਰ ਤੋਂ ਬਾਹਰ ਆਇਆ ਤਾਂ ਅਕਰਮਾਂ ਸਿੱਧਾ ਨਬੀ (ਸ:) ਕੋਲ ਆਇਆ ਅਤੇ ਆਪਣੀ ਘਟਨਾ ਸੁਣਾਈ ਅਤੇ ਇਸਲਾਮ ਧਰਮ ਨੂੰ ਸਵੀਕਾਰ ਕਰਕੇ ਇਕ ਪੱਕਾ ਸੱਚਾ ਮੁਸਲਮਾਨ ਬਣ ਗਿਆ। (ਤਫ਼ਸੀਰ ਇਬਨੇ ਕਸੀਰ, ਸੂਰਤ ਬਨੀ-ਇਸਰਾਈਲ 67/17)","lang":"pa","version":{"key":"punjabi_arif","direction":"ltr","language_iso_code":"pa","version":"1.0.0","last_update":1666783255,"title":"Punjabi translation","description":"Translation of the Quran meanings into Punjabi by Arif Halim, published by Darussalam"},"meta":{"transliteration":"wa-idhā massakumu al-ḍuru fī al-baḥri ḍalla man tadʿūna illā iyyāhu falammā najjākum ilā al-bari aʿraḍtum wakāna al-insānu kafūran ","translations":["And when","touches you","the hardship","in","the sea","lost","(are) who","you call","except","Him Alone","But when","He delivers you","to","the land","you turn away","And is","man","ungrateful","(67)"],"transliterationArr":["wa-idhā","massakumu","al-ḍuru","fī","al-baḥri","ḍalla","man","tadʿūna","illā","iyyāhu","falammā","najjākum","ilā","al-bari","aʿraḍtum","wakāna","al-insānu","kafūran",null],"verseTiming":[[1,0,980],[2,980,2260],[3,2260,2850],[4,2850,3090],[5,3090,3880],[6,3880,4580],[7,4580,5190],[8,5190,6560],[9,6560,8940],[10,8940,10859],[11,10859,12849],[12,12849,14139],[13,14139,14509],[14,14509,15359],[15,15359,16619],[16,16619,17369],[17,17369,19349],[18,19349,20954]]}}