{"name":"17:79","price":"79਼ (ਹੇ ਨਬੀ!) ਰਾਤ ਦੇ ਕੁੱਝ ਹਿੱਸੇ ਵਿਚ ਵੀ ਤੁਸੀਂ ਇਸ .ਕੁਰਆਨ ਨੂੰ ਤਹੱਜਦ ਦੀ ਨਮਾਜ਼ ਵਿਚ ਪੜ੍ਹੋ। ਇਹ (ਤਹੱਜਦ) ਵਿਸ਼ੇਸ਼ਕਰ ਤੁਹਾਡੇ ਲਈ ਹੈ। ਆਸ ਹੈ ਕਿ ਤੁਹਾਡਾ ਰੱਬ ਤੁਹਾਨੂੰ ਮੁਕਾਮੇ ਮਹਿਮੂਦ 2 ’ਤੇ ਲਿਆ ਖੜਾ ਕਰੇਗਾ।","arabic":"وَمِنَ ٱلَّيۡلِ فَتَهَجَّدۡ بِهِۦ نَافِلَةٗ لَّكَ عَسَىٰٓ أَن يَبۡعَثَكَ رَبُّكَ مَقَامٗا مَّحۡمُودٗا","category":["17 (Al-Isra)","Al-Isra","Surah Al-Isra","Chapter Al-Isra","Isra","Surah Isra","Chapter Isra","Al Isra","Surah Al Isra","Chapter Al Isra","Surah 17","Chapter 17","The Night Journey","الإسرَاء"],"ayahNumber":2108,"juzNumber":15,"footnotes":"2 ਮਕਾਮੇ-ਮਹਮੂਦ ਕਿਆਮਤ ਦਿਹਾੜੇ ਨਬੀ (ਸ:) ਨੂੰ ਬਖ਼ਸ਼ਿਆ ਜਾਵੇਗਾ ਜਿਸ ’ਤੇ ਬਰਾਜਮਾਨ ਹੋ ਕੇ ਆਪ (ਸ:) ਸ਼ਫ਼ਾਅਤ (ਸਿਫ਼ਾਰਸ਼) ਕਰਨਗੇ ਜਿਵੇਂ ਕਿ ਹਦੀਸ ਵਿਚ ਹੈ। ਇਬਨੇ-ਉਮਰ ਦਾ ਕਹਿਣਾ ਹੈ ਕਿ ਕਿਆਮਤ ਵਾਲੇ ਦਿਨ ਲੋਕੀ ਆਪਣੇ ਗੋਡਿਆਂ ਦੇ ਭਾਰ ਪਏ ਹੋਣਗੇ ਅਤੇ ਹਰੇਕ ਉੱਮਤ ਆਪਣੇ ਨਬੀ ਦੇ ਪਿੱਛੇ ਤੁਰੀ ਆਓਗੀ ਅਤੇ ਲੋਕੀ ਆਖਣਗੇ ਹੇ ਫਲਾਨੇ! ਅੱਲਾਹ ਤੋਂ ਸਾਡੀ ਸ਼ਿਫ਼ਾਅਤ (ਸਿਫ਼ਾਰਸ਼) ਕਰ ਦਿਓ। ਇੱਥੋਂ ਤਕ ਕਿ ਸਿਫ਼ਾਰਸ਼ ਕਰਨ ਦਾ ਅਧਿਕਾਰ ਨਬੀ (ਸ:) ਨੂੰ ਦੇ ਦਿੱਤਾ ਜਾਵੇਗਾ ਅਤੇ ਉਹ ਉਹੀਓ ਦਿਹਾੜਾ ਹੋਵੇਗਾ ਜਦੋਂ ਅੱਲਾਹ ਨਬੀ (ਸ:) ਨੂੰ ਮਕਾਮੇ-ਮਹਮੂਦ ’ਤੇ ਬਰਾਜਮਾਨ ਕਰੇਗਾ। (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 4718) ● ਦੂਜੀ ਹਦੀਸ ਵਿਚ ਨਬੀ (ਸ:) ਨੇ ਫ਼ਰਮਾਇਆ ਜਿਹੜਾ ਵਿਅਕਤੀ ਅਜ਼ਾਨ ਸੁਣਨ ਤੋਂ ਬਾਅਦ ਦੁਆ ਪੜ੍ਹੁਗਾ ਉਸ ਨੂੰ ਕਿਆਮਤ ਵਾਲੇ ਦਿਨ ਮੇਰੇ ਸਿਫ਼ਾਰਸ਼ ਨਸੀਬ ਹੋਵੇਗੀ ਦੁਆ ਹੈ: “ਹੇ ਅੱਲਾਹ! ਇਸ ਪੂਰਨ ਦਾਅਵਤ ਅਤੇ ਇਸ ਨਮਾਜ਼ ਦੇ ਮਾਲਿਕ ਜਿਹੜੇ ਹੁਣੇ ਕਾਇਮ ਹੋਣ ਵਾਲੀ ਹੈ ਮੁਹੰਮਦ (ਸ:) ਨੂੰ ਵਸੀਲਾ ਅਤੇ ਫ਼ਜ਼ੀਲਤ ਬਖ਼ਸ਼ ਦੇ ਅਤੇ ਇਹਨਾਂ ਨੂੰ ਮੁਕਾਮੇ ਮਹਮੂਦ ’ਤੇ ਬਰਾਜਮਾਨ ਕਰ ਜਿਸ ਦਾ ਤੂੰ ਇਹਨਾਂ ਨਾਲ ਵਾਅਦਾ ਕੀਤਾ ਹੋਇਆ ਹੈ।” (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 4719) ● ਸਵਰਗ ਵਿਚ ਵਸੀਲਾ ਨਾਂ ਦੀ ਸਭ ਤੋਂ ਉੱਚੀ ਥਾਂ ਹੈ ਜਿਹੜੀ ਨਬੀ (ਸ:) ਨੂੰ ਵਿਸ਼ੇਸ਼ ਕਰ ਬਖ਼ਸ਼ੀ ਜਾਵੇਗੀ। ਅਲਫ਼ਜ਼ੀਲਤ ਆਦਰਮਾਨ ਦਾ ਇਕ ਵਿਸ਼ੇਸ਼ ਦਰਜਾ ਹੈ ਜਿਹੜਾ ਨਬੀ (ਸ:) ਨੂੰ ਸਾਰੀ ਮਖ਼ਲੂਕ ਲਈ ਬਖ਼ਸ਼ਿਆ ਜਾਵੇਗਾ।","lang":"pa","version":{"key":"punjabi_arif","direction":"ltr","language_iso_code":"pa","version":"1.0.0","last_update":1666783255,"title":"Punjabi translation","description":"Translation of the Quran meanings into Punjabi by Arif Halim, published by Darussalam"},"meta":{"transliteration":"wamina al-layli fatahajjad bihi nāfilatan laka ʿasā an yabʿathaka rabbuka maqāman maḥmūdan ","translations":["And from","the night","arise from sleep for prayer","with it","(as) additional","for you","it may be","that","will raise you","your Lord","(to) a station","praiseworthy","(79)"],"transliterationArr":["wamina","al-layli","fatahajjad","bihi","nāfilatan","laka","ʿasā","an","yabʿathaka","rabbuka","maqāman","maḥmūdan",null],"verseTiming":[[1,0,660],[2,660,1630],[3,1630,2900],[4,2900,3520],[5,3520,4890],[6,4890,5300],[7,5300,5980],[8,5980,6720],[9,6720,9080],[10,9080,10000],[11,10000,10910],[12,10910,13385]]}}