{"name":"18:39","price":"39਼ (ਅਤੇ ਕਿਹਾ) ਜਦੋਂ ਤੂੰ ਆਪਣੇ ਬਾਗ਼ ਵਿਚ ਦਾਖ਼ਲ ਹੋ ਰਿਹਾ ਸੀ ਤਾਂ “ਮਾਸ਼ਾ ਅੱਲਾਹ ਲਾ ਕੁਵੱਤਾ ਇਲਾੱ ਬਿਲਾੱਹ” 1 (ਭਾਵ ਜੋ ਅੱਲਾਹ ਚਾਹੁੰਦਾ ਹੈ ਉਹੀਓ ਹੁੰਦਾ ਹੈ, ਅੱਲਾਹ ਤੋਂ ਛੁੱਟ ਹੋਰ ਕੋਈ ਵੀ ਸ਼ਕਤੀ ਨਹੀਂ) ਕਿਉਂ ਨਾ ਕਿਹਾ। ਜੇ ਅੱਜ ਤੂੰ ਮੈਨੂੰ ਮਾਲ ਤੇ ਸੰਤਾਨ ਪੱਖੋਂ ਘੱਟ ਵੇਖ ਰਿਹਾ ਹੈ।","arabic":"وَلَوۡلَآ إِذۡ دَخَلۡتَ جَنَّتَكَ قُلۡتَ مَا شَآءَ ٱللَّهُ لَا قُوَّةَ إِلَّا بِٱللَّهِۚ إِن تَرَنِ أَنَا۠ أَقَلَّ مِنكَ مَالٗا وَوَلَدٗا","category":["18 (Al-Kahf)","Al-Kahf","Surah Al-Kahf","Chapter Al-Kahf","Kahf","Surah Kahf","Chapter Kahf","Al Kahf","Surah Al Kahf","Chapter Al Kahf","Surah 18","Chapter 18","The Cave","الكَهف"],"ayahNumber":2179,"juzNumber":15,"footnotes":"1 “ਮਾਸ਼ਾ ਅੱਲਾਹ ਲਾ ਕੁਵ-ਵਤਾ ਇੱਲਾ ਬਿੱਲਾਹ” ਖੈਰੋ ਬਰਕਤ ਅਤੇ ਬੁਰੀ ਨਜ਼ਰ ਤੋਂ ਬਚਾਉਣ ਵਾਲੀ ਦੁਆ ਹੈ ਇਸ ਦੇ ਨਾਲ ਹੀ “ਲਾ ਹੌਲਾ ਵਲਾ ਕੁਵੱਤਾ ਇੱਲਾ ਬਿਲਾਹ” ਭਾਵ ਅੱਲਾਹ ਤੋਂ ਛੁੱਟ ਕੋਈ ਵੀ ਗੁਨਾਹਾਂ ਤੋਂ ਪਰਾਂ ਰੱਖਣ ਅਤੇ ਨਾ ਹੀ ਉਸ ਤੋਂ ਛੁੱਟ ਕੋਈ ਨੇਕੀ ਕਰਨ ਦੀ ਹਿੱਮਤ ਦਿੰਦਾਂ ਹੈ। ਇਹ ਵਧੀਆ ਬੋਲ ਹਨ ਇਹਨਾਂ ਦੀ ਮਹੱਤਤਾ ਹਦੀਸ ਵਿਚ ਬਿਆਨ ਕੀਤੀ ਗਈ ਹੈ। ਜਿਵੇਂ ਹਜ਼ਰਤ ਅਬੂ-ਮੂਸਾ ਅਸ਼ਅਰੀ ਰ:ਅ: ਦੱਸਦੇ ਹਨ ਕਿ ਅੱਲਾਹ ਦੇ ਰਸੂਲ (ਸ:) ਇਕ ਹੀ ਪਹਾੜੀ ’ਤੇ ਚੜਣ ਲੱਗੇ ਤਾਂ ਇਕ ਵਿਅਕਤੀ ਉਸ ਦੀ ਚੋਟੀ ’ਤੇ ਪਹੁੰਚ ਗਿਆ ਅਤੇ ਆਖਣ ਲੱਗਾ ਕਿ ‘ਲਾ ਇਲਾਹਾ ਇੱਲਲਾਹ ਵੱਲਾ ਹੋ ਅਕਬਰ’। ਉਸ ਵੇਲੇ ਨਬੀ (ਸ:) ਆਪਣੇ ਖੱਚਰ ’ਤੇ ਸਵਾਰ ਸੀ, ਆਪ (ਸ:) ਨੇ ਫ਼ਰਮਾਇਆ ਕਿ ਤੂੰ ਕਿਸੇ ਬੋਲੇ ਨੂੰ ਨਹੀਂ ਪੁਕਾਰ ਰਿਹਾ। ਫੇਰ ਫ਼ਰਮਾਇਆ “ਹੇ ਮੂਸਾ! ਜਾਂ ਹੇ ਅਬਦੁੱਲਾ! ਕੀ ਮੈਂ ਤੁਹਾਨੂੰ ਜੰਨਤ ਦੇ ਖਜ਼ਾਨਿਆਂ ਵਿੱਚੋਂ ਇਕ ਬੋਲ ਨਾ ਦੱਸਾਂ ? ਮੈਂਨੇ ਅਰਜ਼ ਕੀਤੀ ਕਿਉਂ ਨਹੀਂ ਜ਼ਰੂਰ ਦੱਸੋ, ਆਪ (ਸ:) ਨੇ ਫ਼ਰਮਾਇਆ ਲਾ ਹੌਲਾ ਵਲਾਂ ਕੁਵ-ਵਤਾ ਇੱਲਾ ਬਿੱਲਾਹ”। (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 6409)","lang":"pa","version":{"key":"punjabi_arif","direction":"ltr","language_iso_code":"pa","version":"1.0.0","last_update":1666783255,"title":"Punjabi translation","description":"Translation of the Quran meanings into Punjabi by Arif Halim, published by Darussalam"},"meta":{"transliteration":"walawlā idh dakhalta jannataka qul'ta mā shāa al-lahu lā quwwata illā bil-lahi in tarani anā aqalla minka mālan wawaladan ","translations":["And why (did you) not","when","you entered","your garden","say","What","wills","Allah","(there is) no","power","except","with Allah","If","you see me","(me)","lesser","than you","(in) wealth","and children","(39)"],"transliterationArr":["walawlā","idh","dakhalta","jannataka","qul'ta","mā","shāa","al-lahu","lā","quwwata","illā","bil-lahi","in","tarani","anā","aqalla","minka","mālan","wawaladan",null],"verseTiming":[[1,0,2390],[2,2390,2800],[3,2800,3610],[4,3610,5210],[5,5210,5820],[6,5820,6170],[7,6170,8080],[8,8080,9030],[9,9030,9320],[10,9320,10270],[11,10270,11170],[12,11170,14120],[13,14120,14510],[14,14510,15900],[15,15900,16270],[16,16270,17200],[17,17200,18430],[18,18430,19090],[19,19090,21275]]}}