{"name":"18:94","price":"94਼ ਉਹ (ਕੌਮ) ਆਖਣ ਲੱਗੀ ਕਿ ਹੇ ਜ਼ੁਲ ਕਰਨੈਨ! ਯਾਜੂਜ ਮਾਜੂਜ 1 ਇਸ ਧਰਤੀ ’ਤੇ ਫ਼ਸਾਦ ਮਚਾਉਂਦੇ ਰਹਿੰਦੇ ਹਨ। ਕੀ ਅਸੀਂ ਤੇਰੇ ਲਈ ਕੁੱਝ ਧੰਨ ਇਕੱਠਾ ਕਰ ਲਈਏ ਤਾਂ ਜੋ ਤੂੰ ਸਾਡੇ ਤੇ ਉਹਨਾਂ ਵਿਚਾਲੇ ਇਕ ਕੰਧ ਉਸਾਰ ਦੇਵੇਂ ?","arabic":"قَالُواْ يَٰذَا ٱلۡقَرۡنَيۡنِ إِنَّ يَأۡجُوجَ وَمَأۡجُوجَ مُفۡسِدُونَ فِي ٱلۡأَرۡضِ فَهَلۡ نَجۡعَلُ لَكَ خَرۡجًا عَلَىٰٓ أَن تَجۡعَلَ بَيۡنَنَا وَبَيۡنَهُمۡ سَدّٗا","category":["18 (Al-Kahf)","Al-Kahf","Surah Al-Kahf","Chapter Al-Kahf","Kahf","Surah Kahf","Chapter Kahf","Al Kahf","Surah Al Kahf","Chapter Al Kahf","Surah 18","Chapter 18","The Cave","الكَهف"],"ayahNumber":2234,"juzNumber":16,"footnotes":"1 ਇਸ ਵਿਚ ਯਾਜੂਜ ਮਾਜੂਜ ਦੀ ਚਰਚਾ ਕੀਤੀ ਗਈ ਹੈ ਇਹ ਅੱਲਾਹ ਦੀ ਸਾਜੀ ਹੋਈ ਇਕ ਮਖ਼ਲੂਕ ਹੈ ਜਿਹੜੀ ਇਸ ਸਮੇਂ ਇਕ ਕੰਧ ਦੀ ਓਟ ਵਿਚ ਕੈਦ ਹੈ, ਕਿਆਮਤ ਦੇ ਨੇੜੇ ਜਦੋਂ ਅੱਲਾਹ ਚਾਹੇਗਾ ਉਸ ਕੰਧ ਵਿਚ ਗਲੀ ਕਰ ਦੇਵੇਗਾ ਅਤੇ ਇਹ ਬਾਹਰ ਆ ਜਾਣਗੇ ਅਤੇ ਫ਼ਸਾਦ ਫ਼ੈਲਾਉਣਗੇ। ਹਜ਼ਰਤ ਜ਼ੈਨਬ ਬਿਨਤ ਜੱਹਸ਼ (ਰ:ਅ:) ਦੱਸਦੇ ਹਨ ਕਿ ਇਕ ਦਿਨ ਅੱਲਾਹ ਦੇ ਰਸੂਲ (ਸ:) ਘਬਰਾਏ ਹੋਏ ਉਹਨਾਂ ਕੋਲ ਆਏ ਅਤੇ ਆਖਣ ਲੱਗੇ ਕਿ ਅੱਲਾਹ ਤੋਂ ਛੁੱਟ ਹੋਰ ਕਿਸੇ ਨੂੰ ਵੀ ਇਹ ਅਧਿਕਾਰ ਨਹੀਂ ਕਿ ਉਸ ਦੀ ਇਬਾਦਤ ਕੀਤੀ ਜਾਵੇ। ਜਿਸ ਚੀਜ਼ ਵਿੱਚ ਅਰਬ ਦੀ ਬਰਬਾਦੀ ਹੈ ਉਹ ਉਹਨਾਂ ਦੇ ਨੇੜੇ ਆ ਲੱਗੀ ਹੈ। ਅੱਜ ਯਾਜੂਜ ਮਾਜੂਜ ਦੀ ਕੰਧ ਵਿਚ ਇੱਨਾ ਮਗੌਰਾ ਹੋ ਗਿਆ ਹੈ ਅਤੇ ਆਪ (ਸ:) ਨੇ ਆਪਣੇ ਅੰਗੂਠੇ ਅਤੇ ਸ਼ਹਾਦਤ ਵਾਲੀ ਭਾਵ ਅੰਗੂਠੇ ਦੇ ਨਾਲ ਦੀ ਉਂਗਲੀ ਦਾ ਘੇਰਾ ਬਣਾ ਕੇ ਦੱਸਿਆ। ਹਜ਼ਰਤ ਜ਼ੈਨਬ (ਜੋ ਕਿ ਆਪ ਸ: ਦੀ ਪਤਨੀ ਸੀ) ਦੱਸਦੀਆਂ ਹਨ ਕਿ ਮੈਂਨੇ ਪੁੱਛਿਆ ਕਿ ਹੇ ਅੱਲਾਹ ਦੇ ਰਸੂਲ! ਕੀ ਅਸੀਂ ਬਰਬਾਦ ਹੋ ਜਾਵਾਂਗੇ ਜਦ ਕਿ ਸਾਡੇ ਵਿਚਾਲੇ ਨੇਕ ਲੋਕ ਵੀ ਹਨ ? ਆਪ (ਸ:) ਨੇ ਫ਼ਰਮਾਇਆ “ਹਾਂ ਜਦੋਂ ਬੁਰਾਈ ਬਹੁਤੀ ਹੀ ਵੱਧ ਜਾਵੇਗੀ” ਭਾਵ ਜ਼ਨਾਕਾਰੀ, ਹਰਾਮੀ ਬੱਚੇ ਅਤੇ ਹਰ ਤਰ੍ਹਾਂ ਦੀ ਅਸ਼ਲੀਲਤਾ ਵਿਚ ਵਾਧਾ ਹੋ ਜਾਵੇਗਾ। (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 7135)","lang":"pa","version":{"key":"punjabi_arif","direction":"ltr","language_iso_code":"pa","version":"1.0.0","last_update":1666783255,"title":"Punjabi translation","description":"Translation of the Quran meanings into Punjabi by Arif Halim, published by Darussalam"},"meta":{"transliteration":"qālū yādhā al-qarnayni inna yajūja wamajūja muf'sidūna fī al-arḍi fahal najʿalu laka kharjan ʿalā an tajʿala baynanā wabaynahum saddan ","translations":["They said","O Dhul-qarnain","O Dhul-qarnain","Indeed","Yajuj","and Majuj","(are) corrupters","in","the land","So may","we make","for you","an expenditure","[on]","that","you make","between us","and between them","a barrier","(94)"],"transliterationArr":["qālū","yādhā","al-qarnayni","inna","yajūja","wamajūja","muf'sidūna","fī","al-arḍi","fahal","najʿalu","laka","kharjan","ʿalā","an","tajʿala","baynanā","wabaynahum","saddan",null],"verseTiming":[[1,0,870],[2,870,1600],[3,1600,2920],[4,2920,3860],[5,3860,5080],[6,5080,6380],[7,6380,7610],[8,7610,7860],[9,7860,8750],[10,8750,9420],[11,9420,10250],[12,10250,10670],[13,10670,12110],[14,12110,12730],[15,12730,13520],[16,13520,13970],[17,13970,14760],[18,14760,16700],[19,16700,17580],[20,17580,18530],[21,18530,19490],[22,19490,20790],[23,20790,21855]]}}