{"name":"19:39","price":"39਼ (ਹੇ ਨਬੀ!) ਤੁਸੀਂ ਇਹਨਾਂ (ਕਾਫ਼ਿਰਾਂ) ਨੂੰ ਉਸ ਦੁਖ ਭਰੇ ਦਿਨ ਤੋਂ ਡਰਾਓ ਜਦੋਂ ਸਾਰੇ ਮਾਮਲਿਆਂ ਦਾ ਨਬੇੜਾ ਕਰ ਦਿੱਤਾ ਜਾਵੇਗਾ ਪਰ ਅੱਜ (ਸੰਸਾਰ ਵਿਚ) ਇਹ ਲੋਕੀ ਭੁਲੇਖੇ ਵਿਚ ਹਨ 1 ਉਹ ਈਮਾਨ ਨਹੀਂ ਲਿਆਉਣਗੇ।","arabic":"وَأَنذِرۡهُمۡ يَوۡمَ ٱلۡحَسۡرَةِ إِذۡ قُضِيَ ٱلۡأَمۡرُ وَهُمۡ فِي غَفۡلَةٖ وَهُمۡ لَا يُؤۡمِنُونَ","category":["19 (Maryam)","Maryam","Surah Maryam","Chapter Maryam","Surah 19","Chapter 19","Mary","مَريَم"],"ayahNumber":2289,"juzNumber":16,"footnotes":"1 ਜਦੋਂ ਕਿਆਮਤ ਦੀ ਘਟਨਾ ਵਾਪਰੇਗੀ ਤਾਂ ਇਨਕਾਰੀਆਂ ਦੀਆਂ ਅੱਖਾਂ ਖੁਲ੍ਹੀਆਂ ਰਹਿ ਜਾਣਗੀਆਂ ਅਤੇ ਅਫ਼ਸੋਸ ਕਰਨਗੇ ਪਰ ਹੁਣ ਇਸ ਦੀ ਭਰਪਾਈ ਨਹੀਂ ਹੋ ਸਕਦੀ ਕਿਉਂ ਜੇ ਉੱਥੇ ਜਿਹੜਾ ਵੀ ਕੋਈ ਆਰਾਮ ਤੇ ਖ਼ੁਸ਼ੀ ਵਿਚ ਹੋਵੇਗਾ ਉਹ ਸਦਾ ਲਈ ਹੋਵੇਗਾ ਅਤੇ ਜਿਹੜਾ ਅਜ਼ਾਬ ਵਿਚ ਫ਼ਸਿਆ ਹੋਵੇਗਾ ਉਹ ਵੀ ਸਦਾ ਲਈ ਹੋਵੇਗਾ। ਇਕ ਹਦੀਸ ਵਿਚ ਅੱਲਾਹ ਦੇ ਰਸੂਲ (ਸ:) ਨੇ ਫ਼ਰਮਾਇਆ “ਕਿਆਮਤ ਦਿਹਾੜੇ ਮੌਤ ਨੂੰ ਇਕ ਚਿਤਕਬਰੇ ਮਿੰਢੇ ਦੀ ਸ਼ਕਲ ਵਿਚ ਲਿਆਇਆ ਜਾਵੇਗਾ ਅਤੇ ਫੇਰ ਇਕ ਆਵਾਜ਼ ਦੇਣ ਵਾਲੀ ਆਵਾਜ਼ ਦੇਵੇਗਾ ਕਿ ਹੇ ਜੰਨਤੀਓ! ਜਦੋਂ ਉਹ ਗਰਦਨ ਚੁੱਕ ਕੇ ਵੇਖਣਗੇ ਕਿ ਉਹਨਾਂ ਨੂੰ ਕਿਹਾ ਜਾਵੇਗਾ ਕੀ ਤੁਸੀਂ ਇਸ ਨੂੰ ਜਾਣਦੇ ਹੋ ? ਤਾਂ ਉਹ ਆਖਣਗੇ ਕਿ ਹਾਂ! ਜਾਣਦੇ ਹਾਂ ਇਹ ਤਾਂ ਮੌਤ ਹੈ ਕਿਉਂ ਜੋ ਇਸ ਨੂੰ ਸਾਰੇ ਹੀ ਵੇਖ ਚੁੱਕੇ ਹਨ। ਫੇਰ ਦੁਬਾਰਾ ਪੁੱਛਿਆ ਜਾਵੇਗਾ ਹੇ ਨਰਕੀਓ! ਉਹ ਵੀ ਗਰਦਨ ਚੁੱਕਣਗੇ ਤਾਂ ਉਹਨਾਂ ਨੂੰ ਵੀ ਪੁੱਛਿਆ ਜਾਵੇਗਾ ਕਿ ਕੀ ਤੁਸੀਂ ਇਸ ਨੂੰ ਜਾਣਦੇ ਹੋ ? ਉਹ ਕਹਿਣਗੇ ਕਿ ਹਾਂ! ਇਹ ਤਾਂ ਮੌਤ ਹੈ ਕਿਉਂ ਜੋ ਉਸ ਸਮੇਂ ਤਕ ਸਾਰੇ ਹੀ ਉਸ ਨੂੰ ਵੇਖ ਚੁੱਕੇ ਹੋਣਗੇ। ਫੇਰ ਇਸ ਮੀਢੇ ਨੂੰ ਜ਼ਿਬਹ ਕੀਤਾ ਜਾਵੇਗਾ ਅਤੇ ਮਨਾਦੀ ਕਰਨ ਵਾਲਾ ਆਖੇਗਾ ਕਿ ਹੇ ਸਵਰਗ ਵਾਲਿਓ! ਤੁਸੀਂ ਸਦਾ ਲਈ ਇਸ ਵਿਚ ਰਹੋਗੇ ਹੁਣ ਤੁਹਾਨੂੰ ਮੌਤ ਨਹੀਂ ਆਵੇਗੀ ਅਤੇ ਹੇ ਨਰਕ ਵਾਲਿਓ! ਤੁਸੀਂ ਸਦਾ ਇਸੇ ਵਿਚ ਰਹੋਗੇ ਹੁਣ ਤੁਹਾਨੂੰ ਮੌਤ ਨਹੀਂ ਆਵੇਗੀ ਫੇਰ ਇਸ ਤੋਂ ਬਾਅਦ ਰਸੂਲ (ਸ:) ਨੇ ਇਸੇ ਆਇਤ ਦਾ ਪਾਠ ਕੀਤਾ। (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 4730)","lang":"pa","version":{"key":"punjabi_arif","direction":"ltr","language_iso_code":"pa","version":"1.0.0","last_update":1666783255,"title":"Punjabi translation","description":"Translation of the Quran meanings into Punjabi by Arif Halim, published by Darussalam"},"meta":{"transliteration":"wa-andhir'hum yawma al-ḥasrati idh quḍiya al-amru wahum fī ghaflatin wahum lā yu'minūna ","translations":["And warn them","(of the) Day","(of) the Regret","when","has been decided","the matter","And they","(are) in","heedlessness","and they","(do) not","believe","(39)"],"transliterationArr":["wa-andhir'hum","yawma","al-ḥasrati","idh","quḍiya","al-amru","wahum","fī","ghaflatin","wahum","lā","yu'minūna",null],"verseTiming":[[1,0,2130],[2,2130,2800],[3,2800,4040],[4,4040,4490],[5,4490,5140],[6,5140,6160],[7,6160,6760],[8,6760,7250],[9,7250,8980],[10,8980,9800],[11,9800,10400],[12,10400,13595]]}}