{"name":"25:19","price":"19਼ (ਅੱਲਾਹ ਕਾਫ਼ਿਰਾਂ ਨੂੰ ਆਖੇਗਾ ਕਿ) ਉਹਨਾਂ (ਇਸ਼ਟਾਂ) ਨੇ ਤਾਂ ਤੁਹਾਡੀਆਂ ਸਾਰੀਆਂ ਗੱਲਾਂ ਦੀ ਨਿਖੇਦੀ ਕੀਤੀ ਹੈ। ਹੁਣ ਨਾ ਤਾਂ ਤੁਸੀਂ ਅਜ਼ਾਬ ਨੂੰ ਟਾਲ ਸਕਦੇ ਹੋ ਅਤੇ ਨਾ ਹੀ (ਕਿਸੇ ਤੋਂ) ਕੋਈ ਮਦਦ ਲੈ ਸਕਦੇ ਹੋ। ਤੁਹਾਡੇ (ਕਾਫ਼ਿਰਾਂ) ਵਿੱਚੋਂ ਜਿਹੜਾ ਵੀ ਜ਼ੁਲਮ (ਸ਼ਿਰਕ) ਕਰੇਗਾ ਹੈ ਅਸੀਂ ਉਸ ਨੂੰ ਕਰੜਾ ਅਜ਼ਾਬ ਦੇਵਾਂਗੇ।1","arabic":"فَقَدۡ كَذَّبُوكُم بِمَا تَقُولُونَ فَمَا تَسۡتَطِيعُونَ صَرۡفٗا وَلَا نَصۡرٗاۚ وَمَن يَظۡلِم مِّنكُمۡ نُذِقۡهُ عَذَابٗا كَبِيرٗا","category":["25 (Al-Furqan)","Al-Furqan","Surah Al-Furqan","Chapter Al-Furqan","Furqan","Surah Furqan","Chapter Furqan","Al Furqan","Surah Al Furqan","Chapter Al Furqan","Surah 25","Chapter 25","The Criterion","الفُرقان"],"ayahNumber":2874,"juzNumber":18,"footnotes":"1 ਇਸ ਆਇਤ ਤੋਂ ਪਤਾ ਲੱਗਦਾ ਹੈ ਕਿ ਇਕ ਅੱਲਾਹ ਤੋਂ ਛੁੱਟ ਹੋਰ ਕਿਸੇ ਦੀ ਇਬਾਦਤ ਜਾਇਜ਼ ਨਹੀਂ, ਜਿਹੜੇ ਕਿਸੇ ਹੋਰ ਦੀ ਇਬਾਦਤ ਕਰੇਗਾ ਤਾਂ ਉਹ ਅੱਲਾਹ ਦੇ ਅਜ਼ਾਬ ਦਾ ਹੱਕਦਾਰ ਹੋਵੇਗਾ ਨਹੀਂ ਤਾਂ ਅੱਲਾਹ ਇੰਨਾ ਮਿਹਰਬਾਨ ਹੈ ਕਿ ਉਹ ਆਪਣੇ ਬੰਦਿਆਂ ਨੂੰ ਅਜ਼ਾਬ ਦੇਣਾ ਪਸੰਦ ਹੀ ਨਹੀਂ ਕਰਦਾ। ਇਕ ਹਦੀਸ ਵਿਚ ਹੈ ਕਿ ਅੱਲਾਹ ਦੇ ਰਸੂਲ (ਸ:) ਨੇ ਫ਼ਰਮਾਇਆ “ਹੇ ਮਆਜ਼! ਕੀ ਤੂੰ ਜਾਣਦਾ ਹੈ ਕਿ ਅੱਲਾਹ ਦਾ ਬੰਦਿਆਂ ਉੱਤੇ ਕੀ ਹੱਕ ਹੈ ? ਮਆਜ਼ ਨੇ ਕਿਹਾ ਕਿ ਅੱਲਾਹ ਅਤੇ ਉਸ ਦਾ ਰਸੂਲ ਵੱਧ ਜਾਣਦਾ ਹੈ” ਆਪ (ਸ:) ਨੇ ਫ਼ਰਮਾਇਆ ਕਿ ਉਹ ਹੱਕ ਇਹ ਹੈ ਕਿ ਉਹ ਉਸ ਦੀ ਇਬਾਦਤ ਕਰਨ ਅਤੇ ਉਸ ਦੇ ਨਾਲ ਕਿਸੇ ਹੋਰ ਨੂੰ ਸ਼ਰੀਕ ਨਾ ਬਣਾਉਣ। ਫੇਰ ਆਪ (ਸ:) ਨੇ ਫ਼ਰਮਾਇਆ ਕੀ ਤੂੰ ਜਾਣਦਾ ਹੈ ਕਿ ਬੰਦਿਆਂ ਦਾ ਅੱਲਾਹ ਉੱਤੇ ਕੀ ਹੱਕ ਹੈ? ਹਜ਼ਰਤ ਮਆਜ਼ ਰ:ਅ ਨੇ ਬੇਨਤੀ ਕੀਤੀ ਕਿ ਅੱਲਾਹ ਅਤੇ ਉਸ ਦਾ ਰਸੂਲ ਹੀ ਵੱਧ ਜਾਣਦੇ ਹਨ “ਨਬੀ ਕਰੀਮ (ਸ:) ਨੇ ਫ਼ਰਮਾਇਆ, ਉਹ ਇਹ ਹੈ ਕਿ ਉਹਨਾਂ ਬੰਦਿਆਂ ਨੂੰ ਅਜ਼ਾਬ ਨਾ ਦੇਵੇ। (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 7373)","lang":"pa","version":{"key":"punjabi_arif","direction":"ltr","language_iso_code":"pa","version":"1.0.0","last_update":1666783255,"title":"Punjabi translation","description":"Translation of the Quran meanings into Punjabi by Arif Halim, published by Darussalam"},"meta":{"transliteration":"faqad kadhabūkum bimā taqūlūna famā tastaṭīʿūna ṣarfan walā naṣran waman yaẓlim minkum nudhiq'hu ʿadhāban kabīran ","translations":["So verily","they deny you","in what","you say","so not","you are able","(to) avert","and not","(to) help","And whoever","does wrong","among you","We will make him taste","a punishment","great","(19)"],"transliterationArr":["faqad","kadhabūkum","bimā","taqūlūna","famā","tastaṭīʿūna","ṣarfan","walā","naṣran","waman","yaẓlim","minkum","nudhiq'hu","ʿadhāban","kabīran",null],"verseTiming":[[1,0,680],[2,680,2940],[3,2940,3510],[4,3510,4860],[5,4860,5540],[6,5540,7340],[7,7340,9150],[8,9150,9870],[9,9870,11350],[10,11350,11790],[11,11790,13290],[12,13290,15880],[13,15880,16710],[14,16710,18590],[15,18590,20225]]}}