{"name":"25:70","price":"70਼ ਪਰ ਜਿਨ੍ਹਾਂ ਨੇ ਤੌਬਾ ਕਰ ਲਈ ਅਤੇ ਈਮਾਨ ਲਿਆਏ ਅਤੇ ਨੇਕ ਕੰਮ ਕੀਤੇ ਅਜਿਹੇ ਲੋਕਾਂ ਦੀਆਂ ਬੁਰਾਈਆਂ ਨੂੰ ਅੱਲਾਹ ਨੇਕੀਆਂ ਵਿਚ ਬਦਲ ਦੇਵੇਗਾ। ਅੱਲਾਹ (ਮਿਹਰਾਂ ਸਦਕੇ) ਬਖ਼ਸ਼ਣਹਾਰ ਤੇ ਮਿਹਰਬਾਨ ਹੈ।1","arabic":"إِلَّا مَن تَابَ وَءَامَنَ وَعَمِلَ عَمَلٗا صَٰلِحٗا فَأُوْلَٰٓئِكَ يُبَدِّلُ ٱللَّهُ سَيِّـَٔاتِهِمۡ حَسَنَٰتٖۗ وَكَانَ ٱللَّهُ غَفُورٗا رَّحِيمٗا","category":["25 (Al-Furqan)","Al-Furqan","Surah Al-Furqan","Chapter Al-Furqan","Furqan","Surah Furqan","Chapter Furqan","Al Furqan","Surah Al Furqan","Chapter Al Furqan","Surah 25","Chapter 25","The Criterion","الفُرقان"],"ayahNumber":2925,"juzNumber":19,"footnotes":"1 ਅੱਲਾਹ ਦੇ ਰਸੂਲ (ਸ:) ਨੇ ਫ਼ਰਮਾਇਆ “ਬੇਸ਼ੱਕ ਇਸਲਾਮ ਪਿਛਲੇ ਸਾਰੇ ਗੁਨਾਹਾਂ ਨੂੰ ਖ਼ਤਮ ਕਰ ਦਿੰਦਾ ਹੈ ਇੰਜ ਹੀ ਅੱਲਾਹ ਲਈ ਹਿਜਰਤ ਅਤੇ ਅੱਲਾਹ ਦੇ ਘਰ ਦਾ ਹੱਜ ਵੀ” (ਸਹੀ ਮੁਸਲਿਮ, ਹਦੀਸ: 121) ਹਜ਼ਰਤ ਇਬਨੇ ਅੱਬਾਸ ਰਾਹੀਂ ਪਤਾ ਲੱਗਦਾ ਹੈ ਕਿ ਕੁੱਝ ਮੁਸ਼ਰਿਕ ਜਿਨ੍ਹਾਂ ਨੇ ਬਹੁਤ ਕਤਲ ਅਤੇ ਜ਼ਨਾ ਕੀਤੇ ਸੀ। ਨਬੀ ਕਰੀਮ (ਸ:) ਦੀ ਸੇਵਾ ਵਿਖੇ ਹਾਜ਼ਿਰ ਹੋਏ ਅਤੇ ਉਹਨਾਂ ਨੇ ਕਿਹਾ ਕਿ ਤੁਸੀਂ ਜੋ ਵੀ ਆਖਦੇ ਹੋ ਅਤੇ ਜਿਹੜੇ ਧਰਮ ਵੱਲ ਬੁਲਾਉਂਦੇ ਹੋ ਉਹ ਬਹੁਤ ਹੀ ਵਧੀਆ ਹੈ ਪਰ ਤੁਸੀਂ ਸਾਨੂੰ ਇਹ ਤਾਂ ਦੱਸੋ ਕਿ ਅਸਾਂ ਜਿਹੜੇ ਭੈੜੇ ਕੰਮ ਕੀਤੇ ਹੋਏ ਹਨ ਉਹਨਾਂ ਦਾ ਕੋਈ ਕੱਫ਼ਾਰਾ (ਬਚਾਓ) ਵੀ ਹੈ?ਇਸ ’ਤੇ •ਕੁਰਆਨ ਦੀ ਇਹ ਆਇਤ ਨਾਜ਼ਿਲ ਹੋਈ ਕਿ ਜਿਹੜੇ ਅੱਲਾਹ ਦੇ ਨਾਲ ਕਿਸੇ ਦੂਜੇ ਇਸ਼ਟ ਨੂੰ ਨਹੀਂ ਪੁਕਾਰਦੇ ਅਤੇ ਜਿਸ ਮਨੁੱਖੀ ਜਾਨ ਨੂੰ ਹਰਾਮ ਕੀਤਾ ਹੈ ਉਸ ਨੂੰ ਨਾ-ਹੱਕਾ ਕਤਲ ਨਹੀਂ ਕਰਦੇ ਅਤੇ ਨਾ ਹੀ ਉਹ ਜ਼ਨਾ ਕਰਦੇ ਹਨ ਅਤੇ ਜਿਹੜਾ ਕੋਈ ਅਜਿਹੇ ਕੰਮ ਕਰੇਗਾ ਉਸ ਨੂੰ ਗੁਨਾਹ ਦਾ ਬਦਲਾ ਮਿਲੇਗਾ ਪਰ ਜਿਸ ਨੇ ਤੌਬਾ ਕਰ ਲਈ ਉਸ ਨੂੰ ਸਜ਼ਾ ਨਹੀਂ ਅਤੇ ਸੂਰਤ ਅਲ ਜ਼ੁਮਰ ਦੀ ਇਹ ਆਇਤ ਵੀ ਨਾਜ਼ਿਲ ਹੋਈ, “ਹੇ ਰਸੂਲ! ਤੁਸੀਂ ਸਾਡੇ ਵੱਲੋਂ ਆਖ ਦਿਓ ਕਿ ਹੇ ਮੇਰੇ ਬੰਦਿਓ! ਜਿਨ੍ਹਾਂ ਨੇ ਵੀ ਪਾਪ ਕਰਕੇ ਆਪਣੀਆਂ ਜਾਨਾਂ ਨਾਲ ਵਧੀਕੀ ਕੀਤੀ ਹੈ, ਉਹ ਅੱਲਾਹ ਦੀਆਂ ਮਿਹਰਾਂ ਤੋਂ ਬੇ-ਆਸ ਨਾ ਹੋਣ”। (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 4810, ਸਹੀ ਮੁਸਲਿਮ, ਹਦੀਸ: 122)","lang":"pa","version":{"key":"punjabi_arif","direction":"ltr","language_iso_code":"pa","version":"1.0.0","last_update":1666783255,"title":"Punjabi translation","description":"Translation of the Quran meanings into Punjabi by Arif Halim, published by Darussalam"},"meta":{"transliteration":"illā man tāba waāmana waʿamila ʿamalan ṣāliḥan fa-ulāika yubaddilu al-lahu sayyiātihim ḥasanātin wakāna al-lahu ghafūran raḥīman ","translations":["Except","(he) who","repents","and believes","and does","righteous deeds","righteous deeds","then (for) those","Allah will replace","Allah will replace","their evil deeds","(with) good ones","And is","Allah","Oft-Forgiving","Most Merciful","(70)"],"transliterationArr":["illā","man","tāba","waāmana","waʿamila","ʿamalan","ṣāliḥan","fa-ulāika","yubaddilu","al-lahu","sayyiātihim","ḥasanātin","wakāna","al-lahu","ghafūran","raḥīman",null],"verseTiming":[[1,0,960],[2,960,1890],[3,1890,2910],[4,2910,4030],[5,4030,4880],[6,4880,6460],[7,6460,7560],[8,7560,11770],[9,11770,14450],[10,14450,15510],[11,15510,16420],[12,16420,18300],[13,18300,19080],[14,19080,21240],[15,21240,21360],[16,21360,22670],[17,22670,23710],[18,23710,24600],[19,24600,26375]]}}