{"name":"29:51","price":"51਼ ਕੀ ਇਹਨਾਂ(ਕਾਫ਼ਿਰਾਂ) ਲਈ ਇਹ(.ਕੁਰਆਨ ਦੀ ਨਿਸ਼ਾਨੀ) ਕਾਫ਼ੀ ਨਹੀਂ ਕਿ ਅਸੀਂ ਤੁਹਾਡੇ (ਮੁਹੰਮਦ)’ਤੇ ਇਹ ਕਿਤਾਬ ਉਤਾਰੀ ਹੈ ਜਿਹੜੀ ਇਹਨਾਂ (ਕਾਫ਼ਿਰਾਂ ਨੂੰ ਸੁਚੇਤ ਕਰਨ) ਲਈ ਪੜ੍ਹੀ ਜਾਂਦੀ ਹੈ। 1 ਬੇਸ਼ੱਕ ਇਸ ਵਿਚ ਉਹਨਾਂ ਲੋਕਾਂ ਲਈ ਰਹਿਮਤਾਂ (ਵੀ) ਹਨ ਅਤੇ ਨਸੀਹਤਾਂ ਵੀ ਹਨ, ਜਿਹੜੇ ਈਮਾਨ ਰੱਖਦੇ ਹਨ (ਭਾਵ ਸੱਚ ਸਮਝਦੇ ਹਨ)।","arabic":"أَوَلَمۡ يَكۡفِهِمۡ أَنَّآ أَنزَلۡنَا عَلَيۡكَ ٱلۡكِتَٰبَ يُتۡلَىٰ عَلَيۡهِمۡۚ إِنَّ فِي ذَٰلِكَ لَرَحۡمَةٗ وَذِكۡرَىٰ لِقَوۡمٖ يُؤۡمِنُونَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut","Chapter Al-Ankabut","Ankabut","Surah Ankabut","Chapter Ankabut","Al Ankabut","Surah Al Ankabut","Chapter Al Ankabut","Surah 29","Chapter 29","The Spider","العَنكَبُوت"],"ayahNumber":3391,"juzNumber":21,"footnotes":"1 ਜੇ ਕੁਰਆਨ ਪਾਕ ਨੂੰ ਸੋਚ ਵਿਚਾਰ ਕਰਦੇ ਹੋਏ ਪੜ੍ਹਿਆ ਜਾਵੇ ਤਾਂ ਮਨੁੱਖ ਨੂੰ ਇਸ ਦਾ ਲਾਭ ਹੁੰਦਾ ਹੈ ਅਤੇ ਅੱਲਾਹ ਤਆਲਾ ਵੀ ਇਸੇ ਤਰ੍ਹਾਂ ਕੁਰਆਨ ਪੜ੍ਹਨ ਵਾਲ ਤੋਂ ਖ਼ੁਸ਼ ਹੁੰਦਾ ਹੈ। ਹਦੀਸ ਵਿਚ ਹੈ ਕਿ ਅੱਲਾਹ ਤਆਲਾ ਕਿਸੇ ਗੱਲ ਉੱਤੇ ਇੰਨਾਂ ਧਿਆਨ ਨਹੀਂ ਦਿੰਦਾ ਜਿੰਨਾਂ ਪੈਗ਼ੰਬਰ ਦੀ ਸੋਹਣੀ ਤੇ ਉੱਚੀ ਅਵਾਜ਼ ਨਾਲ ਕੁਰਆਨ ਪੜ੍ਹਨ ਤੇ ਖ਼ੁਸ਼ ਹੁੰਦਾ ਹੈ। (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 5024) ● ਇਕ ਦੂਜੀ ਹਦੀਸ ਵਿਚ ਅੱਲਾਹ ਦੇ ਰਸੂਲ ਨੇ ਫ਼ਰਮਇਆ ਕਿ ਈਰਖਾ ਕੇਵਲ ਦੋ ਆਦਮੀਆਂ ਤੇ ਕੀਤੀ ਜਾ ਸਕਦੀ ਹੈ ਇਕ ਉਹ ਜਿਸ ਨੂੰ ਅੱਲਾਹ ਨੇ ਕੁਰਆਨ ਦੇ ਗਿਆਨ ਨਾਲ ਨਵਾਜ਼ਿਆ ਹੈ ਅਤੇ ਦੂਜਾ ਉਹ ਜਿਹੜਾ ਦਿਨ ਰਾਤ ਇਸ ਦੀ ਤਲਾਵਤ ਵਿਚ ਰੁਝਿਆ ਰਹਿੰਦਾ ਹੈ ਕਿ ਉਸ ਦੀ ਤਲਾਵਤ ਸੁਣ ਕੇ ਉਸ ਦਾ ਗਵਾਂਡੀ ਈਰਖਾ ਕਰੇ ਕਿ ਕਾਸ਼! ਮੈਨੂੰ ਵੀ ਇੰਜ ਹੀ ਕੁਰਆਨ ਯਾਦ ਹੁੰਦਾ ਤਾਂ ਮੈਂ ਵੀ ਇਸੇ ਤਰ੍ਹਾਂ .ਕੁਰਆਨ ਪੜ੍ਹਦਾ। ਦੂਜਾ ਉਹ ਵਿਅਕਤੀ ਜਿਸ ਨੂੰ ਅੱਲਾਹ ਨੇ ਧਨ ਬਖ਼ਸ਼ਿਆ ਹੋਵੇ ਅਤੇ ਉਸ ਨੂੰ ਚੰਗੇ ਕੰਮਾ ਲਈ ਖ਼ਰਚ ਕਰਦਾ ਹੋਵੇ। ਇਸ ’ਤੇ ਕੋਈ ਵਿਅਕਤੀ ਇਹ ਕਹਿ ਸਕਦਾ ਹੈ ਕਿ ਕਾਸ਼ ਮੈਨੂੰ ਵੀ ਅਜਿਹੀ ਦੋਲਤ ਮਿਲ ਜਾਂਦੀ ਤਾਂ ਮੈਂ ਵੀ ਉਸ ਨੂੰ ਚੰਗੇ ਕੰਮਾਂ ਵਿਚ ਖ਼ਰਚ ਕਰਦਾ (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 5026)","lang":"pa","version":{"key":"punjabi_arif","direction":"ltr","language_iso_code":"pa","version":"1.0.0","last_update":1666783255,"title":"Punjabi translation","description":"Translation of the Quran meanings into Punjabi by Arif Halim, published by Darussalam"},"meta":{"transliteration":"awalam yakfihim annā anzalnā ʿalayka al-kitāba yut'lā ʿalayhim inna fī dhālika laraḥmatan wadhik'rā liqawmin yu'minūna ","translations":["And is (it) not","sufficient for them","that We","revealed","to you","the Book","(which) is recited","to them","Indeed","in","that","surely is a mercy","and a reminder","for a people","who believe","(51)"],"transliterationArr":["awalam","yakfihim","annā","anzalnā","ʿalayka","al-kitāba","yut'lā","ʿalayhim","inna","fī","dhālika","laraḥmatan","wadhik'rā","liqawmin","yu'minūna",null],"verseTiming":[[1,0,840],[2,840,1910],[3,1910,3360],[4,3360,5190],[5,5190,7200],[6,7200,8030],[7,8030,9150],[8,9150,9940],[9,9940,10970],[10,10970,12540],[11,12540,13060],[12,13060,13920],[13,13920,16070],[14,16070,17000],[15,17000,18830],[16,18830,21605]]}}