{"name":"2:139","price":"139਼ (ਹੇ ਨਬੀ! ਤੁਸੀਂ) ਆਖੋ, ਕੀ ਤੁਸੀਂ ਸਾਡੇ ਨਾਲ ਅੱਲਾਹ ਬਾਰੇ ਝਗੜਦੇ ਹੋ ? ਜਦੋਂ ਕਿ ਉਹ ਸਾਡਾ ਵੀ ਰੱਬ ਹੈ ਅਤੇ ਤੁਹਾਡਾ ਵੀ ਉਹੀਓ ਰੱਬ ਹੈ ਅਤੇ ਸਾਡੇ ਲਈ ਸਾਡੇ ਕਰਮ ਹਨ ਅਤੇ ਤੁਹਾਡੇ ਲਈ ਤੁਹਾਡੇ ਕਰਮ ਹਨ ਅਤੇ ਅਸੀਂ ਸਾਰੇ (ਕਰਮ) ਖ਼ਾਲਸ ਉਸੇ (ਅੱਲਾਹ ਦੀ ਰਜ਼ਾ) ਲਈ ਕਰਦੇ ਹਾਂ। 1","arabic":"قُلۡ أَتُحَآجُّونَنَا فِي ٱللَّهِ وَهُوَ رَبُّنَا وَرَبُّكُمۡ وَلَنَآ أَعۡمَٰلُنَا وَلَكُمۡ أَعۡمَٰلُكُمۡ وَنَحۡنُ لَهُۥ مُخۡلِصُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":146,"juzNumber":1,"footnotes":"1ਇਸ ਵਿਚ ਦੱਸਿਆਂ ਗਿਆ ਹੈ ਕਿ ਜਿਹੜਾ ਵੀ ਕੰਮ ਕੇਵਲ ਅੱਲਾਹ ਦੀ ਰਜ਼ਾ ਲਈ ਕੀਤਾ ਜਾਂਦਾ ਹੈ ਉਹੀਓ ਅਮਲ ਮੁਕਤੀ ਦਾ ਕਾਰਨ ਬਣਦਾ ਹੈ ਅਤੇ ਇਸ ਵਿਚ ਇਖ਼ਲਾਸ ਦੀ ਮਹੱਤਤਾ ਵੀ ਦੱਸੀ ਗਈ ਹੈ (1) ਅੱਲਾਹ ਦੇ ਰਸੂਲ (ਸ:) ਰਾਤ ਨੂੰ ਇੰਨੀ ਲੰਮੀ ਨਮਾਜ਼ ਪੜ੍ਹਿਆ ਕਰਦੇ ਸੀ ਕਿ ਪੈਰਾਂ ’ਤੇ ਸੋਜਾ ਆ ਜਾਂਦਾ। ਜਦੋਂ ਆਪ ਜੀ ਨੂੰ ਕਿਹਾ ਜਾਂਦਾ ਕਿ ਤੁਸੀਂ ਇੰਨਾ ਕਸ਼ਟ ਕਿਓਂ ਉਠਾਉਂਦੇ ਹੋ ਤਾਂ ਆਖਦੇ “ਕੀ ਮੈਂ ਅੱਲਾਹ ਦਾ ਧੰਨਵਾਦੀ ਨਾ ਬਣਾ? ” (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 6471) * ਅੱਲਾਹ ਦੇ ਰਸੂਲ (ਸ:) ਨੇ ਫ਼ਰਮਾਇਆ ਕਿ ਭਲੇ ਕੰਮ ਸਹੀ ਤਰੀਕੇ ਨਾਲ, ਇਖ਼ਲਾਸ ਨਾਲ ਕਰਦੇ ਰਹੋ ਅਤੇ ਹੋਂਦ ਨਾ ਵਧੋ ਸਗੋਂ ਵਿਚਕਾਰ ਵਾਲੀ ਰਾਹ ਅਪਣਾਓ ਅਤੇ ਖ਼ੁਸ਼ ਰਹੋ (ਅੱਲਾਹ ਦੀ ਰਹਿਮਤ ਤੋਂ ਬੇ-ਆਸ ਨਾ ਹੋਵੋ) ਕਿਉਂ ਜੋ ਕੇਵਲ ਨੇਕ ਕੰਮ ਹੀ ਕਿਸੇ ਨੂੰ ਜੰਨਤ ਵਿਚ ਨਹੀਂ ਲੈਕੇ ਜਾਣਗੇ। ਆਪ ਜੀ (ਸ:) ਤੋਂ ਪੁੱਛਿਆ ਗਿਆ ਕਿ ਕੀ ਤੁਸੀਂ ਵੀ ਅਮਲਾਂ ਦੇ ਸਦਕੇ ਜੰਨਤ ਵਿਚ ਨਹੀਂ ਜਾਓਗੇ? ਆਪ ਨੇ ਫ਼ਰਮਾਇਆ ਹਾਂ ਮੈਂ ਵੀ ਪਰ ਇਹ ਗੱਲ ਵੀ ਹੈ ਕਿ ਅੱਲਾਹ ਮੈਨੂੰ ਆਪਣੀ ਬਖ਼ਸ਼ਿਸ਼ ਅਤੇ ਮਿਹਰਾਂ ਦੀ ਛਤਰ-ਛਾਇਆ ਹੇਠ ਵੀ ਲੈ ਲਵੇ। (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 6467) * ਹਦੀਸ ਵਿੱਚ ਹੈ ਕਿ ਨਬੀ (ਸ:) ਨੇ ਫ਼ਰਮਾਇਆ ਕਿ ਜੇ ਮੇਰੇ ਕੋਲ ੳਹਦ ਦੇ ਪਹਾੜ ਜਿੰਨਾ ਸੋਨਾ ਹੁੰਦਾ ਫਿਰ ਵੀ ਮੈਂ ਇਸ ਗਲ ’ਤੇ ਖ਼ੁਸ਼ ਹੋਵਾਂਗਾ ਕਿ ਲਗਾਤਾਰ ਤਿੰਨ ਰਾਤਾਂ ਬੀਤਣ ਤੋਂ ਪਹਿਲਾਂ ਇਕ ਕਣ ਵੀ ਮੇਰੇ ਕੋਲ ਨਾ ਰਹੇ। ਹਾਂ! ਜੇ ਕਿਸੇ ਦਾ ਕਰਜ਼ ਅਦਾ ਕਰਨ ਲਈ ਰੱਖ ਲਵਾਂ ਤਾਂ ਵੱਖਰੀ ਗੱਲ ਹੈ। (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 6445)\n* ਅੱਲਾਹ ਦੇ ਰਸੂਲ ਨੇ ਫ਼ਰਮਾਇਆ ਇਕ ਪਿਆਸਾ ਕੁੱਤਾ ਖੂਹ ਦੇ ਆਲੇ-ਦੁਆਲੇ ਚੱਕਰ ਲਗਾ ਰਿਹਾ ਸੀ ਪਿਆਸ ਕਾਰਨ ਉਸ ਦਾ ਦਮ ਨਿਕਲਣ ਵਾਲਾ ਹੀ ਸੀ ਕਿ ਬਨੀ ਇਸਰਾਈਲ ਦੀ ਇਕ ਬਦਕਾਰ ਔੌਰਤ ਦੀ ਉਸ ’ਤੇ ਨਿਗਾਹ ਪੈ ਗਈ ਤਾਂ ਉਸ ਨੇ ਆਪਣੀ ਜੁਤੀ ਉਤਾਰੀ ਅਤੇ ਉਸ ਵਿਚ ਪਾਣੀ ਭਰ ਕੇ ਕੁੱਤੇ ਨੂੰ ਪਿਆ ਦਿੱਤਾ ਅੱਲਾਹ ਨੇ ਇਸੇ ਕਾਰਨ ਉਸ ਦੀ ਬਖ਼ਸ਼ਿਸ਼ ਕਰ ਦਿੱਤੀ। (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 3467)","lang":"pa","version":{"key":"punjabi_arif","direction":"ltr","language_iso_code":"pa","version":"1.0.0","last_update":1666783255,"title":"Punjabi translation","description":"Translation of the Quran meanings into Punjabi by Arif Halim, published by Darussalam"},"meta":{"transliteration":"qul atuḥājjūnanā fī al-lahi wahuwa rabbunā warabbukum walanā aʿmālunā walakum aʿmālukum wanaḥnu lahu mukh'liṣūna ","translations":["Say","Do you argue with us","about","Allah","while He","(is) our Lord","and your Lord","And for us","(are) our deeds","and for you","(are) your deeds","and we","to Him","(are) sincere","(139)"],"transliterationArr":["qul","atuḥājjūnanā","fī","al-lahi","wahuwa","rabbunā","warabbukum","walanā","aʿmālunā","walakum","aʿmālukum","wanaḥnu","lahu","mukh'liṣūna",null],"verseTiming":[[1,0,420],[2,420,4550],[3,4550,4950],[4,4950,5600],[5,5600,6260],[6,6260,7230],[7,7230,8550],[8,8550,10700],[9,10700,12140],[10,12140,12990],[11,12990,14450],[12,14450,15210],[13,15210,15820],[14,15820,18315]]}}