{"name":"2:219","price":"219਼ (ਹੇ ਨਬੀ!) ਲੋਕੀ ਤੁਹਾਥੋਂ ਸ਼ਰਾਬ ਅਤੇ ਜੂਅੇ ਬਾਰੇ ਪੁੱਛਦੇ ਹਨ, ਆਖ ਦਿਓ ਕਿ ਇਹਨਾਂ ਦੋਵਾਂ ਵਿਚ ਬਹੁਤ ਵੱਡਾ ਗੁਨਾਹ ਹੇ ਭਾਵੇ ਲੋਕਾਂ ਲਈ ਕੁੱਝ ਲਾਭ ਵੀ ਹਨ ਪਰੰਤੂ ਦੋਹਾਂ ਦਾ ਗੁਨਾਹ ਇਹਨਾਂ ਦੇ ਲਾਭ ਨਾਲੋਂ ਕੀਤੇ ਵੱਧਕੇ ਹੇ। ਉਹ ਇਹ ਵੀ ਪੁੱਛਦੇ ਹਨ ਕਿ (ਰੱਬ ਦੀ ਰਾਹ ਵਿਚ) ਕੀ ਖ਼ਰਚ ਕਰੀਏ ? ਆਖ ਦਿਓ ਕਿ ਜੋ ਵੀ ਤੁਹਾਡੀ ਲੋੜ ਤੋਂ ਵੱਧ ਹੇ (ਖ਼ਰਚ ਕਰੋ), ਤੁਹਾਡੇ (ਸਮਝਾਉਣ ਲਈ) ਅੱਲਾਹ ਆਪਣੇ ਹੁਕਮਾਂ ਨੇ ਇਸੇ ਤਰ੍ਹਾਂ ਸਪਸ਼ਟ ਕਰਦਾ ਹੇ ਤਾਂ ਜੋ ਤੁਸੀਂ ਸੋਚ ਵਿਚਾਰ ਕਰੋ।","arabic":"۞ يَسۡـَٔلُونَكَ عَنِ ٱلۡخَمۡرِ وَٱلۡمَيۡسِرِۖ قُلۡ فِيهِمَآ إِثۡمٞ كَبِيرٞ وَمَنَٰفِعُ لِلنَّاسِ وَإِثۡمُهُمَآ أَكۡبَرُ مِن نَّفۡعِهِمَاۗ وَيَسۡـَٔلُونَكَ مَاذَا يُنفِقُونَۖ قُلِ ٱلۡعَفۡوَۗ كَذَٰلِكَ يُبَيِّنُ ٱللَّهُ لَكُمُ ٱلۡأٓيَٰتِ لَعَلَّكُمۡ تَتَفَكَّرُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":226,"juzNumber":2,"footnotes":"1 ਇਸ ਆਇਤ ਵਿਚ ਜੂਆ ਤੇ ਸ਼ਰਾਬ ਦੇ ਨੁਕਸਾਨਾਂ ਦੀ ਵਿਆਖਿਆ ਕੀਤੀ ਗਈ ਹੇ। ਇਹ ਇਸ ਸੰਬੰਧ ਵਿਚ ਮੁੱਢਲਾ ਹੁਕਮ ਸੀ ਪਰ ਬਾਅਦ ਵਿਚ ਮਾਇਦਾ ਸੂਰਤ ਦੀ ਨੱਵੇਵੀਂ (90) ਆਇਤ ਵਿਚ ਸਪਸ਼ਟ ਸ਼ਬਦਾਂ ਵਿਚ ਇਹਨਾਂ ਦੀ ਮਨਾਹੀ ਕਰ ਦਿੱਤੀ। ਹੁਣ ਸ਼ਰਾਬ ਤੇ ਜੂਆ ਦੋਵੇਂ ਹਰਾਮ ਹਨ ਹਦੀਸ ਵਿਚ ਇਨ੍ਹਾਂ ਦੇ ਹਰਾਮ ਹੋਣ ਦੀ ਵਿਸਥਾਰ ਨਾਲ ਵਿਆਖਿਆ ਕੀਤੀ ਗਈ ਰੁ ਅੱਲਾਹ ਦੇ ਰਸੂਲ (ਸ:) ਨੇ ਫ਼ਰਮਾਇਆ ਜਿਸ ਨੇ ਭੁਲ ਕੇ ਵੀ (ਲਾਤ ਤੇ ਉਜ਼ਾ ਦੇਵੀਆਂ ਦੀ ਸੋਂਹ ਖਾਦੀ ਉਸ ਨੂੰ ਚਾਹੀਦਾ ਹੇ ਕਿ ਲਾ ਇਲਾਹ ਇਲੱਲਾਹ ਕਹੇ (ਤਾਂ ਜੋ ਨਵੇਂ ਸਿਰਿਓ ਈਮਾਨ ਵਿਚ ਆ ਜਾਵੇ) ਅਤੇ ਜਿਸ ਨੇ ਆਪਣੇ ਸਾਥੀ ਨੂੰ ਕਿਹਾ ਕਿ ਆਓ! ਆਪਾਂ ਜੂਆ ਖੇਡੀਏ ਤਾਂ ਉਸ ਨੂੰ ਕੱਫ਼ਾਰੇ ਵਜੋਂ ਭਾਵ ਗੁਨਾਹ ਕਰਨ ਦੇ ਬਦਲੇ ਵਿਚ ਖ਼ੈਰਾਤ ਕਰਨੀ ਚਾਹੀਦੀ ਹੇ। (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 4860)\n* ਅੱਲਾਹ ਦੇ ਰਸੂਲ (ਸ:) ਨੇ ਫ਼ਰਮਾਇਆ ਜਿਸ ਨੇ ਦੁਨੀਆਂ ਵਿਚ ਸ਼ਰਾਬ ਪੀ ਲਈ ਅਤੇ (ਮਰਦੇ ਹੋਏ ਵੀ) ਤੌਬਾ ਨਹੀਂ ਕੀਤੀ ਤਾਂ ਉਹ ਜੰਨਤ ਦੀ ਸ਼ਰਾਬ ਤੋਂ ਵਾਂਝਾ ਰਹੇਗਾ। (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 5575)\n* ਹਦੀਸ ਅਨੁਸਾਰ ਕਿਆਮਤ ਦੀਆਂ ਨਿਸ਼ਾਨੀਆਂ ਵਿੱਚੋਂ ਇਕ ਇਹ ਵੀ ਹੇ ਕਿ ਜਹਾਲਤ ਫੈਲ ਜਾਵੇਗੀ ਅਤੇ ਧਾਰਮਿਕ ਗਿਆਨ ਘੱਟ ਜਾਵੇਗਾ ਅਤੇ ਜ਼ਨਾਖ਼ੋਰੀ ਆਮ ਹੋ ਜਾਵੇਗੀ ਅਤੇ ਸ਼ਰਾਬ ਵੀ ਸ਼ਰੇਆਮ ਪੀਤੀ ਜਾਵੇਗੀ ਪੁਰਸ਼ਾਂ ਦੀ ਘਾਟ ਹੋ ਜਾਵੇਗੀ ਅਤੇ ਔੌਰਤਾਂ ਦੀ ਗਿਣਤੀ ਵੱਧ ਜਾਵੇਗੀ ਐਥੋਂ ਤਕ ਕਿ ਪੰਜਾਹ ਔੌਰਤਾਂ ਦੀ ਰਖਵਾਲੀ ਇਕ ਪੁਰਸ਼ ਕਰੇਗਾ। (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 5577)","lang":"pa","version":{"key":"punjabi_arif","direction":"ltr","language_iso_code":"pa","version":"1.0.0","last_update":1666783255,"title":"Punjabi translation","description":"Translation of the Quran meanings into Punjabi by Arif Halim, published by Darussalam"},"meta":{"transliteration":"yasalūnaka ʿani al-khamri wal-maysiri qul fīhimā ith'mun kabīrun wamanāfiʿu lilnnāsi wa-ith'muhumā akbaru min nafʿihimā wayasalūnaka mādhā yunfiqūna quli al-ʿafwa kadhālika yubayyinu al-lahu lakumu al-āyāti laʿallakum tatafakkarūna ","translations":["They ask you","about","[the] intoxicants","and [the] games of chance","Say","In both of them","(is) a sin","great","and (some) benefits","for [the] people","But sin of both of them","(is) greater","than","(the) benefit of (the) two","And they ask you","what","they (should) spend","Say","The surplus","Thus","makes clear","Allah","to you","[the] Verses","so that you may","ponder","(219)"],"transliterationArr":["yasalūnaka","ʿani","al-khamri","wal-maysiri","qul","fīhimā","ith'mun","kabīrun","wamanāfiʿu","lilnnāsi","wa-ith'muhumā","akbaru","min","nafʿihimā","wayasalūnaka","mādhā","yunfiqūna","quli","al-ʿafwa","kadhālika","yubayyinu","al-lahu","lakumu","al-āyāti","laʿallakum","tatafakkarūna",null],"verseTiming":[[1,0,1220],[2,1220,1540],[3,1540,2260],[4,2260,3310],[5,3310,3990],[6,3990,6260],[7,6260,7450],[8,7450,8890],[9,8890,9940],[10,9940,11290],[11,11290,13780],[12,13780,14560],[13,14560,14790],[14,14790,16640],[15,16640,18550],[16,18550,19240],[17,19240,20970],[18,20970,21370],[19,21370,21980],[20,21980,23390],[21,23390,24340],[22,24340,25040],[23,25040,25570],[24,25570,26690],[25,26690,27760],[26,27760,30755]]}}