{"name":"2:278","price":"278਼ ਹੇ ਲੋਕੋ! ਜਿਹੜੇ ਈਮਾਨ ਲਿਆਏ ਹੋ ਅੱਲਾਹ ਤੋਂ ਡਰੋ। ਜਿਹੜਾ ਵਿਆਜ ਲੈਣਾ (ਲੋਕਾਂ ਸਿਰ) ਬਾਕੀ ਰਹਿੰਦਾ ਹੇ ਉਸ ਨੂੰ ਛੱਡ ਦਿਓ,1 ਜੇ ਤੁਸੀਂ ਸੱਚੇ ਈਮਾਨ ਵਾਲੇ ਹੋ।","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱتَّقُواْ ٱللَّهَ وَذَرُواْ مَا بَقِيَ مِنَ ٱلرِّبَوٰٓاْ إِن كُنتُم مُّؤۡمِنِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":285,"juzNumber":3,"footnotes":"1 ਹਦੀਸਾਂ ਵਿਚ ਸੂਦ ਦੀ ਹਰਾਮ ਕਮਾਈ ਤੋਂ ਰੋਕਿਆ ਗਿਆ ਹੇ ਜਿਵੇਂ ਨਬੀ (ਸ:) ਨੇ ਕੁੱਤੇ ਤੇ ਖ਼ੂਨ ਕੱਢਣ ਦੀ ਕੀਮਤ (ਲੈਣ-ਦੇਣ) ਤੋਂ ਮਨ੍ਹਾਂ ਕੀਤਾ ਹੇ, ਇੰਜ ਹੀ ਖੁਣਨ ਤੇ ਖੁਣਨ ਵਾਲੀਆਂ, ਸੂਦ ਖਾਣ ਅਤੇ ਖਲਾਉਣ ਵਾਲੇ ਅਤੇ ਤਸਵੀਰ ਬਣਾਉਣ ਵਾਲੇ ਉੱਤੇ ਲਾਅਨਤ ਭੇਜੀ ਹੇ, ਇੰਜ ਹੀ ਬਦਕਾਰ ਔੌਰਤ ਦੀ ਕਮਾਈ ਤੋਂ ਵੀ ਰੋਕਿਆ ਹੇ। (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 2086, 5962) * ਅਬੂ-ਸਈਦ ਦਾ ਆਖਣਾ ਹੇ ਕਿ ਇਕ ਵਾਰ ਬਿਲਾਲ (ਰ:ਅ:) ਬਰਨੀ ਇਕ ਵਧੀਆ ਖਜੂਰ ਨਬੀ (ਸ:) ਦੀ ਸੇਵਾ ਵਿਖੇ ਲਿਆਏ ਆਪ (ਸ:) ਨੇ ਪੁੱਛਿਆ ਇਹ ਕਿਥੋਂ ਲਿਆਏ ਹੋ? ਬਿਲਾਲ ਨੇ ਕਿਹਾ ਕਿ ਮੇਰੇ ਕੋਲ ਇਕ ਘਟਿਆ ਕਿਸਮ ਦੀ ਖਜੂਰ ਸੀ ਤਾਂ ਮੈਂ ਇਸ ਘਟਿਆ ਕਿਸਮ ਦੀ ਖਜੂਰ ਦੇ ਦੋ ਤੋਲ ਦੇ ਕੇ ਇਕ ਤੋਲ ਵਧੀਆ ਖਜੂਰਾਂ ਦਾ ਲੈ ਲਿਆ ਤਾਂ ਜੋ ਤੁਹਾਡੀ ਸੇਵਾਂ ਵਿਚ ਪੇਸ਼ ਕਰ ਸਕਾਂ। ਤਾਂ ਆਪ (ਸ:) ਨੇ ਫ਼ਰਮਾਇਆ, ਅਫ਼ਸੋਸ ਹੇ ਅਫ਼ਸੋਸ! ਇਹ ਤਾਂ ਉੱਕਾ ਹੀ ਸੂਦ ਹੇ, ਇੰਜ ਨਾ ਕਰੋ, ਜੇ ਤੁਸੀਂ ਖਜੂਰ ਖਰੀਦਣੀ ਹੋਵੇ ਤਾਂ ਪਹਿਲਾਂ ਆਪਣੀ ਖਜੂਰ ਵੇਚੋ ਫਿਰ ਵਧੀਆ ਖਜੂਰਾਂ ਖਰੀਦੋ। (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 2312)","lang":"pa","version":{"key":"punjabi_arif","direction":"ltr","language_iso_code":"pa","version":"1.0.0","last_update":1666783255,"title":"Punjabi translation","description":"Translation of the Quran meanings into Punjabi by Arif Halim, published by Darussalam"},"meta":{"transliteration":"yāayyuhā alladhīna āmanū ittaqū al-laha wadharū mā baqiya mina al-riba in kuntum mu'minīna ","translations":["O you","who","believe[d]","Fear","Allah","and give up","what","remained","of","[the] usury","if","you are","believers","(278)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","ittaqū","al-laha","wadharū","mā","baqiya","mina","al-riba","in","kuntum","mu'minīna",null],"verseTiming":[[1,0,2940],[2,2940,3850],[3,3850,4520],[4,4520,5280],[5,5280,5860],[6,5860,6540],[7,6540,6920],[8,6920,7470],[9,7470,7800],[10,7800,9830],[11,9830,10750],[12,10750,12120],[13,12120,15165]]}}