{"name":"2:3","price":"3਼ ਉਹ, ਜਿਹੜੇ ਗ਼ੈਬੁ 2 ਉੱਤੇ ਈਮਾਨ ਰੱਖਦੇ ਹਨ ਅਤੇ ਨਮਾਜ਼ 3 ਕਾਇਮ ਕਰਦੇ ਹਨ ਅਤੇ ਜੋ ਵੀ ਅਸੀਂ ਉਹਨਾਂ ` (ਮਾਲ) ਦਿੱਤਾ ਹੈ ਉਸ ਵਿੱਚੋਂ (ਅੱਲਾਹ ਦੀ ਰਾਹ ਵਿਚ) ਖ਼ਰਚ ਕਰਦੇ ਹਨ।1","arabic":"ٱلَّذِينَ يُؤۡمِنُونَ بِٱلۡغَيۡبِ وَيُقِيمُونَ ٱلصَّلَوٰةَ وَمِمَّا رَزَقۡنَٰهُمۡ يُنفِقُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":10,"juzNumber":1,"footnotes":"2 ‘ਗ਼ੈਬ’ ਦਾ ਅਰਥ ਹੈ ਅਣਦੇਖਾ। ਇਸ ਸ਼ਬਦ ਵਿਚ ਉਹ ਸਾਰੀਆਂ ਚੀਜ਼ਾਂ ਦਾਖ਼ਿਲ ਹਨ ਜਿਨਾਂ ਦਾ ਅਹਿਸਾਸ ਇਸ ਦੁਨੀਆਂ ਵਿਚ ਨਾ ਅਕਲ-ਸਮਝ ਤੋਂ ਹੋ ਸਕਦਾ ਰੁ ਅਤੇ ਨਾ ਹੀ ਮਹਸੂਸ ਕੀਤਾ ਜਾ ਸਕਦਾ ਹੈ, ਜਿਵੇਂ ਅੱਲਾਹ ਤਆਲਾ ਦਾ ਵਜੂਦ, ਫ਼ਰਿਸ਼ਤੇ, ਮਰਨ ਤੋਂ ਬਾਅਦ ਦਾ ਜੀਵਨ ਆਦਿ ‘ਈਮਾਨ ਬਿਲਗ਼ੈਬ’ ਤੋਂ ਭਾਵ ਅੱਲਾਹ ਅਤੇ ਉਸ ਦੇ ਰਸੂਲ ਮੁਹੰਮਦ (ਸ:) ਦੀਆਂ ਦੱਸੀਆਂ ਹੋਈਆਂ ਉਹਨਾਂ ਗੱਲਾਂ ਉੱਤੇ ਵਿਸ਼ਵਾਸ ਕਰਨਾ ਹੈ ਜਿਹੜੀਆਂ ਅਕਲ ਤੋਂ ਪਰੇ ਹਨ ਜਿਵੇਂ ਅੱਲਾਹ, ਫ਼ਰਿਸ਼ਤੀਆਂ, ਅਕਾਸ਼ੀ ਕਿਤਾਬਾਂ ਅਤੇ ਰਸੂਲਾਂ ਉੱਤੇ ਈਮਾਨ ਰੱਖਣਾ। ਇਸੇ ਤਰ੍ਹਾਂ ਅੱਲਾਹ ਅਤੇ ਰਸੂਲ ਵੱਲੋਂ ਬੀਤੇ ਸਮੇਂ ਵਿਚ ਵਾਪਰੀਆਂ ਹੋਈਆਂ ਘਟਨਾਵਾਂ ਜਾਂ ਆਉਣ ਵਾਲੇ ਸਮੇਂ ਲਈ ਦਿ=ਤੀਆਂ ਹੋਇਆਂ ਸੂਚਨਾਵਾਂ ਉੱਤੇ ਈਮਾਨ ਰਖਣਾ ਵੀ ‘ਈਮਾਨ ਬਿਲਗ਼ੈਬ’ ਦਾ ਇਕ ਅਹਿਮ ਭਾਗ ਹੈ। 3 “ਨਮਾਜ਼ ਕਾਇਮ ਕਰਨ” ਤੋਂ ਭਾਵ ਹੈ ਕਿ ਹਰੇਕ ਮੁਸਲਮਾਨ (ਮਰਦ ਤੇ ਔੌਰਤ) ਲਈ ਦਿਨ ਭਰ ਦੀਆਂ ਪੰਜ ਨਮਾਜ਼ਾਂ ਉਹਨਾਂ ਦੇ ਨਿਯਤ ਸਮੇਂ ਤੇ ਅਦਾ ਕਰਨੀਆਂ ਲਾਜ਼ਮੀ ਹਨ। ਨਮਾਜ਼ ` ਮਸੀਤ ਵਿਚ ਜਮਾਅਤ ਨਾਲ ਅਦਾ ਕਰਨਾ ਚਾਹੀਦਾ ਹੈ ਪਰ ਔੌਰਤਾਂ ਲਈ ਘਰ ਨਮਾਜ਼ ਪੜ੍ਹਣਾ ਵਧੇਰੇ ਚੰਗਾ ਹੈ। ਨਬੀ ਕਰੀਮ (ਸ:) ਨੇ ਇਹ ਵੀ ਫ਼ਰਮਾਇਆ ਹੈ ਕਿ ਨਮਾਜ਼ ਐਵੇਂ ਪੜ੍ਹੋ ਜਿੱਦਾਂ ਤੁਸੀਂ ਮੈਨੂੰ ਨਮਾਜ਼ ਪੜ੍ਹਦੇ ਹੋਏ ਵੇਖਿਆ ਹੈ। (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 631) 1 ਅੱਲਾਹ ਦੀ ਰਾਹ ਵਿਚ ਖ਼ਰਚ ਕਰਨ ਤੋਂ ਭਾਵ ਗ਼ਰੀਬ ਤੇ ਲੋੜਵੰਦ ਲੋਕਾਂ ਦੀ ਮਾਲੀ ਸਹਾਇਤਾ ਕਰਨਾ ਹੈ। ਇਸ ਦੇ ਨਾਲ ਹੀ ਅੱਲਾਹ ਦੇ ਦੀਨ ਇਸਲਾਮ ` ਚੜ੍ਹਦੀ ਕਲਾ ਵਿਚ ਰੱਖਣ ਲਈ ਮਾਲ ਖ਼ਰਚ ਕਰਨਾ ਵੀ ਅੱਲਾਹ ਦੀ ਰਾਹ ਵਿਚ ਖ਼ਰਚ ਕਰਨਾ ਹੈ।1","lang":"pa","version":{"key":"punjabi_arif","direction":"ltr","language_iso_code":"pa","version":"1.0.0","last_update":1666783255,"title":"Punjabi translation","description":"Translation of the Quran meanings into Punjabi by Arif Halim, published by Darussalam"},"meta":{"transliteration":"alladhīna yu'minūna bil-ghaybi wayuqīmūna al-ṣalata wamimmā razaqnāhum yunfiqūna ","translations":["Those who","believe","in the unseen","and establish","the prayer","and out of what","We have provided them","they spend","(3)"],"transliterationArr":["alladhīna","yu'minūna","bil-ghaybi","wayuqīmūna","al-ṣalata","wamimmā","razaqnāhum","yunfiqūna",null],"verseTiming":[[1,0,1040],[2,1040,2190],[3,2190,3090],[4,3090,4260],[5,4260,5220],[6,5220,6580],[7,6580,7990],[8,7990,11365]]}}