{"name":"3:46","price":"46਼ ਉਹ (ਬੱਚਾ) ਆਪਣੇ ਪੰਘੂੜੇ ਵਿਚ ਵੀ ਅਤੇ ਵੱਡੀ ਉਮਰ ਵਿਚ ਵੀ ਲੋਕਾਂ ਨਾਲ ਗੱਲਾਂ ਕਰੇਗਾ 1 ਅਤੇ ਉਹ ਨੇਕ ਲੋਕਾਂ ਵਿੱਚੋਂ ਹੋਵੇਗਾ।","arabic":"وَيُكَلِّمُ ٱلنَّاسَ فِي ٱلۡمَهۡدِ وَكَهۡلٗا وَمِنَ ٱلصَّٰلِحِينَ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":339,"juzNumber":3,"footnotes":"1 ਨਬੀ ਕਰੀਮ ਸ: ਦਾ ਫ਼ਰਮਾਨ ਹੇ ਕਿ ਬਨੀ ਇਸਰਾਈਲ ਵਿੱਚੋਂ ਮਾਂ ਦੀ ਕੁੱਖ ਵਿਚ ਕੇਵਲ ਤਿੰਨ ਬੱਚਿਆਂ ਨੇ ਗੱਲਾਂ ਕੀਤੀਆਂ (1) ਹਜ਼ਰਤ ਈਸਾ, ਬਨੀ ਇਸਰਾਈਲ ਦਾ ਜਰੀਜ ਨਾਂ ਦਾ ਇਕ ਵਿਅਕਤੀ ਜਦੋਂ ਉਹ ਨਮਾਜ਼ ਪੜ੍ਹ ਰਿਹਾ ਸੀ ਤਾਂ ਉਸ ਦੀ ਮਾਂ ਨੇ ਉਸ ਨੂੰ ਬੁਲਾਇਆ ਤਾਂ ਉਸ ਨੇ ਮਨ ਵਿਚ ਸੋਚਿਆ ਕਿ ਮੈਂ ਆਪਣੀ ਮਾਂ ਦਾ ਜਵਾਬ ਦਵਾਂ ਜਾਂ ਨਮਾਜ਼ ਪੂਰੀ ਕਰਾਂ ਉਸ ਨੇ ਨਮਾਜ਼ ਜਾਰੀ ਰੱਖੀ ਅਤੇ ਮਾਂ ਨੂੰ ਉੱਤਰ ਨਹੀਂ ਦਿੱਤਾ ਤਾਂ ਉਸ ਦੀ ਮਾਂ ਨੇ ਉਸ ਨੂੰ ਬੱਦ-ਦੁਆ ਦਿੱਤੀ ਕਿ ਹੇ ਅੱਲਾਹ! ਜਦੋਂ ਤੀਕ ਉਹ ਕਿਸੇ ਬਦਕਾਰ ਔੌਰਤ ਦਾ ਮੂੰਹ ਨਾ ਵੇਖ ਲਵੇ ਉਸ ਨੂੰ ਮੌਤ ਨਾ ਦਈਂ। ਇਕ ਦਿਨ ਜਰੀਜ ਆਪਣੇ ਇਬਾਦਤਖ਼ਾਨੇ ਵਿਚ ਸੀ ਕਿ ਬਦਕਾਰ ਔੌਰਤ ਨੇ ਉਸ ਨੂੰ ਬਦਕਾਰੀ ਲਈ ਬੁਲਾਇਆ ਪਰ ਜਰੀਜ ਨੇ ਇਨਕਾਰ ਕਰ ਦਿੱਤਾ ਉਹ ਔੌਰਤ ਇਕ ਚਰਵਾਹੇ ਕੋਲ ਗਈ ਅਤੇ ਉਸ ਤੋਂ ਭੈੜਾ ਕੰਮ ਕਰਵਾਇਆ ਜਿਸ ਤੋਂ ਇਕ ਬੱਚਾ ਪੈਦਾ ਹੋਇਆ ਲੋਕਾਂ ਦੇ ਪੁੱਛਣ ’ਤੇ ਔੌਰਤ ਨੇ ਕਿਹਾ ਕਿ ਇਹ ਜਰੀਜ ਦਾ ਪੁੱਤਰ ਹੇ ਲੋਕ ਇਹ ਸੁਣ ਕੇ ਜਰੀਜ ਨੂੰ ਗਾਲਾਂ ਦੇਣ ਲੱਗ ਪਏ ਉਸ ਦਾ ਇਬਾਦਖ਼ਾਨਾ ਤੋੜ ਦਿੱਤਾ ਇਸ ਮੁਸੀਬਤ ਦੇ ਸਮੇਂ ਜਰੀਜ ਨੇ ਵਜ਼ੂ ਕੀਤਾ ਅਤੇ ਨਮਾਜ਼ ਅਦਾ ਕੀਤੀ ਅਤੇ ਬੱਚੇ ਨੂੰ ਆਕੇ ਪੁੱਛਿਆ ਕਿ × ਤੇਰਾ ਬਾਪ ਕੌਣ ਹੇ ਬੱਚਾ ਬੋਲਿਆ ਕਿ ਫਲਾਂ ਚਰਵਾਹਾ ਹੇ ਤਾਂ ਲੋਕ ਸ਼ਰਮਿੰਦਾ ਹੋਏ ਅਤੇ ਕਿਹਾ ਕਿ ਅਸੀਂ ਤੇਰੀ ਇਬਾਦਤਗਾਹ ਨੂੰ ਸੋਨੇ ਦੀ ਬਣਾਵਾਂਗੇ ਤਾਂ ਜਰੀਜ ਨੇ ਕਿਹਾ ਕਿ ਨਹੀਂ ਬਸ ਮਿੱਟੀ ਦੀ ਹੀ ਹੋਵੇ। ਤੀਜਾ ਉਹ ਬੱਚਾ ਜਿਸ ਨੂੰ ਇਕ ਜ਼ਨਾਨੀ ਅਪਣਾ ਦੁੱਧ ਪਿਲਾ ਰਹੀ ਸੀ ਕਿ ਇਕ ਸੋਹਣਾ ਮਨੁੱਖ ਸਵਾਰ ਲੰਘਿਆ, ਜ਼ਨਾਨੀ ਨੇ ਉਸ ਨੂੰ ਵੇਖ ਕੇ ਦੁਆ ਕੀਤੀ ਕਿ ਹੇ ਮੇਰੇ ਅੱਲਾਹ! ਮੇਰੇ ਪੁੱਤਰ ਨੂੰ ਵੀ ਅਜਿਹਾ ਬਣਾ ਦੇ। ਬੱਚੇ ਨੇ ਦੁੱਧ ਪੀਣਾ ਛੱਡ ਕੇ ਸਵਾਰ ਵੱਲ ਵੇਖਿਆ ਅਤੇ ਕਿਹਾ ਕਿ ਹੇ ਅੱਲਾਹ! ਮੈਨੂੰ ਅਜਿਹਾ ਨਾ ਬਣਾਉਣਾ ਅਤੇ ਫੇਰ ਦੁੱਧ ਪੀਣ ਲੱਗ ਪਿਆ। ਇਹ ਕਿੱਸਾ ਦੱਸਣ ਵਾਲੇ ਹਜ਼ਰਤ ਅਬੂ-ਹੁਰੈਰਾ ਬਿਆਨ ਕਰਦੇ ਹਨ ਕਿ ਆਪ ਸ: ਨੇ ਉਸ ਬੱਚੇ ਵਾਂਗ ਆਪਣੀਆਂ ਉਂਗਲੀਆਂ ਚੂਸ ਕੇ ਵਿਖਾਈਆਂ ਫੇਰ ਉਸ ਜ਼ਨਾਨੀ ਕੋਲ ਤੋਂ ਇਕ ਗੋਲੀ (ਗ਼ੁਲਾਮ ਔੌਰਤ) ਦਾ ਗੁਜ਼ਰ ਹੋਇਆ ਜਿਸ ਨੂੰ ਲੋਕੀ ਮਾਰ ਕੁਟ ਰਹੇ ਸੀ ਤਾਂ ਮਾਂ ਨੇ ਦੁਆ ਕੀਤੀ ਕਿ ਹੇ ਅੱਲਾਹ! ਮੇਰੇ ਪੁੱਤਰ ਨੂੰ ਅਜਿਹਾ ਨਾ ਬਣਾਉਣਾ। ਬੱਚੇ ਨੇ ਫੇਰ ਉਸ ਦੀ ਛਾਤੀ ਤੋਂ ਮੂੰਹ ਪਰਾਂ ਕਰਦੇ ਹੋਏ ਕਿਹਾ ਕਿ ਹੇ ਅੱਲਾਹ! ਮੈਨੂੰ ਅਜਿਹਾ ਹੀ ਬਣਾਉਣਾ ਤਾਂ ਮਾਂ ਨੇ ਰੁਰਾਨੀ ਨਾਲ ਪੁੱਛਿਆ ਕਿ ਅਜਿਹਾ ਕਿਓ ?ਕਿ ਤੂੰ ਉਸ ਸਵਾਰ ਦੀ ਥਾਂ ਇਸ ਜ਼ਲੀਲ ਔੌਰਤ ਵਾਂਗ ਬਣਨਾ ਪਸੰਦ ਕਰਦਾ ਹੇ ਤਾਂ ਬੱਚੇ ਨੇ ਜਵਾਬ ਵਿਚ ਕਿਹਾ ਕਿ ਉਹ ਸਵਾਰ ਤਾਂ ਜ਼ਾਲਮਾਂ ਵਿੱਚੋਂ ਇਕ ਵੱਡਾ ਜ਼ਾਲਮ ਸੀ ਅਤੇ ਇਹ ਗੋਲੀ ਬੇਚਾਰੀ ਨਿਰਦੋਸ਼ ਹੇ ਲੋਕੀ ਇਸ ’ਤੇ ਅਲਜ਼ਾਮ ਲਾ ਰਹੇ ਹਨ ਕਿ ਤੈਂ ਚੋਰੀ ਕੀਤੀ ਹੇ ਅਤੇ ਜ਼ਨਾ ਕੀਤਾ ਹੇ ਜਦ ਕਿ ਉਸ ਨੇ ਕੁੱਝ ਵੀ ਨਹੀਂ ਸੀ ਕੀਤਾ। (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 3436)","lang":"pa","version":{"key":"punjabi_arif","direction":"ltr","language_iso_code":"pa","version":"1.0.0","last_update":1666783255,"title":"Punjabi translation","description":"Translation of the Quran meanings into Punjabi by Arif Halim, published by Darussalam"},"meta":{"transliteration":"wayukallimu al-nāsa fī al-mahdi wakahlan wamina al-ṣāliḥīna ","translations":["And he will speak","(to) the people","in","the cradle","and (in) maturity","and (he will be) of","the righteous","(46)"],"transliterationArr":["wayukallimu","al-nāsa","fī","al-mahdi","wakahlan","wamina","al-ṣāliḥīna",null],"verseTiming":[[1,0,1220],[2,1220,2560],[3,2560,2800],[4,2800,3630],[5,3630,5190],[6,5190,5820],[7,5820,8805]]}}