{"name":"4:145","price":"145਼ ਮੁਨਾਫ਼ਿਕ ਤਾਂ ਜ਼ਰੂਰ ਹੀ ਨਰਕ ਦੇ ਸਭ ਤੋਂ ਹੇਠਲੇ ਦਰਜੇ ਵਿਚ ਜਾਣਗੇ1 ਅਤੇ ਤੁਸੀਂ ਉੱਥੇ ਉਹਨਾਂ ਦਾ ਕੋਈ ਵੀ ਸਹਾਈ ਨਾ ਵੇਖੋਗੇ।","arabic":"إِنَّ ٱلۡمُنَٰفِقِينَ فِي ٱلدَّرۡكِ ٱلۡأَسۡفَلِ مِنَ ٱلنَّارِ وَلَن تَجِدَ لَهُمۡ نَصِيرًا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":638,"juzNumber":5,"footnotes":"1 ਇਸ ਵਿਚ ਦੱਸਿਆ ਗਿਆ ਹੇ ਕਿ ਇਸ ਵਿਚ ਮੁਨਾਫ਼ਿਕਾਂ ਵਾਲੀਆਂ ਸਿਫ਼ਤਾਂ ਤੋਂ ਬਚ ਕੇ ਰਹੋ। ਹਦੀਸ ਵਿਚ ਇਹ ਖ਼ੂਬੀਆਂ ਦੱਸੀਆਂ ਗਈਆਂ ਹਨ। ਨਬੀ ਕਰੀਮ ਸ: ਦਾ ਫ਼ਰਮਾਨ ਹੇ ਕਿ ਚਾਰ ਗੱਲਾਂ ਜਿਸ ਕਿਸੇ ਵਿਚ ਹੋਣਗੀਆਂ ਉਹ ਪ=ਕਾ ਮੁਨਾਫ਼ਿਕ ਰੁ ਜਿਸ ਕਿਸੇ ਵਿਚ ਉਹਨਾਂ ਚਾਰਾਂ ਵਿ=ਚੋਂ ਇਕ ਔੌਗੁਣ ਪਾਇਆ ਜਾਵੇਗਾ। ਉਸ ਵਿਚ ਇਕ ਔੌਗੁਣ ਨਿਫ਼ਾਕ ਦਾ ਵੀ ਰੁ। ਜਦੋਂ ਤਕ ਕਿ ਉਹ ਉਸ ਨੂੰ ਛੱਡ ਨਾ ਦੇਵੇ ਉਹ ਗੱਲਾਂ ਜਾਂ ਔੌਗੁਣ ਇਹ ਹਨ : (1) ਜਦੋਂ ਉਸ ਦੇ ਕੋਲ ਕੋਈ ਅਮਾਨਤ ਰੱਖੀ ਜਾਵੇ ਤਾਂ ਉਸ ਵਿਚ ਖ਼ਿਆਨਤ ਕਰੇ। (2) ਜਦੋਂ ਬੋਲੇ ਤਾਂ ਝੂਠ ਬੋਲੇ। (3) ਜਦ ਵਾਅਦਾ ਕਰੇ ਤਾਂ ਉਸ ਨੂੰ ਪੂਰਾ ਨਾ ਕਰੇ। (4) ਜਦੋਂ ਝਗੜਾ ਕਰੇ ਤਾਂ ਗਾਲਾਂ ਕੱਢੇ। (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 34)\n* ਅੱਲਾਹ ਦੇ ਰਸੂਲ ਸ: ਨੇ ਇਹ ਵੀ ਫ਼ਰਮਾਇਆ ਰੁ ਕਿ ਕਿਆਮਤ ਦਿਹਾੜੇ ਤੁਸੀਂ ਅੱਲਾਹ ਦੇ ਕੋਲ ਉਸ ਵਿਅਕਤੀ ਨੂੰ ਸਭ ਤੋਂ ਵੱਧ ਭੈੜੇ ਲੋਕਾਂ ਵਿਚ ਵੇਖੋਗੇ ਜਿਹੜੇ ਦੋ ਮੂੰਹੇ ਹਨ ਭਾਵ ਕੁੱਝ ਲੋਕਾਂ ਕੋਲ ਤਾਂ ਇਕ ਮੂੰਹ ਲੈਕੇ ਜਾਂਦੇ ਹਨ ਅਤੇ ਦੂਜਿਆਂ ਕੋਲ ਦੂਜਾ ਮੂੰਹ ਲੈਕੇ ਜਾਂਦੇ ਹਨ (ਭਾਵ ਵੱਖ ਵੱਖ ਗੱਲਾਂ ਕਰਦੇ ਹਨ)। (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 6058)","lang":"pa","version":{"key":"punjabi_arif","direction":"ltr","language_iso_code":"pa","version":"1.0.0","last_update":1666783255,"title":"Punjabi translation","description":"Translation of the Quran meanings into Punjabi by Arif Halim, published by Darussalam"},"meta":{"transliteration":"inna al-munāfiqīna fī al-darki al-asfali mina al-nāri walan tajida lahum naṣīran ","translations":["Indeed","the hypocrites","(will be) in","the depths","the lowest","of","the Fire","and never","you will find","for them","any helper","(145)"],"transliterationArr":["inna","al-munāfiqīna","fī","al-darki","al-asfali","mina","al-nāri","walan","tajida","lahum","naṣīran",null],"verseTiming":[[1,0,1410],[2,1410,3150],[3,3150,3410],[4,3410,4240],[5,4240,5320],[6,5320,5760],[7,5760,7060],[8,7060,8300],[9,8300,9030],[10,9030,9700],[11,9700,11235]]}}