{"name":"4:29","price":"29਼ ਹੇ ਈਮਾਨ ਵਾਲਿਓ! ਤੁਸੀਂ ਇਕ ਦੂਜੇ ਦਾ ਮਾਲ ਨਾ-ਜਾਇਜ਼ ਢੰਗ ਨਾਲ ਨਾ ਖਾਓ, ਸਗੋਂ ਆਪਸੀ ਰਜ਼ਾਮੰਦੀ ਨਾਲ ਲੈਣ-ਦੇਣ ਕਰੋ ਅਤੇ ਅਨ-ਹੱਕਾ ਆਪਣੇ ਆਪ ਨੂੰ ਕਤਲ (ਆਤਮਾ ਹੱਤਿਆ) ਨਾ ਕਰੋ,1 ਬੇਸ਼ੱਕ ਅੱਲਾਹ ਤੁਹਾਡੇ ’ਤੇ ਬਹੁਤ ਮਿਹਰਬਾਨ ਹੇ।","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَأۡكُلُوٓاْ أَمۡوَٰلَكُم بَيۡنَكُم بِٱلۡبَٰطِلِ إِلَّآ أَن تَكُونَ تِجَٰرَةً عَن تَرَاضٖ مِّنكُمۡۚ وَلَا تَقۡتُلُوٓاْ أَنفُسَكُمۡۚ إِنَّ ٱللَّهَ كَانَ بِكُمۡ رَحِيمٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":522,"juzNumber":5,"footnotes":"1 ਆਤਮ ਹੱਤਿਆ ਦੀ ਹਦੀਸ ਅਨੁਸਾਰ ਕਰੜੀ ਸਜ਼ਾ ਹੇ। ਜਿਸ ਵਿਅਕਤੀ ਨੇ ਇਸਲਾਮ ਤੋਂ ਛੁੱਟ ਕਿਸੇ ਹੋਰ ਧਰਮ ਦੀ ਜਾਣ ਬੁਝ ਕੇ ਝੂਠੀ ਕਸਮ ਖਾਧੀ ਤਾਂ ਉਹ ਅਜਿਹਾ ਹੇ ਜਿਵੇਂ ਉਹ ਕਹਿੰਦਾ ਹੇ ਜੇ ਉਸ ਨੇ ਕਿਹਾ ਕਿ ਜੇ ਉਹ ਗੱਲ ਇੰਜ ਨਾ ਹੋਵੋ ਤਾਂ ਮੈਂ ਯਹੂਦੀ ਹਾਂ ਤਾਂ ਉਹ ਹਕੀਕਤ ਵਿਚ ਯਹੂਦੀ ਹੀ ਹੇ ਜੇ ਉਹ ਆਪਣੀ ਗੱਲ ਵਿਚ ਝੂਠਾ ਹੇ ਅਤੇ ਜਿਸ ਵਿਅਕਤੀ ਨੇ ਆਪਣੇ ਆਪ ਨੂੰ ਤੇਜ਼ ਹਥਿਆਰ ਨਾਲ ਮਾਰ ਲਿਆ ਤਾਂ ਉਸੇ ਹਥਿਆਰ ਨਾਲ ਨਰਕ ਵਿਚ ਅਜ਼ਾਬ ਹੁੰਦਾ ਰਹੇਗਾ। ਨਬੀ ਕਰੀਮ ਸ: ਦਾ ਫ਼ਰਮਾਨ ਹੇ ਇਕ ਵਿਅਕਤੀ ਜ਼ਖ਼ਮੀ ਹੋ ਗਿਆ ਉਸ ਨੇ ਤੰਗ ਆ ਕੇ ਆਤਮ ਹੱਤਿਆ ਕਰ ਲਈ ਤਾਂ ਅੱਲਾਹ ਨੇ ਫ਼ਰਮਾਇਆ ਕਿ ਮੇਰੇ ਬੰਦੇ ਨੇ ਮਰਨ ਵਿਚ ਛੇਤੀ ਕੀਤੀ ਭਾਵ ਉਹ ਸਬਰ ਨਹੀਂ ਕਰ ਸਕਿਆ ਕਿ ਮੈਂ ਉਸ ਦੀ ਜਾਨ ਕੱਢਦਾ ਅਤੇ ਉਸ ਦੀ ਮੌਤ ਹੰਦੀ ਸਗੋਂ ਉਸ ਨੇ ਖ਼ੁਦਕੁਸ਼ੀ (ਆਤਮ ਹੱਤਿਆ) ਕਰ ਲਈ ਮੈਂ ਉਸ ਲਈ ਜੰਨਤ ਨੂੰ ਹਰਾਮ ਕਰ ਦਿੱਤਾ ਹੇ। (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 1363-1364)\n* ਆਪ ਸ: ਨੇ ਫ਼ਰਮਾਇਆ ਕਿ ਜੋ ਵਿਅਕਤੀ ਆਪਣਾ ਗਲਾ ਘੁੱਟ ਕੇ ਆਪਣੇ ਆਪ ਨੂੰ ਮਾਰਦਾ ਹੇ ਉਹ ਸਦਾ ਲਈ ਨਰਕ ਵਿਚ ਆਪਣਾ ਗਲਾ ਘੁੱਟਦਾ ਰਹੇਗਾ ਅਤੇ ਜਿਹੜਾ ਕੋਈ ਆਪਣੇ ਆਪ ਨੂੰ ਕਿਸੇ ਹਥਿਆਰ ਦੀਆਂ ਸੱਟਾਂ ਨਾਲ ਕਤਲ ਕਰੇਗਾ, ਉਹ ਨਰਕ ਵਿਚ ਆਪਣੇ ਆਪ ਨੂੰ ਸਦਾ ਸੱਟਾਂ ਮਾਰਦਾ ਰਹੇਗਾ। (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 1365)","lang":"pa","version":{"key":"punjabi_arif","direction":"ltr","language_iso_code":"pa","version":"1.0.0","last_update":1666783255,"title":"Punjabi translation","description":"Translation of the Quran meanings into Punjabi by Arif Halim, published by Darussalam"},"meta":{"transliteration":"yāayyuhā alladhīna āmanū lā takulū amwālakum baynakum bil-bāṭili illā an takūna tijāratan ʿan tarāḍin minkum walā taqtulū anfusakum inna al-laha kāna bikum raḥīman ","translations":["O you","who","believe[d]","(Do) not","eat","your wealth","between yourselves","unjustly","But","that","(there) be","business","on","mutual consent","among you","And (do) not","kill","yourselves","Indeed","Allah","is","to you","Most Merciful","(29)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","lā","takulū","amwālakum","baynakum","bil-bāṭili","illā","an","takūna","tijāratan","ʿan","tarāḍin","minkum","walā","taqtulū","anfusakum","inna","al-laha","kāna","bikum","raḥīman",null],"verseTiming":[[1,0,2720],[2,2720,3640],[3,3640,4540],[4,4540,4860],[5,4860,6840],[6,6840,8900],[7,8900,10210],[8,10210,11530],[9,11530,12360],[10,12360,14710],[11,14710,15460],[12,15460,16200],[13,16200,17360],[14,17360,18170],[15,18170,19010],[16,19010,21160],[17,21160,21670],[18,21670,23690],[19,23690,26250],[20,26250,27640],[21,27640,28430],[22,28430,29060],[23,29060,29630],[24,29630,31085]]}}