{"name":"4:40","price":"40਼ ਬੇਸ਼ੱਕ ਅੱਲਾਹ ਕਿਸੇ ’ਤੇ ਵੀ ਭੋਰਾ ਭਰ ਜ਼ੁਲਮ ਨਹੀਂ ਕਰਦਾ 2 ਅਤੇ ਜੇ ਕਿਸੇ ਨੇ ਕੋਈ ਇਕ ਨੇਕੀ ਕੀਤੀ ਹੋਵੇ ਤਾਂ ਉਸ ਨੂੰ ਦੂਣਾ ਕਰ ਦਿੰਦਾ ਹੇ ਅਤੇ ਆਪਣੇ ਵੱਲੋਂ ਵਿਸ਼ੇਸ਼ ਬਦਲਾ ਪ੍ਰਦਾਨ ਕਰਦਾ ਹੇ।","arabic":"إِنَّ ٱللَّهَ لَا يَظۡلِمُ مِثۡقَالَ ذَرَّةٖۖ وَإِن تَكُ حَسَنَةٗ يُضَٰعِفۡهَا وَيُؤۡتِ مِن لَّدُنۡهُ أَجۡرًا عَظِيمٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":533,"juzNumber":5,"footnotes":"2 ਭਾਵ ਹਰ ਵਿਅਕਤੀ ਨੂੰ ਉਸੇ ਕੰਮ ਦਾ ਬਦਲਾ ਮਿਲੇਗਾ ਜਿਹੜਾ ਉਸ ਨੇ ਕੀਤਾ ਹੋਵੇਗਾ ਜਿਵੇਂ ਇਕ ਹਦੀਸ ਤੋਂ ਸਪਸ਼ਟ ਹੁੰਦਾ ਹੇ। ਹਜ਼ਰਤ ਅਬੂ-ਸਈਦ ਰ:ਅ: ਦੱਸਦੇ ਹਨ ਕਿ ਨਬੀ ਕਰੀਮ ਸ: ਦੀ ਸੇਵਾ ਵਿਚ ਕੁੱਝ ਲੋਕ ਹਾਜ਼ਰ ਹੋਏ ਅਤੇ ਪੁੱਛਿਆ, ਹੇ ਅੱਲਾਹ ਦੇ ਰਸੂਲ! ਕੀ ਕਿਆਮਤ ਦਿਹਾੜੇ ਅਸੀਂ ਆਪਣੇ ਰੱਬ ਨੂੰ ਵੇਖਾਂਗੇ? ਨਬੀ ਸ: ਨੇ ਫ਼ਰਮਾਇਆ ਹਾਂ! ਬੇਸ਼ੱਕ ਵੇਖੋਗੇ। ਕੀ ਤੁਹਾਨੂੰ ਦੁਪਹਿਰ ਵੇਲੇ ਜਦੋਂ ਅਕਾਸ਼ ਦੀ ਰੋਸ਼ਨੀ ਸਾਫ਼ ਹੁੰਦੀ ਹੇ ਬੱਦਲ ਨਾ ਹੋਣ ਤਾਂ ਕੀ ਸੂਰਜ ਵੇਖਣ ਵਿਚ ਕੋਈ ਤਕਲੀਫ਼ ਹੁੰਦੀ ਹੇ? ਉਹਨਾਂ ਨੇ ਕਿਹਾ ਕਿ ਨਹੀਂ, ਫੇਰ ਨਬੀ ਕਰੀਮ ਸ: ਨੇ ਫ਼ਰਮਾਇਆ ਕਿ ਚੌਦਵੀਂ ਦੀ ਰਾਤ ਨੂੰ ਜਦੋਂ ਅਕਾਸ਼ ਦੀ ਰੌਸ਼ਨੀ ਸਾਫ਼ ਹੋਵੇ, ਬੱਦਲ ਨਾ ਹੋਣ ਤਾਂ ਕੀ ਚੰਨ ਵੇਖਣ ਵਿਚ ਕੋਈ ਤਕਲੀਫ਼ ਹੰਦੀ ਹੇ? ਤਾਂ ਉਹਨਾਂ ਨੇ ਕਿਹਾ ਨਹੀਂ, ਫੇਰ ਨਬੀ ਸ: ਨੇ ਫ਼ਰਮਾਇਆ ਇਸੇ ਤਰ੍ਹਾਂ ਤੁਹਾਨੂੰ ਕਿਆਮਤ ਦੇ ਦਿਨ ਆਪਣੇ ਅੱਲਾਹ ਨੂੰ ਵੇਖਣ ਵਿਚ ਵੀ ਕੋਈ ਅੜੀਕਾ ਨਹੀਂ ਲੱਗੇਗਾ ਜਿਵੇਂ ਸੂਰਜ ਜਾਂ ਚੰਨ ਦੇ ਵੇਖਣ ਵਿਚ ਨਹੀਂ ਹੁੰਦੀ। ਫ਼ੇਰ ਫ਼ਰਮਾਇਆ ਕਿ ਕਿਆਮਤ ਦੇ ਦਿਨ ਇਕ ਹੋਕੇ ਲਾਉਣ ਵਾਲਾ ਬੁਲਾਵੇਗਾ ਕਿ ਹੇ ਲੋਕੋ! ਜਿਹੜਾ ਜਿਸ ਦੀ ਪੂਜਾ ਕਰਦਾ ਸੀ ਉਸੇ ਦੇ ਨਾਲ ਚਲਾ ਜਾਵੇ। ਫੇਰ ਅੱਲਾਹ ਤੋਂ ਛੁੱਟ ਦੂਜੇ ਇਸ਼ਟਾਂ ਨੂੰ ਪੂਜਣ ਵਾਲਿਆਂ ਵਿੱਚੋਂ ਕੋਈ ਨਹੀਂ ਰਹੇਗਾ। ਉਹ ਸਾਰੇ ਆਪਣੇ ਇਸ਼ਟਾਂ ਨਾਲ ਨਰਕ ਵਿਚ ਚਲੇ ਜਾਣਗੇ। = = ਅੱਲਾਹ ਨੂੰ ਪੂਜਣ ਵਾਲੇ ਹੀ ਰਹਿ ਜਾਣਗੇ ਇਹਨਾਂ ਵਿਚ ਚੰਗੇ ਮਾੜੇ ਸਭ ਤਰ੍ਹਾਂ ਦੇ ਮੁਸਲਮਾਨ ਹੋਣਗੇ ਅਤੇ ਅਹਲੇ ਕਿਤਾਬ ਦੇ ਕੁੱਝ ਲੋਕ ਰਹਿ ਜਾਣਗੇ। ਅਹਲੇ ਕਿਤਾਬ ਵਿਚ ਪਹਿਲਾਂ ਯਹੂਦੀਆਂ ਨੂੰ ਬੁਲਾਇਆ ਜਾਵੇਗਾ ਉਹਨਾਂ ਤੋਂ ਪੁੱਛਿਆ ਜਾਵੇਗਾ ਕਿ ਤੁਸੀਂ ਕਿਸ ਚੀਜ਼ ਦੀ ਇਬਾਦਤ ਕਰਦੇ ਸੀ? ਉਹ ਜਵਾਬ ਦੇਣਗੇ ਕਿ ਅਸੀਂ ਹਜ਼ਰਤ ਉਜ਼ੈਰ ਜੋ ਕਿ ਅੱਲਾਹ ਦੇ ਪੁੱਤਰ ਸੀ ਉਹਨਾਂ ਦੀ ਪੂਜਾ ਕਰਦੇ ਸੀ, ਤਾਂ ਉਹਨਾਂ ਨੂੰ ਕਿਹਾ ਜਾਵੇਗਾ ਕਿ ਤੁਸੀਂ ਝੂਠ ਬੋਲਦੇ ਹੋ ਕਿਉਂ ਜੋ ਨਾ ਤਾਂ ਅੱਲਾਹ ਦੀ ਕੋਈ ਪਤਨੀ ਹੇ ਅਤੇ ਨਾ ਹੀ ਕੋਈ ਪੁੱਤਰ ਹੇ, ਫੇਰ ਉਹਨਾਂ ਨੂੰ ਪੁਛਿਆ ਜਾਵੇਗਾ ਕਿ ਹੁਣ ਤੁਸੀਂ ਕੀ ਚਾਹੁੰਦੇ ਹੋ? ਤਾਂ ਉਹ ਆਖਣਗੇ ਕਿ ਹੇ ਪਾਲਣਹਾਰ! ਸਾਡਾ ਪਿਆਸ ਨਾਲ ਬੁਰਾ ਹਾਲ ਹੇ ਸਾਨੂੰ ਕੁੱਝ ਪੀਣ ਲਈ ਦਿੱਤਾ ਜਾਵੇ ਤਾਂ ਉਹਨਾਂ ਨੂੰ ਇਸ਼ਾਰਾ ਕੀਤਾ ਜਾਵੇਗਾ ਕਿ ਉਸ ਘਾਟ ’ਤੇ ਜਾ ਕੇ ਪਿਆਸ ਬੁਝਾ ਲਵੋਂ ਜਦੋਂ ਕਿ ਉਹ ਅਸਲ ਵਿਚ ਅੱਗ ਵੱਲ ਧੱਕੇ ਜਾਣਗੇ ਅਤੇ ਉਹ ਅੱਗ ਇੰਜ ਦਿਖਾਈ ਦੇਵੇਗੀ ਜਿਸ ਤਰ੍ਹਾਂ ਮਾਰੂਥਲ ਜਿਸ ਨੂੰ ਦੁਪਹਿਰ ਵੇਲੇ ਦੂਰ ਤੋਂ ਵੇਖਿਆ ਜਾਵੇ ਤਾਂ ਪਾਣੀ ਵਾਂਗ ਲੱਗਦਾ ਹੇ ਅਤੇ ਜਿਸ ਦਾ ਕੁੱਝ ਭਾਗ ਹੀ ਕੁੱਝ ਨੂੰ ਕੁਚਲ ਰਿਹਾ ਹੋਵੇ ਤਾਂ ਉਹ ਉਸ ਅੱਗ ਵਿਚ ਹੀ ਗਿਰ ਜਾਣਗੇ। ਯਹੂਦੀਆਂ ਤੋਂ ਬਾਅਦ ਈਸਾਈਆਂ ਨੂੰ ਬੁਲਾਇਆ ਜਾਵੇਗਾ ਅਤੇ ਉਹਨਾਂ ਨੂੰ ਪੁ੍ਛਿੱਆ ਜਾਵੇਗਾ ਕਿ ਤੁਸੀਂ ਕਿਸ ਦੀ ਪੂਜਾ ਕਰਦੇ ਸੀ? ਤਾਂ ਉਹ ਆਖਣਗੇ ਕਿ ਹਜ਼ਰਤ ਈਸਾ ਦੀ ਜੋਕਿ ਅੱਲਾਹ ਦੇ ਪੁੱਤਰ ਸੀ ਤਾਂ ਉਹਨਾਂ ਨੂੰ ਕਿਹਾ ਜਾਵੇਗਾ ਕਿ ਤੁਸੀਂ ਝੂਠ ਬੋਲਦੇ ਹੋ ਅੱਲਾਹ ਤਆਲਾ ਦੀ ਕੋਈ ਪਤਨੀ ਹੇ ਹੀ ਨਹੀਂ। ਫੇਰ ਉਹਨਾਂ ਤੋਂ ਪੁੱਛਿਆ ਜਾਵੇਗਾ ਕਿ ਤੁਸੀਂ ਕੀ ਚਾਹੰਦੇ ਹੋ? ਤਾਂ ਉਹ ਵੀ ਉਹੀਓ ਕਹਿਣਗੇ ਜੋ ਯਹੂਦੀਆਂ ਨੇ ਕਿਹਾ ਸੀ ਅਤੇ ਉਹ ਵੀ ਐਵੇਂ ਹੀ ਨਰਕ ਵਿਚ ਸੁੱਟੇ ਜਾਣਗੇ ਹੁਣ ਮੈਦਾਨ ਵਿਚ ਕੇਵਲ ਉਹੀਓ ਲੋਕ ਰਹਿ ਜਾਣਗੇ ਜਿਹੜੇ ਕੇਵਲ ਰੱਬ ਦੀ ਹੀ ਇਬਾਦਤ ਕਰਿਆ ਕਰਦੇ ਸਨ। ਇਹਨਾਂ ਵਿਚ ਚੰਗੇ ਮਾੜੇ ਸਾਰੇ ਹੀ ਹੋਣਗੇ ਉਸ ਸਮੇਂ ਅੱਲਾਹ ਇਕ ਸ਼ਕਲ ਵਿਚ ਪ੍ਰਗਟ ਹੋਵੇਗਾ ਜਿਹੜੀ ਉਸ ਪਹਿਲੀ ਸ਼ਕਲ ਵਾਂਗ ਹੋਵੇਗੀ ਜਿਹੜੀ ਉਹ ਪਹਿਲਾਂ ਵੇਖ ਚੁੱਕੇ ਸਨ ਉਹਨਾਂ ਨੂੰ ਕਿਹਾ ਜਾਵੇਗਾ ਕਿ ਤੁਸੀਂ ਕਿਸ ਦੀ ਉਡੀਕ ਕਰ ਰਹੇ ਹੋ? ਹਰ ਟੋਲਾ ਆਪਣੇ ਇਸ਼ਟ ਨਾਲ ਚਲਾ ਜਾਵੇਗਾ ਜਿਸ ਦੀ ਉਹ ਇਬਾਦਤ ਕਰਦੇ ਸਨ ਤਾਂ ਉਹ ਆਖਣਗੇ ਕਿ ਸੰਸਾਰ ਵਿਚ ਅਸੀਂ ਇਹਨਾਂ ਕੁਰਾਹੇ ਪਏ ਲੋਕਾਂ ਤੋਂ ਅਲੱਗ ਰਹੇ ਅਸੀਂ ਇਹਨਾਂ ਦਾ ਸਾਥ ਨਹੀਂ ਦਿੱਤਾ ਅਸੀਂ ਤਾਂ ਆਪਣੇ ਸੱਚੇ ਇਸ਼ਟ ਦੀ ਉਡੀਕ ਕਰ ਰਹੇ ਹਾਂ ਜਿਸ ਦੀ ਅਸੀਂ ਇਬਾਦਤ ਕਰਿਆ ਕਰਦੇ ਸਨ। ਉਸ ਸਮੇਂ ਪਾਲਣਹਾਰਾ ਫ਼ਰਮਾਏਗਾ ਮੈਂ ਹੀ ਤੁਹਾਡਾ ਰੱਬ ਹਾਂ ਤਾਂ ਉਹ ਇੰਜ ਤਿੰਨ ਵਾਰ ਆਖਣਗੇ ਕਿ ਅਸੀਂ ਅੱਲਾਹ ਦੇ ਨਾਲ ਕਿਸੇ ਨੂੰ ਸ਼ਰੀਕ ਨਹੀਂ ਬਣਾਉਂਦੇ। (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 4581)","lang":"pa","version":{"key":"punjabi_arif","direction":"ltr","language_iso_code":"pa","version":"1.0.0","last_update":1666783255,"title":"Punjabi translation","description":"Translation of the Quran meanings into Punjabi by Arif Halim, published by Darussalam"},"meta":{"transliteration":"inna al-laha lā yaẓlimu mith'qāla dharratin wa-in taku ḥasanatan yuḍāʿif'hā wayu'ti min ladun'hu ajran ʿaẓīman ","translations":["Indeed","Allah","(does) not","wrong","(as much as) weight","(of) an atom","And if","there is","a good","He doubles it","and gives","from","near Him","a reward","great","(40)"],"transliterationArr":["inna","al-laha","lā","yaẓlimu","mith'qāla","dharratin","wa-in","taku","ḥasanatan","yuḍāʿif'hā","wayu'ti","min","ladun'hu","ajran","ʿaẓīman",null],"verseTiming":[[1,0,1120],[2,1120,2000],[3,2000,2430],[4,2430,3330],[5,3330,4390],[6,4390,5460],[7,5460,6520],[8,6520,7080],[9,7080,7920],[10,7920,9830],[11,9830,10690],[12,10690,10960],[13,10960,11920],[14,11920,12640],[15,12640,14105]]}}