{"name":"59:21","price":"21਼ ਜੇ ਅਸੀਂ (ਅੱਲਾਹ) ਇਸ .ਕੁਰਆਨ ਨੂੰ ਕਿਸੇ ਪਹਾੜ ਉੱਤੇ ਨਾਜ਼ਿਲ ਕਰ ਦਿੰਦੇ ਤਾਂ (ਹੇ ਲੋਕੋ!) ਤੁਸੀਂ ਵੇਖਦੇ ਕਿ ਉਹ ਪਹਾੜ ਰੱਬ ਦੇ ਡਰ ਨਾਲ ਦੱਬ ਜਾਂਦਾ ਅਤੇ ਪਾਟ ਜਾਂਦਾ ।1 ਅਸੀਂ ਇਹ ਮਿਸਾਲਾਂ ਲੋਕਾਂ ਅੱਗੇ ਇਸ ਲਈ ਬਿਆਨ ਕਰਦੇ ਹਾਂ ਤਾਂ ਜੋ ਲੋਕੀ ਉਹਨਾਂ ਉੱਤੇ ਸੋਚ ਵਿਚਾਰ ਕਰਨ।","arabic":"لَوۡ أَنزَلۡنَا هَٰذَا ٱلۡقُرۡءَانَ عَلَىٰ جَبَلٖ لَّرَأَيۡتَهُۥ خَٰشِعٗا مُّتَصَدِّعٗا مِّنۡ خَشۡيَةِ ٱللَّهِۚ وَتِلۡكَ ٱلۡأَمۡثَٰلُ نَضۡرِبُهَا لِلنَّاسِ لَعَلَّهُمۡ يَتَفَكَّرُونَ","category":["59 (Al-Hashr)","Al-Hashr","Surah Al-Hashr","Chapter Al-Hashr","Hashr","Surah Hashr","Chapter Hashr","Al Hashr","Surah Al Hashr","Chapter Al Hashr","Surah 59","Chapter 59","The Exile","الحشر"],"ayahNumber":5147,"juzNumber":28,"footnotes":"1 ਇਸ ਤੋਂ ਪਤਾ ਲੱਗਦਾ ਹੈ ਕਿ ਪੇੜ-ਪੌਦੇ ਵੀ ਕੁੱਝ ਹੱਦ ਤਕ ਸੁਰਤ ਰੱਖਦੇ ਹਨ। ਇਸ ਦੀ ਪੁਸ਼ਟੀ ਹਦੀਸ ਤੋਂ ਵੀ ਹੁੰਦੀ ਹੈ ਜਿਸ ਵਿਚ ਇਕ ਰੁੱਖ ਦੇ ਹੋਣ ਦੀ ਚਰਚਾ ਕੀਤੀ ਗਈ ਹੈ ਭਾਵੇਂ ਕਿ ਇਹ ਨਬੀ (ਸ:) ਦਾ ਮੂਅਜਜ਼ਾ ਹੈ ਪਰ ਫੇਰ ਵੀ ਇਸ ਤੋਂ ਰੁੱਖ ਦੇ ਸੁਰਤ ਵਿਚ ਹੋਣ ਦਾ ਪਤਾ ਚਲਦਾ ਹੈ। ਹਦੀਸ ਵਿਚ ਹੈ ਕਿ ਅੱਲਾਹ ਦੇ ਰਸੂਲ (ਸ:) ਜੁਮੇ ਵਾਲੇ ਦਿਨ ਇਕ ਰੁੱਖ ਜਾਂ ਇਕ ਟਾਹਣੀ ਨਾਲ ਢਾਹਸਣਾ ਲਾ ਕੇ ਖੜ੍ਹਿਆ ਕਰਦੇ ਸੀ। ਅਨਸਾਰ ਦੀ ਇਕ ਔਰਤ ਜਾਂ ਮਰਦ ਨੇ ਬੇਨਤੀ ਕੀਤੀ, ਹੇ ਅੱਲਾਹ ਦੇ ਰਸੂਲ! ਅਸੀਂ ਤੁਹਾਡੇ ਲਈ ਇਕ ਮਿੰਬਰ ਨਾ ਬਣਵਾ ਦਈਏ? ਆਪ (ਸ:) ਨੇ ਫ਼ਰਮਾਇਆ, ਚੰਗਾ ਤੁਹਾਡੀ ਇੱਛਾ, ਫੇਰ ਉਹਨਾਂ ਨੇ ਮਿੰਬਰ ਬਣਵਾ ਦਿੱਤਾ। ਜਦੋਂ ਜੁਮੇ ਦਾ ਦਿਨ ਆਇਆ ਤਾਂ ਆਪ ਮਿੰਬਰ ’ਤੇ ਪਧਾਰੇ, ਰੁੱਖ ਦੀ ਟਾਹਣੀ ਇਕ ਬਾਲਕ ਵਾਂਗ ਰੋਣ ਲੱਗ ਪਈ, ਆਪ (ਸ:) ਮਿੰਬਰ ਤੋਂ ਹੇਠ ਉੱਤਰ ਰੁੱਖ ਨੂੰ ਛਾਤੀ ਨਾਲ ਲਾਇਆ, ਇਸ ’ਤੇ ਉਹ ਰੁੱਖ ਇੰਜ ਰੋਣ ਲੱਗਿਆ ਜਿਵੇਂ ਕਿਸੇ ਨੂੰ ਤਸੱਲੀ ਦਿੱਤੀ ਜਾਂਦੀ ਹੈ। ਆਪ (ਸ:) ਨੇ ਫ਼ਰਮਾਇਆ, ਇਹ ਰੁੱਖ ਇਸ ਲਈ ਰੋਂਦਾ ਹੈ ਕਿ ਪਹਿਲਾਂ ਇਹ ਅੱਲਾਹ ਦਾ ਨਾਂ ਸੁਣਦਾ ਸੀ। (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 3584)","lang":"pa","version":{"key":"punjabi_arif","direction":"ltr","language_iso_code":"pa","version":"1.0.0","last_update":1666783255,"title":"Punjabi translation","description":"Translation of the Quran meanings into Punjabi by Arif Halim, published by Darussalam"},"meta":{"transliteration":"law anzalnā hādhā al-qur'āna ʿalā jabalin lara-aytahu khāshiʿan mutaṣaddiʿan min khashyati al-lahi watil'ka al-amthālu naḍribuhā lilnnāsi laʿallahum yatafakkarūna ","translations":["If","We (had) sent down","this","Quran","on","a mountain","surely you (would) have seen it","humbled","breaking asunder","from","(the) fear","(of) Allah","And these","examples","We present them","to the people","so that they may","give thought","(21)"],"transliterationArr":["law","anzalnā","hādhā","al-qur'āna","ʿalā","jabalin","lara-aytahu","khāshiʿan","mutaṣaddiʿan","min","khashyati","al-lahi","watil'ka","al-amthālu","naḍribuhā","lilnnāsi","laʿallahum","yatafakkarūna",null],"verseTiming":[[1,0,490],[2,490,2700],[3,2700,3250],[4,3250,4560],[5,4560,5200],[6,5200,5890],[7,5890,7340],[8,7340,8420],[9,8420,10790],[10,10790,11900],[11,11900,12780],[12,12780,15480],[13,15480,16310],[14,16310,17490],[15,17490,18700],[16,18700,20600],[17,20600,21790],[18,21790,26015]]}}