{"name":"6:121","price":"121਼ ਅਜਿਹੇ ਜਾਨਵਰ ਨਾ ਖਾਓ ਜਿਨ੍ਹਾਂ ਉੱਤੇ (ਜ਼ਿਬਹ ਕਰਦੇ ਹੋਏ) ਅੱਲਾਹ ਦਾ ਨਾਂ ਨਹੀਂ ਲਿਆ ਗਿਆ, ਇਹ ਕੰਮ ਨਾ-ਫ਼ਰਮਾਨੀ ਵਾਲਾ ਹੇ ਅਤੇ ਸ਼ੈਤਾਨ ਆਪਣੇ ਸਾਥੀਆਂ ਦੇ ਮਨਾਂ ਵਿਚ ਸ਼ੰਕਾ ਪਾਉਂਦਾ ਹੇ ਤਾਂ ਜੋ ਇਹ ਤੁਹਾਡੇ ਨਾਲ ਝਗੜਣ। (ਹੇ ਨਬੀ!) ਜੇ ਤੁਸੀਂ ਇਹਨਾਂ ਲੋਕਾਂ ਦੀ ਪੈਰਵੀ ਕਰੋਗੇ ਤਾਂ ਤੁਸੀਂ ਵੀ ਮੁਸ਼ਰਿਕ ਬਣ ਜਾਓਗੇ।1","arabic":"وَلَا تَأۡكُلُواْ مِمَّا لَمۡ يُذۡكَرِ ٱسۡمُ ٱللَّهِ عَلَيۡهِ وَإِنَّهُۥ لَفِسۡقٞۗ وَإِنَّ ٱلشَّيَٰطِينَ لَيُوحُونَ إِلَىٰٓ أَوۡلِيَآئِهِمۡ لِيُجَٰدِلُوكُمۡۖ وَإِنۡ أَطَعۡتُمُوهُمۡ إِنَّكُمۡ لَمُشۡرِكُونَ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":910,"juzNumber":8,"footnotes":"1 ਇਸ ਤੋਂ ਭਾਵ ਉਹ ਅੰਨ੍ਹੀ ਪੈਰਵੀ ਹੇ ਜਿਸ ਵਿਚ ਲੱਗਣ ਤੋਂ ਬਾਅਦ ਇਨਸਾਨ ਹੱਕ ਅਤੇ ਦਲੀਲਾਂ ਨੂੰ ਨਹੀਂ ਵੇਖਦਾ ਸਗੋਂ ਆਪਣੇ ਬਜ਼ੁਰਗਾਂ ਨੂੰ ਅਤੇ ਉਹਨਾਂ ਦੀਆਂ ਗੱਲਾਂ ਨੂੰ ਹੀ ਸਹੀ ਸਮਝਦਾ ਹੇ ਇਸੇ ਨੂੰ ਸ਼ਿਰਕ ਕਿਹਾ ਜਾਂਦਾ ਹੇ। ਹਦੀਸ ਹੇ ਕਿ ਹਜ਼ਰਤ ਅਦੀ ਬਿਨ ਹਾਤਮ (ਰ:ਅ:) ਅੱਲਾਹ ਦੇ ਰਸੂਲ (ਸ:) ਕੋਲ ਆਏ ਤਾਂ ਉਹਨਾਂ ਦੇ ਗਲੇ ਵਿਚ ਸੋਨੇ ਦੀ ਸਲੀਬ ਸੀ। ਆਪ (ਸ:) ਨੇ ਉਹਨਾਂ ਨੂੰ ਕਿਹਾ, ਹੇ ਅਦੀ! ਇਸ ਬੁਤ ਨੂੰ ਸੁਨੂੰਟ ਦਿਓ ਅਤੇ ਫੇਰ ਆਪ (ਸ:) ਸੂਰਤ ਬਗਅਤ ਦੀ ਇਹ ਆਇਤ ਸੁਣਾਈ ਕਿ ਉਹਨਾਂ ਯਹੂਦੀ ਤੇ ਈਸਾਈਆਂ ਨੇ ਆਪਣੇ ਵਿਦਵਾਨਾਂ ਤੇ ਦੁਰਵੇਸ਼ਾਂ ਨੂੰ ਆਪਣਾ ਰੱਬ ਬਣਾ ਲਿਆ ਸੀ। ਆਪ (ਸ:) ਨੇ ਫ਼ਰਮਾਇਆ ਕਿ ਬੇਸ਼ੱਕ ਉਹ ਉਹਨਾਂ ਨੂੰ ਪੂਜਦੇ ਨਹੀਂ ਸੀ ਪਰ ਉਹਨਾਂ ਦੇ ਵਿਦਵਾਨ ਜਿਸ ਨੂੰ ਹਲਾਲ ਕਹਿ ਦਿੰਦੇ ਉਹ ਹਲਾਲ ਸਮਝਦੇ ਸੀ ਅਤੇ ਜਿਸ ਚੀਜ਼ ਨੂੰ ਹਰਾਮ ਕਹਿੰਦੇ ਸੀ ਉਸ ਨੂੰ ਹਰਾਮ ਸਮਝਦੇ ਸੀ। ਭਾਵ ਅੰਨ੍ਹੀ ਪੈਰਵੀ ਅਤੇ ਆਸਥਾ ਨੂੰ ਨਬੀ (ਸ:) ਨੇ ਆਪਣੇ ਧਾਰਮਿਕ ਆਗੂਆਂ ਦੀ ਇਬਾਦਤ ਕਿਹਾ ਹੇ। (ਜਾਅਮੇ ਤਿਰਮਜ਼ੀ, ਹਦੀਸ: 3095)","lang":"pa","version":{"key":"punjabi_arif","direction":"ltr","language_iso_code":"pa","version":"1.0.0","last_update":1666783255,"title":"Punjabi translation","description":"Translation of the Quran meanings into Punjabi by Arif Halim, published by Darussalam"},"meta":{"transliteration":"walā takulū mimmā lam yudh'kari us'mu al-lahi ʿalayhi wa-innahu lafis'qun wa-inna al-shayāṭīna layūḥūna ilā awliyāihim liyujādilūkum wa-in aṭaʿtumūhum innakum lamush'rikūna ","translations":["And (do) not","eat","of that","not","has been mentioned","(the) name","(of) Allah","on it","and indeed, it (is)","grave disobedience","And indeed","the devils","inspire","to","their friends","so that they dispute with you","and if","you obey them","indeed, you","(would) be the polytheists","(121)"],"transliterationArr":["walā","takulū","mimmā","lam","yudh'kari","us'mu","al-lahi","ʿalayhi","wa-innahu","lafis'qun","wa-inna","al-shayāṭīna","layūḥūna","ilā","awliyāihim","liyujādilūkum","wa-in","aṭaʿtumūhum","innakum","lamush'rikūna",null],"verseTiming":[[1,0,670],[2,670,1740],[3,1740,3330],[4,3330,3670],[5,3670,4490],[6,4490,4880],[7,4880,5780],[8,5780,6630],[9,6630,8470],[10,8470,9940],[11,9940,11500],[12,11500,13130],[13,13130,14310],[14,14310,16629],[15,16629,19579],[16,19579,22059],[17,22059,22659],[18,22659,24359],[19,24359,26269],[20,26269,30274]]}}