{"name":"6:74","price":"74਼ ਉਹ ਸਮਾਂ ਵੀ ਯਾਦ ਰੱਖਣ ਯੋਗ ਹੇ ਜਦੋਂ ਇਬਰਾਹੀਮ ਨੇ ਆਪਣੇ ਪਿਤਾ ਆਜ਼ਰ ਨੂੰ ਕਿਹਾ ਸੀ, ਕੀ ਤੁਸੀਂ ਬੁਤਾਂ ਨੂੰ ਇਸ਼ਟ ਬਣਾਉਂਦੇ ਹੋ ? ਮੈਂ ਤੁਹਾਨੂੰ ਅਤੇ ਤੁਹਾਡੀ ਸਾਰੀ ਬਰਾਦਰੀ ਨੂੰ ਗੁਮਰਾਹੀ ਵਿਚ ਪਿਆ ਵੇਖ ਰਿਹਾ ਹਾਂ।1","arabic":"۞ وَإِذۡ قَالَ إِبۡرَٰهِيمُ لِأَبِيهِ ءَازَرَ أَتَتَّخِذُ أَصۡنَامًا ءَالِهَةً إِنِّيٓ أَرَىٰكَ وَقَوۡمَكَ فِي ضَلَٰلٖ مُّبِينٖ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":863,"juzNumber":7,"footnotes":"1 ਹਜ਼ਰਤ ਇਬਰਾਹੀਮ ਦੇ ਪਿਤਾ ਆਪਣੀ ਕੌਮ ਵਾਂਗ ਕੁਰਾਹੇ ਪਏ ਹੋਏ ਸੀ ਸੋ ਦੂਜੇ ਮੁਸ਼ਰਿਕਾਂ ਵਾਂਗ ਉਹ ਵੀ ਨਰਕ ਵਿਚ ਜਾਣਗੇ ਜਿਵੇਂ ਹਦੀਸ ਵਿਚ ਹੇ ਕਿ ਅੱਲਾਹ ਦੇ ਰਸੂਲ (ਸ:) ਨੇ ਫ਼ਰਮਾਇਆ, ਹਸ਼ਰ ਵਾਲੇ ਦਿਨ ਇਬਰਾਹੀਮ ਆਪਣੇ ਪਿਤਾ ਆਜ਼ਰ ਨੂੰ ਜਿਨ੍ਹਾਂ ਦਾ ਚਿਹਰਾ ਮਿੱਟੀ ਘੱਟੇ ਨਾਲ ਲੁਕਿਆ ਹੋਵੇਗਾ, ਇਬਰਾਹੀਮ ਉਹਨਾਂ ਨੂੰ ਕਹਿਣਗੇ ਕੀ ਮੈਂ ਨੇ ਤੁਹਾਨੂੰ ਨਹੀਂ ਕਿਹਾ ਸੀ ਕਿ ਨਾ-ਫ਼ਰਮਾਨੀ ਨਾ ਕਰਨਾ ਤਾਂ ਆਜ਼ਰ ਆਖੇਗਾ ਕਿ ਅੱਜ ਮੈਂ ਤੇਰੀ ਨਾ-ਫ਼ਰਮਾਨੀ ਨਹੀਂ ਕਰਾਂਗਾ। ਇਬਰਾਹੀਮ ਆਪਣੇ ਰੱਬ ਨੂੰ ਬੇਨਤੀ ਕਰਨਗੇ ਕਿ ਹੇ ਰੱਬ! ਤੈਨੂੰ ਮੇਰੇ ਨਾਲ ਵਾਅਦਾ ਕੀਤਾ ਸੀ ਕਿ ਤੂੰ ਹਸ਼ਰ ਵਾਲੇ ਦਿਨ ਮੈਨੂੰ ਜ਼ਲੀਲ ਨਹੀਂ ਹੋਣ ਦੇਵੇਂਗਾ ਇਸ ਤੋਂ ਵੱਧ ਕੇ ਮੇਰੀ ਰੁਸਵਾਈ ਕੀ ਹੋਵੇਗੀ ਕਿ ਮੇਰੇ ਪਿਤਾ ਜ਼ਲੀਲ ਹੋਵੇ ਅਤੇ ਤੇਰੀ ਰਹਿਮਤ ਤੋਂ ਵਾਂਝਾ ਰਹਿ ਜਾਵੇ। ਇਸ ’ਤੇ ਅੱਲਾਹ ਫ਼ਰਮਾਏਗਾ ਮੈਂਨੇ ਕਾਫ਼ਿਰਾਂ ਲਈ ਮੰਨਤ ਨੂੰ ਹਰਾਮ ਕਰ ਛੱਡਿਆ ਹੇ, ਫੇਰ ਫ਼ਰਮਾਏਗਾ ਹੇ ਇਬਰਾਹੀਮ! ਆਪਣੇ ਪੈਰਾਂ ਦੇ ਹੇਠ ਵੇਖ ਇਬਰਾਹੀਮ ਵੇਖਣਗੇ ਕਿ ਗੰਦਗੀ ਨਾਲ ਭਰਿਆ ਹੋਇਆ ਇਕ ਬਿੱਜੂ ਹੇ ਜਿਸ ਨੂੰ ਲੱਤਾ ਤੋਂ ਫੜ੍ਹਿਆ ਜਾਵੇਗਾ ਅਤੇ ਨਰਕ ਵਿਚ ਸੁੱਟ ਦਿੱਤਾ ਜਾਵੇਗਾ। (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 3350)","lang":"pa","version":{"key":"punjabi_arif","direction":"ltr","language_iso_code":"pa","version":"1.0.0","last_update":1666783255,"title":"Punjabi translation","description":"Translation of the Quran meanings into Punjabi by Arif Halim, published by Darussalam"},"meta":{"transliteration":"wa-idh qāla ib'rāhīmu li-abīhi āzara atattakhidhu aṣnāman ālihatan innī arāka waqawmaka fī ḍalālin mubīnin ","translations":["And when","said","Ibrahim","to his father","Azar","Do you take","idols","(as) gods","Indeed, I","[I] see you","and your people","in","error","manifest","(74)"],"transliterationArr":["wa-idh","qāla","ib'rāhīmu","li-abīhi","āzara","atattakhidhu","aṣnāman","ālihatan","innī","arāka","waqawmaka","fī","ḍalālin","mubīnin",null],"verseTiming":[[1,0,650],[2,650,1250],[3,1250,2630],[4,2630,3680],[5,3680,4530],[6,4530,5730],[7,5730,6960],[8,6960,7910],[9,7910,11840],[10,11840,12690],[11,12690,13680],[12,13680,14070],[13,14070,15090],[14,15090,18255]]}}