{"name":"6:93","price":"93਼ ਉਸ ਵਿਅਕਤੀ ਤੋਂ ਵੱਧ ਜ਼ਾਲਮ ਕੌਣ ਹੋਵੇਗਾ ਜਿਹੜਾ ਅੱਲਾਹ ਉੱਤੇ ਝੂਠੀ ਊਜ ਲਾਵੇ ਜਾਂ ਇਹ ਕਹੇ ਕਿ ਮੇਰੇ ਉੱਤੇ ਵੀ ਵਹੀ ਨਾਜ਼ਿਲ ਕੀਤੀ ਗਈ ਹੇ, ਜਦੋਂ ਕਿ ਉਸ ਕੋਲ ਰੱਬ ਵੱਲੋਂ ਕੋਈ ਵੀ ਵਹੀ ਨਾਜ਼ਿਲ ਨਹੀਂ ਹੋਈ ਜਾਂ ਜਿਹੜਾ ਵਿਅਕਤੀ ਇਹ ਕਹੇ ਕਿ ਜਿਹੋ ਜਿਹਾ ਕਲਾਮ ਅੱਲਾਹ ਨੇ ਉਤਾਰਿਆ ਹੇ ਮੈਂ ਵੀ ਇਸੇ ਪ੍ਰਕਾਰ ਦਾ ਲਿਆ ਸਕਦਾ ਹਾਂ। ਜਦੋਂ ਤੁਸੀਂ ਇਹਨਾਂ ਜ਼ਾਲਮਾਂ ਨੂੰ ਮੌਤ ਦੀਆਂ ਸਖ਼ਤੀਆਂ ਵਿਚ ਗਿਰਫ਼ਤਾਰ ਵੇਖੋਗੇ ਅਤੇ ਫ਼ਰਿਸ਼ਤੇ ਇਹ ਕਹਿੰਦੇ ਹੋਏ ਆਪਣੇ ਹੱਥ ਵਧਾ ਰਹੇ ਹੋਣਗੇ ਕਿ ਕੱਢੋ ਆਪਣੀਆਂ ਜਾਨਾਂ, ਅੱਜ ਤੁਹਾਨੂੰ ਜ਼ਲੀਲ ਕਰਨ ਵਾਲੀ ਸਜ਼ਾ ਦਿੱਤੀ ਜਾਵੇਗੀ1 ਕਿਉਂ ਜੋ ਤੁਸੀਂ ਅੱਲਾਹ ’ਤੇ ਊਜਾਂ ਲਾਕੇ ਅਣ-ਹੱਕੀਆਂ ਗੱਲਾਂ ਘੜ੍ਹਦੇ ਸੀ ਅਤੇ ਉਸ ਦੀਆਂ ਆਇਤਾਂ ਤੋਂ ਤਕੱਬਰ (ਘਮੰਡ ਵਿਚ ਆ ਕੇ ਇਨਕਾਰ) ਕਰਦੇ ਸੀ।","arabic":"وَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبًا أَوۡ قَالَ أُوحِيَ إِلَيَّ وَلَمۡ يُوحَ إِلَيۡهِ شَيۡءٞ وَمَن قَالَ سَأُنزِلُ مِثۡلَ مَآ أَنزَلَ ٱللَّهُۗ وَلَوۡ تَرَىٰٓ إِذِ ٱلظَّٰلِمُونَ فِي غَمَرَٰتِ ٱلۡمَوۡتِ وَٱلۡمَلَٰٓئِكَةُ بَاسِطُوٓاْ أَيۡدِيهِمۡ أَخۡرِجُوٓاْ أَنفُسَكُمُۖ ٱلۡيَوۡمَ تُجۡزَوۡنَ عَذَابَ ٱلۡهُونِ بِمَا كُنتُمۡ تَقُولُونَ عَلَى ٱللَّهِ غَيۡرَ ٱلۡحَقِّ وَكُنتُمۡ عَنۡ ءَايَٰتِهِۦ تَسۡتَكۡبِرُونَ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":882,"juzNumber":7,"footnotes":"1 ਇਸ ਤੋਂ ਅਜ਼ਾਬੇ ਕਬਰ ਹੋਣਾ ਸਿੱਧ ਹੁੰਦਾ ਹੇ ਜਿਹੜਾ ਹੱਕ ਸੱਚ ’ਤੇ ਆਧਾਰਿਤ ਹੇ। ਇਸੇ ਤਰ੍ਹਾਂ ਸੂਰਤ ਮੋਮਿਨ ਦੀ 45, 46 ਆਇਤ ਤੋਂ ਵੀ ਇਸ ਦਾ ਸਬੂਤ ਮਿਲਦਾ ਹੇ। ਜਿਸ ਵਿਚ ਆਲੇ-ਫ਼ਿਰਔੌਨ ਦੇ ਅਜ਼ਾਬ ਦੀ ਗੱਲ ਕੀਤੀ ਗਈ ਹੇ। ਅੱਲਾਹ ਦਾ ਫ਼ਰਮਾਨ ਹੇ ਅਤੇ ਆਲੇ ਫ਼ਿਰਔੌਨ ਨੂੰ ਬਹੁਤ ਹੀ ਭੈੜਾ ਦਰਦਨਾਕ ਅਜ਼ਾਬ ਘੇਰੇ ਵਿਚ ਲੈ ਲਵੇਗਾ। ਜਿਸ ਦੇ ਸਾਹਮਣੇ ਸਵੇਰੇ-ਸ਼ਾਮ ਉਹ ਲਿਆਏ ਜਾਣਗੇ ਅਤੇ ਜਿਸ ਦਿਨ ਕਿਆਮਤ ਕਾਇਮ ਹੋਵੇਗੀ ਤਾਂ ਹੁਕਮ ਦਿੱਤਾ ਜਾਵੇਗਾ ਕਿ ਫ਼ਿਰਔੌਨ ਦੇ ਸਾਥੀਆਂ ਨੂੰ ਕਰੜੇ ਅਜ਼ਾਬ ਵਿਚ ਸੁੱਟ ਦਿਓ ਇਹ ਆਇਤ ਕਬਰ ਦੇ ਅਜ਼ਾਬ ਦੀ ਖੁੱਲ੍ਹੀ ਦਲੀਲ ਹੇ। ਇਕ ਦੂਜੀ ਹਦੀਸ ਵਿਚ ਇਸ ਨੂੰ ਵਿਸਥਾਰ ਨਾਲ ਦੱਸਿਆ ਗਿਆ ਹੇ ਕਿ ਨਬੀ ਕਰੀਮ (ਸ:) ਨੇ ਫ਼ਰਮਾਇਆ, ਜਦੋਂ ਮੋਮਿਨ ਨੂੰ ਦਫ਼ਨ ਕਰਨ ਤੋਂ ਬਾਅਦ ਕਬਰ ਵਿਚ ਬਿਠਾਇਆ ਜਾਂਦਾ ਹੇ ਤਾਂ ਉਸ ਦੇ ਕੋਲ ਇਕ ਫ਼ਰਿਸ਼ਤਾ ਆਉਂਦਾ ਹੇ ਫੇਰ ਉਹ ਗਵਾਹੀ ਦਿੰਦਾ ਹੇ ਕਿ ਅੱਲਾਹ ਤੋਂ ਛੁੱਟ ਹੋਰ ਕੋਈ ਇਸ਼ਟ ਨਹੀਂ ਅਤੇ ਮੁਹੰਮਦ (ਸ:) ਅੱਲਾਹ ਦੇ ਰਸੂਲ ਹਨ ਅਤੇ .ਕੁਰਆਨ ਦੀ ਇਹ ਆਇਤ ਅੱਲਾਹ ਈਮਾਨ ਵਾਲਿਆਂ ਨੂੰ ਪੱਕੀ ਗੱਲ ਦੁਆਰਾ ਦੁਨੀਆਂ ਤੇ ਆਖ਼ਿਰਤ ਵਿਚ ਪੈਰ ਜਮਾਈ ਰੱਖਦਾ ਹੇ। (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ:1369) ਹਜ਼ਰਤ ਅਨਸ ਤੋਂ ਪਤਾ ਲੱਗਦਾ ਹੇ ਕਿ ਨਬੀ ਕਰੀਮ (ਸ:) ਨੇ ਫ਼ਰਮਾਇਆ ਕਿ ਲੋਕੀ ਮੁਰਦੇ ਨੂੰ ਦਫ਼ਨ ਕਰਕੇ ਜਦੋਂ ਵਾਪਸ ਆਉਂਦੇ ਹਨ ਤਾਂ ਉਹ ਉਹਨਾਂ ਦੇ ਪੈਰਾਂ ਦੀ ਆਵਾਜ਼ ਸੁਣਦਾ ਹੇ ਫੇਰ ਦੋ ਫ਼ਰਿਸ਼ਤੇ ਆਉਂਦੇ ਹਨ ਅਤੇ ਉਸ ਮੁਰਦੇ ਨੂੰ ਬਿਠਾ ਕੇ ਪੁੱਛਦੇ ਹਨ ਕਿ ਮੁਹੰਮਦ (ਸ:) ਦੇ ਪ੍ਰਤੀ ਤੂੰ ਦੁਨੀਆਂ ਵਿਚ ਕੀ ਕਿਹਾ ਕਰਦਾ ਸੀ ਤਾਂ ਉਹ ਜਵਾਬ ਵਿਚ ਕਹੇਗਾ, ਮੈਂ ਗਵਾਹੀ ਦਿੰਦਾ ਹਾਂ ਕਿ ਇਹ ਅੱਲਾਹ ਦੇ ਬੰਦੇ ਅਤੇ ਉਸ ਦੇ ਰਸੂਲ ਹਨ ਫੇਰ ਉਸ ਨੂੰ ਕਿਹਾ ਜਾਵੇਗਾ ਕਿ ਰਤਾ ਨਰਕ ਵਿਚ ਆਪਣੀ ਉਹ ਥਾਂ ਵੇਖ ਜਿਸ ਨੂੰ ਬਦਲ ਕੇ ਅੱਲਾਹ ਨੇ ਤੇਰਾ ਟਿਕਾਣਾ ਜੰਨਤ ਵਿਚ ਬਣਾ ਦਿੱਤਾ ਹੇ। ਫੇਰ ਨਬੀ (ਸ:) ਨੇ ਫ਼ਰਮਾਇਆ, ਉਹ ਮਰਨ ਵਾਲਾ ਦੋਵੇਂ ਟਿਕਾਣਿਆਂ ਨੂੰ ਵੇਖੇਗਾ ਪਰ ਜਿਹੜਾ ਕਾਫ਼ਿਰ ਹੋਵੇਗਾ ਉਹ ਫ਼ਰਿਸ਼ਤਿਆਂ ਨੂੰ ਕਹੇਗਾ ਮੈਂ ਇਸ ਵਿਅਕਤੀ (ਮੁਹੰਮਦ ਸ:) ਬਾਰੇ ਕੁੱਝ ਨਹੀਂ ਜਾਣਦਾ ਜੋ ਕੁੱਝ ਲੋਕੀ ਕਹਿੰਦੇ ਸੀ ਮੈਂਨੇ ਵੀ ਉਹੀ ਕਹਿ ਦਿੱਤਾ ਉਸ ਨੂੰ ਕਿਹਾ ਜਾਵੇਗਾ ਕਿ ਨਾ ਤੂੰ ਜਾਣਦਾ ਸੀ, ਅਤੇ ਨਾ ਹੀ .ਕੁਰਆਨ ਤੋਂ ਹਿਦਾਇਤ ਲਈ, ਫੇਰ ਉਸ ਦੇ ਚਿਹਰੇ ’ਤੇ ਇੰਨੀ ਜ਼ੋਰ ਨਾਲ ਥੌੜੇ ਨਾਲ ਸੱਟ ਮਾਰੀ ਜਾਵੇਗੀ ਕਿ ਉਹ ਚੀਕਾਂ ਮਾਰੇਗਾ ਜਿਸ ਨੂੰ ਮਨੁੱਖਾਂ ਤੇ ਜਿੰਨਾਂ ਤੋਂ ਛੁੱਟ ਦੂਰ ਨੇੜੇ ਦੀ ਸਾਰੀ ਮਖ਼ਲੂਕ ਸੁਣੇਗੀ। (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 1338)","lang":"pa","version":{"key":"punjabi_arif","direction":"ltr","language_iso_code":"pa","version":"1.0.0","last_update":1666783255,"title":"Punjabi translation","description":"Translation of the Quran meanings into Punjabi by Arif Halim, published by Darussalam"},"meta":{"transliteration":"waman aẓlamu mimmani if'tarā ʿalā al-lahi kadhiban aw qāla ūḥiya ilayya walam yūḥa ilayhi shayon waman qāla sa-unzilu mith'la mā anzala al-lahu walaw tarā idhi al-ẓālimūna fī ghamarāti al-mawti wal-malāikatu bāsiṭū aydīhim akhrijū anfusakumu al-yawma tuj'zawna ʿadhāba al-hūni bimā kuntum taqūlūna ʿalā al-lahi ghayra al-ḥaqi wakuntum ʿan āyātihi tastakbirūna ","translations":["And who","(is) more unjust","than (one) who","invents","about","Allah","a lie","or","said","It has been inspired","to me","while not","it was inspired","to him","anything","and (one) who","said","I will reveal","like","what","(has been) revealed","(by) Allah","And if","you (could) see","when","the wrongdoers","(are) in","agonies","(of) [the] death","while the Angels","(are) stretching out","their hands (saying)","Discharge","your souls","Today","you will be recompensed","(with) punishment","humiliating","because","you used to","say","against","Allah","other than","the truth","and you were","towards","His Verses","being arrogant","(93)"],"transliterationArr":["waman","aẓlamu","mimmani","if'tarā","ʿalā","al-lahi","kadhiban","aw","qāla","ūḥiya","ilayya","walam","yūḥa","ilayhi","shayon","waman","qāla","sa-unzilu","mith'la","mā","anzala","al-lahu","walaw","tarā","idhi","al-ẓālimūna","fī","ghamarāti","al-mawti","wal-malāikatu","bāsiṭū","aydīhim","akhrijū","anfusakumu","al-yawma","tuj'zawna","ʿadhāba","al-hūni","bimā","kuntum","taqūlūna","ʿalā","al-lahi","ghayra","al-ḥaqi","wakuntum","ʿan","āyātihi","tastakbirūna",null],"verseTiming":[[1,0,22704],[2,22704,23606],[3,23606,25135],[4,25135,25898],[5,25898,26573],[6,26573,27194],[7,27194,27798],[8,27798,28407],[9,28407,28960],[10,28960,29858],[11,29858,30687],[12,30687,31262],[13,31262,31969],[14,31969,32711],[15,32711,33840],[16,33840,34718],[17,34718,35797],[18,35797,37697],[19,37697,38364],[20,38364,40339],[21,40339,41569],[22,41569,43716],[23,43716,44965],[24,44965,47245],[25,47245,47822],[26,47822,49122],[27,49122,49698],[28,49698,50592],[29,50592,51550],[30,51550,54669],[31,54669,57548],[32,57548,59216],[33,59216,62664],[34,62664,65329],[35,65329,66502],[36,66502,69091],[37,69091,71548],[38,71548,73060],[39,73060,74104],[40,74104,74993],[41,74993,75844],[42,75844,76502],[43,76502,77896],[44,77896,79181],[45,79181,79686],[46,79686,80523],[47,80523,81287],[48,81287,82007],[49,82007,83626],[50,83626,84170],[51,84170,85792],[52,85792,88805]]}}