{"name":"77:48","price":"48਼ ਜਦੋਂ ਉਹਨਾਂ ਨੂੰ ਆਖਿਆ ਜਾਂਦਾ ਹੈ ਕਿ ਰੁਕੂਅ ਕਰੋ (ਭਾਵ ਝੁਕ ਜਾਓ) ਤਾਂ ਉਹ ਰੁਕੂਅ ਨਹੀਂ ਸੀ ਕਰਦੇ।1","arabic":"وَإِذَا قِيلَ لَهُمُ ٱرۡكَعُواْ لَا يَرۡكَعُونَ","category":["77 (Al-Mursalat)","Al-Mursalat","Surah Al-Mursalat","Chapter Al-Mursalat","Mursalat","Surah Mursalat","Chapter Mursalat","Al Mursalat","Surah Al Mursalat","Chapter Al Mursalat","Surah 77","Chapter 77","The Emissaries","المرسلات"],"ayahNumber":5670,"juzNumber":29,"footnotes":"1 ਰੁਕੂਅ ਤੋਂ ਭਾਵ ਨਮਾਜ਼ ਪੜ੍ਹਣਾ ਹੈ ਅਤੇ ਨਮਾਜ਼ ਪੜ੍ਹਣ ਤੋਂ ਭਾਵ ਮੁਸਲਮਾਨ ਹੋਣਾ ਹੈ, ਕਿਉਂ ਜੋ ਨਮਾਜ਼ ਤੋਂ ਬਿਨਾਂ ਕੋਈ ਮੁਸਲਮਾਨ ਨਹੀਂ ਹੋ ਸਕਦਾ ਇਸ ਲਈ ਮੁਸਲਮਾਨ ਦੀ ਪਛਾਣ ਵਿਚ ਨਮਾਜ਼ ਨੂੰ ਪਹਿਲ ਦਿੱਤੀ ਜਾਂਦੀ ਹੈ। ਜਿਹੜਾ ਵਿਅਕਤੀ ਖ਼ਾਨਾ-ਕਾਅਬਾ ਵੱਲ ਮੂੰਹ ਕਰਕੇ ਨਮਾਜ਼ ਪੜ੍ਹਦਾ ਹੈ ਉਸ ਦੀ ਜਾਨ-ਮਾਲ ਸੁਰੱਖਿਅਤ ਹੋਵੇਗਾ ਜਿਵੇਂ ਕਿ ਹਦੀਸ ਵਿਚ ਹੈ ਕਿ ਮੈਨੂੰ ਹੁਕਮ ਹੋਇਆ ਕਿ ਲੋਕਾਂ ਨਾਲ ਜੰਗ ਕਰਾ ਇੱਥੋਂ ਤਕ ਕਿ ਉਹ ਲਾ ਇਲਾਹਾ ਇਲੱਲ ਲਾਹ ਨੂੰ ਮੰਨ ਲੈਣ, ਜਦੋਂ ਉਹ ਇਸ ਕਲਮੇ ਦਾ ਇਕਰਾਰ ਕਰ ਲੈਣ ਫੇਰ ਉਹ ਸਾਡੇ ਵਾਂਗ ਨਮਾਜ਼ ਪੜ੍ਹਣ ਲੱਗ ਜਾਣ ਅਤੇ ਨਮਾਜ਼ ਵਿਚ ਸਾਡੇ ਕਾਅਬੇ ਵੱਲ ਮੂੰਹ ਕਰਨ ਜਿੱਦਾਂ ਅਸੀਂ ਜ਼ਿਬਹ ਕਰਦੇ ਹਾਂ ਉਸੇ ਤਰ੍ਹਾਂ ਜ਼ਿਬਹ ਕਰਨ ਤਾਂ ਸਾਡੇ ਲਈ ਉਹਨਾਂ ਦੀ ਜਾਨ ਤੇ ਮਾਲ ਹਰਾਮ ਹੋ ਗਈ, ਪਰ ਹੱਕ ਅਨੁਸਾਰ ਹਲਾਲ ਹੈ ਅਤੇ ਇਸ ਦਾ ਹਿਸਾਬ ਅੱਲਾਹ ਦੇ ਜ਼ਿੰਮੇ ਹੈ। ਮੈਮੂਨ ਬਿਨ ਸਿਹਾ ਨੇ ਹਜ਼ਰਤ ਅਨਸ ਬਿਨ ਮਾਲਿਕ ਰ:ਅ: ਨੂੰ ਪੁੱਛਿਆ ਕਿ ਕਿਹੜੀ ਚੀਜ਼ ਆਦਮੀ ਦੀ ਜਾਨ ਤੇ ਮਾਲ ਨੂੰ ਹਰਾਮ ਤੋਂ ਸੁਰੱਖਿਅਤ ਕਰ ਦਿੰਦੀ ਹੈ, ਉਹਨਾਂ ਨੇ ਕਿਹਾ ਕਿ ਜਿਹੜਾ ਕੋਈ ਆਖੇ ਲਾ ਇਲਾਹਾ ਇਲੱਲ ਲਾਹ ਭਾਵ ਗਵਾਹੀ ਦੇਵੇ ਕਿ ਅੱਲਾਹ ਤੋਂ ਛੁੱਟ ਸਾਡਾ ਕੋਈ ਇਸ਼ਟ ਨਹੀਂ ਅਤੇ ਸਾਡੇ ਕਿਬਲੇ ਵੱਲ ਮੂੰਹ ਕਰਕੇ ਅਤੇ ਸਾਡੇ ਵਾਂਗ ਨਮਾਜ਼ ਪੜ੍ਹੇ ਅਤੇ ਸਾਡਾ ਜ਼ਿਬਹ ਕੀਤਾ ਹੋਇਆ ਜਾਨਵਰ ਖਾਵੇ ਤਾਂ ਉਹ ਮੁਸਲਮਾਨ ਹੈ ਅਤੇ ਜਿਹੜਾ ਹੱਕ ਦੂਜੇ ਮੁਸਲਮਾਨਾਂ ਦਾ ਹੈ ਉਹੀਓ ਹੱਕ ਉਸ ਦਾ ਹੈ ਜਿਹੜੇ ਕਰਤੱਵ ਦੂਜੇ ਮੁਸਲਮਾਨਾਂ ’ਤੇ ਲਾਗੂ ਹੁੰਦੇ ਹਨ ਉਹੀਓ ਉਸੇ ’ਤੇ ਹੋਣ। (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 393-392)","lang":"pa","version":{"key":"punjabi_arif","direction":"ltr","language_iso_code":"pa","version":"1.0.0","last_update":1666783255,"title":"Punjabi translation","description":"Translation of the Quran meanings into Punjabi by Arif Halim, published by Darussalam"},"meta":{"transliteration":"wa-idhā qīla lahumu ir'kaʿū lā yarkaʿūna ","translations":["And when","it is said","to them","Bow","not","they bow","(48)"],"transliterationArr":["wa-idhā","qīla","lahumu","ir'kaʿū","lā","yarkaʿūna",null],"verseTiming":[[1,0,840],[2,840,1470],[3,1470,2060],[4,2060,2850],[5,2850,3230],[6,3230,6445]]}}