{"name":"7:8","price":"8਼ ਉਸ ਦਨਿ (ਕਆਿਮਤ ਦਹਿਾੜੇ) ਅਮਲਾਂ ਦਾ ਤੋਲ ਹੱਕ ਅਨੁਸਾਰ ਹੀ ਹੋਵੇਗਾ ਫੇਰ ਜਸਿ ਦਾ ਪਲੜ੍ਹਾ (ਨੇਕ ਅਮਲਾਂ ਦਾ) ਭਾਰੀ ਹੋਵੇਗਾ ਉਹੀਓ ਕਾਮਯਾਬ ਹੋਵੇਗਾ।1","arabic":"وَٱلۡوَزۡنُ يَوۡمَئِذٍ ٱلۡحَقُّۚ فَمَن ثَقُلَتۡ مَوَٰزِينُهُۥ فَأُوْلَٰٓئِكَ هُمُ ٱلۡمُفۡلِحُونَ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":962,"juzNumber":8,"footnotes":"1 ਇਸ ਆਇਤ ਵਿਚ ਅਮਲਾਂ ਦੇ ਭਾਰ ਦੀ ਗੱਲ ਕੀਤੀ ਗਈ ਹੈ ਭਾਵ ਕਿਆਮਤ ਦਿਹਾੜੇ ਮਨੁੱਖਾਂ ਦੇ ਅਮਲਾਂ ਨੂੰ ਤੋਲਿਆ ਜਾਵੇਗਾ ਸੂਰਤ ਅੰਬੀਆਂ ਦੀ ਆਇਤ ਵਿਚ .ਕੁਰਆਨ ਫ਼ਰਮਾਉਂਦਾ ਹੈ ਕਿ ਕਿਆਮਤ ਦੇ ਦਿਨ ਅੱਲਾਹ ਲੋਕਾਂ ਦੇ ਅਮਲਾਂ ਨੂੰ ਇਕ ਇਨਸਾਫ਼ ਦੇ ਪੈਮਾਨੇ ਦੁਆਰਾ ਤੋਲੇਗਾ। ਹਦੀਸ ਵਿਚ ਵੀ ਅਮਲਾਂ ਨੂੰ ਤੋਲਣ ਦੀ ਚਰਚਾ ਕੀਤੀ ਗਈ ਹੈ ਜਿਵੇਂ ਨਬੀ ਕਰੀਮ (ਸ:) ਨੇ ਫ਼ਰਮਾਇਆ ਕਿ ਦੋ ਕਲਮੇ ਅੱਲਾਹ ਨੂੰ ਬਹੁਤ ਹੀ ਪਸੰਦ ਹਨ ਜਿਹੜੇ ਜ਼ੁਬਾਨ ਲਈ ਬਹੁਤ ਹਲਕੇ ਅਤੇ ਤੋਲਣ ਵਿਚ ਬਹੁਤ ਭਾਰ ਰੱਖਦੇ ਹਨ ਉਹ ਹਨ ਸੁਬਹਾਨੱਲਾ ਹੀ ਵਾਬੀ ਹਮਦੀ ਹੀ ਸੁਬਹਾ-ਨੱਲਾਹਿਲ-ਅਜ਼ੀਮ ਭਾਵ ਅੱਲਾਹ ਪਾਕ ਹੈ ਆਪਣੀਆਂ ਸਾਰੀਆਂ ਖ਼ੂਬੀਆਂ ਸਨੇ ਅੱਲਾਹ ਪਾਕ ਹੈ ਅਤੇ ਉੱਚੀ ਵਡਿਆਈ ਵਾਲਾ ਹੈ। (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 7563) ਭਾਵ ਕਿ ਮੈਂ ਅੱਲਾਹ ਨੂੰ ਉਹਨਾਂ ਸਾਰੀਆਂ ਗੱਲਾਂ ਤੋਂ ਪਾਕ ਸਮਝਦਾ ਹਾਂ ਜਿਹੜੀਆਂ ਉਸ ਦੀ ਸ਼ਾਨ ਦੇ ਵਿਰੁੱਧ ਹਨ ਅਤੇ ਮੈਂ ਅੱਲਾਹ ਨੂੰ ਉਹਨਾਂ ਸਾਰੀਆਂ ਗੱਲਾਂ ਤੋਂ ਬਹੁਤ ਉੱਚਾ ਸਮਝਦਾ ਹਾਂ ਜਿਹੜੀਆਂ ਉਸ ਨਾਲ ਜੋੜੀਆਂ ਜਾਂਦੀਆਂ ਹਨ, ਮੈਂ ਤਾਂ ਉਸ ਦੀ ਪ੍ਰਸੰਸ਼ਾ ਅਤੇ ਵਡਿਆਈ ਬਿਆਨ ਕਰਦਾ ਹਾਂ।","lang":"pa","version":{"key":"punjabi_arif","direction":"ltr","language_iso_code":"pa","version":"1.0.0","last_update":1666783255,"title":"Punjabi translation","description":"Translation of the Quran meanings into Punjabi by Arif Halim, published by Darussalam"},"meta":{"transliteration":"wal-waznu yawma-idhin al-ḥaqu faman thaqulat mawāzīnuhu fa-ulāika humu al-muf'liḥūna ","translations":["And the weighing","that day","(will be) the truth","So whose ","(will be) heavy","his scales","then those","[they]","(will be) the successful ones","(8)"],"transliterationArr":["wal-waznu","yawma-idhin","al-ḥaqu","faman","thaqulat","mawāzīnuhu","fa-ulāika","humu","al-muf'liḥūna",null],"verseTiming":[[1,0,1220],[2,1220,2580],[3,2580,3830],[4,3830,4940],[5,4940,5850],[6,5850,7530],[7,7530,10730],[8,10730,11180],[9,11180,14675]]}}