{"name":"7:87","price":"87਼ ਜੇ ਤੁਹਾਡੇ ਵਿਚ ਕੁੱਝ ਲੋਕ ਉਸ ਰੱਬੀ ਆਦੇਸ਼ ’ਤੇ, ਜਿਸ ਨਾਲ ਮੈਨੂੰ (ਸ਼ੁਐਬ ਨੂੰ) ਭੇਜਿਆ ਗਿਆ ਹੈ, ਈਮਾਨ ਲਿਆਏ ਅਤੇ ਕੁੱਝ ਈਮਾਨ ਨਾ ਲਿਆਏ ਤਾਂ ਰਤਾ ਤੁਸੀਂ ਧੀਰਜ ਰੱਖੋ ਇੱਥੋਂ ਤਕ ਕਿ ਅੱਲਾਹ ਸਾਡੇ ਵਿਚਾਲੇ ਕੋਈ ਫ਼ੈਸਲਾ ਕਰ ਦੇਵੇ ਅਤੇ ਉਹ (ਅੱਲਾਹ) ਸਭ ਤੋਂ1 ਵਧੀਆ ਫ਼ੈਸਲਾ ਕਰਨ ਵਾਲਾ ਹੈ।","arabic":"وَإِن كَانَ طَآئِفَةٞ مِّنكُمۡ ءَامَنُواْ بِٱلَّذِيٓ أُرۡسِلۡتُ بِهِۦ وَطَآئِفَةٞ لَّمۡ يُؤۡمِنُواْ فَٱصۡبِرُواْ حَتَّىٰ يَحۡكُمَ ٱللَّهُ بَيۡنَنَاۚ وَهُوَ خَيۡرُ ٱلۡحَٰكِمِينَ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":1041,"juzNumber":8,"footnotes":"1 ਇਹ ਫ਼ੈਸਲਾ ਸੰਸਾਰ ਵਿਚ ਵੀ ਹੋ ਸਕਦਾ ਹੈ ਪਰ ਆਖ਼ਿਰਤ ਵਿਚ ਫ਼ੈਸਲਾ ਹੋਣਾ ਲਾਜ਼ਮੀ ਹੈ ਉੱਥੇ ਹਰੇਕ ਤੋਂ ਉਸ ਦੇ ਕੰਮਾਂ ਬਾਰੇ ਪੁੱਛ-ਗਿੱਛ ਹੋਵੇਗੀ ਅਤੇ ਉਸ ਦੀ ਰੌਸ਼ਨੀ ਵਿਚ ਫ਼ੈਸਲੇ ਕੀਤੇ ਜਾਣਗੇ ਜਿਵੇਂ ਹਦੀਸ ਵਿਚ ਨਬੀ (ਸ:) ਨੇ ਫ਼ਰਮਾਇਆ ਹੈ ਕਿ ਤੁਹਾਡੇ ਵਿੱਚੋਂ ਹਰੇਕ ਵਿਅਕਤੀ ਜ਼ਿੰਮੇਵਾਰ ਹੈ ਅਤੇ ਉਸ ਤੋਂ ਉਸ ਦੇ ਅਧੀਨ ਲੋਕਾਂ ਬਾਰੇ ਪੁੱਛਿਆ ਜਾਵੇਗਾ, ਰਾਜਾ ਤੋਂ ਉਸ ਦੀ ਪਰਜਾ ਪ੍ਰਤੀ ਪੁੱਛਿਆ ਜਾਵੇਗਾ ਔੌਰਤ ਆਪਣੇ ਪਤੀ ਦੇ ਘਰ ਅਤੇ ਉਸ ਦੇ ਬੱਚਿਆ ਦੀ ਰਖ਼ਵਾਲੀ ਕਰਨ ਲਈ ਹੈ ਉਸ ਤੋਂ ਉਹਨਾਂ ਬਾਰੇ ਪੁੱਛ-ਗਿੱਛ ਹੋਵੇਗੀ। ਤੁਹਾਡੇ ਵਿੱਚੋਂ ਹਰ ਵਿਅਕਤੀ ਜ਼ਿੰਮੇਵਾਰ ਹੈ ਅਤੇ ਉਸ ਤੋਂ ਉਸ ਦੇ ਅਧੀਨ ਲੋਕਾਂ ਬਾਰੇ ਪੁੱਛਿਆ ਜਾਵੇਗਾ। (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 7138) ● ਇਕ ਹਦੀਸ ਵਿਚ ਰਸੂਲ (ਸ:) ਨੇ ਫ਼ਰਮਾਇਆ ਜਿਹੜਾ ਕੋਈ ਵਿਖ਼ਾਵੇ ਲਈ ਕੋਈ ਨੇਕ ਕੰਮ ਕਰਦਾ ਹੈ ਤਾਂ ਅੱਲਾਹ ਕਿਆਮਤ ਵਾਲੇ ਦਿਨ ਉਸ ਦੀ ਨਿਯਤ ਨੂੰ ਲੋਕਾਂ ਸਾਹਮਣੇ ਜ਼ਾਹਿਰ ਕਰੇਗਾ ਜਿਹੜਾ ਕੋਈ ਲੋਕਾਂ ਨਾਲ ਸਖ਼ਤੀ ਕਰੇਗਾ ਤਾਂ ਕਿਆਮਤ ਵਾਲੇ ਦਿਨ ਅੱਲਾਹ ਉਹਨਾਂ ’ਤੇ ਸਖ਼ਤੀ ਕਰੇਗਾ (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 7152) ਇਕ ਵਿਅਕਤੀ ਨੇ ਅੱਲਾਹ ਦੇ ਰਸੂਲ (ਸ:) ਨੂੰ ਆਖਿਆ ਕਿ ਹੇ ਅੱਲਾਹ ਦੇ ਰਸੂਲ! ਕਿਆਮਤ ਕਦੋਂ ਆਵੇਗੀ ? ਤਾਂ ਰਸੂਲ (ਸ:) ਨੇ ਪੁੱਛਿਆ ਕਿ ਤੈਨੇ ਉਸ ਕਿਆਮਤ ਲਈ ਕੀ ਤਿਆਰੀ ਕੀਤੀ ਹੈ? ਤਾਂ ਉਹ ਵਿਅਕਤੀ ਸ਼ਰਮਿੰਦਾ ਹੋਇਆ ਅਤੇ ਡਰ ਗਿਆ ਅਤੇ ਕਿਹਾ ਕਿ ਹੇ ਅੱਲਾਹ ਦੇ ਰਸੂਲ! ਮੈਂਨੇ ਇਸ ਲਈ ਬਹੁਤੇ ਰੋਜ਼ੇ, ਖ਼ੈਰਾਤ ਤੇ ਨਮਾਜ਼ਾ ਤਾਂ ਨਹੀਂ ਪੜ੍ਹੀਆਂ ਪਰ ਮੈਂ ਅੱਲਾਹ ਅਤੇ ਉਸ ਦੇ ਰਸੂਲ ਨਾਲ ਮੁਹੱਬਤ ਕਰਦਾਂ ਹਾਂ ਇਹ ਸੁਣ ਕੇ ਨਬੀ (ਸ:) ਨੇ ਆਖਿਆ ਕਿ ਤੂੰ ਉਸੇ ਦਾ ਹੀ ਸਾਥੀ ਹੋਵੇਗਾ ਜਿਸ ਨਾਲ ਤੂੰ ਮੁਹੱਬਤ ਕਰਦਾ ਹੈ (ਸਹੀ ਬੁਖ਼ਾਰੀ ਹਦੀਸ: 7153) ਅਬੂਜ਼ਰ ਰ:ਅ: ਫ਼ਰਮਾਉਂਦੇ ਹਨ ਇਕ ਵਾਰ ਮੈਂ ਨਬੀ (ਸ:) ਦੀ ਸੇਵਾ ਵਿਚ ਹਾਜ਼ਰ ਹੋਇਆ ਤਾਂ ਆਪ (ਸ:) ਨੇ ਫ਼ਰਮਾਇਆ ਉਸ ਅੱਲਾਹ ਦੀ ਕਸਮ ਜਿਸ ਦੇ ਕਬਜ਼ੇ ਵਿਚ ਮੇਰੀ ਜਾਨ ਹੈ ਜਿਹੜਾ ਕੋਈ ਊਂਠ, ਗਊ, ਬਕਰੀਆਂ ਰੱਖਦਾ ਹੋਇਆ ਵੀ ਜ਼ਕਾਤ ਅਦਾ ਨਹੀਂ ਕਰਦਾ ਤਾਂ ਕਿਆਮਤ ਦਿਹਾੜੇ ਉਹਨਾਂ ਜਾਨਵਰਾਂ ਨੂੰ ਲਿਆਇਆ ਜਾਵੇਗਾ ਜਦ ਕਿ ਉਹ ਪਹਿਲਾਂ ਤੋਂ ਬਹੁਤ ਵੱਧ ਮੋਟੇ ਹੋਣਗੇ ਉਹ ਉਸ ਵਿਅਕਤੀ ਨੂੰ ਪੈਰਾ ਹੇਠ ਦੱਬਣਗੇ ਅਤੇ ਸੀਂਗਾਂ ਨਾਲ ਮਾਰਣਗੇ ਅਤੇ ਇੰਜ ਹੁੰਦਾ ਰਹੇਗਾ ਅਤੇ ਇਹ ਸਜ਼ਾ ਉਸ ਸਮੇਂ ਤਕ ਮਿਲਦੀ ਰਹੇਗੀ ਜਦੋਂ ਤਕ ਸਾਰੇ ਲੋਕਾਂ ਦਾ ਫ਼ੈਸਲਾ ਨਹੀਂ ਹੋ ਜਾਵੇਗਾ। (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 1460)","lang":"pa","version":{"key":"punjabi_arif","direction":"ltr","language_iso_code":"pa","version":"1.0.0","last_update":1666783255,"title":"Punjabi translation","description":"Translation of the Quran meanings into Punjabi by Arif Halim, published by Darussalam"},"meta":{"transliteration":"wa-in kāna ṭāifatun minkum āmanū bi-alladhī ur'sil'tu bihi waṭāifatun lam yu'minū fa-iṣ'birū ḥattā yaḥkuma al-lahu baynanā wahuwa khayru al-ḥākimīna ","translations":["And if","(there) is","a group","among you","(who has) believed","in that which","I have been sent","with [it]","and a group","not","they believe","then be patient","until","judges","Allah","between us","And He","(is the) Best","(of) [the] Judges","(87)"],"transliterationArr":["wa-in","kāna","ṭāifatun","minkum","āmanū","bi-alladhī","ur'sil'tu","bihi","waṭāifatun","lam","yu'minū","fa-iṣ'birū","ḥattā","yaḥkuma","al-lahu","baynanā","wahuwa","khayru","al-ḥākimīna",null],"verseTiming":[[1,0,570],[2,570,1980],[3,1980,6180],[4,6180,7700],[5,7700,8540],[6,8540,10980],[7,10980,11600],[8,11600,14490],[9,14490,14970],[10,14970,16120],[11,16120,17270],[12,17270,18730],[13,18730,19430],[14,19430,20380],[15,20380,21310],[16,21310,22360],[17,22360,23510],[18,23510,24090],[19,24090,28915]]}}