{"name":"8:73","price":"73਼ ਕਾਫ਼ਿਰ ਆਪਸ ਵਿਚ ਇਕ ਦੂਜੇ ਦੇ ਦੋਸਤ ਹਨ1 (ਹੇ ਮੋਮਿਨੋ) ਜੇ ਤੁਸੀਂ ਵੀ ਇੰਜ ਹੀ (ਕਾਫ਼ਿਰਾਂ ਵਾਂਗ) ਮਿੱਤਰਤਾ ਨਾ ਕੀਤੀ ਤਾਂ ਧਰਤੀ ਉੱਤੇ ਬਹੁਤ ਵੱਡਾ ਵਿਗਾੜ ਹੋ ਜਾਵੇਗਾ।","arabic":"وَٱلَّذِينَ كَفَرُواْ بَعۡضُهُمۡ أَوۡلِيَآءُ بَعۡضٍۚ إِلَّا تَفۡعَلُوهُ تَكُن فِتۡنَةٞ فِي ٱلۡأَرۡضِ وَفَسَادٞ كَبِيرٞ","category":["8 (Al-Anfal)","Al-Anfal","Surah Al-Anfal","Chapter Al-Anfal","Anfal","Surah Anfal","Chapter Anfal","Al Anfal","Surah Al Anfal","Chapter Al Anfal","Surah 8","Chapter 8","The Spoils of War","الأنفَال"],"ayahNumber":1233,"juzNumber":10,"footnotes":"1 ਤਫ਼ਸੀਰ ਤਿਬਰੀ ਵਿਚ ਬਿਆਨ ਕੀਤਾ ਗਿਆ ਹੈ ਕਿ ਇਸ ਆਇਤ ਦੀ ਸਭ ਤੋਂ ਵਧੀਆ ਤਫ਼ਸੀਰ ਵਿਆਖਣ ਇਹ ਹੈ ਜੇ ਤੁਸੀਂ ਉਹ ਕੁੱਝ ਨਹੀਂ ਕਰੋਗੇ ਜਿਹੜਾ ਮੈਂਨੇ ਤੁਹਾਨੂੰ ਹੁਕਮ ਦਿੱਤਾ ਹੈ ਭਾਵ ਤੁਸੀਂ ਦੁਨੀਆਂ ਭਰ ਦੇ ਮੁਸਲਮਾਨ ਅੱਲਾਹ ਦੇ ਦੀਨ ਨੂੰ ਭਾਰੂ ਅਤੇ ਜਿਤਣ ਲਈ ਇਕ ਜੁੱਟ ਹੋ ਕੇ ਇਕ ਦੂਜੇ ਦੇ ਹਾਮੀ ਅਤੇ ਸਹਾਈ ਨਹੀਂ ਬਣੋਗੇ ਤਾਂ ਦੁਨੀਆਂ ਵਿਚ ਫ਼ਿਤਨਾ ਫ਼ਸਾਦ ਫ਼ੈਲ ਜਾਵੇਗਾ ਅਤੇ ਇਕ ਹੀ ਸਮੇਂ ਵਿਚ ਕਈ ਖ਼ਲੀਫ਼ਾ (ਹੁਕਮਰਾਨ) ਦਾ ਹੋਣਾ ਵੀ ਫ਼ਿਤਨਾ ਹੀ ਹੈ ਜਿਵੇਂ ਇਕ ਹਦੀਸ ਵਿਚ ਜੋ ਕਿ ਸਹੀ ਮੁਸਲਿਮ ਦੀ ਹੈ, ਅਰਾਫ਼ਾਹ ਵੱਲੋਂ ਬਿਆਨ ਕੀਤੀ ਗਈ ਹੈ, ਉਹ ਕਹਿੰਦੇ ਹਨ ਕਿ ਮੈਂਨੇ ਨਬੀ ਕਰੀਮ (ਸ:) ਨੂੰ ਇਹ ਫ਼ਰਮਾਉਂਦੇ ਸੁਣਿਆ ਹੈ ਕਿ ਜਦੋਂ ਤੁਸੀਂ ਸਾਰੇ ਮੁਸਲਮਾਨ ਇਕ ਖ਼ਲੀਫ਼ਾ ਦੀ ਅਗਵਾਈ ਵਿਚ ਜਮਾਂ ਹੋ ਜਾਵੋਗੇ ਅਤੇ ਕੋਈ ਵਿਅਕਤੀ ਤੁਹਾਡੇ ਵਿਚਕਾਰ ਫ਼ਿਤਨਾ ਫੈਲਾ ਕੇ ਤੁਹਾਨੂੰ ਅੱਡ-ਅੱਡ ਵੰਡਣਾ ਚਾਹਵੇ ਤਾਂ ਅਜਿਹੇ ਵਿਅਕਤੀ ਦੀ ਗਰਦਨ ਵੱਡ ਦਿਓ (ਸਹੀ ਮੁਸਲਿਮ, ਹਦੀਸ: 1852) ਇਕ ਦੂਜੀ ਹਦੀਸ ਵਿਚ ਨਬੀ ਕਰੀਮ (ਸ:) ਨੇ ਫ਼ਰਮਾਇਆ ਜੇ ਦੁਨੀਆਂ ਦੇ ਮੁਸਲਮਾਨ ਦੋ ਖ਼ਲੀਫ਼ਿਆਂ (ਹਾਕਮਾਂ) ’ਤੇ ਬੈਅਤ ਭਾਵ ਕਬੂਲ ਕਰ ਲੈਣ ਤਾਂ ਇਹਨਾਂ ਵਿਚ ਜਿਸ ਦੇ ਹੱਥ ’ਤੇ ਪਹਿਲਾਂ ਬੈਅਤ ਕੀਤੀ ਜਾਵੇ ਉਹੀਓ ਖ਼ਲੀਫ਼ਾ ਵਜੋਂ ਬਾਕੀ ਰਹੇਗਾ ਜਦ ਕਿ ਦੂਜੇ ਨੂੰ ਕਤਲ ਕਰ ਦਿੱਤਾ ਜਾਵੇਗਾ। (ਸਹੀ ਮੁਸਲਿਮ, ਹਦੀਸ: 1853) ●.ਕੁਰਆਨ ਤੇ ਹਦੀਸ ਦੀਆਂ ਇਹਨਾਂ ਦਲੀਲਾਂ ਤੋਂ ਇਹੋ ਪਤਾ ਚਲਦਾ ਹੈ ਕਿ ਇਹ ਕਾਨੂੰਨੀ ਫ਼ਰਜ਼ ਹੈ ਕਿ ਇਕ ਸਮੇਂ ਵਿਚ ਸਾਰੀ ਇਸਲਾਮੀ ਦੁਨੀਆਂ ਲਈ ਇਕ ਤੋਂ ਵੱਧ ਖ਼ਲੀਫ਼ਾ ਨਹੀਂ ਹੋਣਾ ਚਾਹੀਦਾ ਨਹੀਂ ਤਾਂ ਮੁਸਲਮਾਨਾਂ ਵਿਚ ਇਕ ਵੱਡਾ ਫ਼ਿਤਨਾ ਪੈਦਾ ਹੋ ਜਾਵੇਗਾ ਜਿਸ ਦੇ ਸਿੱਟੇ ਬਹੁਤ ਹੀ ਖ਼ਤਰਨਾਕ ਹੋਣਗੇ।","lang":"pa","version":{"key":"punjabi_arif","direction":"ltr","language_iso_code":"pa","version":"1.0.0","last_update":1666783255,"title":"Punjabi translation","description":"Translation of the Quran meanings into Punjabi by Arif Halim, published by Darussalam"},"meta":{"transliteration":"wa-alladhīna kafarū baʿḍuhum awliyāu baʿḍin illā tafʿalūhu takun fit'natun fī al-arḍi wafasādun kabīrun ","translations":["And those who","disbelieve","some of them","(are) allies","(to) another","If not","you do it","(there) will be","oppression","in","the earth","and corruption","great","(73)"],"transliterationArr":["wa-alladhīna","kafarū","baʿḍuhum","awliyāu","baʿḍin","illā","tafʿalūhu","takun","fit'natun","fī","al-arḍi","wafasādun","kabīrun",null],"verseTiming":[[1,0,1370],[2,1370,2320],[3,2320,3450],[4,3450,6120],[5,6120,7230],[6,7230,8010],[7,8010,9370],[8,9370,10650],[9,10650,12520],[10,12520,12810],[11,12810,13640],[12,13640,16000],[13,16000,18655]]}}