{"name":"9:20","price":"20਼ ਜਿਹੜੇ ਲੋਕੀ ਈਮਾਨ ਲਿਆਏ, ਘਰ-ਬਾਰ ਛੱਡਿਆ ਅਤੇ ਅੱਲਾਹ ਦੀ ਰਾਹ ਵਿਚ ਆਪਣੇ ਮਾਲਾਂ ਤੇ ਜਾਨਾਂ ਸਹਿਤ ਜਿਹਾਦ ਕੀਤਾ, ਅੱਲਾਹ ਦੇ ਨਜ਼ਦੀਕ ਉਹਨਾਂ ਲੋਕਾਂ ਦੇ ਬਹੁਤ ਹੀ ਉੱਚੇ ਮਰਤਬੇ ਹਨ ਅਤੇ ਉਹੀਓ ਆਪਣੀਆਂ ਮੁਰਾਦਾਂ ਪਾਉਣਗੇ।1","arabic":"ٱلَّذِينَ ءَامَنُواْ وَهَاجَرُواْ وَجَٰهَدُواْ فِي سَبِيلِ ٱللَّهِ بِأَمۡوَٰلِهِمۡ وَأَنفُسِهِمۡ أَعۡظَمُ دَرَجَةً عِندَ ٱللَّهِۚ وَأُوْلَٰٓئِكَ هُمُ ٱلۡفَآئِزُونَ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1255,"juzNumber":10,"footnotes":"1 ਅੱਲਾਹ ਦੇ ਰਸੂਲ (ਸ:) ਦਾ ਫ਼ਰਮਾਨ ਹੈ ਜਿਹੜਾ ਅੱਲਾਹ ਤੇ ਉਸ ਦੇ ਰਸੂਲ (ਸ:) ’ਤੇ ਈਮਾਨ ਲਿਆਏ ਨਮਾਜ਼ ਕਾਇਮ ਕਰੇ ਰਮਜ਼ਾਨ ਦੇ ਰੋਜ਼ੇ ਰੱਖੇ ਤਾਂ ਅੱਲਾਹ ਨੇ ਇਹ ਗੱਲ ਆਪਣੇ ’ਤੇ ਲਾਜ਼ਮੀ ਕਰ ਲਈ ਹੈ ਕਿ ਉਸ ਨੂੰ ਜੰਨਤ ਵਿਚ ਦਾਖ਼ਲ ਕਰੇ ਭਾਵੇਂ ਕਿ ਉਸ ਨੇ ਜਿਹਾਦ ਕੀਤਾ ਹੋਵੇ ਜਾਂ ਉਸੀ ਥਾਂ ਬੈਠੇ ਰਹੇ ਜਿੱਥੇ ਉਹ ਜੰਮੀਆਂ ਸੀ ਲੋਕਾਂ ਨੇ ਪੁੱਛਿਆ ਕਿ ਹੇ ਅੱਲਾਹ ਦੇ ਰਸੂਲ! ਕੀ ਇਹ ਖ਼ੁਸ਼ਖ਼ਬਰੀ ਅਸੀਂ ਲੋਕਾਂ ਨੂੰ ਸੁਣਾ ਦਈਏ? ਤਾਂ ਆਪ ਨੇ ਫ਼ਰਮਾਇਆ ਜੰਨਤ ਦੇ ਸੋ ਦਰਜੇ ਹਨ ਜਿਹੜੇ ਅੱਲਾਹ ਦੀ ਰਾਹ ਵਿਚ ਜਿਹਾਦ ਕਰਨ ਵਾਲਿਆਂ ਲਈ ਤਿਆਰਾ ਕੀਤੇ ਗਏ ਹਨ ਹਰ ਦੋ ਦਰਜਿਆਂ ਵਿਚ ਇੰਨੀ ਦੂਰੀ ਹੈ ਜਿੰਨਾ ਅਕਾਸ਼ ਤੇ ਧਰਤੀ ਦੇ ਵਿਚਾਲੇ ਦੀ ਦੂਰੀ ਸੋ ਜਦੋਂ ਤੁਸੀਂ ਰੱਬ ਤੋਂ ਜੰਨਤ ਮੰਗੋ ਤਾਂ ਫਿਰਦੌਸ ਦਾ ਸਵਾਲ ਕਰੋ ਕਿਉਂ ਜੋ ਇਹ ਜੰਨਤ ਦਾ ਵਿਚਾਲੇ ਦਾ ਭਾਗ ਹੈ ਅਤੇ ਸਭ ਤੋਂ ਵਧੀਆ ਹੈ ਕਹਿਣ ਵਾਲੇ ਦਾ ਇਹ ਵੀ ਵਿਚਾਰ ਹੈ ਕਿ ਆਪ ਨੇ ਇਹ ਵੀ ਫ਼ਰਮਾਇਆ ਇਸ ਫਿਰਦੌਸ ਦੇ ਉੱਤੇ ਰਹਿਮਾਨ ਦਾ ਅਰਸ਼ ਹੈ ਅਤੇ ਜੰਨਤ ਦੀਆਂ ਨਹਿਰਾਂ ਉਸੇ ਤੋਂ ਹੀ ਨਿਕਲਦੀਆਂ ਹਨ (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 2790) ਸ਼ਹਾਦਤ ਦੀ ਇੱਛਾ ਰੱਖਣਾ ਵੀ ਇਕ ਮੋਮਿਨ ਦੀ ਵਿਸ਼ੇਸ਼ਤਾ ਹੈ। ਅਬੂ-ਹੁਰੈਰਾ ਦਾ ਕਹਿਣਾ ਹੈ ਕਿ ਰਸੂਲ (ਸ:) ਦਾ ਫ਼ਰਮਾਨ ਹੈ ਕਿ ਕਸਮ ਹੈ ਉਸ ਹਸਤੀ ਦੀ ਜਿਸ ਦੇ ਹੱਥ ਵਿਚ ਮੇਰੀ ਜਾਨ ਹੈ ਜੇ ਕੁੱਝ ਈਮਾਨ ਵਾਲਿਆਂ ਨੂੰ ਇਹ ਗੱਲ ਨਾ-ਪਸੰਦ ਨਾ ਹੁੰਦੀ ਕਿ ਉਹ ਮੇਰੇ ਪਿੱਛੇ ਰਹਿ ਜਾਣ ਅਤੇ ਉਹਨਾਂ ਕੋਲ ਸਵਾਰੀਆਂ ਵੀ ਨਹੀਂ ਕਿ ਜਿਨ੍ਹਾਂ ’ਤੇ ਮੈਂ ਉਹਨਾਂ ਨੂੰ ਸਵਾਰ ਕਰ ਦਵਾਂ ਤਾਂ ਮੈਂ ਕਿਸੇ (ਜੰਗ) ਵਿਚ ਪਿੱਛੇ ਨਾ ਰਹਿੰਦਾ ਜਿਹੜੇ ਅੱਲਾਹ ਦੀ ਰਾਹ ਵਿਚ ਜਿਹਾਦ ਲਈ ਨਿਕਲਦੇ ਹਨ। ਕਸਮ ਹੈ ਉਸ ਜ਼ਾਤ ਦੀ ਜਿਸ ਦੇ ਕਾਬੂ ਵਿਚ ਮੇਰੀ ਜਾਨ ਹੈ ਮੇਰੀ ਤਾਂ ਇਹੋ ਚਾਹਤ ਹੈ ਕਿ ਮੈਂ ਅੱਲਾਹ ਦੀ ਰਾਹ ਵਿਚ ਮਾਰਿਆ ਜਾਵਾਂ ਫੇਰ ਜਿਓਂਦਾ ਕੀਤਾ ਜਾਵਾ ਫੇਰ ਕਤਲ ਕੀਤਾ ਜਾਵਾ ਫੇਰ ਜਿਊਂਦਾ ਕੀਤਾ ਜਾਵਾਂ ਫੇਰ ਕਤਲ ਕੀਤਾ ਜਾਵਾਂ ਫੇਰ ਜਿਊਂਦਾ ਕੀਤਾ ਜਾਵਾਂ ਤੇ ਫੇਰ ਕਤਲ ਕੀਤਾ ਜਾਵਾਂ ਫੇਰ ਜਿਉਂਦਾ। (ਸਹੀ ਬੁਖ਼ਾਰੀ, ਹਦੀਸ: 2797)","lang":"pa","version":{"key":"punjabi_arif","direction":"ltr","language_iso_code":"pa","version":"1.0.0","last_update":1666783255,"title":"Punjabi translation","description":"Translation of the Quran meanings into Punjabi by Arif Halim, published by Darussalam"},"meta":{"transliteration":"alladhīna āmanū wahājarū wajāhadū fī sabīli al-lahi bi-amwālihim wa-anfusihim aʿẓamu darajatan ʿinda al-lahi wa-ulāika humu al-fāizūna ","translations":["Those who","believed","and emigrated","and strove","in","(the) way","(of) Allah","with their wealth","and their lives","(are) greater","(in) rank","near","Allah","And those ","they","(are) the successful","(20)"],"transliterationArr":["alladhīna","āmanū","wahājarū","wajāhadū","fī","sabīli","al-lahi","bi-amwālihim","wa-anfusihim","aʿẓamu","darajatan","ʿinda","al-lahi","wa-ulāika","humu","al-fāizūna",null],"verseTiming":[[1,0,1270],[2,1270,2670],[3,2670,4040],[4,4040,5370],[5,5370,5840],[6,5840,7140],[7,7140,7820],[8,7820,9650],[9,9650,11790],[10,11790,12690],[11,12690,13800],[12,13800,15160],[13,15160,18690],[14,18690,21710],[15,21710,22140],[16,22140,25060],[17,25060,27215]]}}