{"name":"11:107","price":"ಭೂಮ್ಯಾಕಾಶಗಳು ಅಸ್ತಿತ್ವದಲ್ಲಿರುವ ತನಕ[1] ಅವರು ಅದರಲ್ಲಿ ಶಾಶ್ವತವಾಗಿ ವಾಸಿಸುತ್ತಾರೆ. ನಿಮ್ಮ ಪರಿಪಾಲಕನು (ಅಲ್ಲಾಹು) ಇಚ್ಛಿಸಿದವರ ಹೊರತು.[2] ನಿಶ್ಚಯವಾಗಿಯೂ ನಿಮ್ಮ ಪರಿಪಾಲಕನು (ಅಲ್ಲಾಹು) ಅವನು ಬಯಸುವುದನ್ನು ಕಾರ್ಯರೂಪಕ್ಕೆ ತರುತ್ತಾನೆ.","arabic":"خَٰلِدِينَ فِيهَا مَا دَامَتِ ٱلسَّمَٰوَٰتُ وَٱلۡأَرۡضُ إِلَّا مَا شَآءَ رَبُّكَۚ إِنَّ رَبَّكَ فَعَّالٞ لِّمَا يُرِيدُ","category":["11 (Hud)","Hud","Surah Hud","Chapter Hud","Surah 11","Chapter 11","Hud","هود"],"ayahNumber":1580,"juzNumber":12,"footnotes":"[1] ಇದನ್ನು ಅಕ್ಷರಾರ್ಥದಲ್ಲಿ ಸ್ವೀಕರಿಸಿದ ಕೆಲವರು ಸತ್ಯನಿಷೇಧಿಗಳು ಶಾಶ್ವತವಾಗಿ ನರಕವಾಸಿಗಳಾಗುವುದಿಲ್ಲ ಎನ್ನುತ್ತಾರೆ. ಆದರೆ ಇದು ತಪ್ಪು. ಏಕೆಂದರೆ ಇಲ್ಲಿ ಇದನ್ನು ಆಲಂಕಾರಿಕ ರೂಪದಲ್ಲಿ ಹೇಳಲಾಗಿದೆ. ಅರಬ್ಬರು ತಮ್ಮ ಮಾತಿನಲ್ಲಿ “ಶಾಶ್ವತತೆ”ಯನ್ನು ಸೂಚಿಸಲು ಈ ಪ್ರಯೋಗವನ್ನು ಬಳಸುತ್ತಿದ್ದರು. ಅಂದರೆ ಭೂಮ್ಯಾಕಾಶಗಳು ಅಸ್ತಿತ್ವದಲ್ಲಿರುವ ತನಕ ನಾನು ಹೀಗೆ ಮಾಡುವುದಿಲ್ಲ ಎನ್ನುತ್ತಿದ್ದರು. ಇದೇ ಪ್ರಯೋಗವನ್ನು ಇಲ್ಲಿ ಬಳಸಲಾಗಿದೆ. ಇದರ ಇನ್ನೊಂದು ಅರ್ಥವೇನೆಂದರೆ ಇಲ್ಲಿ ಉದ್ದೇಶಿಸಿರುವುದು ಈಗ ಅಸ್ತಿತ್ವದಲ್ಲಿರುವ ಭೂಮಿ ಮತ್ತು ಇದಕ್ಕೆ ಹೊಂದಿಕೊಂಡಿರುವ ಆಕಾಶಗಳಲ್ಲ. ಬದಲಿಗೆ, ಪರಲೋಕದ ಭೂಮಿ ಮತ್ತು ಆಕಾಶಗಳಾಗಿವೆ. ಪರಲೋಕದಲ್ಲಿ ಬೇರೆಯೇ ಭೂಮ್ಯಾಕಾಶಗಳಿವೆಯೆಂದು 14:48ರಲ್ಲಿ ಸ್ಪಷ್ಟವಾಗಿ ಹೇಳಲಾಗಿದೆ. [2] ಇಲ್ಲಿ ಉದ್ದೇಶಿಸಲಾಗಿರುವುದು ಪಾಪಗಳನ್ನು ಮಾಡಿದ ಸತ್ಯವಿಶ್ವಾಸಿಗಳನ್ನಾಗಿದೆ. ಇವರಿಗೆ ಇವರ ಪಾಪಗಳ ಶಿಕ್ಷೆಯಾದ ನಂತರ ಇವರು ಸ್ವರ್ಗವನ್ನು ಪ್ರವೇಶಿಸುವರು. ಇವರು ನರಕದಲ್ಲಿ ಶಾಶ್ವತವಾಗಿ ಉಳಿಯುವುದಿಲ್ಲ.","lang":"kn","version":{"key":"kannada_hamza","direction":"ltr","language_iso_code":"kn","version":"1.0.3","last_update":1710623781,"title":"Kannada translation","description":"Translation of the meanings of the Noble Qur’an into the Kannada language, translated by Muhammad Hamza Battur."},"meta":{"transliteration":"khālidīna fīhā mā dāmati al-samāwātu wal-arḍu illā mā shāa rabbuka inna rabbaka faʿʿālun limā yurīdu ","translations":["(Will be) abiding","therein","as long as remain","as long as remain","the heavens","and the earth","except","what your Lord wills","what your Lord wills","what your Lord wills","Indeed","your Lord","(is) All-Accomplisher","of what","He intends","(107)"],"transliterationArr":["khālidīna","fīhā","mā","dāmati","al-samāwātu","wal-arḍu","illā","mā","shāa","rabbuka","inna","rabbaka","faʿʿālun","limā","yurīdu",null],"verseTiming":[[1,0,1300],[2,1300,2270],[3,2270,2700],[4,2700,3560],[5,3560,5260],[6,5260,6260],[7,6260,7120],[8,7120,7480],[9,7480,10130],[10,10130,10970],[11,10970,12580],[12,12580,13440],[13,13440,14530],[14,14530,15410],[15,15410,18065]]}}