{"name":"16:103","price":"“ಇವನಿಗೆ (ಪ್ರವಾದಿಗೆ) ಯಾರೋ ಒಬ್ಬ ಮನುಷ್ಯ ಕಲಿಸಿಕೊಡುತ್ತಿದ್ದಾನೆ” ಎಂದು ಅವರು ಹೇಳುತ್ತಿದ್ದಾರೆಂದು ನಮಗೆ ಖಂಡಿತ ತಿಳಿದಿದೆ. ಅವರು ಉಲ್ಲೇಖಿಸುವ ಆ ವ್ಯಕ್ತಿಯದ್ದು ಅಜಮಿ ಭಾಷೆ. ಆದರೆ ಇದು ಸ್ಪಷ್ಟ ಅರಬ್ಬಿ ಭಾಷೆಯಲ್ಲಿದೆ.[1]","arabic":"وَلَقَدۡ نَعۡلَمُ أَنَّهُمۡ يَقُولُونَ إِنَّمَا يُعَلِّمُهُۥ بَشَرٞۗ لِّسَانُ ٱلَّذِي يُلۡحِدُونَ إِلَيۡهِ أَعۡجَمِيّٞ وَهَٰذَا لِسَانٌ عَرَبِيّٞ مُّبِينٌ","category":["16 (An-Nahl)","An-Nahl","Surah An-Nahl","Chapter An-Nahl","Nahl","Surah Nahl","Chapter Nahl","An Nahl","Surah An Nahl","Chapter An Nahl","Surah 16","Chapter 16","The Bee","النَّحل"],"ayahNumber":2004,"juzNumber":14,"footnotes":"[1] ಪ್ರವಾದಿಯವರ (ಅವರ ಮೇಲೆ ಅಲ್ಲಾಹನ ಕೃಪೆ ಮತ್ತು ಶಾಂತಿಯಿರಲಿ) ಕಾಲದಲ್ಲಿ ತೌರಾತ್ ಇಂಜೀಲ್ ಕಲಿತ ಕೆಲವು ಗುಲಾಮರಿದ್ದರು. ಅವರು ಸ್ಪಷ್ಟ ಮತ್ತು ನಿರರ್ಗಳವಾಗಿ ಅರಬ್ಬಿ ಮಾತನಾಡುತ್ತಿರಲಿಲ್ಲ. ಅವರು ನಂತರ ಇಸ್ಲಾಂ ಸ್ವೀಕರಿಸಿದರು. ಪ್ರವಾದಿಯವರು (ಅವರ ಮೇಲೆ ಅಲ್ಲಾಹನ ಕೃಪೆ ಮತ್ತು ಶಾಂತಿಯಿರಲಿ) ಇವರಿಂದ ಕಲಿತ ಮಾತುಗಳನ್ನು ಅಲ್ಲಾಹನ ವಚನಗಳಾದ ಕುರ್‌ಆನ್ ಎಂದು ಹೇಳುತ್ತಿದ್ದಾರೆಂದು ಮಕ್ಕಾದ ಸತ್ಯನಿಷೇಧಿಗಳು ಆರೋಪಿಸಿದರು. ಅವರಿಗೆ ಈ ವಚನದಲ್ಲಿ ಉತ್ತರ ನೀಡಲಾಗಿದೆ. ಅದೇನೆಂದರೆ, ನೀವು ಆರೋಪಿಸುವ ಆ ಜನರು ಶುದ್ಧ ಅರಬ್ಬಿ ಭಾಷೆ ಮಾತನಾಡುವವರಲ್ಲ. ಆದರೆ ಈ ಕುರ್‌ಆನ್ ಶುದ್ಧ ಮತ್ತು ಪರಮೋಚ್ಛ ಮಟ್ಟದ ಅರಬ್ಬಿ ಸಾಹಿತ್ಯ ಶೈಲಿಯಲ್ಲಿದೆ. ಇದರಂತಿರುವ ಒಂದು ಅಧ್ಯಾಯವನ್ನು ರಚಿಸಿ ತರಲು ಸಂಪೂರ್ಣ ಅರೇಬಿಯನ್ ಪರ್ಯಾಯ ದ್ವೀಪವೇ ವಿಫಲವಾಗಿದೆ. ಅರಬ್ಬಿ ಭಾಷೆ ಮಾತನಾಡದ ಜನರಿಗೂ, ಅರಬ್ಬಿ ಭಾಷೆಯನ್ನು ನಿರರ್ಗಳವಾಗಿ ಮಾತನಾಡಲಾಗದ ಜನರಿಗೂ ಅಜಮಿ ಎಂದು ಕರೆಯಲಾಗುತ್ತದೆ.","lang":"kn","version":{"key":"kannada_hamza","direction":"ltr","language_iso_code":"kn","version":"1.0.3","last_update":1710623781,"title":"Kannada translation","description":"Translation of the meanings of the Noble Qur’an into the Kannada language, translated by Muhammad Hamza Battur."},"meta":{"transliteration":"walaqad naʿlamu annahum yaqūlūna innamā yuʿallimuhu basharun lisānu alladhī yul'ḥidūna ilayhi aʿjamiyyun wahādhā lisānun ʿarabiyyun mubīnun ","translations":["And certainly","We know","that they","say","Only","teaches him","a human being","(The) tongue","(of) the one","they refer","to him","(is) foreign","while this","(is) a language","Arabic","clear","(103)"],"transliterationArr":["walaqad","naʿlamu","annahum","yaqūlūna","innamā","yuʿallimuhu","basharun","lisānu","alladhī","yul'ḥidūna","ilayhi","aʿjamiyyun","wahādhā","lisānun","ʿarabiyyun","mubīnun",null],"verseTiming":[[1,0,980],[2,980,1790],[3,1790,3230],[4,3230,4540],[5,4540,6340],[6,6340,7860],[7,7860,9110],[8,9110,9940],[9,9940,10870],[10,10870,12090],[11,12090,12990],[12,12990,15500],[13,15500,16490],[14,16490,17530],[15,17530,18750],[16,18750,21865]]}}