{"name":"18:24","price":"“ಇನ್ ಶಾ ಅಲ್ಲಾಹ್” (ಅಲ್ಲಾಹು ಇಚ್ಛಿಸಿದರೆ ಮಾಡುತ್ತೇನೆ) ಎಂದು ಅದಕ್ಕೆ ಸೇರಿಸದೆ.[1] ನಿಮಗೆ ಅದನ್ನು ಸೇರಿಸಲು ಮರೆತುಹೋದರೆ ನೆನಪಾದಾಗ ನಿಮ್ಮ ಪರಿಪಾಲಕನನ್ನು (ಅಲ್ಲಾಹನನ್ನು)  ಸ್ಮರಿಸಿರಿ. “ಸನ್ಮಾರ್ಗಕ್ಕೆ ಇದಕ್ಕಿಂತಲೂ ಹೆಚ್ಚು ಹತ್ತಿರವಾಗಿರುವ ಮಾತಿಗೆ ನನ್ನ ಪರಿಪಾಲಕನು (ಅಲ್ಲಾಹು) ನನ್ನನ್ನು ಮುನ್ನಡೆಸುವನೆಂದು ನನಗೆ ಸಂಪೂರ್ಣ ಭರವಸೆಯಿದೆ” ಎಂದು ಹೇಳಿರಿ.","arabic":"إِلَّآ أَن يَشَآءَ ٱللَّهُۚ وَٱذۡكُر رَّبَّكَ إِذَا نَسِيتَ وَقُلۡ عَسَىٰٓ أَن يَهۡدِيَنِ رَبِّي لِأَقۡرَبَ مِنۡ هَٰذَا رَشَدٗا","category":["18 (Al-Kahf)","Al-Kahf","Surah Al-Kahf","Chapter Al-Kahf","Kahf","Surah Kahf","Chapter Kahf","Al Kahf","Surah Al Kahf","Chapter Al Kahf","Surah 18","Chapter 18","The Cave","الكَهف"],"ayahNumber":2164,"juzNumber":15,"footnotes":"[1] ಒಮ್ಮೆ ಯಹೂದಿಗಳು ಪ್ರವಾದಿ ಮುಹಮ್ಮದರ (ಅವರ ಮೇಲೆ ಅಲ್ಲಾಹನ ಕೃಪೆ ಮತ್ತು ಶಾಂತಿಯಿರಲಿ) ಬಳಿಗೆ ಬಂದು ಮೂರು ಪ್ರಶ್ನೆಗಳನ್ನು ಕೇಳಿದರು. ಆತ್ಮದ ನಿಜಸ್ಥಿತಿಯ ಬಗ್ಗೆ, ಗುಹಾವಾಸಿಗಳ ಬಗ್ಗೆ ಮತ್ತು ದುಲ್-ಕರ್ನೈನ್ ಬಗ್ಗೆ. ಪ್ರವಾದಿಯವರು (ಅವರ ಮೇಲೆ ಅಲ್ಲಾಹನ ಕೃಪೆ ಮತ್ತು ಶಾಂತಿಯಿರಲಿ) ದೇವವಾಣಿಯ ಮೂಲಕ ಉತ್ತರ ಬರಬಹುದೆಂಬ ನಿರೀಕ್ಷೆಯಿಂದ ನಾಳೆ ಹೇಳುತ್ತೇನೆ ಎಂದರು. ಆದರೆ 15 ದಿನಗಳ ತನಕ ಉತ್ತರ ಬರಲಿಲ್ಲ. ಕೊನೆಗೆ ಜಿಬ್ರೀಲ್ (ಅವರ ಮೇಲೆ ಶಾಂತಿಯಿರಲಿ) ಈ ಅಧ್ಯಾಯದೊಂದಿಗೆ ಬಂದರು. ಭವಿಷ್ಯದಲ್ಲಿ ಮಾಡುವ ಯಾವುದೇ ವಿಷಯದ ಬಗ್ಗೆ ಹೇಳುವಾಗ ಇನ್ ಶಾ ಅಲ್ಲಾಹ್ (ಅಲ್ಲಾಹು ಇಚ್ಛಿಸಿದರೆ ಮಾಡುತ್ತೇನೆ) ಎಂಬ ಮಾತನ್ನು ಸೇರಿಸಬೇಕೆಂದು ಇಲ್ಲಿ ಆಜ್ಞಾಪಿಸಲಾಗಿದೆ. ಹೇಳಲು ಮರೆತರೆ ನೆನಪಾದಾಗ ಹೇಳಬೇಕು.","lang":"kn","version":{"key":"kannada_hamza","direction":"ltr","language_iso_code":"kn","version":"1.0.3","last_update":1710623781,"title":"Kannada translation","description":"Translation of the meanings of the Noble Qur’an into the Kannada language, translated by Muhammad Hamza Battur."},"meta":{"transliteration":"illā an yashāa al-lahu wa-udh'kur rabbaka idhā nasīta waqul ʿasā an yahdiyani rabbī li-aqraba min hādhā rashadan ","translations":["Except","If","Allah wills","Allah wills","And remember","your Lord","when","you forget","and say","Perhaps","[that]","will guide me","my Lord","to a nearer (way)","than","this","right way","(24)"],"transliterationArr":["illā","an","yashāa","al-lahu","wa-udh'kur","rabbaka","idhā","nasīta","waqul","ʿasā","an","yahdiyani","rabbī","li-aqraba","min","hādhā","rashadan",null],"verseTiming":[[1,0,2130],[2,2130,2370],[3,2370,5360],[4,5360,8160],[5,8160,8890],[6,8890,9880],[7,9880,10490],[8,10490,11390],[9,11390,11900],[10,11900,14010],[11,14010,14500],[12,14500,15940],[13,15940,16780],[14,16780,17920],[15,17920,18560],[16,18560,18960],[17,18960,20475]]}}