{"name":"18:60","price":"ಮೂಸಾ ತನ್ನ ಸೇವಕನೊಡನೆ ಹೇಳಿದ ಸಂದರ್ಭ: “ಎರಡು ಕಡಲುಗಳ ಸಂಗಮ ಸ್ಥಳವನ್ನು ತಲುಪುವ ತನಕ ನಾನು ನಡೆಯುತ್ತಲೇ ಇರುವೆನು. ಅದಕ್ಕಾಗಿ ದೀರ್ಘ ಸಮಯ ಪ್ರಯಾಣ ಮಾಡಬೇಕಾಗಿ ಬಂದರೂ ಸಹ.”[1]","arabic":"وَإِذۡ قَالَ مُوسَىٰ لِفَتَىٰهُ لَآ أَبۡرَحُ حَتَّىٰٓ أَبۡلُغَ مَجۡمَعَ ٱلۡبَحۡرَيۡنِ أَوۡ أَمۡضِيَ حُقُبٗا","category":["18 (Al-Kahf)","Al-Kahf","Surah Al-Kahf","Chapter Al-Kahf","Kahf","Surah Kahf","Chapter Kahf","Al Kahf","Surah Al Kahf","Chapter Al Kahf","Surah 18","Chapter 18","The Cave","الكَهف"],"ayahNumber":2200,"juzNumber":15,"footnotes":"[1] ಒಮ್ಮೆ ಮೂಸಾರೊಡನೆ (ಅವರ ಮೇಲೆ ಶಾಂತಿಯಿರಲಿ) ಒಬ್ಬ ವ್ಯಕ್ತಿ ಪ್ರಶ್ನೆ ಕೇಳಿದಾಗ ಮೂಸಾ (ಅವರ ಮೇಲೆ ಶಾಂತಿಯಿರಲಿ) ಹೇಳಿದರು: “ಈಗ ಜಗತ್ತಿನಲ್ಲಿ ನನಗಿಂತಲೂ ಹೆಚ್ಚು ಜ್ಞಾನವಿರುವವರು ಯಾರೂ ಇಲ್ಲ.” ಅವರ ಈ ಮಾತು ಅಲ್ಲಾಹನಿಗೆ ಇಷ್ಟವಾಗಲಿಲ್ಲ. ಅಲ್ಲಾಹು ದೇವವಾಣಿಯ ಮೂಲಕ ಮೂಸಾರೊಡನೆ (ಅವರ ಮೇಲೆ ಶಾಂತಿಯಿರಲಿ) ಹೇಳಿದನು: “ನಿಮಗಿಂತ ಹೆಚ್ಚು ಜ್ಞಾನವಿರುವ ವ್ಯಕ್ತಿಯಿದ್ದಾರೆ.” ಮೂಸಾ ಹೇಳಿದರು: “ಅವರನ್ನು ನನಗೆ ತೋರಿಸು. ನಾನು ಅವರನ್ನು ಭೇಟಿಯಾಗಬೇಕು.” ಅಲ್ಲಾಹು ಹೇಳಿದನು: “ಅವರು ಎರಡು ಕಡಲುಗಳ ಸಂಗಮ ಸ್ಥಳದಲ್ಲಿದ್ದಾರೆ.” ಅಲ್ಲಾಹು ತಿಳಿಸಿದಂತೆ ಮೂಸಾ (ಅವರ ಮೇಲೆ ಶಾಂತಿಯಿರಲಿ) ಒಂದು ಮೀನನ್ನು ತೆಗೆದುಕೊಂಡು ಹೋದರು. ಅದು ಬುಟ್ಟಿಯಿಂದ ನೆಗೆದು ಅಪ್ರತ್ಯಕ್ಷವಾಗುವ ಸ್ಥಳದಲ್ಲಿ ಆ ವ್ಯಕ್ತಿ ಸಿಗುತ್ತಾರೆಂದು ಅಲ್ಲಾಹು ದೇವವಾಣಿಯ ಮೂಲಕ ತಿಳಿಸಿದ್ದನು.","lang":"kn","version":{"key":"kannada_hamza","direction":"ltr","language_iso_code":"kn","version":"1.0.3","last_update":1710623781,"title":"Kannada translation","description":"Translation of the meanings of the Noble Qur’an into the Kannada language, translated by Muhammad Hamza Battur."},"meta":{"transliteration":"wa-idh qāla mūsā lifatāhu lā abraḥu ḥattā ablugha majmaʿa al-baḥrayni aw amḍiya ḥuquban ","translations":["And when","said","Musa","to his boy","Not","I will cease","until","I reach","the junction","(of) the two seas","or","I continue","(for) a long period","(60)"],"transliterationArr":["wa-idh","qāla","mūsā","lifatāhu","lā","abraḥu","ḥattā","ablugha","majmaʿa","al-baḥrayni","aw","amḍiya","ḥuquban",null],"verseTiming":[[1,0,720],[2,720,1475],[3,1475,2165],[4,2165,3429],[5,3429,3895],[6,3895,6197],[7,6197,8671],[8,8671,9584],[9,9584,10281],[10,10281,11485],[11,11485,12025],[12,12025,12843],[13,12843,13898]]}}