{"name":"21:79","price":"ನಾವು ಸುಲೈಮಾನರಿಗೆ ಈ ಪ್ರಕರಣವು ಸರಿಯಾಗಿ ಅರ್ಥವಾಗುವಂತೆ ಮಾಡಿದೆವು.[1] ಅವರಿಬ್ಬರಿಗೂ ನಾವು ತೀರ್ಪುಗಾರಿಕೆ ಮತ್ತು ಜ್ಞಾನವನ್ನು ನೀಡಿದ್ದೆವು. ದಾವೂದರೊಂದಿಗೆ ಸ್ತುತಿಕೀರ್ತನೆ ಮಾಡಲು ನಾವು ಪರ್ವತಗಳನ್ನು ಮತ್ತು ಪಕ್ಷಿಗಳನ್ನು ಅವರಿಗೆ ಅಧೀನಗೊಳಿಸಿದೆವು. ನಾವು (ಅದನ್ನೆಲ್ಲಾ) ಮಾಡುವವರಾಗಿದ್ದೆವು.","arabic":"فَفَهَّمۡنَٰهَا سُلَيۡمَٰنَۚ وَكُلًّا ءَاتَيۡنَا حُكۡمٗا وَعِلۡمٗاۚ وَسَخَّرۡنَا مَعَ دَاوُۥدَ ٱلۡجِبَالَ يُسَبِّحۡنَ وَٱلطَّيۡرَۚ وَكُنَّا فَٰعِلِينَ","category":["21 (Al-Anbiya)","Al-Anbiya","Surah Al-Anbiya","Chapter Al-Anbiya","Anbiya","Surah Anbiya","Chapter Anbiya","Al Anbiya","Surah Al Anbiya","Chapter Al Anbiya","Surah 21","Chapter 21","The Prophets","الأنبيَاء"],"ayahNumber":2562,"juzNumber":17,"footnotes":"[1] ಒಬ್ಬ ವ್ಯಕ್ತಿಯ ಹೊಲಕ್ಕೆ ಇನ್ನೊಬ್ಬ ವ್ಯಕ್ತಿಯ ಮೇಕೆಗಳು ಹೊಕ್ಕು ಅಲ್ಲಿದ್ದ ಬೆಳೆಗಳನ್ನೆಲ್ಲಾ ನಾಶ ಮಾಡಿದ್ದವು. ಈ ಪ್ರಕರಣದ ಬಗ್ಗೆ ದಾವೂದರಿಗೆ (ಅವರ ಮೇಲೆ ಶಾಂತಿಯಿರಲಿ) ದೂರು ಬಂದಾಗ, ಮೇಕೆಗಳ ಯಜಮಾನ ಮೇಕೆಗಳನ್ನು ಬೆಳೆಗಳನ್ನು ನಾಶ ಮಾಡಿದ್ದಕ್ಕೆ ಪರಿಹಾರವಾಗಿ ಹೊಲದ ಯಜಮಾನನಿಗೆ ನೀಡಬೇಕೆಂದು ಅವರು ತೀರ್ಪು ನೀಡಿದರು. ಆದರೆ ಸುಲೈಮಾನರು (ಅವರ ಮೇಲೆ ಶಾಂತಿಯಿರಲಿ) ನೀಡಿದ ತೀರ್ಪು ಬೇರೆ ರೀತಿಯಲ್ಲಿತ್ತು. ಒಂದು ಅವಧಿಯವರೆಗೆ ಮೇಕೆಗಳ ಯಜಮಾನ ಮೇಕೆಗಳನ್ನು ಹೊಲದ ಯಜಮಾನನಿಗೆ ಮತ್ತು ಹೊಲದ ಯಜಮಾನ ಹೊಲವನ್ನು ಮೇಕೆಗಳ ಯಜಮಾನನಿಗೆ ಕೊಡಬೇಕು. ಆ ಅವಧಿಯ ತನಕ ಹೊಲದ ಯಜಮಾನ ಮೇಕೆಗಳಿಂದ ಉಪಯೋಗ ಪಡೆಯಬೇಕು. ಅಷ್ಟರಲ್ಲಿ ಮೇಕೆಗಳ ಯಜಮಾನ ಹೊಲವನ್ನು ದುರಸ್ತಿಗೊಳಿಸಿ ಮೊದಲು ಹೇಗಿತ್ತೋ ಅದೇ ರೀತಿಯಲ್ಲಿ ಮರಳಿಸಬೇಕು. ಇದರಿಂದ ಹೊಲದ ಯಜಮಾನನಿಗೆ ಅಥವಾ ಮೇಕೆಗಳ ಯಜಮಾನನಿಗೆ ನಷ್ಟವಿಲ್ಲ. ಹೊಲವೂ ದುರಸ್ತಿಯಾಗುತ್ತದೆ, ಮೇಕೆಗಳೂ ಮರಳಿ ಸಿಗುತ್ತವೆ.","lang":"kn","version":{"key":"kannada_hamza","direction":"ltr","language_iso_code":"kn","version":"1.0.3","last_update":1710623781,"title":"Kannada translation","description":"Translation of the meanings of the Noble Qur’an into the Kannada language, translated by Muhammad Hamza Battur."},"meta":{"transliteration":"fafahhamnāhā sulaymāna wakullan ātaynā ḥuk'man waʿil'man wasakharnā maʿa dāwūda al-jibāla yusabbiḥ'na wal-ṭayra wakunnā fāʿilīna ","translations":["And We gave understanding of it","(to) Sulaiman","and (to) each","We gave","judgment","and knowledge","And We subjected","with","Dawud","the mountains","(to) glorify Our praises","and the birds","And We were","the Doers","(79)"],"transliterationArr":["fafahhamnāhā","sulaymāna","wakullan","ātaynā","ḥuk'man","waʿil'man","wasakharnā","maʿa","dāwūda","al-jibāla","yusabbiḥ'na","wal-ṭayra","wakunnā","fāʿilīna",null],"verseTiming":[[1,0,1790],[2,1790,4720],[3,4720,5680],[4,5680,6770],[5,6770,8560],[6,8560,10000],[7,10000,11370],[8,11370,11800],[9,11800,12770],[10,12770,13850],[11,13850,15060],[12,15060,16120],[13,16120,17800],[14,17800,20165]]}}