{"name":"2:144","price":"ನಿಮ್ಮ ಮುಖವು ಪದೇ ಪದೇ ಆಕಾಶದ ಕಡೆಗೆ ತಿರುಗುವುದನ್ನು ನಾವು ನೋಡುತ್ತಿದ್ದೇವೆ. ಆದ್ದರಿಂದ ಈಗ ನಾವು ನಿಮ್ಮನ್ನು ನೀವು ಇಷ್ಟಪಡುವ ಕಿಬ್ಲದ ಕಡೆಗೆ ತಿರುಗಿಸುತ್ತೇವೆ.[1] ನೀವು ನಿಮ್ಮ ಮುಖವನ್ನು ಮಸ್ಜಿದುಲ್ ಹರಾಮ್‍ನ ಕಡೆಗೆ ತಿರುಗಿಸಿರಿ; ಮತ್ತು ನೀವು (ಮುಸ್ಲಿಮರು) ಎಲ್ಲೇ ಇದ್ದರೂ ನಿಮ್ಮ ಮುಖಗಳನ್ನು ಕೂಡ ಅದರ ಕಡೆಗೆ ತಿರುಗಿಸಿರಿ. ನಿಶ್ಚಯವಾಗಿಯೂ, ಇದು ನಿಮ್ಮ ಪರಿಪಾಲಕನ (ಅಲ್ಲಾಹನ) ಕಡೆಯ ಸತ್ಯವೆಂದು ಗ್ರಂಥ ನೀಡಲಾದವರಿಗೆ ಚೆನ್ನಾಗಿ ತಿಳಿದಿದೆ.[2] ಅವರು ಮಾಡುತ್ತಿರುವ ಕರ್ಮಗಳ ಕುರಿತು ಅಲ್ಲಾಹು ತಿಳಿಯದವನಲ್ಲ.","arabic":"قَدۡ نَرَىٰ تَقَلُّبَ وَجۡهِكَ فِي ٱلسَّمَآءِۖ فَلَنُوَلِّيَنَّكَ قِبۡلَةٗ تَرۡضَىٰهَاۚ فَوَلِّ وَجۡهَكَ شَطۡرَ ٱلۡمَسۡجِدِ ٱلۡحَرَامِۚ وَحَيۡثُ مَا كُنتُمۡ فَوَلُّواْ وُجُوهَكُمۡ شَطۡرَهُۥۗ وَإِنَّ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ لَيَعۡلَمُونَ أَنَّهُ ٱلۡحَقُّ مِن رَّبِّهِمۡۗ وَمَا ٱللَّهُ بِغَٰفِلٍ عَمَّا يَعۡمَلُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":151,"juzNumber":2,"footnotes":"[1] ಪ್ರವಾದಿಯವರು (ಅವರ ಮೇಲೆ ಅಲ್ಲಾಹನ ಕೃಪೆ ಮತ್ತು ಶಾಂತಿಯಿರಲಿ) ಮಕ್ಕಾದಿಂದ ಮದೀನಕ್ಕೆ ವಲಸೆ ಬಂದಾಗ, ಸುಮಾರು ಒಂದು ತಿಂಗಳ ಕಾಲ ಬೈತುಲ್ ಮುಕದ್ದಿಸ್‌ಗೆ ಅಭಿಮುಖವಾಗಿ ನಿಂತು ನಮಾಝ್ ನಿರ್ವಹಿಸುವುದನ್ನು ಮುಂದುವರಿಸಿದರು. ಅವರು ಕಾಬಾಲಯಕ್ಕೆ ತಿರುಗಿ ನಿಂತು ನಮಾಝ್ ನಿರ್ವಹಿಸಲು ಬಯಸುತ್ತಿದ್ದರು. ಅದಕ್ಕಾಗಿ ಅವರು ಪ್ರಾರ್ಥಿಸುತ್ತಿದ್ದರು ಮತ್ತು ಯಾವುದಾದರೂ ಸಂದೇಶ ಬರಬಹುದೇ ಎಂದು ಪದೇ ಪದೇ ಆಕಾಶದ ಕಡೆಗೆ ನೋಡುತ್ತಿದ್ದರು. ಕೊನೆಗೆ ಅಲ್ಲಾಹು ಕಿಬ್ಲ ಬದಲಾವಣೆಯ ಬಗ್ಗೆ ವಚನವನ್ನು ಅವತೀರ್ಣಗೊಳಿಸಿದನು. ಪ್ರವಾದಿಯವರು (ಅವರ ಮೇಲೆ ಅಲ್ಲಾಹನ ಕೃಪೆ ಮತ್ತು ಶಾಂತಿಯಿರಲಿ) ಕಿಬ್ಲ ಬದಲಾವಣೆ ಮಾಡಿದಾಗ ಯಹೂದಿಗಳು ಮತ್ತು ಕಪಟ ವಿಶ್ವಾಸಿಗಳು ಗದ್ದಲವೆಬ್ಬಿಸಿದರು. ನಮಾಝ್ ಅಲ್ಲಾಹನ ಆರಾಧನೆಯಾಗಿದೆ ಮತ್ತು ಅಲ್ಲಾಹು ನಿಶ್ಚಯಿಸಿದ ದಿಕ್ಕಿಗೆ ತಿರುಗಿ ಅದನ್ನು ನಿರ್ವಹಿಸಬೇಕಾಗಿದೆ. ಪೂರ್ವ ಮತ್ತು ಪಶ್ಚಿಮ ದಿಕ್ಕುಗಳು ಅಲ್ಲಾಹನಿಗೆ ಸೇರಿದ್ದು. ಅವನು ಯಾವ ದಿಕ್ಕಿಗೆ ತಿರುಗಬೇಕೆಂದು ಆದೇಶಿಸಿದನೋ ಆ ದಿಕ್ಕಿಗೆ ತಿರುಗಿ ನಮಾಝ್ ನಿರ್ವಹಿಸುವುದು ದಾಸನ ಕರ್ತವ್ಯ. ಕಿಬ್ಲ ಬದಲಾವಣೆಯ ಆದೇಶ ಅಸರ್ ನಮಾಝ್‌ನ ಸಂದರ್ಭದಲ್ಲಿ ಬಂದಿತ್ತು ಮತ್ತು ಕಾಬಾಲಯಕ್ಕೆ ತಿರುಗಿ ಅಸರ್ ನಮಾಝ್ ನಿರ್ವಹಿಸಲಾಯಿತು. [2] ಅಂತಿಮ ಪ್ರವಾದಿಯ ಕಿಬ್ಲ ಕಾಬಾ ಆಗಿದೆ ಎಂದು ಯಹೂದಿಗಳ ಗ್ರಂಥದಲ್ಲಿ ಸ್ಪಷ್ಟ ಸೂಚನೆಗಳಿದ್ದವು. ಅವರಿಗೆ ಇದು ಸ್ಪಷ್ಟವಾಗಿ ತಿಳಿದಿತ್ತು. ಆದರೂ ತಮ್ಮ ಅಹಂಕಾರ ಮತ್ತು ಅಸೂಯೆಯ ನಿಮಿತ್ತ ಅದನ್ನು ಸ್ವೀಕರಿಸಲು ಅವರು ಹಿಂದೇಟು ಹಾಕಿದರು.","lang":"kn","version":{"key":"kannada_hamza","direction":"ltr","language_iso_code":"kn","version":"1.0.3","last_update":1710623781,"title":"Kannada translation","description":"Translation of the meanings of the Noble Qur’an into the Kannada language, translated by Muhammad Hamza Battur."},"meta":{"transliteration":"qad narā taqalluba wajhika fī al-samāi falanuwalliyannaka qib'latan tarḍāhā fawalli wajhaka shaṭra al-masjidi al-ḥarāmi waḥaythu mā kuntum fawallū wujūhakum shaṭrahu wa-inna alladhīna ūtū al-kitāba layaʿlamūna annahu al-ḥaqu min rabbihim wamā al-lahu bighāfilin ʿammā yaʿmalūna ","translations":["Indeed","We see","(the) turning","(of) your face","towards","the heaven","So We will surely turn you","(to the) direction of prayer","you will be pleased with","So turn","your face","towards the direction","(of) Al-Masjid","Al-Haraam","and wherever","that","you are","[so] turn","your faces","(in) its direction","And indeed","those who","were given","the Book","surely know","that it","(is) the truth","from","their Lord","And not","(is) Allah","unaware","of what","they do","(144)"],"transliterationArr":["qad","narā","taqalluba","wajhika","fī","al-samāi","falanuwalliyannaka","qib'latan","tarḍāhā","fawalli","wajhaka","shaṭra","al-masjidi","al-ḥarāmi","waḥaythu","mā","kuntum","fawallū","wujūhakum","shaṭrahu","wa-inna","alladhīna","ūtū","al-kitāba","layaʿlamūna","annahu","al-ḥaqu","min","rabbihim","wamā","al-lahu","bighāfilin","ʿammā","yaʿmalūna",null],"verseTiming":[[1,0,560],[2,560,1130],[3,1130,2240],[4,2240,3010],[5,3010,3190],[6,3190,6130],[7,6130,8500],[8,8500,10250],[9,10250,11460],[10,11460,12780],[11,12780,13540],[12,13540,14110],[13,14110,15130],[14,15130,18260],[15,18260,19080],[16,19080,19380],[17,19380,20870],[18,20870,21900],[19,21900,23060],[20,23060,24390],[21,24390,25610],[22,25610,26590],[23,26590,27210],[24,27210,28270],[25,28270,29620],[26,29620,31110],[27,31110,31890],[28,31890,32140],[29,32140,33670],[30,33670,34020],[31,34020,34870],[32,34870,36050],[33,36050,37480],[34,37480,40115]]}}