{"name":"2:184","price":"ಬೆರಳೆಣಿಕೆಯ ಕೆಲವು ದಿನಗಳು ಮಾತ್ರ. ನಿಮ್ಮಲ್ಲಿ ಯಾರಾದರೂ ಅನಾರೋಗ್ಯದಲ್ಲಿದ್ದರೆ ಅಥವಾ ಪ್ರಯಾಣದಲ್ಲಿದ್ದರೆ ಅವನು ಇತರ ದಿನಗಳಲ್ಲಿ ಆ ಎಣಿಕೆಯನ್ನು ಪೂರ್ತಿ ಮಾಡಲಿ.[1] (ಉಪವಾಸ ಆಚರಿಸಲು) ಸಾಧ್ಯವಾಗುವವರು[2] (ಅದರ ಬದಲಿಗೆ) ಪ್ರಾಯಶ್ಚಿತ್ತವಾಗಿ ಒಬ್ಬ ಬಡವನಿಗೆ ಆಹಾರವನ್ನು ನೀಡಲಿ. ಯಾರಾದರೂ ಸ್ವಯಂ ಪ್ರೇರಣೆಯಿಂದ ಒಳಿತು ಮಾಡಿದರೆ ಅದು ಅವನಿಗೆ ಒಳಿತಾಗಿದೆ. ಆದರೆ ಉಪವಾಸ ಆಚರಿಸುವುದೇ ನಿಮಗೆ ಒಳ್ಳೆಯದು.[3] ನೀವು ತಿಳಿದವರಾಗಿದ್ದರೆ.","arabic":"أَيَّامٗا مَّعۡدُودَٰتٖۚ فَمَن كَانَ مِنكُم مَّرِيضًا أَوۡ عَلَىٰ سَفَرٖ فَعِدَّةٞ مِّنۡ أَيَّامٍ أُخَرَۚ وَعَلَى ٱلَّذِينَ يُطِيقُونَهُۥ فِدۡيَةٞ طَعَامُ مِسۡكِينٖۖ فَمَن تَطَوَّعَ خَيۡرٗا فَهُوَ خَيۡرٞ لَّهُۥۚ وَأَن تَصُومُواْ خَيۡرٞ لَّكُمۡ إِن كُنتُمۡ تَعۡلَمُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":191,"juzNumber":2,"footnotes":"[1] ರಮದಾನ್ ತಿಂಗಳಲ್ಲಿ ಉಪವಾಸ ಆಚರಿಸಲು ಸಾಧ್ಯವಾಗದ ರೋಗಿಗಳಿಗೆ ಮತ್ತು ಪ್ರಯಾಣಿಕರಿಗೆ ಉಪವಾಸ ತೊರೆಯಲು ಅನುಮತಿಯಿದೆ. ಅವರು ಆ ಉಪವಾಸಗಳನ್ನು ನಂತರ ನಿರ್ವಹಿಸಿದರೆ ಸಾಕು. [2] ಅಂದರೆ ಬಹಳ ಕಷ್ಟದಿಂದ ಉಪವಾಸ ಆಚರಿಸಲು ಸಾಧ್ಯವಾಗುವವರು. ಉದಾಹರಣೆಗೆ, ವಯೋವೃದ್ಧರು ಮತ್ತು ಗುಣವಾಗುವ ನಿರೀಕ್ಷೆಯಿಲ್ಲದ ಕಾಯಿಲೆಯಿಂದ ಬಳಲುವವರಿಗೆ ಉಪವಾಸ ಆಚರಿಸಲು ಕಷ್ಟವಾಗುವುದಾದರೆ ಅವರು ಉಪವಾಸ ತೊರೆದು ಪರಿಹಾರದ ರೂಪದಲ್ಲಿ ಒಬ್ಬ ಬಡವನಿಗೆ ಅನ್ನದಾನ ಮಾಡಿದರೆ ಸಾಕು. ಆದರೆ ಹೆಚ್ಚಿನ ವ್ಯಾಖ್ಯಾನಕಾರರ ಅಭಿಪ್ರಾಯ ಪ್ರಕಾರ ಉಪವಾಸ ಆಚರಿಸಲು ಸಾಧ್ಯವಾಗುವ ಎಲ್ಲರೂ ಇದರಲ್ಲಿ ಒಳಪಡುತ್ತಾರೆ. ಇಸ್ಲಾಮಿನ ಆರಂಭಕಾಲದಲ್ಲಿ ಜನರಿಗೆ ಉಪವಾಸ ಆಚರಿಸುವ ಅಭ್ಯಾಸವಿಲ್ಲದ್ದರಿಂದ ಉಪವಾಸ ಆಚರಿಸುವುದನ್ನು ತೊರೆದು ಅದರ ಬದಲಿಗೆ ಒಬ್ಬ ಬಡವನಿಗೆ ಅನ್ನದಾನ ಮಾಡುವ ರಿಯಾಯಿತಿ ನೀಡಲಾಗಿತ್ತು. ನಂತರ ಈ ರಿಯಾಯಿತಿಯನ್ನು ರದ್ದುಗೊಳಿಸಿ ಉಪವಾಸ ಆಚರಿಸಲು ಸಾಧ್ಯವಾಗುವ ಎಲ್ಲರಿಗೂ ಉಪವಾಸ ಆಚರಿಸುವುದನ್ನು ಕಡ್ಡಾಯಗೊಳಿಸಲಾಯಿತು. ಆದರೆ ವಯೋವೃದ್ದರಿಗೆ ಮತ್ತು ನಿತ್ಯ ರೋಗಿಗಳಿಗೆ ಉಪವಾಸ ಆಚರಿಸಲು ಕಷ್ಟವಾಗುವುದಾದರೆ ಅದರ ಬದಲಿಗೆ ಪರಿಹಾರ ನೀಡಬಹುದೆಂಬ ನಿಯಮವನ್ನು ಊರ್ಜಿತದಲ್ಲಿರಿಸಲಾಯಿತು. [3] ಒಂದು ಉಪವಾಸಕ್ಕೆ ಪರಿಹಾರವಾಗಿ ಒಬ್ಬ ಬಡವನಿಗೆ ಅನ್ನದಾನ ಮಾಡಬೇಕು. ಆದರೆ ಯಾರಾದರೂ ಒಬ್ಬನಿಗಿಂತ ಹೆಚ್ಚು ಬಡವರಿಗೆ ಅನ್ನದಾನ ಮಾಡುವುದಾದರೆ ಅದು ಅವರಿಗೆ ಒಳಿತಾಗಿದೆ.","lang":"kn","version":{"key":"kannada_hamza","direction":"ltr","language_iso_code":"kn","version":"1.0.3","last_update":1710623781,"title":"Kannada translation","description":"Translation of the meanings of the Noble Qur’an into the Kannada language, translated by Muhammad Hamza Battur."},"meta":{"transliteration":"ayyāman maʿdūdātin faman kāna minkum marīḍan aw ʿalā safarin faʿiddatun min ayyāmin ukhara waʿalā alladhīna yuṭīqūnahu fid'yatun ṭaʿāmu mis'kīnin faman taṭawwaʿa khayran fahuwa khayrun lahu wa-an taṣūmū khayrun lakum in kuntum taʿlamūna ","translations":["(Fasting for) days","numbered","So whoever","is","among you","sick","or","on","a journey","then a prescribed number","of","days","other","And on","those who","can afford it","a ransom","(of) feeding","a poor","And whoever","volunteers","good","then it","(is) better","for him","And to","fast","(is) better","for you","if","you","know","(184)"],"transliterationArr":["ayyāman","maʿdūdātin","faman","kāna","minkum","marīḍan","aw","ʿalā","safarin","faʿiddatun","min","ayyāmin","ukhara","waʿalā","alladhīna","yuṭīqūnahu","fid'yatun","ṭaʿāmu","mis'kīnin","faman","taṭawwaʿa","khayran","fahuwa","khayrun","lahu","wa-an","taṣūmū","khayrun","lakum","in","kuntum","taʿlamūna",null],"verseTiming":[[1,0,1440],[2,1440,4670],[3,4670,5150],[4,5150,5240],[5,5240,5930],[6,5930,6420],[7,6420,7770],[8,7770,9250],[9,9250,9580],[10,9580,10110],[11,10110,11460],[12,11460,12360],[13,12360,13360],[14,13360,14520],[15,14520,15470],[16,15470,15950],[17,15950,16820],[18,16820,18290],[19,18290,19710],[20,19710,20540],[21,20540,22870],[22,22870,24020],[23,24020,24980],[24,24980,26210],[25,26210,26700],[26,26700,27320],[27,27320,28220],[28,28220,29360],[29,29360,30320],[30,30320,31100],[31,31100,32130],[32,32130,33230],[33,33230,34550],[34,34550,37055]]}}