{"name":"2:226","price":"ತಮ್ಮ ಪತ್ನಿಯರೊಡನೆ (ಲೈಂಗಿಕ ಸಂಪರ್ಕ ಮಾಡುವುದಿಲ್ಲವೆಂದು) ಪ್ರತಿಜ್ಞೆ ಮಾಡುವವರಿಗೆ ನಾಲ್ಕು ತಿಂಗಳ ಕಾಲಾವಕಾಶವಿದೆ. ಅವರೇನಾದರೂ (ದಾಂಪತ್ಯಕ್ಕೆ) ಮರಳಿದರೆ, ನಿಶ್ಚಯವಾಗಿಯೂ ಅಲ್ಲಾಹು ಕ್ಷಮಿಸುವವನು ಮತ್ತು ಕರುಣೆ ತೋರುವವನಾಗಿದ್ದಾನೆ.[1]","arabic":"لِّلَّذِينَ يُؤۡلُونَ مِن نِّسَآئِهِمۡ تَرَبُّصُ أَرۡبَعَةِ أَشۡهُرٖۖ فَإِن فَآءُو فَإِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":233,"juzNumber":2,"footnotes":"[1] ನಾನು ಹೆಂಡತಿಯೊಂದಿಗೆ ಒಂದು ತಿಂಗಳ ಕಾಲ ಅಥವಾ ಎರಡು ತಿಂಗಳ ಕಾಲ ಸಂಬಂಧವಿಟ್ಟುಕೊಳ್ಳುವುದಿಲ್ಲವೆಂದು ಗಂಡ ಪ್ರತಿಜ್ಞೆ ಮಾಡಿ, ಆ ನಿಗದಿತ ಅವಧಿಯ ನಂತರ ಹೆಂಡತಿಯೊಂದಿಗೆ ಸಂಬಂಧ ಮುಂದುವರಿಸಿದರೆ ಆತ ಪರಿಹಾರ ನೀಡಬೇಕಾಗಿಲ್ಲ. ಆದರೆ ಆ ಅವಧಿ ಪೂರ್ಣಗೊಳ್ಳುವುದಕ್ಕೆ ಮುಂಚೆ ಅವನು ಹೆಂಡತಿಯೊಂದಿಗೆ ಸಂಬಂಧ ಸ್ಥಾಪಿಸಿದರೆ ಪರಿಹಾರ ನೀಡಬೇಕಾಗುತ್ತದೆ. ಇನ್ನು ಗಂಡ ಅವಧಿಯನ್ನು ನಿಶ್ಚಯಿಸದೆ ನಾನು ನನ್ನ ಹೆಂಡತಿಯೊಂದಿಗೆ ಸಂಬಂಧವಿಟ್ಟುಕೊಳ್ಳುವುದಿಲ್ಲ ಎಂದು ಪ್ರತಿಜ್ಞೆ ಮಾಡಿದರೆ, ಅವನಿಗೆ ನಾಲ್ಕು ತಿಂಗಳ ಕಾಲಾವಕಾಶವಿದೆ. ಅದರೊಳಗೆ ಒಂದೋ ಅವನು ಹೆಂಡತಿಯೊಂದಿಗೆ ಸಂಬಂಧವನ್ನು ಮುಂದುವರಿಸಬೇಕು ಅಥವಾ ಆಕೆಗೆ ವಿಚ್ಛೇದನೆ ನೀಡಬೇಕು. ನಾಲ್ಕು ತಿಂಗಳುಗಳಿಗಿಂತ ಹೆಚ್ಚು ಕಾಲ ಹೆಂಡತಿಯೊಂದಿಗೆ ಸಂಬಂಧ ಕಡಿಯುವುದಕ್ಕೆ ಅನುಮತಿಯಿಲ್ಲ. ಆತ ಸಂಬಂಧವನ್ನು ಮುಂದುವರಿಸುವುದಾದರೆ ಅದಕ್ಕೆ ಪರಿಹಾರ ನೀಡಬೇಕು. ಇನ್ನು ಅವನು ಸಂಬಂಧವನ್ನು ಮುಂದುವರಿಸದೆ ಮತ್ತು ವಿಚ್ಛೇದನೆಯನ್ನೂ ನೀಡದೆ, ಸಮಸ್ಯೆಯು ನ್ಯಾಯಾಲಯವನ್ನು ತಲುಪಿದರೆ, ಹೆಂಡತಿಗೆ ಅನ್ಯಾಯವಾಗದಂತೆ ನೋಡಿಕೊಳ್ಳಲು ಅವನಿಗೆ ಎರಡರಲ್ಲಿ ಒಂದನ್ನು ಆರಿಸುವಂತೆ ಒತ್ತಡ ಹೇರಲಾಗುತ್ತದೆ.","lang":"kn","version":{"key":"kannada_hamza","direction":"ltr","language_iso_code":"kn","version":"1.0.3","last_update":1710623781,"title":"Kannada translation","description":"Translation of the meanings of the Noble Qur’an into the Kannada language, translated by Muhammad Hamza Battur."},"meta":{"transliteration":"lilladhīna yu'lūna min nisāihim tarabbuṣu arbaʿati ashhurin fa-in fāū fa-inna al-laha ghafūrun raḥīmun ","translations":["For those who","swear (off)","from","their wives","(is a) waiting (of)","four","months","then if","they return ","then indeed","Allah","(is) Oft-Forgiving","Most Merciful","(226)"],"transliterationArr":["lilladhīna","yu'lūna","min","nisāihim","tarabbuṣu","arbaʿati","ashhurin","fa-in","fāū","fa-inna","al-laha","ghafūrun","raḥīmun",null],"verseTiming":[[1,0,1080],[2,1080,2080],[3,2080,2310],[4,2310,5440],[5,5440,6410],[6,6410,7350],[7,7350,7970],[8,7970,9350],[9,9350,10660],[10,10660,11940],[11,11940,13000],[12,13000,13850],[13,13850,14560],[14,14560,17045]]}}