{"name":"2:62","price":"ನಿಶ್ಚಯವಾಗಿಯೂ ಸತ್ಯವಿಶ್ವಾಸಿಗಳು, ಯಹೂದಿಗಳು, ಕ್ರೈಸ್ತರು ಅಥವಾ ಸಾಬಿಗಳು—ಇವರ ಪೈಕಿ ಅಲ್ಲಾಹನಲ್ಲಿ ಮತ್ತು ಅಂತ್ಯದಿನದಲ್ಲಿ ವಿಶ್ವಾಸವಿಟ್ಟವರು ಹಾಗೂ ಸತ್ಕರ್ಮವೆಸಗಿದವರು ಯಾರೋ, ಅವರಿಗೆ ಅವರ ಪ್ರತಿಫಲವು ಅವರ ಪರಿಪಾಲಕನ (ಅಲ್ಲಾಹನ) ಬಳಿಯಿದೆ. ಅವರಿಗೆ ಯಾವುದೇ ಭಯವಿಲ್ಲ; ಅವರು ದುಃಖಿಸುವುದೂ ಇಲ್ಲ.[1]","arabic":"إِنَّ ٱلَّذِينَ ءَامَنُواْ وَٱلَّذِينَ هَادُواْ وَٱلنَّصَٰرَىٰ وَٱلصَّٰبِـِٔينَ مَنۡ ءَامَنَ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِ وَعَمِلَ صَٰلِحٗا فَلَهُمۡ أَجۡرُهُمۡ عِندَ رَبِّهِمۡ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":69,"juzNumber":1,"footnotes":"[1] ಕೆಲವರು ಈ ವಚನವನ್ನು ತಪ್ಪಾಗಿ ಅರ್ಥಮಾಡಿಕೊಂಡು 'ಧರ್ಮಗಳ ಏಕತೆ' ಎಂಬ ಹೊಸ ಸಿದ್ಧಾಂತವನ್ನು ಸ್ಥಾಪಿಸಿದ್ದಾರೆ. ಅವರ ಪ್ರಕಾರ ಇಸ್ಲಾಂ ಧರ್ಮದಲ್ಲಿ ವಿಶ್ವಾಸವಿಡುವುದು ಕಡ್ಡಾಯವಲ್ಲ. ಯಾವುದೇ ಧರ್ಮದಲ್ಲಿದ್ದು ಏಕದೇವನನ್ನು ಆರಾಧಿಸಿ ಒಳಿತು ಮಾಡಿದರೆ ಅವರಿಗೆ ಮೋಕ್ಷ ಸಿಗುತ್ತದೆ. ಇದು ಅತ್ಯಂತ ಹೊಲಸು ಸಿದ್ಧಾಂತವಾಗಿದ್ದು ಕುರ್‌ಆನಿನ ಬೋಧನೆಗಳಿಗೆ ವಿರುದ್ಧವಾಗಿದೆ. ಈ ವಚನದ ನಿಜವಾದ ಅರ್ಥವೇನೆಂದರೆ, ಮೇಲಿನ ವಚನಗಳಲ್ಲಿ ಯಹೂದಿಗಳ ಅವಿಧೇಯತೆ, ಅಹಂಕಾರ ಮತ್ತು ಅತಿರೇಕಗಳ ಬಗ್ಗೆ  ಪ್ರಸ್ತಾಪಿಸಿ, ಅವರಿಗೆ ನೀಡಲಾದ ಶಿಕ್ಷೆಯ ಬಗ್ಗೆಯೂ ಪ್ರಸ್ತಾಪಿಸಲಾದಾಗ, ಸ್ವಾಭಾವಿಕವಾಗಿ ಒಂದು ಪ್ರಶ್ನೆ ಉದ್ಭವವಾಗುತ್ತದೆ. ಹಾಗಾದರೆ, ಯಹೂದಿಗಳಲ್ಲಿ ಒಳ್ಳೆಯವರು ಯಾರೂ ಇರಲಿಲ್ಲವೇ? ಇದ್ದರೆ ಅವರಿಗೆ ಅಲ್ಲಾಹು ಏನು ಪ್ರತಿಫಲ ನೀಡಿದ್ದಾನೆ? ಇದಕ್ಕೆ ಉತ್ತರವಾಗಿ, ಈ ವಚನ ಅವತೀರ್ಣವಾಗಿದೆ. ಅಂದರೆ, ಯಹೂದಿಗಳಲ್ಲಿ ಮಾತ್ರವಲ್ಲ, ಕ್ರೈಸ್ತರು, ಸಾಬಿಗಳು ಮುಂತಾದವರಲ್ಲಿಯೂ ಪ್ರವಾದಿ ಮುಹಮ್ಮದ್ (ಅವರ ಮೇಲೆ ಅಲ್ಲಾಹನ ಕೃಪೆ ಮತ್ತು ಶಾಂತಿಯಿರಲಿ) ರವರ ಆಗಮನಕ್ಕೆ ಮುಂಚೆ ಅಲ್ಲಾಹನಲ್ಲಿ ಮತ್ತು ಪರಲೋಕದಲ್ಲಿ ವಿಶ್ವಾಸವಿಟ್ಟು, ಸತ್ಕಾರ್ಯಗಳನ್ನು ಮಾಡಿದ್ದರೆ ಅವರೆಲ್ಲರೂ ಮೋಕ್ಷ ಪಡೆಯುತ್ತಾರೆ. ಅದೇ ರೀತಿ, ಈಗ ಮುಹಮ್ಮದ್ (ಅವರ ಮೇಲೆ ಅಲ್ಲಾಹನ ಕೃಪೆ ಮತ್ತು ಶಾಂತಿಯಿರಲಿ) ರವರ ಸಂದೇಶದಲ್ಲಿ ವಿಶ್ವಾಸವಿಡುವವರು ಕೂಡ ಅಲ್ಲಾಹನಲ್ಲಿ ಮತ್ತು ಪರಲೋಕದಲ್ಲಿ ಸರಿಯಾಗಿ ವಿಶ್ವಾಸವಿಟ್ಟು ಸತ್ಕಾರ್ಯಗಳನ್ನು ಮಾಡಿದರೆ ಅವರು ಕೂಡ ಮೋಕ್ಷ ಪಡೆಯುತ್ತಾರೆ. [ನೋಡಿ: 3:19, 3:85]","lang":"kn","version":{"key":"kannada_hamza","direction":"ltr","language_iso_code":"kn","version":"1.0.3","last_update":1710623781,"title":"Kannada translation","description":"Translation of the meanings of the Noble Qur’an into the Kannada language, translated by Muhammad Hamza Battur."},"meta":{"transliteration":"inna alladhīna āmanū wa-alladhīna hādū wal-naṣārā wal-ṣābiīna man āmana bil-lahi wal-yawmi al-ākhiri waʿamila ṣāliḥan falahum ajruhum ʿinda rabbihim walā khawfun ʿalayhim walā hum yaḥzanūna ","translations":["Indeed","those who","believed","and those who","became Jews","and the Christians","and the Sabians ","who","believed","in Allah","and the Day","[the] Last","and did","righteous deeds","so for them","their reward","(is) with","their Lord","and no","fear","on them","and not","they","will grieve","(62)"],"transliterationArr":["inna","alladhīna","āmanū","wa-alladhīna","hādū","wal-naṣārā","wal-ṣābiīna","man","āmana","bil-lahi","wal-yawmi","al-ākhiri","waʿamila","ṣāliḥan","falahum","ajruhum","ʿinda","rabbihim","walā","khawfun","ʿalayhim","walā","hum","yaḥzanūna",null],"verseTiming":[[1,0,1290],[2,1290,2220],[3,2220,3270],[4,3270,4280],[5,4280,5150],[6,5150,7340],[7,7340,8820],[8,8820,9160],[9,9160,9850],[10,9850,10950],[11,10950,11850],[12,11850,12780],[13,12780,13470],[14,13470,15050],[15,15050,15760],[16,15760,17150],[17,17150,17880],[18,17880,18820],[19,18820,19980],[20,19980,20930],[21,20930,21450],[22,21450,22180],[23,22180,23190],[24,23190,23780],[25,23780,24130],[26,24130,26865]]}}