{"name":"33:6","price":"ಸತ್ಯವಿಶ್ವಾಸಿಗಳಿಗೆ ಸ್ವಯಂ ಅವರಿಗಿಂತಲೂ ಹೆಚ್ಚು ಪ್ರವಾದಿಯವರು ಆಪ್ತರಾಗಿದ್ದಾರೆ.[1] ಅವರ ಪತ್ನಿಯರು ಸತ್ಯವಿಶ್ವಾಸಿಗಳ ಮಾತೆಯರಾಗಿದ್ದಾರೆ.[2] ಅಲ್ಲಾಹನ ಗ್ರಂಥದಲ್ಲಿ ಇತರ ಸತ್ಯವಿಶ್ವಾಸಿಗಳು ಮತ್ತು ಮುಹಾಜಿರರಿಗಿಂತಲೂ ಹೆಚ್ಚು ರಕ್ತ ಸಂಬಂಧಿಗಳು ಪರಸ್ಪರ ಆಪ್ತರಾಗಿದ್ದಾರೆ.[3] ಆದರೆ ನೀವು ನಿಮ್ಮ ಮಿತ್ರರೊಡನೆ ಉತ್ತಮವಾಗಿ ವರ್ತಿಸುವುದು ಇದರಿಂದ ಹೊರತಾಗಿದೆ. ಅದು ಗ್ರಂಥದಲ್ಲಿ ದಾಖಲಿಸಲಾದ ನಿಯಮವಾಗಿದೆ.","arabic":"ٱلنَّبِيُّ أَوۡلَىٰ بِٱلۡمُؤۡمِنِينَ مِنۡ أَنفُسِهِمۡۖ وَأَزۡوَٰجُهُۥٓ أُمَّهَٰتُهُمۡۗ وَأُوْلُواْ ٱلۡأَرۡحَامِ بَعۡضُهُمۡ أَوۡلَىٰ بِبَعۡضٖ فِي كِتَٰبِ ٱللَّهِ مِنَ ٱلۡمُؤۡمِنِينَ وَٱلۡمُهَٰجِرِينَ إِلَّآ أَن تَفۡعَلُوٓاْ إِلَىٰٓ أَوۡلِيَآئِكُم مَّعۡرُوفٗاۚ كَانَ ذَٰلِكَ فِي ٱلۡكِتَٰبِ مَسۡطُورٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab","Chapter Al-Ahzab","Ahzab","Surah Ahzab","Chapter Ahzab","Al Ahzab","Surah Al Ahzab","Chapter Al Ahzab","Surah 33","Chapter 33","The Combined Forces","الأحزَاب"],"ayahNumber":3539,"juzNumber":21,"footnotes":"[1] ಪ್ರವಾದಿ ಮುಹಮ್ಮದ್ (ಅವರ ಮೇಲೆ ಅಲ್ಲಾಹನ ಕೃಪೆ ಮತ್ತು ಶಾಂತಿಯಿರಲಿ) ರವರು ಸತ್ಯವಿಶ್ವಾಸಿಗಳ ಹಿತಚಿಂತಕರಾಗಿದ್ದಾರೆ. ಸತ್ಯವಿಶ್ವಾಸಿಗಳು ಅಭ್ಯುದಯ ಹೊಂದಬೇಕು ಮತ್ತು ಸ್ವರ್ಗ ಪ್ರವೇಶ ಮಾಡಬೇಕು ಎಂಬುದೇ ಅವರ ಪರಮೋಚ್ಛ ಗುರಿಯಾಗಿದೆ. ಅದಕ್ಕಾಗಿ ಅವರು ಆಹೋರಾತ್ರಿ ನಿರಂತರ ಪರಿಶ್ರಮಿಸುತ್ತಾರೆ. ಆದ್ದರಿಂದ ಸತ್ಯವಿಶ್ವಾಸಿಗಳು ಕೂಡ ಅವರನ್ನು ಅತಿಯಾಗಿ ಪ್ರೀತಿಸಬೇಕು. ಅವರಿಗಾಗಿ ಯಾವುದೇ  ತ್ಯಾಗವನ್ನು ಮಾಡಲು ಸಿದ್ಧರಾಗಬೇಕು. ಇತರೆಲ್ಲರಿಗಿಂತ ಹೆಚ್ಚು ಅವರನ್ನು ಪ್ರೀತಿಸಬೇಕು. ಅವರ ಆಜ್ಞೆಗಳನ್ನು ಪಾಲಿಸುವುದರಲ್ಲಿ ಸ್ವಲ್ಪವೂ ಹಿಂಜರಿಯಬಾರದು. [2] ಅಂದರೆ ಪ್ರವಾದಿಯವರ (ಅವರ ಮೇಲೆ ಅಲ್ಲಾಹನ ಕೃಪೆ ಮತ್ತು ಶಾಂತಿಯಿರಲಿ) ನಂತರ ಅವರ ಪತ್ನಿಯರನ್ನು ವಿವಾಹವಾಗುವ ಅನುಮತಿ ಯಾರಿಗೂ ಇಲ್ಲ. ಏಕೆಂದರೆ, ಅವರು ಗೌರವಾನ್ವಿತ ಸ್ಥಾನದಲ್ಲಿರುವವರು. ಅವರು ಸತ್ಯವಿಶ್ವಾಸಿ ಪುರುಷರಿಗೂ, ಮಹಿಳೆಯರಿಗೂ ತಾಯಂದಿರಾಗಿದ್ದಾರೆ. [3] ಮುಹಾಜಿರರು (ಮಕ್ಕಾದಿಂದ ಹಿಜ್ರ ಮಾಡಿದ ಮುಸ್ಲಿಮರು) ಮದೀನಕ್ಕೆ ವಲಸೆ ಬಂದ ಆರಂಭಕಾಲದಲ್ಲಿ ಪ್ರವಾದಿಯವರು (ಅವರ ಮೇಲೆ ಅಲ್ಲಾಹನ ಕೃಪೆ ಮತ್ತು ಶಾಂತಿಯಿರಲಿ) ಒಬ್ಬ ಮುಹಾಜಿರ್ ಮತ್ತು ಒಬ್ಬ ಅನ್ಸಾರ್ (ಮದೀನ ನಿವಾಸಿ ಮುಸ್ಲಿಂ) ನಡುವೆ ವಿಶೇಷ ಸಾಹೋದರತೆಯನ್ನು ಸ್ಥಾಪಿಸಿದ್ದರು. ಅನ್ಸಾರರು ತಮ್ಮ ಆಸ್ತಿಯಲ್ಲಿ ಮುಹಾಜಿರರಿಗೆ ಹಕ್ಕನ್ನು ನೀಡುತ್ತಿದ್ದರು. ಆದರೆ ವಾರಸು ನಿಯಮಗಳನ್ನು ವಿವರಿಸುವ ವಚನಗಳು ಅವತೀರ್ಣವಾದ ನಂತರ ವಾರೀಸು ಹಕ್ಕನ್ನು ಕೇವಲ ಸಂಬಂಧಿಕರಿಗೆ ಮಾತ್ರ ಸೀಮಿತಗೊಳಿಸಲಾಯಿತು.","lang":"kn","version":{"key":"kannada_hamza","direction":"ltr","language_iso_code":"kn","version":"1.0.3","last_update":1710623781,"title":"Kannada translation","description":"Translation of the meanings of the Noble Qur’an into the Kannada language, translated by Muhammad Hamza Battur."},"meta":{"transliteration":"al-nabiyu awlā bil-mu'minīna min anfusihim wa-azwājuhu ummahātuhum wa-ulū al-arḥāmi baʿḍuhum awlā bibaʿḍin fī kitābi al-lahi mina al-mu'minīna wal-muhājirīna illā an tafʿalū ilā awliyāikum maʿrūfan kāna dhālika fī al-kitābi masṭūran ","translations":["The Prophet","(is) closer","to the believers","than","their own selves","and his wives","(are) their mothers","And possessors","(of) relationships","some of them","(are) closer","to another","in","(the) Decree","(of) Allah","than","the believers","and the emigrants","except","that","you do","to","your friends","a kindness","That is","That is","in","the Book","written","(6)"],"transliterationArr":["al-nabiyu","awlā","bil-mu'minīna","min","anfusihim","wa-azwājuhu","ummahātuhum","wa-ulū","al-arḥāmi","baʿḍuhum","awlā","bibaʿḍin","fī","kitābi","al-lahi","mina","al-mu'minīna","wal-muhājirīna","illā","an","tafʿalū","ilā","awliyāikum","maʿrūfan","kāna","dhālika","fī","al-kitābi","masṭūran",null],"verseTiming":[[1,0,1880],[2,1880,2660],[3,2660,4220],[4,4220,4540],[5,4540,7180],[6,7180,10130],[7,10130,12740],[8,12740,13320],[9,13320,14510],[10,14510,15420],[11,15420,16160],[12,16160,17230],[13,17230,18300],[14,18300,19170],[15,19170,19910],[16,19910,20240],[17,20240,21660],[18,21660,23290],[19,23290,24260],[20,24260,26870],[21,26870,27870],[22,27870,30660],[23,30660,32610],[24,32610,35810],[25,35810,37960],[26,37960,38510],[27,38510,39310],[28,39310,39530],[29,39530,40500],[30,40500,42235]]}}