{"name":"3:137","price":"ನಿಮಗಿಂತ ಮುಂಚೆಯೂ ಇಂತಹ ಘಟನೆಗಳು ಗತಿಸಿ ಹೋಗಿವೆ. ಆದ್ದರಿಂದ ನೀವು ಭೂಮಿಯಲ್ಲಿ ಸಂಚರಿಸಿ ಸತ್ಯನಿಷೇಧಿಗಳ ಅಂತ್ಯವು ಹೇಗಿತ್ತೆಂದು ನೋಡಿರಿ.[1]","arabic":"قَدۡ خَلَتۡ مِن قَبۡلِكُمۡ سُنَنٞ فَسِيرُواْ فِي ٱلۡأَرۡضِ فَٱنظُرُواْ كَيۡفَ كَانَ عَٰقِبَةُ ٱلۡمُكَذِّبِينَ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":430,"juzNumber":4,"footnotes":"[1] ಉಹುದ್ ಯುದ್ಧದ ಸಂದರ್ಭ ಪ್ರವಾದಿಯವರು (ಅವರ ಮೇಲೆ ಅಲ್ಲಾಹನ ಕೃಪೆ ಮತ್ತು ಶಾಂತಿಯಿರಲಿ) ಅಬ್ದುಲ್ಲಾ ಬಿನ್ ಜುಬೈರ್ ರವರ ನಾಯಕತ್ವದಲ್ಲಿ ಬಿಲ್ಲುಗಾರರ ಸೇನೆಯನ್ನು ಒಂದು ಗುಡ್ಡದ ಮೇಲೆ ನಿಲ್ಲಿಸಿದ್ದರು. ಯುದ್ಧದಲ್ಲಿ ಗೆದ್ದರೂ ಸೋತರೂ ನೀವು ಗುಡ್ಡದಿಂದ ಇಳಿದು ಬರಬಾರದೆಂದು ಅವರಿಗೆ ಕಟ್ಟಾಜ್ಞೆ ನೀಡಿದ್ದರು. ಆದರೆ ಯುದ್ಧದ ಆರಂಭದಲ್ಲಿ ಮುಸಲ್ಮಾನರು ವೈರಿಗಳನ್ನು ಹಿಮ್ಮೆಟ್ಟಿಸುವದರಲ್ಲಿ ಯಶಸ್ವಿಯಾಗಿ ಅವರು ಬಿಟ್ಟು ಹೋದ ಯುದ್ಧ ಸಾಮಗ್ರಿಗಳನ್ನು ಸಂಗ್ರಹಿಸಲು ತೊಡಗಿದಾಗ ಗುಡ್ಡ ಮೇಲಿದ್ದ ಬಿಲ್ಲುಗಾರರಲ್ಲಿ ಭಿನ್ನಮತ ಉಂಟಾಯಿತು. ಕೆಲವರು ಹೇಳಿದರು: ಯುದ್ಧದಲ್ಲಿ ಗೆಲ್ಲುವವರೆಗೆ ಮಾತ್ರ ಇಲ್ಲಿ ನಿಲ್ಲಲು ನಮಗೆ ಆಜ್ಞಾಪಿಸಲಾಗಿದೆ. ನಾವು ಈಗ ಗೆದ್ದಿದ್ದೇವೆ ಮತ್ತು ವೈರಿಗಳು ದಿಕ್ಕಾಪಾಲಾಗಿ ಓಡಿದ್ದಾರೆ. ಆದ್ದರಿಂದ ನಾವು ಇನ್ನು ಇಲ್ಲಿ ನಿಲ್ಲಬೇಕಾಗಿಲ್ಲ. ಕೇವಲ ಹತ್ತು ಜನರ ಹೊರತು ಉಳಿದವರೆಲ್ಲರೂ ಗುಡ್ಡದಿಂದ ಇಳಿದು ಹೋದರು. ಗುಡ್ಡದಲ್ಲಿ ಬಿಲ್ಲುಗಾರರು ಇಲ್ಲದಿರುವುದನ್ನು ನೋಡಿದ ವೈರಿಗಳನ್ನು ಆ ಅವಕಾಶವನ್ನು ಚೆನ್ನಾಗಿ ಬಳಸಿ ಅಶ್ವಸೇನೆಯ ಮೂಲಕ ಹಿಂಬದಿಯಿಂದ ಆಕ್ರಮಣ ಮಾಡಿದರು. ಈ ಅನಿರೀಕ್ಷಿತ ಆಕ್ರಮಣದಿಂದ ಮುಸ್ಲಿಮರಿಗೆ ಅನೇಕ ನಾಶ-ನಷ್ಟಗಳು ಸಂಭವಿಸಿದವು. ಈ ವಚನದಲ್ಲಿ ಹೇಳುವುದೇನೆಂದರೆ, ಸತ್ಯನಿಷೇಧಿಗಳಿಗೆ ಕೆಲವೊಮ್ಮೆ ಗೆಲುವು ಸಿಗಬಹುದು. ಆದರೆ ಅದರಿಂದ ನೀವು ಧೃತಿಗೆಡಬಾರದು. ಏಕೆಂದರೆ ಅಂತಿಮ ವಿಜಯವು ಸತ್ಯವಿಶ್ವಾಸಿಗಳಿಗೇ ಆಗಿದೆ.","lang":"kn","version":{"key":"kannada_hamza","direction":"ltr","language_iso_code":"kn","version":"1.0.3","last_update":1710623781,"title":"Kannada translation","description":"Translation of the meanings of the Noble Qur’an into the Kannada language, translated by Muhammad Hamza Battur."},"meta":{"transliteration":"qad khalat min qablikum sunanun fasīrū fī al-arḍi fa-unẓurū kayfa kāna ʿāqibatu al-mukadhibīna ","translations":["Verily","passed","from","before you","situations","then travel","in","the earth","and see","how","was","(the) end","(of) the deniers","(137)"],"transliterationArr":["qad","khalat","min","qablikum","sunanun","fasīrū","fī","al-arḍi","fa-unẓurū","kayfa","kāna","ʿāqibatu","al-mukadhibīna",null],"verseTiming":[[1,0,520],[2,520,1270],[3,1270,2340],[4,2340,3300],[5,3300,4880],[6,4880,6000],[7,6000,6260],[8,6260,7150],[9,7150,8880],[10,8880,9620],[11,9620,10190],[12,10190,11290],[13,11290,14575]]}}