{"name":"5:21","price":"ಓ ನನ್ನ ಜನರೇ! ಅಲ್ಲಾಹು ನಿಮಗೆ ಲಿಖಿತಗೊಳಿಸಿದ ಪವಿತ್ರ ಭೂಮಿಯನ್ನು ಪ್ರವೇಶಿಸಿರಿ. ನೀವು ಬೆನ್ನು ತಿರುಗಿಸಿ ಹಿಂದಿರುಗಬೇಡಿ. ಹಾಗೆ ಮಾಡಿದರೆ ನೀವು ನಷ್ಟಹೊಂದಿದವರಾಗಿ ಬಿಡುವಿರಿ.”[1]","arabic":"يَٰقَوۡمِ ٱدۡخُلُواْ ٱلۡأَرۡضَ ٱلۡمُقَدَّسَةَ ٱلَّتِي كَتَبَ ٱللَّهُ لَكُمۡ وَلَا تَرۡتَدُّواْ عَلَىٰٓ أَدۡبَارِكُمۡ فَتَنقَلِبُواْ خَٰسِرِينَ","category":["5 (Al-Ma'idah)","Al-Ma'idah","Surah Al-Ma'idah","Chapter Al-Ma'idah","Ma'idah","Surah Ma'idah","Chapter Ma'idah","Al Ma'idah","Surah Al Ma'idah","Chapter Al Ma'idah","Surah 5","Chapter 5","The Table Spread","المَائدة"],"ayahNumber":690,"juzNumber":6,"footnotes":"[1] ಯೂಸುಫರು (ಅವರ ಮೇಲೆ ಶಾಂತಿಯಿರಲಿ) ಈಜಿಪ್ಟಿನಲ್ಲಿ ರಾಜನಾದಾಗ ಇಸ್ರಾಯೇಲ್ ಮಕ್ಕಳು ಅಲ್ಲಿಗೆ ತೆರಳಿ ಅಲ್ಲಿ ವಾಸಿಸತೊಡಗಿದರು. ನಂತರ ಈಜಿಪ್ಟನ್ನು ಆಳಿದ ಫರೋಹಗಳ ಕೈಯಲ್ಲಿ ಅವರು ಕ್ರೂರ ಹಿಂಸೆಯನ್ನು ಮತ್ತು ಗುಲಾಮಗಿರಿಯನ್ನು ಅನುಭವಿಸಬೇಕಾಗಿ ಬಂತು. ಪವಿತ್ರ ಭೂಮಿಯಲ್ಲಿ (ಪ್ಯಾಲಸ್ತೀನ್‍ನಲ್ಲಿ) ಅವರನ್ನು ವಾಸ ಮಾಡಿಸುವೆನೆಂದು ಅಲ್ಲಾಹು ಅವರಿಗೆ ಪ್ರವಾದಿಗಳ ಮೂಲಕ ವಾಗ್ದಾನ ಮಾಡಿದ್ದನು. ಆದರೆ ಅವರು ವೀರಾವೇಶದಿಂದ ಯುದ್ಧ ಮಾಡಿ ಆ ಭೂಮಿಯನ್ನು ಗೆಲ್ಲಬೇಕಾಗಿತ್ತು. ಆದರೆ ಇಸ್ರಾಯೇಲರು ಯುದ್ಧ ಮಾಡಲು ಹಿಂಜರಿದರು. ಅವರ ಅವಿಧೇಯತೆಯಿಂದಾಗಿ ಅಲ್ಲಾಹು ಅವರಿಗೆ ನಲ್ವತ್ತು ವರ್ಷಗಳ ಕಾಲ ಸೀನಾ ಮರುಭೂಮಿಯಲ್ಲಿ ಅಲೆಯುವ ಶಿಕ್ಷೆಯನ್ನು ನೀಡಿದನು. ಈ ಮಧ್ಯೆ ಮೂಸಾ ಮತ್ತು ಹಾರೂನ್ (ಅವರ ಮೇಲೆ ಶಾಂತಿಯಿರಲಿ) ನಿಧನರಾದರು. ನಂತರ ಯೂಶಅ್ ರ (ಅವರ ಮೇಲೆ ಶಾಂತಿಯಿರಲಿ) ಕಾಲದಲ್ಲಿ ಅವರಿಗೆ ಪವಿತ್ರ ಭೂಮಿಯಲ್ಲಿ ವಾಸ ಮಾಡಲು ಸಾಧ್ಯವಾಯಿತು.","lang":"kn","version":{"key":"kannada_hamza","direction":"ltr","language_iso_code":"kn","version":"1.0.3","last_update":1710623781,"title":"Kannada translation","description":"Translation of the meanings of the Noble Qur’an into the Kannada language, translated by Muhammad Hamza Battur."},"meta":{"transliteration":"yāqawmi ud'khulū al-arḍa al-muqadasata allatī kataba al-lahu lakum walā tartaddū ʿalā adbārikum fatanqalibū khāsirīna ","translations":["O my people","Enter","the land","the Holy","which","(has been) ordained","(by) Allah","for you","and (do) not","turn","on","your backs","then you will turn back","(as) losers","(21)"],"transliterationArr":["yāqawmi","ud'khulū","al-arḍa","al-muqadasata","allatī","kataba","al-lahu","lakum","walā","tartaddū","ʿalā","adbārikum","fatanqalibū","khāsirīna",null],"verseTiming":[[1,0,1190],[2,1190,1780],[3,1780,2570],[4,2570,4020],[5,4020,4880],[6,4880,5420],[7,5420,6380],[8,6380,7060],[9,7060,7650],[10,7650,9020],[11,9020,10040],[12,10040,11260],[13,11260,13070],[14,13070,14500],[15,14500,16490],[16,16490,19085]]}}