{"name":"60:1","price":"ಓ ಸತ್ಯವಿಶ್ವಾಸಿಗಳೇ! ನನ್ನ ಮತ್ತು ನಿಮ್ಮ ವೈರಿಗಳನ್ನು ಮಿತ್ರರನ್ನಾಗಿ ಮಾಡಿಕೊಳ್ಳಬೇಡಿ. ನೀವು ಅವರೊಡನೆ ಮೈತ್ರಿ ಮಾಡಿಕೊಂಡು ಅವರಿಗೆ ಸಂದೇಶವನ್ನು ಕಳುಹಿಸುತ್ತೀರಿ. ನಿಮ್ಮ ಬಳಿಗೆ ಬಂದಿರುವ ಸತ್ಯವನ್ನು ಅವರು ನಿಷೇಧಿಸಿದ್ದಾರೆ. ನೀವು ನಿಮ್ಮ ಪರಿಪಾಲಕನಲ್ಲಿ (ಅಲ್ಲಾಹನಲ್ಲಿ) ವಿಶ್ವಾಸವಿಡುತ್ತೀರಿ ಎಂಬ ಕಾರಣದಿಂದ ಅವರು ಸಂದೇಶವಾಹಕರನ್ನು ಮತ್ತು ನಿಮ್ಮನ್ನು ಊರಿನಿಂದ ಗಡೀಪಾರು ಮಾಡುತ್ತಿದ್ದಾರೆ. ನೀವು ನನ್ನ ಮಾರ್ಗದಲ್ಲಿ ಯುದ್ಧ ಮಾಡಲು ಹೊರಟಿದ್ದರೆ ಮತ್ತು ನನ್ನ ಸಂಪ್ರೀತಿಯನ್ನು ಪಡೆಯುವುದು ನಿಮ್ಮ ಉದ್ದೇಶವಾಗಿದ್ದರೆ (ಅವರೊಂದಿಗೆ ಮೈತ್ರಿ ಮಾಡಿಕೊಳ್ಳಬೇಡಿ). ನೀವು ರಹಸ್ಯವಾಗಿ ಅವರಿಗೆ ಪ್ರೀತಿಯ ಸಂದೇಶವನ್ನು ಕಳುಹಿಸುತ್ತಿದ್ದೀರಿ. ನೀವು ಮುಚ್ಚಿಡುವುದನ್ನು ಮತ್ತು ಬಹಿರಂಗಪಡಿಸುವುದನ್ನು ನಾನು ಬಹಳ ಚೆನ್ನಾಗಿ ತಿಳಿದಿದ್ದೇನೆ. ನಿಮ್ಮಲ್ಲಿ ಯಾರು ಹೀಗೆ ಮಾಡುತ್ತಾನೋ ಅವನು ನೇರ ಮಾರ್ಗದಿಂದ ತಪ್ಪಿಹೋಗಿದ್ದಾನೆ.[1]","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَّخِذُواْ عَدُوِّي وَعَدُوَّكُمۡ أَوۡلِيَآءَ تُلۡقُونَ إِلَيۡهِم بِٱلۡمَوَدَّةِ وَقَدۡ كَفَرُواْ بِمَا جَآءَكُم مِّنَ ٱلۡحَقِّ يُخۡرِجُونَ ٱلرَّسُولَ وَإِيَّاكُمۡ أَن تُؤۡمِنُواْ بِٱللَّهِ رَبِّكُمۡ إِن كُنتُمۡ خَرَجۡتُمۡ جِهَٰدٗا فِي سَبِيلِي وَٱبۡتِغَآءَ مَرۡضَاتِيۚ تُسِرُّونَ إِلَيۡهِم بِٱلۡمَوَدَّةِ وَأَنَا۠ أَعۡلَمُ بِمَآ أَخۡفَيۡتُمۡ وَمَآ أَعۡلَنتُمۡۚ وَمَن يَفۡعَلۡهُ مِنكُمۡ فَقَدۡ ضَلَّ سَوَآءَ ٱلسَّبِيلِ","category":["60 (Al-Mumtahanah)","Al-Mumtahanah","Surah Al-Mumtahanah","Chapter Al-Mumtahanah","Mumtahanah","Surah Mumtahanah","Chapter Mumtahanah","Al Mumtahanah","Surah Al Mumtahanah","Chapter Al Mumtahanah","Surah 60","Chapter 60","She that is to be Examined","الممتحنة"],"ayahNumber":5151,"juzNumber":28,"footnotes":"[1] ಹುದೈಬಿಯಾ ಒಪ್ಪಂದದ ಬಳಿಕ ಮಕ್ಕಾದ ಸತ್ಯನಿಷೇಧಿಗಳು ಒಪ್ಪಂದವನ್ನು ಉಲ್ಲಂಘಿಸಿದರು. ಆಗ ಪ್ರವಾದಿಯವರು (ಅವರ ಮೇಲೆ ಅಲ್ಲಾಹನ ಕೃಪೆ ಮತ್ತು ಶಾಂತಿಯಿರಲಿ) ಅವರ ವಿರುದ್ಧ ಯುದ್ಧದ ತಯಾರಿ ನಡೆಸಿದರು. ಪ್ರವಾದಿಯ ಅನುಯಾಯಿಗಳಲ್ಲಿ ಒಬ್ಬರಾಗಿದ್ದ ಹಾತಿಬ್ ಬಿನ್ ಅಬೂ ಸಅಲಬ (ಅಲ್ಲಾಹು ಅವರ ಬಗ್ಗೆ ಸಂಪ್ರೀತನಾಗಲಿ) ಮಕ್ಕಾದಿಂದ ಹಿಜ್ರ (ವಲಸೆ) ಮಾಡಿದ ಸಹಾಬಿಯಾಗಿದ್ದರು. ಇವರು ಬದ್ರ್ ಯುದ್ಧದಲ್ಲಿ ಪಾಲ್ಗೊಂಡಿದ್ದರು. ಇವರಿಗೆ ಮಕ್ಕಾದ ಕುರೈಶರೊಡನೆ ಯಾವುದೇ ಸಂಬಂಧವಿರದಿದ್ದರೂ, ಇವರ ಮಡದಿ ಮಕ್ಕಳು ಮಕ್ಕಾದಲ್ಲಿದ್ದರು. ಮಕ್ಕಾದ ಸತ್ಯನಿಷೇಧಿಗಳು ತನ್ನ ಮಡದಿ ಮಕ್ಕಳನ್ನು ಚೆನ್ನಾಗಿ ನೋಡಿಕೊಳ್ಳಲಿ ಎಂಬ ಉದ್ದೇಶದಿಂದ ಅವರು ಪ್ರವಾದಿಯವರು (ಅವರ ಮೇಲೆ ಅಲ್ಲಾಹನ ಕೃಪೆ ಮತ್ತು ಶಾಂತಿಯಿರಲಿ) ಯುದ್ಧದ ತಯಾರಿ ನಡೆಸುವ ಸುದ್ದಿಯನ್ನು ರಹಸ್ಯವಾಗಿ ಮಕ್ಕಾದ ಸತ್ಯನಿಷೇಧಿಗಳಿಗೆ ತಿಳಿಸಿದರು. ಇದಕ್ಕಾಗಿ ಅವರು ಒಬ್ಬ ಮಹಿಳೆಯನ್ನು ಗೊತ್ತುಪಡಿಸಿ ಆಕೆಯೊಡನೆ ಮಕ್ಕಾದವರಿಗೆ ಒಂದು ಪತ್ರವನ್ನು ಕಳುಹಿಸಿದರು. ಈ ವಿಷಯ ದೇವವಾಣಿಯ ಮೂಲಕ ಪ್ರವಾದಿಯವರಿಗೆ (ಅವರ ಮೇಲೆ ಅಲ್ಲಾಹನ ಕೃಪೆ ಮತ್ತು ಶಾಂತಿಯಿರಲಿ) ತಿಳಿಯಿತು. ಅವರು ಸಹಾಬಿಗಳನ್ನು ಕಳುಹಿಸಿ ಆ ಮಹಿಳೆಯಿಂದ ಪತ್ರವನ್ನು ಕಿತ್ತುಕೊಂಡು ಬರುವಂತೆ ಹೇಳಿದರು. ನಂತರ ಹಾತಿಬ್ (ಅವರ ಬಗ್ಗೆ ಅಲ್ಲಾಹು ಸಂಪ್ರೀತನಾಗಲಿ) ರನ್ನು ವಿಚಾರಿಸಿದರು. ಹಾತಿಬ್ ತನ್ನ ಪ್ರಾಮಾಣಿಕ ಉದ್ದೇಶವನ್ನು ಮುಚ್ಚುಮರೆಯಿಲ್ಲದೆ ವಿವರಿಸಿದಾಗ ಪ್ರವಾದಿಯವರು (ಅವರ ಮೇಲೆ ಅಲ್ಲಾಹನ ಕೃಪೆ ಮತ್ತು ಶಾಂತಿಯಿರಲಿ) ಅವರನ್ನು ಕ್ಷಮಿಸಿದರು. ಮುಂದೆ ಸತ್ಯವಿಶ್ವಾಸಿಗಳಲ್ಲಿ ಯಾರೂ ಇಂತಹ ಕೆಲಸ ಮಾಡಬಾರದೆಂಬ ಉದ್ದೇಶದಿಂದ ಅಲ್ಲಾಹು ಈ ವಚನಗಳನ್ನು ಅವತೀರ್ಣಗೊಳಿಸಿದನು.","lang":"kn","version":{"key":"kannada_hamza","direction":"ltr","language_iso_code":"kn","version":"1.0.3","last_update":1710623781,"title":"Kannada translation","description":"Translation of the meanings of the Noble Qur’an into the Kannada language, translated by Muhammad Hamza Battur."},"meta":{"transliteration":"yāayyuhā alladhīna āmanū lā tattakhidhū ʿaduwwī waʿaduwwakum awliyāa tul'qūna ilayhim bil-mawadati waqad kafarū bimā jāakum mina al-ḥaqi yukh'rijūna al-rasūla wa-iyyākum an tu'minū bil-lahi rabbikum in kuntum kharajtum jihādan fī sabīlī wa-ib'tighāa marḍātī tusirrūna ilayhim bil-mawadati wa-anā aʿlamu bimā akhfaytum wamā aʿlantum waman yafʿalhu minkum faqad ḍalla sawāa al-sabīli ","translations":["O you","who","believe","(Do) not","take","My enemies","and your enemies","(as) allies","offering","them","love","while","they have disbelieved","in what","came to you","of","the truth","driving out","the Messenger","and yourselves","because","you believe","in Allah","your Lord","If","you","come forth","(to) strive","in","My way","and (to) seek","My Pleasure","You confide","to them","love","but I Am","most knowing","of what","you conceal","and what","you declare","And whoever","does it","among you","then certainly","he has strayed","(from the) straight","path","(1)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","lā","tattakhidhū","ʿaduwwī","waʿaduwwakum","awliyāa","tul'qūna","ilayhim","bil-mawadati","waqad","kafarū","bimā","jāakum","mina","al-ḥaqi","yukh'rijūna","al-rasūla","wa-iyyākum","an","tu'minū","bil-lahi","rabbikum","in","kuntum","kharajtum","jihādan","fī","sabīlī","wa-ib'tighāa","marḍātī","tusirrūna","ilayhim","bil-mawadati","wa-anā","aʿlamu","bimā","akhfaytum","wamā","aʿlantum","waman","yafʿalhu","minkum","faqad","ḍalla","sawāa","al-sabīli",null],"verseTiming":[[1,0,2870],[2,2870,3700],[3,3700,4660],[4,4660,4970],[5,4970,6060],[6,6060,6960],[7,6960,8320],[8,8320,10740],[9,10740,11610],[10,11610,13080],[11,13080,14380],[12,14380,14840],[13,14840,15620],[14,15620,16190],[15,16190,18570],[16,18570,19510],[17,19510,20340],[18,20340,21440],[19,21440,22440],[20,22440,23790],[21,23790,24700],[22,24700,25720],[23,25720,26680],[24,26680,27750],[25,27750,28860],[26,28860,30300],[27,30300,31300],[28,31300,32620],[29,32620,33020],[30,33020,34110],[31,34110,36590],[32,36590,37540],[33,37540,39450],[34,39450,40930],[35,40930,42260],[36,42260,42830],[37,42830,43620],[38,43620,45430],[39,45430,46560],[40,46560,48620],[41,48620,51100],[42,51100,52160],[43,52160,53220],[44,53220,54540],[45,54540,55080],[46,55080,55690],[47,55690,57760],[48,57760,59755]]}}