{"name":"66:1","price":"ಓ ಪ್ರವಾದಿಯವರೇ! ಅಲ್ಲಾಹು ನಿಮಗೆ ಧರ್ಮಸಮ್ಮತಗೊಳಿಸಿದ ವಸ್ತುವನ್ನು ನೀವೇಕೆ ನಿಷಿದ್ಧಗೊಳಿಸುತ್ತೀರಿ? ನೀವು ನಿಮ್ಮ ಪತ್ನಿಯರ ಸಂಪ್ರೀತಿಯನ್ನು ಪಡೆಯಲು ಬಯಸುತ್ತೀರಾ? ಅಲ್ಲಾಹು ಕ್ಷಮಿಸುವವನು ಮತ್ತು ದಯೆ ತೋರುವವನಾಗಿದ್ದಾನೆ.[1]","arabic":"يَٰٓأَيُّهَا ٱلنَّبِيُّ لِمَ تُحَرِّمُ مَآ أَحَلَّ ٱللَّهُ لَكَۖ تَبۡتَغِي مَرۡضَاتَ أَزۡوَٰجِكَۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ","category":["66 (At-Tahrim)","At-Tahrim","Surah At-Tahrim","Chapter At-Tahrim","Tahrim","Surah Tahrim","Chapter Tahrim","At Tahrim","Surah At Tahrim","Chapter At Tahrim","Surah 66","Chapter 66","The Prohibition","التحريم"],"ayahNumber":5230,"juzNumber":28,"footnotes":"[1] ಪ್ರವಾದಿಯವರು (ಅವರ ಮೇಲೆ ಅಲ್ಲಾಹನ ಕೃಪೆ ಮತ್ತು ಶಾಂತಿಯಿರಲಿ) ಅವರ ಪತ್ನಿ ಝೈನಬ್ ಬಿಂತ್ ಜಹ್ಶ್ (ಅವರ ಬಗ್ಗೆ ಅಲ್ಲಾಹು ಸಂಪ್ರೀತನಾಗಲಿ) ರವರ ಮನೆಯಲ್ಲಿ ಸ್ವಲ್ಪ ಹೊತ್ತು ತಂಗಿ ಅಲ್ಲಿ ಜೇನು ಸವಿಯುತ್ತಿದ್ದರು. ಪ್ರವಾದಿಯವರು (ಅವರ ಮೇಲೆ ಅಲ್ಲಾಹನ ಕೃಪೆ ಮತ್ತು ಶಾಂತಿಯಿರಲಿ)  ಝೈನಬರ ಮನೆಯಲ್ಲಿ ಹೆಚ್ಚು ತಂಗುವುದನ್ನು ನಿಲ್ಲಿಸಲು ಆಯಿಶ ಮತ್ತು ಹಫ್ಸ (ಅಲ್ಲಾಹು ಅವರಿಬ್ಬರ ಬಗ್ಗೆ ಸಂಪ್ರೀತನಾಗಲಿ) ಒಂದು ಉಪಾಯ ಹೂಡಿದರು. ಪ್ರವಾದಿಯವರು (ಅವರ ಮೇಲೆ ಅಲ್ಲಾಹನ ಕೃಪೆ ಮತ್ತು ಶಾಂತಿಯಿರಲಿ) ಇವರಿಬ್ಬರಲ್ಲಿ  ಯಾರ ಬಳಿಗೆ ಮೊದಲು ಬಂದರೂ ಅವರ ಬಾಯಿಂದ ಒಂದು ರೀತಿಯ ಕೆಟ್ಟ ಪರಿಮಳ ಬರುತ್ತದೆ ಎಂದು ಹೇಳಬೇಕು ಎಂದು ಇವರಿಬ್ಬರು ನಿರ್ಧರಿಸಿದರು. ಪ್ರವಾದಿಯವರು (ಅವರ ಮೇಲೆ ಅಲ್ಲಾಹನ ಕೃಪೆ ಮತ್ತು ಶಾಂತಿಯಿರಲಿ) ಬಂದಾಗ ಅವರು ಇದೇ ರೀತಿ ಹೇಳಿದರು. ಆಗ ಪ್ರವಾದಿಯವರು (ಅವರ ಮೇಲೆ ಅಲ್ಲಾಹನ ಕೃಪೆ ಮತ್ತು ಶಾಂತಿಯಿರಲಿ)  ಹೇಳಿದರು: “ನಾನು ಝೈನಬರ ಮನೆಯಲ್ಲಿ ಸ್ವಲ್ಪ ಜೇನು ಸವಿದಿದ್ದೆ. ಇನ್ನು ಮುಂದೆ ನಾನು ಅದನ್ನು ಕುಡಿಯುವುದಿಲ್ಲವೆಂದು ಆಣೆ ಮಾಡುತ್ತೇನೆ. ಆದರೆ ಈ ವಿಷಯವನ್ನು ನೀನು ಯಾರಿಗೂ ತಿಳಿಸಬಾರದು.”","lang":"kn","version":{"key":"kannada_hamza","direction":"ltr","language_iso_code":"kn","version":"1.0.3","last_update":1710623781,"title":"Kannada translation","description":"Translation of the meanings of the Noble Qur’an into the Kannada language, translated by Muhammad Hamza Battur."},"meta":{"transliteration":"yāayyuhā al-nabiyu lima tuḥarrimu mā aḥalla al-lahu laka tabtaghī marḍāta azwājika wal-lahu ghafūrun raḥīmun ","translations":["O","Prophet","Why (do)","you prohibit","what","has made lawful","Allah","for you","seeking","(to) please","your wives","And Allah","(is) Oft-Forgiving","Most Merciful","(1)"],"transliterationArr":["yāayyuhā","al-nabiyu","lima","tuḥarrimu","mā","aḥalla","al-lahu","laka","tabtaghī","marḍāta","azwājika","wal-lahu","ghafūrun","raḥīmun",null],"verseTiming":[[1,0,2770],[2,2770,4410],[3,4410,4760],[4,4760,5780],[5,5780,7830],[6,7830,8580],[7,8580,9500],[8,9500,10350],[9,10350,11280],[10,11280,12270],[11,12270,13780],[12,13780,14720],[13,14720,15750],[14,15750,18305]]}}