{"name":"8:67","price":"(ಶತ್ರುಗಳನ್ನು ಸದೆಬಡಿದು) ನಾಡಿನಲ್ಲಿ ಪ್ರಾಬಲ್ಯ ಪಡೆಯುವ ತನಕ ಪ್ರವಾದಿಯ ಕೈಯಲ್ಲಿ ಯುದ್ಧ ಖೈದಿಗಳಿರುವುದು ಸರಿಯಲ್ಲ.[1] ನೀವು ಇಹಲೋಕದ ಐಶ್ವರ್ಯವನ್ನು ಬಯಸುತ್ತೀರಿ. ಆದರೆ ಅಲ್ಲಾಹು ಪರಲೋಕವನ್ನು ಬಯಸುತ್ತಾನೆ. ಅಲ್ಲಾಹು ಪ್ರಬಲನು ಮತ್ತು ವಿವೇಕಪೂರ್ಣನಾಗಿದ್ದಾನೆ.","arabic":"مَا كَانَ لِنَبِيٍّ أَن يَكُونَ لَهُۥٓ أَسۡرَىٰ حَتَّىٰ يُثۡخِنَ فِي ٱلۡأَرۡضِۚ تُرِيدُونَ عَرَضَ ٱلدُّنۡيَا وَٱللَّهُ يُرِيدُ ٱلۡأٓخِرَةَۗ وَٱللَّهُ عَزِيزٌ حَكِيمٞ","category":["8 (Al-Anfal)","Al-Anfal","Surah Al-Anfal","Chapter Al-Anfal","Anfal","Surah Anfal","Chapter Anfal","Al Anfal","Surah Al Anfal","Chapter Al Anfal","Surah 8","Chapter 8","The Spoils of War","الأنفَال"],"ayahNumber":1227,"juzNumber":10,"footnotes":"[1] ಬದ್ರ್ ಯುದ್ಧದಲ್ಲಿ 70 ಶತ್ರುಗಳು ಹತರಾಗಿದ್ದರು ಮತ್ತು 70 ಶತ್ರುಗಳನ್ನು ಸೆರೆಹಿಡಿಯಲಾಗಿತ್ತು. ಇದು ಇಸ್ಲಾಂನಲ್ಲಿ ನಡೆದ ಮೊದಲ ಯುದ್ಧವಾಗಿದ್ದರಿಂದ ಈ ಖೈದಿಗಳನ್ನು ಏನು ಮಾಡಬೇಕೆಂಬ ಬಗ್ಗೆ ಯಾವುದೇ ನಿರ್ಧಾರವಿರಲಿಲ್ಲ. ಆದ್ದರಿಂದ ಪ್ರವಾದಿಯವರು (ಅವರ ಮೇಲೆ ಅಲ್ಲಾಹನ ಕೃಪೆ ಮತ್ತು ಶಾಂತಿಯಿರಲಿ) ಮುಸಲ್ಮಾನರ ಸಭೆ ಕರೆದು ಸಮಾಲೋಚನೆ ಮಾಡಿದರು. ಕೆಲವರು ಖೈದಿಗಳನ್ನು ಕೊಲ್ಲಬೇಕೆಂದು ಅಭಿಪ್ರಾಯ ಹೇಳಿದರೆ ಕೆಲವರು ಪರಿಹಾರವನ್ನು ಪಡೆದು ಖೈದಿಗಳನ್ನು ಬಿಟ್ಟು ಬಿಡೋಣ ಎಂದರು. ಪ್ರವಾದಿಯವರು (ಅವರ ಮೇಲೆ ಅಲ್ಲಾಹನ ಕೃಪೆ ಮತ್ತು ಶಾಂತಿಯಿರಲಿ) ಎರಡನೇ ಅಭಿಪ್ರಾಯವನ್ನು ಆರಿಸಿದರು. ಆಗ ಅಲ್ಲಾಹು ಈ ವಚನವನ್ನು ಅವತೀರ್ಣಗೊಳಿಸಿದನು. ಅಂದರೆ, ಮುಸಲ್ಮಾನರಿಗೆ ನಾಡಿನಲ್ಲಿ ಪ್ರಾಬಲ್ಯ ಸಿಗುವ ತನಕ ಪರಿಹಾರ ಪಡೆದು ಯುದ್ಧ ಖೈದಿಗಳನ್ನು ಬಿಟ್ಟುಬಿಡಬಾರದು. ಏಕೆಂದರೆ ಅದರಿಂದ ಅವರು ತಂತ್ರಗಳನ್ನು ರೂಪಿಸಿ ಇನ್ನೊಂದು ಯುದ್ಧಕ್ಕೆ ತಯಾರಿ ನಡೆಸುವ ಸಾಧ್ಯತೆಯಿರುತ್ತದೆ. ಆದರೆ ಮುಸಲ್ಮಾನರಿಗೆ ನಾಡಿನಲ್ಲಿ ಪ್ರಾಬಲ್ಯವುಂಟಾಗಿ ಅವರನ್ನು ಸೋಲಿಸುವುದು ಅಷ್ಟು ಸುಲಭವಲ್ಲ ಎಂಬ ಸ್ಥಿತಿಯು ಉಂಟಾದರೆ ಯುದ್ಧ ಖೈದಿಗಳ ವಿಷಯದಲ್ಲಿ ಈ ಕೆಳಗಿನ ನಾಲ್ಕು ಆಯ್ಕೆಗಳಲ್ಲಿ ಒಂದನ್ನು ಆರಿಸಬಹುದು: 1. ಅವರನ್ನು ಕೊಲ್ಲುವುದು. 2. ಪರಿಹಾರ ಪಡೆದು ಅವರನ್ನು ಬಿಟ್ಟುಬಿಡುವುದು. 3. ಅವರನ್ನು ಮುಸಲ್ಮಾನ ಖೈದಿಗಳೊಡನೆ ವಿನಿಮಯ ಮಾಡಿಕೊಳ್ಳುವುದು. 4. ಅವರನ್ನು ಗುಲಾಮರನ್ನಾಗಿ ಮಾಡುವುದು.","lang":"kn","version":{"key":"kannada_hamza","direction":"ltr","language_iso_code":"kn","version":"1.0.3","last_update":1710623781,"title":"Kannada translation","description":"Translation of the meanings of the Noble Qur’an into the Kannada language, translated by Muhammad Hamza Battur."},"meta":{"transliteration":"mā kāna linabiyyin an yakūna lahu asrā ḥattā yuth'khina fī al-arḍi turīdūna ʿaraḍa al-dun'yā wal-lahu yurīdu al-ākhirata wal-lahu ʿazīzun ḥakīmun ","translations":["Not","is","for a Prophet","that","(there) should be","for him","prisoners of war","until","he has battled strenuously","in","the land","You desire","(the) commodities","(of) the world","but Allah","desires","(for you) the Hereafter","And Allah","(is) All-Mighty","All-Wise","(67)"],"transliterationArr":["mā","kāna","linabiyyin","an","yakūna","lahu","asrā","ḥattā","yuth'khina","fī","al-arḍi","turīdūna","ʿaraḍa","al-dun'yā","wal-lahu","yurīdu","al-ākhirata","wal-lahu","ʿazīzun","ḥakīmun",null],"verseTiming":[[1,0,580],[2,580,1230],[3,1230,2610],[4,2610,2870],[5,2870,3770],[6,3770,4530],[7,4530,6560],[8,6560,7410],[9,7410,8320],[10,8320,9180],[11,9180,9400],[12,9400,10760],[13,10760,11960],[14,11960,12590],[15,12590,13780],[16,13780,14940],[17,14940,15770],[18,15770,17500],[19,17500,18530],[20,18530,19550],[21,19550,22915]]}}