{"name":"16:1","price":"1. Amarka Alle (Saacadda Qiyaame ama halaagidda gaalada) waa wax iman (oo soo dhow) ee waxba ha doonina in la soo dedejiyo. Xurmo oo dhan Isagaa (Alle) iska leh oo ka hufan (xumaan), waana ka Sarreeyaa1 waxay la wadaajiyaan (cibaadada).","arabic":"أَتَىٰٓ أَمۡرُ ٱللَّهِ فَلَا تَسۡتَعۡجِلُوهُۚ سُبۡحَٰنَهُۥ وَتَعَٰلَىٰ عَمَّا يُشۡرِكُونَ","category":["16 (An-Nahl)","An-Nahl","Surah An-Nahl","Chapter An-Nahl","Nahl","Surah Nahl","Chapter Nahl","An Nahl","Surah An Nahl","Chapter An Nahl","Surah 16","Chapter 16","The Bee","النَّحل"],"ayahNumber":1902,"juzNumber":14,"footnotes":"1. Ataa Luqad ahaan macnaheedu waxaa weeye waa yimid waxaana loola jeedaa muujin in la hubo oo yaqiin tahay oo ay aad u soo dhowdahay Saacadda Qiyaame ama halaagidda gaalada iyo guusha ay heli doonaan Muslimiinta. Ataa Waa ficil maadi (fal tagey) laakiin loogala jeedo mudaaric fal markaa lagu gudo jiro ama soo socda oo imanaya. Sideedana waxaa jira sagaal meelood oo falka tagey loogala jeedo fal soo socda ama markaa ah, waxaa ka mid ah hadalkii lagu billaabo  fal tagey, falka tagey ee soo aroora kaddib mid ka mid ah xuruurfta sharadka sida idaa jaa’a, in makkaannaahum, ama kaddib mowsuul sidaa alladiina aamanuu, iwm falalka tagey halkan waxaa loola jeedi karaa fal jooga ama soo socda.","lang":"so","version":{"key":"somali_yacob","direction":"ltr","language_iso_code":"so","version":"1.0.16","last_update":1705307223,"title":"Somali translation - Jacob","description":"Translation of the meanings of the Noble Qur'an into the Somali language, translated by Abdullah Hasan Jacob."},"meta":{"transliteration":"atā amru al-lahi falā tastaʿjilūhu sub'ḥānahu wataʿālā ʿammā yush'rikūna ","translations":["Will come","(the) command of Allah","(the) command of Allah","so (do) not","(be) impatient for it","Glorified is He","and Exalted (is) He","above what","they associate","(1)"],"transliterationArr":["atā","amru","al-lahi","falā","tastaʿjilūhu","sub'ḥānahu","wataʿālā","ʿammā","yush'rikūna",null],"verseTiming":[[1,0,2650],[2,2650,3280],[3,3280,4300],[4,4300,5050],[5,5050,8780],[6,8780,10450],[7,10450,11710],[8,11710,13250],[9,13250,16425]]}}