{"name":"18:65","price":"65. Waxayna heleen addoon ka mid ah addoomahayga oo aan siinnay Naxariis xaggayaga ah, kaasoo aan ka barnay Xaggayaga cilmi16.","arabic":"فَوَجَدَا عَبۡدٗا مِّنۡ عِبَادِنَآ ءَاتَيۡنَٰهُ رَحۡمَةٗ مِّنۡ عِندِنَا وَعَلَّمۡنَٰهُ مِن لَّدُنَّا عِلۡمٗا","category":["18 (Al-Kahf)","Al-Kahf","Surah Al-Kahf","Chapter Al-Kahf","Kahf","Surah Kahf","Chapter Kahf","Al Kahf","Surah Al Kahf","Chapter Al Kahf","Surah 18","Chapter 18","The Cave","الكَهف"],"ayahNumber":2205,"juzNumber":15,"footnotes":"16. Mufasiriinta qaarkood waxay sheegeen iyagoo daliilsanaya xadiis laga soo weriyey Nabiga s.c.w. in addoonka halkan loola jeedo Al-Khadir, naxariistana loola jeedo Waxyiga iyo Nabinnimada la siiyey, cilmigana loo jeedo cilmi Ghaybka sida ku iman doonto Aayadaha xiga. Caamada qaar ayaa rumeysan inuu Khadir dhiman oo nool yahay, taasina ma aha sax, waayo waxaa soo arooray axaadiis muujinaya inuusan nooleyn. Hadduu nool yahay wuxuu u iman lahaa Nabiga s.c.w. oo rumeyn lahaa oo u gargaari laha. Nabigu s.c.w. wuxuu mar xadiis ku sheegay in wixii ka billowda maalintaas hadday ka soo wareegto boqol sano axadna dhulka ku nool markaa uusan noolaan doonin boqol sano kaddib. Qisadanina waxay dhex martay Al-Khadir iyo Nabi, wiilka la socday Nabi Muuse oo u adeegayeyna wuxuu ahaa Yuushac bin Nuun oo isna Nabi noqday ka mid ah anbiyadii ilmihii Israa’iil waa’ dambe kaddib Muuse c.s.","lang":"so","version":{"key":"somali_yacob","direction":"ltr","language_iso_code":"so","version":"1.0.16","last_update":1705307223,"title":"Somali translation - Jacob","description":"Translation of the meanings of the Noble Qur'an into the Somali language, translated by Abdullah Hasan Jacob."},"meta":{"transliteration":"fawajadā ʿabdan min ʿibādinā ātaynāhu raḥmatan min ʿindinā waʿallamnāhu min ladunnā ʿil'man ","translations":["Then they found","a servant","from","Our servants","whom We had given","mercy","from","Us","and We had taught him","from","Us","a knowledge","(65)"],"transliterationArr":["fawajadā","ʿabdan","min","ʿibādinā","ātaynāhu","raḥmatan","min","ʿindinā","waʿallamnāhu","min","ladunnā","ʿil'man",null],"verseTiming":[[1,0,1120],[2,1120,1770],[3,1770,2830],[4,2830,5780],[5,5780,7450],[6,7450,8320],[7,8320,9410],[8,9410,11000],[9,11000,12840],[10,12840,13050],[11,13050,14920],[12,14920,16475]]}}