{"name":"11:110","price":"Dan sesungguhnya Kami telah memberikan Kitab (Taurat) kepada Musa, lalu diperselisihkan tentang Kitab itu 738.  Dan seandainya tidak ada ketetapan yang telah terdahulu dari Tuhan-mu, niscaya telah ditetapkan hukuman di antara mereka 739.   Dan sesungguhnya mereka (orang-orang kafir Mekah) dalam keraguan yang menggelisahkan terhadap Al-Qur`ān.","arabic":"وَلَقَدۡ ءَاتَيۡنَا مُوسَى ٱلۡكِتَٰبَ فَٱخۡتُلِفَ فِيهِۚ وَلَوۡلَا كَلِمَةٞ سَبَقَتۡ مِن رَّبِّكَ لَقُضِيَ بَيۡنَهُمۡۚ وَإِنَّهُمۡ لَفِي شَكّٖ مِّنۡهُ مُرِيبٖ","category":["11 (Hud)","Hud","Surah Hud","Chapter Hud","Surah 11","Chapter 11","Hud","هود"],"ayahNumber":1583,"juzNumber":12,"footnotes":"738.  Ayat ini suatu penghibur kepada Nabi Muhammad Ṣallallāhu ʻAlaihi wa Sallam sewaktu beliau menghadapi tantangan terhadap Al-Qur`ān oleh orang kafir Mekah.  Allah Subḥānahu wa Ta‘ālā  menceritakan bahwa Taurat yang dibawa Nabi Musa ‘Alaihissalām dahulu pun juga dapat tantangan oleh orang-orang Yahudi. \n739.  Maksudnya, andaikata tidak ada ketetapan penundaan azab terhadap mereka sampai hari kiamat, tentulah mereka dibinasakan dalam waktu itu juga. ","lang":"id","version":{"key":"indonesian_complex","direction":"ltr","language_iso_code":"id","version":"1.0.0","last_update":1524085200,"title":"Indonesian Translation - King Fahd Complex","description":"Translation of the Quran meanings into Indonesian by approved Committee by Indonesian Ministry of Islamic Affairs. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"walaqad ātaynā mūsā al-kitāba fa-ukh'tulifa fīhi walawlā kalimatun sabaqat min rabbika laquḍiya baynahum wa-innahum lafī shakkin min'hu murībin ","translations":["And verily","We gave","Musa","the Book","but differences arose","therein","And if not","(for) a Word","(that) preceded","from","your Lord","surely would have been judged","between them","And indeed, they","surely (are) in","doubt","concerning it","suspicious","(110)"],"transliterationArr":["walaqad","ātaynā","mūsā","al-kitāba","fa-ukh'tulifa","fīhi","walawlā","kalimatun","sabaqat","min","rabbika","laquḍiya","baynahum","wa-innahum","lafī","shakkin","min'hu","murībin",null],"verseTiming":[[1,0,830],[2,830,2110],[3,2110,2670],[4,2670,3730],[5,3730,4810],[6,4810,7730],[7,7730,8660],[8,8660,9870],[9,9870,11050],[10,11050,11220],[11,11220,12280],[12,12280,13070],[13,13070,14480],[14,14480,16490],[15,16490,17040],[16,17040,17720],[17,17720,19650],[18,19650,21735]]}}