{"name":"17:59","price":"Dan sekali-kali tidak ada yang menghalangi Kami untuk mengirimkan (kepadamu) tanda-tanda (kekuasan Kami), melainkan karena tanda-tanda itu telah didustakan oleh orang-orang dahulu 858.  Dan telah Kami berikan kepada Ṡamūd unta betina itu (sebagai mukjizat) yang dapat dilihat, tetapi mereka menganiaya unta betina itu.  Dan Kami tidak memberi tanda-tanda itu, melainkan untuk menakuti.","arabic":"وَمَا مَنَعَنَآ أَن نُّرۡسِلَ بِٱلۡأٓيَٰتِ إِلَّآ أَن كَذَّبَ بِهَا ٱلۡأَوَّلُونَۚ وَءَاتَيۡنَا ثَمُودَ ٱلنَّاقَةَ مُبۡصِرَةٗ فَظَلَمُواْ بِهَاۚ وَمَا نُرۡسِلُ بِٱلۡأٓيَٰتِ إِلَّا تَخۡوِيفٗا","category":["17 (Al-Isra)","Al-Isra","Surah Al-Isra","Chapter Al-Isra","Isra","Surah Isra","Chapter Isra","Al Isra","Surah Al Isra","Chapter Al Isra","Surah 17","Chapter 17","The Night Journey","الإسرَاء"],"ayahNumber":2088,"juzNumber":15,"footnotes":"858.  Maksudnya,  Allah Subḥānahu wa Ta‘ālā menetapkan bahwa orang-orang yang mendustakan tanda-tanda kekuasaan­Nya seperti yang diberikan kepada rasul-rasul-Nya yang dahulu akan dimusnahkan.  Orang­orang Quraisy meminta kepada Nabi Muhammad Ṣallallāhu ʻAlaihi wa Sallam supaya diturunkan pula kepada mereka tanda-tanda kekuasaan Allah Subḥānahu wa Ta‘ālā itu.  Akan tetapi, Allah Subḥānahu wa Ta‘ālā tidak akan menurunkannya kepada mereka karena kalau tanda-tanda kekuasaan Allah Subḥānahu wa Ta‘ālā itu diturunkan juga, pasti mereka akan mendustakannya dan tentulah mereka akan dibinasakan pula seperti umat-umat yang dahulu, sedangkan Allah Subḥānahu wa Ta‘ālā tidak hendak membinasakan kaum Quraisy. ","lang":"id","version":{"key":"indonesian_complex","direction":"ltr","language_iso_code":"id","version":"1.0.0","last_update":1524085200,"title":"Indonesian Translation - King Fahd Complex","description":"Translation of the Quran meanings into Indonesian by approved Committee by Indonesian Ministry of Islamic Affairs. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wamā manaʿanā an nur'sila bil-āyāti illā an kadhaba bihā al-awalūna waātaynā thamūda al-nāqata mub'ṣiratan faẓalamū bihā wamā nur'silu bil-āyāti illā takhwīfan ","translations":["And not","stopped Us","that","We send","the Signs","except","that","denied","them","the former (people)","And We gave","Thamud","the she-camel","(as) a visible sign","but they wronged","her","And not","We send","the Signs","except","(as) a warning","(59)"],"transliterationArr":["wamā","manaʿanā","an","nur'sila","bil-āyāti","illā","an","kadhaba","bihā","al-awalūna","waātaynā","thamūda","al-nāqata","mub'ṣiratan","faẓalamū","bihā","wamā","nur'silu","bil-āyāti","illā","takhwīfan",null],"verseTiming":[[1,0,690],[2,690,3070],[3,3070,3400],[4,3400,4710],[5,4710,6300],[6,6300,8750],[7,8750,9680],[8,9680,10610],[9,10610,10940],[10,10940,14150],[11,14150,15510],[12,15510,16510],[13,16510,18200],[14,18200,19370],[15,19370,21070],[16,21070,21820],[17,21820,22820],[18,22820,23690],[19,23690,25290],[20,25290,26140],[21,26140,27785]]}}