{"name":"20:96","price":"As-Sāmirī  menjawab, \"Aku mengetahui sesuatu yang mereka tidak mengetahuinya, maka aku ambil segenggam dari jejak rasul 941 , lalu aku melemparkannya dan demikianlah nafsuku membujukku\".","arabic":"قَالَ بَصُرۡتُ بِمَا لَمۡ يَبۡصُرُواْ بِهِۦ فَقَبَضۡتُ قَبۡضَةٗ مِّنۡ أَثَرِ ٱلرَّسُولِ فَنَبَذۡتُهَا وَكَذَٰلِكَ سَوَّلَتۡ لِي نَفۡسِي","category":["20 (Ta-Ha)","Ta-Ha","Surah Ta-Ha","Chapter Ta-Ha","Ha","Surah Ha","Chapter Ha","Ta Ha","Surah Ta Ha","Chapter Ta Ha","Surah 20","Chapter 20","Ta-Ha","طه"],"ayahNumber":2444,"juzNumber":16,"footnotes":"941.  Maksud \"jejak rasul\" di sini ialah ajaran-ajarannya.  Menurut faham ini,  As-Sāmirī  mengambil sebagian dari ajaran-ajaran Musa ‘Alaihissalām, kemudian dilemparkannya ajaran-ajaran itu sehingga dia menjadi sesat.  Menurut sebagian ahli tafsir yang lain yang dimaksud dengan jejak rasul itu ialah jejak telapak kuda Jibril ‘Alaihissalām.   Artinya, As-Sāmirī  mengambil segumpal tanah dari jejak itu, lalu dilemparkannya ke dalam logam yang sedang dihancurkan, sehingga logam itu berbentuk anak sapi yang mengeluarkan suara. ","lang":"id","version":{"key":"indonesian_complex","direction":"ltr","language_iso_code":"id","version":"1.0.0","last_update":1524085200,"title":"Indonesian Translation - King Fahd Complex","description":"Translation of the Quran meanings into Indonesian by approved Committee by Indonesian Ministry of Islamic Affairs. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qāla baṣur'tu bimā lam yabṣurū bihi faqabaḍtu qabḍatan min athari al-rasūli fanabadhtuhā wakadhālika sawwalat lī nafsī ","translations":["He said","I perceived","what","not","they perceive","in it","so I took","a handful","from","(the) track","(of) the Messenger","then threw it","and thus","suggested","to me","my soul","(96)"],"transliterationArr":["qāla","baṣur'tu","bimā","lam","yabṣurū","bihi","faqabaḍtu","qabḍatan","min","athari","al-rasūli","fanabadhtuhā","wakadhālika","sawwalat","lī","nafsī",null],"verseTiming":[[1,0,790],[2,790,1710],[3,1710,2360],[4,2360,2700],[5,2700,3810],[6,3810,4480],[7,4480,5620],[8,5620,6620],[9,6620,7740],[10,7740,8360],[11,8360,9510],[12,9510,11030],[13,11030,13030],[14,13030,14300],[15,14300,15490],[16,15490,16000],[17,16000,17305]]}}