{"name":"2:3","price":"(yaitu) mereka yang beriman13 kepada yang gaib14, yang mendirikan salat15, dan menafkahkan sebagian rezeki16 yang Kami anugerahkan kepada mereka,","arabic":"ٱلَّذِينَ يُؤۡمِنُونَ بِٱلۡغَيۡبِ وَيُقِيمُونَ ٱلصَّلَوٰةَ وَمِمَّا رَزَقۡنَٰهُمۡ يُنفِقُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":10,"juzNumber":1,"footnotes":"13.  Iman ialah kepercayaan yang teguh yang disertai dengan ketundukan dan penyerahan jiwa.  Tanda-tanda adanya iman ialah mengerjakan apa yang dikehendaki oleh iman itu.\n14.  Hal yang gaib ialah yang tak dapat ditangkap oleh pancaindera.  Percaya kepada yang gaib, yaitu mengiktikadkan adanya sesuatu \"yang mawjud\", yang tidak dapat ditangkap oleh pancaindera karena ada dalil yang menunjukkan kepada adanya, seperti adanya Allah  Subḥānahu wa Ta‘ālā, malaikat-malaikat, hari akhirat, dan sebagainya.\n15.  Salat (ṣalāt) menurut bahasa Arab berarti doa.  Menurut istilah syarak ialah ibadah yang sudah dikenal, yang dimulai dengan takbir dan disudahi dengan salam.  Salat dikerjakan untuk membuktikan pengabdian dan kerendahan diri kepada Allah Subḥānahu wa Ta‘ālā.  Mendirikan salat ialah menunaikannya dengan teratur dengan melengkapi syarat-syarat, rukun-rukun, dan adab-adabnya, baik yang lahir ataupun yang batin, seperti khusyuk, memperhatikan apa yang dibaca, dan sebagainya. \n16. Rezeki adalah segala yang dapat diambil manfaatnya.  Menafkahkan sebagian rezeki ialah memberikan sebagian dari harta yang telah Tuhan rezekikan kepada orang-orang yang disyariatkan agama untuk memberinya, seperti orang-orang fakir, orang-orang miskin, kaum kerabat, anak-anak yatim, dan lain-lain. ","lang":"id","version":{"key":"indonesian_complex","direction":"ltr","language_iso_code":"id","version":"1.0.0","last_update":1524085200,"title":"Indonesian Translation - King Fahd Complex","description":"Translation of the Quran meanings into Indonesian by approved Committee by Indonesian Ministry of Islamic Affairs. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"alladhīna yu'minūna bil-ghaybi wayuqīmūna al-ṣalata wamimmā razaqnāhum yunfiqūna ","translations":["Those who","believe","in the unseen","and establish","the prayer","and out of what","We have provided them","they spend","(3)"],"transliterationArr":["alladhīna","yu'minūna","bil-ghaybi","wayuqīmūna","al-ṣalata","wamimmā","razaqnāhum","yunfiqūna",null],"verseTiming":[[1,0,1040],[2,1040,2190],[3,2190,3090],[4,3090,4260],[5,4260,5220],[6,5220,6580],[7,6580,7990],[8,7990,11365]]}}