{"name":"2:4","price":"dan mereka yang beriman kepada Kitab (Al-Qur`ān) yang telah diturunkan kepadamu dan kitab-kitab yang telah diturunkan sebelummu17, serta mereka yakin akan adanya (kehidupan) akhirat18.","arabic":"وَٱلَّذِينَ يُؤۡمِنُونَ بِمَآ أُنزِلَ إِلَيۡكَ وَمَآ أُنزِلَ مِن قَبۡلِكَ وَبِٱلۡأٓخِرَةِ هُمۡ يُوقِنُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":11,"juzNumber":1,"footnotes":"17.  Kitab-kitab yang telah diturunkan sebelum Muhammad Ṣallallāhu ʻAlaihi wa Sallam ialah kitab-kitab yang diturunkan sebelum Al-Qur`ān, seperti Taurat, Zabur, Injil dan suhuf-suhuf yang tersebut dalam Al-Qur`ān yang diturunkan kepada para rasul, Allah Subḥānahu wa Ta‘ālā menurunkan kitab kepada rasul ialah dengan memberikan wahyu kepada Jibril ‘Alaihissalām. lalu Jibril ‘Alaihissalām  menyampaikannya kepada rasul. \n18.  Yakin ialah kepercayaan yang kuat dengan tidak dicampuri keraguan sedikit pun.  Kehidupan akhirat ialah kehidupan sesudah dunia berakhir.  Yakin akan adanya kehidupan akhirat ialah benar-benar percaya akan adanya kehidupan sesudah dunia berakhir.","lang":"id","version":{"key":"indonesian_complex","direction":"ltr","language_iso_code":"id","version":"1.0.0","last_update":1524085200,"title":"Indonesian Translation - King Fahd Complex","description":"Translation of the Quran meanings into Indonesian by approved Committee by Indonesian Ministry of Islamic Affairs. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-alladhīna yu'minūna bimā unzila ilayka wamā unzila min qablika wabil-ākhirati hum yūqinūna ","translations":["And those who","believe","in what","(is) sent down","to you","and what","was sent down","from","before you","and in the Hereafter","they","firmly believe","(4)"],"transliterationArr":["wa-alladhīna","yu'minūna","bimā","unzila","ilayka","wamā","unzila","min","qablika","wabil-ākhirati","hum","yūqinūna",null],"verseTiming":[[1,0,1170],[2,1170,2240],[3,2240,3950],[4,3950,5290],[5,5290,6040],[6,6040,7820],[7,7820,9070],[8,9070,9940],[9,9940,10720],[10,10720,12170],[11,12170,12540],[12,12540,15755]]}}