{"name":"30:3","price":"di negeri yang terdekat 1163 dan mereka sesudah dikalahkan itu akan menang ,1164","arabic":"فِيٓ أَدۡنَى ٱلۡأَرۡضِ وَهُم مِّنۢ بَعۡدِ غَلَبِهِمۡ سَيَغۡلِبُونَ","category":["30 (Ar-Rum)","Ar-Rum","Surah Ar-Rum","Chapter Ar-Rum","Rum","Surah Rum","Chapter Rum","Ar Rum","Surah Ar Rum","Chapter Ar Rum","Surah 30","Chapter 30","The Romans","الرُّوم"],"ayahNumber":3412,"juzNumber":21,"footnotes":"1163.  Maksudnya, terdekat ke negeri Arab, yaitu Suriah dan Palestina sewaktu menjadi jajahan kerajaan Romawi Timur.\n1164.  Bangsa Romawi adalah suatu bangsa yang beragama Nasrani yang mempunyai Kitab Suci, sedang bangsa Persia adalah beragama Majusi yang menyembah api dan berhala (musyrik).  Kedua bangsa itu saling perang-memerangi.  Ketika tersiar berita kekalahan bangsa Romawi oleh bangsa Persia,  kaum musyrik Mekah menyambutnya dengan penuh kegembiraan karena berpihak kepada orang musyrikin Persia.  Kaum muslimin sendiri berduka cita karenanya.  Kemudian, turunlah ayat ini dan ayat yang berikutnya menerangkan bahwa bangsa Romawi sesudah kalah itu akan mendapat kemenangan dalam masa beberapa tahun saja.  Hal itu benar-benar terjadi.  Beberapa tahun sesudah itu, menanglah bangsa Romawi dan kalahlah bangsa Persia.  Dengan kejadian yang demikian, nyatalah kebenaran Nabi Muhammad Ṣallallāhu ʻAlaihi wa Sallam sebagai nabi dan rasul dan kebenaran Al-Qur`ān sebagai firman Allah. ","lang":"id","version":{"key":"indonesian_complex","direction":"ltr","language_iso_code":"id","version":"1.0.0","last_update":1524085200,"title":"Indonesian Translation - King Fahd Complex","description":"Translation of the Quran meanings into Indonesian by approved Committee by Indonesian Ministry of Islamic Affairs. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"fī adnā al-arḍi wahum min baʿdi ghalabihim sayaghlibūna ","translations":["In","(the) nearest","land","But they","after","after","their defeat","will overcome","(3)"],"transliterationArr":["fī","adnā","al-arḍi","wahum","min","baʿdi","ghalabihim","sayaghlibūna",null],"verseTiming":[[1,0,2240],[2,2240,2770],[3,2770,3690],[4,3690,4430],[5,4430,5900],[6,5900,6500],[7,6500,7530],[8,7530,11095]]}}