{"name":"33:51","price":"Kamu boleh menangguhkan menggauli siapa yang kamu kehendaki di antara mereka (istri-istrimu) dan (boleh pula) menggauli siapa yang kamu kehendaki.  Dan siapa-siapa yang kamu ingini untuk menggaulinya kembali dari perempuan yang telah kamu cerai, maka tidak ada dosa bagimu.  Yang demikian itu adalah lebih dekat untuk ketenangan hati mereka, dan mereka tidak merasa sedih, dan semuanya rela dengan apa yang telah kamu berikan kepada mereka.  Dan Allah mengetahui apa yang (tersimpan) dalam hatimu.  Dan adalah Allah Maha Mengetahui lagi Maha Penyantun 1227.","arabic":"۞ تُرۡجِي مَن تَشَآءُ مِنۡهُنَّ وَتُـٔۡوِيٓ إِلَيۡكَ مَن تَشَآءُۖ وَمَنِ ٱبۡتَغَيۡتَ مِمَّنۡ عَزَلۡتَ فَلَا جُنَاحَ عَلَيۡكَۚ ذَٰلِكَ أَدۡنَىٰٓ أَن تَقَرَّ أَعۡيُنُهُنَّ وَلَا يَحۡزَنَّ وَيَرۡضَيۡنَ بِمَآ ءَاتَيۡتَهُنَّ كُلُّهُنَّۚ وَٱللَّهُ يَعۡلَمُ مَا فِي قُلُوبِكُمۡۚ وَكَانَ ٱللَّهُ عَلِيمًا حَلِيمٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab","Chapter Al-Ahzab","Ahzab","Surah Ahzab","Chapter Ahzab","Al Ahzab","Surah Al Ahzab","Chapter Al Ahzab","Surah 33","Chapter 33","The Combined Forces","الأحزَاب"],"ayahNumber":3584,"juzNumber":22,"footnotes":"1227. Menurut riwayat, pada suatu ketika istri-istri Nabi Muhammad Ṣallallāhu ʻAlaihi wa Sallam ada yang cemburu dan ada yang meminta tambahan belanja.  Nabi Muhammad Ṣallallāhu ʻAlaihi wa Sallam memutuskan perhubungan dengan mereka sampai sebulan lamanya. Oleh karena takut diceraikan nabi,  mereka datang kepada nabi menyatakan kerelaannya atas apa saja yang akan diperbuat nabi terhadap mereka. Turunnya ayat ini memberikan izin kepada nabi untuk menggauli siapa yang dikehendakinya dan istri-istrinya atau tidak menggaulinya dan juga memberi izin kepada nabi untuk rujuk kepada istri-istrinya seandainya ada istrinya yang sudah diceraikannya. ","lang":"id","version":{"key":"indonesian_complex","direction":"ltr","language_iso_code":"id","version":"1.0.0","last_update":1524085200,"title":"Indonesian Translation - King Fahd Complex","description":"Translation of the Quran meanings into Indonesian by approved Committee by Indonesian Ministry of Islamic Affairs. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"tur'jī man tashāu min'hunna watu'wī ilayka man tashāu wamani ib'taghayta mimman ʿazalta falā junāḥa ʿalayka dhālika adnā an taqarra aʿyunuhunna walā yaḥzanna wayarḍayna bimā ātaytahunna kulluhunna wal-lahu yaʿlamu mā fī qulūbikum wakāna al-lahu ʿalīman ḥalīman ","translations":["You may defer","whom","you will","of them","or you may take","to yourself","whom","you will","And whoever","you desire","of those whom","you (had) set aside ","then (there is) no","blame","upon you","That","(is) more suitable","that","may be cooled","their eyes","and not","they grieve","and they may be pleased","with what","you have given them ","all of them","And Allah","knows","what","(is) in","your hearts","And Allah is","And Allah is","All-Knower","Most Forbearing","(51)"],"transliterationArr":["tur'jī","man","tashāu","min'hunna","watu'wī","ilayka","man","tashāu","wamani","ib'taghayta","mimman","ʿazalta","falā","junāḥa","ʿalayka","dhālika","adnā","an","taqarra","aʿyunuhunna","walā","yaḥzanna","wayarḍayna","bimā","ātaytahunna","kulluhunna","wal-lahu","yaʿlamu","mā","fī","qulūbikum","wakāna","al-lahu","ʿalīman","ḥalīman",null],"verseTiming":[[1,0,820],[2,820,1610],[3,1610,3690],[4,3690,5080],[5,5080,7400],[6,7400,8120],[7,8120,9070],[8,9070,9920],[9,9920,11890],[10,11890,12390],[11,12390,13340],[12,13340,14430],[13,14430,15250],[14,15250,15770],[15,15770,16530],[16,16530,18240],[17,18240,19430],[18,19430,21030],[19,21030,21840],[20,21840,22650],[21,22650,24370],[22,24370,24850],[23,24850,26230],[24,26230,27220],[25,27220,28880],[26,28880,30900],[27,30900,32620],[28,32620,33940],[29,33940,34700],[30,34700,35030],[31,35030,35390],[32,35390,36870],[33,36870,37550],[34,37550,38290],[35,38290,39130],[36,39130,40735]]}}