{"name":"3:174","price":"Maka mereka kembali dengan nikmat dan karunia (yang besar) dari Allah, mereka tidak mendapat bencana apa-apa, mereka mengikuti keridaan Allah.  Dan Allah mempunyai karunia yang besar251.","arabic":"فَٱنقَلَبُواْ بِنِعۡمَةٖ مِّنَ ٱللَّهِ وَفَضۡلٖ لَّمۡ يَمۡسَسۡهُمۡ سُوٓءٞ وَٱتَّبَعُواْ رِضۡوَٰنَ ٱللَّهِۗ وَٱللَّهُ ذُو فَضۡلٍ عَظِيمٍ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":467,"juzNumber":4,"footnotes":"251.  Ayat 172, 173 dan 174, di atas membicarakan tentang peristiwa perang Badar Ṣugrā (Badar kecil) yang terjadi setahun sesudah perang Uḥud.  Sewaktu meninggalkan perang Uhud itu, Abu Sufyān, pemimpin orang Quraisy menantang Nabi Muhammad Ṣallallāhu ʻAlaihi wa Sallam dan sahabat-sahabat beliau bahwa dia bersedia bertemu kembali dengan kaum muslimin pada tahun berikutnya di Badar.  Tetapi, karena tahun itu (4 H) musim paceklik dan Abu Sufyān sendiri ketika itu merasa takut, maka dia beserta tentaranya tidak jadi meneruskan perjalanan ke Badar, lalu dia menyuruh Nuʻaym lbnu Masʻud dan kawan-kawan pergi ke Madinah untuk menakut-nakuti kaum muslimin dengan menyebarkan kabar bohong, seperti yang disebut dalam ayat 173.  Namun demikian, Nabi Muhammad Ṣallallāhu ʻAlaihi wa Sallam, beserta sahabat-sahabat tetap maju ke Badar.  Oleh karena tidak terjadi perang, dan pada waktu itu di Badar kebetulan musim pasar, maka kaum muslimin melakukan perdagangan dan memperoleh laba yang besar.  Keuntungan ini mereka bawa pulang ke Madinah seperti yang tersebut pada ayat 174. ","lang":"id","version":{"key":"indonesian_complex","direction":"ltr","language_iso_code":"id","version":"1.0.0","last_update":1524085200,"title":"Indonesian Translation - King Fahd Complex","description":"Translation of the Quran meanings into Indonesian by approved Committee by Indonesian Ministry of Islamic Affairs. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"fa-inqalabū biniʿ'matin mina al-lahi wafaḍlin lam yamsashum sūon wa-ittabaʿū riḍ'wāna al-lahi wal-lahu dhū faḍlin ʿaẓīmin ","translations":["So they returned","with (the) Favor","of","Allah","and Bounty","not","touched them","any harm","And they followed","(the) pleasure","(of) Allah","and Allah","(is) Possessor","(of) Bounty","great","(174)"],"transliterationArr":["fa-inqalabū","biniʿ'matin","mina","al-lahi","wafaḍlin","lam","yamsashum","sūon","wa-ittabaʿū","riḍ'wāna","al-lahi","wal-lahu","dhū","faḍlin","ʿaẓīmin",null],"verseTiming":[[1,0,2260],[2,2260,3590],[3,3590,4840],[4,4840,5870],[5,5870,6810],[6,6810,7460],[7,7460,8760],[8,8760,11910],[9,11910,13160],[10,13160,14230],[11,14230,16960],[12,16960,18100],[13,18100,18490],[14,18490,19400],[15,19400,21945]]}}