{"name":"48:10","price":"Bahwasanya orang-orang yang berjanji setia kepada kamu sesungguhnya mereka berjanji setia kepada Allah1397.  Tangan Allah di atas tangan mereka1398, maka barang siapa yang melanggar janjinya, niscaya akibat ia melanggar janji itu akan menimpa dirinya sendiri dan barang siapa menepati janjinya kepada Allah maka Allah akan memberinya pahala yang besar.","arabic":"إِنَّ ٱلَّذِينَ يُبَايِعُونَكَ إِنَّمَا يُبَايِعُونَ ٱللَّهَ يَدُ ٱللَّهِ فَوۡقَ أَيۡدِيهِمۡۚ فَمَن نَّكَثَ فَإِنَّمَا يَنكُثُ عَلَىٰ نَفۡسِهِۦۖ وَمَنۡ أَوۡفَىٰ بِمَا عَٰهَدَ عَلَيۡهُ ٱللَّهَ فَسَيُؤۡتِيهِ أَجۡرًا عَظِيمٗا","category":["48 (Al-Fath)","Al-Fath","Surah Al-Fath","Chapter Al-Fath","Fath","Surah Fath","Chapter Fath","Al Fath","Surah Al Fath","Chapter Al Fath","Surah 48","Chapter 48","The Victory","الفتح"],"ayahNumber":4593,"juzNumber":26,"footnotes":"1397.  Pada bulan Zulkaidah tahun keenam Hijriah Nabi Muhammad Ṣallallāhu ʻAlaihi wa Sallam beserta pengikut­pengikutnya hendak mengunjungi Mekah untuk melakukan umrah dan melihat keluarga-keluarga mereka yang telah lama ditinggalkan.  Sesampai di ῌudaybiyyah beliau berhenti dan mengutus ʻUṡmān bin ʻAffān lebih dahulu ke Mekah untuk menyampaikan maksud kedatangan beliau dan kaum muslimin. Mereka menanti-nanti kembalinya ʻUṡmān, tetapi tidak juga datang karena ʻUṡmān ditahan oleh kaum musyrikin, kemudian tersiar lagi kabar bahwa ʻUṡmān telah dibunuh.  Karena itu, Nabi Muhammad Ṣallallāhu ʻAlaihi wa Sallam menganjurkan agar kaum muslimin melakukan baiat (janji setia) kepada beliau.  Mereka pun mengadakan janji setia kepada Nabi dan mereka akan memerangi kaum Quraisy bersama Nabi Muhammad Ṣallallāhu ʻAlaihi wa Sallam sampai kemenangan tercapai.  Perjanjian setia ini telah diridai Allah Subḥānahu wa Ta‘ālā sebagaimana tersebut dalam ayat 18 surah ini, karena itu disebut \"Bayʻatur Riḍwān\"`.  Bayʻatur Riḍwān ini menggetarkan kaum musyrikin, sehingga mereka melepaskan ʻUṡmān dan mengirim utusan untuk mengadakan perjanjian damai dengan kaum muslimin.  Perjanjian ini terkenal dengan \"Ṣulḥul ῌudaybiyyah\". \n1398.  Orang yang berjanji setia biasanya berjabat tangan.  Cara berjanji setia dengan rasul ialah meletakkan tangan rasul di atas tangan orang yang berjanji itu.  Jadi, maksud tangan Allah Subḥānahu wa Ta‘ālā di atas tangan mereka ialah untuk menyatakan bahwa berjanji dengan Rasulullah Ṣallallāhu ʻAlaihi wa Sallam sama dengan berjanji dengan Allah Subḥānahu wa Ta‘ālā.  Jadi, seakan-akan tangan Allah Subḥānahu wa Ta‘ālā di atas tangan orang-orang yang berjanji itu.  Hendaklah diperhatikan bahwa Allah Subḥānahu wa Ta‘ālā  Maha Suci dari segala sifat-sifat yang menyerupai makhluk-Nya.","lang":"id","version":{"key":"indonesian_complex","direction":"ltr","language_iso_code":"id","version":"1.0.0","last_update":1524085200,"title":"Indonesian Translation - King Fahd Complex","description":"Translation of the Quran meanings into Indonesian by approved Committee by Indonesian Ministry of Islamic Affairs. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"inna alladhīna yubāyiʿūnaka innamā yubāyiʿūna al-laha yadu al-lahi fawqa aydīhim faman nakatha fa-innamā yankuthu ʿalā nafsihi waman awfā bimā ʿāhada ʿalayhu al-laha fasayu'tīhi ajran ʿaẓīman ","translations":["Indeed","those who","pledge allegiance to you","only","they pledge allegiance","(to) Allah","(The) Hand","(of) Allah","(is) over","their hands","Then whoever","breaks (his oath)","then only","he breaks","against","himself","and whoever","fulfils","what","he has covenanted","(with)","Allah","soon He will give him","a reward","great","(10)"],"transliterationArr":["inna","alladhīna","yubāyiʿūnaka","innamā","yubāyiʿūna","al-laha","yadu","al-lahi","fawqa","aydīhim","faman","nakatha","fa-innamā","yankuthu","ʿalā","nafsihi","waman","awfā","bimā","ʿāhada","ʿalayhu","al-laha","fasayu'tīhi","ajran","ʿaẓīman",null],"verseTiming":[[1,0,1280],[2,1280,2240],[3,2240,4030],[4,4030,5480],[5,5480,6960],[6,6960,7870],[7,7870,8250],[8,8250,9150],[9,9150,9820],[10,9820,11450],[11,11450,11940],[12,11940,13470],[13,13470,15200],[14,15200,16720],[15,16720,17330],[16,17330,18670],[17,18670,19350],[18,19350,20160],[19,20160,20820],[20,20820,21650],[21,21650,22540],[22,22540,23300],[23,23300,24810],[24,24810,25550],[25,25550,27235]]}}