{"name":"58:1","price":"Sesungguhnya Allah telah mendengar perkataan wanita yang memajukan gugatan kepada kamu tentang suaminya, dan mengadukan (halnya) kepada Allah.  Dan Allah mendengar soal jawab antara kamu berdua.  Sesungguhnya Allah Maha Mendengar lagi Maha Melihat1462.","arabic":"قَدۡ سَمِعَ ٱللَّهُ قَوۡلَ ٱلَّتِي تُجَٰدِلُكَ فِي زَوۡجِهَا وَتَشۡتَكِيٓ إِلَى ٱللَّهِ وَٱللَّهُ يَسۡمَعُ تَحَاوُرَكُمَآۚ إِنَّ ٱللَّهَ سَمِيعُۢ بَصِيرٌ","category":["58 (Al-Mujadila)","Al-Mujadila","Surah Al-Mujadila","Chapter Al-Mujadila","Mujadila","Surah Mujadila","Chapter Mujadila","Al Mujadila","Surah Al Mujadila","Chapter Al Mujadila","Surah 58","Chapter 58","The Pleading Woman","المجادلة"],"ayahNumber":5105,"juzNumber":28,"footnotes":"1462.  Sebab turunnya ayat ini ialah berhubungan dengan persoalan seorang wanita yang bernama Khaulah binti Ṡaʻlabah yang telah di-ẓihār oleh suaminya Aus bin Ṣāmit, yaitu dengan mengatakan kepada istrinya, \"Kamu bagiku sudah seperti punggung ibuku\", dengan maksud dia tidak boleh lagi menggauli istrinya, sebagaimana ia tidak boleh menggauli ibunya.  Menurut adat Jahiliah, kalimat ẓihār seperti itu sudah sama dengan menalak istri, Maka Khaulah mengadukan halnya itu kepada Rasulullah Ṣallallāhu ʻAlaihi wa Sallam.  Rasulullah Ṣallallāhu ʻAlaihi wa Sallam menjawab bahwa dalam hal ini belum ada keputusan Allah.  Dan pada riwayat yang lain Rasulullah Ṣallallāhu ʻAlaihi wa Sallam mengatakan, \"Engkau telah diharamkan bersetubuh dengan dia\".  Lalu Khaulah berkata, \"Suamiku belum menyebut kata-kata talak.  Kemudian Khaulah berulang-ulang mendesak kepada Rasulullah Ṣallallāhu ʻAlaihi wa Sallam supaya menetapkan suatu keputusan dalam hal ini, sehingga kemudian turunlah ayat ini dan ayat-ayat berikutnya. ","lang":"id","version":{"key":"indonesian_complex","direction":"ltr","language_iso_code":"id","version":"1.0.0","last_update":1524085200,"title":"Indonesian Translation - King Fahd Complex","description":"Translation of the Quran meanings into Indonesian by approved Committee by Indonesian Ministry of Islamic Affairs. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"qad samiʿa al-lahu qawla allatī tujādiluka fī zawjihā watashtakī ilā al-lahi wal-lahu yasmaʿu taḥāwurakumā inna al-laha samīʿun baṣīrun ","translations":["Indeed","Allah has heard","Allah has heard","(the) speech","(of one) who","disputes with you","concerning","her husband","and she directs her complaint","to","Allah","And Allah","hears","(the) dialogue of both of you","Indeed","Allah","(is) All-Hearer","All-Seer","(1)"],"transliterationArr":["qad","samiʿa","al-lahu","qawla","allatī","tujādiluka","fī","zawjihā","watashtakī","ilā","al-lahi","wal-lahu","yasmaʿu","taḥāwurakumā","inna","al-laha","samīʿun","baṣīrun",null],"verseTiming":[[1,0,370],[2,370,900],[3,900,1770],[4,1770,2310],[5,2310,3020],[6,3020,4120],[7,4120,4470],[8,4470,5450],[9,5450,7680],[10,7680,8000],[11,8000,8700],[12,8700,9690],[13,9690,10450],[14,10450,12120],[15,12120,13850],[16,13850,14610],[17,14610,16120],[18,16120,18735]]}}