{"name":"9:107","price":"Dan (di antara orang-orang munafik itu) ada orang-orang yang mendirikan masjid untuk menimbulkan kemudaratan (pada orang-orang mukmin), untuk kekafiran, dan untuk memecah belah antara orang-orang mukmin, serta menunggu kedatangan orang-orang yang telah memerangi Allah dan rasul-Nya sejak dahulu 660.  Mereka sesungguhnya bersumpah, \"Kami tidak menghendaki, selain kebaikan\".  Dan Allah menjadi saksi bahwa sesungguhnya mereka itu adalah pendusta (dalam sumpahnya).","arabic":"وَٱلَّذِينَ ٱتَّخَذُواْ مَسۡجِدٗا ضِرَارٗا وَكُفۡرٗا وَتَفۡرِيقَۢا بَيۡنَ ٱلۡمُؤۡمِنِينَ وَإِرۡصَادٗا لِّمَنۡ حَارَبَ ٱللَّهَ وَرَسُولَهُۥ مِن قَبۡلُۚ وَلَيَحۡلِفُنَّ إِنۡ أَرَدۡنَآ إِلَّا ٱلۡحُسۡنَىٰۖ وَٱللَّهُ يَشۡهَدُ إِنَّهُمۡ لَكَٰذِبُونَ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1342,"juzNumber":11,"footnotes":"660.  Maksud dari orang yang telah memerangi Allah Subḥānahu wa Ta‘ālā dan rasul-Nya sejak dahulu adalah seorang pendeta Nasrani bernama Abu ʻAmir  yang mereka tunggu-tunggu kedatangannya dari Suriah untuk salat di masjid yang mereka dirikan itu serta membawa tentara Romawi yang akan memerangi kaum muslimin.  Akan tetapi, kedatangan Abu ʻAmir ini tidak jadi karena ia mati di Syiria.  Masjid yang didirikan kaum munafik itu pun diruntuhkan atas perintah Rasulullah Ṣallallāhu ʻAlaihi wa Sallam berkenaan dengan Wahyu yang diterimanya sesudah kembali dari peperangan Tabuk. ","lang":"id","version":{"key":"indonesian_complex","direction":"ltr","language_iso_code":"id","version":"1.0.0","last_update":1524085200,"title":"Indonesian Translation - King Fahd Complex","description":"Translation of the Quran meanings into Indonesian by approved Committee by Indonesian Ministry of Islamic Affairs. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"wa-alladhīna ittakhadhū masjidan ḍirāran wakuf'ran watafrīqan bayna al-mu'minīna wa-ir'ṣādan liman ḥāraba al-laha warasūlahu min qablu walayaḥlifunna in aradnā illā al-ḥus'nā wal-lahu yashhadu innahum lakādhibūna ","translations":["And those who","take","a masjid","(for causing) harm","and (for) disbelief","and (for) division","among","the believers","and (as) a station","for whoever","warred","(against) Allah","and His Messenger","before","before","And surely they will swear","Not","we wish","except","the good","But Allah","bears witness","indeed, they","(are) surely liars","(107)"],"transliterationArr":["wa-alladhīna","ittakhadhū","masjidan","ḍirāran","wakuf'ran","watafrīqan","bayna","al-mu'minīna","wa-ir'ṣādan","liman","ḥāraba","al-laha","warasūlahu","min","qablu","walayaḥlifunna","in","aradnā","illā","al-ḥus'nā","wal-lahu","yashhadu","innahum","lakādhibūna",null],"verseTiming":[[1,0,1250],[2,1250,2460],[3,2460,4210],[4,4210,5880],[5,5880,7460],[6,7460,9560],[7,9560,10200],[8,10200,13850],[9,13850,16340],[10,16340,16980],[11,16980,18690],[12,18690,19990],[13,19990,20870],[14,20870,21750],[15,21750,22740],[16,22740,24270],[17,24270,25770],[18,25770,26610],[19,26610,29260],[20,29260,29730],[21,29730,32280],[22,32280,32970],[23,32970,34240],[24,34240,35750],[25,35750,36650],[26,36650,38540],[27,38540,41715]]}}