{"name":"9:2","price":"Maka berjalanlah kamu (kaum musyrikin) di muka bumi selama empat bulan, dan ketahuilah bahwa sesungguhnya kamu tidak akan dapat melemahkan Allah, dan sesungguhnya Allah menghinakan orang-orang kafir627.","arabic":"فَسِيحُواْ فِي ٱلۡأَرۡضِ أَرۡبَعَةَ أَشۡهُرٖ وَٱعۡلَمُوٓاْ أَنَّكُمۡ غَيۡرُ مُعۡجِزِي ٱللَّهِ وَأَنَّ ٱللَّهَ مُخۡزِي ٱلۡكَٰفِرِينَ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1237,"juzNumber":10,"footnotes":"627.  Sebelum turunnya ayat ini, ada perjanjian damai antara Nabi Muhammad Ṣallallāhu ʻAlaihi wa Sallam dengan orang­orang musyrikin.  Di antara isi perjanjian itu ialah tidak ada peperangan antara Nabi Muhammad Ṣallallāhu ʻAlaihi wa Sallam dengan orang-orang musyrikin, dan bahwa kaum muslimin dibolehkan berhaji ke Mekah dan tawaf sekeliling Kakbah.  Allah Subḥānahu wa Ta‘ālā membatalkan perjanjian itu dan mengizinkan kepada kaum muslimin memerangi kembali.  Maka turunlah ayat ini dan kaum musyrikin diberi kesempatan empat bulan lamanya di tanah Arab untuk memperkuat diri. ","lang":"id","version":{"key":"indonesian_complex","direction":"ltr","language_iso_code":"id","version":"1.0.0","last_update":1524085200,"title":"Indonesian Translation - King Fahd Complex","description":"Translation of the Quran meanings into Indonesian by approved Committee by Indonesian Ministry of Islamic Affairs. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"fasīḥū fī al-arḍi arbaʿata ashhurin wa-iʿ'lamū annakum ghayru muʿ'jizī al-lahi wa-anna al-laha mukh'zī al-kāfirīna ","translations":["So move about","in","the land","(during) four","months","but know","that you","(can) not","escape","Allah","and that","Allah","(is) the One Who (will) disgrace","the disbelievers","(2)"],"transliterationArr":["fasīḥū","fī","al-arḍi","arbaʿata","ashhurin","wa-iʿ'lamū","annakum","ghayru","muʿ'jizī","al-lahi","wa-anna","al-laha","mukh'zī","al-kāfirīna",null],"verseTiming":[[1,0,1090],[2,1090,1320],[3,1320,2170],[4,2170,3160],[5,3160,3770],[6,3770,5670],[7,5670,7130],[8,7130,9350],[9,9350,11180],[10,11180,11830],[11,11830,12680],[12,12680,13500],[13,13500,15140],[14,15140,16090],[15,16090,16690],[16,16690,20065]]}}