{"name":"9:60","price":"Sesungguhnya zakat-zakat itu, hanyalah untuk orang-orang fakir, orang-orang miskin, pengurus-pengurus zakat, para mualaf yang dibujuk hatinya, untuk (memerdekakan) budak, orang-orang yang berutang, untuk jalan Allah, dan orang-orang yang sedang dalam perjalanan, sebagai suatu ketetapan yang diwajibkan Allah; dan Allah Maha Mengetahui lagi Maha Bijaksana647.","arabic":"۞ إِنَّمَا ٱلصَّدَقَٰتُ لِلۡفُقَرَآءِ وَٱلۡمَسَٰكِينِ وَٱلۡعَٰمِلِينَ عَلَيۡهَا وَٱلۡمُؤَلَّفَةِ قُلُوبُهُمۡ وَفِي ٱلرِّقَابِ وَٱلۡغَٰرِمِينَ وَفِي سَبِيلِ ٱللَّهِ وَٱبۡنِ ٱلسَّبِيلِۖ فَرِيضَةٗ مِّنَ ٱللَّهِۗ وَٱللَّهُ عَلِيمٌ حَكِيمٞ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1295,"juzNumber":10,"footnotes":"647.  Yang berhak menerima zakat ialah:\n1. Orang fakir: orang yang amat sengsara hidupnya, tidak mempunyai harta dan tenaga untuk memenuhi penghidupannya. \n2. Orang miskin: orang yang tidak cukup penghidupannya dan dalam keadaan kekurangan. \n3. Pengurus zakat: orang yang diberi tugas untuk mengumpulkan dan membagikan harta zakat. \n4. Mualaf: orang kafir yang ada harapan masuk Islam dan orang yang baru masuk Islam yang imannya masih lemah. \n5. Memerdekakan budak: mencakup juga untuk melepaskan orang muslim yang ditawan oleh orang-orang kafir. \n6. Orang-orang yang berutang: orang yang berutang karena untuk kepentingan yang bukan maksiat dan tidak sanggup membayarnya.  Adapun orang yang berutang untuk memelihara persatuan umat Islam, dibayar utangnya itu dengan zakat, walaupun ia mampu membayarnya. \n7. Pada jalan Allah (fī sabīlillāh): yaitu untuk keperluan pertahanan Islam dan kaum muslimin.  Di antara ahli tafsir ada yang berpendapat bahwa fī sabīlillāh itu mencakup juga kepentingan-kepentingan umum, seperti mendirikan sekolah, rumah-rumah sakit, dan lain-lain. \n8. Orang yang sedang dalam perjalanan yang bukan maksiat mengalami kesengsaraan dalam perjalanannya","lang":"id","version":{"key":"indonesian_complex","direction":"ltr","language_iso_code":"id","version":"1.0.0","last_update":1524085200,"title":"Indonesian Translation - King Fahd Complex","description":"Translation of the Quran meanings into Indonesian by approved Committee by Indonesian Ministry of Islamic Affairs. Corrected by supervision of Rowwad Translation Center. The original translation is available for suggestions, continuous evaluation and development."},"meta":{"transliteration":"innamā al-ṣadaqātu lil'fuqarāi wal-masākīni wal-ʿāmilīna ʿalayhā wal-mu-alafati qulūbuhum wafī al-riqābi wal-ghārimīna wafī sabīli al-lahi wa-ib'ni al-sabīli farīḍatan mina al-lahi wal-lahu ʿalīmun ḥakīmun ","translations":["Only","the charities","(are) for the poor","and the needy","and those who collect","them","and the ones inclined","their hearts","and in","the (freeing of) the necks","and for those in debt","and in","(the) way","(of) Allah","and the wayfarer ","and the wayfarer ","an obligation","from","Allah","And Allah","(is) All-Knowing","All-Wise","(60)"],"transliterationArr":["innamā","al-ṣadaqātu","lil'fuqarāi","wal-masākīni","wal-ʿāmilīna","ʿalayhā","wal-mu-alafati","qulūbuhum","wafī","al-riqābi","wal-ghārimīna","wafī","sabīli","al-lahi","wa-ib'ni","al-sabīli","farīḍatan","mina","al-lahi","wal-lahu","ʿalīmun","ḥakīmun",null],"verseTiming":[[1,0,2019],[2,2019,3419],[3,3419,6499],[4,6499,8119],[5,8119,9789],[6,9789,10899],[7,10899,12679],[8,12679,14099],[9,14099,14509],[10,14509,15649],[11,15649,17499],[12,17499,18069],[13,18069,19309],[14,19309,19909],[15,19909,20549],[16,20549,23659],[17,23659,24889],[18,24889,25909],[19,25909,28999],[20,28999,30069],[21,30069,30989],[22,30989,34454]]}}