{"name":"10:47","price":"Òjíṣẹ́ ti wà fún ìjọ kọ̀ọ̀kan.¹ Nítorí náà, nígbà tí Òjíṣẹ́ wọn bá dé, A óò ṣèdájọ́ láààrin wọn pẹ̀lú déédé; A ò sì níí ṣàbòsí sí wọn.","arabic":"وَلِكُلِّ أُمَّةٖ رَّسُولٞۖ فَإِذَا جَآءَ رَسُولُهُمۡ قُضِيَ بَيۡنَهُم بِٱلۡقِسۡطِ وَهُمۡ لَا يُظۡلَمُونَ","category":["10 (Yunus)","Yunus","Surah Yunus","Chapter Yunus","Surah 10","Chapter 10","Jonah","يونُس"],"ayahNumber":1411,"juzNumber":11,"footnotes":"1. Āyah yìí àti tinú sūrah Fātir; 35:24 jẹ́ ọ̀kan nínú ọ̀nà tí ìjọ Ahmadiyyah gbà di kèfèrí. Ìdí ni pé, nítorí àwọn āyah wọ̀nyẹn ni ìjọ náà fi pe gbogbo òrìṣà ní ànábì Ọlọ́hun, àti pé wọ́n gbàgbọ́ pé kò sí ìlú tí Allāhu kò ti gbé òjíṣẹ́ kọ̀ọ̀kan dìde, títí dé ilẹ̀ Yorùbá, ilẹ̀ Haúsá, ilẹ̀ Yíbò àti bẹ́ẹ̀ bẹ́ẹ̀ lọ. Ìtọ́kasí wọn nìyí: “In pursuance of this doctrine, he (mirza Ghulam Ahmad al-Ƙadiyyaaniy) testified to the truth of Krishna, Ram Chandra and Buddha, the prophets of India, and Zoroaster, the prophet of Persia, and described the rejection of their claims as, in a sense, amounting to a denial of the universal Providence of God.” Ìtúmọ̀ “Láti lè tẹ̀lé ìgbàgbọ́ yìí ló mú kí mirza Ghulam Ahmad jẹ́rìí pé òdodo ni òrìṣà Krishna, òrìṣà Ram Chandra àti òrìṣà Buda, tí wọ́n jẹ́ àwọn ànábì ilẹ̀ India. Àti òrìṣà Zoroaster, tí ó jẹ́ ànábì ilẹ̀ Persia. Mirza Ghulam Ahmad sì gbà pé ẹni tí ó bá tako àwọn òrìṣà náà, ó ti tako oore tí Allāhu ṣe fún àgbáyé.” Ahmadiyyah Movement, láti ọwọ́ Bashirud-din Mahmud Ahmad, ojú ewé: 69.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"walikulli ummatin rasūlun fa-idhā jāa rasūluhum quḍiya baynahum bil-qis'ṭi wahum lā yuẓ'lamūna ","translations":["And for every","nation","(is) a Messenger","So when","comes","their Messenger","it will be judged","between them","in justice","and they","(will) not","be wronged","(47)"],"transliterationArr":["walikulli","ummatin","rasūlun","fa-idhā","jāa","rasūluhum","quḍiya","baynahum","bil-qis'ṭi","wahum","lā","yuẓ'lamūna",null],"verseTiming":[[1,0,1170],[2,1170,2810],[3,2810,6139],[4,6139,7509],[5,7509,9669],[6,9669,10959],[7,10959,11599],[8,11599,13279],[9,13279,14479],[10,14479,15069],[11,15069,15529],[12,15529,19034]]}}