{"name":"10:62","price":"Gbọ́, dájúdájú àwọn ọ̀rẹ́ Allāhu, kò níí sí ìbẹ̀rù (ìyà ọ̀run) fún wọn, wọn kò sì níí banújẹ́ (lórí oore ayé).¹","arabic":"أَلَآ إِنَّ أَوۡلِيَآءَ ٱللَّهِ لَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ","category":["10 (Yunus)","Yunus","Surah Yunus","Chapter Yunus","Surah 10","Chapter 10","Jonah","يونُس"],"ayahNumber":1426,"juzNumber":11,"footnotes":"1. Nínú èdè Lárúbáwá, ìtúmọ̀ “waliyyu” pọ̀. Nínú rẹ̀ ni ìwọ̀nyí; ọ̀rẹ́, alásùn-únmọ́, ọ̀rẹ́ àyò, alámòójútó, aláṣẹ, aláàbò, aláfẹ̀yìntì, alárànṣe àti bẹ́ẹ̀ bẹ́ẹ̀ lọ. Gbogbo àwọn ìtúmọ̀ wọ̀nyí ló so pọ̀ mọ́ra wọn. \n Ẹyọ ni “waliyyu”, ọ̀pọ̀ ni “’aoliyā’u”. Nínú āyah yìí “’aoliyā’u-llāh” túmọ̀ sí “àwọn ọ̀rẹ́ Allāhu” tàbí “àwọn alásùn-únmọ́ Allāhu”. Ọ̀rọ̀ ìdà kejì rẹ̀ ni “ ‘aduwwu-llāh” àwọn ọ̀tá Allāhu. “‘Aduwwu-llāh” ni ẹyọ, “ ‘a‘dā’u-llāh” ni ọ̀pọ̀. \n Nínú āyah 63 ni al-Ƙur’ān fúnra rẹ̀ ti mú oríkì wá fún “waliyyu-llāh”. Oríkì méjì tí ọ̀kan kò rọrọ̀ tayọ ìkejì rẹ̀ ni āyah náà sí mú wá. Àwọn ni “al-’Īmọ̄n” ìgbàgbọ́ òdodo àti “tẹƙwa-llāh” ìbẹ̀rù Allāhu. Ìyẹn ni pé, ẹnì kan kò níí jẹ́ “waliyyu-llāh” àfi kí ó jẹ́ mùsùlùmí onígbàgbọ́ òdodo àti olùbẹ̀rù Ọlọ́hun. \n ’Islām ní orígun márùn-ún, ’Īmọn ní orígun mẹ́fà, ìbẹ̀rù Ọlọ́hun sì ní orígun méjì. Ní ti àwọn orígun ’Islām márààrún; (ìkíní) ìjẹ́rìí pé dájúdájú kò sí ọlọ́hun kan tí a gbọ́dọ̀ jọ́sìn fún ní ọ̀nà òdodo àyàfi Allāhu àti ìjẹ́rìí pé dájúdájú Muhammad, Òjíṣẹ́ Allāhu ni, (ìkejì) kíkí ìrun wákàtí márààrún, (ìkẹta) gbígba ààwẹ̀ Rọmọdọ̄n, (ìkẹrin) yíyọ Zakāh, (ìkarùn-ún) ṣíṣe àbẹ̀wò sí Ilé Ọlọ́hun fún ẹni tó bá lágbára ọ̀nà láti dé ibẹ̀. \n Ní ti àwọn orígun ’Īmọ̄n mẹ́fẹ̀ẹ̀fà; (ìkíní) ìgbàgbọ́ òdodo nínú Allāhu, (ìkejì) ìgbàgbọ́ òdodo nínú àwọn mọlāika, (ìkẹta) ìgbàgbọ́ òdodo nínú àwọn Tírà sánmọ̀, (ìkẹrin) ìgbàgbọ́ òdodo nínú àwọn Òjíṣẹ́ Allāhu, (ìkarùn-ún) ìgbàgbọ́ òdodo nínú kádàrá, oore rẹ̀ àti aburú rẹ̀, (ìkẹfà) ìgbàgbọ́ òdodo nínú Ọjọ́ Ìkẹ́yìn. \n Ní ti àwọn orígun takwa-llāh méjèèjì; (ìkíní) títẹ̀lé ohun tí Allāhu pa láṣẹ tàbí ohun tí Ó ṣe ní halāl, (ìkejì) jíjìnnà sí ohun tí Allāhu kọ̀ tàbí tí Ó ṣe ní harām, yálà ó jẹ́ n̄ǹkan abẹ̀sìnjẹ́ tàbí aláìbẹ̀sìnjẹ́. Ẹnikẹ́ni nínú ènìyàn àti àlùjànnú tí ó bá gba ìròyìn pẹ̀lú gbogbo ìwọ̀nyẹn ní àpapọ̀ ni a mọ̀ sí ““waliyyu-llāh”. Irú ẹni náà kò níí yé máa ní àgbéga ipò “waliyyu-llāh” níwọ̀n ìgbà tí ó bá ń lékún sí i nínú gbogbo ìwọ̀nyẹn ní àpapọ̀. Àmọ́ kò sí bí onítọ̀ún ṣe lè wọ ipò “Ànábì Ọlọ́hun” tàbí ipò “Òjíṣẹ́ Ọlọ́hun. Èyí fi hàn kedere pé, ipò aṣíwájú pátápátá ni àwọn Ànábì Ọlọ́hun àti àwọn Òjíṣẹ́ Rẹ̀ wà sí gbogbo àwa ’aoliyā’u-llāh”. \n Kíyè sí i, “waliyyu-llāh” ni àwọn nasọ̄rọ̄ ń pè ní “wòlíì Ọlọ́hun”, bí ó tilẹ̀ jẹ́ pé kò sí “waliyyu-llāh” kan kan láààrin wọn gẹ́gẹ́ bí kò ṣe sí “waliyyu-llāh” kan kan nínú àwọn ọ̀ṣẹbọ nítorí pé, kò sí ẹnì kan nínú wọn tó gba ìròyìn pẹ̀lú àwọn oríkì “waliyyu-llāh”. \n Bákan náà, àwọn onisūfī sọ àwọn ògbólógbòó aládàádáálẹ̀ aṣíwájú wọn di “ ’aoliyā’u-llāh” dípò “ ’aoliyā’u-ṣṣaetọ̄n”. Ìdí ni pé, ojú ọ̀nà sunnah Ànábì wa Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - nìkan ṣoṣo ni ojú ọ̀nà tí ẹnikẹ́ni lè gba di “waliyyu-llāh” ní ìbámu si sūrah āli ‘Imrọ̄n; 3:31 àti sūrah an-Nisā’; 4:115. Ẹni tí ó bá ń tọ ojú ọ̀nà bíi Tijāniyyah, Ƙọ̄diriyyah, Ahmadiyyah, Ṣī’ah àti bẹ́ẹ̀ bẹ́ẹ̀ lọ, kò lè rọ́nà wọ inú agbo àwọn “ ’aoliyā’u-llāh” láéláé àyàfi tí ó bá padà sínú sunnah Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a -.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"alā inna awliyāa al-lahi lā khawfun ʿalayhim walā hum yaḥzanūna ","translations":["No doubt","Indeed","(the) friends","(of) Allah","(there will be) no","fear","upon then","and not","they","will grieve","(62)"],"transliterationArr":["alā","inna","awliyāa","al-lahi","lā","khawfun","ʿalayhim","walā","hum","yaḥzanūna",null],"verseTiming":[[1,0,2439],[2,2439,3919],[3,3919,6789],[4,6789,7899],[5,7899,8279],[6,8279,9179],[7,9179,10379],[8,10379,11059],[9,11059,11479],[10,11479,14944]]}}