{"name":"10:85","price":"Nítorí náà, wọ́n sọ pé: “Allāhu la gbáralé. Olúwa wa, má ṣe wá ní àdánwò¹ fún ìjọ alábòsí.","arabic":"فَقَالُواْ عَلَى ٱللَّهِ تَوَكَّلۡنَا رَبَّنَا لَا تَجۡعَلۡنَا فِتۡنَةٗ لِّلۡقَوۡمِ ٱلظَّٰلِمِينَ","category":["10 (Yunus)","Yunus","Surah Yunus","Chapter Yunus","Surah 10","Chapter 10","Jonah","يونُس"],"ayahNumber":1449,"juzNumber":11,"footnotes":"1. Ìyẹn ni pé, kí Allāhu má ṣe fi ọ̀tá ẹ̀sìn wa borí wa. Tàbí àdánwò tó máa kàn wá tí àwọn ọ̀tá ẹ̀sìn wa yóò fi lérò pé a kì í ṣe ẹni Allāhu, kí Allāhu má ṣe fi kàn wá. Ìdí ni pé, àdánwò tí Allāhu - subhānahu wa ta‘ālā - ń fi kan ẹ̀dá nílé ayé, kò ní n̄ǹkan kan ṣepọ̀ pẹ̀lú jíjẹ́ ẹni Ọlọ́hun tàbí àìjẹ́ ẹni Ọlọ́hun nítorí pé, Aṣèyí-ó-wùú ni Allāhu. Bí àpẹ̀ẹrẹ, ẹ wo àdánwò àìlera tí Allāhu fi kan Ànábì ’Ayyūb - kí ọlà Allāhu máa bá a -, tòhun ti bí ó ṣe jẹ́ Òjíṣẹ́ Ọlọ́hun! Ànábì Yūsuf - kí ọlà Allāhu máa bá a - di ẹni tí wọ́n fi sínú ẹ̀wọ̀n lórí ẹ̀sùn ìparọ́-sìná-mọ́ni, tòhun ti bí ó ṣe jẹ́ Òjíṣẹ́ Ọlọ́hun! Nítorí náà, mùsùlùmí bùkátà sí ìrawọ́rasẹ̀ sí Allāhu - subhānahu wa ta‘ālā -.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"faqālū ʿalā al-lahi tawakkalnā rabbanā lā tajʿalnā fit'natan lil'qawmi al-ẓālimīna ","translations":["Then they said","Upon","Allah","we put our trust","Our Lord","(Do) not","make us","a trial","for the people ","the wrongdoers","(85)"],"transliterationArr":["faqālū","ʿalā","al-lahi","tawakkalnā","rabbanā","lā","tajʿalnā","fit'natan","lil'qawmi","al-ẓālimīna",null],"verseTiming":[[1,0,1020],[2,1020,1500],[3,1500,2410],[4,2410,3890],[5,3890,5090],[6,5090,5470],[7,5470,6780],[8,6780,7680],[9,7680,8930],[10,8930,13295]]}}