{"name":"10:9","price":"Dájúdájú àwọn tó gbàgbọ́ ní òdodo, tí wọ́n sì ṣe àwọn iṣẹ́ rere, Olúwa wọn yóò fi ìgbàgbọ́ òdodo wọn tọ́ wọn sọ́nà.¹ Àwọn odò yó sì máa ṣàn ní ìsàlẹ̀ ọ̀dọ̀ wọn nínú Ọgbà Ìdẹ̀ra.","arabic":"إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ يَهۡدِيهِمۡ رَبُّهُم بِإِيمَٰنِهِمۡۖ تَجۡرِي مِن تَحۡتِهِمُ ٱلۡأَنۡهَٰرُ فِي جَنَّٰتِ ٱلنَّعِيمِ","category":["10 (Yunus)","Yunus","Surah Yunus","Chapter Yunus","Surah 10","Chapter 10","Jonah","يونُس"],"ayahNumber":1373,"juzNumber":11,"footnotes":"1. “Ìgbàgbọ́ òdodo” tó jẹyọ nínú gbólóhùn “àwọn tó gbàgbọ́ ní òdodo” àti gbólóhùn “Olúwa wọn yóò fi ìgbàgbọ́ òdodo wọn tọ́ wọn sọ́nà.” jẹ́ n̄ǹkan kan náà. Ìtúmọ̀ rẹ̀ sì ni ìwọ̀nyí: \n (Ìkíní); Ìgbàgbọ́ òdodo yóò máa ṣe atọ́nà onígbàgbọ́ òdodo lọ síbi àlékún iṣẹ́ rere títí ọjọ́ ikú rẹ̀. \n (Ìkejì); Ìgbàgbọ́ òdodo yóò yọ sí onígbàgbọ́ òdodo ní àwòrán ẹ̀dá tó rẹwà jùlọ pẹ̀lú ìmọ́lẹ̀ tó lágbára jùlọ lọ́jọ́ tí onígbàgbọ́ òdodo náà bá jíǹde nínú sàréè rẹ̀ lọ́jọ́ Àjíǹde. Àwòrán iṣẹ́ rere yìí yó sì máa darí rẹ̀ lọ títí olówó rẹ̀ máa fi wọ inú Ọgbà Ìdẹ̀ra.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"inna alladhīna āmanū waʿamilū al-ṣāliḥāti yahdīhim rabbuhum biīmānihim tajrī min taḥtihimu al-anhāru fī jannāti al-naʿīmi ","translations":["Indeed","those who","believed","and did","good deeds","(will) guide them","their Lord","by their faith","Will flow","from","underneath them","the rivers","in","Gardens","(of) Delight","(9)"],"transliterationArr":["inna","alladhīna","āmanū","waʿamilū","al-ṣāliḥāti","yahdīhim","rabbuhum","biīmānihim","tajrī","min","taḥtihimu","al-anhāru","fī","jannāti","al-naʿīmi",null],"verseTiming":[[1,0,1540],[2,1540,2620],[3,2620,3950],[4,3950,4700],[5,4700,6360],[6,6360,7740],[7,7740,9990],[8,9990,11800],[9,11800,13220],[10,13220,13890],[11,13890,15450],[12,15450,16880],[13,16880,17320],[14,17320,19300],[15,19300,23575]]}}