{"name":"11:108","price":"Ní ti àwọn tí A bá ṣe ní olórí-ire, wọ́n máa wà nínú Ọgbà Ìdẹ̀ra. Olùṣegbére ni wọ́n nínú rẹ̀ ní òdíwọ̀n ìgbà tí àwọn sánmọ̀ àti ilẹ̀ fi ń bẹ¹, àfi ohun tí Olúwa rẹ bá fẹ́.² (Ọgbà Ìdẹ̀ra jẹ́) ọrẹ àìlópin.","arabic":"۞ وَأَمَّا ٱلَّذِينَ سُعِدُواْ فَفِي ٱلۡجَنَّةِ خَٰلِدِينَ فِيهَا مَا دَامَتِ ٱلسَّمَٰوَٰتُ وَٱلۡأَرۡضُ إِلَّا مَا شَآءَ رَبُّكَۖ عَطَآءً غَيۡرَ مَجۡذُوذٖ","category":["11 (Hud)","Hud","Surah Hud","Chapter Hud","Surah 11","Chapter 11","Hud","هود"],"ayahNumber":1581,"juzNumber":12,"footnotes":"1. Bíbẹ nínú Iná àti bíbẹ nínú Ọgbà Ìdẹ̀ra ní òdiwọ̀n ìgbà tí àwọn sánmọ̀ àti ilẹ̀ fi ń bẹ kò túmọ̀ sí pé òpin yóò dé bá Iná àti Ọgbà Ìdẹ̀ra gẹ́gẹ́ bí òpin yóò ṣe dé bá àwọn sánmọ̀ àti ilẹ̀. Ṣùgbọ́n ọ̀nà ìbátan níbi àfiwé tí ń bẹ láààrin àwọn méjéèjì ni pé, ó jẹ́ ara ẹwà èdè láti ṣe àfihàn ìgbà pípẹ́ fún n̄ǹkan. Lára irúfẹ èyí náà ni, bí àpẹ̀ẹrẹ, kí ọkùnrin kan sọ pé, “Èmi yóò máa jẹ́ ọkúnrin ní òdiwọ̀n ìgbà tí ilẹ̀ bá ń ṣú, tí ilẹ̀ bá ń mọ́.” \n Ṣíwájú sí i, ìgbàgbọ́ àwa mùsùlùmí ahlu-sunnah wal-janmọ̄n‘ah ni pé, kò sí òpin ìgbà fún Iná àti Ọgbà Ìdẹ̀ra ní ọ̀run. Bí ó tilẹ̀ jẹ́ pé, àwọn kan lè kọ́kọ́ wọ inú Iná ṣíwájú kí Allāhu - tó ga jùlọ - tó padà mú wọn jáde kúrò nínú rẹ̀ pẹ̀lú àánú Rẹ̀ tàbí pẹ̀lú ìṣìpẹ̀ Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a -. Lẹ́yìn náà, ó máa ṣẹ́ ku kìkìdá àwọn ọmọ Iná Gbére, wọn yó sì ṣe gbére nínú Iná. \n Ní ìdà kejì ẹ̀wẹ̀, ẹnikẹ́ni tí ó bá wọ Ọgbà Ìdẹ̀ra, ó máa ṣe gbére nínú rẹ̀ ni. Kò sì níí sí ẹnì kan tí ó máa ti inú Ọgbà Ìdẹ̀ra bọ́ sínú Iná Gbére. \n Ẹ̀rí nínú sunnah Ànábì wa - kí ìkẹ́ àti ọlà Allāhu máa bá a -, tí á tún lè fi ní àgbọ́yé àwọn āyah wọ̀nyí dáradára ni hadīth Abu-Sa‘īd al-Kudri - kí Allāhu yọ́nú sí i -. Ó sọ pé, Òjíṣẹ́ Allāhu - kí ìkẹ́ àti ọlà Allāhu máa bá a - sọ pé: “Ní Ọjọ́ Àjíǹde, wọn yóò mú Ikú wá ní ìrísí àgbò funfun, tí ó ní dúdú lára. Olùpèpè kan yó sì pèpè báyìí pé, “Ẹ̀yin ará Ọgbà Ìdẹ̀ra”. Àwọn ará Ọgbà Ìdẹ̀ra yó sì narùn jáde síta, wọn yóò wo (ìta). Olùpèpè yó sì sọ pé: “Ǹjẹ́ ẹ̀yin mọ èyí?” Wọn yóò sọ pé: “Bẹ́ẹ̀ ni, èyí ni Ikú.” Ẹnì kọ̀ọ̀kan wọn sì máa rí i. Lẹ́yìn náà, olùpèpè máa pèpè báyìí pé, “Ẹ̀yin ará Iná”. Àwọn ará Iná yó sì narùn jáde síta, wọn yóò wo (ìta). Olùpèpè yó sì sọ pé: “Ǹjẹ́ ẹ̀yin mọ èyí?” Wọn yóò wí pé: “Bẹ́ẹ̀ ni, èyí ni Ikú.” Ẹnì kọ̀ọ̀kan wọn sì máa rí i. Nígbà náà, A óò pa Ikú. Lẹ́yìn náà, olùpèpè kan yóò sọ pé: “Ẹ̀yin ará Ọgbà Ìdẹ̀ra, gbére (ni tiyín báyìí nínú Ọgbà Ìdẹ̀ra), kò sì sí Ikú mọ́. Olùpèpè yóò tún sọ pé: “Ẹ̀yin ará Iná, gbére (ni tiyín báyìí nínú Iná), kò sì sí Ikú mọ́.” Al-Bukāriy; Kitāb at-Tafsīr. \n 2. Awẹ́ gbólóhùn yìí “àfi ohun tí Olúwa rẹ bá fẹ́”, àgbọ́yé rẹ̀ ni pípẹ́ tí àwọn kan yóò pẹ́ kí wọ́n tó wọ inú Ọgbà Ìdẹ̀ra. Ó kúkú ti hàn kedere pé àwọn kan yóò ṣíwájú àwọn mìíràn wọ inú Ọgbà Ìdẹ̀ra látára bí ìrìn-àjò ẹ̀dá bá ṣe rí lórí afárá Iná.\n Bákàn náà, àwọn ẹlẹ́ṣẹ̀ kan yóò kọ́kọ́ wọ inú Iná ṣíwájú kí wọ́n tó wọ inú Ọgbà Ìdẹ̀ra. Àti pé àwọn kan wulẹ̀ ti wà nínú Ọgbà Ìdẹ̀ra ṣíwájú Ọjọ́ Àjíǹde ẹ̀dá. Àwọn wọ̀nyí ni àwọn tí wọ́n kú sí ipò ṣẹhīd, gẹ́gẹ́ bí a ti ṣe mú hadīth wá lórí èyí nínú ìtọsẹ̀-ọ̀rọ̀ sūrah al-Baƙọrah; 2:154.\n Nítorí náà, nípa ti èrò Ọgbà Ìdẹ̀ra, “àfi ohun tí Olúwa rẹ bá fẹ́” túmọ̀ sí “àfi pípẹ́ tí Olúwa rẹ bá fẹ́ fún àwọn kan láti pẹ́ wọ inú Ọgbà Ìdẹ̀ra.” Nígbà tí gbogbo wọn bá sì péjú pésẹ̀ tán sínú rẹ̀, wọn yó sì máa wà nínú rẹ̀ títí láéláé. Èyí yóò rí bẹ́ẹ̀ lẹ́yìn tí wọ́n bá pa Ikú. Kí Allāhu jẹ́ kí á tètè wọ inú Ọgbà Ìdẹ̀ra. \n Ní ìsọníṣókí, ìyàtọ̀ wà nínú àgbọ́yé “àfi ohun tí Olúwa rẹ bá fẹ́” nípa ti èrò Iná àti “àfi ohun tí Olúwa rẹ bá fẹ́” nípa ti èrò Ọgbà Ìdẹ̀ra. Àmọ́ àgbọ́yé àwọn méjèèjì kò jẹmọ́ pé òpin máa dé bá Iná àti Ọgbà Ìdẹ̀ra. Ọgbà gbére ni méjèèjì. Ẹ wo ìtọsẹ̀-ọ̀rọ̀ sūrah as-Sajdah; 32:20.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"wa-ammā alladhīna suʿidū fafī al-janati khālidīna fīhā mā dāmati al-samāwātu wal-arḍu illā mā shāa rabbuka ʿaṭāan ghayra majdhūdhin ","translations":["And as for","those who","were glad","then (they will be) in","Paradise","(will be) abiding","therein","as long as remains","as long as remains","the heavens","and the earth","except","what your Lord wills ","what your Lord wills ","what your Lord wills ","a bestowal","not","interrupted","(108)"],"transliterationArr":["wa-ammā","alladhīna","suʿidū","fafī","al-janati","khālidīna","fīhā","mā","dāmati","al-samāwātu","wal-arḍu","illā","mā","shāa","rabbuka","ʿaṭāan","ghayra","majdhūdhin",null],"verseTiming":[[1,0,1750],[2,1750,2850],[3,2850,3680],[4,3680,4220],[5,4220,6120],[6,6120,7330],[7,7330,8500],[8,8500,10250],[9,10250,11290],[10,11290,11650],[11,11650,12530],[12,12530,14240],[13,14240,15240],[14,15240,16120],[15,16120,16520],[16,16520,19020],[17,19020,19890],[18,19890,23460],[19,23460,24040],[20,24040,27895]]}}