{"name":"12:24","price":"(Obìnrin náà) kúkú gbèrò eré ìfẹ́ sí i. Òun náà gbèrò rẹ̀.¹ Tí kò bá jẹ́ pé ó rí ẹ̀rí Olúwa rẹ̀ (pé harāmu ni sìná, ìbá súnmọ́ ọn). Báyẹn ni (ọ̀rọ̀ náà rí) nítorí kí Á lè ṣẹ́rí aburú àti sìná ṣíṣe kúrò lọ́dọ̀ rẹ̀. Dájúdájú ó wà nínú àwọn ẹrúsìn Wa, àwọn tí A ṣà lẹ́ṣà (fún ipò ànábì).”","arabic":"وَلَقَدۡ هَمَّتۡ بِهِۦۖ وَهَمَّ بِهَا لَوۡلَآ أَن رَّءَا بُرۡهَٰنَ رَبِّهِۦۚ كَذَٰلِكَ لِنَصۡرِفَ عَنۡهُ ٱلسُّوٓءَ وَٱلۡفَحۡشَآءَۚ إِنَّهُۥ مِنۡ عِبَادِنَا ٱلۡمُخۡلَصِينَ","category":["12 (Yusuf)","Yusuf","Surah Yusuf","Chapter Yusuf","Surah 12","Chapter 12","Joseph","يوسُف"],"ayahNumber":1620,"juzNumber":12,"footnotes":"1. Ànábì Yūsuf - kí ọlà Allāhu máa bá a - kò di ẹlẹ́ṣẹ̀ látara bí èròǹgbà ìyàwó ọ̀gá rẹ̀ ṣe tì í sínú èròkérò ní ìbámu sí hadīth ọmọ ‘Abbās - kí Allāhu yọ́nú sí àwọn méjèèjì -, láti ọ̀dọ̀ Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - nínú ohun tí ó gbà lẹ́gbàwá làti ọ̀dọ̀ Olúwa rẹ̀ - tó ga jùlọ -. Ó sọ pé: “Dájúdájú Allāhu ti ṣe àkọsílẹ̀ àwọn iṣẹ́ rere àti àwọn iṣẹ́ ibi sínú kádàrá. Lẹ́yìn náà, Ó ṣàlàyé èyí (fún ẹ̀dá). Nítorí náà, ẹnikẹ́ni tí ó bá gbèrò iṣẹ́ rere kan, kò sì ṣe é, Allāhu yóò kọ ọ́ sílẹ̀ fún un lọ́dọ̀ Rẹ̀ ní iṣẹ́ rere tó pé pérépéré. Tí ó bá sì gbèrò rẹ̀, tí ó sì rí i ṣe, Allāhu yóò kọ ọ́ sílẹ̀ fún un lọ́dọ̀ Rẹ̀ ní iṣẹ́ rere mẹ́wàá, títí dé ọgọ́rùn-ún méje àdìpèlé, títí dé àdìpèlé lọ́pọ̀lọ́pọ̀. Ẹnikẹ́ni tí ó bá gbèrò iṣẹ́ ibi kan, kò sì ṣe é, Allāhu yóò kọ ọ́ sílẹ̀ fún un lọ́dọ̀ Rẹ̀ ní iṣẹ́ rere tó pé pérépéré (fún gbígbé iṣẹ́ ibi jù sílẹ̀). Tí ó bá sì gbèrò rẹ̀, tí ó sì rí i ṣe, Allāhu yóò kọ ọ́ sílẹ̀ fún un lọ́dọ̀ Rẹ̀ ní iṣẹ́ ibi ẹyọ kan.” Bukāriy àti Muslim","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"walaqad hammat bihi wahamma bihā lawlā an raā bur'hāna rabbihi kadhālika linaṣrifa ʿanhu al-sūa wal-faḥshāa innahu min ʿibādinā al-mukh'laṣīna ","translations":["And certainly","she did desire","him","and he would have desired","her","if not","that","he saw","the proof","(of) his Lord","Thus","that We might avert","from him","the evil","and the immorality","Indeed, he","(was) of","Our slaves","the sincere","(24)"],"transliterationArr":["walaqad","hammat","bihi","wahamma","bihā","lawlā","an","raā","bur'hāna","rabbihi","kadhālika","linaṣrifa","ʿanhu","al-sūa","wal-faḥshāa","innahu","min","ʿibādinā","al-mukh'laṣīna",null],"verseTiming":[[1,0,970],[2,970,2490],[3,2490,3160],[4,3160,4630],[5,4630,5520],[6,5520,7770],[7,7770,8040],[8,8040,8900],[9,8900,10080],[10,10080,11500],[11,11500,12610],[12,12610,13690],[13,13690,14360],[14,14360,16810],[15,16810,20460],[16,20460,22570],[17,22570,23010],[18,23010,24090],[19,24090,27615]]}}