{"name":"13:15","price":"Allāhu ni àwọn tó wà nínú àwọn sánmọ̀ àti ilẹ̀ ń forí kanlẹ̀ fún, wọ́n fẹ́, wọ́n kọ̀, - òòji wọn (náà ń ṣe bẹ́ẹ̀) - ní òwúrọ̀ àti ní ìrọ̀lẹ́.¹","arabic":"وَلِلَّهِۤ يَسۡجُدُۤ مَن فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ طَوۡعٗا وَكَرۡهٗا وَظِلَٰلُهُم بِٱلۡغُدُوِّ وَٱلۡأٓصَالِ۩","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd","Chapter Ar-Ra'd","Ra'd","Surah Ra'd","Chapter Ra'd","Ar Ra'd","Surah Ar Ra'd","Chapter Ar Ra'd","Surah 13","Chapter 13","The Thunder","الرَّعد"],"ayahNumber":1722,"juzNumber":13,"footnotes":"1. Àwọn sūfī (Tijāniyyah) ṣi āyah yìí àti tinú sūrah an-Nahl; 16:49 túmọ̀ lábẹ́ àdìsọ́kàn wọn tí wọ́n ń pè ní “‘Ilmu bātiniy” - “Ìmọ̀ Awo-inú”. Àwọn sūfī (Tijāniyyah) sọ pé, pẹ̀lú àwọn āyah méjèèjì wọ̀nyẹn, “gbogbo olùjọ́sìn tàbí olùforíkanlẹ̀ fún n̄ǹkan mìíràn lẹ́yìn Allāhu lójú-ìta, kò jọ́sìn kò sì forí kanlẹ̀ fún kiní kan àyàfi Allāhu (ta‘ālā) nítorí pé, Òun l’Ó wà nínú àwọn aṣọ wọ̀nyẹn.” (Jawāhir al Ma‘āniy wa Bulūg al ’Amọ̄niy) Irọ́ ńlá nìyí. Mímọ́ sì ni fún Allāhu tayọ ìsọkúsọ wọn. Āyah onípọ́n-na ni āyah méjèèjì wọ̀nyẹn. Pọ́n-na inú wọn ni pé, kò sí ẹni tí kì í forí kanlẹ̀ fún Allāhu. Èyí ni àwọn sūfī ṣe àfikún rẹ̀ pé, “Kódà kí ó forí kanlẹ̀ fún òrìṣà, Allāhu nínú àwòrán òrìṣà ló ń forí kanlẹ̀ fún!” \n Kíyè sí i, ìgbàkígbà tí a bá rí āyah onípọ́n-na, āyah aláìnípọ́n-na ni a máa fi yanjú rẹ̀, gẹ́gẹ́ bí Allāhu ṣe fi èyí rinlẹ̀ nínú sūrah āli ‘Imrọ̄n; 3:7. Nítorí náà, sūrah al-Hajj;22:18 àti sūrah al-̓Anbiyā’; 21:98 ti yọ pọ́n-na tí ó jẹyọ nínú āyah méjèèjì náà. Ní ti sūrah al-Hajj;22:18, òhun fi rinlẹ̀ pé ọ̀pọ̀lọ́pọ̀ ni kò forí kanlẹ̀ fún Allāhu. Ní ti sūrah al-̓Anbiyā’; 21:98, òhun sì fi rinlẹ̀ pé àwọn tó ń forí kanlẹ̀ fún n̄ǹkan mìíràn lẹ́yìn Allāhu, àti àwọn àti òrìṣà wọn ló máa wọ inú Iná nítorí pé, wọn kò forí kanlẹ̀ fún Allāhu, wọn kò sì jọ́sìn fún Un. Èyí ti túmọ̀ sí pé, sūrah ar-Ra‘d; 13:15 àti sūrah an-Nahl; 16:49 kò kan olùforíkanlẹ̀ àti olùjọ́sìn fún n̄ǹkan mìíràn lẹ́yìn Allāhu. Nítorí náà, gbólóhùn “wọ́n fẹ́” dúró fún àwọn onígbàgbọ́ òdodo; “wọ́n kọ̀” sì dúró fún àwọn munāfiki. Ẹ tún wo ìtọsẹ̀-ọ̀rọ̀ sūrah ar-Rūm; 30:26.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"walillahi yasjudu man fī al-samāwāti wal-arḍi ṭawʿan wakarhan waẓilāluhum bil-ghuduwi wal-āṣāli ","translations":["And to Allah","prostrates","whoever","(is) in","the heavens","and the earth","willingly","or unwillingly","and (so do) their shadows","in the mornings","and in the afternoons","(15)"],"transliterationArr":["walillahi","yasjudu","man","fī","al-samāwāti","wal-arḍi","ṭawʿan","wakarhan","waẓilāluhum","bil-ghuduwi","wal-āṣāli",""],"verseTiming":[[1,0,1580],[2,1580,2470],[3,2470,3480],[4,3480,3730],[5,3730,5440],[6,5440,6580],[7,6580,7940],[8,7940,9510],[9,9510,11510],[10,11510,13710],[11,13710,17205]]}}