{"name":"13:14","price":"TiRẹ̀ ni ìpè òdodo. Àwọn tí wọ́n ń pè lẹ́yìn Rẹ̀, wọn kò lè fi kiní kan jẹ́ pè wọn àfi bí ẹni tí ó tẹ́wọ́ rẹ̀ méjèèjì (lásán) sí omi nítorí kí omi lè dé ẹnu rẹ̀. Omi kò sì lè dé ẹnu rẹ̀. Àdúà (àti ìpè) àwọn aláìgbàgbọ́ kò sì jẹ́ kiní kan bí kò ṣe sínú ìṣìnà.¹","arabic":"لَهُۥ دَعۡوَةُ ٱلۡحَقِّۚ وَٱلَّذِينَ يَدۡعُونَ مِن دُونِهِۦ لَا يَسۡتَجِيبُونَ لَهُم بِشَيۡءٍ إِلَّا كَبَٰسِطِ كَفَّيۡهِ إِلَى ٱلۡمَآءِ لِيَبۡلُغَ فَاهُ وَمَا هُوَ بِبَٰلِغِهِۦۚ وَمَا دُعَآءُ ٱلۡكَٰفِرِينَ إِلَّا فِي ضَلَٰلٖ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd","Chapter Ar-Ra'd","Ra'd","Surah Ra'd","Chapter Ra'd","Ar Ra'd","Surah Ar Ra'd","Chapter Ar Ra'd","Surah 13","Chapter 13","The Thunder","الرَّعد"],"ayahNumber":1721,"juzNumber":13,"footnotes":"1. Nínú sūrah al-Baƙọrah; 2:186, Allāhu - subhānahu wa ta'ālā - fi kalmọh “rọṣād” parí àdúà àwọn onígbàgbọ́ òdodo (ìyẹn, “la‘llahum yẹrṣudūn”) àmọ́ nínú sūrah yìí àti sūrah Gọ̄fir; 40:50 , Ó fi kalmọh “dọlāl” parí àdúà àwọn aláìgbàgbọ́. “Rọṣād” túmọ̀ sí “ìmọ̀nà”, “dọlāl” sì túmọ̀ sí “ìṣìnà”. Àdúà tó wà lórí ìmọ̀nà ni àdúà tó máa lọ tààrà sọ́dọ̀ Allāhu. Àdúà náà sì máa jẹ́ àtẹ́wọ́gbà. Èyí ni Allāhu fi rinlẹ̀ nínú sūrah aṣ-Ṣūrọ̄; 42:26. Àmọ́ àdúà tó wà lórí ìṣìnà, kò níí lọ sọ́dọ̀ Allāhu. Ẹ̀dá tí wọ́n sì dojú àdúà kọ kò níí gbọ́ ìpè náà, áḿbọ̀sìbọ́sí pé ó máa jẹ́pè rẹ̀ (ní ìbámu sí sūrah al-’Ahƙọ̄f; 46:5). Kò sì sí ẹni tí ó ń gba àdúà lẹ́yìn Allāhu. Ìdí nìyí tí àdúà náà fi máa gúnlẹ̀ sí èbúté anù àti òfò. Kí á wá wòye sí àwọn n̄ǹkan méjì wọ̀nyí: Ìkíní: Ọ̀nà wo ni àwọn aláìgbàgbọ́ ń gbà rí oore láyé? Kò sí oore ayé kan ní'lé ayé tí ó lè tẹ aláìgbàgbọ́ lọ́wọ́ nípasẹ̀ àdúà bí kò ṣe nípasẹ̀ ìpín kan tí ó wà fún un nínú kádàrá rẹ̀. Àmọ́ ní ti onígbàgbọ́ òdodo, oore inú kádàrá àti oore àdúà ló wà fún un níwọ̀n ìgbà tí àdúà rẹ̀ bá ti wà ní ìbámu sí sunnah Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - .\n Ìkejì: Ìdí tí kò fi sí gbígbà àdúà fún àwọn aláìgbàgbọ́ ni pé, wọ́n dojú àdúà wọn kọ àwọn ẹ̀dá kan lẹ́yìn Allāhu - tó ga jùlọ - . Bí mùsùlùmí kan bá ṣe bẹ́ẹ̀, tàbí ó ṣe “āmīn” sí àdúà ẹni tí ó ṣe bẹ́ẹ̀, òun náà kò níí rí gbígbà àdúà náà, ẹ̀sìn rẹ̀ sì máa bàjẹ́ pẹ̀lú.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"lahu daʿwatu al-ḥaqi wa-alladhīna yadʿūna min dūnihi lā yastajībūna lahum bishayin illā kabāsiṭi kaffayhi ilā al-māi liyablugha fāhu wamā huwa bibālighihi wamā duʿāu al-kāfirīna illā fī ḍalālin ","translations":["To Him","(is) supplication","(of) the truth","And those whom","they invoke","besides Him","besides Him","not","they respond","to them","with a thing","except","like one who stretches","his hands","towards","water","to reach","his mouth","but not","it","reaches it","And not","(is) the supplication","(of) the disbelievers","but","in","error","(14)"],"transliterationArr":["lahu","daʿwatu","al-ḥaqi","wa-alladhīna","yadʿūna","min","dūnihi","lā","yastajībūna","lahum","bishayin","illā","kabāsiṭi","kaffayhi","ilā","al-māi","liyablugha","fāhu","wamā","huwa","bibālighihi","wamā","duʿāu","al-kāfirīna","illā","fī","ḍalālin",null],"verseTiming":[[1,0,690],[2,690,1740],[3,1740,2940],[4,2940,4540],[5,4540,5630],[6,5630,6930],[7,6930,8130],[8,8130,8610],[9,8610,10510],[10,10510,11630],[11,11630,12850],[12,12850,13720],[13,13720,15090],[14,15090,16410],[15,16410,17600],[16,17600,17970],[17,17970,20500],[18,20500,21620],[19,21620,22490],[20,22490,23040],[21,23040,23470],[22,23470,25370],[23,25370,26050],[24,26050,28450],[25,28450,29990],[26,29990,30950],[27,30950,31430],[28,31430,33985]]}}