{"name":"13:38","price":"Dájúdájú A ti rán àwọn Òjíṣẹ́ kan níṣẹ́ ṣíwájú rẹ. A sì fún wọn ní àwọn ìyàwó àti àwọn ọmọọmọ.¹ Kò lẹ́tọ̀ọ́ fún Òjíṣẹ́ kan láti mú àmì kan wá àyàfi pẹ̀lú ìyọ̀ǹda Allāhu.² Gbogbo ìṣẹ̀lẹ̀ ló ní àkọsílẹ̀.","arabic":"وَلَقَدۡ أَرۡسَلۡنَا رُسُلٗا مِّن قَبۡلِكَ وَجَعَلۡنَا لَهُمۡ أَزۡوَٰجٗا وَذُرِّيَّةٗۚ وَمَا كَانَ لِرَسُولٍ أَن يَأۡتِيَ بِـَٔايَةٍ إِلَّا بِإِذۡنِ ٱللَّهِۗ لِكُلِّ أَجَلٖ كِتَابٞ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd","Chapter Ar-Ra'd","Ra'd","Surah Ra'd","Chapter Ra'd","Ar Ra'd","Surah Ar Ra'd","Chapter Ar Ra'd","Surah 13","Chapter 13","The Thunder","الرَّعد"],"ayahNumber":1745,"juzNumber":13,"footnotes":"1. Kíyè sí i, àwọn kan ń sọ pé gbólóhùn yìí “Dájúdájú A ti rán àwọn Òjíṣẹ́ kan níṣẹ́ ṣíwájú rẹ. A sì fún wọn ní àwọn ìyàwó àti àwọn ọmọọmọ.”, ó ń tọ́ka sí pé “Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - fẹ́ ìyàwó, ó sì bí ọmọ ṣíwájú kí ó tó kúrò láyé. Nítorí náà, ó ti kú. Kò sì níí padà wá sáyé mọ́.” Ọ̀rọ̀ tí wọ́n sọ yìí jẹ́ ọ̀rọ̀ fífi àtamọ́ mọ́ àtamọ̀. Àti pé, ìrònú wọn nípa gbólóhùn náà jẹ́ ìrònú ọpọlọ lásán, kò sì sí ìtọ́sọ́nà nínú rẹ̀ nítorí àwọn ìdí pàtàkì márùn-ún wọ̀nyí: \n Ìdí àkọ́kọ́: Kò kọ́kọ́ sí tírà tafsīr àwọn onisunnah tó sọ pé gbólóhùn náà dúró fún pé Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - fẹ́ ìyàwó tàbí pé ó bí ọmọ ṣíwájú kí ó tó kúrò láyé. Àwọn onibidiah bí ìjọ Ahmadiyyah ló ń fá ìtúmọ̀ gbólóhùn náà síbẹ̀. \n Ìdí kejì: Gbólóhùn náà dúró sórí àdámọ́ tí Allāhu fi sára gbogbo ọmọ Ànábì Ādam - kí ọlà Allāhu máa bá a -. Kì í ṣe àwọn Òjíṣẹ́ Ọlọ́hun nìkan ni wọ́n fẹ́ ìyàwó tàbí bí ọmọ. Tòhun ti bẹ́ẹ̀ náà, ṣe gbogbo ẹ̀dá tó wá sáyé ló rí ìyàwó fẹ́? Tàbí ṣe gbogbo ẹni tó sì rí ìyàwó fẹ́ ló rí ọmọ bí? \n Ìdí kẹta: Kì í ṣe nítorí ìfirinlẹ̀ pé kò sí Ànábì kan tàbí Òjíṣẹ́ kan nínú àwọn Òjíṣẹ́ Ọlọ́hun tí kò fẹ́ ìyàwó rí tàbí tí kò bí ọmọ rí ni Allāhu fi mú ọ̀rọ̀ náà wá nítorí pé, ó wà nínú àwọn Ànábì àti Òjíṣẹ́ tí kò fẹ́ ìyàwó, áḿbọ̀sìbọ́sí pé wọ́n bí ọmọ. Àpẹ̀ẹrẹ ni Ànábì Yahya - kí ọlà Allāhu máa bá a - nínú sūrah āli-’Imrọ̄n 3:39. \n Ìdí kẹrin; Allāhu - Ọba mímọ́ - fi gbólóhùn náà fọ èsì fún àwọn aláìgbàgbọ́ nínú ìjọ Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - ni. Àwọn aláìgbàgbọ́ tó ń sọ pé, “Tí ó bá jẹ́ Ànábì Ọlọ́hun ní òdodo ni kò yẹ kó jẹ́ òjíṣẹ́ abara tí ó máa fẹ́ ìyàwó, kò sì yẹ fún un láti máa bímọ.”, gẹ́gẹ́ bí Allāhu - Ọba mímọ́ - ṣe mú ọ̀rọ̀ wọn wá nínú sūrah al-’Isrọ̄’; 17:94. \n Ìdí karùn-ún: Ìbá jẹ́ pé āyah náà jẹmọ́ pé Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - ti kú ni, ìbá tí sí hadīth kan kan tó máa fẹsẹ̀ rinlẹ̀ láti ọ̀dọ̀ Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - lórí ìpadàbọ̀ Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - lópin ayé. Hadīth lórí ìpadàbọ̀ rẹ̀ kò sì mọ ní ẹyọ kan. Nítorí náà, ṣé àwọn tó ń lo gbólóhùn náà fún àìpadàbọ̀ Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - lópin ayé mọ ìtúmọ̀ al-Ƙur’ān ju Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - lọ ni tàbí wọ́n kàn jẹ́ asòòkùn-sẹ́sìn?! \n 2. “àmì kan” nínú āyah yìí dúró fún ìyà kan tàbí ìparun kan láti ọ̀dọ̀ Allāhu fún àwọn aláìgbàgbọ́ nínú Òjíṣẹ́ náà. Kíyè sí i, “àmì kan” láti ọ̀dọ̀ Allāhu - Ọba mímọ́ - tún lè jẹ́ “iṣẹ́ ìyanu” tàbí “ẹsẹ ọ̀rọ̀ Ọlọ́hun”.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"walaqad arsalnā rusulan min qablika wajaʿalnā lahum azwājan wadhurriyyatan wamā kāna lirasūlin an yatiya biāyatin illā bi-idh'ni al-lahi likulli ajalin kitābun ","translations":["And certainly","We sent","Messengers","from","before you","and We made","for them","wives","and offspring","And not","was","for a Messenger","that","he comes","with a sign","except","by the leave","(of) Allah","For everything","(is) a time","prescribed","(38)"],"transliterationArr":["walaqad","arsalnā","rusulan","min","qablika","wajaʿalnā","lahum","azwājan","wadhurriyyatan","wamā","kāna","lirasūlin","an","yatiya","biāyatin","illā","bi-idh'ni","al-lahi","likulli","ajalin","kitābun",null],"verseTiming":[[1,0,920],[2,920,2090],[3,2090,3060],[4,3060,4380],[5,4380,5840],[6,5840,6970],[7,6970,7720],[8,7720,9470],[9,9470,12010],[10,12010,12660],[11,12660,13300],[12,13300,14680],[13,14680,14880],[14,14880,16650],[15,16650,17990],[16,17990,19070],[17,19070,19990],[18,19990,22490],[19,22490,23260],[20,23260,24120],[21,24120,27545]]}}