{"name":"13:39","price":"Allāhu ń pa ohun tí Ó bá fẹ́ rẹ́. Ó sì ń mú (ohun tí Ó bá fẹ́) ṣẹ. Ọ̀dọ̀ Rẹ̀ sì ni Tírà Ìpìlẹ̀ wà.¹","arabic":"يَمۡحُواْ ٱللَّهُ مَا يَشَآءُ وَيُثۡبِتُۖ وَعِندَهُۥٓ أُمُّ ٱلۡكِتَٰبِ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd","Chapter Ar-Ra'd","Ra'd","Surah Ra'd","Chapter Ra'd","Ar Ra'd","Surah Ar Ra'd","Chapter Ar Ra'd","Surah 13","Chapter 13","The Thunder","الرَّعد"],"ayahNumber":1746,"juzNumber":13,"footnotes":"1. Kí ni n̄ǹkan tí Allāhu ń parẹ́? Ki sì ni n̄ǹkan tí Ó ń mú ṣẹ? Ọ̀rọ̀ pọ̀ lórí àwọn n̄ǹkan náà nínú àwọn tírà Tafsīr. \n Àgbọ́yé kìíní tí ó tẹ̀ṣùwọ̀n jùlọ ni pé, āyah náà jẹ́ àlàyé fún āyah tí ó ṣíwájú rẹ̀. Ìdí ni pé, āyah tí ó ṣíwájú rẹ̀ ń tọ́ka sí bí ó ṣe jẹ́ pé ọjọ́ ìyà, tí ó jẹ́ “àmì kan láti ọ̀dọ̀ Allāhu - Ọba mímọ́ -”, èyí tí ó máa kò lé àwọn aláìgbàgbọ́ lórí ti ṣe wà nínú àkọsílẹ̀. Āyah 39 yìí wá ń sọ pé ní ọjọ́kọ́jọ́ tí ìyà náà bá dé sí àwọn aláìgbàgbọ́ lọ́rùn, ó ń bẹ nínú àwọn aláìgbàgbọ́ tí ó máa bá ìyà náà lọ. Ó sì ń bẹ nínú wọn ẹni tí ìyà náà yóò dá sí títí dí ọjọ́ mìíràn. Àti ẹni tí ó máa bá ìyà lọ àtí ẹni tí ọjọ́ ìyà rẹ̀ yóò sún ṣíwájú, gbogbo rẹ̀ ni ó kúkú ti wà nínú Tírà Laohul-Mahfūṭḥ, tí í ṣe àkọsílẹ̀ ìpìlẹ̀ lọ́dọ̀ Allāhu - Ọba mímọ́ -. Nítorí náà, ẹnikẹ́ni nínú àwọn aláìgbàgbọ́ tí ó bá bá ìyà lọ ni àgbọ́yé “yamhū-llāhu mọ̄ yaṣā’”. Bákàn náà, ẹnikẹ́ni nínú àwọn aláìgbàgbọ́ tí ó bá ru ìyà náà là títí di ọjọ́ mìíràn ni àgbọ́yé “wa yuthbit”. Lẹ́yìn àgbọ́yé yìí ní ọ̀rọ̀ kan àwọn àgbọ́yé tí ó dá āyah náà tú lọ́tọ̀, láì so ó pọ̀ mọ́ āyah 38.\n Àgbọ́yé kejì: Inú àkọsílẹ̀ méjì ni kádàrá ẹ̀dá wà. Àkọsílẹ̀ kan wà lọ́dọ̀ àwọn mọlāika. Àkọsílẹ̀ ti ọ̀dọ̀ àwọn mọlāika ni àkọsílẹ̀ tí Allāhu - Ọba mímọ́ - ń gbé fún wọn lórí ọ̀rọ̀ ẹ̀dá kọ̀ọ̀kan ní ọdọọdún nínú Òru Abiyì (Laelatul-Ƙọdr). Ìyípadà lè ṣẹlẹ̀ sí kádàrá ẹ̀dá nínú àkọsílẹ̀ ti ọ̀dọ̀ àwọn mọlāika nípa ki ohun titun tẹ̀ wọ́n lọ́wọ́ lórí àwọn àlámọ̀rí ẹ̀dá kan. Bákàn náà, àwọn àlámòrí kan lè wà bí ó ṣe wà tẹ́lẹ̀ ní èsín. Àkọsílẹ̀ kejì ni àkọsílẹ̀ tí ó wà = = lọ́dọ̀ Allāhu nínú Tírà Laohul-mahfūṭḥ. Àkọsílẹ̀ yìí ló kó gbogbo ọ̀rọ̀ ẹ̀dá sínú tán pátápátá, bẹ̀rẹ̀ láti ìgbà tí ẹ̀dá kò tí ì máa jẹ́ ẹ̀dá títí dé ìkángun ẹ̀dá nínú Ọgbà Ìdẹ̀ra tàbí nínú Iná. Nínú àkọsílẹ̀ yìí ni Allāhu - Ọba mímọ́ - ti ń yọ àkọsílẹ̀ ọlọ́dọọdún fún àwọn mọlāika Rẹ̀. Nítorí náà, ohun titun nínú kádàrá tí ń bẹ́ lọ́wọ́ àwọn mọlāika ni àgbọ́yé “yamhū-llāhu mọ̄ yaṣā’”. Bákàn náà, ohun tí ó bá wà bí ó ṣe wà tẹ́lẹ̀ ní èsín ni àgbọ́yé “wa yuthbit”. Àmọ́ àti ohun titun àti èyí tí kò titun nínú kádàrá tí ń bẹ́ lọ́wọ́ àwọn mọlāika, ìkíní kejì ló wà bẹ́ẹ̀ nínú Tírà Laohul-Mahfūṭḥ. \n Àgbọ́yé kẹta: Àgbọ́yé fún “yamhu-llāhu mọ̄ yaṣā’ wa yuthbit” ni pé, kí ọkùnrin kan ti máa tẹ̀lé àṣẹ Allāhu bọ̀ fún ọ̀pọ̀ ọjọ́. Lẹ́yìn náà, kí ó padà síbi ìyapa àṣẹ Allāhu, kí ó sì kú sínú ìṣìnà àìgbàgbọ́. Onítọ̀ún ni ẹni tí Allāhu pa orúkọ rẹ̀ rẹ́ nínú ìmọ̀nà. Irúfẹ́ ẹni yìí ló wà ní abẹ́ “yamhu-llāhu mọ̄ yaṣā’”. Ní ìdà kejì ẹ̀wẹ̀, ẹni tí Allāhu fí orúkọ rẹ̀ rinlẹ̀ sínú ìmọ̀nà ni kí ọkùnrin kan ti máa yapa àṣẹ Allāhu bọ̀ fún ọ̀pọ̀ ọjọ́. Lẹ́yìn náà, kí ó padà síbi ìtẹ̀lé àṣẹ Allāhu, kí ó sì kú sínú ìmọ̀nà ’Islām. Onítọ̀ún ló wà ní abẹ́ “wa yuthbit”. \n Àgbọ́yé kẹrin: Àgbọ́yé fún “yamhu-llāhu mọ̄ yaṣā’ wa yuthbit” ni pé, àwọn mọlāika yóò máa kọ gbogbo ọ̀rọ̀ àti ìṣe ẹ̀dá sílẹ̀ ní ojoojúmọ́. Nígbà tí ó bá dí ọjọ́ Àlàmísì, wọn yóò yọ gbogbo ọ̀rọ̀ tí kò la láádá àti ìyà lọ sílẹ̀, àwọn ọ̀rọ̀ bíi “Mo jẹ; mo mu; mo sùn; mo jí àti bẹ́ẹ̀ bẹ́ẹ̀ lọ”. Èyí sì ni ìtúmọ̀ “yamhu-llāhu mọ̄ yaṣā’” Wọn yó sì fi àwọn ọ̀rọ̀ àti ìṣe yòókù tí ó la láádá àti ìyà lọ sílẹ̀ nínú àkọsílẹ̀ iṣẹ́ ẹ̀dá. Èyí sì ni ìtúmọ̀ “wa yuthbit”.\n Àgbọ́yé karùn-ún: Àgbọ́yé fún “yamhu-llāhu mọ̄ yaṣā’ wa yuthbit” ni pé, àwọn āyah kan ń bẹ lásìkò tí al-Ƙur’ān ń sọ̀kalẹ̀ lọ́wọ́ fún Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a -, tí Allāhu yóò pa ìdájọ́ inú wọn rẹ́. Irúfẹ́ àwọn āyah bẹ́ẹ̀ sì ló wà ní abẹ́ “yamhu-llāhu mọ̄ yaṣā’”. Ní ìdà kejì ẹ̀wẹ̀, àwọn āyah kan sì ń bẹ tí Allāhu kò níí pa ìdájọ́ inú wọn rẹ́. Irúfẹ́ àwọn āyah bẹ́ẹ̀ ló sì wà ní abẹ́ “wa yuthbit”. \n Àgbọ́yé kẹfà: Àgbọ́yé fún “yamhu-llāhu mọ̄ yaṣā’ wa yuthbit” ni pé, Allāhu - Ọba mímọ́ - yóò máa ṣe àforíjìn àwọn ẹ̀ṣẹ̀ wẹẹrẹ kan fún ẹ̀dá. Èyí sì ni “yamhu-llāhu mọ̄ yaṣā’”. Ní ìdà kejì ẹ̀wẹ̀, Allāhu - Ọba mímọ́ - yó sì fi àwọn ẹ̀ṣẹ̀ wẹẹrẹ kan mú ẹ̀dá. Èyí sì ni “wa yuthbit”.\n Gbogbo àwọn àlàyé wọ̀nyí wà nínú tafsīr at-Tọbarīy. Nítorí náà, āyah yìí kò túmọ̀ sí yíyí kádàrá ẹ̀dá padà nínú Tírà Laohul-Mahfūṭḥ. Ó sì kúkú ti rinlẹ̀ nínú hadīth Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - pé: “ A ti gbé gègé sókè kúrò lórí kíkọ kádàrá. Àwọn àkọsílẹ̀ sì ti gbẹ.” Ìyẹn nínú Tírà Laohul-Mahfūṭḥ. Èyí sì ló ko gbogbo kádàrá ẹ̀dá sínú pátápátá àti gbogbo àwọn tírà tí Allāhu sọ̀kalẹ̀ fún gbogbo àwọn Òjíṣẹ́ Rẹ̀ - kí ìkẹ́ àti ọlà Allāhu máa bá a. \n Fún ìdí èyí, àdúà tí ẹ̀dá yóò ṣe àti ọ̀nà tí àdúà náà yó fi gbà, méjèèjì ti wà nínú kádàrá ẹ̀dá tí ó wà nínú Tírà Laohul-mahfūṭḥ. Àti pé kò sí ẹ̀dá tó nímọ̀ èwo nínú àwọn oore ayé àti tọ̀run ló máa tẹ ẹ̀dá lọ́wọ́ nípasẹ̀ àdúà. Èyí jẹ́ ìmọ̀ ìkọ̀kọ̀ ní abala kan. Ó tún jẹ́ ọlá fún àdúà ṣíṣe lábala kan nítorí pé, oore àdúà ọ̀tọ̀, oore ẹ̀bùn Ọlọ́hun ọ̀tọ̀. Nítorí náà, gbogbo gbígbà àdúà wà ní abẹ́ àkọsílẹ̀ tí Allāhu - Ọba mímọ́ - ti kọ lé ẹ̀dá lórí nínú Tírà Laohul-Mahfūṭḥ ṣíwájú ìṣẹ̀dá rẹ̀.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"yamḥū al-lahu mā yashāu wayuth'bitu waʿindahu ummu al-kitābi ","translations":["(Is) eliminated","(by) Allah","what","He wills","and confirms","and with Him","(is) the Mother (of) the Book","(is) the Mother (of) the Book","(39)"],"transliterationArr":["yamḥū","al-lahu","mā","yashāu","wayuth'bitu","waʿindahu","ummu","al-kitābi",null],"verseTiming":[[1,0,690],[2,690,1620],[3,1620,2050],[4,2050,4400],[5,4400,5490],[6,5490,9180],[7,9180,10590],[8,10590,13015]]}}