{"name":"13:7","price":"Àwọn tó ṣàì gbàgbọ́ ń wí pé: “Kí ni kò jẹ́ kí wọ́n sọ àmì kan kalẹ̀ fún un láti ọ̀dọ̀ Olúwa rẹ̀?” Olùkìlọ̀ mà ni ìwọ. Olùtọ́sọ́nà sì wà fún ìjọ kọ̀ọ̀kan.¹","arabic":"وَيَقُولُ ٱلَّذِينَ كَفَرُواْ لَوۡلَآ أُنزِلَ عَلَيۡهِ ءَايَةٞ مِّن رَّبِّهِۦٓۗ إِنَّمَآ أَنتَ مُنذِرٞۖ وَلِكُلِّ قَوۡمٍ هَادٍ","category":["13 (Ar-Ra'd)","Ar-Ra'd","Surah Ar-Ra'd","Chapter Ar-Ra'd","Ra'd","Surah Ra'd","Chapter Ra'd","Ar Ra'd","Surah Ar Ra'd","Chapter Ar Ra'd","Surah 13","Chapter 13","The Thunder","الرَّعد"],"ayahNumber":1714,"juzNumber":13,"footnotes":"1. Ọ̀rọ̀ pọ̀ lórí ìtúmọ̀ “hād” àti ohun tó dúró fún nínú āyah yìí nínú àwọn tírà Tafsīr. Mẹ́ta nínú àwọn ìtúmọ̀ “hād” nínú āyah nìyí: (1) “hād” túmọ̀ sí “Allāhu”, ìyẹn ni pé, “Allāhu ni olùtọ́sọ́nà fún ìjọ kọ̀ọ̀kan”. (2) “hād” túmọ̀ sí “Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a -, ìyẹn ni pé, Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - ni olùpèpè fún àwọn ènìyàn. (3) “hād” túmọ̀ sí “Ànábì kọ̀ọ̀kan”, ìyẹn ni pé, Ànábì kọ̀ọ̀kan ni olùpèpè fún ìjọ Ànábì kọ̀ọ̀kan. \n Àmọ́ sá, kò sí tírà Tafsīr kan kan tí ó túmọ̀ āyah náà lọ síbi sísọ pé, “ànábì kan wà fún ọmọ Yorùbá” tàbí sísọ pé “ànábì kan wà fún ilẹ̀ Haúsá”. Ẹ wo ìtọsẹ̀-ọ̀rọ̀ sūrah Yūnus 10; 47.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"wayaqūlu alladhīna kafarū lawlā unzila ʿalayhi āyatun min rabbihi innamā anta mundhirun walikulli qawmin hādin ","translations":["And say","those who","disbelieved","Why not","has been sent down","to him","a sign","from","his Lord","Only","you","(are) a warner","and for every","people","(is) a guide","(7)"],"transliterationArr":["wayaqūlu","alladhīna","kafarū","lawlā","unzila","ʿalayhi","āyatun","min","rabbihi","innamā","anta","mundhirun","walikulli","qawmin","hādin",null],"verseTiming":[[1,0,1160],[2,1160,2240],[3,2240,3300],[4,3300,5680],[5,5680,7180],[6,7180,8170],[7,8170,9250],[8,9250,10070],[9,10070,11710],[10,11710,14650],[11,14650,15880],[12,15880,18350],[13,18350,19420],[14,19420,20260],[15,20260,23045]]}}