{"name":"14:4","price":"A kò rán Òjíṣẹ́ kan níṣẹ́ àfi pẹ̀lú èdè¹ àwọn ènìyàn rẹ̀² nítorí kí ó lè ṣàlàyé (ẹ̀sìn) fún wọn. Nígbà náà, Allāhu yóò ṣi ẹni tí Ó bá fẹ́ lọ́nà. Ó sì máa tọ́ ẹni tí Ó bá fẹ́ sọ́nà; Òun ni Alágbára, Ọlọ́gbọ́n.³","arabic":"وَمَآ أَرۡسَلۡنَا مِن رَّسُولٍ إِلَّا بِلِسَانِ قَوۡمِهِۦ لِيُبَيِّنَ لَهُمۡۖ فَيُضِلُّ ٱللَّهُ مَن يَشَآءُ وَيَهۡدِي مَن يَشَآءُۚ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim","Chapter Ibrahim","Surah 14","Chapter 14","Abraham","إبراهيم"],"ayahNumber":1754,"juzNumber":13,"footnotes":"1. “Lisān” (ahọ́n) dúró fún “èdè” nínú āyah yìí. Ẹ tún wo “lisān” nínú sūrah an-Nahl; 16:103.\n 2. Ìyẹn ni pé, èdè wáhàyí Ànábì kọ̀ọ̀kan ni èdè àwọn ènìyàn rẹ̀. Bí àpẹ̀ẹrẹ, Ànábì kan kò níí jẹ́ elédè ’Isrọ̄’īl kí ó gba wáhàyí ní èdè mìíràn bí kò ṣe ní èdè àwọn ènìyàn rẹ̀. Èdè àwọn ènìyàn rẹ̀ sì ni èdè abínibí rẹ̀. Kódà tòhun ti bí Allāhu ṣe rán Ànábì wa Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - níṣẹ́ sí gbogbo ayé, kò kúkú gba wáhàyí kan kan ní èdè mìíràn bí kò ṣe ní èdè àwọn ènìyàn rẹ̀, èdè abínibí rẹ̀, èdè Lárúbáwá. \n Lẹ́yìn náà, àwọn n̄ǹkan méjì wọ̀nyí gbọ́dọ̀ yé wa yékéyéké. Àkọ́kọ́: Èyíkéyìí èdè tí ẹnikẹ́ni bá túmọ̀ al-Ƙur’ān sí, kò lè ṣe dọ́gba sí al-Ƙur’ān. Kò sì lè rọ́pò rẹ̀. Nítorí náà, tí àléébù kan tàbí òmíràn bá jẹyọ nínú iṣẹ́ ìtúmọ̀ èdè al-Ƙur’ān, kò kó àlèébú kan kan bá al-Ƙur’ān rárá nítorí pé, ọ̀rọ̀ tí Allāhu sọ gẹ́lẹ́ sì wà nínú tákàǹdá tí kò yinjẹ. Iṣẹ́ ìtúmọ̀ al-Ƙur’ān láti ọ̀dọ̀ oníṣẹ́-ìtúmọ̀ ọ̀tọ̀ọ̀tọ̀ kò sì túmọ̀ sí pé al-Ƙur’ān ti pé méjì lórí igbá. Ìdí sì nìyí tí tírà Tafsīr fi wà lóríṣiríṣi. Àti pé iṣẹ́ ìtúmọ̀ èdè al-Ƙur’ān ni iṣẹ́ gbogbo tírà Tafsīr pátápátá, wọn ìbáà fi èdè Lárúbáwá kọ wọ́n, yálà èyí tí wọ́n ṣe pẹ̀lú ìtúpalẹ̀ ṣókí tàbí èyí tí wọ́n ṣe pẹ̀lú ìtúpalẹ̀ ọ̀rin-kinniwin.\n Ìkejì: Àwọn tírà sánmọ̀ mìíràn bíi Zabūr, Taorāt àti ’Injīl ti wọ ipò “aláìsí” nítorí pé, kò sí ẹyọ kan nínú mẹ́tẹ̀ẹ̀ta wọ̀nyẹn tí èdè ìsọ̀kalẹ̀ rẹ̀ (èdè ìfihàn rẹ̀) kò ì dòkú. \n Kíyè sí i, olùdásílẹ̀ ìjọ Ahmadiyyah tako bí ó ṣe jẹ́ pé èdè abínibí nìkan ni Allāhu fi máa ń bá ìkọ̀ọ̀kan àwọn Ànábì Rẹ̀ àti àwọn Òjíṣẹ́ Rẹ̀ sọ̀rọ̀. Mirza Ghulam Ahmad, ìyẹn olùdásílẹ̀ ìjọ Ahmadiyyah, parọ́ ńlá mọ́ Allāhu pé Allāhu fi èdè mìíràn yàtọ̀ sí èdè abínibí òun rán òun níṣẹ́ sáyé. Àpapọ̀ àwọn èdè náà sì jẹ́ mẹ́fà; èdè Gẹ̀ẹ́sì, Punjabi, Hébérù, Paṣian, Lárúbáwá àti Urudu. Èdè Urudu nìkan sì ni èdè abínibí rẹ̀. Bí ó tilẹ̀ jẹ́ pé òpùrọ́ pọ́nńbélé tó pe ara rẹ̀ ní Ànábì àti Òjíṣẹ́ Ọlọ́hun sí gbogbo ayé ni ọ̀gbẹni náà, ó tún ṣàì gbàgbọ́ nínú āyah tí à ń tọsẹ̀ rẹ̀ lọ́wọ́.\n Kò sì wulẹ̀ sí ìsọ̀kalẹ̀ ìmísí mímọ́ ti Allāhu mú wá fún ẹnikẹ́ni mọ́ lẹ́yìn ikú Ànábì wa - kí ìkẹ́ àti ọlà Allāhu máa bá a - àfi àwọn onímìísí èṣù bíi ti mirza Ghulam Ahmad, àwọn onisūfīy àti àwọn ẹlẹ́mìí-gbígbé. Allāhu là wá lọ́wọ́ gbogbo àwọn asòòkùn-sẹ́sìn. \n 3. Ẹ wo ìtọsẹ̀-ọ̀rọ̀ sūrah al-’Ani‘ām; 6:12.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"wamā arsalnā min rasūlin illā bilisāni qawmihi liyubayyina lahum fayuḍillu al-lahu man yashāu wayahdī man yashāu wahuwa al-ʿazīzu al-ḥakīmu ","translations":["And not","We sent","any","Messenger","except","with the language","(of) his people","so that he might make clear","for them","Then Allah lets go astray","Then Allah lets go astray","whom","He wills","and guides","whom","He wills","And He","(is) the All-Mighty","the All-Wise","(4)"],"transliterationArr":["wamā","arsalnā","min","rasūlin","illā","bilisāni","qawmihi","liyubayyina","lahum","fayuḍillu","al-lahu","man","yashāu","wayahdī","man","yashāu","wahuwa","al-ʿazīzu","al-ḥakīmu",null],"verseTiming":[[1,0,1920],[2,1920,3160],[3,3160,3280],[4,3280,4590],[5,4590,5420],[6,5420,6490],[7,6490,7660],[8,7660,8950],[9,8950,9950],[10,9950,10960],[11,10960,11880],[12,11880,12120],[13,12120,14690],[14,14690,15730],[15,15730,15930],[16,15930,19160],[17,19160,19690],[18,19690,20830],[19,20830,23175]]}}