{"name":"16:21","price":"Òkú (ni wọ́n), wọn kì í ṣe alààyè.¹ Wọn kò sì mọ àkókò tí A óò jí wọn dìde (nínú sàréè).","arabic":"أَمۡوَٰتٌ غَيۡرُ أَحۡيَآءٖۖ وَمَا يَشۡعُرُونَ أَيَّانَ يُبۡعَثُونَ","category":["16 (An-Nahl)","An-Nahl","Surah An-Nahl","Chapter An-Nahl","Nahl","Surah Nahl","Chapter Nahl","An Nahl","Surah An Nahl","Chapter An Nahl","Surah 16","Chapter 16","The Bee","النَّحل"],"ayahNumber":1922,"juzNumber":14,"footnotes":"1. Ọ̀kan pàtàkì nínú àwọn ẹ̀rí ìjọ Ahmadiyyah àti àwọn irú wọn gbogbo lórí ìgbàgbọ́ wọn pé Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - ti kú, kò sì níí padà wá sílé ayé mọ́ ni gbólóhùn “Òkú (ni wọ́n), wọn kì í ṣe alààyè.”. Àwọn wọ̀nyí ń fi rinlẹ̀ pé níwọ̀n ìgbà tí ó ti jẹ́ pé āyah 20 tó ṣíwájú gbólóhùn náà ń sọ nípa ipò tí àwọn n̄ǹkan tí àwọn ènìyàn sọ di olúwa àti ọlọ́hun wọn lẹ́yìn Allāhu wà, ìyẹn ni pé, wọn kò lè dá ẹ̀dá kan àti pé òkú ni wọ́n, wọ́n ní nígbà náà, Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - ti kú nítorí pé, òun náà wà lára n̄ǹkan tí àwọn kan sọ di ọlọ́hun, olúwa àti olùgbàlà. Wọ́n fi kún un pé, “Ṣebí Ànábì ‘Īsā náà kò lè dá n̄ǹkan kan.” \n Ọ̀rọ̀ wọn yìí jìnnà sí òtítọ́. Àti pé wọ́n ti gbé gbólóhùn náà tayọ ẹnu-ààlà. Wọ́n sì ti fi àtamọ́ mọ́ àtamọ̀ gẹ́gẹ́ bí ìṣe wọn. Èyí tó jẹ́ òdodo ọ̀rọ̀ ni pé, gbólóhùn “Òkú (ni wọ́n), wọn kì í ṣe alààyè.” kò sọ ikú Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - di ohun tó ti ṣẹlẹ̀. Ṣebí àwọn mọlāika kan wà lára n̄ǹkan tí àwọn ènìyàn ń jọ́sìn fún lẹ́yìn Allāhu. Ṣé òkú ni àwọn mọlaika náà ni tàbí alààyè? A ò kúkú tí ì gbọ́ ikú mọlaika kan kan rí. Bákan náà, aṣ-Ṣatọ̄n ar-Rọjīm jẹ́ ọ̀kan pàtàkì nínú ohun tí àwọn ènìyàn ń jọ́sìn fún. Ṣé òkú ni Ṣaetọ̄n náà ni tàbí alààyè? Rárá, kò ì kú. \n Síwájú sí i, àwọn ènìyàn kan ń jọ́sìn fún òòrùn, òṣùpá àti àwọn ìràwọ̀. Ṣé wọ́n ti gbọ́ ikú tiwọn náà ni? Kò sí ọ̀kan nínú wọn tó tí ì di òkú. Kódà a kúkú rí àwọn ọlọ́hun mìíràn tó jẹ́ pé láti ojú-ayé wọn ni àwọn ẹ̀dá kan ti ń jọ́sìn fún wọn lẹ́yìn Allāhu. Àpẹ̀ẹrẹ irú wọn ni “Sati Guru Maraj” tí ó sọ ara di ọlọ́hun nínú ìlú Ìbàdàn. Alààyè ni ọ̀gbẹni náà, kò ì tí ì kú, ó ṣẹ̀ṣẹ̀ máa kú ni lọ́jọ́ ti àkókò ikú rẹ̀ bá dé. \n Lódodo ni pé àwọn nasọ̄rọ̄ ti sọ ‘Īsā ọmọ Mọryam di ẹni tí wọ́n ń jọ́sìn fún, àmọ́ Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - kò ì kù o. Ó sì wà nípò alààyè nínú sánmọ̀, bí Allāhu ṣe fẹ́.” Kò wá sí ẹ̀rí tààrà kan kan tó fi rinlẹ̀ pé Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - ti kú bí kò ṣe āyah onípọ́nna èyí tí a ti ṣe àlàyé lórí rẹ̀ ṣíwájú nínú ìtọsẹ̀-ọ̀rọ̀ sūrah āli-’Imrọ̄n 3:55. \n Dípò kí á rí āyah kan tàbí hadīth kan tààrà lórí ikú Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a -, hadīth tó ń fi ìpadàbọ̀ rẹ̀ rinlẹ̀ là ń rí. Ẹni tí kò ì kú ló sì lè padà wá sílé ayé. \n Kí wá ni èròǹgbà Allāhu lórí gbólóhùn “Òkú (ni wọ́n),”? Ìtúmọ̀ àkànlò èdè ló wà fún gbólóhùn “Òkú (ni wọ́n),” nínú āyah náà, kì í ṣe ìtúmọ̀ àdámọ́. Ìdí ni pé, nígbà tí kò bá sí ìwúlò kan kan tí a lè rí lára ẹ̀dá, irú ẹ̀dá bẹ́ẹ̀ ti wà nípò ẹni tí a lè ṣe àfiwé rẹ̀ pẹ̀lú “òkú” nítorí pé, òkú ni kò ní àǹfààní kan tí ó lè ṣe fún ara rẹ̀ àti fún àwọn alààyè. Nítorí náà, Allāhu ń fi gbólóhùn “Òkú (ni wọ́n), wọn kì í ṣe alààyè.” pe làákàyè gbogbo ẹnikẹ́ni to ń jọ́sìn fún n̄ǹkan mìíràn lẹ́yìn Rẹ̀ pé kò sí àǹfààní kan kan tí irú olùjọ́sìn náà lè rí lọ́dọ̀ n̄ǹkan tó sọ di ọlọ́hun lẹ́yìn Allāhu, gẹ́gẹ́ bí alààyè kò ṣe lè rí àǹfààní kan kan láti ara òkú. \n Wàyí níwọ̀n ìgbà tí àwọn nasọ̄rọ̄ ti sọ Ànábì ‘Īsā ọmọ Mọryam di ẹni tí wọ́n ń jọ́sìn fún lẹ́yìn Allāhu, kò sí àǹfààní kan tàbí oore kan tí ó lè ṣe fún wọn, wọn ìbáà pariwo orúkọ rẹ̀ àti ẹ̀jẹ̀ rẹ̀ nígbà igba. Àpẹ̀ẹrẹ àyè mìíràn tí Allāhu - subhānahu wa ta'ālā - ti lo kalmọh “òkú” àmọ́ tí kò fi ọ̀nà kan kan túmọ̀ sí “ẹni tí ó ti kú” bí kò ṣe ẹni tí kò lè ṣàǹfààní fún ara rẹ̀ àti fún ẹlòmíìràn ni sūrah al-’Ani‘ām; 6:122. \n Bákan náà, Allāhu pe àwọn òrìṣà ní òkú nítorí pé, ère tí kò sí ẹ̀mí lára rẹ̀ ni àwọn òrìṣà náà. Ipò òkú, ẹni tí kò lè sọ̀rọ̀, ẹni tí kò lè ríran, ẹni tí kò lè ran ara rẹ̀ lọ́wọ́ áḿbọ̀sìbọ́sí pé ó máa ran ẹlòmíìràn lọ́wọ́ ni ipò tí gbogbo ère òrìṣà wà. Bẹ́ẹ̀ náà ni ère Ànábì ‘Īsā ọmọ Mọryam àti igi àgbélébùú rẹ̀ tí wọ́n gbẹ́, tí wọ́n ń jọ́sìn fún, kò lè sọ̀rọ̀, kò lè ríran, kò sì lè ran ara rẹ̀ lọ́wọ́ áḿbọ̀sìbọ́sí pé ó máa ran ẹlòmíìràn lọ́wọ́.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"amwātun ghayru aḥyāin wamā yashʿurūna ayyāna yub'ʿathūna ","translations":["(They are) dead","not alive","not alive","And not","they perceive","when","they will be resurrected","(21)"],"transliterationArr":["amwātun","ghayru","aḥyāin","wamā","yashʿurūna","ayyāna","yub'ʿathūna",null],"verseTiming":[[1,0,1300],[2,1300,2050],[3,2050,4980],[4,4980,5630],[5,5630,6920],[6,6920,8070],[7,8070,11285]]}}