{"name":"16:43","price":"A kò rán ẹnì kan ní iṣẹ́-òjíṣẹ́ ṣíwájú rẹ àfi àwọn ọkùnrin tí À ń fi ìmísí ránṣẹ́ sí. Nítorí náà, ẹ bèèrè lọ́dọ̀ àwọn oníràn-ántí tí ẹ̀yin kò bá mọ̀.¹","arabic":"وَمَآ أَرۡسَلۡنَا مِن قَبۡلِكَ إِلَّا رِجَالٗا نُّوحِيٓ إِلَيۡهِمۡۖ فَسۡـَٔلُوٓاْ أَهۡلَ ٱلذِّكۡرِ إِن كُنتُمۡ لَا تَعۡلَمُونَ","category":["16 (An-Nahl)","An-Nahl","Surah An-Nahl","Chapter An-Nahl","Nahl","Surah Nahl","Chapter Nahl","An Nahl","Surah An Nahl","Chapter An Nahl","Surah 16","Chapter 16","The Bee","النَّحل"],"ayahNumber":1944,"juzNumber":14,"footnotes":"1. Nínú al-Ƙur’ān alápọ̀n-ọ́nlé, àyè méjì péré ni Allāhu - subhānahu wa ta‘ālā - ti pe àwọn kan ní “ahlu-ththikr” (ìtúmọ̀ “àwọn oníràn-ántí / àwọn tí A sọ ìrántí kalẹ̀ fún). Àyè kìíní nìyí, sūrah an-Nahl; 16:43. Àyè kejì ni sūrah al-‘Anbiyā’; 21:7. Àwọn sūfī sì ń lérò pé àwọn ni “ahlu-ththikr”. Àti pé àwọn gan-an ni Allāhu - subhānahu wa ta‘ālā - ń tọ́ka sí nínú àwọn āyah méjèèjì náà. \n Èsì: Ohun tí wọ́n ń sọ yìí kì í ṣe òtítọ́ páàpáà. Èyí tí í ṣe òdodo ọ̀rọ̀ ni pé, àwọn onímọ̀ nípa at-Taorāt àti al-’Injīl ni Allāhu ń tọ́ka sí, kì í ṣe àwọn sūfī. Ìdí ni pé, okùnfà āyah méjèèjì yìí ni pé, Allāhu fi fọ èsì sí ọ̀rọ̀ àwọn ọ̀ṣẹbọ tí wọ́n ń sọ pé mọlaika ni Allāhu máa ń fi iṣẹ́ Òjíṣẹ́ rán, kì í ṣe ènìyàn. Àwọn ọ̀ṣẹbọ wọ̀nyẹn sì ni Allāhu - subhānahu wa ta‘ālā - ń pàṣẹ fún pé kí wọ́n lọ bèèrè wò lọ́dọ̀ àwọn onímọ̀ nípa tíra ìṣáájú bóyá ní òdodo ni Allāhu ti fi iṣẹ́ Òjíṣẹ́ rán mọlāika kan rí sí àwọn ènìyàn, tí yó sì máa gbé láààrin wọn ṣíwájú Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - . Irú āyah yìí wà nínú sūrah Yūnus; 10:2. Ẹ tún wo ìtọsẹ̀-ọ̀rọ̀ sūrah Yūsuf 12:109.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"wamā arsalnā min qablika illā rijālan nūḥī ilayhim fasalū ahla al-dhik'ri in kuntum lā taʿlamūna ","translations":["And not","We sent","before you","before you","except","men","We revealed","to them","so ask","(the) people","(of) the Reminder","if","you","(do) not","know","(43)"],"transliterationArr":["wamā","arsalnā","min","qablika","illā","rijālan","nūḥī","ilayhim","fasalū","ahla","al-dhik'ri","in","kuntum","lā","taʿlamūna",null],"verseTiming":[[1,0,2000],[2,2000,3260],[3,3260,4220],[4,4220,5050],[5,5050,5930],[6,5930,6900],[7,6900,9870],[8,9870,11310],[9,11310,13730],[10,13730,14340],[11,14340,15250],[12,15250,16210],[13,16210,17970],[14,17970,18380],[15,18380,21275]]}}