{"name":"16:80","price":"Allāhu ṣe ibùsinmi fún yín sínú ilé yín. Láti ara awọ ẹran-ọ̀sìn, Ó tún ṣe àwọn ilé (àtíbàbà) kan tó fúyẹ́ fún yín láti gbé rìn ní ọjọ́ ìrìn-àjò yín àti ní ọjọ́ tí ẹ bá wà nínú ìlú. Láti ara irun àgùtàn,¹ irun ràkúnmí àti irun ewúrẹ́, ẹ tún ń rí àwọn n̄ǹkan ọ̀ṣọ́ àti n̄ǹkan ìgbádùn lò títí fún ìgbà díẹ̀.","arabic":"وَٱللَّهُ جَعَلَ لَكُم مِّنۢ بُيُوتِكُمۡ سَكَنٗا وَجَعَلَ لَكُم مِّن جُلُودِ ٱلۡأَنۡعَٰمِ بُيُوتٗا تَسۡتَخِفُّونَهَا يَوۡمَ ظَعۡنِكُمۡ وَيَوۡمَ إِقَامَتِكُمۡ وَمِنۡ أَصۡوَافِهَا وَأَوۡبَارِهَا وَأَشۡعَارِهَآ أَثَٰثٗا وَمَتَٰعًا إِلَىٰ حِينٖ","category":["16 (An-Nahl)","An-Nahl","Surah An-Nahl","Chapter An-Nahl","Nahl","Surah Nahl","Chapter Nahl","An Nahl","Surah An Nahl","Chapter An Nahl","Surah 16","Chapter 16","The Bee","النَّحل"],"ayahNumber":1981,"juzNumber":14,"footnotes":"1. Ìtàn Sūfiyyah Ní Ṣókí: Nínú al-Ƙur’ān alápọ̀n-ọ́nlé, àyè kan péré ni Allāhu - subhānahu wa ta‘ālā - ti lo kalmọh “’aswāf”. \n “’Aswāf” ni ọ̀pọ̀ “sūf”. Ìtúmọ̀ “sūf” ni “irun àgùtàn”. Bákan náà, lílò tí Allāhu - subhānahu wa ta‘ālā - lo kalmọh “’aswāf” jẹ́ ṣíṣe ìrègún oore Rẹ̀ lórí wa nípa bí “irun àgùtàn” ṣe jẹ́ ọ̀kan nínú ohun èlò tí a fi ń ṣe àwọn n̄ǹkan ọ̀ṣọ́ àti n̄ǹkan ìgbádùn nínú ìṣẹ̀mí ayé wa. \n Àmọ́ ohun tí a fẹ́ pe àkíyèsí wa sí ní àyè yìí ni pé, Allāhu kò sọ̀rọ̀ “sūf” gẹ́gẹ́ bí ìlànà ìjọ́sìn tàbí àdìsọ́kàn ìgbàgbọ́ fún àwa mùsùlùmí. Ohun èlò àti n̄ǹkan ìgbádùn ayé, bíi lílo “sūf” fún híhun aṣọ fún oríṣiríṣi lílò àti fífi ṣòkòwò kátà-kárà nínú ìṣẹ̀mí ayé wa, ni ìwúlò àti àǹfààní tí à ń rí lára “sūf”. \n Síwájú sí i, nínú èdè Lárúbáwá, tí a bá fẹ́ fi ìbátan hàn láààrin n̄ǹkan méjì pẹ̀lú ẹyọ ọ̀rọ̀ kan ṣoṣo ìyẹn nígbà tí a bá fẹ́ ṣe àfihàn ohun tí wọ́n lò láti fi ṣe n̄ǹkan kan, tàbí nígbà tí a bá fẹ́ ròyìn ènìyàn pẹ̀lú ohun tí ó máa ń lò, a kàn máa fi lẹ́tà “yā’un muṣaddadah” kún kalmọh náà, tí “yā’un muṣaddadah” náà sì máa jẹ́ àfòmọ́-ìparí fún kalmọh náà. “Yā’un muṣaddadah” yìí ni à ń pè ní “yā’u-nnisbah” (yā’u ìbátan / yā’u afìbátanhàn) nínú ẹ̀kọ́ mọfọ́lọ́jì èdè Lárúbáwá. \n Nítorí náà, nínú èdè Lárúbáwá, nígbà tí a bá fẹ́ sọ pé aṣọ kan jẹ́ aṣọ tí wọ́n fi irun àgùtàn hun tàbí nígbà tí a bá fẹ́ sọ pé ènìyàn kan máa ń wọ aṣọ tí wọ́n fi irun àgùtàn hun, a kàn máa so àfòmọ́ ìparí “yyun” (èyí tí a pè ní “yā’u-nnisbah”) mọ́ ìparí kalmọh “sūf”, ó sì máa di “صُوفِيٌّ” “sūfiyyun / sūfiyy” (akọ, ẹyọ), “صُوفِيُّونَ” “sūfiyyūn” (akọ, ọ̀pọ̀), “صُوفِيَّةٌ” “sūfiyyatun / sūfiyyah” (abo, ẹyọ / ọ̀rọ̀-orúkọ tí a ṣẹ̀dá láti ara sūf) “صُوفِيَّاتٌ” “sūfiyyāt” (abo, ọ̀pọ̀). Ìtúmọ̀ gbogbo rẹ̀: “aṣọ tí wọ́n fi irun àgùtàn hun / olùwọṣọ-irun àgùtàn. \n Síwájú sí i, nínú àwọn ìran n̄ǹkan tí ẹ̀dá ń lò fún híhun aṣọ, aṣọ èyí tí wọ́n bá fi irun àgùtàn hún máa ń jẹ́ aṣọ tó rọjú jùlọ ní rírà. Nítorí èyí, aṣọ irun àgùtàn jẹ́ aṣọ àwọn mẹ̀kúnnù. Àwọn olówó kì í sì fẹ́ rà á fún wíwọ̀ sọ́rùn nítorí pé, ó jẹ́ aṣọ pọ́ọ́kú-lowóẹ̀, kì í sì jọ̀lọ̀ lára rárá bí ìran aṣọ mìíràn. Nítorí pé, aṣọ irun àgùtàn jẹ́ aṣọ tálíkà, ló mú aṣọ náà di ọ̀gá aṣọ fún àwọn tí wọ́n bá fẹ́ ráyé sá nínú àwọn ẹni-ìṣáájú. \n Ìmúra àwọn ẹni-ìṣáájú gbajúmọ̀ pẹ̀lú wíwọ aṣọ irun àgùtàn láti fi mú ayé bín-íntín tó bẹ́ẹ̀ gẹ́ tó fi jẹ́ pé tí wọ́n bá fẹ́ pe ẹnikẹ́ni nínú wọn ní olùráyésá, “sūfiyy” ni wọ́n á pe irú ẹni náà nítorí pé, kò = = sí olùráyésá kan nínú wọn àfi kí ó dúnnímọ́ wíwọ aṣọ irun àgùtàn tààrà. Ìdí nìyí tí a bá gbọ́ pé wọ́n pe àáfà àgbà kan nínú àwọn aṣíwájú rere fún wa ní “sūfiyy” bí Imām Ṣāfi‘iyy tàbí ẹlòmíìràn, ìráyésá wọn nípa wíwọ aṣọ irun àgùtàn ló mú wọn jẹ́ bẹ́ẹ̀. \n Lára sunnah Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - sì ni ìráyésá wà. Oríkì ìráyésá nìyí nígbà náà: Ìráyésá ni jíjìnnà sí àwọn n̄ǹkan olówó ńlá àti jíjìnnà sí kíkó ọrọ̀ ilé ayé jọ àti lílo àwọn n̄ǹkan tó kéré jùlọ ní òǹkà láti fi gbé ìṣẹ̀mí ayé ẹni ró. Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - sì ni aṣíwájú gbogbo àwọn olùráyésá. Dídi olùwọṣọ-irun àgùtàn “sūfiyy lábẹ́ ìráyésá” nígbà náà kò lòdì sí ẹ̀sìn ’Islām nítorí pé, jíjẹ́ “sūfiyy” ẹnikẹ́ni nínú wọn kò sọ ọ́ di ẹni tí ó ní ìlànà ẹ̀sìn tàbí àdìsọ́kàn mìíràn tó yàtọ̀ sí sunnah Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a -. Bí ọ̀rọ̀ àwọn sūfiyy “àwọn olùwọṣọ-irun àgùtàn” ṣe wà nìyẹn títí di ọgọ́rùn-ún mẹ́ta ọdún àkọ́kọ́ lẹ́yìn Hijrah. \n Lẹ́yìn ọgọ́rùn-ún mẹ́ta ọdún àkọ́kọ́ lẹ́yìn Hijrah ni àwọn kan nínú ìlú Basrọ nílẹ̀ ‘Irāƙ bá sọ orúkọ yìí “صُوفِيَّةٌ” “sūfiyyah” di n̄ǹkan mìíràn mọ́ra wọn lọ́wọ́. Àwọn ènìyàn wọ̀nyẹn gbé ìtúmọ̀ rẹ̀ kúrò lábẹ́ “wíwọ aṣọ irun àgùtàn” pátápátá, wọ́n sì fún un ní ìtúmọ̀ àgbélẹ̀rọ àti ayédèrú bíi kí wọ́n sọ pé “sūfiyyah” túmọ̀ sí dídi ẹni mímọ́, olùfọkànsìn, ẹni ẹ̀ṣà, wòlíì Ọlọ́hun àti bẹ́ẹ̀ bẹ́ẹ̀ lọ . Paríparí rẹ̀ ni pé, àwọn ènìyàn wọ̀nyẹn bá sọ orúkọ náà “sūfiyyah” di ìlànà ẹ̀sìn titun kan, wọ́n sì gbé e jù sábẹ́ ẹ̀sìn ’Islām. Àwọn ènìyàn wọ̀nyẹn bá bẹ̀rẹ̀ sí to ọ̀kan-ò-jọ̀kan ìròrí àwọn ọ̀ṣẹbọ, ìròrí àwọn yẹhudi àti ìròrí àwọn nasọ̄rọ̄ papọ̀ mọ́ra wọn ní ọ̀nà ẹ̀tàn pẹ̀lú yíyí àwọn ìtúmọ̀ āyah al-Ƙur’ān àti hadīth Ànábì lọ́rùn láti fi ṣe àtìlẹ́yìn fún ìlànà titun náà tí wọ́n ronú gbékalẹ̀ lábẹ́ orúkọ “sūfiyyah”. Nígbà tí wọ́n sì fura mọ̀ pé, orúkọ yìí kò kún tó, wọ́n bá tún ṣe ẹ̀dà orúkọ mìíràn láti ara rẹ̀. Orúkọ náà ni “التَّصَوُّفُ” “at-tasọwwuf”. Báyìí ni “sūfiyyah” tàbí “at-tasọwwuf” ṣe di ìjọ́sìn mìíràn ní pẹrẹu láààrin àwọn aláìlẹ́kọ̀ọ́ tí wọ́n bọ́há sọ́wọ́ àwọn àáfà onibidia. \n Bákan náà, nígbà tí àwọn àáfà onibidia tasọwwuf wọ̀nyí pèrò sọ́kọ̀ bidiah tasọwwuf tán, òǹpèrò kọ̀ọ̀kan nínú àwọn àáfà onibidiah wọ̀nyẹn bá tún bẹ̀rẹ̀ sí fi orúkọ ara rẹ̀ pèrò dípò lílo orúkọ àgbélẹ̀rọ tí wọ́n dìjọ ṣe àdádáálẹ̀ rẹ̀. Nígbà náà ni ayé wọn bá di ìlànà / tọrīkọ “at-tasọwuffu al-kọ̄diriyyah”, “at-tasọwuffu al-kọlwatiyyah” “at-tasọwuffu at-tijāniyyah” “at-tasọwuffu aṣ-Ṣāthiliyyah”, “at-tasọwuffu al-Haṣwatiyyah” àti “at-tasọwuffu an-naƙṣanbadiyyah”. Títí di òní olónìí, wọn kò yé fi orúkọ aṣíwájú wọn pèrò sọ́kọ̀ bidiah tasọwuffu wọn. Èyí ló sì ṣokùnfà bí wọ́n tún ṣe ń pe àwọn kan nínú àwọn ìlànà / tọrīkọ wọn ní “at-tasọwuffu an-Niyāsiyyah””, “at-tasọwuffu al-bulāliyyah” àti bẹ́ẹ̀ bẹ́ẹ̀ lọ. Àwọn mutasọwiffūn wọ̀nyí náà ni wọ́n mú tíà sísà (bíi firāku, katali) àti iṣẹ́ yíyẹ̀wò, oogun ṣíṣe, idán pípa, lílo àlùjànnú, lílọ nínú ẹ̀mí àti iṣẹ́ jálàbí ṣíṣe (ìyẹn, iṣẹ́ babaláwo) wọ inú ẹ̀sìn ’Islām. Àwọn sì ni wọ́n pọ̀ jùlọ nílẹ̀ aláwọ̀dúdú, pàápàá jùlọ ní ilẹ̀ Naijiria. \n Wò ó, ìlànà tasọwuffu ti lé ní ìgbà ọ̀nà. Ó sì ti di tọ́rọ́-fọ́kánlé tó bẹ́ẹ̀ gẹ́ tó fí jẹ́ pé, tí ọkùnrin kan kò bá ti rí iṣẹ́ halāl ṣe ní iṣẹ́ òòjọ́, ó máa di “ṣééù”, tí obìnrin náà kò bá ti rí ọ̀kan-ṣèkan mọ́, òun náà á sọra rẹ̀ di “ṣééhá”. Òṣì, àìríná àti àìrílò ti kó wọn sínú tasọwuffu. Pẹ̀lú ète àwọn àlùjànnú, iná idán àwọ́rò wọn sì ń jò bùlàbùlà. Kíyè sí i, yálà al-Ƙur’ān tàbí hadīth Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a -, kò sí ọ̀kan kan nínú méjèèjì tó fàyè gba ìlànà mìíràn yàtọ̀ sí sunnah Ànábì nínú ìjọ́sìn mùsùlùmí tàbí ìṣe mùsùlùmí tàbí ìròrí mùsùlùmí. Ẹnikẹ́ni tí ó bá tún lérò pé ìlànà àfikún kan tún wà fún mùsùlùmí láti lè súnmọ́ Allāhu tààrà dípò gbígba tító pẹ̀lú sunnah Ànábì wa Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a -, onítọ̀ún ni a ó máa pè ní onibidiah “aládàádáálẹ̀ ìlànà ẹ̀sìn”. Tí irú ẹni bẹ́ẹ̀ kò bá sì ronú pìwàdà pátápátá kúrò lórí dída sunnah Ànábì pọ̀mọ́ ìlànà àdádáálẹ̀ pẹ̀lú èròǹgbà láti pé lẹ́sìn, Iná ni ẹ̀san rẹ̀ lọ́run ní ìbámu sí sūrah an-Nisā’; 4:115. Àkàwé sunnah Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - ni àpẹ̀ẹrẹ omi tí wọ́n rọ kún inú ìgò fìfo. Àkàwé èyíkéyìí ìlànà àdádáálé tí wọ́n bá fi kún sunnah Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - sì ni omi mìíràn tí wọ́n tún fẹ́ rọ mọ́ ẹ̀kún igo omi náà. Ìgbàkígbà tí ẹnikẹ́ni bá tún rọ omi mìíràn sínú ẹ̀kún igo omi náà, ilẹ̀ ni yóò máa dà sí títí láéláé. Omi náà yó sì máa ṣòfò dànù. Ìdí nìyí ti gbogbo ìran tasọwuffu àti àpapọ̀ tasọwuffu fi máa di òfò pọ́nńbélé lọ́jọ́ ìṣírò-iṣẹ́. Àti pé, ọ̀kan pàtàkì nínú bidiah Aṣaetāni ni gbogbo ìran tasọwuffāt pátápátá nítorí pé, “sūfiyyah” ti kúrò ní abẹ́ ìráyésá pátápátá, ó sì ti bọ́ sí abẹ́ awo ṣíṣe, awo èṣù. Kí Allāhu bá wa gbé sunnah Ànábì ga. Kí Ó bá wa rẹ bidiah Aṣaetāni nílẹ̀. Kí Ó sì bá wa paná adẹ́bọ rẹ́.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"wal-lahu jaʿala lakum min buyūtikum sakanan wajaʿala lakum min julūdi al-anʿāmi buyūtan tastakhiffūnahā yawma ẓaʿnikum wayawma iqāmatikum wamin aṣwāfihā wa-awbārihā wa-ashʿārihā athāthan wamatāʿan ilā ḥīnin ","translations":["And Allah","(has) made","for you","[from]","your homes","a resting place","and made","for you","from","the hides","(of) the cattle","tents","which you find light","(on) the day","(of) your travel","and the day","(of) your encampment","and from","their wool","and their fur","and their hair","(is) furnishing","and a provision","for","a time","(80)"],"transliterationArr":["wal-lahu","jaʿala","lakum","min","buyūtikum","sakanan","wajaʿala","lakum","min","julūdi","al-anʿāmi","buyūtan","tastakhiffūnahā","yawma","ẓaʿnikum","wayawma","iqāmatikum","wamin","aṣwāfihā","wa-awbārihā","wa-ashʿārihā","athāthan","wamatāʿan","ilā","ḥīnin",null],"verseTiming":[[1,0,1270],[2,1270,1930],[3,1930,2440],[4,2440,3710],[5,3710,5510],[6,5510,7000],[7,7000,7910],[8,7910,8530],[9,8530,9700],[10,9700,11070],[11,11070,12470],[12,12470,13460],[13,13460,16580],[14,16580,19470],[15,19470,20120],[16,20120,21480],[17,21480,22450],[18,22450,24210],[19,24210,24890],[20,24890,26620],[21,26620,28660],[22,28660,31860],[23,31860,33890],[24,33890,34980],[25,34980,37340],[26,37340,37930],[27,37930,40335]]}}