{"name":"17:1","price":"Mímọ́ ni fún Ẹni tí Ó mú ẹrúsìn Rẹ̀ ṣe ìrìn-àjò ní alẹ́ láti Mọ́sálásí Haram sí Mọ́sálásí Aƙsọ̄ tí A fi ìbùkún yí ká, nítorí kí Á lè fi nínú àwọn àmì Wa hàn án. Dájúdájú Allāhu, Òun ni Olùgbọ́, Olùríran.¹","arabic":"سُبۡحَٰنَ ٱلَّذِيٓ أَسۡرَىٰ بِعَبۡدِهِۦ لَيۡلٗا مِّنَ ٱلۡمَسۡجِدِ ٱلۡحَرَامِ إِلَى ٱلۡمَسۡجِدِ ٱلۡأَقۡصَا ٱلَّذِي بَٰرَكۡنَا حَوۡلَهُۥ لِنُرِيَهُۥ مِنۡ ءَايَٰتِنَآۚ إِنَّهُۥ هُوَ ٱلسَّمِيعُ ٱلۡبَصِيرُ","category":["17 (Al-Isra)","Al-Isra","Surah Al-Isra","Chapter Al-Isra","Isra","Surah Isra","Chapter Isra","Al Isra","Surah Al Isra","Chapter Al Isra","Surah 17","Chapter 17","The Night Journey","الإسرَاء"],"ayahNumber":2030,"juzNumber":15,"footnotes":"1. Bí ó tilẹ̀ jẹ́ pé àwọn kan lérò pé àlá lílá ni ìrìn-àjò òru tí Allāhu - subhānahu wa ta ‘ālā - mú Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a -rìn, ohun tí ó fẹsẹ̀ rinlẹ̀ jùlọ ni pé, ìrìn-àjò òru náà jẹ́ ìrìn-àjò ẹ̀mí àti ara. Èyí rí bẹ́ẹ̀ nítorí pé Allāhu - subhānahu wa ta ‘ālā - kò sọ ọ̀rọ̀ ìrìn-àjò náà ní ìsọ àlá lílá páàpáà. Ẹ wo àgbékalẹ̀ āyah ìrìn-àjò ẹ̀mí àti ara yìí sí àgbékalẹ̀ àwọn āyah àlá lílá wọ̀nyí nínú sūrah Yūsuf; 12:4 & 43, sūrah as-Sọ̄ffāt; 37:102 àti sūrah al-Fat-h; 48:27. \n Bákan náà, ìrìn-àjò náà ìbá jẹ́ àlá lílá, àwọn ọ̀ṣẹbọ ìbá tí ṣe àtakò sí i. Àti pé ṣíṣe àtakò sí ìrìn-àjò náà láti ọ̀dọ̀ àwọn ọ̀ṣẹbọ nípa bí ìró ìṣẹ̀lẹ̀ ìrìn-àjò òru náà ṣe ga tayọ òye wọn ló kó wọn sínú àdánwò tí Allāhu - subhānahu wa ta ‘ālā - sọ nípa rẹ̀ nínú āyah 60 nínú sūrah yìí. \n Kíyè sí i, gbólóhùn “subhān-llathī” ìbá tí bẹ̀rẹ̀ āyah yìí, Tí ó bá jẹ́ pé ìrìn-àjò ojú àlá lásán ni. \n Síwájú sí i, àwọn n̄ǹkan pàtàkì pàtàkì ni Ànábì wa - kí ìkẹ́ àti ọlà Allāhu máa bá a - fojú rí nínú àwọn sánmọ̀ àti lókè sánmọ̀ keje lórí ìrìn-àjò òru rẹ̀ tí Allāhu - subhānahu wa ta‘ālā - mú un rìn. Nínú ìrìn-àjò òru náà ni Allāhu sì ti fún un ní àwọn ìrun wákàtí = = márùn-ún. Àmọ́ Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - kò fojú rí Allāhu rárá - subhānahu wa ta‘ālā - ní ìbámu sí ọ̀rọ̀ ìyá wa ‘Ā’iṣah - kí Allāhu yọ́nú sí i - tí ó sọ pé: “Dájúdájú òpùrọ́ ni ẹnikẹ́ni tí ó bá sọ pé (Ànábì) Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - fojú rí Olúwa rẹ̀. Lẹ́yìn náà, ìyá wa, ‘Ā’iṣah - kí Allāhu yọ́nú sí i - fi sūrah al-’An‘ām; 6:103 àti sūrah aṣ-Ṣūrọ̄; 42:51 ṣe ẹ̀rí ọ̀rọ̀ náà.” (al-Bukāriy)\n Síwájú sí i, àwọn mùsùlùmí, wọ́n ti ń kí ìrun ṣíwájú ìrìn-àjò òru náà, àmọ́ kì í ṣe ìrun wákàtí márùn-ún, kódà kì í ṣe ìrun ọ̀ran-anyàn. Ìrìn-àjò òru àti ìgun-sánmọ̀-lọ Ànábì wa - kí ìkẹ́ àti ọlà Allāhu máa bá a - ló bí ìrun ọ̀ran-anyàn àti ìrun wákàtí márùn-ún ojoojúmọ́. \n Síwájú sí i, ọ̀rọ̀ yìí “bi ‘abdih” (ẹrúsìn Rẹ̀). Ẹrúsìn Rẹ̀ nínú āyah yìí kò dúró fún ẹnì kan bí kò ṣe Ànábì wa Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a -. Àpẹ̀ẹrẹ àyè mìíràn nìyí: sūrah al-Kahf; 18:1, sūrah al-Furƙọ̄n; 25:1, sūrah az-Zumọr; 39:36, sūrah an-Najm; 53:10 àti sūrah al-Hadīd; 57:9. Àyè ẹyọ kan péré tí “‘abdah” kò ti dúró fún un, Allāhu - subhānahu wa ta ‘ālā - kúkú dárúkọ ẹni tí “‘abdah” dúró fún níbẹ̀. Àyè náà ni sūrah Mọryam; 19:2.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"sub'ḥāna alladhī asrā biʿabdihi laylan mina al-masjidi al-ḥarāmi ilā al-masjidi al-aqṣā alladhī bāraknā ḥawlahu linuriyahu min āyātinā innahu huwa al-samīʿu al-baṣīru ","translations":["Exalted","(is) the One Who","took","His servant","(by) night","from","Al-Masjid Al-Haraam","Al-Masjid Al-Haraam","to","Al-Masjid Al-Aqsa","Al-Masjid Al-Aqsa","which","We blessed","its surroundings","that We may show him","of","Our Signs","Indeed He","He","(is) the All-Hearer","the All-Seer","(1)"],"transliterationArr":["sub'ḥāna","alladhī","asrā","biʿabdihi","laylan","mina","al-masjidi","al-ḥarāmi","ilā","al-masjidi","al-aqṣā","alladhī","bāraknā","ḥawlahu","linuriyahu","min","āyātinā","innahu","huwa","al-samīʿu","al-baṣīru",null],"verseTiming":[[1,0,1080],[2,1080,3130],[3,3130,3940],[4,3940,5260],[5,5260,5860],[6,5860,6890],[7,6890,7990],[8,7990,9050],[9,9050,9380],[10,9380,10450],[11,10450,11260],[12,11260,12080],[13,12080,13330],[14,13330,14450],[15,14450,15660],[16,15660,16070],[17,16070,17570],[18,17570,20100],[19,20100,20510],[20,20510,21630],[21,21630,24165]]}}