{"name":"18:24","price":"Àyàfi (kí o fi kún un pé) “tí Allāhu bá fẹ́.” Ṣe ìrántí Olúwa rẹ nígbà tí o bá gbàgbé (láti sọ bẹ́ẹ̀ lásìkò náà). Kí o sì sọ (fún wọn) pé: “Ó rọrùn kí Olúwa mi tọ́ mi sọ́nà lórí rẹ̀ pẹ̀lú èyí tí ó súnmọ́ jù èyí lọ ní ìmọ̀nà (fún yín).”¹","arabic":"إِلَّآ أَن يَشَآءَ ٱللَّهُۚ وَٱذۡكُر رَّبَّكَ إِذَا نَسِيتَ وَقُلۡ عَسَىٰٓ أَن يَهۡدِيَنِ رَبِّي لِأَقۡرَبَ مِنۡ هَٰذَا رَشَدٗا","category":["18 (Al-Kahf)","Al-Kahf","Surah Al-Kahf","Chapter Al-Kahf","Kahf","Surah Kahf","Chapter Kahf","Al Kahf","Surah Al Kahf","Chapter Al Kahf","Surah 18","Chapter 18","The Cave","الكَهف"],"ayahNumber":2164,"juzNumber":15,"footnotes":"1. Okùnfà āyah yìí ni pé, nígbà tí àwọn yẹhudi wá bi Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - léèrè nípa ọ̀rọ̀ àwọn ará inú ọ̀gbun àpáta pẹ̀lú èròǹgbà wọn pé tí ó bá jẹ́ Ànábì Ọlọ́hun ní ti òdodo, ó yẹ kí ó nímọ̀ nípa wọn, Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - sì sọ fún wọn pé kí wọ́n wá gbọ́ ìtàn wọn ní ọjọ́ kejì pẹ̀lú èròǹgbà rẹ̀ pé Allāhu á ti fi ìmísí nípa wọn ránṣẹ́ sí òun. Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - kò sì sọ fún àwọn yẹhudi náà pé “tí Allāhu bá fẹ́.” Àmọ́ àì sọ bẹ́ẹ̀ rẹ̀ jẹ́ kí ọjọ́ àdéhùn tó ṣe fún wọn yẹ̀.\n Allāhu - subhānahu wa ta‘ālā - sì fi ìṣẹ̀lẹ̀ náà kọ́ Ànábì Rẹ̀ - kí ìkẹ́ àti ọlà Allāhu máa bá a - ní ẹ̀kọ́ pé, ó yẹ kí ó fi kún un fún wọn pé “tí Allāhu bá fẹ́.” Lẹ́yìn náà, ìmísí nípa àwọn ará inú ọ̀gbun àpáta dé. Allāhu - subhānahu wa ta‘ālā - sì tún jẹ́ kí ó di mímọ̀ fún Ànábì Rẹ̀ - kí ìkẹ́ àti ọlà Allāhu máa bá a - pé, àwọn ìtàn ìmọ̀nà mìíràn wà tó lè mú kí àwọn yẹhudi wọ̀nyẹn mọ̀ pé dájúdájú Òjíṣẹ́ Allāhu ní í ṣe. Tí wọ́n bá ṣetán láti tẹ̀lé ìmọ̀nà tí Ànábì mú wá, Allāhu tún lè sọ àwọn ìtàn tó lọ́jọ́ lórí ju ti àwọn ará inú ọ̀gbun àpáta, tó sì tún lágbára jùlọ láti fún àwọn ọkàn ní ìmọ̀nà. Allāhu - subhānahu wa ta‘ālā - sì kúkú ṣe bẹ́ẹ̀ pẹ̀lú àwọn ọ̀rọ̀ ayérayé, àwọn ọ̀rọ̀ ìgbà-àwá-sẹ̀ bíi ìtàn ìṣẹ̀dá ayé àti ọ̀run, ìtàn àwọn Ànábì àti àwọn Òjíṣẹ́ Ọlọ́hun tó ti ré kọjá lọ tí kò sí déètì rẹ̀ lọ́wọ́ ẹnì kan kan. Àmọ́ sá, olórí-kunkun ni àwọn yẹhudi; wọ́n gbọ àwọn ìyáláàyá ìtàn òdodo náà, wọ́n sì gbúnrí, wọn kò sì padà sínú ’Islām.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"illā an yashāa al-lahu wa-udh'kur rabbaka idhā nasīta waqul ʿasā an yahdiyani rabbī li-aqraba min hādhā rashadan ","translations":["Except","If","Allah wills","Allah wills","And remember","your Lord","when","you forget","and say","Perhaps","[that]","will guide me","my Lord","to a nearer (way)","than","this","right way","(24)"],"transliterationArr":["illā","an","yashāa","al-lahu","wa-udh'kur","rabbaka","idhā","nasīta","waqul","ʿasā","an","yahdiyani","rabbī","li-aqraba","min","hādhā","rashadan",null],"verseTiming":[[1,0,2130],[2,2130,2370],[3,2370,5360],[4,5360,8160],[5,8160,8890],[6,8890,9880],[7,9880,10490],[8,10490,11390],[9,11390,11900],[10,11900,14010],[11,14010,14500],[12,14500,15940],[13,15940,16780],[14,16780,17920],[15,17920,18560],[16,18560,18960],[17,18960,20475]]}}