{"name":"18:66","price":"(Ànábì) Mūsā sọ fún un pé: “Ṣé kí n̄g tẹ̀lé ọ nítorí kí o lè kọ́ mi nínú ohun tí Wọ́n fi mọ̀ ọ́ ní ìmọ̀nà.”¹","arabic":"قَالَ لَهُۥ مُوسَىٰ هَلۡ أَتَّبِعُكَ عَلَىٰٓ أَن تُعَلِّمَنِ مِمَّا عُلِّمۡتَ رُشۡدٗا","category":["18 (Al-Kahf)","Al-Kahf","Surah Al-Kahf","Chapter Al-Kahf","Kahf","Surah Kahf","Chapter Kahf","Al Kahf","Surah Al Kahf","Chapter Al Kahf","Surah 18","Chapter 18","The Cave","الكَهف"],"ayahNumber":2206,"juzNumber":15,"footnotes":"1. Ẹnikẹ́ni kò gbọdọ̀ lérò pé lílọ tí Ànábì Mūsā lọ sí ọ̀dọ̀ Kidr túmọ̀ sí pé Kidr lóore ju Ànábì Mūsā - kí ọlà Allāhu máa bá a - lọ́dọ̀ Allāhu - subhānahu wa ta‘ālā -. Tí Kidr bá jẹ́ ọ̀rẹ́ Allāhu “waliyyu-llāh”, ipò jíjẹ́ Ànábì jẹ́ oore àjùlọ lórí ipò jíjẹ́ waliyyu. Tí àwọn méjèèjì bá sì dìjọ jẹ́ Ànábì, fífún tí Allāhu - subhanahu wa ta‘ālā - fún Ànábì Mūsā ní Tírà tún jẹ́ oore àjùlọ mìíràn lórí Kidr. Àti pé Ànábì Mūsā - kí ọlà Allāhu máa bá a - tún ní oore àjùlọ mìíràn nípa bí ó tún ṣe jẹ́ ọ̀kan pàtàkì nínú àwọn Òjíṣẹ́ tí a mọ̀ sí àwọn Onípinnu nínú àwọn Òjíṣẹ́ \" ’ulul-‘azmi minar-Rusul\" - kí ọlà Allāhu máa bá wọn -. \n Síwájú sí i, gbogbo mùsùlùmí ni waliyyu-llāh, àmọ́ bí mùsùlùmí kọ̀ọ̀kan bá ṣe súnmọ́ Allāhu tó, nínú ìgbàgbọ́ àti ìbẹ̀rù rẹ̀ nípa lílo òfin ẹ̀sìn ’Islām, ló máa ṣ’òdíwọ̀n ìsúnmọ́ tí ń bẹ láààrin Allāhu - subhānahu wa ta‘ālā - àti ẹrúsìn Rẹ̀ náà. \n Ṣíwájú Ànábì wa Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a -, Allāhu fún àwọn mùsùlùmí kan ní àǹfààní láti rí ìṣípayá mímọ́ gbà láti ọ̀dọ̀ Rẹ̀. Lára àwọn tí Allāhu ṣe èyí fún ni ìyá Mūsā, Mọryam ìya ‘Īsā, Thul-Ƙọrneen àti Kidr. Ìṣípayá mímọ́ tí Allāhu fi ránṣẹ́ sí wọn yìí kò sọ wọ́n di Ànábì tàbí Òjíṣẹ́. Àmọ́ wọ́n gbọdọ̀ tẹ̀lé àṣẹ tí ìṣípayá mímọ́ náà mú wá fún wọn, bí àpẹ̀ẹrẹ, ìya Ànábì Mūsā kò ṣàdédé gbé ọmọ rẹ̀, Ànábì Mūsā jù sínú odò, tí kì í bá ṣe pé Allāhu - subhānahu wa ta‘ālā - l’Ó pa á láṣẹ láti ṣe bẹ́ẹ̀ nínú ìṣípayá mímọ́ tí Ó fi ránṣẹ́ sí i. \n Bákan náà, àwọn n̄ǹkan mẹ́tẹ̀ẹ̀ta wọ̀nyẹn tí Kidr dánwò lójú Ànábì Mūsā, ìbá tí ṣẹlẹ̀ bẹ́ẹ̀, tí kì í bá ṣe pé Allāhu - subhānahu wa ta‘ālā - l’Ó pa á láṣẹ láti ṣe bẹ́ẹ̀. Irú àǹfààní wọ̀nyí wà fún àwọn tó ṣíwájú Ànábì wa - kí ìkẹ́ àti ọlà Allāhu máa bá a -, ṣùgbọ́n kò sí fún ìjọ Ànábì wa - kí ìkẹ́ àti ọlà Allāhu máa bá a -. \n Èyí ni pé, lásìkò yìí ẹnì kan kan kò gbọdọ̀ lo òfin kan tí ó yapa sí òfin tí Ànábì wa - kí ìkẹ́ àti ọlà Allāhu máa bá a - mú wá, kí ó wí pé Allāhu - subhānahu wa ta‘ālā - l’Ó fún òun náà ní ìṣípayá mímọ́ láti ṣe bẹ́ẹ̀. Wọ́ọ́rọ́wọ́ ni onítọ̀ún yóò jáde kúrò nínú ipò jíjẹ́ mùsùlùmí. Ọ̀wọ́ ẹnì kan ṣoṣo tí Allāhu ìbá fún ní ìṣípayá mímọ́ nínú ìjọ Ànábì wa - kí ìkẹ́ àti ọlà Allāhu máa bá a -, òun ni ’Amīrul-mu’minīn, ‘Umar bun Kattọ̄b - kí Allāhu yọ́nú sí i -. Èyí wà ní ìbámu sí ọ̀rọ̀ Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - tí ó sọ pé: “Dájúdájú ṣíwájú yín nínú àwọn ọmọ ’Isrọ̄’īl, ni a ti rí àwọn ènìyàn kan tí Allāhu bá sọ̀rọ̀ (ní ti ìṣípayá mímọ́), wọn kì í sì ṣe Ànábì. Tí ó bá jẹ́ pé ọ̀kan nínú wọn máa wà nínú ìjọ mi ni, ‘Umar ni ìbá jẹ́.” [Al-Bukāriy; bāb mọnāƙib ‘Umọr] \n Bákan náà, ohun tí Ànábì Mūsā - kí ìkẹ́ àti ọlà Allāhu máa bá a - kọ́ lọ́dọ̀ Kidr kò túmọ̀ sí pé, ó kọ́ ọ fún lílò láààrin ìjọ rẹ̀. Allāhu - subhānahu wa ta‘ālā - ti fún Ànábì Mūsā ní òfin àti ìlànà tirẹ̀ nínú ’Islām, kò sì lẹ́tọ̀ọ́ fún un láti lo òfin àti ìlànà tí Allāhu fún Kidr, yálà Kidr jẹ́ waliyyu tàbí Ànábì. Èyí wà ní ìbámu sí sūrah al-Mọ̄’idah; 5:48. \n Nítorí náà, ẹ̀kọ́ pàtàkì tí Allāhu - subhānahu wa ta‘ālā - fẹ́ kọ́ Ànábì Mūsā - kí ọlà Allāhu máa bá a - nípa ìrìn-àjò rẹ̀ sọ́dọ̀ Kidr ni pé, ìmọ̀ nípa òfin àti ìlànà ’Islām, èyí tí Allāhu fún ẹnì kọ̀ọ̀kan wọn yàtọ̀ síra wọn díẹ̀díẹ̀, láti ọ̀dọ̀ Ànábì kan sí òmíràn. Àti pé kò rọrùn fún ẹnì kan nínú wọn láti jẹ́ alámọ̀tán ohun gbogbo. Allāhu - subhānahu wa ta‘ālā - nìkan ṣoṣo sì ni Onímọ̀ nípa gbogbo n̄ǹkan.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"qāla lahu mūsā hal attabiʿuka ʿalā an tuʿallimani mimmā ʿullim'ta rush'dan ","translations":["Said","to him","Musa","May","I follow you","on","that","you teach me","of what","you have been taught","(of) right guidance","(66)"],"transliterationArr":["qāla","lahu","mūsā","hal","attabiʿuka","ʿalā","an","tuʿallimani","mimmā","ʿullim'ta","rush'dan",null],"verseTiming":[[1,0,710],[2,710,1300],[3,1300,2210],[4,2210,2680],[5,2680,3960],[6,3960,5830],[7,5830,6960],[8,6960,8290],[9,8290,9620],[10,9620,10700],[11,10700,11745]]}}