{"name":"19:1","price":"Kāf hā yā ‘aēn sọ̄d. (Allāhu ló mọ ohun tí Ó gbàlérò pẹ̀lú àwọn háràfí náà.)¹","arabic":"كٓهيعٓصٓ","category":["19 (Maryam)","Maryam","Surah Maryam","Chapter Maryam","Surah 19","Chapter 19","Mary","مَريَم"],"ayahNumber":2251,"juzNumber":16,"footnotes":"1. Ẹ wo ìtọsẹ̀-ọ̀rọ̀ sūrah al Baƙọrah; 2:1.\n 2. Àwọn nasọ̄rọ̄ sọ pé: “Fífi sūrah yìí sọrí Mọryam, ìyá ‘Īsā àti fífi sūrah kẹta, ìyẹn sūrah āli ‘Imrọ̄n, sọrí mọ̀lẹ́bí Mọryam ti fi hàn kedere pé, kò sí irú Mọryam nínú àwọn ẹ̀dá nítorí pé, kò tún sí sūrah kan kan mọ́ nínú al-Ƙur’ān tí Allāhu fi sọrí obìnrin mìíràn.” Wọ́n tún fi kún un pé, “Ṣebí kò sí sūrah tí wọ́n fi sọrí ìyá Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - tàbí ìyàwó rẹ̀ tàbí ọmọbìnrin rẹ̀.”\n Èsì: Kí ni ìbátan orúkọ Mọryam, ìyá ‘Īsā àti jíjọ́sìn fún Ọlọ́hun Ọ̀kan ṣoṣo? Kò sí. Allāhu tó dá Mọryam, ìyá ‘Īsā, Òun l’Ó ṣà á lẹ́ṣà. Tòhun ti bẹ́ẹ̀ náà, Allāhu kò ṣe Mọryam ní Òjíṣẹ́ Rẹ̀. \n Dípò kí òye àwọn nasọ̄rọ̄ lọ síbi pé, tí kò bá jẹ́ pé al-Ƙur’ān alápọ̀n-ọ́nlé jẹ́ òdodo pọ́nńbélé tó sọ̀kalẹ̀ láti ọ̀dọ̀ Ọlọ́hun, ìbá tí sọ àwọn òdodo wọ̀nyẹn nípa Mọryam, ìyá ‘Īsā. Ṣebí wọ́n kúkú fi ẹnu àbùkù kan Mọryam, ìyá ‘Īsā nínú Bíbélì, níbi tí wọ́n ti sọ ọ̀rọ̀ rẹ̀ pẹ̀lú Josẹfu gbẹ́nàgbẹ́nà, ẹni tí wọ́n kà kún ọkọ rẹ̀? \n Tí ó bá jẹ́ pé fífi orúkọ sọrí sūrah kan nínú al-Ƙur’ān alápọ̀n-ọ́nlé bá sọ ẹnikẹ́ni di ọlọ́hun lẹ́yìn Allāhu, kì í kúkú ṣe Mọryam nìkan ni ẹ̀dá tí wọ́n fi sūrah kan sọrí rẹ̀ nínú al-Ƙur’ān alápọ̀n-ọ́nlé. Kò sì pọn dandan láti rí orúkọ obìnrin mìíràn yàtọ̀ sí Mọryam nínú al-Ƙur’ān. Ṣebí ẹ̀dá ni Mọryam, ẹ̀dá ni àwọn mìíràn tí Allāhu fi sọrí àwọn sūrah ọ̀rọ̀ Rẹ̀. A kúkú rí sūrah Muhammad, gẹ́gẹ́ bí a ṣe rí sūrah Mọryam. Àmọ́, kò sí sūrah ‘Īsā. Níwọ̀n ìgbà tí kò sì sūrah ‘Īsā, tí kò sì tàbùkù Ànábì ‘Īsā - kí ọlà Allāhu máa bá a -, bẹ́ẹ̀ náà ni kò tàbùkù obìnrin kan kan tí kò bá sí orúkọ rẹ̀ nínú al-Ƙur’ān. Allāhu - tó ga jùlọ - kúkú fi òdidi sūrah kan sọrí gbogbo àwọn obìnrin, ìyẹn “sūrah an-Nisā’”. Tún wò ó, kò sì sí sūrah àwọn ọkùnrin. Ǹjẹ́ èyí yọ àwọn ọkùnrin kúrò nípò tí Allāhu fi ṣe àjùlọ fún wa lórí àwọn obìnrin bí? Rárá.\n Ẹ jẹ́ kí á bi àwọn nasọ̄rọ̄ léèrè ìbéèrè pé, ṣé nítorí pé wọ́n fi orúkọ Mọryam, ìyá ‘Īsā sọ sūrah ló máa sọ ‘Īsā tàbí ìyá rẹ̀ di olúwa àti olùgbàlà? Tàbí ṣé nítorí pé wọ́n fi orúkọ Mọryam, ìyá ‘Īsā sọ sūrah ló sọ ‘Īsā tàbí ìyá rẹ̀ di ọlọ́hun ọmọ? Tàbí ṣé nítorí pé wọ́n fi orúkọ Mọryam, ìyá ‘Īsā sọ sūrah ló sọ ẹ̀sìn nasọ̄rọ̄ di ojúlówó ẹ̀sìn Allāhu, nígbà tí àwọn méjèèjì gan-an kò dá nasrọ̄niyyah mọ̀ lójú ayé wọn? \n Tí ó bá jẹ́ pé nítorí pé wọ́n fi sūrah kan sọrí Mọryam, ìyá ‘Īsā lágbára tayọ “fífẹ́ bẹ́ẹ̀ Ọlọ́hun”, kí ni àwọn nasọ̄rọ̄ máa sọ nípa àwọn sūrah wọ̀nyí:\n Sūrah al-Baƙọrah - sūrah 2, sūrah tí wọ́n fi sọrí màálù tí ìjọ Ànábì Mūsā - kí ọlà Allāhu máa bá a - pa láti fi jí òkú dìde?\n Sūrah an-Nahl - sūrah 16, sūrah tí wọ́n fi sọrí àwọn kòkòrò oyin?\n Sūrah an-Naml - sūrah 27, sūrah tí wọ́n fi sọrí kòkòrò àwúrèbe (èèrà)?\n Sūrah al-’Ankabūt - sūrah 29, sūrah tí wọ́n fi sọrí aláǹtakùn?\n Sūrah al-Fīl - sūrah 105, sūrah tí wọ́n fi sọrí àwọn erin tí ìjọ Abraha gùn wá ja Kaabah lógun, àmọ́ tí Allāhu pa wọ́n rẹ́?\n Ṣé sūrah Màálù sọ màálù di bùrọ̀dá ni tàbí súrah erin sọ erin di bàbá? Ṣé sūrah kòkòrò òyin sọ kòkòrò oyin di òrìṣà ni tàbí sūrah aláǹtakùn sọ aláǹtakùn di ọmọ ọlọ́hun ni? Rárá o!\n Kókó ọ̀rọ̀ wa ni pé, Allāhu - tó ga jùlọ - kò pe Mọryam ní orúkọ kan nínú al-Ƙur’ān alápọ̀n-ọ́nlé tayọ olódodo. Bákan náà, ṣíṣe tí Allāhu - tó ga jùlọ - ṣe Mọryam ní ẹ̀ṣà ènìyàn, àmọ́ tí Allāhu kò ṣe ìyá àti bàbá Ànábì wa bẹ́ẹ̀, kò sọ ọmọ Mọryam di olúwà àti olùgbàlà. Ìyá àti bàbá Ànábì ’Ibrọ̄him ńkọ́? Kò sí ẹni tó tàbùkù Ànábì ’Ibrọ̄hīm lórí ẹ̀sùn pé, wọn kò dárúkọ ìyá rẹ̀ nínú al-Ƙur’ān alápọ̀n-ọ́nlé tàbí pé wọn kò fi sūrah kan sọrí rẹ̀ nínú al-Ƙur’ān alápọ̀n-ọ́nlé. Ànábì Mūsā ńkọ́? Kò sí ẹni tó tàbùkù Ànábì Mūsā lórí ẹ̀sùn pé, wọn kò dárúkọ ìyá àti bàbá rẹ̀ nínú al-Ƙur’ān alápọ̀n-ọ́nlé tàbí pé wọn kò fi sūrah kan sọrí rẹ̀ nínú al-Ƙur’ān alápọ̀n-ọ́nlé. \n Tí wọ́n bá dárúkọ wọn nínú rẹ̀ ńkọ́ tàbí tí wọ́n bá fi orúkọ wọn sọrí àwọn sūrah kan nínú rẹ̀ ńkọ́, kí ni ìwọ̀nyí níí ṣe pẹ̀lú bí a ṣe fẹ́ jọ́sìn fún Allāhu? Bí a ṣe rí sūrah āli ‘Imrọ̄n, tí Allāhu fi sọrí ẹbí Mọryam, a kúkú rí sūrah Ƙuraeṣ, tí Allāhu fi sọrí ẹbí Ànábì wa Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a -. Gbogbo ìwọ̀nyí kò sọ ẹnikẹ́ni di ọmọ Ọlọ́hun. Gbogbo ìwọ̀nyí kò sọ ẹnikẹ́ni di olúwa àti olùgbàlà lẹ́yìn Allāhu. Ṣíṣa ẹ̀dá kan lẹ́ṣà kò sì sí lọ́wọ́ ẹ̀dá. Allāhu l’Ó ń ṣa ẹni tí Ó bá fẹ́ lẹ́ṣà.\n Kíyè sí i, tí Allāhu - tó ga jùlọ - bá fi orúkọ ẹ̀dá kan sọrí sūrah kan tàbí Ó dárúkọ ẹ̀dá kan nínú al-Ƙur’ān, n̄ǹkan mẹ́ta kan gbọ́dọ̀ yé wa nípa rẹ̀ dáadáa.\n Ìkíní: Kò gbọ́dọ̀ sí ẹ̀sùn fún Allāhu - tó ga jùlọ - lórí dídárúkọ àti àìdárúkọ ẹnì kan nínú al-Ƙur’ān rẹ̀. Bí Allāhu ṣe fẹ́ l’Ó ṣe. \n Ìkejì: Òdodo tí kò ṣe é jà níyàn ni Allāhu - tó ga jùlọ - sọ nípa ẹ̀dá tí orúkọ rẹ̀ wà nínú al-Ƙur’ān nítorí pé, òdodo lọ̀rọ̀ Allāhu.\n Ìkẹta: Ẹ̀kọ́ tí Allāhu - tó ga jùlọ - bá fẹ́ kọ́ wa lára ẹ̀dá Rẹ̀ náà ni orí ire tiwa nínú rẹ̀, kì í ṣe pé kí ẹnì kan wá lò ó lódì láti fi tako Allāhu - tó ga jùlọ -.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"kaf-ha-ya-ain-sad ","translations":["Kaaf Ha Ya Ain Sad","(1)"],"transliterationArr":["kaf-ha-ya-ain-sad",null],"verseTiming":[[1,0,13715]]}}