{"name":"19:19","price":"(Mọlāika) sọ pé: “Èmi ni Òjíṣẹ́ Olúwa rẹ, (Ó rán mi sí ọ) pé kí n̄g fún ọ ní ọmọkùnrin mímọ́ kan.”¹","arabic":"قَالَ إِنَّمَآ أَنَا۠ رَسُولُ رَبِّكِ لِأَهَبَ لَكِ غُلَٰمٗا زَكِيّٗا","category":["19 (Maryam)","Maryam","Surah Maryam","Chapter Maryam","Surah 19","Chapter 19","Mary","مَريَم"],"ayahNumber":2269,"juzNumber":16,"footnotes":"1. Àwọn nasọ̄rọ̄ ń sọ pé Ànábì ‘Īsā - kí ọlà Allāhu máa bá a - nìkan ṣoṣo ni al-Ƙur’ān pè ní “ẹni mímọ́” gẹ́gẹ́ bí ó ṣe wà nínú āyah yìí. Èsì ní ṣókí ni pé, ní òdodo ẹni mímọ́ ni Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a -, àmọ́ kì í ṣe òun nìkan ni ẹni mímọ́. Āayah 13 nínú sūrah yìí kan náà pe Ànábì Yahyā - kí ọlà Allāhu máa bá a - ní ẹni mímọ́. Bákan náà, ọmọ tí àsọọ́lẹ̀ wáyé lórí rẹ̀ nínú sūrah al-Kahf; 17:81, ẹni mímọ́ ni al-Ƙur’ān pe òun náà. Báwo ni jíjẹ́ ẹni mímọ́ Ànábì ‘Īsā ṣe máa sọ ọ́ di olúwa àti olùgbàlà nígbà tí jíjẹ́ ẹni mímọ́ àwọn méjèèjì wọ̀nyẹn kò sọ wọ́n di bẹ́ẹ̀. \n Sì kíyè sì i, gbogbo àwọn Ànábì àti Òjíṣẹ́ Ọlọ́hun nínú al-Ƙur’ān ni ẹni mímọ́. Àti pé ìdà kejì ẹni mímọ́ ni ẹni àìmọ́. Báwo ni Allāhu ṣe máa fi iṣẹ́ mímọ́ rán ẹni àìmọ́? Kò lè ṣẹlẹ̀. Ṣíwájú sí i, nínú èdè Lárúbáwá, ìsọdorúkọ olùṣe fún “ẹni mímọ́” ni “zakiyyun”, ìsọdorúkọ àfòyemọ̀ fún “mímọ́” ni “zakāt”. Ìgbà tí ìròyìn bá bùáyà tán lára ẹni tí a fẹ́ pọ́n ní àpọ́npo, dípò kí Lárúbáwá lo ìsọdorúkọ olùṣe fún irú ẹni náà, ìsọdorúkọ àfòyemọ̀ ni wọ́n máa lò. Ìyẹn ni pé, jíjẹ́ ẹni mímọ́ tó lágbára gan-an ni ìlò èdè tí al-Ƙur’ān lò fún Ànábì Yahyā - kí ọlà Allāhu máa bá a - àti ọmọ alásọọ́lẹ̀ náà. Ta wá ni ó mọ́ jùlọ láààrin “zakiyyu” tó túmọ̀ sí “ẹni mímọ́” àti “zakāt” tó túmọ̀ sí “mímọ́”? Kò wa tán bí!","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"qāla innamā anā rasūlu rabbiki li-ahaba laki ghulāman zakiyyan ","translations":["He said","Only","I am","a Messenger","(from) your Lord","that I (may) bestow","on you","a son","pure","(19)"],"transliterationArr":["qāla","innamā","anā","rasūlu","rabbiki","li-ahaba","laki","ghulāman","zakiyyan",null],"verseTiming":[[1,0,710],[2,710,3330],[3,3330,3790],[4,3790,4860],[5,4860,5810],[6,5810,6610],[7,6610,7160],[8,7160,8960],[9,8960,10865]]}}