{"name":"19:30","price":"(Ọmọ náà) sọ̀rọ̀ pé: “Dájúdájú ẹrú Allāhu ni èmi. (Allāhu) fún mi ní Tírà. Ó sì ṣe mí ní Ànábì. ¹","arabic":"قَالَ إِنِّي عَبۡدُ ٱللَّهِ ءَاتَىٰنِيَ ٱلۡكِتَٰبَ وَجَعَلَنِي نَبِيّٗا","category":["19 (Maryam)","Maryam","Surah Maryam","Chapter Maryam","Surah 19","Chapter 19","Mary","مَريَم"],"ayahNumber":2280,"juzNumber":16,"footnotes":"1. Ẹrú Allāhu ni Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a -, àmọ́ àwọn nasọ̄rọ̄ kò gbàgbọ́ pé ẹrú Allāhu ni. Wọ́n ní, “ọmọ Ọlọ́hun ni.” Kódà àwọn náà sọra wọn di ọmọ Ọlọ́hun! Kí ni ìtúmọ̀ “ẹrú Ọlọ́hun”. Nínú èdè Yorùbá, kò sí ọ̀rọ̀ mìíràn fún ìdàkejì ẹrú bí kò ṣe “ọmọ”. Yorùbá bọ̀ wọ́n ní, “Bí ẹrú bá pẹ́ títí ẹrú á dọmọ”. Dọmọ ta ni? Ẹrú á dọmọ bàbá rẹ̀ nítorí pé, “ọ̀nà ló jìn, ẹrú ní baba”. Kí wá ni ọ̀rọ̀ mìíràn fún “ọmọ”? Ọmọ ni ẹni tí kò sí lóko-ẹrú. Nítorí náà, ọ̀rọ̀ mìíràn fún ọmọ àti òbí tí kò sí lóko ẹrú ni “olómìnira”.\n Ní ọ̀dọ̀ àwa mùsùlùmí, ìtúmọ̀ “ẹrú Ọlọ́hun” nìyí: “Ẹ̀dá tí ó ń tẹ̀lé ìlànà àti òfin Ọlọ́hun, ẹ̀dá tí ó ń bọ̀wọ̀ fún ìlànà àti òfin Ọlọ́hun, ẹ̀dá tí ó juwọ́ jusẹ̀ sílẹ̀ fún ìlànà àti òfin Ọlọ́hun àti ẹ̀dá tí ó ń jọ́sìn fún Ọlọ́hun lábẹ́ ìlànà àti òfin Ọlọ́hun. Ẹ̀dá náà kò sì níí yọ́nú sí ìlànà àti òfin mìíràn tó yàtọ̀ sí ti Ọlọ́hun.” Ẹni tí ó bá ń ṣe ìwọ̀nyẹn fún ohun mìíràn tàbí ẹlòmíìràn, ó ti sọra rẹ̀ di ẹrú rẹ̀, láì la wíwà ní oko-ẹrú lọ bíi ti ẹrú àfowórà tàbí ẹrú ogun. Èyí fi hàn pé, ẹrú ẹ̀dá yàtọ̀ sí ẹrú Ọlọ́hun. \n Àwọn òǹkọ-bíbèlí mọ̀ọ́mọ̀ yọ “ẹrú Ọlọ́hun” kúrò nínú bíbélì òde-òní ni. Wọ́n sì fi “ọmọ Ọlọ́hun” rọ́pò rẹ̀. Àmọ́ kò sí bí wọ́n ṣe lè sin òkú àbòsí tí ẹsẹ̀ rẹ̀ kò níí yọ sílẹ̀. Ìdí nìyí tí a fi rí ìtúmọ̀ “ẹrú Ọlọ́hun” kà nínú ìwé Róòmù 7:25 báyìí pé: “So then, with my mind I am a slave to the law of God, but with my flesh I am a slave to the law of sin.” Ìtúmọ̀: “Nítorí náà nígbà náà, pẹ̀lú ẹ̀mí mi, ẹrú ni mi sí òfin Ọlọ́hun, ṣùgbọ́n pẹ̀lú ẹran ara mi, ẹrú ni mi sí òfin ẹ̀ṣẹ̀. (New Revised Standard Version àti New International Version) Ìyẹn ni pé, tí ìwọ bá tẹ̀lé òfin Ọlọ́hun, ẹrú ni ìwọ lábẹ́ òfin Ọlọ́hun. Tí ìwọ bá sì tẹ̀lé òfin ẹ̀ṣẹ̀, ẹrú ni ìwọ lábẹ́ òfin ẹ̀ṣẹ̀. Nítorí náà, níwọ̀n ìgbà tí Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - ti tẹ̀lé òfin Ọlọ́hun, ẹrú Ọlọ́hun ni. Tàbí ẹnu àwọn nasọ̄rọ̄ gbà á láti sọ pé Ànábì ‘Īsā kò lo òfin àti ìlànà Ọlọ́hun pẹ̀lú ẹ̀mí àti ara rẹ̀? Rárá. Tàbí ẹnu àwọn nasọ̄rọ̄ gbà á láti sọ pé òfin ẹ̀ṣẹ̀ ni Ànábì ‘Īsā tẹ̀lé? Rárá. Kò kúkú sí ìkẹta, lẹ́yìn òfin Ọlọ́hun, òfin èṣù ló tún kù. Ànábì ‘Īsā kò sì lo òfin Èṣù rí nínú ayé rẹ̀.\n Àwa mùsùlùmí kú orí ire. Ọpẹ́ sì ni fún Ọlọ́hun tó jẹ́ kí á dá bàbá wa mọ̀ lọ́tọ̀ pé kì í ṣe Ọlọ́hun. Bákan náà, ẹ̀rù kò bà wá láti pe ara wa ní ẹrú Ọlọ́hun níbikíbi nítorí pé, pẹ̀lú ọkàn àti ara wa ni a fi gbà láti wà lábẹ́ òfin Rẹ̀. Ìwọ̀nba àṣìṣe tí a bá sì fi ara ṣe gẹ́gẹ́ bí àdámọ́ ènìyàn, ìrònúpìwàdà àti ìtọrọ àforíjìn ní ọ̀dọ̀ Allāhu ni ọ̀nà àbáyọ lórí rẹ̀. Aláforíjìn, Olùgba-ìrònúpìwàdà sì ni Allāhu.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"qāla innī ʿabdu al-lahi ātāniya al-kitāba wajaʿalanī nabiyyan ","translations":["He said","Indeed, I am","a slave","(of) Allah","He gave me","the Scripture","and made me","a Prophet","(30)"],"transliterationArr":["qāla","innī","ʿabdu","al-lahi","ātāniya","al-kitāba","wajaʿalanī","nabiyyan",null],"verseTiming":[[1,0,840],[2,840,2480],[3,2480,3180],[4,3180,4220],[5,4220,5600],[6,5600,6930],[7,6930,8330],[8,8330,10105]]}}