{"name":"19:72","price":"Lẹ́yìn náà, A máa gba àwọn tó bẹ̀rù (Allāhu) là. A sì máa fi àwọn alábósì sílẹ̀ sínú Iná lórí ìkúnlẹ̀.¹","arabic":"ثُمَّ نُنَجِّي ٱلَّذِينَ ٱتَّقَواْ وَّنَذَرُ ٱلظَّٰلِمِينَ فِيهَا جِثِيّٗا","category":["19 (Maryam)","Maryam","Surah Maryam","Chapter Maryam","Surah 19","Chapter 19","Mary","مَريَم"],"ayahNumber":2322,"juzNumber":16,"footnotes":"1. Ìgbàkígbà tí Allāhu - subhānahu wa ta‘ālā - bá lo ọ̀rọ̀ arọ́pò-orúkọ “ọ̀pọ̀” bíi “A” tàbí ọ̀rọ̀ arọ́pò afarajorúkọ bíi “Àwa” fún Ara Rẹ̀, yàtọ̀ sí pé ó jẹ́ àpọ́nlé fún Un, kì í ṣe pé Ẹni tó ń jẹ́ “Allāhu” pé méjì tàbí jù bẹ́ẹ̀ lọ. Ọ̀rọ̀ arọ́pò-orúkọ tàbí ọ̀rọ̀ arọ́pò afarajorúkọ “ọ̀pọ̀” náà ń dúró fún iṣẹ́ kan nínú àwọn iṣẹ́ tí Allāhu máa ń dá ṣe pẹ̀lú gbólóhùn “Jẹ́ bẹ́ẹ̀, kí ó sì jẹ́ bẹ́ẹ̀” tàbí iṣẹ́ kan nínú àwọn iṣẹ́ tí Allāhu máa yan àwọn mọlāika Rẹ̀ láti ṣe. Ní ti āyah 68 àti 69, àwọn mọlāika ni Allāhu máa pàṣẹ iṣẹ́ wọ̀nyẹn fún lọ́jọ́ Àjíǹde. Àwọn mọlāika náà sì ni ẹ̀ṣọ́ Iná. Èyí wà ní ìbámu sí sūrah at-Tahrim; 66:6 àti sūrah al-Mudaththir; 74:30-31. \n Bákan náà, kalmọh “wārid” tó jẹyọ nínú āyah 71 jẹ́ ọ̀rọ̀-orúkọ tí wọ́n ṣẹ̀dá láti ara ọ̀rọ̀-ìṣe “warada”. Nínú al-Ƙur’ān, a lè rí ìtúmọ̀ méjì tó súnmọ́ ara wọn, àmọ́ tó tún ń dúró fún ọ̀rọ̀ àti ìdàkejì rẹ̀ fún “warada”. “Warada” túmọ̀ sí “ó dé sí ibi tí kiní kan wà, ó sì wọ inú n̄ǹkan náà”, gẹ́gẹ́ bí ìtúmọ̀ yìí ṣe wà nínú sūrah Hūd; 11:98 àti sūrah al-’Anbiyā’; 21:98-100. “Warada” tún túmọ̀ sí “ó dé sí ibi tí kiní kan wà, àmọ́ kò wọ inú n̄ǹkan náà”, gẹ́gẹ́ bí ìtúmọ̀ yìí ṣe wà nínú sūrah al-Ƙọsọs; 28:23. \n Ìtúmọ̀ méjèèjì wọ̀nyí ti fi hàn kedere pé kò sí ẹ̀dá tí kò níí dé ibi tí Iná wà lọ́jọ́ Àjíǹde. Àmọ́ àwọn kan máa “débẹ̀ wọbẹ̀”, àwọn kan sì máa “débẹ̀ láì wọbẹ̀”. Ìdí tí gbogbo ẹ̀dá máa fi dé ibi tí Iná wà ni pé, ojú ọ̀nà tí a máa tọ̀ dé ibi tí Ọgbà Ìdẹ̀ra wà ni Iná wà. Ìsàlẹ̀ lọ́wọ́ iwájú Ọgbà Ìdẹ̀ra ni Allāhu fi àyè Iná sí. Kódà, ọ̀nà tí a máa tọ̀ wọ inú Ọgbà Ìdẹ̀ra sì jẹ́ afárá tín-ínrín yíyọ̀ lórí Iná. Igun mẹ́ta sì ni àwọn ènìyàn àti àlùjọ̀nnú máa pín sí lórí ìrìn wọn lórí afárá Iná. \n Igun kìíní ni àwọn Ànábì, àwọn Òjíṣẹ́ Ọlọ́hun - kí ìkẹ́ Allāhu máa bá wọn - àti àwọn kan nínú àwọn onígbàgbọ́ òdodo, tó máa rìn lórí afárá Iná láì níí jábọ́ sínú Iná títí wọ́n fi máa gúnlẹ̀ sínú ilé ìgbàlà wọn, Ọgbà Ìdẹ̀ra. - Kí Allāhu fi àánú Rẹ̀ ta wá lọ́rẹ àrìnyè náà. - Igun yìí ni Allāhu ti ṣe àforíjìn fún pátápátá lórí àṣìṣe wọn. Ṣebí kò sí bí a ó ṣe rìn tí orí wa kò níí mì lọ̀rọ̀ ẹ̀dá nílé ayé. Allāhu sì ni Aláforíjìn ẹ̀dá. Igun kìíní yìí ni Allāhu - subhānahu wa ta‘ālā - ń sọ nípa wọn nínú sūrah al-’Anbiyā’; 21:101-102 àti sūrah az-Zumọr; 39:61. \n Igun kejì ni àwọn kan nínú àwọn onígbàgbọ́ òdodo, tó máa rìn lórí afárá Iná ní àrìnjábọ́ sínú Iná. Igun yìí ni wọ́n ní àwọn àṣìṣe kan lọ́rùn, àmọ́ tí Allāhu kò forí rẹ̀ jìn wọ́n. Sebí Allāhu - subhānahu wa ta‘ālā - kúkú ti sọ pé kí ẹni tí ó bá ń dá ẹ̀ṣẹ̀, tí kò tọrọ àforíjìn tàbí ronú pìwàdà lórí rẹ̀ títí ó fi kú má ṣe fọkàn balẹ̀ pé Òun kúkú máa forí rẹ̀ jìn ín. Tí Allāhu bá fẹ́, Ó máa forí rẹ̀ jìn ín. Tí Ó bá sì fẹ́, Ó máa fìyà ẹṣẹ̀ rẹ̀ jẹ ẹ́. Èyí wà ní ìbámu sí sūrah an-Nisā’; 4:116. Igun kejì yìí ló máa padà jáde kúrò nínú Iná lásìkò tí Allāhu - subhānahu wa ta‘ālā - bá fẹ́, yálà nípasẹ̀ ìṣìpẹ̀ Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - tàbí nípasẹ̀ àánú àti ìkẹ́ kan láti ọ̀dọ̀ Allāhu - subhānahu wa ta’ālā -. \n Igun kẹta ni igun gbogbo ẹni tí ó kú sórí àìgbàgbọ́ tàbí ìṣẹbọ tàbí ìṣojúméjì pẹ̀lú Allāhu - subhānahu wa ta‘ālā -. Igun kẹta yìí náà máa rìn lórí afárá Iná ní àrìnjábọ́, àmọ́ wọn kò níí jáde kúrò nínú rẹ̀ títí láéláé nítorí pé, Allāhu - subhānahu wa ta‘ālā - kò níí ṣíjú àánú wò wọ́n rárá.\n Nítorí náà, tí ẹnì kan bá sọ pé kò níí sí igun kan kan tí Iná kò níí jó nítorí gbólóhùn “wa ’in minkum ’illā wāriduhā”, ẹni náà ti sọ̀rọ̀ àìmọ̀kan tó gbópọn lẹnu nítorí pé, ó ti fi ìtúmọ̀ “warada” mọ sórí “ó débẹ̀ wọbẹ̀” nìkan, ó sì kọ̀yìn sí ìtúmọ̀ “warada” tó túmọ̀ sí “ó débẹ̀ kò wọbẹ̀”. \n Bẹ́ẹ̀ náà ni ẹni tí ó bá sọ pé kò sí igun kan kan tí ó máa padà jáde kúrò nínú Iná. Kò sí ẹni tí ó máa sọ bẹ́ẹ̀ bí kò ṣe aláìgbàgbọ́ nínú ọ̀rọ̀ Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a -. Bákan náà, tí ẹnì kan bá sọ pé kò níí sí igun kan kan tí ó máa wà nínú Iná gbére, irú ẹni náà ti sọ ọ̀rọ̀ tí ó lòdì sí ọ̀pọ̀lọ́pọ̀ āyah tó ń fi Iná gbere rinlẹ̀ fún àwọn aláìgbàgbọ́. Irú ẹni náà súnmọ́ kó jẹ́ ẹlẹ́sìn Ahmadiyyah. \n Lẹ́yìn náà, yálà igun tí ó máa rin àrìnyè lórí afárá Iná tàbí igun tí ó máa rin àrìnjábọ́ sínú Inȧ, igun kìíní kejì máa wá lábẹ́ àkórìn àwọn mọlāika kan ni. Ìyẹn ni pé, àwọn mọlāika kan ló máa kó gbogbo ẹ̀dá lọ sórí afárá Iná nítorí pé, kò sí ẹ̀dá kan tó máa fẹ́ fínnú fíndọ̀ gba orí afárá Iná kọjá. Dándan sì ni fún gbogbo wọn láti gba orí rẹ̀ kọjá bọ́ sí àyè wọn. Àwọn mọlāika wọ̀nyẹn ni àwọn mọlāika agbèrò Ọgbà Ìdẹ̀ra àti àwọn mọlāika agbèrò Iná. Èyí ni Allāhu - subhānahu wa ta’ālā - tún fi rinlẹ̀ nínú sūrah az-Zumọr; 39:71-73.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"thumma nunajjī alladhīna ittaqaw wanadharu al-ẓālimīna fīhā jithiyyan ","translations":["Then","We will deliver","those who","feared (Allah)","and We will leave","the wrongdoers","therein","bent (on) knees","(72)"],"transliterationArr":["thumma","nunajjī","alladhīna","ittaqaw","wanadharu","al-ẓālimīna","fīhā","jithiyyan",null],"verseTiming":[[1,0,1170],[2,1170,2080],[3,2080,3140],[4,3140,4130],[5,4130,5010],[6,5010,6660],[7,6660,7660],[8,7660,8955]]}}