{"name":"20:50","price":"(Ànábì Mūsā) sọ pé: “Olúwa wa ni Ẹni tí Ó fún gbogbo n̄ǹkan ní ìṣẹ̀dá rẹ̀.¹ Lẹ́yìn náà, Ó tọ́ ọ sí ọ̀nà.”","arabic":"قَالَ رَبُّنَا ٱلَّذِيٓ أَعۡطَىٰ كُلَّ شَيۡءٍ خَلۡقَهُۥ ثُمَّ هَدَىٰ","category":["20 (Ta-Ha)","Ta-Ha","Surah Ta-Ha","Chapter Ta-Ha","Ha","Surah Ha","Chapter Ha","Ta Ha","Surah Ta Ha","Chapter Ta Ha","Surah 20","Chapter 20","Ta-Ha","طه"],"ayahNumber":2398,"juzNumber":16,"footnotes":"1. Ìyẹn ni pé, Allāhu Ẹlẹ́dàá ṣẹ̀dá ẹ̀dá kọ̀ọ̀kan pẹ̀lú àwòrán àti àdámọ́ tó máa ṣe wẹ́kú jíjẹ́ ẹ̀dá rẹ̀, tí ó sì máa yà á sọ́tọ̀ láààrin àwọn ẹ̀dá mìíràn. Nítorí náà, ènìyàn ń jẹ́ ènìyàn lórí àwòrán àti àdámọ́ tó ṣe wẹ́kú ènìyàn, àlùjànnú ń jẹ́ àlùjànnú lórí àwòrán àti àdámọ́ tó ṣe wẹ́kú àlùjànnú, mọlāika ń jẹ́ mọlāika lórí àwòrán àti àdámọ́ tó ṣe wẹ́kú mọlāika, ẹranko ń jẹ́ ẹranko lórí àwòrán àti àdámọ́ tó ṣe wẹ́kú ẹranko, kòkòrò ń jẹ́ kòkòrò lórí àwòrán àti àdámọ́ tó ṣe wẹ́kú kòkòrò, sánmọ̀ ń jẹ́ sánmọ̀ lórí àwòrán àti àdámọ́ tó ṣe wẹ́kú sánmọ̀, ilẹ̀ ń jẹ́ ilẹ̀ lórí àwòrán àti àdámọ́ tó ṣe wẹ́kú ilẹ̀ àti bẹ́ẹ̀ bẹ́ẹ̀ lọ. \n Bákan náà, ènìyàn jọra wọn, àmọ́ ènìyàn kò jọ ẹ̀dá mìíràn. Àlùjànnú jọra wọn, àmọ́ àlùjànnú kò jọ ẹ̀dá mìíràn àti bẹ́ẹ̀ bẹ́ẹ̀ lọ. Lẹ́yìn náà, Allāhu Afinimọ̀nà tọ́ ẹ̀dá kọ̀ọ̀kan sọ́nà lórí ọ̀nà tí ó máa gbà lo ẹ̀yà ara rẹ̀. Tí ẹnì kan bá wá sọ pé Allāhu dá ènìyàn lórí àwòrán Ara Rẹ̀, ó ti sọ ìsọkúsọ. Ẹnì kan kò sì níí sọ bẹ́ẹ̀ àfi aláìgbàgbọ́ nínú pàápàá bíbẹ Allāhu èyí tí kò jọ ìṣẹ̀dá ẹ̀dá kan kan.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"qāla rabbunā alladhī aʿṭā kulla shayin khalqahu thumma hadā ","translations":["He said","Our Lord","(is) the One Who","gave","(to) every","thing","its form","then","He guided (it)","(50)"],"transliterationArr":["qāla","rabbunā","alladhī","aʿṭā","kulla","shayin","khalqahu","thumma","hadā",null],"verseTiming":[[1,0,750],[2,750,1550],[3,1550,3620],[4,3620,4480],[5,4480,5100],[6,5100,6000],[7,6000,7090],[8,7090,8450],[9,8450,9255]]}}