{"name":"21:30","price":"Ṣé àwọn tó ṣàì gbàgbọ́ kò wòye pé dájúdájú àwọn sánmọ̀ lẹ̀pọ̀ àti ilẹ̀ náà lẹ̀pọ̀ tẹ́lẹ̀ ni, A sì yà wọ́n sí ọ̀tọ̀ọ̀tọ̀, A sì ṣe gbogbo n̄ǹkan ní abẹ̀mí láti inú omi? Nítorí náà, ṣé wọn kò níí gbàgbọ́ ni?¹","arabic":"أَوَلَمۡ يَرَ ٱلَّذِينَ كَفَرُوٓاْ أَنَّ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ كَانَتَا رَتۡقٗا فَفَتَقۡنَٰهُمَاۖ وَجَعَلۡنَا مِنَ ٱلۡمَآءِ كُلَّ شَيۡءٍ حَيٍّۚ أَفَلَا يُؤۡمِنُونَ","category":["21 (Al-Anbiya)","Al-Anbiya","Surah Al-Anbiya","Chapter Al-Anbiya","Anbiya","Surah Anbiya","Chapter Anbiya","Al Anbiya","Surah Al Anbiya","Chapter Al Anbiya","Surah 21","Chapter 21","The Prophets","الأنبيَاء"],"ayahNumber":2513,"juzNumber":17,"footnotes":"1. Àwọn nasọ̄rọ̄ sọ pé, sūrah Fussilat; 41:11 tako sūrah al-’Anbiyā’; 21:30. \n Èsì: Kò sí ìtakora kan kan nínú āyah méjèèjì. Àlàyé rẹ̀ nìyí, ìtúmọ̀ “rọtƙ” ni “ìlẹ̀pọ̀, lílẹ̀-papọ̀”, ìtúmọ̀ “fatƙ” sì ni “ẹ̀là, lílà, yíyà”. Ní ìpìlẹ̀ ìṣẹ̀dá sánmọ̀ àti ilẹ̀, Allāhu - tó ga jùlọ - kò fi ojú kan kan sára ìkíní kejì tí n̄ǹkan kan lè gba jáde síta. Lẹ́yìn náà, Allāhu la ojú sánmọ̀ nítorí kí omi òjò lè máa tinú rẹ̀ jáde sí orí ilẹ̀. Allāhu sì tún la ojú ilẹ̀ nítorí kí irúgbìn lè máa tinú rẹ̀ jáde. Tí Allāhu kò bá ṣe èyí fún ìkíní kejì ni, òjò ìbá tí rí ọ̀nà jáde nínú sánmọ̀, irúgbìn ilẹ̀ náà ìbá tí rí ọ̀nà hù jáde nínú ilẹ̀. Ìdí nìyí tí gbólóhùn “A sì ṣe gbogbo n̄ǹkan ní abẹ̀mí láti ara omi” fi parí āyah yẹn. Kíyè sí i, kalmọh ìlẹ̀pọ̀ tí Allāhu lò fún sánmọ̀ àti ilẹ̀, kò túmọ̀ sí pé sánmọ̀ àti ilẹ̀ ló lẹ̀ papọ̀ mọ́ra wọn, bí ó tilẹ̀ jẹ́ pé àwọn kan wí bẹ́ẹ̀. Ọ̀tọ̀ọ̀tọ̀ ni ìkíní kejì wà. Ìdí sì nìyí tí ó fi jẹ́ pé, ìkíní kejì wọn ni Allāhu pa àṣẹ fún láti máa mú ohun tí ó wà nínú wọn jáde. Èyí sì ni ó mú ọ̀rọ̀-ìṣe àṣẹ wá ní “èjì”, dípò “ẹyọ”, fún sánmọ̀ àti ilẹ̀ nítorí pé, ọ̀tọ̀ọ̀tọ̀ ni ìkíní kejì wọn wà láti ìbẹ̀rẹ̀ pẹ̀pẹ̀ ìṣẹ̀dá wọn. Èyí sì ló jẹyọ nínú sūrah Fussilat; 41:11. Nítorí náà, kò sí ìtakora nínú àwọn āyah náà. W-Allāhu ’a‘lam.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"awalam yara alladhīna kafarū anna al-samāwāti wal-arḍa kānatā ratqan fafataqnāhumā wajaʿalnā mina al-māi kulla shayin ḥayyin afalā yu'minūna ","translations":["Do not","see","those who","disbelieved","that","the heavens","and the earth","were","a joined entity","then We parted them","and We made","from","[the] water","every","living thing","living thing","Then will not","they believe","(30)"],"transliterationArr":["awalam","yara","alladhīna","kafarū","anna","al-samāwāti","wal-arḍa","kānatā","ratqan","fafataqnāhumā","wajaʿalnā","mina","al-māi","kulla","shayin","ḥayyin","afalā","yu'minūna",null],"verseTiming":[[1,0,900],[2,900,1250],[3,1250,2230],[4,2230,4380],[5,4380,5310],[6,5310,6870],[7,6870,7870],[8,7870,8760],[9,8760,9970],[10,9970,12130],[11,12130,14050],[12,14050,14350],[13,14350,17110],[14,17110,17660],[15,17660,18510],[16,18510,19320],[17,19320,20110],[18,20110,22725]]}}