{"name":"21:48","price":"Dájúdájú A fún (Ànábì) Mūsā àti (Ànábì) Hārūn ní ọ̀rọ̀-ìpínyà (ohun tó ń ṣòpínyà láààrin òdodo àti irọ́), ìmọ́lẹ̀ àti ìrántí fún àwọn olùbẹ̀rù (Allāhu).¹","arabic":"وَلَقَدۡ ءَاتَيۡنَا مُوسَىٰ وَهَٰرُونَ ٱلۡفُرۡقَانَ وَضِيَآءٗ وَذِكۡرٗا لِّلۡمُتَّقِينَ","category":["21 (Al-Anbiya)","Al-Anbiya","Surah Al-Anbiya","Chapter Al-Anbiya","Anbiya","Surah Anbiya","Chapter Anbiya","Al Anbiya","Surah Al Anbiya","Chapter Al Anbiya","Surah 21","Chapter 21","The Prophets","الأنبيَاء"],"ayahNumber":2531,"juzNumber":17,"footnotes":"1. Ọ̀rọ̀-ìpínyà, ìmọ́lẹ̀ àti ìrántí nínú āyah yìí dúró fún àwọn ìròyìn tó wà lára tírà kan ṣoṣo tí Allāhu - tó ga jùlọ - fún Ànábì Mūsā - kí ọlà Allāhu máa bá a -. Tírà náà ni at-Taorāt. Lẹ́yìn náà, ìwọ̀nyẹn ni àwọn ìròyìn tó máa ń wà lára ìkọ̀ọ̀kan tírà tí Allāhu máa ń sọ̀kalẹ̀ fún àwọn Ànábì Rẹ̀ àti àwọn Òjíṣẹ́ Rẹ̀ - kí ọlà Allāhu máa bá wọn -. \n Kíyè sí i, gbogbo tírà tó ṣíwájú ti parí iṣẹ́ wọn. Ní àsìkò yìí, tírà ìkẹ́yìn nìkan ló ku gbogbo ayé kù. Ìyẹn sì ni al-Ƙur’ān alápọ̀n-ọ́nlé. Kódà bí Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - bá padà sọ̀kalẹ̀ lópin ayé, kò níí tẹ̀lé tírà kan yàtọ̀ sí al-Ƙur’ān gẹ́gẹ́ bí mo ti sọ ṣíwájú nínú ìtọsẹ̀-ọ̀rọ̀ āyah 8.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"walaqad ātaynā mūsā wahārūna al-fur'qāna waḍiyāan wadhik'ran lil'muttaqīna ","translations":["And verily","We gave","Musa","and Harun","the Criterion","and a light","and a Reminder","for the righteous","(48)"],"transliterationArr":["walaqad","ātaynā","mūsā","wahārūna","al-fur'qāna","waḍiyāan","wadhik'ran","lil'muttaqīna",null],"verseTiming":[[1,0,840],[2,840,2100],[3,2100,2840],[4,2840,4040],[5,4040,5400],[6,5400,7810],[7,7810,8730],[8,8730,12745]]}}