{"name":"21:8","price":"A kò sì ṣe wọ́n ní abara tí kì í jẹun. Wọn kò sì jẹ́ olùṣegbére (nílé ayé).¹","arabic":"وَمَا جَعَلۡنَٰهُمۡ جَسَدٗا لَّا يَأۡكُلُونَ ٱلطَّعَامَ وَمَا كَانُواْ خَٰلِدِينَ","category":["21 (Al-Anbiya)","Al-Anbiya","Surah Al-Anbiya","Chapter Al-Anbiya","Anbiya","Surah Anbiya","Chapter Anbiya","Al Anbiya","Surah Al Anbiya","Chapter Al Anbiya","Surah 21","Chapter 21","The Prophets","الأنبيَاء"],"ayahNumber":2491,"juzNumber":17,"footnotes":"1. Àwọn tó gbàgbọ́ pé Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - ti kú sọ pé, “Āyah yìí àti āyah 34 níwájú tako àì tí ì kú Ànábì ‘Īsā títí di àkókò yìí àti títí di àkókò òpin ayé. Nítorí náà, Ànábì ‘Īsā - kí ọlà Allāhu máa bá a - ti kú”. \n Èsì: Kíyè sí i! Gbígbé tí Allāhu gbé Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - lọ sínú sánmọ̀ kò túmọ̀ sí pé Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - kò níí kú. Rárá o, ó máa kú lẹ́yìn ìgbà tí Allāhu - tó ga jùlọ - bá sọ̀ ọ́ kalẹ̀ láti ojú sánmọ̀ nítorí pé, abara ni, kì í ṣe ọlọ́hun. Allāhu, Ọlọ́hun nìkan ni kò níí kú láéláé. Yàtọ̀ sí āyah “ƙọbla maotih” nínú sūrah an-Nisā’; 4:159, àwọn hadīth Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - ti fi rinlẹ̀ pé, ikú Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - di ẹ̀yìn ìgbà tí ó bá tó sọ̀kalẹ̀ láti ojú sánmọ̀, ìyẹn ní òpin ayé. Ohun tí ó kàn jẹ́ ìṣòro fún àwọn tí wọ́n gbàgbọ́ pé Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - ti kú ṣíwájú àsìkò yìí ni pé, bí wọ́n bá sọ pé kò sí āyah tààrà kan lórí àìtíìkú rẹ̀ àti ìsọ̀kalẹ̀ rẹ̀ láti ojú sánmọ̀ lópin ayé, kò sí ìmọ̀ tó yè kooro fún wọn lórí ìmọ̀ ìjìnlẹ̀ nípa àwọn hadīth Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a -. Nítorí pé, tí ó bá jẹ́ pé wọ́n ní ẹ̀kọ́ tó yè kooro lórí ìmọ̀ ìjìnlẹ̀ nípa àwọn hadīth Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a -, wọn ìbá mọ̀ pé dájúdájú hadīth Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - ní òmìnira láti sọ ọ̀rọ̀ tí kò sí nínú al-Ƙur’ān alápọ̀n-ọ́nlé. Ní òdíwọ̀n ìgbà tí hadīth bẹ́ẹ̀ bá sì ti fẹsẹ̀ rinlẹ̀ lọ́dọ̀ àwọn onímọ̀ ìjìnlẹ̀ nípa hadīth, ẹnu aláìmọ̀kan tàbí aláààbọ̀ ẹ̀kọ́ kan kan kò gbà á láti tako irúfẹ́ àwọn hadīth náà. Bí ó bá dán an wò pẹ̀rẹ̀, ìgbàgbọ́ rẹ̀ nínú al-Ƙur’ān àti ìgbàgbọ́ rẹ̀ nínú Ànábì wa Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - ti bàjẹ́ mọ́ ọn lọ́wọ́. Èyí wà ní ìbámu sí sūrah an-Nisā’; 4: 115. \n Bí àpẹ̀ẹrẹ, al-Ƙur’ān fi rinlẹ̀ pé, àwọn òkú kò lè gbọ́ ọ̀rọ̀ kan kan mọ́ láti ọ̀dọ̀ àwọn alààyè ní ìbámu sí sūrah an-Naml; 27:80, sūrah ar-Rūm; 30:52 àti sūrah Fātir; 35:22. Ànábì wa Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - sì padà di òkú tí wọ́n bò mọ́ inú sàréè nínú ìlú Mọdīnah Onímọ̀ọ́lẹ̀ ní ìbámu sí sūrah az-Zumọr; 39:30. Kò sì sí āyah tààrà kan nínú al-Ƙur’ān tí ó yọ Ànábì wa Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - sílẹ̀ nínú àwọn òkú tí kò lè gbọ́ ọ̀rọ̀ kan kan mọ́ láti ọ̀dọ̀ àwọn alààyè. Àmọ́ hadīth tó fẹsẹ̀ rinlẹ̀ wà tí ó ń fi rinlẹ̀ pé, Ànábì wa Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - máa ń dá sálámọ̀ padà fún ẹnikẹ́ni tí ó bá sálámọ̀ sí i nídìí sàréè rẹ̀. Kódà hadīth tó fẹsẹ̀ rinlẹ̀ tún wà tí ó ń fi rinlẹ̀ pé, ní gbogbo ọjọ́ Jímọ̀, àwọn mọlāika ń gbé ìtọrọ-ìkẹ́ àti ìtọrọ-ìbùkún fún Ànábì wa Muhammad sí etí ìgbọ́ rẹ̀ nínú sàréè rẹ̀ láti ibikíbi nílé ayé tí wọ́n bá ti ń tọrọ rẹ̀ fún un - kí ìkẹ́ àti ọlà Allāhu máa bá a -. \n Hadīth kìíní: Láti ọ̀dọ̀ Abū Huraerah - kí Allāhu yọ́nú sí i -, dájúdájú Òjíṣẹ́ Allāhu - kí ìkẹ́ àti ọlà Allāhu máa bá a - sọ pé, “Kò sí ẹnì kan tí ó máa sálámọ̀ sí mi àfi kí Allāhu dá ẹ̀mí mi padà sí mi lára títí mo máa fi dá sálámọ̀ náà padà fún un.” Abū Dāūd ló gbà á wá lábẹ́ àkọlé: bāb ziyāratul-ƙubūr. Ṣeek al-Bāniy sọ pé, “hadīth náà dára”. Hadīth yìí tún wà nínú musnad ’Ahmad àti sunan Baehaƙiy.\n Hadīth kejì: Láti ọ̀dọ̀ ’Aos ọmọ ’Aos - kí Allāhu yọ́nú sí i -, ó sọ pé, Òjíṣẹ́ Allāhu - kí ìkẹ́ àti ọlà Allāhu máa bá a - sọ pé, “Dájúdájú ọjọ́ Jum‘ah wà nínú àwọn ọjọ́ yín tó lóore jùlọ; Wọ́n ṣẹ̀dá Ànábì Ādam - kí ọlà Allāhu máa bá a - nínú rẹ̀, Wọ́n gba ẹ̀mí rẹ̀ nínú rẹ̀, ìfọn àkọ́kọ́ sínú ìwo máa ṣẹlẹ̀ nínú rẹ̀. Ikú gbogbo ẹ̀dá sì máa ṣẹlẹ̀ nínú rẹ̀. Nítorí náà, ẹ ṣe ọ̀pọ̀lọ́pọ̀ asọlātu fún mi nínú rẹ̀ nítorí pé, wọ́n máa ṣẹ́rí àwọn asọlātu yín sí ọ̀dọ̀ mi.” ’Aos sọ pé, àwọn Sọhābah wí pé, “Òjíṣẹ́ Allāhu, báwo ni wọ́n ṣe máa kó àwọn asọlātu wa wá bá ọ, ó ó má ti di erùpẹ̀!?” Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - sì sọ pé: “Dájúdájú Allāhu - tó ga jùlọ - ṣe ẹran ara àwọn Ànábì ní èèwọ̀ fún ilẹ̀.” Abū Dāūd ló gbà á wá lábẹ́ àkọlé: bāb fọdli yaomil-Jum‘ah walaelatil-Jum‘ah. Ṣeek al-Bāniy sọ pé, “hadīth náà ní àlàáfíà”. Hadīth yìí tún wà nínú musnad ’Ahmad àti sunan Baehaƙiy.\n Àpẹ̀ẹrẹ mìíràn ni àwọn hadīth tààrà tó fẹsẹ̀ rinlẹ̀ lórí ènìyàn hóró kan ṣoṣo tí Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - pè ní “Mọsīhu-ddajjāl”. Ẹni yìí má yọjú sáyé lópin ayé. Ó sì máa fòòró ayé ní ìfòòró kan tí kò tí ì ṣẹlẹ̀ rí. Àmọ́ tòhun ti bí “Mọsīhu-ddajjāl” ṣe jẹ́ ẹyọ kan nínú àwọn àmì ńlá fún òpin ayé, kò sí āyah kan tààrà lórí rẹ̀ nínú al-Ƙur’ān. Ànábì wa Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - nìkan ló jẹ́ kí á mọ̀ pé ènìyàn kan ń bọ̀ lópin ayé tí orúkọ rẹ̀ ń jẹ́ Mọsīhu-ddajjāl. \n Èyí sì ni ìgbàgbọ́ àti àdìsọ́kàn àwa mùsùlùmí, tòhun ti bí kò ṣe sí āyah tó gbè é lẹ́sẹ̀ tààrà nínú al-Ƙur’ān. Nígbà tí gbogbo àwa mùsùlùmí ní ìgbàgbọ́ nínú àwọn irúfẹ́ àwọn hadīth òkè wọ̀nyẹn, ní ìṣẹ̀lẹ̀ tó tayọ òye wa, àmọ́ tí ó tẹnu Ànábì wa Muhammad olódodo - kí ìkẹ́ àti ọlà Allāhu máa bá a - jáde, nígbà náà ta ni ẹni tí ó máa lórí láyà tako àwọn hadīth Bukọ̄riy àti hadith Muslim tó wá lórí àì tí ì kú Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - títí di àkókò yìí àti títí di àkókò òpin ayé? Ẹnikẹ́ni tí ó bá takò ó ti tako Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a -. Ọ̀kan nìyí nínú àwọn hadīth náà.\n Láti ọ̀dọ̀ Abū Huraerah - kí Allāhu yọ́nú sí i -, dájúdájú Òjíṣẹ́ Allāhu - kí ìkẹ́ àti ọlà Allāhu máa bá a - sọ pé: “Báwo ni ẹ̀yin máa wà nígbà tí Ọmọ Mọryam - kí ọlà Allāhu máa bá a - bá sọ̀kalẹ̀ sáààrin yín, tí ó sì darí yín pẹ̀lú ohun tí ń bẹ lọ́dọ̀ yín.” Ẹnì kan nínú àwọn tó gba hadīth yìí wá sọ pé, “Kí ni ìtúmọ̀ “tí ó sì darí yín pẹ̀lú ohun tí ń bẹ lọ́dọ̀ yín”? Tàbí kí ni ìtúmọ̀ “tí ohun tí ó máa fi darí yín sì máa wá láti ọ̀dọ̀ yín?” Ibnu Abī Thi’b sì fèsì pé, “Ó máa fi tírà Olúwa yín àti sunnah Ànábì yín - kí ìkẹ́ àti ọlà Allāhu máa bá a - darí yín.” ni ìtúmọ̀ rẹ̀. Ìyẹn ni pé, al-Ƙur’ān àti sunnah Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - ni “imām” dúró fún nínú hadīth yìí, gẹ́gẹ́ bí “imām” ṣé dúró fún “tírà” nínú sūrah Hūd; 11:17, sūrah al-’Ahƙọ̄f; 46:12 àti sūrah Yāsīn, 36:12. Bí a bá sì túmọ̀ imām sí aṣíwájú lórí ìrun àti aláṣẹ, òhun náà wọlé nítorí pé, hadīth mìíràn gbà á wá pẹ̀lú ìtúmọ̀ yẹn. Ìtúmọ̀ kìíní kejì ló ń já sí pé, ìjọ yìí kò ní Ànábì méjì, kò sì ní tírà méjì. Nítorí náà, ipò ọmọ-ẹ̀yìn ni ipò Ànábì ‘Isā - kí ọlà Allāhu máa bá a - nínú ìjọ yìí ní òpin ayé.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"wamā jaʿalnāhum jasadan lā yakulūna al-ṭaʿāma wamā kānū khālidīna ","translations":["And not","We made them","bodies","not","eating","the food","and not","they were","immortals","(8)"],"transliterationArr":["wamā","jaʿalnāhum","jasadan","lā","yakulūna","al-ṭaʿāma","wamā","kānū","khālidīna",null],"verseTiming":[[1,0,660],[2,660,2120],[3,2120,2760],[4,2760,3390],[5,3390,4520],[6,4520,5630],[7,5630,6260],[8,6260,7060],[9,7060,9655]]}}