{"name":"21:91","price":"(Ẹ rántí obìnrin) èyí tí ó ṣọ́ abẹ́ rẹ̀. A sì fẹ́ atẹ́gùn nínú àwọn atẹ́gùn ẹ̀mí tí A dá sí i lára. A sì ṣe òun àti ọmọkùnrin rẹ̀ ní àmì fún gbogbo ẹ̀dá.¹","arabic":"وَٱلَّتِيٓ أَحۡصَنَتۡ فَرۡجَهَا فَنَفَخۡنَا فِيهَا مِن رُّوحِنَا وَجَعَلۡنَٰهَا وَٱبۡنَهَآ ءَايَةٗ لِّلۡعَٰلَمِينَ","category":["21 (Al-Anbiya)","Al-Anbiya","Surah Al-Anbiya","Chapter Al-Anbiya","Anbiya","Surah Anbiya","Chapter Anbiya","Al Anbiya","Surah Al Anbiya","Chapter Al Anbiya","Surah 21","Chapter 21","The Prophets","الأنبيَاء"],"ayahNumber":2574,"juzNumber":17,"footnotes":"1. Kíyè sí i! Ṣíṣe tí Allāhu - Ọba tó ga jùlọ - ṣe Mọryam àti ọmọ rẹ̀, Ànábì ‘Īsā - kí ọlà Allāhu máa bá a - ní àmì fún gbogbo ẹ̀dá, kò túmọ̀ sí pé ìkíní kejì wọn jẹ́ olúwa àti olùgbàlà. Àmọ́ kí ẹ̀dá lè wòye sí agbára Allāhu pé, Ó máa ń ṣe ọ̀rọ̀ ẹ̀dá bí Ó bá ṣe fẹ́. Tí ẹnì kan bá wá tìtorí ìyẹn sọ ẹ̀dá kan di olúwa àti olùgbàlà lẹ́yìn Allāhu, Ọba Oníṣẹ́-ìyanu, onítọ̀ún ti sọnù jìnnà. Bákan náà, ẹ tún wo irú gbólóhùn yìí “àmì fún gbogbo ẹ̀dá” nínú sūrah al-’Ankabūt; 29:15.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"wa-allatī aḥṣanat farjahā fanafakhnā fīhā min rūḥinā wajaʿalnāhā wa-ib'nahā āyatan lil'ʿālamīna ","translations":["And she who","guarded","her chastity","so We breathed","into her","of","Our Spirit","and We made her","and her son","a sign","for the worlds","(91)"],"transliterationArr":["wa-allatī","aḥṣanat","farjahā","fanafakhnā","fīhā","min","rūḥinā","wajaʿalnāhā","wa-ib'nahā","āyatan","lil'ʿālamīna",null],"verseTiming":[[1,0,2430],[2,2430,3460],[3,3460,4360],[4,4360,5440],[5,5440,6520],[6,6520,6730],[7,6730,7930],[8,7930,9640],[9,9640,11600],[10,11600,13000],[11,13000,14900],[12,14900,18785]]}}