{"name":"22:47","price":"Wọ́n sì ń kán ọ lójú fún ìyà náà. Allāhu kò sì níí yapa àdéhùn Rẹ̀. Dájúdájú ọjọ́ kan lọ́dọ̀ Olúwa rẹ dà bí ẹgbẹ̀rún ọdún nínú ohun tí ẹ̀ ń kà (ní òǹkà).¹","arabic":"وَيَسۡتَعۡجِلُونَكَ بِٱلۡعَذَابِ وَلَن يُخۡلِفَ ٱللَّهُ وَعۡدَهُۥۚ وَإِنَّ يَوۡمًا عِندَ رَبِّكَ كَأَلۡفِ سَنَةٖ مِّمَّا تَعُدُّونَ","category":["22 (Al-Hajj)","Al-Hajj","Surah Al-Hajj","Chapter Al-Hajj","Hajj","Surah Hajj","Chapter Hajj","Al Hajj","Surah Al Hajj","Chapter Al Hajj","Surah 22","Chapter 22","The Pilgrimage","الحَجّ"],"ayahNumber":2642,"juzNumber":17,"footnotes":"1. Nínú āyah yìí, sūrah al-Hajj; 22:47 àti sūrah as-Sajdah; 32:5, ọjọ́ ẹyọ kan lọ́dọ̀ Allāhu - Ọba tó ga jùlọ - ni ẹgbẹ̀rún ọdún tiwa, àmọ́ nínú sūrah al-Mọ‘ārij; 70:4, ọjọ́ ẹyọ kan lọ́dọ̀ Allāhu ni ọ̀kẹ́ méjì ààbọ̀ (ẹgbẹ̀rún lọ́nà àádọ́ta) tiwa (50,000).\n Àwọn āyah mẹ́tẹ̀ẹ̀ta wọ̀nyẹn fẹ́ takora wọn lójú aláìnímọ̀ nípa ìṣe Allāhu - Ọba tó ga jùlọ -, àmọ́ kò sí ìtakora láààrin wọn ní ọ̀dọ̀ àwọn onímọ̀-ẹ̀sìn ’Islām. Ní ti āyah 47 nínú sūrah al-Hajj, Allāhu - Ọba tó ga jùlọ - ń sọ̀rọ̀ nípa ìdí tí ìyà kò fi tètè sọ̀kalẹ̀ lé àwọn aláìgbàgbọ́ lórí pé, tí Òun bá sọ fún wọn pé àárọ̀ ọ̀la ni ọjọ́ ìyà wọn (bí àpẹ̀ẹrẹ), ìyẹn dúró fún ẹgbẹ̀rún ọdún kan. Ní ti āyah 5 nínú sūrah as-Sajdah, Allāhu - Ọba tó ga jùlọ - ń sọ̀rọ̀ nípa ìsọ̀kalẹ̀ àti ìgùnkè àwọn mọlāika láààrin òkè sánmọ̀ keje àti ilẹ̀ keje ní ojoojúmọ pé, òǹkà ọdún tí ẹ̀dá mìíràn máa lò fún rírin ìrìn-àjò náà ní àlọbọ̀ máa jẹ́ ẹgbẹ̀rún ọdún tiwa (1,000). \n Àmọ́ ní ti āyah 4 nínú sūrah al-Mọ‘ārij, Allāhu fún ìrìn-àjò yìí kan náà ní òdíwọ̀n ọ̀kẹ́ méjì ààbọ̀ ọdún, dípò ẹgbẹ̀rún ọdún. Kíyè sí i, nínú āyah ọlọ́jọ́ kan tó dọ́gba sí ẹgbẹ̀rún ọdún, Allāhu fi gbólóhùn yìí parí rẹ̀ “nínú ohun tí ẹ̀ ń kà ní òǹkà” ìyẹn nílé ayé. Àmọ́ Allāhu kò fi gbólóhùn yẹn parí rẹ̀ nínú āyah ọlọ́jọ́ kan tó dọ́gba sí ọ̀kẹ́ méjì ààbọ̀ ọdún. Ìtúmọ̀ èyí ni pé, ọjọ́ ọlọ́kẹ̀ẹ́ méjì-ààbọ̀ ọdún yẹn = = máa dúró fún ọjọ́ kan lọ́jọ́ Àjíǹde lára àwọn aláìgbàgbọ́ nítorí kí wọ́n lè kan ìnira tí ẹ̀mí wọn kò níí gbé. \n Àwọn onímímọ̀ wulẹ̀ tún sọ pé, yálà ọjọ́ kan ẹlẹ́gbẹ̀rún ọdún tàbí ọjọ́ ọlọ́kẹ̀ẹ́ méjì ààbọ̀ ọdún, ìkíní kejì ló máa ṣẹlẹ̀ ní ọjọ́ Àjíǹde. Wọ́n ní, wàhálà ọjọ́ kan lọ́jọ́ Àjíǹde máa dọ́gba sí ẹgbẹ̀rún ọdún lára onígbàgbọ́ òdodo nítorí kí ìnira ọjọ́ náà máa baà pọ̀ jù lára wọn, nígbà tí wàhálà ọjọ́ kan lọ́jọ́ Àjíǹde máa dọ́gba sí ọ̀kẹ́ méjì-ààbọ̀ ọdún lára àwọn aláìgbàgbọ́ nítorí kí ìnira ọjọ́ náà lè tán wọn ní sùúrù. Èyí sì wà ní ìbámu sí sūrah al-Mudaththir; 74: 8-10.\n Síwájú sí i, bí ọjọ́ kan ní ọ̀dọ̀ Allāhu ṣe lè jẹ́ ẹgbẹ̀rún ọdún kan, ó tún lè jẹ́ ọ̀kẹ́ méjì ààbọ̀ ọdún, yálà nílé yìí tàbí lọ́jọ́ Àjíǹde, tí Allāhu bá fẹ́ bẹ́ẹ̀. \n Ní àkọ́kọ́ ná, “Allāhu l’Ó ń díwọ̀n òru àti ọ̀sán” (sūrah al-Muzammil; 73:20). Bákan náà, nínú ẹ̀gbàwá Nawwās bun Sam‘ān - kí Allāhu yọ́nú sí i - lórí ọ̀rọ̀ òǹkà ọjọ́ tí Mọsīh Dajjāl máa lò nílé ayé láti fi da ilé ayé rú pátápátá ṣíwájú kí Ànábì ‘Īsā ọmọ Mọryam, ẹni-àńretí - kí ọlà Allāhu máa bá a - tó wá fi idà pa á. Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - sọ pé. “Ó máa lo ogójì ọjọ́. Ọjọ́ kìíní bí ọdún kan. Ọjọ́ kejì bí oṣù kan. Ọjọ́ kẹta bí ọ̀ṣẹ̀ kan. Ọjọ́ yòókù bí ọjọ́ yín.” (Muslim) Nítorí náà, ọjọ́ kàn lè dọ́gba sí ẹgbẹ̀rún ọdún tiwa (1000), tí Allāhu bá fẹ́. Ọjọ́ kan sì lè dọ́gba sí ọ̀kẹ́ méjì ààbọ̀ ọdún tiwa (50,000), tí Allāhu bá fẹ́. Aṣèyí-ówùú ni Allāhu.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"wayastaʿjilūnaka bil-ʿadhābi walan yukh'lifa al-lahu waʿdahu wa-inna yawman ʿinda rabbika ka-alfi sanatin mimmā taʿuddūna ","translations":["And they ask you to hasten","the punishment","But never will","fail/violate","Allah","(in) His Promise","And indeed","a day","with","your Lord","(is) like a thousand","year(s)","of what","you count","(47)"],"transliterationArr":["wayastaʿjilūnaka","bil-ʿadhābi","walan","yukh'lifa","al-lahu","waʿdahu","wa-inna","yawman","ʿinda","rabbika","ka-alfi","sanatin","mimmā","taʿuddūna",null],"verseTiming":[[1,0,2410],[2,2410,3920],[3,3920,4400],[4,4400,6290],[5,6290,7370],[6,7370,8860],[7,8860,10010],[8,10010,10900],[9,10900,12410],[10,12410,13290],[11,13290,14220],[12,14220,14950],[13,14950,17300],[14,17300,20275]]}}