{"name":"22:52","price":"A kò rán Òjíṣẹ́ kan tàbí Ànábì kan níṣẹ́ ṣíwájú rẹ àfi kí ó jẹ́ pé nígbà tí ó bá sọ̀rọ̀, Èṣù máa ju (n̄ǹkan) sínú ọ̀rọ̀ rẹ̀. Nítorí náà, Allāhu yóò pa ohun tí Èṣù ń jù sínú rẹ̀ rẹ́. Lẹ́yìn náà, Ó máa fi òdodo àwọn āyah Rẹ̀ rinlẹ̀. Allāhu sì ni Onímọ̀, Ọlọ́gbọ́n. ¹","arabic":"وَمَآ أَرۡسَلۡنَا مِن قَبۡلِكَ مِن رَّسُولٖ وَلَا نَبِيٍّ إِلَّآ إِذَا تَمَنَّىٰٓ أَلۡقَى ٱلشَّيۡطَٰنُ فِيٓ أُمۡنِيَّتِهِۦ فَيَنسَخُ ٱللَّهُ مَا يُلۡقِي ٱلشَّيۡطَٰنُ ثُمَّ يُحۡكِمُ ٱللَّهُ ءَايَٰتِهِۦۗ وَٱللَّهُ عَلِيمٌ حَكِيمٞ","category":["22 (Al-Hajj)","Al-Hajj","Surah Al-Hajj","Chapter Al-Hajj","Hajj","Surah Hajj","Chapter Hajj","Al Hajj","Surah Al Hajj","Chapter Al Hajj","Surah 22","Chapter 22","The Pilgrimage","الحَجّ"],"ayahNumber":2647,"juzNumber":17,"footnotes":"1. Āyah 52 yìí jẹ́ ọ̀kan nínú àwọn āyah pàtàkì tí àwọn nasọ̄rọ̄ máa ń tọ́ka sí láti fi tako al-Ƙur’ān alápọ̀n-ọ́nlé àti Ànábì wa Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a -. Àwọn nasọ̄rọ̄ máa ń sọ pé, “Kókó tó wà nínú āyah náà ni pé, Èṣù máa ń gbé ọ̀rọ̀ sẹ́nu Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - lásìkò tí ó bá fẹ́ ka al-Ƙur’ān fún àwọn ènìyàn láti fi jíṣẹ́ fún wọn. Wọ́n fi kún un pé Èṣù ló máa ń gba ẹnu Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - sọ̀rọ̀ nígbàkígbà tí ó bá ń jíṣẹ́ Ọlọ́hun.” \n Nítorí kí ọ̀rọ̀ ẹnu àwọn nasọ̄rọ̄ wọ̀nyí lè dùn létí àwọn ènìyàn, wọ́n túlé kan ẹ̀gbàwá ọ̀rọ̀ kan tí wọ́n ṣe àfitì rẹ̀ sọ́dọ̀ ọmọ ‘Abbās - kí Allāhu yọ́nú sí i - pé, “Ní ọjọ́ kan Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - ń ké sūrah an-Najm, ìyẹn sūrah 53, fún àwọn ará ìlú Mọkkah. Nígbà tí ó ké sūrah náà dé orí āyah 19 sí āyah 20, ní àyè tí Allāhu - tó ga jùlọ - ti sọ pé “Ẹ sọ fún mi nípa òrìṣà Lāt àti òrìṣà ‘Uzzā, àti òmíràn, Mọnāh, òrìṣà kẹta”, ó sọ pé “Ìwọ̀nyẹn ni àwọn ẹyẹ àgbà. Àti pé ìrètí wà nínú ìṣìpẹ̀ tí wọ́n máa ṣe.” Nígbà tí Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - sọ bẹ́ẹ̀ tán, gbogbo àwọn mùsùlùmí àti àwọn ọ̀ṣẹbọ sì dìjọ forí kanlẹ̀ pẹ̀lú rẹ̀…”\n Àwọn nasọ̄rọ̄ wá sọ pé, “àwọn òrìṣà mẹ́tẹ̀ẹ̀ta wọ̀nyẹn tí Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - pè ní ẹyẹ àgbà ni ọ̀rọ̀ náà tí Èṣù jù sí ẹnu Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - lásìkò tó ń ké al-Ƙur’ān náà. Ìtàn náà sì wà nínú àkọsílẹ̀ àwọn tírà tafsīr àwọn mùsùlùmí.” Ọ̀rọ̀ wọn nìwọ̀nyẹn lórí ìtúmọ̀ tí wọ́n fún āyah 52 àti ẹ̀rí wọn lórí rẹ̀ parí. \n Èsì ọ̀rọ̀: Ọ̀rọ̀ ńlá ni àwọn nasọ̄rọ̄ sọ yìí. Ọ̀rọ̀ náà kì í ṣe òdodo rárá. Àfiwé ìtúkútùú àwọn nasọ̄rọ̄ wọ̀nyí dà bí ọ̀rọ̀ arákùnrin wọn kan tí orúkọ rẹ̀ ń jẹ́ “Lákin”. Lákin yìí ló sọ pé òun náà nímọ̀ ìtúmọ̀ al-Ƙur’ān ju àwa mùsùlùmí lọ. Ó sì sọ pé kódà Allāhu dárúkọ òun náà nínú al-Ƙur’ān. A sì bi í léèrè pé ibo ni orúkọ rẹ̀ wà nínú al-Ƙur’ān. Ó sì fèsì pé orúkọ òun ni gbogbo ibi tí al-Ƙur’ān bá ti sọ pé “لَكِنْ” (lākin)!? \n Ẹ̀yin onímọ̀ èdè, ṣé ìtúmọ̀ “لَكِنْ” (lākin) nínú èdè Lárúbáwá sì ni ìtúmọ̀ “Lákin” nínú èdè Yorùbá? “Ṣùgbọ́n / àmọ́” ni ìtúmọ̀ “لَكِنْ” (lākin) nínú èdè Lárúbáwá. “Ẹni tí ó ní akin-ọkàn” sì ni ìtúmọ̀ “Lákin” nínú èdè Yorùbá. Ṣé ẹ rí i báyìí pé “ṣùgbọ́n” ti wọnú ọ̀rọ̀ àwọn nasọ̄rọ̄. Ìyẹn ni pé, wọn kò ní ìmọ̀ olóóókan nípa al-Ƙur’ān àti hadīth, ṣùgbọ́n wọ́n mọ irọ́ funfun báláú pa mọ́ ẹ̀sìn ’Islām. Ìṣe wọn yìí sì ṣe wẹ́kú ọ̀rọ̀ tí Allāhu - tó ga jùlọ - sọ nípa wọn nínú sūrah al-Baƙọrah; 2: 78.\n Wàyí tí a ti mọ irú ènìyàn tí àwọn nasọ̄rọ̄ í ṣe, ẹ jẹ́ kí á ṣàlàyé āyah tí wọ́n ń túmọ̀ sódì náà. \n Ní àkọ́kọ́ ná, ẹni tí Èṣù bá ń gbẹnu rẹ̀ sọ̀rọ̀, bí kò jẹ́ wèrè, ó máa jẹ́ eléṣù tí ó bá Èṣù dòwò pọ̀. Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - kì í ṣe wèrè. Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - kò sì lọ́dẹ orí. Bẹ́ẹ̀ sì ni pé kò bọ̀rìṣà rí áḿbọ̀sìbọ́sí pé Èṣù yóò máa gùn ún. Allāhu - tó ga jùlọ - sì ti fi rinlẹ̀ nínú ọ̀pọ̀lọ́pọ̀ āyah al-Ƙur’ān pé Èṣù àti àwọn ọmọ ogun rẹ̀ kò lágbára lórí àwọn onígbàgbọ́ òdodo. Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - sì ni ọ̀gá àwọn onígbàgbọ́ òdodo. Díẹ̀ nínú àwọn àyè tí Allāhu - tó ga jùlọ - ti sọ èyí ni sūrah al-Hijr; 15:42 àti sūrah an-Nahl; 16:99 -100. Bákan náà, Allāhu - tó ga jùlọ - tún fi rinlẹ̀ pé ààbò mímọ́ wà fún ìsọ̀kalẹ̀ al-Ƙur’ān, kíké rẹ̀ àti ṣíṣe àkọsílẹ̀ rẹ̀ láti ojú ayé Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - títí di òpin ayé, gẹ́gẹ́ bí ó ṣe wà nínú sūrah al-Hijr; 15:9 àti sūrah Fussilat; 41:41 - 42. Nítorí náà, Èsù kan kan kò lè rọ́nà ti ọ̀rọ̀ tirẹ̀ bọ inú al-Ƙur’ān. \n Bákan náà, ọ̀rọ̀kọ́rọ̀ tàbí ọ̀rọ̀ eléṣù kò tẹnu Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - jáde rí nínú ìgbésí ayé rẹ̀ ní ìbámu sí sūrah an-Najm; 53: 3 - 4. \n Síwájú sí i, Èṣù kan kan kò lè rí àwòrán tàbí ohùn Ànábì wa - kí ìkẹ́ àti ọlà Allāhu máa bá a - yá lò yálà lójú oorun tàbí lójú ayé nítorí hadīth Sọhīh, ní ibi tí Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - ti sọ pé “Èṣù kò lè gbé àwòrán mi wọ̀.” \n Kódà “ƙọrīn” èṣù àlùjọ̀nnú alábàárìn tí Allāhu fi sára ènìyàn kọ̀ọ̀kan, láì yọ Ànábì tàbí Òjíṣẹ́ kan sílẹ̀, tí ó máa ń pa ènìyàn láṣẹ aburú nínú ẹ̀mí, òun gan-an kò lè pa Ànábì wa - kí ìkẹ́ àti ọlà Allāhu máa bá a - láṣẹ aburú nítorí pé Allāhu ṣe àrànṣe fún Ànábì wa - kí ìkẹ́ àti ọlà Allāhu máa bá a - lórí rẹ̀. Àlùjọ̀nnú náà sì gba ’Islām, kò sì pa Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - láṣẹ aburú. \n Nítorí náà, “ma‘sūm” ẹni tí ààbò mímọ́ wà fún ni Ànábì wa Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a -. Pẹ̀lú àwọn ẹ̀rí tààrà wọ̀nyẹn, mùsùlùmí onígbàgbọ́ òdodo kò níí pẹ̀lú ọ̀bọ jẹko láti sọ pé èṣù kan gba ẹnu Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - sọ̀rọ̀ láti sọ pé “Ìwọ̀nyẹn ni àwọn ẹyẹ àgbà. Àti pé ìrètí wà nínú ìṣìpẹ̀ tí wọ́n máa ṣe.” \n Ní ti àwọn hadīth tí wọ́n fi gbe ọ̀rọ̀ burúkú náà lẹ́sẹ̀, gbogbo àwọn hadīth náà ló lẹ, tí kò ṣe é fi ṣe ẹ̀rí àfi hadīth ẹyọ kan péré. Ìyẹn ni pé, gbogbo hadīth tó ń sọ nípa pé Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - sọ pé “Ìwọ̀nyẹn ni àwọn ẹyẹ àgbà. Àti pé ìrètí wà nínú ìṣìpẹ̀ tí wọ́n máa ṣe.” jẹ́ hadīth tó lẹ pátápátá. Àmọ́ èyí tí ó fẹsẹ̀ rinlẹ̀ nínú wọn kò tayọ èyí tí ó wà nínú sọhīhu-l-Bukọ̄riy, lábẹ́ àkọlé ìforíkanlẹ̀ àwọn mùsùlùmí pẹ̀lú àwọn ọ̀ṣẹbọ. Láti ọ̀dọ̀ Ọmọ ‘Abbās - kí Allāhu yọ́nú sí àwọn méjèèjì -, ó sọ pé: “Dájúdájú Ànábì forí kanlẹ̀ níbi āyah ìforíkanlẹ̀ nínú sūrah an-Najm. Àwọn mùsùlùmí, àwọn ọ̀ṣẹbọ, àlùjọ̀nnú àti ènìyàn sì forí kanlẹ̀ pẹ̀lú rẹ̀.” Hadīth nìyí tó fẹsẹ̀ rinlẹ̀ lórí ìṣẹ̀lẹ̀ náà. Kò sì sí ọ̀rọ̀ “àwọn ẹyẹ àgbà” kan kan nínú rẹ̀. \n Ohun tí ènìyàn yó kàn fẹ́ mọ̀ nípa rẹ̀ ni pé, kí ló mú àwọn ọ̀ṣẹbọ forí kanlẹ̀ láì tí ì gba ’Islām. Ìdí tí àwọn ọ̀ṣẹbọ wọ̀nyẹn fi forí kanlẹ̀ ni pé, wọ́n gbọ́ orúkọ òrìṣà wọn mẹ́ta kan nínú āyah al-Ƙur’ān, ìyẹn nínú sūrah an-Najm; 53:19-20, wọ́n bá lérò pé Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - náà ń pàtàkì àwọn òrìṣà náà. Inú wọn sì dùn. Wọ́n bá forí kanlẹ̀. Ìforíkanlẹ̀ wọn kò sì wulẹ̀ wúlò fún n̄ǹkan kan. Àmọ́ níkété tí Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - ké sūrah náà síwájú wọ āyah 26. Ara wọn balẹ̀. Wọ́n sì rí i dájú pé, ọ̀tọ̀ ni ohun tí Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - sọ. Ọ̀tọ̀ ni ohun tí àwọn èṣù inú ẹ̀mí wọn gbé jù sínú ọkàn wọn. Àwọn fúnra wọn ni wọ́n sọ ohun tí àwọn èṣù inú ẹ̀mí wọn gbé jù sínú ẹ̀mí wọn. \n Àmọ́ nítorí kí Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - máa baà banújẹ́ lórí ìṣẹ̀lẹ̀ náà ni Allāhu - tó ga jùlọ - fi sọ ọ́ di ohun mímọ̀ fún un nínú āyah 52 (ìyẹn, nínú sūrah al-Hajj) pé, kò sí Ànábì tàbí Òjíṣẹ́ ti irú rẹ̀ kò sẹlẹ̀ sí rí ní ọ̀nà kan tàbí òmíràn. Nítorí náà, Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - fẹ́ pe làákàyè wọn wálé pé, Allāhu kò lọ́wọ́ nínú àwọn orúkọ òrìṣà náà. Àti pé, kò sí ìkápá ìpẹ̀ ṣíṣe fún wọn lọ́dọ̀ Allāhu - tó ga jùlọ -. Āyah 23 sí 26 nínú sūrah an-Najm sì ń jẹ́rìí sí èyí. \n Síwájú sí i, mímú tí àwọn tírà tafsīr mú ìṣẹ̀lẹ̀ náà wà láì sọ àwílé jẹ́ àsọọ̀yán àti àsọọ̀tó. Àmọ́ sá, ẹ̀gbàwá Bukọ̄riy ti yanjú ọ̀rọ̀ náà. Kò sì sí ọ̀rọ̀ “àwọn ẹyẹ àgbà mẹ́ta” kan kan nínú rẹ̀. Nítorí náà, hadīth kò báà lé ní igba lórí ọ̀rọ̀ kan náà, tí ó bá ti tako āyah kan nínú al-Ƙur’ān tàbí tí ó bá tako hadīth Bukọ̄riy tàbí hadīth Muslim, irú hadīth náà kò wúlò nínú ẹ̀sìn wa láti fi ṣe ẹ̀rí ọ̀rọ̀. -W-Allāhu ’a‘lam. -","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"wamā arsalnā min qablika min rasūlin walā nabiyyin illā idhā tamannā alqā al-shayṭānu fī um'niyyatihi fayansakhu al-lahu mā yul'qī al-shayṭānu thumma yuḥ'kimu al-lahu āyātihi wal-lahu ʿalīmun ḥakīmun ","translations":["And not","We sent","before you","before you","any","Messenger","and not","a Prophet","but","when","he recited","threw","the Shaitaan","in","his recitation","But Allah abolishes","But Allah abolishes","what","throws","the Shaitaan","then","Allah will establish","Allah will establish","His Verses","And Allah","(is) All-Knower","All-Wise","(52)"],"transliterationArr":["wamā","arsalnā","min","qablika","min","rasūlin","walā","nabiyyin","illā","idhā","tamannā","alqā","al-shayṭānu","fī","um'niyyatihi","fayansakhu","al-lahu","mā","yul'qī","al-shayṭānu","thumma","yuḥ'kimu","al-lahu","āyātihi","wal-lahu","ʿalīmun","ḥakīmun",null],"verseTiming":[[1,0,2240],[2,2240,3580],[3,3580,4490],[4,4490,5440],[5,5440,5640],[6,5640,7440],[7,7440,8100],[8,8100,9290],[9,9290,11290],[10,11290,11860],[11,11860,14950],[12,14950,15580],[13,15580,17040],[14,17040,18510],[15,18510,20240],[16,20240,21910],[17,21910,22880],[18,22880,23290],[19,23290,23930],[20,23930,26460],[21,26460,28930],[22,28930,29810],[23,29810,30220],[24,30220,30890],[25,30890,32330],[26,32330,33470],[27,33470,34400],[28,34400,35410],[29,35410,37240],[30,37240,38360],[31,38360,39470],[32,39470,41935]]}}