{"name":"22:67","price":"Ìjọ kọ̀ọ̀kan l’A fún ní ìlànà tí wọ́n máa lò. Nítorí náà, kí wọ́n má ṣe jà ọ́ níyàn nípa ọ̀rọ̀ náà. Kí o sì pèpè sọ́dọ̀ Olúwa rẹ. Dájúdájú o kúkú wà lójú ọ̀nà tààrà. ¹","arabic":"لِّكُلِّ أُمَّةٖ جَعَلۡنَا مَنسَكًا هُمۡ نَاسِكُوهُۖ فَلَا يُنَٰزِعُنَّكَ فِي ٱلۡأَمۡرِۚ وَٱدۡعُ إِلَىٰ رَبِّكَۖ إِنَّكَ لَعَلَىٰ هُدٗى مُّسۡتَقِيمٖ","category":["22 (Al-Hajj)","Al-Hajj","Surah Al-Hajj","Chapter Al-Hajj","Hajj","Surah Hajj","Chapter Hajj","Al Hajj","Surah Al Hajj","Chapter Al Hajj","Surah 22","Chapter 22","The Pilgrimage","الحَجّ"],"ayahNumber":2662,"juzNumber":17,"footnotes":"1. Gbólóhùn yìí “Ìjọ kọ̀ọ̀kan l’A fún ní ìlànà tí wọ́n máa lò.” Ìyẹn nínú ’Islām tí Allāhu fi rán Òjíṣẹ́ wọn sí wọn nítorí pé, ’Islām ni ẹ̀sìn gbogbo àwọn Ànábì àti àwọn Òjísẹ́ Olọ́hun, àmọ́ ìlànà ìjọ́sìn kan láààrin ìjọ Òjíṣẹ́ kan sí òmíràn lè yàtọ̀. Bí àpẹ̀ẹrẹ, kò sí ìjọ Òjíṣẹ́ kan tí kò ní ìrun tirẹ̀, àmọ́ òǹkà rakaa àti àsìkò ìrun ń yàtọ̀ láààrin ìjọ Òjíṣẹ́ kan sí òmíràn. \n Bákan náà ni ìyàtọ̀ tún lè wà nínú ìṣe àti àṣà láààrin ìjọ Òjíṣẹ́ kan sí òmíràn. Bí àpẹ̀ẹrẹ, àṣà ìkúnlẹ̀-kíni jẹ́ ìṣe tó ní ẹ̀tọ́ nínú ìjọ ìṣáájú, àmọ́ tí ó jẹ́ ìṣe tí ó di èèwọ̀ nínú ìjọ Ànábì wa Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - . Gbogbo ìjọ Òjíṣẹ́ ni wọ́n lè yàtọ̀ síra wọn ní ojú pọ̀n-nà wọ̀nyẹn, àmọ́ kò sí ìyàtọ̀ láààrin ìjọ Òjíṣẹ́ kan sí òmíràn lórí jíjẹ́ tí Allāhu ń jẹ́ Ọlọ́hun ọ̀kan ṣoṣo, Olúwa àti Olùgbàlà. Allāhu sì ṣe ẹbọ ṣíṣe ní èèwọ̀ fún gbogbo wọn pátápátá. Èyí gan-an ni ìpìlẹ̀ fún ìgbàgbọ́ òdodo tí gbogbo àwọn Ànábì àti Òjíṣẹ́ Ọlọ́hun mú wá - kí ìkẹ́ àti ọlà Allāhu máa bá wọn - .","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"likulli ummatin jaʿalnā mansakan hum nāsikūhu falā yunāziʿunnaka fī al-amri wa-ud'ʿu ilā rabbika innaka laʿalā hudan mus'taqīmin ","translations":["For every","nation","We have made","rite(s)","they","perform it","So let them not dispute with you","So let them not dispute with you","in","the matter","but invite (them)","to","your Lord","Indeed, you","(are) surely on","guidance","straight","(67)"],"transliterationArr":["likulli","ummatin","jaʿalnā","mansakan","hum","nāsikūhu","falā","yunāziʿunnaka","fī","al-amri","wa-ud'ʿu","ilā","rabbika","innaka","laʿalā","hudan","mus'taqīmin",null],"verseTiming":[[1,0,960],[2,960,3130],[3,3130,4200],[4,4200,5860],[5,5860,6330],[6,6330,9200],[7,9200,9860],[8,9860,12460],[9,12460,12700],[10,12700,13310],[11,13310,14510],[12,14510,15110],[13,15110,16030],[14,16030,17460],[15,17460,18270],[16,18270,18780],[17,18780,22415]]}}