{"name":"22:75","price":"Allāhu l’Ó ń ṣa àwọn kan lẹ́ṣà (láti jẹ́) Òjíṣẹ́ nínú àwọn mọlāika àti nínú àwọn ènìyàn. Dájúdájú Allāhu ni Olùgbọ́, Olùríran.¹","arabic":"ٱللَّهُ يَصۡطَفِي مِنَ ٱلۡمَلَٰٓئِكَةِ رُسُلٗا وَمِنَ ٱلنَّاسِۚ إِنَّ ٱللَّهَ سَمِيعُۢ بَصِيرٞ","category":["22 (Al-Hajj)","Al-Hajj","Surah Al-Hajj","Chapter Al-Hajj","Hajj","Surah Hajj","Chapter Hajj","Al Hajj","Surah Al Hajj","Chapter Al Hajj","Surah 22","Chapter 22","The Pilgrimage","الحَجّ"],"ayahNumber":2670,"juzNumber":17,"footnotes":"1. Kíyè sí i! Āyah yìí jẹ́ ọ̀kan nínú àwọn āyah tí àwọn òpùrọ́ àsoòkùn sẹ́sìn máa ń lò láti fi sọ pé, Allāhu kò ì dáwọ́ fífi iṣẹ́ jíjẹ́ Rẹ̀ rán àwọn ènìyàn kan níṣẹ́ sáyé lẹ́yìn ikú Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - . Àwọn tí wọ́n pa irọ́ ńlá yìí mọ Allāhu kò gbàgbọ́ pé tírà ìkẹ́yìn tí wọ́n fi jíṣẹ́ Allāhu fún gbogbo ayé ni al-Ƙur’ān alápọ̀n-ọ́nlé. Àti pé, wọ́n kò gbàgbọ́ pé, Ànábì wa Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - ni òpin gbogbo àwọn tí Allāhu fi iṣẹ́ jíjẹ́ Rẹ̀ rán nínú àwọn ènìyàn àti àlùjànnú. \n Nípa àìgbàgbọ́ wọn yìí, wọ́n sọ àwọn ààfáà wọn di “wòlíì onímìísí”. Irú àwọn wọ̀nyí ni ìjọ Ahmadiyyah, ìjọ onísūfī Tijäniyyah àti Ƙọ̄diriyyah, àti àwọn ìjọ ẹlẹ́mìí gbígbé. Irú àwọn wọ̀nyí tí jáde kúrò nínú ìgbàgbọ́ òdodo tí ’Islām mú wá pátápátá. Wọ́n ti di aláìgbàgbọ́. Èèwọ̀ sì ni fún mùsùlùmí òdodo láti kí ìrun lẹ́yìn wọn. Bí irú àwọn aláìgbàgbọ́ wọ̀nyí bá wà ní orí ilẹ̀ tí wọ́n ti ń lo ìjọba ’Islām, ìdájọ́ ikú ni ọ̀ràn tí wọ́n dá, àfi tí wọ́n bá tètè ronú pìwàdà. Ẹ tún ka ìtọsẹ̀-ọ̀rọ̀ sūrah al-’Ahzāb; 33:40.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"al-lahu yaṣṭafī mina al-malāikati rusulan wamina al-nāsi inna al-laha samīʿun baṣīrun ","translations":["Allah","chooses","from","the Angels","Messengers","and from","the mankind","Indeed","Allah","(is) All-Hearer","All-Seer","(75)"],"transliterationArr":["al-lahu","yaṣṭafī","mina","al-malāikati","rusulan","wamina","al-nāsi","inna","al-laha","samīʿun","baṣīrun",null],"verseTiming":[[1,0,1150],[2,1150,2300],[3,2300,2670],[4,2670,5690],[5,5690,6400],[6,6400,7760],[7,7760,11270],[8,11270,12580],[9,12580,13490],[10,13490,15310],[11,15310,18265]]}}