{"name":"23:14","price":"Lẹ́yìn náà, A sọ àtọ̀ di ẹ̀jẹ̀ dídì. Lẹ́yìn náà, A sọ ẹ̀jẹ̀ dídì di bááṣí ẹran. Lẹ́yìn náà, A sọ bááṣí ẹran di eegun. Lẹ́yìn náà, A fi ẹran bo eegun. Lẹ́yìn náà, A sọ ọ́ di ẹ̀dá mìíràn.¹ Nítorí náà, ìbùkún ni fún Allāhu, Ẹni tó dára jùlọ nínú àwọn ẹlẹ́dàá (oníṣẹ́-ọnà).²","arabic":"ثُمَّ خَلَقۡنَا ٱلنُّطۡفَةَ عَلَقَةٗ فَخَلَقۡنَا ٱلۡعَلَقَةَ مُضۡغَةٗ فَخَلَقۡنَا ٱلۡمُضۡغَةَ عِظَٰمٗا فَكَسَوۡنَا ٱلۡعِظَٰمَ لَحۡمٗا ثُمَّ أَنشَأۡنَٰهُ خَلۡقًا ءَاخَرَۚ فَتَبَارَكَ ٱللَّهُ أَحۡسَنُ ٱلۡخَٰلِقِينَ","category":["23 (Al-Mu'minun)","Al-Mu'minun","Surah Al-Mu'minun","Chapter Al-Mu'minun","Mu'minun","Surah Mu'minun","Chapter Mu'minun","Al Mu'minun","Surah Al Mu'minun","Chapter Al Mu'minun","Surah 23","Chapter 23","The Believers","المُؤمِنُون"],"ayahNumber":2687,"juzNumber":18,"footnotes":"1. Ìyẹn ni pé, A sọ ọ́ di ẹ̀dá mìíràn tí ó ní ẹ̀mí, tí ó sì bẹ̀rẹ̀ sí dàgbà sókè bẹ̀rẹ̀ láti òpóǹló títí di ọjọ́ ikú.\n 2. Irú gbólóhùn yìí أَحْسَنَ ٱلْخَٰلِقِينَ “Ẹni t’Ó dára jùlọ nínú àwọn ẹlẹ́dàá.” tún wà nínú sūrah as-Sọ̄ffāt; 37:125. \n Irúfẹ́ gbólóhùn yìí nìwọ̀nyí: وَأَنتَ خَيْرُ ٱلرَّٰزِقِينَ Ìwọ sì lóore jùlọ nínú àwọn olùpèsè. (sūrah al-Mọ̄’idah; 5:114); وَهُوَ خَيْرُ ٱلْحَٰكِمِينَ Òun l’Ó sì dára jùlọ nínú àwọn olùdájọ́. (sūrah al-’A‘rọ̄f; 7:87); \n وَأَنتَ أَرْحَمُ ٱلرَّٰحِمِينَ Ìwọ sì ni Aláàánú jùlọ nínú àwọn aláàánú. (sūrah al-’A‘rọ̄f; 7:151); àti وَهُوَ أَسْرَعُ ٱلْحَٰسِبِينَ Òun sì yára jùlọ nínú àwọn oníṣirò. (sūrah al-’Ani‘ām; 6:62). \n Àwọn gbólóhùn wọ̀nyẹn ń fi rinlẹ̀ pé Allāhu - tó ga jùlọ - ń jẹ́ Ọ̀kan nínú àwọn ẹlẹ́dàá, olùpèsè, olùdájọ́, aláàánú àti oníṣirò. \n Kíyè sí i, nínú àwọn iṣẹ́ tí Allāhu máa ń ṣe fún àwọn ẹ̀dá Rẹ̀, àmọ́ tí a tún ń rí àwọn kan nínú àwọn ẹ̀dá Rẹ̀ tí àwọn náà máa ń ṣe wọ́n ni dídá ẹ̀dá, ìpèsè, ẹjọ́ dídá, àánú ṣíṣe àti ìṣírò iṣẹ́. Ṣùgbọ́n ìkọ̀ọ̀kan àwọn iṣẹ́ náà bùkátà sí àlàyé. \n Dídá ẹ̀dá: Ní òdodo ni pé, kò sí ẹ̀dá kan láyé àti lọ́run, ìbáà mọ bíi ọmọ iná igún, àfi kí Allāhu jẹ́ Ẹlẹ́dàá rẹ̀. Kódà “àdámọ́”, ẹ̀dá kan nínú ẹ̀dá Allahu ni. Bí ẹnikẹ́ni bá ń lo “ìṣẹ̀dá” fún iṣẹ́ ọwọ́ rẹ̀, ó rí bẹ́ẹ̀ láti ara “ẹ̀dá” tí Allāhu ṣẹ̀dá ni. Bí bẹ́ẹ̀ kọ́, kò lè rí bẹ́ẹ̀. Allāhu nìkan ṣoṣo ló ń dá ẹ̀dá láti ibi àìsí wá síbi bíbẹ. Àmọ́ ohun tí a gbàlérò pẹ̀lú fífi dídá ẹ̀dá tì sọ́dọ̀ ẹ̀dá ni ṣíṣe iṣẹ́-ọnà bíi ère gbígbẹ́ àti yíya àwòrán n̄ǹkan ẹlẹ́mìí. Èdè abunikù fún agbẹ́gilére ni “ẹlẹ́dàá”. Tí agbẹ́gilére bá mọ súná burúkú tí Allāhu - tó ga jùlọ - fún un, tí ó sì mọ̀ pé dájúdájú òun kò lè fi ẹ̀mí sára ère rẹ̀ tó ń gbẹ́ kalẹ̀, bóyá ó máa mọ̀ ọ́n ní ọ̀ràn. Ìdí nìyí tí hadīth kan fi sọ pé, lára ìyà tí ń bẹ nílẹ̀ ní ọ̀run nínú Iná fún agbẹ́gilére ni pé, wọ́n máa sọ fún un pé kí ó fi ẹ̀mí sára ère rẹ̀. Kò sì níí lè ṣe bẹ́ẹ̀. Wàyí, wọ́n ń pé agbẹ́gilére ní “ẹlẹ́dàá” nítorí pé, wọ́n ń fi iṣẹ́-ọnà wọn jọ ẹ̀dá tí Allāhu dá. Tí a bá wá lo orúkọ “ẹlẹ́dàá” fún wọn, dípò oníṣẹ́-ọnà, tí Allāhu - tó ga jùlọ - sì ń jẹ́ Ẹlẹ́dàá, ta wá ni Ẹlẹ́dàá tó dára jùlọ tí ẹ̀dá tirẹ̀ jẹ́ ojúlówó? Allāhu - tó ga jùlọ - ni. Ìdí nìyí tí Allāhu fi sọ pé, “Òun ni Ẹni tó dára jùlọ nínú àwọn ẹlẹ́dàá.” Pípe “oníṣẹ́-ọnà” ni “ẹlẹ́dàá” kò sì túmọ̀ sí pé ẹ̀dá kan wà tó ṣẹ̀dá ara rẹ̀ tàbí pé ẹ̀dá kan wà tó ń dá ẹ̀dá mìíràn bí kò ṣe ṣíṣe iṣẹ́-ọnà. Nítorí náà, ìtúmọ̀ àwọn ẹlẹ́dàá nínú āyah yìí ni “àwọn oníṣẹ́-ọnà tàbí àwọn agbẹ́gilére”. \n Ìpèsè: Àwọn ẹ̀dá kan gbàgbọ́ pé àwọn òrìṣà kan ń pèsè ìjẹ-ìmu àti dúkìá fún àwọn. Bí àpẹ̀ẹrẹ, Yorùbá gbàgbọ́ pé òrìṣà Ajé ń ṣe ìjẹ-ìmu, owó àti okòwò tí wọ́n sọ di “ọrọ̀-Ajé. Àwọn tó ń bọ́ ẹlòmíìràn náà ń sọra wọn di olùpèsè. Yàtọ̀ sí pé Allāhu ti fi rinlẹ̀ pé Òun nìkan ni Olùpèsè fún gbogbo ẹ̀dá Rẹ̀. Tí èyí kò bá tí ì dá àwọn kan lójú bẹ́ẹ̀, tí wọ́n sì fẹ́ gbé gbogbo ìpèsè olúkùlùkù lórí ìwọ̀n, ó máa hàn sí wọn kedere pé, ìpèsè ti Allāhu pọ̀ jùlọ, kò sì ṣe é kà. Àti pé nínú ìpèsè Rẹ̀ ni wọ́n ti ń fún àwọn òrìṣà. \n Ẹjọ́ dídá; A kúkú ní àwọn adájọ́ láààrin àwọn ènìyàn, yálà nílé ẹjọ́ tàbí ní àyè mìíràn. Àmọ́ kò sí adájọ́ tí ó jẹ́ arínú-róde. Àti pé ó wà nínú àwọn adájọ́ tó ń gba àbẹ̀tẹ́lẹ̀ láti fi ẹjọ́ ṣègbè. Allāhu nìkan ṣoṣo ni kì í fí ẹjọ́ ṣègbè. Àti pé ìdájọ́ Rẹ̀ dúró sórí mímọ ìkọ̀kọ̀ àti gban̄gba olùrojọ́. Nítorí náà, ìdí nìyí tí Allāhu fi mọ ẹjọ́ da jùlọ nínú àwọn adájọ́. Ìdájọ́ Rẹ̀ sì ni òpin. \n Àánú Ṣíṣe: Ojú àánú àti ọkàn àánú ń bẹ lára àwọn ẹ̀dá kan, tó bẹ́ẹ̀ gẹ́ tí wọ́n fi ń pè wọ́n ní ẹlẹ́yinjú-àánú. Àmọ́ Allāhu ní àánú ẹ̀dá Rẹ̀ púpọ̀ jùlọ. Àti pé, nínú àánú tí Allāhu fi sí àwọn ẹ̀dá kan lọ́kàn ni wọ́n fi di aláàánú. Nítorí náà, Allāhu ni Aláàánú jùlọ nínú àwọn aláàánú.\n Bí àlàyé ṣe máa lọ nìyẹn lórí irú àwọn gbólóhùn bẹ́ẹ̀ nínú al-Ƙur’ān, gẹ́gẹ́ bíi gbólóhùn “Olùyára jùlọ nínú àwọn olùṣírò-iṣẹ́”. Àmọ́ ní ti ète dídá gẹ́gẹ́ bí وَٱللَّهُ خَيْرُ ٱلْمَٰكِرِينَ Allāhu sì l’óore jùlọ nínú àwọn adéte. (āl-‘Imrọ̄n; 3:54). Ẹ wo ìtọsẹ̀-ọ̀rọ̀ sūrah al-Baƙọrah; 2:15.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"thumma khalaqnā al-nuṭ'fata ʿalaqatan fakhalaqnā al-ʿalaqata muḍ'ghatan fakhalaqnā al-muḍ'ghata ʿiẓāman fakasawnā al-ʿiẓāma laḥman thumma anshanāhu khalqan ākhara fatabāraka al-lahu aḥsanu al-khāliqīna ","translations":["Then","We created","the semen-drop","(into) a clinging substance","then We created","the clinging substance","(into) an embryonic lump","then We created","the embryonic lump","(into) bones","then We clothed","the bones","(with) flesh","then","We produce it","(as) a creation","another","So blessed is","Allah","(the) Best","(of) the Creators","(14)"],"transliterationArr":["thumma","khalaqnā","al-nuṭ'fata","ʿalaqatan","fakhalaqnā","al-ʿalaqata","muḍ'ghatan","fakhalaqnā","al-muḍ'ghata","ʿiẓāman","fakasawnā","al-ʿiẓāma","laḥman","thumma","anshanāhu","khalqan","ākhara","fatabāraka","al-lahu","aḥsanu","al-khāliqīna",null],"verseTiming":[[1,0,1720],[2,1720,2530],[3,2530,4060],[4,4060,5750],[5,5750,6830],[6,6830,7870],[7,7870,9470],[8,9470,10540],[9,10540,11700],[10,11700,13800],[11,13800,14800],[12,14800,15860],[13,15860,17710],[14,17710,18960],[15,18960,20100],[16,20100,21630],[17,21630,23050],[18,23050,25250],[19,25250,26150],[20,26150,27690],[21,27690,28930],[22,28930,29780],[23,29780,30610],[24,30610,34415]]}}