{"name":"23:101","price":"Nígbà tí wọ́n bá fọn fèrè oníwo fún àjíǹde, kò níí sí ìbátan láààrin wọn ní ọjọ́ yẹn, wọn kò sì níí bira wọn léèrè ìbéèrè.¹","arabic":"فَإِذَا نُفِخَ فِي ٱلصُّورِ فَلَآ أَنسَابَ بَيۡنَهُمۡ يَوۡمَئِذٖ وَلَا يَتَسَآءَلُونَ","category":["23 (Al-Mu'minun)","Al-Mu'minun","Surah Al-Mu'minun","Chapter Al-Mu'minun","Mu'minun","Surah Mu'minun","Chapter Mu'minun","Al Mu'minun","Surah Al Mu'minun","Chapter Al Mu'minun","Surah 23","Chapter 23","The Believers","المُؤمِنُون"],"ayahNumber":2774,"juzNumber":18,"footnotes":"1. Àwọn nasọ̄rọ̄ sọ pé, “Āyah yìí tako sūrah as-Sọ̄ffāt; 37:27 nípa ọ̀rọ̀ ìbéèrè.” Èsì: Kò sí ìtakora nínú rẹ̀. Ẹ wò ó, gbólóhùn yìí “wọn kò sì níí bira wọn léèrè ìbéèrè” ìyẹn ní kété tí olúkùlùkù bá kọ́kọ́ jí dìde láti inú sàréè rẹ̀. Iyè yóò pamọ́ àwọn ẹ̀dá nínú lásìkò náà ni, gẹ́gẹ́ bí ó tún ṣe rinlẹ̀ nínú sūrah al-Ƙọsọsọ; 28:66 àti sūrah az-Zumọr 39:68. Àmọ́ nígbà tí àwọn mọlāika bá da àwọn ẹ̀dá lọ sí ọ̀dọ̀ Allāhu Ọba Olùdájọ́ àwọn ẹ̀dá máa bẹ̀rẹ̀ sí i bira wọn léèrè ìbéèrè ní ti àbámọ̀ àti ìtakora, gẹ́gẹ́ bí ó ṣe rinlẹ̀ nínú sūrah as-Sọ̄ffāt; 37:27. Nítorí náà, kò sí ìtakora láààrin àwọn āyah náà.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"fa-idhā nufikha fī al-ṣūri falā ansāba baynahum yawma-idhin walā yatasāalūna ","translations":["So when","is blown","in","the trumpet","then not","(there) will be relationship","among them","that Day","and not","will they ask each other","(101)"],"transliterationArr":["fa-idhā","nufikha","fī","al-ṣūri","falā","ansāba","baynahum","yawma-idhin","walā","yatasāalūna",null],"verseTiming":[[1,0,850],[2,850,1430],[3,1430,1590],[4,1590,2490],[5,2490,4470],[6,4470,5990],[7,5990,7000],[8,7000,8640],[9,8640,9530],[10,9530,14345]]}}