{"name":"23:4","price":"àti àwọn tó ń ṣe àfọ̀mọ́ (ẹ̀mí àti ara) wọn.¹","arabic":"وَٱلَّذِينَ هُمۡ لِلزَّكَوٰةِ فَٰعِلُونَ","category":["23 (Al-Mu'minun)","Al-Mu'minun","Surah Al-Mu'minun","Chapter Al-Mu'minun","Mu'minun","Surah Mu'minun","Chapter Mu'minun","Al Mu'minun","Surah Al Mu'minun","Chapter Al Mu'minun","Surah 23","Chapter 23","The Believers","المُؤمِنُون"],"ayahNumber":2677,"juzNumber":18,"footnotes":"1. Ìtúmọ̀ mìíràn fún āyah yìí nìyí: “àti àwọn tó ń yọ zakāh”. Àmọ́ ìtúmọ̀ òkè yẹn ló bá a mu jùlọ nítorí àwọn ìwòye mẹ́ta kan. \n Ìkíní: Sūrah Mọkkah àti āyah Mọkkah ni āyah yìí. Zakāh yíyọ kò sì bẹ̀rẹ̀ ní Mọkkah Alápọ̀n-ọ́nlé, bí kò ṣe ní Mọdīnah Onímọ̀ọ́lẹ̀. Ìkejì: Nínú al-Ƙur’ān Alápọ̀n-ọ́nlé, gbogbo āyah tó ń sọ̀rọ̀ nípa zakāh yíyọ nínú dúkìá máa ń sopọ̀ mọ́ ìrun kíkí “ẹ kí ìrun, ẹ yọ zakāh”. \n Ìkẹta: “Ītā’u zakāh” yíyọ zakāh ní èdè al-Ƙur’ān Alápọ̀n-ọ́nlé tí ó bá ń sọ̀rọ̀ nípa zakāh dúkìá, kì í lo “fi‘lu-zakāh” ṣíṣe zakāh. \n Nípa ìwọ̀nyẹn, zakāh tẹ̀mí àti tara ni èròǹgbà Allāhu nínú āyah yìí, kì í ṣe zakāh ti dúkìá. \n Zakāh tẹ̀mí: òhun ni fífi “taohīdullāh” mímú Allāhu ní ọ̀kan ṣoṣo tí a gbọ́dọ̀ jọ́sìn fún ní ọ̀nà òdodo àti “al-’iklās” ọkàn tó mọ́ kúrò níbi “riyā’” ṣekárími jọ́sìn fún Allāhu - Ọba mímọ́, kí á fi àwọn n̄ǹkan méjèèjì yẹn ṣe àfọ̀mọ́ ọkàn wa kúrò níbi “ṣirk” ẹbọ, “kufr” àìgbàgbọ́, “nifāƙ” ìṣojú-méjì àti “’amrọ̄dul-ƙulūb” àwọn àìsàn-ọkàn bíi “kibr” motómotó, “hasad” kèéta àti bẹ́ẹ̀ bẹ́ẹ̀ lọ. Ní ti zakāh tara, òhun ni fífi ìtẹ̀lé àṣẹ Allāhu àti àṣẹ Òjíṣẹ́ Rẹ̀ - kí ìkẹ́ àti ọlà máa bá a - yapa sí àṣẹ Èṣù. Ìyẹn ni pé, ṣíṣe ohun tí ẹ̀sìn pa wá ní àṣẹ rẹ̀ àti jíjìnnà sí ohun tí ẹ̀sìn kọ̀ fún wa. Wallāhu ’a‘lam.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"wa-alladhīna hum lilzzakati fāʿilūna ","translations":["Those who","[they]","of purification works","(are) doers","(4)"],"transliterationArr":["wa-alladhīna","hum","lilzzakati","fāʿilūna",null],"verseTiming":[[1,0,1350],[2,1350,1780],[3,1780,3040],[4,3040,7615]]}}