{"name":"24:2","price":"Onísìná lóbìnrin àti onísìná lọ́kùnrin, ẹ na ẹnì kọ̀ọ̀kan nínú àwọn méjèèjì ní ọgọ́rùn-ún kòbókò. Ẹ má ṣe jẹ́ kí àánú wọn ṣe yín nípa ìdájọ́ Allāhu tí ẹ bá ní ìgbàgbọ́ òdodo nínú Allāhu àti Ọjọ́ Ìkẹ́yìn. Kí igun kan nínú àwọn onígbàgbọ́ òdodo sì jẹ́rìí sí ìyà àwọn méjèèjì.¹","arabic":"ٱلزَّانِيَةُ وَٱلزَّانِي فَٱجۡلِدُواْ كُلَّ وَٰحِدٖ مِّنۡهُمَا مِاْئَةَ جَلۡدَةٖۖ وَلَا تَأۡخُذۡكُم بِهِمَا رَأۡفَةٞ فِي دِينِ ٱللَّهِ إِن كُنتُمۡ تُؤۡمِنُونَ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِۖ وَلۡيَشۡهَدۡ عَذَابَهُمَا طَآئِفَةٞ مِّنَ ٱلۡمُؤۡمِنِينَ","category":["24 (An-Nur)","An-Nur","Surah An-Nur","Chapter An-Nur","Nur","Surah Nur","Chapter Nur","An Nur","Surah An Nur","Chapter An Nur","Surah 24","Chapter 24","The Light","النُّور"],"ayahNumber":2793,"juzNumber":18,"footnotes":"1. Ọgọ́rùn-ún kòbókò àti ẹ̀wọ̀n ọdún kan tàbí ọgọ́rùn-ún kòbókò àti lílé kúrò nínú ìlú fún ọdún kan ni ìjìyà fún onísìná tí kò ì ṣe ‘akdu-nnikāh pẹ̀lú ẹnikẹ́ni rí. Àmọ́ lílẹ̀ lókòpa ni ìjìyà fún onísìná tí ó ti ṣe ‘akdu-nnikāh rí. Ẹ̀dá ìbá mọ ìjìyà wọ̀nyí lọ́ràn, ìbá jìnnà sí àgbèrè ṣíṣe. Ìwọ arákùnrin àti arábìnrin mi, bí ọ̀ràn sìná bá fúyẹ́ ni, ìbá tí la ìjìyà lọ bí kò ṣe títọrọ àforíjìn lọ́dọ̀ Allāhu - tó ga jùlọ -. \n Ronú pìwàdà lónìí, má sì ṣe tìràn mọ́ àìsí Ṣẹria lórílẹ̀ èdè wa. \n Ó ṣeé ṣe kí ẹnì kan sọ pé, āyah wo ló ní kí á lẹ onísìná tó ti ṣe ‘akdu-nnikāh rí lókò pa? Kì í ṣe āyah nìkan ni mùsùlùmí ń tẹ̀lé nínú Ṣẹria àti ohun gbogbo tó rọ̀mọ́ ẹ̀sìn rẹ̀. Hadīth Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - ló ṣe é lófin fún wa láti ṣe bẹ́ẹ̀ nítorí pé, lílẹ̀ lókòpa ni ìjìyà tí Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - gbé dìde lórí àwọn kan tí wọ́n jẹ́wọ́ ọ̀ràn sìná lásìkò rẹ̀. Bí ó sì ṣe wà nìyẹn nínú òfin Ànábì Mūsā àti Ànábì ‘Īsā ọmọ Mọryam. Ìdájọ́ tí Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - náà mú wá nìyẹn. Kò sì sí āyah kan tó lòdì sí èyí. Mùsùlùmí tó bá sì yapa Ànábì wa - kí ìkẹ́ àti ọlà Allāhu máa bá a - lórí èyí ti sọnù jìnnà. \n Bákan náà, bí ẹni tí kò sí nílé ọkọ bá ṣe zinā, tí ó sì doyún, ọmọ náà kò níí jẹ́ ọmọ fún arákùnrin tó ṣe zinā pẹ̀lú arábìnrin náà, kò sì níí jẹ́ orúkọ rẹ̀ àyàfi tí ó bá fi rinlẹ̀ pé òun l’òun ni oyún. Ọmọ rẹ̀ ni ọmọ náà, àmọ́ ó bí i nípasẹ̀ zinā. Ìkíní kejì bàbá àti ìyá ọmọ náà sì lẹ́tọ̀ọ́ sí ìjìyà zinā láti rí àforíjìn Ọlọ́hun. \n Síwájú sí i, àwọn onímọ̀ yapa-ẹnu lórí síso yìgì lórí oyún sìná. Àwọn kan sọ pé wọ́n lè so yìgì lórí oyún sìná. Àwọn mìíràn sì sọ pé kò lẹ́tọ̀ọ́. \n Bákan náà, waliyyu ọmọbìnrin náà lẹ́tọ̀ọ́ láti kọ ìtakókó yìgì fún arákùnrin náà lẹ́yìn ìbímọ tí kò bá yọ́nú sí ẹ̀sìn àti ìwà arákùnrin náà. \n Àmọ́ lábẹ́ àìmọ̀kan, tọkọ tìyàwó tó bẹ̀rẹ̀ ìgbésí ayé wọn lórí zinā, waliyyu obìnrin lẹ́tọ̀ọ́ láti ṣe ìtakókó yìgì fún arákùnrin náà, wọn ìbáà ti bí ọmọ púpọ̀ fúnra wọn ṣíwájú. Èyí sì ni àtúnṣe ọ̀rọ̀ àwọn méjèèjì.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"al-zāniyatu wal-zānī fa-ij'lidū kulla wāḥidin min'humā mi-ata jaldatin walā takhudh'kum bihimā rafatun fī dīni al-lahi in kuntum tu'minūna bil-lahi wal-yawmi al-ākhiri walyashhad ʿadhābahumā ṭāifatun mina al-mu'minīna ","translations":["The fornicatress","and the fornicator","[then] flog","each","one","of them","(with) hundred","lash(es)","And (let) not","withhold you","pity for them","pity for them","concerning","(the) religion of Allah","(the) religion of Allah","if","you","believe","in Allah","and the Day","the Last","And let witness","their punishment","a group","of","the believers","(2)"],"transliterationArr":["al-zāniyatu","wal-zānī","fa-ij'lidū","kulla","wāḥidin","min'humā","mi-ata","jaldatin","walā","takhudh'kum","bihimā","rafatun","fī","dīni","al-lahi","in","kuntum","tu'minūna","bil-lahi","wal-yawmi","al-ākhiri","walyashhad","ʿadhābahumā","ṭāifatun","mina","al-mu'minīna",null],"verseTiming":[[1,0,1910],[2,1910,3120],[3,3120,4240],[4,4240,4980],[5,4980,5920],[6,5920,7800],[7,7800,8440],[8,8440,10200],[9,10200,10830],[10,10830,12970],[11,12970,13730],[12,13730,15370],[13,15370,16010],[14,16010,16650],[15,16650,17540],[16,17540,18580],[17,18580,20050],[18,20050,21430],[19,21430,22540],[20,22540,23690],[21,23690,24750],[22,24750,26880],[23,26880,28450],[24,28450,30870],[25,30870,31000],[26,31000,32570],[27,32570,36645]]}}