{"name":"24:3","price":"Onísìná lọ́kùnrin kò níí ṣe sìná pẹ̀lú ẹnì kan bí kò ṣe onísìná lóbìnrin (ẹgbẹ́ rẹ̀) tàbí ọ̀ṣẹbọ lóbìnrin. Onísìná lóbìnrin, ẹnì kan kò níí bá a ṣe sìná bí kò ṣe onísìná lọ́kùnrin (ẹgbẹ́ rẹ̀) tàbí ọ̀ṣẹbọ lọ́kùnrin.¹ A sì ṣe ìyẹn (sìná ṣíṣe) ní èèwọ̀ fún àwọn onígbàgbọ́ òdodo.²","arabic":"ٱلزَّانِي لَا يَنكِحُ إِلَّا زَانِيَةً أَوۡ مُشۡرِكَةٗ وَٱلزَّانِيَةُ لَا يَنكِحُهَآ إِلَّا زَانٍ أَوۡ مُشۡرِكٞۚ وَحُرِّمَ ذَٰلِكَ عَلَى ٱلۡمُؤۡمِنِينَ","category":["24 (An-Nur)","An-Nur","Surah An-Nur","Chapter An-Nur","Nur","Surah Nur","Chapter Nur","An Nur","Surah An Nur","Chapter An Nur","Surah 24","Chapter 24","The Light","النُّور"],"ayahNumber":2794,"juzNumber":18,"footnotes":"1. Àwọn onímọ̀ pín sí mẹ́ta lórí ìtúmọ̀ āyah yìí nítorí pé, ìtúmọ̀ mẹ́ta tí ó ń padà síbi n̄ǹkan ẹyọ kan ni kalmọh “nikāh” ń túmọ̀ sí nínú al-Ƙur’ān, hadīth àti èdè Lárúbáwá. Àwọn ìtúmọ̀ mẹ́tẹ̀ẹ̀ta náà ni fífẹ́ (ṣíṣe ìgbéyàwó), títi kálámù bọ inú ìgò tàdáà yálà ní ọ̀nà ẹ̀tọ́ tàbí ní ọ̀nà àìtọ́ àti ṣíṣe sìná (àgbèrè). Nítorí náà, ìyapa-ẹnu wà lọ́dọ̀ àwọn onímọ̀ ẹ̀sìn lórí ìtúmọ̀ “lā yankihu” tó jẹyọ nínú āyah yìí. Níwọ̀n ìgbà tí ọ̀rọ̀ sì ti rí bẹ́ẹ̀, ẹnì kan kò gbọ́dọ̀ gbógun ti ẹnì kejì rẹ̀ bí ẹnì kan bá lọ pẹ̀lú ìtúmọ̀ kan nínú àwọn ìtúmọ̀ rẹ̀. Àmọ́ ìtúmọ̀ tí ọ̀gọ̀ọ̀rọ̀ àwọn onímọ̀ ẹ̀sìn dúró lé lórí āyah yìí ni “kò níí ṣe sìná”. Èyí sì ni ìtúmọ̀ rẹ̀ nínú tírà tafsīr Tọbariy, tafsīr Ƙurtubiy, tafsīr Ibn Kathīr àti tafsīr Adwā’ul-bayān. Àlàyé tí wọ́n mú wá lórí èyí ni pé:\n Ìkíní: “kò níí ṣe sìná” ni ìtúmọ̀ tí ọmọ ‘Abbās - kí Allāhu yọ́nú sí i - fún gbólóhùn náà, kò sì túmọ̀ rẹ̀ sí “kò níí fẹ́”. Ipò tí ọmọ ‘Abbās sì wà nínú ’Islām lórí ìtúmọ̀ āyah ga tayọ àwọn akẹgbẹ́ rẹ̀.\n Ìkejì: Ọ̀ṣẹbọ lọ́kùnrin àti ọ̀ṣẹbọ lóbìnrin tó jẹyọ nínú āyah yìí ti fi hàn pé “kò níí ṣe sìná” ni a máa túmọ̀ “lā yankihu” sí nínú āyah yìí torí pé, kò wúlẹ̀ sí ìgbà kan rí tí Allāhu yọ̀ǹda fún mùsùlùmí láti fẹ́ ọ̀ṣẹbọ lọ́kùnrin àti ọ̀ṣẹbọ lóbìnrin tí ó sì wà ní ipò ọ̀ṣẹbọ.\n Nípa bẹ́ẹ̀, àwọn onímọ̀ ẹ̀sìn fi rinlẹ̀ pé, tí ọkọ àti ìyàwó bá wá bá ẹnì kejì rẹ̀ nípò onísìná lẹ́yìn ìgbéyàwó, ìgbéyàwó wọn kò bàjẹ́ àfi tí ẹni tí ọ̀rọ̀ náà bá dùn, tí ó sì pinnu láti lọ fún ìkọ̀sílẹ̀. Àti pé, onísìná lè ti ronú pìwàdà. Bí ó bá sì ti ronú pìwàdà níbi sìná, ó lè fẹ́ ẹni tí kò ṣe sìná rí rárá. \n 2. Nítorí náà, “ìyẹn” nínú gbólóhùn yìí “A sì ṣe ìyẹn ní èèwọ̀ fún àwọn onígbàgbọ́ òdodo.” ń tọ́ka sí “zinā”. Ìyẹn ni pé, “A sì ṣe zinā ṣíṣe ní èèwọ̀ fún àwọn onígbàgbọ́ òdodo.” Èyí sì ni ìtúmọ̀ rẹ̀ ní ọ̀dọ̀ àwọn onímọ̀ tí ó túmọ̀ “lā yankihu” sí “kò níí ṣe sìná”.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"al-zānī lā yankiḥu illā zāniyatan aw mush'rikatan wal-zāniyatu lā yankiḥuhā illā zānin aw mush'rikun waḥurrima dhālika ʿalā al-mu'minīna ","translations":["The fornicator","(will) not","marry","except","a fornicatress","or","a polytheist woman","and the fornicatress ","(will) not","marry her","except","a fornicator","or","a polytheist man","And is forbidden","that","to","the believers","(3)"],"transliterationArr":["al-zānī","lā","yankiḥu","illā","zāniyatan","aw","mush'rikatan","wal-zāniyatu","lā","yankiḥuhā","illā","zānin","aw","mush'rikun","waḥurrima","dhālika","ʿalā","al-mu'minīna",null],"verseTiming":[[1,0,1530],[2,1530,2020],[3,2020,3550],[4,3550,4420],[5,4420,5920],[6,5920,6400],[7,6400,8630],[8,8630,10210],[9,10210,10620],[10,10620,13970],[11,13970,14860],[12,14860,15840],[13,15840,16310],[14,16310,17010],[15,17010,18810],[16,18810,19660],[17,19660,20080],[18,20080,24715]]}}