{"name":"25:54","price":"Òun ni Ẹni tí Ó ṣẹ̀dá abara láti inú omi. Ó ṣe ìbátan ẹbí àti ìbátan àna fún un, Olúwa rẹ sì ń jẹ́ Alágbára.¹","arabic":"وَهُوَ ٱلَّذِي خَلَقَ مِنَ ٱلۡمَآءِ بَشَرٗا فَجَعَلَهُۥ نَسَبٗا وَصِهۡرٗاۗ وَكَانَ رَبُّكَ قَدِيرٗا","category":["25 (Al-Furqan)","Al-Furqan","Surah Al-Furqan","Chapter Al-Furqan","Furqan","Surah Furqan","Chapter Furqan","Al Furqan","Surah Al Furqan","Chapter Al Furqan","Surah 25","Chapter 25","The Criterion","الفُرقان"],"ayahNumber":2909,"juzNumber":19,"footnotes":"1. Ìṣẹ̀dá ènìyàn wáyé nípasẹ̀ oríṣi ọ̀nà mẹ́rin ọ̀tọ̀ọ̀tọ̀. Ìkíní; nípasẹ̀ erùpẹ̀. Èyí sì ni Allāhu Ẹlẹ́dàá fi ṣe ẹ̀dá bàbá wa àkọ́kọ́, Ànábì Ādam - kí ọlà Allāhu máa bá a -. Nítorí náà, ìgbàkígbà tí Allāhu Ẹlẹ́dàá bá ń ki ìṣẹ̀dá wa kan erùpẹ̀ nítorí ti Ànábì Ādam ni - kí ọlà Allāhu máa bá a -. \n Ìkejì; nípasẹ̀ ẹfọ́nhà. Èyí sì ni Allāhu Ẹlẹ́dàá fi ṣe ẹ̀dá ìyá wa àkọ́kọ́, Hawā’ - kí Allāhu yọ́nú sí i -. Nítorí náà, ìgbàkígbà tí = \n = Allāhu Ẹlẹ́dàá bá ń kí ìṣẹ̀dá àwọn obìnrin kan àwa ọkùnrin, nítorí ti Hawā’ ni - kí Allāhu yọ́nú sí i -. \n Ìkẹta; nípasẹ̀ omi àtọ̀. Èyí si ni Allāhu Ẹlẹ́dàá fi ṣe ẹ̀dá èmi àti ẹ̀yin. Nítorí náà, ìgbàkígbà tí Allāhu Ẹlẹ́dàá bá ń ki ìṣẹ̀dá wa kan omi nítorí ti èmi àti ẹ̀yin ni. \n Ìkẹrin; nípasẹ̀ atẹ́gùn ẹ̀mí àti gbólóhùn “kunfayakūn” Rẹ̀. Èyí sì ni Allāhu Ẹlẹ́dàá fi ṣe ẹ̀dá ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a -. \n Kíyè sí i! Àti ìkíní àti ìkejì àti ìkẹta, kò sí ènìyàn kan tí kò ní atẹ́gùn ẹ̀mí lára ṣíwájú kí ó tó di abẹ̀mí. Ṣebí atẹ́gùn ẹ̀mí tí Allāhu ṣẹ̀ṣẹ̀ fi rán mọlāika Jibril - kí ọlà Allāhu máa bá a - sí Mọryam, ìyá Ànábì ‘Īsā - kí ọlà Allāhu máa bá a - ni Allāhu fúnra Rẹ̀ fẹ́ sínú ọbọrọgidi Ādam - kí ọlà Allāhu máa bá a -. Èyí kò sì sọ Ànábì Ādam di olúwa àti olùgbàlà. Báwo ni Ànábì ‘Īsā - kí ọlà Allāhu máa bá a - yó ṣe wá jẹ́ olúwa àti olùgbàlà! Kò sì sí ènìyàn tàbí ẹ̀dá kan tí Allāhu Ẹlẹ́dàá kò ni sọ gbólóhùn “kunfayakūn” fún, ṣíwájú kí ó tó máa bẹ.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"wahuwa alladhī khalaqa mina al-māi basharan fajaʿalahu nasaban waṣih'ran wakāna rabbuka qadīran ","translations":["And He","(is) the One Who","has created","from","the water","human being","and has made (for) him","blood relationship","and marriage relationship","And is","your Lord","All-Powerful","(54)"],"transliterationArr":["wahuwa","alladhī","khalaqa","mina","al-māi","basharan","fajaʿalahu","nasaban","waṣih'ran","wakāna","rabbuka","qadīran",null],"verseTiming":[[1,0,660],[2,660,1460],[3,1460,2160],[4,2160,2500],[5,2500,4810],[6,4810,5990],[7,5990,7290],[8,7290,8150],[9,8150,10260],[10,10260,11040],[11,11040,11950],[12,11950,13505]]}}