{"name":"25:51","price":"Tí ó bá jẹ́ pé A bá fẹ́ ni, A ìbá gbé olùkìlọ̀ kan dìde nínú ìlú kọ̀ọ̀kan.¹","arabic":"وَلَوۡ شِئۡنَا لَبَعَثۡنَا فِي كُلِّ قَرۡيَةٖ نَّذِيرٗا","category":["25 (Al-Furqan)","Al-Furqan","Surah Al-Furqan","Chapter Al-Furqan","Furqan","Surah Furqan","Chapter Furqan","Al Furqan","Surah Al Furqan","Chapter Al Furqan","Surah 25","Chapter 25","The Criterion","الفُرقان"],"ayahNumber":2906,"juzNumber":19,"footnotes":"1. Nínú oore àjùlọ tí Allāhu - subhānahu wa ta‘ālā - ṣe fún Ànábì wa - kí ìkẹ́ àti ọlà Allāhu máa bá a - ni pé, kò sí ànábì mìíràn ní ibikíbi ní àsìkò ìṣẹ̀mí rẹ̀ lójú ayé rẹ̀. Èyí ni àgbọ́yé āyah yìí. Àmọ́ ṣíwájú àsìkò tirẹ̀, Allāhu nìkan ló mọ iye ìgbà tí Ó fi iṣẹ́ Rẹ̀ rán Ànábì méjì tàbí mẹ́ta tàbí jù bẹ́ẹ̀ lọ ní àsìkò kan-ùn nínú ìjọ ọ̀tọ̀ọ̀tọ̀. Bí àpẹ̀ẹrẹ, àsìkò kan-ùn ni àsìkò Ànábì ’Ibrọ̄hīm àti Ànábì Lūt, àsìkò kan-ùn ni àsìkò Ànábì Ṣu‘aeb, Ànábì Mūsā àti Ànábì Hārūn - kí ọlà Allāhu máa bá wọn -. \n Síwájú sí i, oore àjùlọ yìí ló fi jẹ́ pé, gbogbo ayé pátápátá ni Allāhu rán Ànábì wa - kí ìkẹ́ àti ọlà Allāhu máa bá a - níṣẹ́ sí, = \n = elédè Lárúbáwá àti elédè mìíràn, ènìyàn àti àlùjọ̀nnú. (sūrah āl-‘Imrọ̄n; 3:110, sūrah al-’An‘ām; 6:19, surah al-Jinn; 72:1 àti sūrah al-’Anbiyā’; 21:107.) Àmọ́ ṣíwájú àsìkò Ànábì wa - kí ìkẹ́ àti ọlà Allāhu máa bá a - ìjọ Ànábì kọ̀ọ̀kan gbọ́dọ̀ jẹ́ elédè Ànábì rẹ̀ nìkan. Èyí ni ó jẹyọ nínú sūrah ’Ibrọ̄hīm; 14:4.\n Bákan náà, nínú oore àjùlọ tí Allāhu ṣe fún Ànábì wa - kí ìkẹ́ àti ọlà Allāhu máa bá a - ni pé, kò níí sí ànábì mìíràn mọ́ ní ibikíbi lẹ́yìn ikú Ànábì wa - kí ìkẹ́ àti ọlà Allāhu máa bá a - títí di òpin ayé. Ẹ wo ìtọsẹ̀-ọ̀rọ̀ sūrah al-’Ahzāb; 33:40.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"walaw shi'nā labaʿathnā fī kulli qaryatin nadhīran ","translations":["And if","We willed","surely, We (would) have raised","in","every","town","a warner","(51)"],"transliterationArr":["walaw","shi'nā","labaʿathnā","fī","kulli","qaryatin","nadhīran",null],"verseTiming":[[1,0,630],[2,630,1590],[3,1590,2830],[4,2830,3290],[5,3290,3930],[6,3930,4940],[7,4940,7425]]}}