{"name":"28:46","price":"Ìwọ kò sì sí ní ẹ̀bá àpáta náà, nígbà tí A pèpè, ṣùgbọ́n ó jẹ́ ìkẹ́ kan láti ọ̀dọ̀ Olúwa rẹ nítorí kí o lè ṣèkìlọ̀ fún àwọn ènìyàn tí olùkìlọ̀ kan kò wá bá rí ṣíwájú rẹ nítorí kí wọ́n lè lo ìrántí.¹","arabic":"وَمَا كُنتَ بِجَانِبِ ٱلطُّورِ إِذۡ نَادَيۡنَا وَلَٰكِن رَّحۡمَةٗ مِّن رَّبِّكَ لِتُنذِرَ قَوۡمٗا مَّآ أَتَىٰهُم مِّن نَّذِيرٖ مِّن قَبۡلِكَ لَعَلَّهُمۡ يَتَذَكَّرُونَ","category":["28 (Al-Qasas)","Al-Qasas","Surah Al-Qasas","Chapter Al-Qasas","Qasas","Surah Qasas","Chapter Qasas","Al Qasas","Surah Al Qasas","Chapter Al Qasas","Surah 28","Chapter 28","The Stories","القَصَص"],"ayahNumber":3298,"juzNumber":20,"footnotes":"1. Ànábì ’Ibrọ̄hīm - kí ọlà Allāhu máa bá a - àti àkọ́bí rẹ̀ Ànábì ’Ismā‘īl - kí ọlà Allāhu máa bá a - dé ìlú Mọkkah ṣíwájú Ànábì wa Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a -, àmọ́ kì í ṣe pé Allāhu rán wọn níṣẹ́ sí ará ìlú Mọkkah. Bẹ́ẹ̀ náà ni èyíkéyìí Ànábì Ọlọ́hun tí ìtàn bá sọ nípa rẹ̀ pé ó dé ìlú Mọkkah tàbí ìlú mìíràn nínú àwọn ìlú Lárúbáwá. Ó lè dé ibẹ̀ rí, àmọ́ Allāhu kò rán an níṣẹ́ sí wọn. Bí àpẹ̀ẹrẹ, Ànábì ‘Ismā‘īl gan-an - kí ọlà Allāhu máa bá a - tí wọ́n gbé wá wò láti òpóǹló nínú ìlú Mọkkah, Allāhu – tó ga jùlọ - kò kúkú rán an níṣẹ́ sí ìran Lárúbáwá ní àpapọ̀ tàbí sí ìlú kan nínú ìlú àwọn Lárúbáwá. Àmọ́ Allāhu - tó ga jùlọ - rán an níṣẹ́ sí ọ̀wọ́ ẹbí rẹ̀ nínú ìdílé ìyàwó rẹ̀ tó jẹ́ Lárúbáwá. Ìyẹn sì ni àwọn ènìyàn rẹ̀ àti ìjọ rẹ̀. Èyí wà ní ìbámu sí sūrah Mọryam; 19:54-55. \n Bákan náà, tòhun ti bí Ànábì Mūsā - kí ọlà Allāhu máa bá a - ṣe jẹ́ Òjíṣẹ́ tí wọ́n fún ní tírà Taorāt, iṣẹ́ jíjẹ́ rẹ̀ àti òfin rẹ̀ kò kúkú kan àwọn ènìyàn Kidr - kí Allāhu yọ́nú sí i -. Kódà Ànábì Mūsā - kí ọlà Allāhu máa bá a - ìbá tí mọ̀ pé àwọn ènìyàn kan tún wà ní àyè mìíràn lábẹ́ Kidr tí kò bá jẹ́ pé Allāhu pa á láṣẹ láti ṣàbẹ̀wò sí ọ̀dọ̀ rẹ̀. \n Wàyí bí a ṣe rí àwọn āyah kan tó ń fi rinlẹ̀ pé kò sí ìjọ tí Allāhu kò rán Ànábì tàbí Òjíṣẹ́ kan sí (gẹ́gẹ́ bí ó ṣe rinlẹ̀ nínú sūrah ar-Ra‘d; 13:7, sūrah an-Nahl; 16:36 àti sūrah Fātir; 35:24) bẹ́ẹ̀ náà l’a rí àwọn āyah mìíràn tó ń fi rinlẹ̀ pé Allāhu kò rán Òjíṣẹ́ tàbí Ànábì kan rí sí àwọn Lárúbáwá (gẹ́gẹ́ bí ó ṣe rinlẹ̀ nínú sūrah al-Ƙọsọs; 28:46, sūrah Saba’; 34:44, sūrah as-Sajdah; 32:3 àti sūrah Yāsīn; 36:6.) \n Ẹ rántí àlàyé tí mo mú wá lórí iṣẹ́ jíjẹ́ tí Allāhu fi rán Òjíṣẹ́ Rẹ̀ ’Isma‘īl - kí ọlà Allāhu máa bá a - àti iṣẹ́ jíjẹ́ tí Allāhu fi rán Òjíṣẹ́ Rẹ̀ Mūsā - kí ọlà Allāhu máa bá a -. Lẹ́yìn náà, àgbọ́yé tó wà nínú àwọn āyah tó wá lórí àìsí Òjíṣẹ́ fún àwọn Lárúbáwá ni pé, kò sí Òjíṣẹ́ kan tí Allāhu gbé dìde láààrin wọn sí gbogbo ìran wọn ní àpapọ̀. Bí ó tilẹ̀ jẹ́ pé àwọn Lárúbáwá ní àǹfààní láti gbọ́ nípa Ànábì ’Ibrọ̄hīm àti ọmọ rẹ̀ Ànábì ’Ismọ̄‘īl pé, Allāhu rán wọn níṣẹ́ sí àwọn ènìyàn kan, àti pé àwọn méjèèjì ni wọ́n mọ Ilé Kaaba ga sókè, àwọn ìran Lárúbáwá tún ní àǹfààní láti rìn kan àwọn ọmọ ’Isrọ̄’īl. Nípasẹ̀ èyí, wọ́n tún gbúròó gbọ́ nípa òǹkà púpọ̀ nínú àwọn Òjíṣẹ́ ọmọ ’Isrọ̄’īl, ní pàtàkì jùlọ nípa Ànábì Mūsā - kí ọlà Allāhu máa bá a -àti Ànábì ‘Īsā - kí ọlà Allāhu máa bá a -, àmọ́ kì í ṣe pé àwọn wọ̀nyí jẹ́ Ànábì Lárúbáwá. Paríparí rẹ̀ ni pé, ìgbà pípẹ́ gbọọrọ tún wà láààrin ìgbà tí Allāhu gbé Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - gun sánmọ̀ lọ láàyè àti ìgbà tí Allāhu gbé Ànábì ìkẹ́yìn dìde, ìyẹn Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a -, gẹ́gẹ́ bí èyí ṣe rinlẹ̀ nínú sūrah al-Mọ̄’idah; 5:19. \n Ìdí nìyí tí àwọn onímọ̀ ẹ̀sìn fi sọ pé, irúfẹ́ àwọn ènìyàn to ṣẹ̀mí láààrin ìgbà náà ni wọ́n ń pè ní “’ahlu-l-fatrah”. Ọjọ́ Àjíǹde sì ni Allāhu máa tó yanjú ọ̀rọ̀ wọn. Allāhu - tó ga jùlọ - kúkú nímọ̀ nípa ẹni tí ó máa tẹ̀lé Òjíṣẹ́ àti ẹni tí kò níí tẹ̀lé e nínú wọn bí Ó bá jẹ́ pé Allāhu tètè rán Òjíṣẹ́ níṣẹ́ sí wọn. Àpẹ̀ẹrẹ wọn tún ni àwọn ọmọdé tó kú ṣíwájú bíbàlágà. Allāhu ti nímọ̀ nípa ohun tí wọ́n máa ṣe tí wọ́n bá dàgbà. Èyí ni òdodo ọ̀rọ̀ nípa ìdájọ́ àwọn “’ahlu-l-fatrah”, ìyẹn àwọn tó ti kú ṣíwájú iṣẹ́ jíjẹ́ Ànábì Muhammad - kí ọlà Allāhu máa bá a - àti àwọn ènìyàn mìíràn tó ti kú ṣíwájú tiwọn àti ṣíwájú kí Allāhu tó gbé Ànábì dìde fún wọn. \n Kíyè sí i, Allāhu Ẹlẹ́dàá ti fi àdámọ́ òye àtinúwá sára gbogbo ẹ̀dá Rẹ̀ láti jìnnà sí jíjọ̀sìn fún òrìṣà nítorí gbogbo ẹ̀dá l’ó ní òye pé kì í ṣe òrìṣà ni ẹlẹ́dàá àwọn, àmọ́ kò sí òye àtinúwá fún ìmọ̀ nípa bí wọ́n máa ṣe jọ́sìn fún Allāhu Ẹlẹ́dàá wọn àfi kí wọ́n ní Òjíṣẹ́ kan tó máa jẹ́ aṣíwájú fún wọn gẹ́gẹ́ bí olùkọ́ni rere. Ìdí nìyí tí Allāhu fi gbé Ànábì Muhammad - kí ọlà Allāhu máa bá a - dìde ní àrà ọ̀tọ̀. Ìtúmọ̀ “ní àrà ọ̀tọ̀” ni pé, dípò kí ó jẹ́ Ànábì fún ìran Lárúbáwá nìkan gẹ́gẹ́ bí ìkọ̀ọ̀kan àwọn Ànábì tó ṣíwájú rẹ̀ ṣe jẹ́, ńṣe ni Allāhu, nínú ọlá Rẹ̀, ṣe é ni Ànábì gbogbo ayé pátápátá. Allāhu tí Ó ṣe ìṣẹ̀dá Ànábì ‘Īsā ọmọ Mọryam ní àrà ọ̀tọ̀ nípasẹ̀ àìlo àtọ̀ ọkùnrin kan kan fún ìṣẹ̀dá rẹ̀ ní ìyàtọ̀ sí ìkọ̀ọ̀kan àwọn Òjíṣẹ́ tó ṣíwájú rẹ̀, Allāhu l’Ó kúkú ṣe Ànábì Muhammad ní Òjíṣẹ́ gbogbo ayé, tí kò sì sí Òjíṣẹ́ kan tí Allāhu ṣe bẹ́ẹ̀ rí fún ṣíwájú rẹ̀. Nítorí náà, Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - ni Ànábì àti Òjíṣẹ́ àkọ́kọ́ fún ẹbí rẹ̀ àti ìran rẹ̀, ìran Lárúbáwá, gẹ́gẹ́ bí ó tún ṣe jẹ́ Ànábì àti Òjíṣẹ́ Ìkẹ́yìn fún àpapọ̀ Lárúbáwá àti àwọn elédè mìíràn pátápátá. Wallāhu ’a‘lam.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"wamā kunta bijānibi al-ṭūri idh nādaynā walākin raḥmatan min rabbika litundhira qawman mā atāhum min nadhīrin min qablika laʿallahum yatadhakkarūna ","translations":["And not","you were","at (the) side","(of) the Tur","when","We called","But","(as) a mercy","from","your Lord","so that you warn","a people","not","(had) come to them","any","warner","before you","before you","so that they may","remember","(46)"],"transliterationArr":["wamā","kunta","bijānibi","al-ṭūri","idh","nādaynā","walākin","raḥmatan","min","rabbika","litundhira","qawman","mā","atāhum","min","nadhīrin","min","qablika","laʿallahum","yatadhakkarūna",null],"verseTiming":[[1,0,850],[2,850,2420],[3,2420,3520],[4,3520,4370],[5,4370,4820],[6,4820,6140],[7,6140,7030],[8,7030,8180],[9,8180,9140],[10,9140,10320],[11,10320,12360],[12,12360,12940],[13,12940,15420],[14,15420,16590],[15,16590,17260],[16,17260,20890],[17,20890,22860],[18,22860,23570],[19,23570,26529],[20,26529,27729],[21,27729,28499],[22,28499,29839],[23,29839,31709],[24,31709,32539],[25,32539,33809],[26,33809,37324]]}}