{"name":"28:56","price":"Dájúdájú ìwọ kò lè fi ọ̀nà mọ ẹni tí o fẹ́ràn, ṣùgbọ́n Allāhu l’Ó ń fi ọ̀nà mọ ẹni tí Ó bá fẹ́.¹ Àti pé Ó nímọ̀ jùlọ nípa àwọn olùmọ̀nà.","arabic":"إِنَّكَ لَا تَهۡدِي مَنۡ أَحۡبَبۡتَ وَلَٰكِنَّ ٱللَّهَ يَهۡدِي مَن يَشَآءُۚ وَهُوَ أَعۡلَمُ بِٱلۡمُهۡتَدِينَ","category":["28 (Al-Qasas)","Al-Qasas","Surah Al-Qasas","Chapter Al-Qasas","Qasas","Surah Qasas","Chapter Qasas","Al Qasas","Surah Al Qasas","Chapter Al Qasas","Surah 28","Chapter 28","The Stories","القَصَص"],"ayahNumber":3308,"juzNumber":20,"footnotes":"1. “Hidāyah” túmọ̀ sí ìwọ̀nyí: \n (1) Ìfẹsẹ̀rinlẹ̀ nínú ẹ̀sìn ’Islām, gẹ́gẹ́ bí èyí ṣe jẹyọ nínú àdúà nínú sūrah al-Fātihah; 1:6. \n (2) Ṣíṣí ọkàn ẹ̀dá payá fún gbígba ẹ̀sìn ’Islām. Kò sí èyí lọ́wọ́ ẹnì kan àfi Allāhu Afinimọ̀nà nítorí pé, ọwọ́ Rẹ̀ ni ọkàn ẹ̀dá wà. Hidayah tó ń túmọ̀ sí ìṣípayá ọkàn fún gbígbà ẹ̀sìn ’Islām, òhun l’ó jẹyọ ní àyè yìí, ìyẹn sūrah al-Ƙọs̱ọs̱; 28:56 àti nínú sūrah al-Hajj; 22:24 pẹ̀lú sūrah az-Zukruf; 43:40. \n (3) Fífi al-Ƙur’ān àti sunnah ṣàlàyé ìmọ̀nà sí ọ̀nà tààrà ’Islām, gẹ́gẹ́ bí èyí ṣe jẹyọ nínú sūrah aṣ-Ṣūrọ̄; 42:52. \n (4) Títọ́ka ènìyàn sí ibì kan tàbí fífi ojú-ọ̀nà kan mọ ènìyàn, gẹ́gẹ́ bí èyí ṣe jẹyọ nínú sūrah as-Sọffāt; 37:23. Nítorí náà, kókó ọ̀rọ́ ni pé, Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - jẹ́ olùtọ́ni-sọ́nà pẹ̀lú al-Ƙur’ān àti sunnah rẹ̀ fún gbogbo ẹ̀dá, ṣùgbọ́n Allāhu - mímọ́ ni fún Un - ni Olùtọ́ni-sọ́nà pẹ̀lú ìṣípayá-ọkàn fún ẹni tí Allāhu bá fẹ́ nítorí pé, àdéhùn Rẹ̀ ni pé, igun kan fún Ọgbà Ìdẹ̀ra, igun kan fún Ọgbà Iná.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"innaka lā tahdī man aḥbabta walākinna al-laha yahdī man yashāu wahuwa aʿlamu bil-muh'tadīna ","translations":["Indeed, you","(can) not","guide","whom","you love","but","Allah","guides","whom","He wills","And He","(is) most knowing","(of) the guided ones","(56)"],"transliterationArr":["innaka","lā","tahdī","man","aḥbabta","walākinna","al-laha","yahdī","man","yashāu","wahuwa","aʿlamu","bil-muh'tadīna",null],"verseTiming":[[1,0,1520],[2,1520,1910],[3,1910,2850],[4,2850,3260],[5,3260,4290],[6,4290,6000],[7,6000,6890],[8,6890,7830],[9,7830,8090],[10,8090,12040],[11,12040,12590],[12,12590,13500],[13,13500,17925]]}}