{"name":"29:21","price":"Ó ń jẹ ẹni tí Ó bá fẹ́ níyà. Ó sì ń kẹ́ ẹni tí Ó bá fẹ́. Ọ̀dọ̀ Rẹ̀ sì ni wọn yóò da yín padà sí.¹","arabic":"يُعَذِّبُ مَن يَشَآءُ وَيَرۡحَمُ مَن يَشَآءُۖ وَإِلَيۡهِ تُقۡلَبُونَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut","Chapter Al-Ankabut","Ankabut","Surah Ankabut","Chapter Ankabut","Al Ankabut","Surah Al Ankabut","Chapter Al Ankabut","Surah 29","Chapter 29","The Spider","العَنكَبُوت"],"ayahNumber":3361,"juzNumber":20,"footnotes":"1. “Mọṣī’atu-llāh” Fífẹ́bẹ́ẹ̀ Allāhu: Èyí lè jẹyọ nínú àwọn awẹ́ gbólóhùn wọ̀nyí; “ ’in ṣā-Allāh” - “tí Allāhu bá fẹ́”, tàbí “mọ̄ ṣā-Allāh” - “ohun tí Allāhu bá fẹ́” tàbí “mọn ṣā-Allāh” - “ẹni tí Allāhu bá fẹ́”. Àpapọ̀ rẹ̀ ní àpólà ọ̀rọ̀-orúkọ ni “mọṣī’tu-llāh” - fífẹ́bẹ́ẹ̀ Allāhu. Lẹ́yìn náà, ọ̀kan pàtàkì lára ìròyìn Allāhu ni “mọṣī’ah” fífẹ́bẹ́ẹ̀. Bí ó tilẹ̀ jẹ́ pé ẹ̀dá gan-an fúnra rẹ̀ gbàròyìn pẹ̀lú fífẹ́bẹ́ẹ̀, ìyẹn ni pé, ẹ̀dá náà ń ṣe n̄ǹkan tí ó bá fẹ́ ṣe, fífẹ́bẹ́ẹ̀ ti Allāhu - Ọba tó ga jùlọ - l’ó wà lókè fífẹ́bẹ́ẹ̀ ti ẹ̀dá. Èyí túmọ̀ sí pé, ohun tí Allāhu bá fẹ́ l’ó máa ṣẹlẹ̀, kódà kí ẹ̀dá má fẹ̀ẹ́ bẹ́ẹ̀. Ohun tí ẹ̀dá bá sì fẹ́, tí Allāhu kò bá fẹ́, kò níí ṣẹlẹ̀. Lẹ́yìn náà, ìwọ̀nyí ni àpẹ̀ẹrẹ fún fífẹ́bẹ́ẹ̀ Allāhu - Ọba tó ga jùlọ - :\n Ìkíní: Fífẹ́bẹ́ẹ̀ Allāhu nínú kádàrá. Ìtúmọ̀ èyí ni pé, ohunkóhun tí ẹ̀dá bá rí ṣe nílé ayé nínú iṣẹ́ rere tàbí iṣẹ́ aburú, ó jẹ́ ohun tí Allāhu fẹ́ bẹ́ẹ̀ fún ẹ̀dá náà nínú kádàrá rẹ̀ nítorí pé, tibi-tire ni kádàrá ẹ̀dá. Fífẹ́bẹ́ẹ̀ yìí ni à ń pè ní “mọṣī’atu-llāhi al-kaoniyyah” “fífẹ́bẹ́ẹ̀ Allāhu tayé”. Bí àpẹ̀ẹrẹ, lágbájá fẹ́ di olówó lọ́nà ẹ̀tọ́, ó sì di olówó, Allāhu fẹ́ bẹ́ẹ̀ fún un ni nínú kádàrá rẹ̀. Ó sì máa tún gba ẹ̀san rere lọ́dọ̀ Allāhu lórí wíwá owó lọ́nà ẹ̀tọ́. Ní ìdà kejì, tàmẹ̀dùn fẹ́ di olówó lọ́nà àìtọ́, ó sì di olówó, Allāhu fẹ́ bẹ́ẹ̀ fún un ni nínú kádàrá rẹ̀. Àmọ́ ó máa gba ẹ̀san aburú lọ́dọ̀ Allāhu lórí wíwá owó lọ́nà àìtọ́. \n Ìkejì: Fífẹ́bẹ́ẹ̀ Allāhu nínú òfin. Ìtúmọ̀ èyí ni pé, ohunkóhun tí Allāhu bá pa láṣẹ fún ẹ̀dá láti ṣe àti ohunkóhun tí Allāhu bá kọ̀ fún ẹ̀dá láti ṣe nínú àwọn tírà sánmọ̀ tí Ó sọ̀kalẹ̀ fún àwọn Ànábì Rẹ̀ àti àwọn Òjíṣẹ́ Rẹ̀ - kí ìkẹ́ àti ọlà Allāhu máa bá a -, ó jẹ́ ohun tí Allāhu fẹ́ bẹ́ẹ̀ fún ẹ̀dá nínú òfin àti ìlànà Rẹ̀. Allāhu kò sì níí fẹ́ òfin àti ìlànà kan bẹ́ẹ̀ nínú Tírà Rẹ̀ tó sọ̀kalẹ̀ fún wa àfi kí ó jẹ́ rere pọ́nńbélé tàbí kí rere rẹ̀ tẹ̀wọ̀n ju aburú rẹ̀. Fífẹ́bẹ́ẹ̀ yìí ni à ń pè ní “mọṣī’atu-llāhi aṣ-ṣẹr‘iyyah” “fífẹ́bẹ́ẹ̀ Allāhu tòfin”. Bí àpẹ̀ẹrẹ, lágbájá fẹ́ di mùsùlùmí, ó sì di mùsùlùmí, Allāhu fẹ́ bẹ́ẹ̀ fún un ni nínú òfin àti ìlànà Rẹ̀ nínú Tírà Rẹ̀. Ní ìdà kejì, tàmẹ̀dùn fẹ́ di kèfèrí, ó sì di kèfèrí. Allāhu kò fẹ́ bẹ́ẹ̀ fún un nínú òfin àti ìlànà = = Rẹ̀, àmọ́ Ó fẹ́ bẹ́ẹ̀ fún un nínú kádàrá rẹ̀. Pẹ̀lú àlàyé òkè yìí, gbogbo fífẹ́bẹ́ẹ̀ Allāhu nínú òfin Rẹ̀ ni okùnfà ìyọ́nú Rẹ̀. \n Fífẹ́bẹ́ẹ̀ Allāhu, yálà fífẹ́bẹ́ẹ̀ Rẹ̀ nínú kádàrá tàbí fífẹ́bẹ́ẹ̀ Rẹ̀ nínú òfin Rẹ̀, méjèèjì l’ó dúró sórí “ ‘adl” àti “ fọdl” - déédé àti ọlá. Àlàyé èyí ni pé, tí ìyà bá jẹ́ lágbájá nílé ayé tàbí ní ọ̀run, Allāhu fẹ́ bẹ́ẹ̀ ni nínú kádàrá tí Ó kọ lé lágbájá lórí. Èyí sì jẹ́ déédé láti ọ̀dọ̀ Allāhu nítorí pé, Allāhu kì í ṣe àbòsí sí ẹ̀dá Rẹ̀. Bákan náà, tí ìkẹ́ kan bá tẹ tàmẹ̀dùn lọ́wọ́ nílé ayé tàbí ní ọ̀run, Allāhu fẹ́ bẹ́ẹ̀ ni nínú kádàrá tí Ó kọ lé tàmẹ̀dùn lórí. Èyí sì jẹ́ ọlá láti ọ̀dọ̀ Allāhu nítorí pé, Allāhu l’Ó ni gbogbo ọlá. \n Kíyè sí i, fífẹ́bẹ́ẹ̀ Allāhu - subhānahu wa ta‘ālā - lórí ẹ̀dá ní ọ̀run kò túmọ̀ sí pé Allāhu máa fi kó àwọn onígbàgbọ́ òdodo wọ inú Iná tàbí pé ó máa fi kó àwọn aláìgbàgbọ́ wọ inú Ọgbà Ìdẹ̀ra nítorí pé, fífẹ́bẹ́ẹ̀ Allāhu kò níí sọ Allāhu di olùyapa àdéhùn Rẹ̀. Ó ti ṣe àdéhùn Ọgbà Ìdẹ̀ra fún àwọn onígbàgbọ́ òdodo. Ó sì ti ṣe àdéhùn Iná fún àwọn aláìgbàgbọ́. Òdodo sì ni àdéhùn Rẹ̀. Tí Allāhu bá wá yọ ẹnì kan kúrò nínú Iná, láì jẹ́ onígbàgbọ́ òdodo, ẹnu ẹni kẹ́ni kò gbà á láti fi ẹ̀sùn kan Allāhu lórí fífẹ́bẹ́ẹ̀ Rẹ̀ lórí ẹ̀dá rẹ̀. Ṣebí nílé ayé yìí gan-an, láti inú ìdílé ẹrú, tí Allāhu bá sọ ẹrú di ọba lábẹ́ fífẹ́bẹ́ẹ̀ Rẹ̀, ta ni ó máa mú Allāhu sí i? Kò sí. Bákan náà, láti inú ìdílé ọba, tí Allāhu bá sọ ọba di ẹrú lábẹ́ fífẹ́bẹ́ẹ̀ Rẹ̀, ta ni ó máa mú Allāhu sí i? Kò sí. Nítorí náà, ọpẹ́ púpọ̀ ni kí a máa dá fún Allāhu lórí bí fífẹ́bẹ́ẹ̀ Rẹ̀ lórí wa ṣe ń ṣe wẹ́kú ohun rere tí à ń fẹ́.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"yuʿadhibu man yashāu wayarḥamu man yashāu wa-ilayhi tuq'labūna ","translations":["He punishes","whom","He wills","and has mercy","(on) whom","He wills","and to Him","you will be returned","(21)"],"transliterationArr":["yuʿadhibu","man","yashāu","wayarḥamu","man","yashāu","wa-ilayhi","tuq'labūna",null],"verseTiming":[[1,0,1040],[2,1040,1340],[3,1340,4780],[4,4780,5770],[5,5770,5910],[6,5910,9690],[7,9690,11140],[8,11140,14385]]}}