{"name":"29:45","price":"Ké ohun tí A fi ránṣẹ́ sí ọ nínú Tírà. Kí o sì kírun. Dájúdájú ìrun kíkí ń kọ ìwà ìbàjẹ́ àti aburú. Àti pé ìrántí Allāhu tóbi jùlọ. Allāhu sì mọ ohun tí ẹ̀ ń ṣe.¹","arabic":"ٱتۡلُ مَآ أُوحِيَ إِلَيۡكَ مِنَ ٱلۡكِتَٰبِ وَأَقِمِ ٱلصَّلَوٰةَۖ إِنَّ ٱلصَّلَوٰةَ تَنۡهَىٰ عَنِ ٱلۡفَحۡشَآءِ وَٱلۡمُنكَرِۗ وَلَذِكۡرُ ٱللَّهِ أَكۡبَرُۗ وَٱللَّهُ يَعۡلَمُ مَا تَصۡنَعُونَ","category":["29 (Al-Ankabut)","Al-Ankabut","Surah Al-Ankabut","Chapter Al-Ankabut","Ankabut","Surah Ankabut","Chapter Ankabut","Al Ankabut","Surah Al Ankabut","Chapter Al Ankabut","Surah 29","Chapter 29","The Spider","العَنكَبُوت"],"ayahNumber":3385,"juzNumber":20,"footnotes":"1. Gbólóhùn yìí “ولذكر الله أكبر” (wala thikru-llāh ’akbar) jẹ́ gbólóhùn tí àwọn onímọ̀ fún ní ìtúmọ̀ bíi márùn-ún. \n Ìtúmọ̀ kìíní: Ẹ̀san tí Allāhu máa fún yín lórí ìjọ́sìn tóbi ju bí ẹ ṣe jọ́sìn fún Un. \n Ìtúmọ̀ kejì: Mímú àwọn gbólóhùn ìrántí Allāhu wá, àwọn gbólóhùn bíi subhān-Allāh, al-hamdulillāh, Allāhu ’akbar, kíké al-Ƙur’ān àti bẹ́ẹ̀ bẹ́ẹ̀ lọ, ó tóbi ní ẹ̀san ju dídúró nìkan, dídáwọ́ tẹ orúnkún nìkan, fíforí kanlẹ̀ nìkan, kíkó ẹnuró nìkan (ìyẹn, ààwẹ̀ gbígbà), lílọ sí ojú ogun ẹ̀sìn nìkan àti bẹ́ẹ̀ bẹ́ẹ̀ lọ, ìyẹn nígbà tí ṣíṣe àwọn n̄ǹkan wọ̀nyí kò bá kó ṣíṣe ọ̀kan-ò-jọ̀kan àwọn gbólóhùn ìrántí Allāhu t’ó tọ sunnah sínú. Ìyẹn ni pé, ohun tí ó lóòrìn jùlọ nínú ìjọ́sìn ẹlẹ́kajẹ̀ka ní àwọn gbólóhùn ìrántí Allāhu, tí ẹ̀dá rí mú wá nínú ẹka ìjọ́sìn náà. \n Ìtúmọ̀ kẹta: Ó kó ìtúmọ̀ kìíní àti ìkejì sínú papọ̀. Ìyẹn ni pé, bí ẹ̀san ìjọ́sìn ṣe tóbi ju ìjọ́sìn lọ, bẹ́ẹ̀ náà ni pé ohun tí ó lóòrìn jùlọ nínú ìjọ́sìn ni àwọn gbólóhùn ìrántí Allāhu, èyí tí a rí mú wá nínú ìjọ́sìn náà. \n Ìtúmọ̀ kẹrin: Ẹ̀san tí Allāhu máa fún ẹrúsìn lórí ìrun kíkí tóbi ju ìrun tí ó kí lọ. Ìyàtọ̀ díẹ̀ ni ó wà nínú ìtúmọ̀ kìíní àti ìkẹrin yìí. Ìkíní ń sọ nípa ẹ̀san ìjọ́sìn ní àpapọ̀, ṣùgbọ́n ìtúmọ̀ kẹ́rin ń sọ nípa ẹ̀san ìrun kíkí nìkan. \n Ìtúmọ̀ karùn-ún: Ẹ̀san ìrun kíkí àti ẹ̀san mímú gbólóhùn ìrántí Allāhu wá lórí ìrun, ó tóbi jú bí ìrun kíkí ṣe ń kọ ìwà ìbàjẹ́ àti aburú fún ẹ̀dá. Ìyẹn ni pé, bí ìrun kíkí ṣe ní ẹ̀san, bẹ́ẹ̀ náà ló tún jẹ́ ohun t’ó ń mú olùkírun jìnnà sí ìwà aburú, ṣùgbọ́n abala ẹ̀san kò ṣe é fojú rénà fún ẹni tí kò yé hùwà aburú. Bí ẹ̀san ìrun kíkí rẹ̀ yó ṣe mọ l’ó máa mọ, kódà kí aburú rẹ̀ kó gbogbo ẹ̀san ìjọ́sìn rẹ̀ tán = = nílẹ̀, olùkírun t’ó ń hùwà ìbàjẹ́ kò lè di èrò inú Iná gbére, tí ọ̀rọ̀ rẹ̀ bá padà já sí Iná. Ó sì máa padà wọ inú Ọgbà Ìdẹ̀ra gbére. Ìyẹn rí bẹ́ẹ̀ níwọ̀n ìgbà tí mímú Allāhu ní ọ̀kan ṣoṣo tí a gbọ́dọ̀ jọ́sìn fún ní ọ̀nà òdodo kò bá ti ròpọ̀ mọ́ sísọ ẹ̀dá kan di akẹgbẹ́ fún Un, èyí tí a mọ̀ sí ẹbọ ńlá “aṣ-ṣirku al-’akbar”, tàbí ṣíṣe àìgbàgbọ́ nínú Allāhu “al-kufru al-mukriju minal-millah” àti ṣíṣe ìṣọ̀bẹ-ṣèlu nínú àdìsọ́kàn “an-nifāƙ al-’i‘tiƙọ̄di”. \n Wàyí, nínú àwọn ìtúmọ̀ márààrùn-ún òkè wọ̀nyí, ìtúmọ́ kìíní l’ó gbòòrò jùlọ. Òhun sì ni ìtúmọ̀ tí tafsīr Tọbariy fara mọ́ jùlọ. \n Kíyè sí i, kò sí ọ̀kan nínú àwọn ìtúmọ̀ márààrùn-ún òkè wọ̀nyí t’ó ní kí mùsùlùmí fi gbólóhùn ìrántí Allāhu rọ́pò ìrun kíkí, ààwẹ̀ gbígbà àti bẹ́ẹ̀ bẹ́ẹ̀ lọ. Ẹnikẹ́ni tí ó bá pa ìrun kíkí àti ààwẹ̀ gbígbà tì nípasẹ̀ fífún gbólóhùn yìí ní ìtúmọ̀ òdì, ó ti kó ìparun bá ẹ̀mí ara rẹ̀ ní ìbámu sí sūrah al-Muddaththir; 74: 42-43. Kí Allāhu là wá nínú èyí.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"ut'lu mā ūḥiya ilayka mina al-kitābi wa-aqimi al-ṣalata inna al-ṣalata tanhā ʿani al-faḥshāi wal-munkari waladhik'ru al-lahi akbaru wal-lahu yaʿlamu mā taṣnaʿūna ","translations":["Recite","what","has been revealed","to you","of","the Book","and establish","the prayer","Indeed","the prayer","prevents","from","the immorality","and evil deeds","and surely (the) remembrance","(of) Allah","(is) greatest","And Allah","knows","what","you do","(45)"],"transliterationArr":["ut'lu","mā","ūḥiya","ilayka","mina","al-kitābi","wa-aqimi","al-ṣalata","inna","al-ṣalata","tanhā","ʿani","al-faḥshāi","wal-munkari","waladhik'ru","al-lahi","akbaru","wal-lahu","yaʿlamu","mā","taṣnaʿūna",null],"verseTiming":[[1,0,730],[2,730,2650],[3,2650,3440],[4,3440,4270],[5,4270,4600],[6,4600,5720],[7,5720,6550],[8,6550,8980],[9,8980,10580],[10,10580,11660],[11,11660,12500],[12,12500,12930],[13,12930,15630],[14,15630,18110],[15,18110,19150],[16,19150,20020],[17,20020,21220],[18,21220,22250],[19,22250,23310],[20,23310,23590],[21,23590,27325]]}}