{"name":"2:106","price":"Ohunkóhun tí A bá parẹ́ (tàbí pààrọ̀) nínú āyah kan¹ tàbí tí A sọ di ìgbàgbé, A máa mú èyí tó dára jù ú lọ tàbí irú rẹ̀ wá. Ṣé ìwọ kò mọ̀ pé dájúdájú Allāhu ni Alágbára lórí gbogbo n̄ǹkan?","arabic":"۞ مَا نَنسَخۡ مِنۡ ءَايَةٍ أَوۡ نُنسِهَا نَأۡتِ بِخَيۡرٖ مِّنۡهَآ أَوۡ مِثۡلِهَآۗ أَلَمۡ تَعۡلَمۡ أَنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":113,"juzNumber":1,"footnotes":"1. Èyí ni pé, kí ìdájọ́ tí ó wà nínú āyah kan di ohun tí a ò níí lò mọ́ nítorí ìdájọ́ titun tí āyah mìíràn mú wá, gẹ́gẹ́ bí àwọn āyah ìdájọ́ kan tí ó sọ̀kalẹ̀ lẹ́yìn Hijrah (āyah Mọdaniyyah) ṣe pa ìdájọ́ àwọn āyah tí ó sọ̀kalẹ̀ ṣíwájú Hijrah (āyah Mọkiyyah) rẹ́ àti gẹ́gẹ́ bí àwọn āyah ìdájọ́ kan tí ó sọ̀kalẹ̀ nínú àwọn ọdún ìparí nínú ìlú Mọdīnah ṣe pa àwọn āyah ìdájọ́ kan tí ó sọ̀kalẹ̀ nínú àwọn ọdún ìbẹ̀rẹ̀ nínú ìlú Mọdīnah rẹ́. Àpèjúwe fífi ìdájọ́ kan pa ìdájọ́ kan rẹ́ ni kí halāl di harām tàbí kí harām di halāl, tàbí kí ọ̀ran-anyàn di sunnah tàbí kí sunnah di ọ̀ran-anyàn.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"mā nansakh min āyatin aw nunsihā nati bikhayrin min'hā aw mith'lihā alam taʿlam anna al-laha ʿalā kulli shayin qadīrun ","translations":["What","We abrogate","(of)","a sign","or","[We] cause it to be forgotten","We bring","better","than it","or","similar (to) it","Do not","you know","that","Allah","over","every","thing","(is) All-Powerful","(106)"],"transliterationArr":["mā","nansakh","min","āyatin","aw","nunsihā","nati","bikhayrin","min'hā","aw","mith'lihā","alam","taʿlam","anna","al-laha","ʿalā","kulli","shayin","qadīrun",null],"verseTiming":[[1,0,670],[2,670,2140],[3,2140,2520],[4,2520,3510],[5,3510,3840],[6,3840,5460],[7,5460,6060],[8,6060,6810],[9,6810,9840],[10,9840,10210],[11,10210,11250],[12,11250,12180],[13,12180,12990],[14,12990,14210],[15,14210,15030],[16,15030,15600],[17,15600,16200],[18,16200,17960],[19,17960,20695]]}}