{"name":"2:104","price":"Ẹ̀yin tí ẹ gbàgbọ́ ní òdodo, ẹ má sọ pé “rọ̄‘inā”. (Àmọ́) ẹ sọ pé “unṭḥurnā”¹, kí ẹ sì máa tẹ́tí gbọ́ (ọ̀rọ̀ ẹ̀sìn). Ìyà ẹlẹ́ta-eléro sì wà fún àwọn aláìgbàgbọ́.","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَقُولُواْ رَٰعِنَا وَقُولُواْ ٱنظُرۡنَا وَٱسۡمَعُواْۗ وَلِلۡكَٰفِرِينَ عَذَابٌ أَلِيمٞ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":111,"juzNumber":1,"footnotes":"1. Rọ̄‘inā jẹ́ ọ̀rọ̀ méjì; “rọ̄‘i” àti “nā”. “Nā” jẹ́ ọ̀rọ̀ arọ́pò-orúkọ ẹnì kíní ọ̀pọ̀ “wa”. “Rọ̄‘i” ní ìtúmọ̀ méjì nínú èdè Lárúbáwá àti èdè Isrā’īl. Bákan náà, “rọ̄‘i” lè jẹ́ ọ̀rọ̀-orúkọ tàbí ọ̀rọ̀-ìṣe àṣẹ nínú èdè méjèèjì. Nígbà tí wọ́n bá lo “rọ̄‘i” ní ìlò ọ̀rọ̀-orúkọ, ìtúmọ̀ rẹ̀ ni “òmùgọ̀” nítorí pé ó jẹ́ ọ̀rọ̀ ìṣẹ̀dá láti ara “ru‘ūnah” agọ̀. Àmọ́ nígbà tí wọ́n bá lo “rọ̄‘i” ní ìlò ọ̀rọ̀-ìṣe àṣẹ, ìtúmọ̀ rẹ̀ ni “kíyè sí (i), wò (ó),” nítorí pé ó jẹ́ ọ̀rọ̀ ìṣẹ̀dá láti ara “ri‘ānah” kíkíyèsí tàbí mímójútó kiní kan / ẹnì kan. Ìgbàkígbà tí àwọn yẹhudi bá lo “rọ̄‘i” fún àwọn Ànábì wọn, ìlò ọ̀rọ̀-orúkọ ni wọ́n ń gbàlérò. \n Ìyẹn túmọ̀ sí pé, tí wọ́n bá sọ fún àwọn Ànábì wọn pé “rọ̄‘inā”, ohun tí wọ́n ń gbà lérò ni pé “òmùgọ̀ wa!”. Àmọ́ nígbà tí àwọn Sọhābah - kí Allāhu yọ́nú sí wọn - bá lò “rọ̄‘inā” fún Ànábì - kí ọlà Allāhu máa bá a -, ìlò ọ̀rọ̀-ìṣe àṣẹ ni wọ́n ń gbàlérò. Ìyẹn túmọ̀ sí pé àwọn Sọhābah ń sọ pé “kí Ànábì kíyè sí wa”. Nítorí kí àwọn yẹhudi má baà ṣe lérò pé irú wọn ni àwọn Sọhābah ni Allāhu fi kọ lílo ọ̀rọ̀ yẹn fún àwọn Sọhābah - kí Allāhu yọ́nú sí wọn -, Ó sì fún wọn ní ọ̀rọ̀ mìíràn tí ó gbé ìtúmọ̀ àti èròǹgbà rere wọn jáde, tí kò sì jẹmọ́ èdè abunikù. Èyí sì ni “unṭḥurnā”. Èyí rí bẹ́ẹ̀ kí àwa mùsùlùmí lè mọ̀ pé ìlò èdè wa àti ìṣe wa kò gbọdọ̀ jọ tàwọn aláìgbàgbọ́.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"yāayyuhā alladhīna āmanū lā taqūlū rāʿinā waqūlū unẓur'nā wa-is'maʿū walil'kāfirīna ʿadhābun alīmun ","translations":["O you","who","believe[d]","(Do) not","say","Raina","and say","Unzurna","and listen","And for the disbelievers","(is) a punishment","painful","(104)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","lā","taqūlū","rāʿinā","waqūlū","unẓur'nā","wa-is'maʿū","walil'kāfirīna","ʿadhābun","alīmun",null],"verseTiming":[[1,0,2860],[2,2860,3770],[3,3770,4720],[4,4720,5050],[5,5050,6060],[6,6060,7020],[7,7020,7950],[8,7950,9410],[9,9410,10570],[10,10570,12590],[11,12590,13590],[12,13590,15805]]}}