{"name":"2:154","price":"Ẹ má ṣe pe àwọn tí wọ́n ń pa sí ojú-ọ̀nà Allāhu (ojú-ogun ẹ̀sìn) ní òkú (ìyà), àmọ́ alààyè (ẹni ìkẹ́) ni wọ́n, ṣùgbọ́n ẹ̀yin kò fura.¹","arabic":"وَلَا تَقُولُواْ لِمَن يُقۡتَلُ فِي سَبِيلِ ٱللَّهِ أَمۡوَٰتُۢۚ بَلۡ أَحۡيَآءٞ وَلَٰكِن لَّا تَشۡعُرُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":161,"juzNumber":2,"footnotes":"1. A bi ‘Abdullāh léèrè nípa āyah yìí, ‘Abdullāh sọ pé, àwa kúkú bi Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - léèrè nípa èyí, ó sì sọ pé: “Ẹ̀mí àwọn tí wọ́n kú sí ojú ogun ẹ̀sìn ’Islām yóò máa bẹ nínú agbẹ̀du ẹyẹ aláwọ̀ ewéko. Àwọn ẹyẹ náà ní àtùpà tí wọ́n gbékọ́ fún wọn s’ára Ìtẹ́-ọlá ti Allāhu. Àwọn ẹyẹ náà ń jẹ kiri síbi tí wọ́n bá fẹ́ nínú Ọgbà Ìdẹ̀ra. Lẹ́yìn náà, àwọn ẹyẹ náà yóò fara pamọ́ sídìí àwọn àtùpà wọ̀nyí. Allāhu - tó ga jùlọ - ṣíjú wò wọ́n, Ó sì sọ pé: “Ẹ̀ ń fẹ́ n̄ǹkan bí? Wọ́n sọ pé: “Kí ni n̄ǹkan tí a tún ń fẹ́? Àwa tí à ń jẹ kiri síbi tí a fẹ́ nínú Ọgbà Ìdẹ̀ra.” Allāhu ṣe bẹ́ẹ̀ pẹ̀lú wọn ní ẹ̀ẹ̀ mẹta. Ṣùgbọ́n nígbà tí wọ́n rí i pé Wọn kò fi àwọn sílẹ̀ nípa bíbi wọ́n pé kí ni n̄ǹkan tí wọ́n tún ń fẹ́, wọ́n bá sọ pé: “Olúwa, a fẹ́ kí O dá ẹ̀mí wa padà sínú ara wa, kí wọ́n lè tún wa pa ní ẹ̀ẹ̀ kan sí i sí ojú ogun ẹ̀sìn Rẹ.” Nígbà tí Allāhu rí i pé wọn kò ní bùkátà kan mọ́ (Allāhu, Onímọ̀ nípa ohun gbogbo sì ti mọ̀ ṣíwájú kí Ó tó bi wọ́n léèrè), Wọ́n fi àwọn ẹ̀yẹ̀ náà sílẹ̀ sínú Ọgbà Ìdẹ̀ra. (Bukọ̄riy; al-Jihād was-saer: 3500). Irúfẹ́ āyah yìí wà ní sūrah āli ‘Imrọ̄n; 3:169. Kókó tí àwọn āyah wọ̀nyí fi rinlẹ̀ sì ti jẹyọ nínú hadīth yẹn, ìyẹn ni pé, Allāhu - tó ga jùlọ - dùn-ún gbè níjà tó bẹ́ẹ̀ gẹ́ tó fi jẹ́ pé àwọn tí wọ́n bá kú fún Un, àwọn ni wọ́n kú ikú tí ó lápọ̀n-ọ́nlé jùlọ, tó bẹ́ẹ̀ gẹ́ tí wọn yóò fi máa bẹ nínú Ọgbà Ìdẹ́rà ní àwòrán ẹyẹ aláwọ̀ ewéko ṣíwájú Ọjọ́ Àjíǹde. Àti pé kò sí àǹfààní fún òkú kan kan láti padà sílé ayé mọ́. Nítorí náà, kò sí àkúdàáyà tàbí àṣẹ̀yìnwáyé kan níbikíbi bí kò ṣe ète àlùpàídà tí àwọn èṣù àlùjànnú ń dá. Àwọn èṣù àlùjànnú l’ó ń gbé àwòrán ọmọnìyàn wọ̀ láti fi ba ìgbàgbọ́ wọn jẹ́. Ẹ wo sūrah al-Mu’minūn; 23:99 - 100 àti sūrah Yāsīn; 36:48 - 54.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"walā taqūlū liman yuq'talu fī sabīli al-lahi amwātun bal aḥyāon walākin lā tashʿurūna ","translations":["And (do) not","say","for (the ones) who","are slain","in","(the) way","(of) Allah","(They are) dead","Nay","(they are) alive","[and] but","you (do) not","perceive","(154)"],"transliterationArr":["walā","taqūlū","liman","yuq'talu","fī","sabīli","al-lahi","amwātun","bal","aḥyāon","walākin","lā","tashʿurūna",null],"verseTiming":[[1,0,700],[2,700,1740],[3,1740,2210],[4,2210,3610],[5,3610,3980],[6,3980,5030],[7,5030,5590],[8,5590,8800],[9,8800,9190],[10,9190,12610],[11,12610,13440],[12,13440,13970],[13,13970,16725]]}}