{"name":"2:185","price":"Oṣù Rọmọdọ̄n èyí tí A sọ al-Ƙur’ān kalẹ̀ nínú rẹ̀¹ (tí ó jẹ́) ìmọ̀nà, àwọn àlàyé pọ́nńbélé nípa ìmọ̀nà àti ọ̀rọ̀-ìpínyà² fún àwọn ènìyàn; nítorí náà, ẹnikẹ́ni nínú yín tí oṣù náà bá bá láyé (nínú ìlú rẹ̀ pẹ̀lú àlàáfíà ara),³ kí ó gba ààwẹ̀ oṣù náà. Ẹnikẹ́ni tí ó bá jẹ́ aláìsàn tàbí tí ó bá wà lórí ìrìn-àjò, (ó máa san) òǹkà ọjọ́ (gbèsè ààwẹ̀ rẹ̀) nínú àwọn ọjọ́ mìíràn. Allāhu fẹ́ ìrọ̀rùn fún yín, kò sì fẹ́ ìnira fún yín. Ẹ parí òǹkà ọjọ́ (ààwẹ̀ náà), kí ẹ sì gbé títóbi fún Allāhu nítorí pé, Ó fi ọ̀nà mọ̀ yín àti nítorí kí ẹ lè dúpẹ́ fún Un.","arabic":"شَهۡرُ رَمَضَانَ ٱلَّذِيٓ أُنزِلَ فِيهِ ٱلۡقُرۡءَانُ هُدٗى لِّلنَّاسِ وَبَيِّنَٰتٖ مِّنَ ٱلۡهُدَىٰ وَٱلۡفُرۡقَانِۚ فَمَن شَهِدَ مِنكُمُ ٱلشَّهۡرَ فَلۡيَصُمۡهُۖ وَمَن كَانَ مَرِيضًا أَوۡ عَلَىٰ سَفَرٖ فَعِدَّةٞ مِّنۡ أَيَّامٍ أُخَرَۗ يُرِيدُ ٱللَّهُ بِكُمُ ٱلۡيُسۡرَ وَلَا يُرِيدُ بِكُمُ ٱلۡعُسۡرَ وَلِتُكۡمِلُواْ ٱلۡعِدَّةَ وَلِتُكَبِّرُواْ ٱللَّهَ عَلَىٰ مَا هَدَىٰكُمۡ وَلَعَلَّكُمۡ تَشۡكُرُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":192,"juzNumber":2,"footnotes":"1. Ẹ wo ìtọsẹ̀-ọ̀rọ̀ fún sūrah al-’Isrọ̄’; 17:106. \n 2. “ọ̀rọ̀-ìpínyà”: ni ọ̀rọ̀ tó ń ṣe ìpínyà láààrin òdodo àti irọ́.\n 3. Kíyè sí i, awẹ́ gbólóhùn yìí “famọn ṣẹhida minkum-ṣṣahr fal yẹsumhu” kò túmọ̀ sí “nítorí náà, ẹni tí ó bá rí oṣù, kí ó gba ààwẹ̀” nítorí pé, nínú gírámà èdè Lárúbáwá, kalmọh “aṣ-ṣahrọ” nínú awẹ́ gbólóhùn náà kì í ṣe “mọf‘ūlun bih” (àbọ̀) fún “ṣẹhida” bí kò ṣe “ṭḥọrfu-zzamọ̄n” (ọ̀rọ̀-àpọ́nlé / àrótì fún àsìkò). Bákan náà, kì í ṣe gbogbo ènìyàn l’ó máa ní àǹfààní láti rí ìlétéṣù ní alẹ́ àkọ́kọ́ nínú oṣù Rọmọdọ̄n. Àti pé Ohun tí Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - sọ nípa ìbẹ̀rẹ̀ ààwẹ̀ Rọmọdọ̄n àti ìparí rẹ̀ ni pé “Ẹ gba ààwẹ̀ fún rírí ìlétéṣù. Ẹ túnu fún rírí ìlétéṣù. Tí wọ́n bá fi ẹ̀sújò bò ó lójú fún yín, ẹ parí òǹkà (ọgbọ̀n ọjọ́ fún oṣù Ṣa‘bān àti ọgbọ̀n ọjọ́ fún oṣù Rọmọdọ̄n) Bukọ̄riy àti Muslim. Àpólà ọ̀rọ̀-orúkọ yìí “fún rírí ìlétéṣù” ń túmọ̀ sí “tí wọ́n bá rí ìlétéṣù” tàbí “tí ẹ bá rí ìlétéṣù”.\n Bákan náà, ó pọn dandan kí gbogbo ayé gun òkè ‘Arafah ní ọjọ́ kan náà nítorí pé, àyè kan náà ni òkè ‘Arafah wà, ṣùgbọ́n kò pọn dandan kí gbogbo ayé bẹ̀rẹ̀ ààwẹ̀ Rọmọdọ̄n ní ọjọ́ kan náà, kò sì pọn dandan kí gbogbo ayé parí ààwẹ̀ Rọmọdọ̄n ní ọjọ́ kan náà. Èyí kò wá túmọ̀ sí pé kí odidi ìlú méjì ọ̀tọ̀ọ̀tọ̀ nínú orílẹ̀ èdè kan ṣoṣo bẹ̀rẹ̀ ààwẹ̀ Rọmọdọ̄n ní ọjọ́ ọ̀tọ̀ọ̀tọ̀ tàbí parí ààwẹ̀ Rọmọdọ̄n ní ọjọ́ ọ̀tọ̀ọ̀tọ̀. \n Nítorí náà, ní orílẹ̀ èdè wa Nàìjíríà ní àpapọ̀, tí a bá fẹ́ kí ọjọ́ ìbẹ̀rẹ̀ ààwẹ̀ Rọmọdọ̄n wa àti ìparí rẹ̀ máa jẹ́ ọjọ́ kan náà gẹ́gẹ́ bí ó ṣe bá òfin ’Islām mu, a bùkátà sí n̄ǹkan méjì gbòòrò. Ìkíní: aṣíwájú ẹyọ kan ṣoṣo tí ó máa jẹ́ onisunnah, tí àṣẹ rẹ̀ sì máa múlẹ̀ dáadáa. Ìkejì: ìdánilẹ́kọ̀ọ́ lórí ìlétéṣù, ètò àti ìgbédìde ikọ̀ olùwá-oṣù. Láì sí ìkíní kejì, ìtàsé ọjọ́ ìbẹ̀rẹ̀ àti ìparí ààwẹ̀ Rọmọdọ̄n wa kò níí yé máa fi ọjọ́ ẹyọ kan tàbí ọjọ́ méjì tàsé ara wọn. W-Allāhu-l-musta‘ān.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"shahru ramaḍāna alladhī unzila fīhi al-qur'ānu hudan lilnnāsi wabayyinātin mina al-hudā wal-fur'qāni faman shahida minkumu al-shahra falyaṣum'hu waman kāna marīḍan aw ʿalā safarin faʿiddatun min ayyāmin ukhara yurīdu al-lahu bikumu al-yus'ra walā yurīdu bikumu al-ʿus'ra walituk'milū al-ʿidata walitukabbirū al-laha ʿalā mā hadākum walaʿallakum tashkurūna ","translations":["Month","(of) Ramadhaan","(is) that","was revealed","therein","the Quran","a Guidance","for mankind","and clear proofs","of","[the] Guidance","and the Criterion","So whoever","witnesses","among you","the month","then he should fast in it","and whoever","is","sick","or","on","a journey","then prescribed number (should be made up)","from","days","other","Intends","Allah","for you","[the] ease","and not","intends","for you","[the] hardship","so that you complete","the prescribed period","and that you magnify","Allah","for","[what]","He guided you","so that you may","(be) grateful","(185)"],"transliterationArr":["shahru","ramaḍāna","alladhī","unzila","fīhi","al-qur'ānu","hudan","lilnnāsi","wabayyinātin","mina","al-hudā","wal-fur'qāni","faman","shahida","minkumu","al-shahra","falyaṣum'hu","waman","kāna","marīḍan","aw","ʿalā","safarin","faʿiddatun","min","ayyāmin","ukhara","yurīdu","al-lahu","bikumu","al-yus'ra","walā","yurīdu","bikumu","al-ʿus'ra","walituk'milū","al-ʿidata","walitukabbirū","al-laha","ʿalā","mā","hadākum","walaʿallakum","tashkurūna",null],"verseTiming":[[1,0,760],[2,760,1520],[3,1520,3570],[4,3570,4930],[5,4930,5440],[6,5440,6540],[7,6540,6990],[8,6990,8750],[9,8750,10170],[10,10170,11290],[11,11290,12100],[12,12100,14920],[13,14920,16770],[14,16770,17420],[15,17420,18660],[16,18660,19480],[17,19480,20550],[18,20550,22050],[19,22050,22590],[20,22590,23560],[21,23560,23930],[22,23930,24420],[23,24420,25650],[24,25650,26680],[25,26680,27870],[26,27870,28980],[27,28980,30150],[28,30150,30970],[29,30970,31720],[30,31720,32230],[31,32230,33070],[32,33070,33560],[33,33560,34330],[34,34330,34820],[35,34820,35670],[36,35670,36650],[37,36650,37630],[38,37630,39050],[39,39050,42120],[40,42120,43380],[41,43380,44100],[42,44100,44730],[43,44730,45110],[44,45110,46130],[45,46130,47440],[46,47440,49885]]}}