{"name":"2:212","price":"Wọ́n ṣe ìṣẹ̀mí ayé ní ọ̀ṣọ́ (ẹ̀tàn) fún àwọn aláìgbàgbọ́. (Tí ayé bá sì yẹ wọ́n tán,) wọn yó máa fi àwọn tó gbàgbọ́ ní òdodo ṣe yẹ̀yẹ́. Àwọn tó sì bẹ̀rù Allāhu máa wà l’ókè wọn ní Ọjọ́ Àjíǹde. Àti pé Allāhu ń pèsè ìjẹ-ìmu àti ìgbádùn fún ẹni tí Ó bá fẹ́ láì níí ní ìṣírò.¹","arabic":"زُيِّنَ لِلَّذِينَ كَفَرُواْ ٱلۡحَيَوٰةُ ٱلدُّنۡيَا وَيَسۡخَرُونَ مِنَ ٱلَّذِينَ ءَامَنُواْۘ وَٱلَّذِينَ ٱتَّقَوۡاْ فَوۡقَهُمۡ يَوۡمَ ٱلۡقِيَٰمَةِۗ وَٱللَّهُ يَرۡزُقُ مَن يَشَآءُ بِغَيۡرِ حِسَابٖ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":219,"juzNumber":2,"footnotes":"1. Bí a bá gbé gbólóhùn yìí “Àti pé Allāhu ń pèsè ìjẹ-ìmu àti ìgbádùn fún ẹni tí Ó bá fẹ́ láì níí ní ìṣírò.” ka orí oore tayé, ó máa túmọ̀ sí pé, Allāhu ń pèsè ìjẹ-ìmu àti ìgbádùn fún àwọn ẹ̀dá nílé ayé, kì í ṣe lórí ìṣírò àti òṣùwọ̀n pé iṣẹ́ ọwọ́ wọn dára tàbí kò dára, kì í sì ṣe lórí ìṣírò àti òṣùwọ̀n pé wọ́n jẹ́ onígbàgbọ́ òdodo tàbí wọ́n jẹ́ aláìgbàgbọ́, bí kò ṣe lábẹ́ fífẹ́ bẹ́ẹ̀ Allāhu, Ọba Olùpèsè. Ìyẹn ni pé, oore ayé dúró sórí bí Allāhu ṣe fẹ́ kí ó pọ̀ tó fún ẹnikẹ́ni tí Allāhu bá fẹ́ ẹ fún. Èyí jẹ́ èsì fún àwọn aláìgbàgbọ́ nígbà tí àwọn ọlọ́rọ̀ nínú wọn ń fi àwọn aláìní nínú àwọn onígbàgbọ́ òdodo ṣe yẹ̀yẹ́. Ṣebí bí a ṣe rí aláìní láààrin àwọn onígbàgbọ́ òdodo, bẹ́ẹ̀ náà ni a rí àwọn aláìní láààrin àwọn aláìgbàgbọ́. Kódà kò jẹ́ n̄ǹkan kàyéfì bí gbogbo àwọn aláìgbàgbọ́ bá jẹ́ ọlọ́rọ̀ nílé ayé ní ìbámu sí sūrah az-Zukruf; 43:32 - 33. \n Bí a bá sì gbé gbólóhùn náa ka orí oore tọ̀run, ó máa túmọ̀ sí pé, ẹ̀san rere àwọn onígbàgbọ́ òdodo ní ọ̀run máa pọ̀ jaburata débi pé, àwọn gan-an kò níí mọ ìsírò rẹ̀, bí wọ́n bá gbìyànjú láti ṣe ìṣírò rẹ̀. Èyí wà ní ìbámu sí sūrah an-Nisā’; 4:173.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"zuyyina lilladhīna kafarū al-ḥayatu al-dun'yā wayaskharūna mina alladhīna āmanū wa-alladhīna ittaqaw fawqahum yawma al-qiyāmati wal-lahu yarzuqu man yashāu bighayri ḥisābin ","translations":["Beautified","for those who","disbelieve[d]","(is) the life","(of) the world","and they ridicule","[of]","those who","believe[d]","And those who","fear (Allah)","(they will be) above them","(on the) Day","(of) Resurrection","And Allah","provides","whom","He wills","without","measure","(212)"],"transliterationArr":["zuyyina","lilladhīna","kafarū","al-ḥayatu","al-dun'yā","wayaskharūna","mina","alladhīna","āmanū","wa-alladhīna","ittaqaw","fawqahum","yawma","al-qiyāmati","wal-lahu","yarzuqu","man","yashāu","bighayri","ḥisābin",null],"verseTiming":[[1,0,820],[2,820,1860],[3,1860,2500],[4,2500,3430],[5,3430,4360],[6,4360,5680],[7,5680,5960],[8,5960,6910],[9,6910,7910],[10,7910,9380],[11,9380,10150],[12,10150,11110],[13,11110,11590],[14,11590,13180],[15,13180,14070],[16,14070,14890],[17,14890,15100],[18,15100,16100],[19,16100,17810],[20,17810,18730],[21,18730,21055]]}}