{"name":"2:222","price":"Wọ́n sì ń bi ọ́ léèrè nípa n̄ǹkan oṣù (obìnrin). Sọ pé: “Ìnira¹ ni (sísúnmọ́ wọn lásìkò náà). Nítorí náà, ẹ yẹra fún àwọn obìnrin l’ásìkò n̄ǹkan oṣù. Ẹ má ṣe súnmọ́ wọn (fún oorun ìfẹ́) títí wọn yó fi ṣe ìmọ́ra. Tí wọ́n bá sì ti ṣe ìmọ́ra, ẹ súnmọ́ wọn ní àyè tí Allāhu pa láṣẹ fún yín. Dájúdájú Allāhu nífẹ̀ẹ́ àwọn olùronú-pìwàdà. Ó sì nífẹ̀ẹ́ àwọn olùmọ́ra.”²","arabic":"وَيَسۡـَٔلُونَكَ عَنِ ٱلۡمَحِيضِۖ قُلۡ هُوَ أَذٗى فَٱعۡتَزِلُواْ ٱلنِّسَآءَ فِي ٱلۡمَحِيضِ وَلَا تَقۡرَبُوهُنَّ حَتَّىٰ يَطۡهُرۡنَۖ فَإِذَا تَطَهَّرۡنَ فَأۡتُوهُنَّ مِنۡ حَيۡثُ أَمَرَكُمُ ٱللَّهُۚ إِنَّ ٱللَّهَ يُحِبُّ ٱلتَّوَّٰبِينَ وَيُحِبُّ ٱلۡمُتَطَهِّرِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":229,"juzNumber":2,"footnotes":"1. Suddiy àti Ƙọtādah túmọ̀ “’athā” sí “ìdọ̀tí”, Mujāhid túmọ̀ rẹ̀ sí “ẹ̀jẹ̀”. (Tọbariy).\n 2. عَنْ أَنَسٍ أَنَّ الْيَهُودَ كَانُوا إِذَا حَاضَتِ الْمَرْأَةُ فِيهِمْ لَمْ يُؤَاكِلُوهَا وَلَمْ يُجَامِعُوهُنَّ فِى الْبُيُوتِ فَسَأَلَ أَصْحَابُ النَّبِىِّ -صلى الله عليه وسلم- النَّبِىَّ -صلى الله عليه وسلم- فَأَنْزَلَ اللَّهُ تَعَالَى ( وَيَسْأَلُونَكَ عَنِ الْمَحِيضِ قُلْ هُوَ أَذًى فَاعْتَزِلُوا النِّسَاءَ فِى الْمَحِيضِ) إِلَى آخِرِ الآيَةِ فَقَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « اصْنَعُوا كُلَّ شَىْءٍ إِلاَّ النِّكَاحَ ».\n Láti ọ̀dọ̀ ’Anas - kí Allāhu yọ́nú sí i -, “Dájúdájú àwọn yẹ̀húdí, nígbàkígbà tí obìnrin kan nínú wọn bá ń ṣe héélà lọ́wọ́, wọn kò níí bá jẹun papọ̀, wọn kò níí súnmọ́ ọn nínú ilé. Àwọn Sọhābah Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - sì bi Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - léèrè. Allāhu - tó ga jùlọ - sì sọ āyah yìí kalẹ̀. Òjíṣẹ́ Allāhu - kí ìkẹ́ àti ọlà Allāhu máa bá a - sọ pé, “Ẹ ṣe gbogbo n̄ǹkan àfi ìtìbọ̀.” \n Muslim ló gbà á wá. Ìyẹn ni pé, “Ẹ bá oníhéélà jẹun, ẹ bá a ṣeré, ẹ dìmọ́ ọn, ṣùgbọ́n ẹ kò gbọ́dọ̀ ti kálámù bọ inú ìgò tàdáà àfi lẹ́yìn ìmọ́ra àti ìwẹ̀ ìmọ́ra.”","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"wayasalūnaka ʿani al-maḥīḍi qul huwa adhan fa-iʿ'tazilū al-nisāa fī al-maḥīḍi walā taqrabūhunna ḥattā yaṭhur'na fa-idhā taṭahharna fatūhunna min ḥaythu amarakumu al-lahu inna al-laha yuḥibbu al-tawābīna wayuḥibbu al-mutaṭahirīna ","translations":["And they ask you","about","[the] menstruation","Say","It","(is) a hurt","so keep away (from)","[the] women","during","(their) [the] menstruation","And (do) not","approach them","until","they are cleansed","Then when","they are purified","then come to them","from","where","has ordered you","Allah","Indeed","Allah","loves","those who turn in repentance","and loves","those who purify themselves","(222)"],"transliterationArr":["wayasalūnaka","ʿani","al-maḥīḍi","qul","huwa","adhan","fa-iʿ'tazilū","al-nisāa","fī","al-maḥīḍi","walā","taqrabūhunna","ḥattā","yaṭhur'na","fa-idhā","taṭahharna","fatūhunna","min","ḥaythu","amarakumu","al-lahu","inna","al-laha","yuḥibbu","al-tawābīna","wayuḥibbu","al-mutaṭahirīna",null],"verseTiming":[[1,0,1510],[2,1510,1890],[3,1890,3970],[4,3970,4840],[5,4840,5160],[6,5160,6510],[7,6510,7370],[8,7370,9850],[9,9850,10060],[10,10060,12040],[11,12040,13130],[12,13130,15110],[13,15110,15880],[14,15880,17300],[15,17300,18010],[16,18010,19130],[17,19130,21030],[18,21030,21370],[19,21370,21960],[20,21960,22900],[21,22900,25150],[22,25150,26380],[23,26380,27180],[24,27180,27930],[25,27930,29450],[26,29450,30220],[27,30220,33445]]}}