{"name":"2:3","price":"(Àwọn olùbẹ̀rù Allāhu ni:) àwọn tó gbàgbọ́ ní òdodo nínú ìkọ̀kọ̀¹ àti àwọn tó ń kírun àti àwọn tó ń ná nínú ohun tí A pèsè fún wọn,","arabic":"ٱلَّذِينَ يُؤۡمِنُونَ بِٱلۡغَيۡبِ وَيُقِيمُونَ ٱلصَّلَوٰةَ وَمِمَّا رَزَقۡنَٰهُمۡ يُنفِقُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":10,"juzNumber":1,"footnotes":"1. Ní ti ìkọ̀kọ̀, ohun tí wọ́n gbàlérò pẹ̀lú rẹ̀ ní àyè yìí, oríṣiríṣi ni ọ̀rọ̀ àwọn aṣíwájú lórí rẹ̀. Bàbá ‘Āliyah sọ pé, “Wọ́n gbàgbọ́ nínú Allāhu àti àwọn mọlāikah Rẹ̀ àti àwọn tírà Rẹ̀ àti àwọn Òjíṣẹ́ Rẹ̀ àti Ọgbà Ìdẹ̀ra Rẹ̀ àti ìpàdé Rẹ̀ àti ìṣẹ̀mí lẹ́yìn ikú. Ìkọ̀ọ̀kan ìwọ̀nyí ni ìkọ̀kọ̀.” Suddiy sọ pé, láti ọ̀dọ̀ ọmọ ‘Abbās àti ọmọ Mọs‘ūd, “Ìkọ̀kọ̀ ni n̄ǹkan tí ó pamọ́ fún àwọn ẹrú nípa ọ̀rọ̀ Ọgbà Ìdẹ̀ra àti ọ̀rọ̀ Iná àti n̄ǹkan tí wọ́n bá sọ nínú al-Ƙur’ān.” ‘Atọ̄’ sọ pé, “Ẹni tí ó bá gbàgbọ́ nínú Allāhu, ó kúkú ti gbàgbọ́ nínú ìkọ̀kọ̀.” Ìkọ̀ọ̀kan ọ̀rọ̀ wọ̀nyí súnmọ́ ara wọn tí ó ń já sí ìtúmọ̀ ẹyọ kan, gbogbo rẹ̀ sì ni wọ́n gbàlérò fún ìtúmọ̀ ìkọ̀kọ̀. (Tafsīr bn Kathīr)","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"alladhīna yu'minūna bil-ghaybi wayuqīmūna al-ṣalata wamimmā razaqnāhum yunfiqūna ","translations":["Those who","believe","in the unseen","and establish","the prayer","and out of what","We have provided them","they spend","(3)"],"transliterationArr":["alladhīna","yu'minūna","bil-ghaybi","wayuqīmūna","al-ṣalata","wamimmā","razaqnāhum","yunfiqūna",null],"verseTiming":[[1,0,1040],[2,1040,2190],[3,2190,3090],[4,3090,4260],[5,4260,5220],[6,5220,6580],[7,6580,7990],[8,7990,11365]]}}