{"name":"2:34","price":"(Rántí) nígbà tí A sọ fún àwọn mọlāika pé: “Ẹ forí kanlẹ̀ kí (Ànábì) Ādam.”¹ Wọ́n sì forí kanlẹ̀ kí i àyàfi ’Iblīs.² Ó kọ̀, ó sì ṣe ìgbéraga. Ó sì wà nínú àwọn aláìgbàgbọ́.","arabic":"وَإِذۡ قُلۡنَا لِلۡمَلَٰٓئِكَةِ ٱسۡجُدُواْ لِأٓدَمَ فَسَجَدُوٓاْ إِلَّآ إِبۡلِيسَ أَبَىٰ وَٱسۡتَكۡبَرَ وَكَانَ مِنَ ٱلۡكَٰفِرِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":41,"juzNumber":1,"footnotes":"1. Ìforíkanlẹ̀-kíni èyí tí Allāhu - subhānahu wa ta‘āla - pa láṣẹ fún àwọn mọlāika Rẹ̀, ó ti di èèwọ̀ fún ìjọ Ànábì wa Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a -. Èyí ni pé, kò bá òfin ’Islām mu fún ẹnikẹ́ni láti forí kanlẹ̀ kí ẹlòmíìràn, ẹni yòówù ìbáà jẹ́. Ìdí ni pé, nínú hadīth Abū Huraerah, láti ọ̀dọ̀ Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a -. Ó sọ pé: “Èmi ìbá jẹ́ apàṣẹ fún ẹnì kan pé kí ó forí kanlẹ̀ kí ẹlòmíìràn ni, èmi ìbá pa ìyàwó ní àṣẹ pé kí ó forí kanlẹ̀ kí ọkọ rẹ̀.” (Sunan at-Tirmithiy; 1159, ’Abū Dāwud; 2140. Ṣeek Albāniy sọ pé: Hadīth náà dára, ó ní àlàáfíà.) Ipò tí ìforíkanlẹ̀-kíni wà náà ni ìdọ̀bálẹ̀-kíni, ìkúnlẹ̀-kíni àti títẹ̀-kíni. Gbogbo ìwọ̀nyí ni kò lẹ́tọ̀ọ́ mọ́. Àṣà ìkíni tí ẹ̀sìn ’Islām faramọ́ ni sísálámọ̀ (ìyẹn ni, sí sọ pé “as-salām ‘aleekum warahmọtullāh wabarakātuh”) àti bíbọ ọwọ́ ní ibi tí ó ti ní ẹ̀tọ́. \n 2. ’Iblīs ni àlàjẹ́ rẹ̀ ń jẹ́ Ṣaetọ̄n. Àwọn kan kà á mọ́ ara àwọn mọlāika. Wọ́n tún lérò pé Ṣaetọ̄n jẹ́ onímọ̀-jùlọ àti olùjọ́sìn-jùlọ láààrin àwọn mọlāika ṣíwájú kí ó tó di ẹni-ẹ̀kọ̀. Àmọ́ sá, ọ̀rọ̀ kò rí bẹ́ẹ̀ rárá. Ẹyọ kan nínú àwọn àlùjànnú ni ’Iblīs, gẹ́gẹ́ bí èyí ṣe rinlẹ̀ nínú sūrah al-Kahf; 18:50. Allāhu kò sì fi ìmọ̀ àti ìjọ́sìn ròyìn Ṣaetọ̄n rí.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"wa-idh qul'nā lil'malāikati us'judū liādama fasajadū illā ib'līsa abā wa-is'takbara wakāna mina al-kāfirīna ","translations":["And when","We said","to the angels","Prostrate","to Adam","[so] they prostrated","except","Iblis","He refused","and was arrogant","and became","of","the disbelievers","(34)"],"transliterationArr":["wa-idh","qul'nā","lil'malāikati","us'judū","liādama","fasajadū","illā","ib'līsa","abā","wa-is'takbara","wakāna","mina","al-kāfirīna",null],"verseTiming":[[1,0,650],[2,650,1440],[3,1440,4370],[4,4370,5120],[5,5120,6020],[6,6020,8200],[7,8200,10340],[8,10340,11240],[9,11240,11850],[10,11850,13000],[11,13000,13750],[12,13750,14050],[13,14050,16755]]}}