{"name":"2:38","price":"A sọ pé¹: “Gbogbo yín, ẹ sọ̀kalẹ̀ kúrò nínú rẹ̀. Nígbà tí ìmọ̀nà bá dé ba yín láti ọ̀dọ̀ Mi, ẹni tí ó bá tẹ̀lé ìmọ̀nà Mi, ìpáyà kò níí sí fún wọn. Wọn kò sì níí banújẹ́.","arabic":"قُلۡنَا ٱهۡبِطُواْ مِنۡهَا جَمِيعٗاۖ فَإِمَّا يَأۡتِيَنَّكُم مِّنِّي هُدٗى فَمَن تَبِعَ هُدَايَ فَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":45,"juzNumber":1,"footnotes":"1. Kíyè sí i, nígbàkígbà tí Allāhu - subhānahu wa ta‘ālā - bá lo ọ̀rọ̀ arọ́pò-orúkọ “ọ̀pọ̀” dípò “ẹyọ” fún ara Rẹ̀, kò túmọ̀ sí pé “Ọlọ́hun Òdodo” pọ̀ ní òǹkà. Ọ̀rọ̀ arọ́pò-orúkọ ọ̀pọ̀ lè dúró fún ọ̀pọ̀ ní òǹkà tàbí àpọ́nlé. Ibikíbi tí Allāhu - subhānahu wa ta‘ālā - bá ti lo ọ̀rọ̀ arọ́pò-orúkọ “ọ̀pọ̀” nínú al-Ƙur’ān tàbí ọ̀rọ̀-orúkọ “ọ̀pọ̀” tàbí ọ̀rọ̀-ìṣe “ọ̀pọ̀”, kò túmọ̀ sí “Ọlọ́hun” púpọ̀ rárá. Àmọ́ Ó ń ṣe àpọ́nlé fún iṣẹ́ ọwọ́ Rẹ̀ ni. Kí èyí lè dájú pé ìwọ̀nyí kò túmọ̀ sí “Ọlọ́hun” púpọ̀, ṣebí ìtúmọ̀ ọlọ́hun ni ẹni tí wọ́n ń jọ́sìn fún tàbí ẹni tí wọ́n ń bọ, ìdí nìyí tó fi jẹ́ pé ibikíbi tí Allāhu - subhānahu wa ta‘ālā - bá ti sọ̀rọ̀ kan jíjọ́sìn fún Un kì í lo ọ̀rọ̀-orúkọ tàbí ọ̀rọ̀ arọ́pò-orúkọ kan àfi “ẹyọ”. Èyí ló fi rinlẹ̀ pé ọ̀kan ṣoṣo ni Ọlọ́hun Òdodo tí a gbọ́dọ̀ jọ́sìn fún ní ọ̀nà òdodo, àmọ́ Ó lè lo ọ̀rọ̀ arọ́pò-orúkọ ọ̀pọ̀ “Àwa” fún ara Rẹ̀ ní ti ìtúmọ̀ àpọ́nlé.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"qul'nā ih'biṭū min'hā jamīʿan fa-immā yatiyannakum minnī hudan faman tabiʿa hudāya falā khawfun ʿalayhim walā hum yaḥzanūna ","translations":["We said","Go down","from it","all (of you)","and when","comes to you","from Me","Guidance","then whoever","follows","My Guidance","[then] no","fear","(will be) on them","and not","they","will grieve","(38)"],"transliterationArr":["qul'nā","ih'biṭū","min'hā","jamīʿan","fa-immā","yatiyannakum","minnī","hudan","faman","tabiʿa","hudāya","falā","khawfun","ʿalayhim","walā","hum","yaḥzanūna",null],"verseTiming":[[1,0,600],[2,600,1430],[3,1430,2120],[4,2120,3610],[5,3610,4960],[6,4960,7000],[7,7000,8620],[8,8620,9780],[9,9780,10770],[10,10770,11400],[11,11400,12120],[12,12120,12680],[13,12680,13450],[14,13450,14400],[15,14400,14960],[16,14960,15350],[17,15350,18035]]}}