{"name":"2:4","price":"àti àwọn tó gbàgbọ́ ní òdodo nínú ohun tí A sọ̀kalẹ̀ fún ọ àti ohun tí A sọ̀kalẹ̀ ṣíwájú rẹ¹ àti àwọn tó ní àmọ̀dájú nípa Ọjọ́ Ìkẹ́yìn.²","arabic":"وَٱلَّذِينَ يُؤۡمِنُونَ بِمَآ أُنزِلَ إِلَيۡكَ وَمَآ أُنزِلَ مِن قَبۡلِكَ وَبِٱلۡأٓخِرَةِ هُمۡ يُوقِنُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":11,"juzNumber":1,"footnotes":"1. Ìgbàkígbà tí àwọn nasọ̄rọ̄ bá ka irú āyah yìí nínú al-Ƙur’ān, wọ́n a wí pé: “Al-Ƙur’ān gan-an sọ pé àwa mùsùlùmí gbọ́dọ̀ gbàgbọ́ nínú bíbélì!” Ní àkọ́kọ́ ná, Allāhu kò dárúkọ bíbélì nínú al-Ƙur’ān. Orúkọ àwọn tírà mímọ́ tí Allāhu - subhānahu wa ta‘ālā - sọ nípa wọn nínú al-Ƙur’ān ni Zabūr, Suhuf, Taorāt àti ’Injīl. \n Lẹ́yìn náà, ìkọ̀ọ̀kan àwọn tírà wọ̀nyẹn ló wà fún ìjọ Ànábì tí Allāhu fún nìkan, kò sì kan ìjọ mìíràn lẹ́yìn wọn, gẹ́gẹ́ bí ó ṣe jẹ́ pé ìjọ yẹn nìkan ni Allāhu rán Ànábì tí ọ̀rọ̀ kàn sí. \n Lẹ́yìn náà, Allāhu - subhānahu wa ta‘ālā - fi rinlẹ̀ nínú al-Ƙur’ān pé kò sí ojúlówó àwọn tírà náà mọ́ níta, gẹ́gẹ́ bí ó ṣe wà nínú sūrah al-Baƙọrah; 2:75 & 79, sūrah an-Nisā’; 4:46 àti sūrah al-Mọ̄’idah; 5:13. Lóde òní yìí, bíbélì ti lé ní oríṣi ọgbọ̀n! Wàyí, níwọ̀n ìgbà tí ó sì ti rinlẹ̀ pé Allāhu - subhānahu wa ta‘ālā - sọ àwọn tírà kan kalẹ̀ fún àwọn Ànábì kan tó ṣíwájú Ànábì wa - kí ìkẹ́ Allāhu máa bá gbogbo wọn -, mùsùlùmí gbọ́dọ̀ gbàgbọ́ pé Allāhu fún àwọn Ànábì kan ní tírà, ṣùgbọ́n kì í ṣe pé mùsùlùmí yóò sọ tírà náà di ohun tí yóò máa kà áḿbọ̀sìbọ́sí pé yóò tẹ̀lé wọn. Nítorí náà, al-Ƙur’ān alápọ̀n-ọ́nlé ni tírà ìkẹ́yìn láti ọ̀dọ̀ Allāhu fún gbogbo ẹ̀dá. Kò sí òmíràn mọ́.\n 2. Kíyè sí i! Āyah kẹ́ta àti ìkẹrin ló ń túmọ̀ “àwọn olùbẹ̀rù Allāhu” tí ó jẹyọ ní ìparí āyah kejì. Bákan náà, ìkọ̀ọ̀kan àwọn ìròyìn márààrún wọ̀nyí “ìgbàgbọ́ òdodo nínú ìkọ̀kọ̀, ìrun kíkí, nínáwó sí ọ̀nà ẹ̀tọ́, ìgbàgbọ́ òdodo nínú gbogbo àwọn tírà sánmọ̀ àti àmọ̀dájú (ìgbàgbọ́ òdodo) nínú Ọjọ́ Ìkẹ́yìn”, gbogbo ìwọ̀nyí gbọ́dọ̀ wà lára ẹni tí ó bá fẹ́ wà nínú àwọn olùbẹ̀rù Allāhu.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"wa-alladhīna yu'minūna bimā unzila ilayka wamā unzila min qablika wabil-ākhirati hum yūqinūna ","translations":["And those who","believe","in what","(is) sent down","to you","and what","was sent down","from","before you","and in the Hereafter","they","firmly believe","(4)"],"transliterationArr":["wa-alladhīna","yu'minūna","bimā","unzila","ilayka","wamā","unzila","min","qablika","wabil-ākhirati","hum","yūqinūna",null],"verseTiming":[[1,0,1170],[2,1170,2240],[3,2240,3950],[4,3950,5290],[5,5290,6040],[6,6040,7820],[7,7820,9070],[8,9070,9940],[9,9940,10720],[10,10720,12170],[11,12170,12540],[12,12540,15755]]}}