{"name":"2:48","price":"Ẹ bẹ̀rù ọjọ́ kan tí ẹ̀mí kan kò níí rọrọ̀ kiní kan fún ẹ̀mí kan. Wọn kò níí gba ìṣìpẹ̀ l’ọ́wọ́ rẹ̀. Wọn kò níí gba ààrọ̀ l’ọ́wọ́ rẹ̀.¹ Wọn kò sì níí ràn wọ́n lọ́wọ́.²","arabic":"وَٱتَّقُواْ يَوۡمٗا لَّا تَجۡزِي نَفۡسٌ عَن نَّفۡسٖ شَيۡـٔٗا وَلَا يُقۡبَلُ مِنۡهَا شَفَٰعَةٞ وَلَا يُؤۡخَذُ مِنۡهَا عَدۡلٞ وَلَا هُمۡ يُنصَرُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":55,"juzNumber":1,"footnotes":"1. Ìyẹn ni pé, l’ọ́jọ́ Àjíǹde dúkìá kan kan kò níí wúlò fún ìràpadà ẹ̀mí níbi Iná àfi iṣẹ́ rere tí í ṣe ìjọ́sìn fún Allāhu àti ìwà rere tó tọ sunnah.\n 2. Àwọn kan sọ pé, “Àwọn āyah kan sọ pé kò sí ìṣìpẹ̀ l’ọ́jọ́ Àjíǹde, àwọn āyah mìíràn sọ pé ìṣìpẹ̀ wà.” Wọ́n ní, “Ìtakora nìyẹn.”\n Èsì: Èyí jẹ́ “ìtakora tófẹ́jọbẹ́ẹ̀”, kì í ṣe “ìtakora tóríbẹ́ẹ̀”. Àlàyé rẹ̀ nìyí. Àwọn āyah tó ń sọ pé kò sí ìṣìpẹ̀ l’ọ́jọ́ Àjíǹde ń jẹ́ ọ̀rọ̀ ajáni-ní-tànmọ́ọ̀n fún àwọn yẹhudi àti àwọn nasọ̄rọ̄ tí wọ́n ń fọkàn sí ìṣìpẹ̀ láì ṣe iṣẹ́ tí ó máa mú wọn lẹ́tọ̀ọ́ sí ìṣìpẹ̀ àti àwọn ọ̀ṣẹbọ tí ẹ̀sìn ìbọ̀rìṣà tiwọn wulẹ̀ dúró sórí bíbọ ẹ̀dá kan nítorí kí ó lè ṣìpẹ̀ wọn l’ọ́jọ́ Àjíǹde. Irúfẹ́ àwọn āyah náà ni sūrah al-Baƙọrah; 2:48, 123 àti 254 àti sūrah al-’Ani‘ām; 6:51. Àmọ́ àwọn āyah tó ń sọ pé ìṣìpẹ̀ máa wà l’ọ́jọ́ Àjíǹde ń sọ nípa àwọn májẹ̀mú tí ó wà fún ìṣìpẹ̀, olùṣìpẹ̀ àti olùṣìpẹ̀-fún. Irúfẹ́ àwọn āyah náà ni sūrah al-Baƙọrah; 2:255, sūrah Tọ̄hā; 20:109, sūrah Saba’; 34:23, sūrah az-Zukruf; 43:86 àti sūrah al-’Ani‘ām; 6:70. Kíyè sí i, gbígbà tí Allāhu - subhānahu wa ta‘ālā - máa gba ìṣìpẹ̀ lọ́wọ́ àwọn kan fún àwọn kan kò kéré ipò fún agbára Allāhu, àmọ́ ipò tí ìbániṣàdúà wà ni ìṣìpẹ̀ wà. Nítorí náà, bí ó ṣe lẹ́tọ̀ọ́ láti bá ẹlòmíìràn ṣàdúà, bẹ́ẹ̀ náà ló máa ní ẹ̀tọ́ láti bá ẹlòmíìràn ṣìpẹ̀ l’ọ́jọ́ Àjíǹde. Olùṣìpẹ̀ àkọ́kọ́ fún gbogbo ẹ̀dá sì ni Ànábì wa Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a -. Àmọ́ má ṣe fọkàn sí pé mùsùlùmí kan máa ṣìpẹ̀ rẹ tàbí pé o máa ṣìpẹ̀ mùsùlùmí kan nítorí pé, nínú ohun tó pamọ́ fún ẹ̀dá ni ìmọ̀ nípa ta gan-an ni Allāhu - subhānahu wa ta‘ālā - máa fi ìṣìpẹ̀ pọ́nlé nínú àwa ẹrúsìn Rẹ̀. Àdúà wa ni pé, kí Allāhu fi ìṣìpẹ̀ ṣe àpọ́nlé fún èmi àti ẹ̀yin.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"wa-ittaqū yawman lā tajzī nafsun ʿan nafsin shayan walā yuq'balu min'hā shafāʿatun walā yu'khadhu min'hā ʿadlun walā hum yunṣarūna ","translations":["And fear","a day","(will) not","avail","any soul","for","(another) soul","anything","and not","will be accepted","from it","any intercession","and not","will be taken","from it","a compensation","and not","they","will be helped","(48)"],"transliterationArr":["wa-ittaqū","yawman","lā","tajzī","nafsun","ʿan","nafsin","shayan","walā","yuq'balu","min'hā","shafāʿatun","walā","yu'khadhu","min'hā","ʿadlun","walā","hum","yunṣarūna",null],"verseTiming":[[1,0,1050],[2,1050,1680],[3,1680,2170],[4,2170,2990],[5,2990,3660],[6,3660,3960],[7,3960,6100],[8,6100,6800],[9,6800,8090],[10,8090,8900],[11,8900,9620],[12,9620,11040],[13,11040,11610],[14,11610,12400],[15,12400,13130],[16,13130,14920],[17,14920,15430],[18,15430,16190],[19,16190,16920],[20,16920,18430],[21,18430,18910],[22,18910,19290],[23,19290,22605]]}}