{"name":"2:6","price":"Dájúdájú àwọn tó ṣàì gbàgbọ́, bákan náà ni fún wọn, yálà o kìlọ̀ fún wọn tàbí o kò kìlọ̀ fún wọn, wọn kò níí gbàgbọ́.¹","arabic":"إِنَّ ٱلَّذِينَ كَفَرُواْ سَوَآءٌ عَلَيۡهِمۡ ءَأَنذَرۡتَهُمۡ أَمۡ لَمۡ تُنذِرۡهُمۡ لَا يُؤۡمِنُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":13,"juzNumber":1,"footnotes":"1. Àwọn wọ̀nyẹn ni àwọn tí kádàrá wọn lórí jíjẹ́ kèfèrí wọn kò níí yí padà. Àmọ́ ní ti àwọn tí kádàrá ìrònúpìwàdà máa borí wọn, ìkìlọ̀ máa sọ wọ́n di mùsùlùmí. Āyah yìí sọ̀kalẹ̀ nítorí àwọn tí wọ́n ń kú sínú kèfèrí lẹ́yìn tí ìkìlọ̀ ti dé etí ìgbọ́ wọn pé, ọmọ Iná ni gbogbo ẹni tí kò bá kú sínú ’Islām. Nítorí náà, āyah yìí kò sọ̀kalẹ̀ nítorí gbogbo àwọn aláìgbàgbọ́ nítorí pé, a kúkú ń fojú rí àwọn kan nínú wọn tí wọ́n ń gba ’Islām. Àti pé ọ̀wọ́ àwọn tí àdánwò èdídí ọkàn, èdídí ìgbọ́rọ̀ àti èbìbò ojú bá wà lára wọn ló máa takú sínú kèfèrí rẹ̀ títí di ọjọ́ ikú rẹ̀.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"inna alladhīna kafarū sawāon ʿalayhim a-andhartahum am lam tundhir'hum lā yu'minūna ","translations":["Indeed","those who","disbelieve[d]","(it) is same","to them","whether you warn them","or","not","you warn them","not","they believe","(6)"],"transliterationArr":["inna","alladhīna","kafarū","sawāon","ʿalayhim","a-andhartahum","am","lam","tundhir'hum","lā","yu'minūna",null],"verseTiming":[[1,0,1260],[2,1260,2170],[3,2170,2910],[4,2910,5010],[5,5010,5920],[6,5920,7830],[7,7830,8120],[8,8120,8490],[9,8490,10110],[10,10110,10520],[11,10520,12555]]}}