{"name":"2:62","price":"Dájúdájú àwọn tó gbàgbọ́ ní òdodo àti àwọn yẹhudi àti àwọn nasọ̄rọ̄ àti àwọn sọ̄bi’u; ẹnikẹ́ni tí ó bá ní ìgbàgbọ́ òdodo nínú Allāhu àti Ọjọ́ Ìkẹ́yìn, tí ó sì ṣe iṣẹ́ rere, ẹ̀san wọn ń bẹ fún wọn ní ọ̀dọ̀ Olúwa wọn. Kò sí ìbẹ̀rù fún wọn. Wọn kò sì níí banújẹ́.¹","arabic":"إِنَّ ٱلَّذِينَ ءَامَنُواْ وَٱلَّذِينَ هَادُواْ وَٱلنَّصَٰرَىٰ وَٱلصَّٰبِـِٔينَ مَنۡ ءَامَنَ بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِ وَعَمِلَ صَٰلِحٗا فَلَهُمۡ أَجۡرُهُمۡ عِندَ رَبِّهِمۡ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":69,"juzNumber":1,"footnotes":"1. Irú āyah yìí wà nínú sūrah al-Mọ̄’idah; 5:69 àti sūrah al-Hajj; 22:17.\n Àgbọ́yé āyah yìí nìyí:\n Ìkíní: Kò sí ẹ̀sìn kan lọ́dọ̀ Allāhu àfi ’Islām (Ẹ wo sūrah āli-’Imrọ̄n; 3:19 àti 85 àti sūrah al-Mọ̄’dah; 5:3.)\n Ìkejì: Kò sí Ànábì tàbí Òjíṣẹ́ kan tí Allāhu rán níṣẹ́ rí pẹ̀lú ẹ̀sìn mìíràn àfi ’Islām. (Ẹ wo sūrah al-Baƙọrah; 2:130 -140, āl 'Imrọ̄n; 3:51-52 àti 84) Ẹ tún wo ìtọsẹ̀-ọ̀rọ̀ sūrah Yūnus; 10:90. \n Síwájú sí i, okùnfà ìsọ̀kalẹ̀ āyah yìí ni pé, nígbà tí Salmọ̄n Farisiy - kí Allāhu yọ́nú sí i - gba ’Islām, ó sọ̀rọ̀ nípa ìrun kíkí, ààwẹ̀ gbígbà àti ìjọ́sìn àwọn ènìyàn rẹ̀ kan tí wọ́n jẹ́ yẹ̀húdí àti nasọ̄rọ̄, àti ìrètí wọn nínú Ànábì ìkẹ́yìn tí wọ́n ń retí nígbà yẹn. Ó sọ̀rọ̀ wọn fún Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - dáadáa. Kò fi ẹbọ ṣíṣe kún un. Kò fi mẹ́ta lọ́kan kún un. Kò sì fi pípe ẹnì kan ní ọmọ Ọlọ́hun kún un. Ànábí - kí ìkẹ́ àti ọlà Allāhu máa bá a - kọ́kọ́ sọ pé, wọ́n máa wọ inú Iná. Inú Salmọ̄n bàjẹ́ gan-an. Lẹ́yìn náà, āyah yìí sọ̀kalẹ̀, ìyẹn āyah tí à ń tọsẹ rẹ̀ lọ́wọ́. \n Àlàyé lórí ìsọ̀kalẹ̀ āyah náà nìyí, ní ti èsì àkọ́kọ́ tí Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - fún Salmọ̄n, ìyẹn dúró lé àwọn āyah kan nínú al-Ƙur’ān tí ó ń fi rinlẹ̀ pé, ẹnikẹ́ni kò gbọ́dọ̀ tẹ̀lé ànábì kan kan mọ́ nínú àwọn Ànábì tó ṣíwájú Ànábì wa Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - níkété tí Allāhu ti gbé Ànábì wa - kí ìkẹ́ àti ọlà Allāhu máa bá a - dìde ní Òjíṣẹ́ sí gbogbo ayé ní ìbámu sí sūrah āl ‘Imrọ̄n; 3:31-32 àti al-’A‘rọ̄f; 7:158. Nínú hadīth Muslim láti ọ̀dọ̀ bàbá Huraerah - kí Allāhu yọ́nú sí i -, láti ọ̀dọ̀ Òjíṣẹ́ Allāhu - kí ìkẹ́ àti ọlà Allāhu máa bá a -, dájúdájú Òjíṣẹ́ Allāhu sọ pé: “Èmi fi Ẹni tí ẹ̀mí Muhammad wà ní ọwọ́ Rẹ̀ búra; ẹnì kan nínú ìjọ yìí, yẹhudi tàbí nasọ̄rọ̄, kò níí gbọ́ nípa mi, lẹ́yìn náà kí ó kú láì gbàgbọ́ nínú ohun tí Wọ́n fi rán mi níṣẹ́, àfi kí ó wà nínú àwọn èrò Iná.” \n Ní ti āyah tí à ń tọsẹ rẹ̀ lọ́wọ́ àti àwọn irú rẹ̀ méjèèjì tí mo tọ́ka sí nínú sūrah al-Mọ̄’idah; 5:69 àti sūrah al- Hajj; 22:17, ìwọ̀nyẹn dúró lé ìdájọ́ ẹni tí ó kú nínú wọn lórí ìgbàgbọ́ òdodo nínú Allāhu pé Òun ni Ọlọ́hun ọ̀kan ṣoṣo tí a gbọ́dọ̀ jọ́sìn fún ní ọ̀nà òdodo àti iṣẹ́ rere nípa títẹ̀lé Ànábì àsìkò tiwọn ṣíwájú ìgbédìde Ànábì mìíràn. \n Kíyè sí i, èyí kò wá túmọ̀ sí pé, ẹ̀sìn kan ń jẹ́ yẹhūdiyyah tàbí nasrọ̄niyyah tàbí sọ̄bi’iyyah ní ọ̀dọ̀ Allāhu. Ohun tí ó ṣẹlẹ̀ ni pé, ni ìbẹ̀rẹ̀ pẹ̀pẹ̀ àwọn orúkọ wọ̀nyẹn, wọ́n jẹ́ àlàjẹ́ fún àwọn mùsùlùmí lẹ́yìn ìpapòdà Ànábì Mūsā - kí ọlà Allāhu máa bá a - àti lẹ́yìn gbígbé Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - gun sánmọ̀ lọ. Àmọ́ wọ́n padà gbé orúkọ ’Islām jù sílẹ̀ pátápátá, wọ́n sì fi àwọn àlàjẹ́ wọ̀nyẹn rọ́pò rẹ̀. Lẹ́yìn náà, olúkùlùkù wọn yí ẹ̀sìn ’Islām wọn padà sí ohun mìíràn pátápátá. Ìgbàgbọ́ wọn sì padà di àìgbàgbọ́ mọ́ wọn lọ́wọ́. Èyí ni Allāhu - subhānahu wa ta‘ālā - tọ́ka sí nínú sūrah āl ‘Imrọ̄n; 3:19, sūrah aṣ-Ṣūrọ̄; 42:13-14, al-Jāthiyah; 45:16-17 àti sūrah al-Bayyinnah; 98:1-8. Ẹ tún ka āyah 111-112 níwájú nínú sūrah al Baƙọrah.\n Ẹ̀kọ́ pàtàkì tí āyah tí à ń tọsẹ̀ rẹ̀ lọ́wọ́ fẹ́ kọ́ àwa mùsùlùmí ni ìwọ̀nyí:\n Ìkíní: Kí á má ṣe fi orúkọ mìíràn jìrọ̀ orúkọ ẹ̀sìn wa, ’Islām. \n Ìkejì: Bí a bá tún sọra wa ní orúkọ àlàjẹ́ mìíràn lẹ́yìn “mùsùlùmí”, ohun tí ń jẹ́ “Islām” kò gbọ́dọ̀ kúrò nínú ayé wa.\n Ìkẹta: Ọ̀tọ̀ ni orúkọ, ọ̀tọ̀ ni ìgbàgbọ́ àti iṣẹ́. Méjèèjì ni a bùkátà sí. Àmọ́ ìgbàgbọ́ àti iṣẹ́ ló máa sọni ní orúkọ. Nítorí náà, bí ènìyàn bá pe ara rẹ̀ ní mùsùlùmí lórí ahọ́n, àmọ́ kò ṣe ohun tí ń jẹ́ ’Islām níbi àdìsọ́kàn àti ìjọ́sìn àti ìwà rere, pípe ara rẹ̀ ní mùsùlùmí kò níí rọ̀ ọ́ lọ́rọ̀ kan kan níbi ìyà Iná. Èyí ló mú kí “wa lathīna āmọnū” jẹyọ pọ̀ pẹ̀lú àwọn yẹ̀húdí àti àwọn nasọ̄rọ̄ nínú āyah náà. W-Allāhu ’a‘lam.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"inna alladhīna āmanū wa-alladhīna hādū wal-naṣārā wal-ṣābiīna man āmana bil-lahi wal-yawmi al-ākhiri waʿamila ṣāliḥan falahum ajruhum ʿinda rabbihim walā khawfun ʿalayhim walā hum yaḥzanūna ","translations":["Indeed","those who","believed","and those who","became Jews","and the Christians","and the Sabians ","who","believed","in Allah","and the Day","[the] Last","and did","righteous deeds","so for them","their reward","(is) with","their Lord","and no","fear","on them","and not","they","will grieve","(62)"],"transliterationArr":["inna","alladhīna","āmanū","wa-alladhīna","hādū","wal-naṣārā","wal-ṣābiīna","man","āmana","bil-lahi","wal-yawmi","al-ākhiri","waʿamila","ṣāliḥan","falahum","ajruhum","ʿinda","rabbihim","walā","khawfun","ʿalayhim","walā","hum","yaḥzanūna",null],"verseTiming":[[1,0,1290],[2,1290,2220],[3,2220,3270],[4,3270,4280],[5,4280,5150],[6,5150,7340],[7,7340,8820],[8,8820,9160],[9,9160,9850],[10,9850,10950],[11,10950,11850],[12,11850,12780],[13,12780,13470],[14,13470,15050],[15,15050,15760],[16,15760,17150],[17,17150,17880],[18,17880,18820],[19,18820,19980],[20,19980,20930],[21,20930,21450],[22,21450,22180],[23,22180,23190],[24,23190,23780],[25,23780,24130],[26,24130,26865]]}}