{"name":"2:74","price":"Lẹ́yìn náà, ọkàn yín le lẹ́yìn ìyẹn. Ó sì dà bí òkúta tàbí líle tó lágbára jù bẹ́ẹ̀ lọ.¹ Dájúdájú ó ń bẹ nínú àwọn òkúta tí àwọn odò ń ṣàn jáde láti inú rẹ̀. Dájúdájú ó tún ń bẹ nínú wọn tí ó máa sán kànkàn. Omi sì máa jáde láti inú rẹ̀. Dájúdájú ó tún ń bẹ nínú wọn tí ó ń wó lulẹ̀ gbì fún ìpáyà Allāhu. Allāhu kò sì níí gbàgbé ohun tí ẹ̀ ń ṣe níṣẹ́.","arabic":"ثُمَّ قَسَتۡ قُلُوبُكُم مِّنۢ بَعۡدِ ذَٰلِكَ فَهِيَ كَٱلۡحِجَارَةِ أَوۡ أَشَدُّ قَسۡوَةٗۚ وَإِنَّ مِنَ ٱلۡحِجَارَةِ لَمَا يَتَفَجَّرُ مِنۡهُ ٱلۡأَنۡهَٰرُۚ وَإِنَّ مِنۡهَا لَمَا يَشَّقَّقُ فَيَخۡرُجُ مِنۡهُ ٱلۡمَآءُۚ وَإِنَّ مِنۡهَا لَمَا يَهۡبِطُ مِنۡ خَشۡيَةِ ٱللَّهِۗ وَمَا ٱللَّهُ بِغَٰفِلٍ عَمَّا تَعۡمَلُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":81,"juzNumber":1,"footnotes":"1. Nínú èdè Lárúbáwá, ìtúmọ̀ “ ’ao” ni “tàbí”. Nínú al-Ƙur’ān alápọ̀n-ọ́nlé, kò sì sí ọ̀rọ̀ tàbí-ṣùgbọ́n tó ń bí iyèméjì nínú rẹ̀. Nítorí náà, ẹ wo àwọn ìtúmọ̀ ìjìnlẹ̀ fún“ ’ao”.\n (Ìkíní) Lárúbáwá ń lo “ ’ao” láti ṣe àfihàn ìwọ̀fún àti ìṣẹ̀ṣà láààrin n̄ǹkan méjì tàbí jù bẹ́ẹ̀ lọ. \n (Ìkejì) Wọ́n ń lo “ ’ao” nígbà tí òǹsọ̀rọ̀ bá ń ṣiyèméjì nípa ọ̀rọ̀ tí ó ń sọ. Ìlò yìí kò sì lè ṣẹlẹ̀ nínú ọ̀rọ̀ Allāhu - subhānahu wa ta‘ālā - àti ọ̀rọ̀ Òjíṣẹ́ Rẹ̀ - kí ìkẹ́ àti ọlà Allāhu máa bá a -. \n (Ìkẹta) Wọ́n ń lo “ ’ao” nígbà tí òǹsọ̀rọ̀ kò ṣiyèméjì nípa ohun tí ó ń sọ, àmọ́ tí kò fẹ́ kí olùbásọ̀rọ̀ rẹ̀ mọ pàtó nípa ọ̀rọ̀ náà. Àpẹ̀ẹrẹ ìlò yìí ni ìtúmọ̀ “ ’ao” tó jẹyọ nínú sūrah as-Sọffāt; 37:147. \n (Ìkẹrin) Wọ́n ń lo “’ao” nígbà tí òǹsọ̀rọ̀ kò ṣiyèméjì nípa ohun tí ó ń sọ, tí ó sì ti fún olùbásọ̀rọ̀ rẹ̀ ní àǹfààní láti mọ pàtó àti òkodoro ọ̀rọ̀ náà, àmọ́ tí olùbásọ̀rọ̀ ń ṣe ìṣe aláìníkan-ánṣe tàbí aláìgbàgbọ́. Àpẹ̀ẹrẹ ìlò yìí ni ìtúmọ̀ “ ’ao” tó jẹyọ nínú sūrah Saba’; 34:24. \n (Ìkarùn-ún) Wọ́n ń lo “ ’ao” láààrin ọ̀rọ̀ méjì tàbí jù bẹ́ẹ̀ lọ tó dúró fún ọ̀kan-ùn. Àpẹ̀ẹrẹ ìlò yìí ni ìtúmọ̀ “ ’ao” tó jẹyọ nínú sūrah al-’Isrọ̄’; 17:110. \n (Ìkẹfà) Wọ́n ń lo “wāwu-l-‘atf” fún “ ’ao” tó ń túmọ̀ sí “tàbí”. Àpẹ̀ẹrẹ ìlò yìí ni ìtúmọ̀ “wāwu-l-‘atf” tó jẹyọ nínú sūrah an-Nisā’; 4:3 àti Fātir; 35:1. \n (Ìkejè) Wọ́n ń lo “ ’ao” fún “bal” - “rárá” - nígbà tí òǹsọ̀rọ̀ bá fẹ́ bàbàrà ọ̀rọ̀. Àpẹ̀ẹrẹ ìlò yìí ni ìtúmọ̀ “ ’ao” tó jẹyọ nínú sūrah tí à ń tọsẹ̀ rẹ̀ lọ́wọ́. Ìyẹn ni pé, ọkàn àwọn ọmọ ’Isrọ̄’īl ìbá le bí òkúta ṣe le, ìrètí gbígba òdodo gbọ́ ìbá wà fún wọn nítorí pé, bí òkúta ṣe le tó, ó ń sán, ó ń fọ́, tí omi àti n̄ǹkan rere mìíràn ń tibẹ̀ jáde. Àmọ́ ọkàn wọn kò rí bẹ́ẹ̀ rárá. Ńṣe ni ọkàn wọn le ju òkúta. Allāhu - subhānahu wa ta‘ālā - sì ni Alámọ̀tán nípa ohun tó wà nínú igbá-àyà ẹ̀dá.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"thumma qasat qulūbukum min baʿdi dhālika fahiya kal-ḥijārati aw ashaddu qaswatan wa-inna mina al-ḥijārati lamā yatafajjaru min'hu al-anhāru wa-inna min'hā lamā yashaqqaqu fayakhruju min'hu al-māu wa-inna min'hā lamā yahbiṭu min khashyati al-lahi wamā al-lahu bighāfilin ʿammā taʿmalūna ","translations":["Then","hardened","your hearts","from","after","that","so they","(became) like [the] stones","or","stronger","(in) hardness","And indeed","from","the stones","certainly (there are some) which","gush forth","from it","[the] rivers","and indeed","from them","certainly (there are some) which","split","so comes out","from it","[the] water","and indeed","from them","certainly (there are some) which","fall down","from","fear","(of) Allah","And not","(is) Allah","unaware","of what","you do","(74)"],"transliterationArr":["thumma","qasat","qulūbukum","min","baʿdi","dhālika","fahiya","kal-ḥijārati","aw","ashaddu","qaswatan","wa-inna","mina","al-ḥijārati","lamā","yatafajjaru","min'hu","al-anhāru","wa-inna","min'hā","lamā","yashaqqaqu","fayakhruju","min'hu","al-māu","wa-inna","min'hā","lamā","yahbiṭu","min","khashyati","al-lahi","wamā","al-lahu","bighāfilin","ʿammā","taʿmalūna",null],"verseTiming":[[1,0,1230],[2,1230,1840],[3,1840,3040],[4,3040,4740],[5,4740,5400],[6,5400,6140],[7,6140,6690],[8,6690,8080],[9,8080,8440],[10,8440,9240],[11,9240,10480],[12,10480,11870],[13,11870,12240],[14,12240,13520],[15,13520,14040],[16,14040,15290],[17,15290,15830],[18,15830,19530],[19,19530,20890],[20,20890,21720],[21,21720,22250],[22,22250,23410],[23,23410,24450],[24,24450,24960],[25,24960,27590],[26,27590,29390],[27,29390,30140],[28,30140,30730],[29,30730,31510],[30,31510,31830],[31,31830,32650],[32,32650,35280],[33,35280,35630],[34,35630,36490],[35,36490,37570],[36,37570,39100],[37,39100,42455]]}}