{"name":"30:26","price":"TiRẹ̀ ni àwọn tó wà nínú àwọn sánmọ̀ àti ilẹ̀. Ẹnì kọ̀ọ̀kan ni olùtẹ̀lé-àṣẹ Rẹ̀.¹","arabic":"وَلَهُۥ مَن فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ كُلّٞ لَّهُۥ قَٰنِتُونَ","category":["30 (Ar-Rum)","Ar-Rum","Surah Ar-Rum","Chapter Ar-Rum","Rum","Surah Rum","Chapter Rum","Ar Rum","Surah Ar Rum","Chapter Ar Rum","Surah 30","Chapter 30","The Romans","الرُّوم"],"ayahNumber":3435,"juzNumber":21,"footnotes":"1. Āyah yìí jọ sūrah ar-Ra‘d; 13:15 àti sūrah an-Nahl; 16:49 nítorí pé, wọ́n dì jọ jẹ́ oní-pọ́nna. Ní ti āyah òkè yìí, pọ́n-na inú rẹ̀ ni pé, kò sí ẹni tí kò tẹ̀lé àṣẹ Allāhu. Irú àṣẹ tí wọ́n ń tọ́ka sí nínú āyah yìí ló mú pọ́n-na lọ́wọ́. \n Àṣẹ méjì ló wà lórí ẹ̀dá. Àṣẹ àdámọ́ àti àṣẹ ìjọ́sìn. Àṣẹ àdámọ́ ló jẹmọ́ wíwá sáyé, lílọ sọ́run àti gbogbo ohun tí ọmọnìyàn kò lè ríbi yẹ̀ ẹ́ sí bí ebi, òǹgbẹ, oorun àti bẹ́ẹ̀ bẹ́ẹ̀ lọ. Ìwọ̀nyẹn ni àṣẹ Allāhu = = lára ẹnì kọ̀ọ̀kan, yálà onígbàgbọ́ òdodo tàbí aláìgbàgbọ́. Nítorí náà, gbogbo wa ni à ń tẹ̀lé àṣẹ Allāhu tó jẹmọ́ àdámọ́ nígbàkígbà tí àṣẹ náà bá dé sí wá lára. Kódà tí ìdíwọ́ kan bá fẹ́ ṣẹlẹ̀ sí ẹ̀dá láti tẹ̀lé àṣẹ náà, ìnira máa gbá a mú títí ó máa fi tẹ̀lé àṣẹ náà. \n Àmọ́ ní ti àṣẹ ìjọ́sìn, àwọn onígbàgbọ́ òdodo nìkan ló ń tẹ̀lé àṣẹ Allāhu lórí rẹ̀. Ní ti àwọn aláìgbàgbọ́, àṣẹ Èṣù àti àṣẹ ìfẹ́-inú wọn ni wọ́n ń tẹ̀lé. Irú āyah òkè yìí tún wà nínú sūrah al-Baƙọrah; 2:116. Ẹ tún wo ìtọsẹ̀-ọ̀rọ̀ sūrah ar-Ra‘d; 13:15.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"walahu man fī al-samāwāti wal-arḍi kullun lahu qānitūna ","translations":["And to Him (belongs)","whoever","(is) in","the heavens","and the earth","All","to Him","(are) obedient","(26)"],"transliterationArr":["walahu","man","fī","al-samāwāti","wal-arḍi","kullun","lahu","qānitūna",null],"verseTiming":[[1,0,1040],[2,1040,2160],[3,2160,2380],[4,2380,3990],[5,3990,5390],[6,5390,5960],[7,5960,6800],[8,6800,10085]]}}