{"name":"30:53","price":"Ìwọ kọ́ l’o máa fi ọ̀nà mọ àwọn afọ́jú níbi ìṣìnà wọn. Kò sí ẹni tí o máa mú gbọ́ ọ̀rọ̀ àfi ẹni tí ó bá gba àwọn āyah Wa gbọ́. Àwọn sì ni (mùsùlùmí) olùjupá-jusẹ̀-sílẹ̀ fún Allāhu.¹","arabic":"وَمَآ أَنتَ بِهَٰدِ ٱلۡعُمۡيِ عَن ضَلَٰلَتِهِمۡۖ إِن تُسۡمِعُ إِلَّا مَن يُؤۡمِنُ بِـَٔايَٰتِنَا فَهُم مُّسۡلِمُونَ","category":["30 (Ar-Rum)","Ar-Rum","Surah Ar-Rum","Chapter Ar-Rum","Rum","Surah Rum","Chapter Rum","Ar Rum","Surah Ar Rum","Chapter Ar Rum","Surah 30","Chapter 30","The Romans","الرُّوم"],"ayahNumber":3462,"juzNumber":21,"footnotes":"1. Àwọn nasọ̄rọ̄ ń sọ pé, níwọ̀n ìgbà tí āyah 52 àti 53 òkè yìí ti fi rinlẹ̀ pé, Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - kò lè bá òkú sọ̀rọ̀ kí ó gbọ́, kí ó sì jí dìde gẹ́gẹ́ bí Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - ṣe jí òkú dìde; níwọ̀n ìgbà tí Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - kò lè la etí adití kí ó gbọ́rọ̀ àti níwọ̀n ìgbà tí Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - kò lè la ojú afọ́jú kí ó ríran gẹ́gẹ́ bí Ànábì = = ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - ṣe la ojú afọ́jú, wọ́n ní nígbà náà kí l’ó fẹ́ sọ Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - di aṣíwájú bíi ti Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a -. Àti pé, kò lè sí ìgbàlà lọ́dọ̀ Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - nítorí pé, kò lè jí òkú dìde, kò lè la etí adití, kò sì lè la ojú afọ́jú. Wọ́n ní nítorí náà, ọ̀dọ̀ Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - nìkan ni ìgbàlà wà nítorí pé, ó ṣe gbogbo ìwọ̀nyẹn àti òmíràn fún ará ayé!\n Èsì: Ní àkọ́kọ́ ná, iṣẹ́ ìyanu kọ́ ni òṣùwọ̀n fún ta ni ó lè jẹ́ aṣíwájú àwọn ènìyàn. Ẹnì kan kan kò sì lè rọ Ànábì tàbí Òjíṣẹ́ Ọlọ́hun kan lóyè nípasẹ̀ àìṣe iṣẹ́ ìyanu. Kò sì sí Ànábì tàbí Òjíṣẹ́ Ọlọ́hun kan t’ó dá iṣẹ́ ìyanu ṣe láti ọ̀dọ̀ ara rẹ̀ bí kò ṣe èyí tí Allāhu - subhānahu wa ta‘ālā - bá yọ̀ǹda fún un láti ṣe nítorí pé, Allāhu - subhānahu wa ta‘ālā - l’Ó ń ṣiṣẹ́ ìyanu. Kò sì sí Ànábì tàbí Òjíṣẹ́ Ọlọ́hun kan tí Allāhu kò fún ní iṣẹ́ ìyanu kan tàbí òmíràn ṣe ní ìbámu sí ìgbà ẹnì kọ̀ọ̀kan wọn. Bẹ́ẹ̀ sì ni èyíkéyìí iṣẹ́ ìyanu tí ó bá tọwọ́ Ànábì tàbí Òjíṣẹ́ kan wáyé kò sọ Ànábì tàbí Òjíṣẹ́ náà di olúwa àti olùgbàlà. Allāhu nìkan ṣoṣo ní Olúwa àti Olùgbàlà ayé àti ọ̀run. Nítorí náà, fún àlékún lórí àwọn iṣẹ́ ìyanu Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a -, ẹ ka ìtọsẹ̀-ọ̀rọ̀ sūrah al-Mọ̄’idah; 5:110. \n Lẹ́yìn náà, kì í ṣe pé Allāhu - subhānahu wa ta‘ālā - kò ní agbára láti fún Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - ní irúfẹ́ àwọn iṣẹ́ ìyanu òkè wọ̀nyẹn ṣe, tí Allāhu bá fẹ́. Allāhu sì ni Alágbára lórí gbogbo n̄ǹkan. Àmọ́ àwọn nasọ̄rọ̄, gẹ́gẹ́ bí ìṣesí wọn, ńṣe ni wọ́n gbé àwọn āyah náà ka ibùgbékà òdì nítorí pé, kì í ṣe ọ̀rọ̀ iṣẹ́ ìyanu ṣíṣe ni àkòrí àwọn āyah náà bí kò ṣe pé àpẹ̀ẹrẹ àti àpèjúwe àwọn aláìgbàgbọ́ agbọ́mágbà ni kókó nínú àwọn āyah náà. Allāhu - subhānahu wa ta‘ālā - ń fi àwọn aláìgbàgbọ́ agbọ́mágbà wé òkú, adití àti afọ́jú ni. Allāhu - subhānahu wa ta‘ālā - ń fi yé Ànábì Rẹ̀ - kí ìkẹ́ àti ọlà Allāhu máa bá a - pé, lẹ́yìn tí ó bá ti ké àwọn āyah fún àwọn ènìyàn nípa òdodo ’Islām, ẹni tí ó bá tún takú sórí àìgbàgbọ́, kì í ṣe ènìyàn t’ó pé níye mọ́, onítọ̀ún ti wà nípò òkú, ẹni tí kò lè ṣe àtúnṣe kan kan mọ́ sí ọ̀rọ̀ ara rẹ̀. Aláìgbàgbọ́ agbọ́mágbà ti wà nípò adití nítorí pé, adití kì í gbọ́rọ̀. Bákan náà, aláìgbàgbọ́ agbọ́mágbà ti wà nípò afọ́jú nítorí pé, afọ́jú kì í ríran, kò sì lè dárìn láì níí máa já sí kòtò àti = \n = gelemọ. Nítorí náà, àfiwé àwọn aláìgbàgbọ́ agbọ́mágbà ní kókó àti àkòrí àwọn āyah náà, kì í ṣe ọ̀rọ̀ iṣẹ́ ìyanu. \n Lẹ́yìn náà, irúfẹ́ àwọn āyah náà ń pa ìbànújẹ́ rẹ́ nínú ọkàn Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - ni nítorí pé, bí ó ṣe ń wù ú tó àti bí ó ṣe ń jẹ̀rankàn tó ni pé, kí gbogbo àwọn ènìyàn rẹ̀ gbàgbọ́ nínú Allāhu. Àmọ́ wọn kò gbàgbọ́, Ìdí nìyí tí Allāhu ṣe ń pàrọwà fún un pé, ọwọ́ Òun ni ìyẹn wà. Kí Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - má wulẹ̀ fi ìrònú ìyẹn han ara rẹ̀ léèmọ̀.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"wamā anta bihādi al-ʿum'yi ʿan ḍalālatihim in tus'miʿu illā man yu'minu biāyātinā fahum mus'limūna ","translations":["And not","you","can guide","the blind","from","their error","Not","you can make hear","except","(those) who","believe","in Our Verses","so they","surrender","(53)"],"transliterationArr":["wamā","anta","bihādi","al-ʿum'yi","ʿan","ḍalālatihim","in","tus'miʿu","illā","man","yu'minu","biāyātinā","fahum","mus'limūna",null],"verseTiming":[[1,0,2529],[2,2529,4029],[3,4029,4939],[4,4939,5739],[5,5739,6879],[6,6879,8289],[7,8289,9519],[8,9519,10929],[9,10929,11769],[10,11769,11979],[11,11979,13519],[12,13519,15199],[13,15199,15839],[14,15839,20994]]}}