{"name":"31:6","price":"Ó wà nínú àwọn ènìyàn, ẹni tó ń ra ọ̀rọ̀ eré¹ láti fi ṣi àwọn ènìyàn lọ́nà kúrò lójú ọ̀nà (ẹ̀sìn) Allāhu pẹ̀lú àìnímọ̀ àti nítorí kí ó lè sọ ẹ̀sìn di yẹ̀yẹ́. Àwọn wọ̀nyẹn sì ni ìyà tí í yẹpẹrẹ ẹ̀dá wà fún.","arabic":"وَمِنَ ٱلنَّاسِ مَن يَشۡتَرِي لَهۡوَ ٱلۡحَدِيثِ لِيُضِلَّ عَن سَبِيلِ ٱللَّهِ بِغَيۡرِ عِلۡمٖ وَيَتَّخِذَهَا هُزُوًاۚ أُوْلَٰٓئِكَ لَهُمۡ عَذَابٞ مُّهِينٞ","category":["31 (Luqman)","Luqman","Surah Luqman","Chapter Luqman","Surah 31","Chapter 31","Luqman","لقمَان"],"ayahNumber":3475,"juzNumber":21,"footnotes":"1. Ọ̀rọ̀ eré ni gbogbo ọ̀rọ̀ tó jẹ́ orin, odù irọ́, ọ̀rọ̀ ìbàjẹ́ àti ìsọkúsọ. Èyí sì lè jẹ́ odù ifá, orin àlùjó, ọ̀rọ̀ ìròrí (philosophy) àti fíìmù (tíátà). Ríra ọ̀rọ̀ eré túmọ̀ sí n̄ǹkan méjì. \n Ìkíní: Ríra ọ̀rọ̀ eré túmọ̀ sí nínáwó lórí ọ̀rọ̀ eré bíi pípe olórin, ríra àwo orin, ríra irin-iṣẹ́ fún orin, kíkún onítíátà lọ́wọ́. \n Ìkéjì: Ríra ọ̀rọ̀ eré túmọ̀ sí níní ìfẹ́ sí ọ̀rọ̀ eré. \n Lílo ọ̀rọ̀ eré láti ṣi àwọn ènìyàn lọ́nà kúrò lójú ọ̀nà Allāhu túmọ̀ sí lílo ọ̀rọ̀ eré àti gbígbọ́lá fún un nínú ìṣẹ̀mí ayé dípò lílo ọ̀rọ̀ al-Ƙur’ān àti hadīth Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - . Lára rẹ̀ ni lílo àsìkò fún ọ̀rọ̀ eré dípò kíké al-Ƙur’ān (tilāwah), gbígbọ́ wáàsí àti ṣíṣe ìrántí Allāhu (ath-thikr).","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"wamina al-nāsi man yashtarī lahwa al-ḥadīthi liyuḍilla ʿan sabīli al-lahi bighayri ʿil'min wayattakhidhahā huzuwan ulāika lahum ʿadhābun muhīnun ","translations":["And of","the mankind","(is he) who","purchases","idle tales","idle tales","to mislead","from","(the) path","(of) Allah","without","knowledge","and takes it","(in) ridicule","Those","for them","(is) a punishment","humiliating","(6)"],"transliterationArr":["wamina","al-nāsi","man","yashtarī","lahwa","al-ḥadīthi","liyuḍilla","ʿan","sabīli","al-lahi","bighayri","ʿil'min","wayattakhidhahā","huzuwan","ulāika","lahum","ʿadhābun","muhīnun",null],"verseTiming":[[1,0,450],[2,450,2040],[3,2040,2170],[4,2170,3940],[5,3940,4500],[6,4500,5520],[7,5520,6370],[8,6370,7290],[9,7290,8360],[10,8360,8920],[11,8920,9660],[12,9660,10940],[13,10940,12380],[14,12380,13310],[15,13310,16520],[16,16520,17020],[17,17020,17960],[18,17960,21635]]}}