{"name":"32:11","price":"Sọ pé: “Mọlāika ikú èyí tí A yàn fún yín máa gba ẹ̀mí yín. Lẹ́yìn náà, ọ̀dọ̀ Olúwa yín ni wọn máa da yín padà sí.”¹","arabic":"۞ قُلۡ يَتَوَفَّىٰكُم مَّلَكُ ٱلۡمَوۡتِ ٱلَّذِي وُكِّلَ بِكُمۡ ثُمَّ إِلَىٰ رَبِّكُمۡ تُرۡجَعُونَ","category":["32 (As-Sajda)","As-Sajda","Surah As-Sajda","Chapter As-Sajda","Sajda","Surah Sajda","Chapter Sajda","As Sajda","Surah As Sajda","Chapter As Sajda","Surah 32","Chapter 32","The Prostration","السَّجدَة"],"ayahNumber":3514,"juzNumber":21,"footnotes":"1. Àwọn nasọ̄rọ̄ lérò pé àwọn āyah tó ń sọ nípa ẹ̀mí gbígbà tàbí ikú takora wọn nínú al-Ƙur’ān alápọ̀n-ọ́nlé. Wọ́n ní àwọn āyah náà ni: sūrah az-Zumọr; 39:42, sūrah al-’Anfāl; 8:50, sūrah al-’Ani‘ām; 6:61 àti sūrah as-Sajdah; 32:11. \n Èsì: Ní àkọ́kọ́ ná, Allāhu ni Ẹlẹ́dàá ìṣẹ̀mí àti ikú, gẹ́gẹ́ bí Ó ṣe jẹ́ Ẹlẹ́dàá ohun gbogbo. Kò sí ẹ̀dá kan tí ó máa tọ́ ìṣẹ̀mí wò àfi pẹ̀lú ìyọ̀ǹda Allāhu ẹni tí Ó ń sọni di alààyè. Kò sì sí ẹ̀dá kan tí ó máa tọ́ ikú wò àfi pẹ̀lú ìyọ̀ǹda Allāhu ẹni tí Ó ń sọni di òkú. Nípa èyí, Allāhu l’Ó ń fi àṣẹ Rẹ̀ gba ẹ̀mí kúrò lára ẹ̀dá Rẹ̀ ní àkókò tí Ó ti kọ mọ́ ọn nínú kádàrá. Ìyẹn ni ó jẹyọ nínú sūrah az-Zumọr; 39:42. Bákan náà, Allāhu ṣẹ̀dá àwọn mọlāika gẹ́gẹ́ bí ìránṣẹ́ àti òjíṣẹ́ Rẹ̀ lórí gbogbo n̄ǹkan. Nípa èyí, àwọn mọlāika kan wà fún ẹ̀mí gbígbà. Ìyẹn l’ó jẹyọ nínú sūrah al-’Anfāl; 8:50 àti sūrah al-’Ani‘ām; 6:61. Allāhu sì fi ẹnì kan ṣe ọ̀gá nínú àwọn mọlāika tó wà níbi ẹ̀mí gbígbà. Ọ̀gá yìí l’ó sì gbé orúkọ àti àwòrán ikú rù. Ìyẹn ni ó jẹyọ nínú sūrah as-Sajdah; 32:11. Níbo wá ni ìtakora wà? Kò sí. Al-hamdulillah.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"qul yatawaffākum malaku al-mawti alladhī wukkila bikum thumma ilā rabbikum tur'jaʿūna ","translations":["Say","Will take your soul","(the) Angel","(of) the death","the one who","has been put in charge","of you","Then","to","your Lord","you will be returned","(11)"],"transliterationArr":["qul","yatawaffākum","malaku","al-mawti","alladhī","wukkila","bikum","thumma","ilā","rabbikum","tur'jaʿūna",null],"verseTiming":[[1,0,330],[2,330,1830],[3,1830,3290],[4,3290,4060],[5,4060,4790],[6,4790,5560],[7,5560,6050],[8,6050,7460],[9,7460,7940],[10,7940,8930],[11,8930,12015]]}}