{"name":"32:20","price":"Ní ti àwọn tó balẹ̀jẹ́, Iná ni ibùgbé wọn. Ìgbàkígbà tí wọ́n bá fẹ́ jáde kúrò nínú rẹ̀, A ó sì máa dá wọn padà sínú rẹ̀. A sì máa sọ fún wọn pé: “Ẹ tọ́ ìyà Iná tí ẹ̀ ń pè ní irọ́ wò.”¹","arabic":"وَأَمَّا ٱلَّذِينَ فَسَقُواْ فَمَأۡوَىٰهُمُ ٱلنَّارُۖ كُلَّمَآ أَرَادُوٓاْ أَن يَخۡرُجُواْ مِنۡهَآ أُعِيدُواْ فِيهَا وَقِيلَ لَهُمۡ ذُوقُواْ عَذَابَ ٱلنَّارِ ٱلَّذِي كُنتُم بِهِۦ تُكَذِّبُونَ","category":["32 (As-Sajda)","As-Sajda","Surah As-Sajda","Chapter As-Sajda","Sajda","Surah Sajda","Chapter Sajda","As Sajda","Surah As Sajda","Chapter As Sajda","Surah 32","Chapter 32","The Prostration","السَّجدَة"],"ayahNumber":3523,"juzNumber":21,"footnotes":"1. Láti ọ̀dọ̀ Yẹzīd Faƙīr, ó sọ pé, ìròrí kan nínú ìròrí ìjọ Kawārij ti kó sínú ọkàn mi. A sì jáde pẹ̀lú àwọn ènìyàn kan tí ó ní òǹkà, à = = ń lọ ṣe hajj. Lẹ́yìn náà, a máa ń jáde lọ bá àwọn ènìyàn. A sì gba Mọdīnah kọjá ni a bá rí Jābir ọmọ ‘Abdullāh tí ó ń sọ hadīth fún àwọn ènìyàn, ó jókòó síbi òpó kan, ó sọ pé láti ọ̀dọ̀ Òjíṣẹ́ Allāhu - kí ìkẹ́ àti ọlà Allāhu máa bá a -, ó sọ pé, … Àti pé Jābir sọ ọ̀rọ̀ àwọn Jahannamiyyūn. Yẹzīd sọ pé, mo sọ fún un pé, “Ìwọ Sọhābah Òjíṣẹ́ Allāhu, kí ni èyí tí ò ń sọ nínú hadīth báyìí o, tí Allāhu sì ń sọ pé, “ẹnikẹ́ni tí O bá mú wọ inú Iná, O ti dójú tì í.” (Sūrah āli-‘Imrọ̄n; 3:192), Allāhu tún sọ pé, “Ìgbàkígbà tí wọ́n bá fẹ́ jáde kúrò nínú rẹ̀, A ó sì máa dá wọn padà sínú rẹ̀.” (sūrah as-Sajdah; 32:20) Nítorí náà, kí ni èyí tí ẹ wá ń sọ (pé hadīth kan sọ pe - àwọn kan máa jáde kúrò nínú Iná)?” Yẹzīd sọ pé, Jābir sọ pé, “Ṣé o máa ń ké al-Ƙur’ān?” Mo sọ pé, “Bẹ́ẹ̀ ni.” Jābir tún sọ pé, “Ǹjẹ́ o gbọ́ nípa àyè Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - ìyẹn, ibi tí Allāhu máa gbé e sí ní ọ̀run?” Mo sọ pé, “Bẹ́ẹ̀ ni.” Jābir sọ pé, “Dájúdájú àyè Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - ni àyè ògo èyí tí Allāhu yóò máa fi ẹni tí Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - bá fẹ́ mú jáde kúrò nínú Iná kúrò nínú Iná.” Yẹzīd sọ pé, lẹ́yìn náà Jābir ròyìn àgbékalẹ̀ afárá Iná àti kíkọjá àwọn ènìyàn lórí rẹ̀. Yẹzīd sọ pé, “Mò ń páyà pé èmi kò rí i há sórí ju ìyẹn.” Yẹzīd tún sọ pé, yàtọ̀ sí pé dájúdájú Jābir sọ pé, “Dájúdájú àwọn ìjọ kan máa jáde kúrò nínú Iná lẹ́yìn ìgbà tí wọ́n ti wà nínú rẹ̀.” Ó sọ pé, ìyẹn túmọ̀ sí pé, “Wọ́n máa jáde kúrò nínú rẹ̀, wọ́n sì máa dàbí igi ìdáná simsim.” Jābir sọ pé, “Wọ́n máa wọ inú odò kan nínú odò Ọgbà Ìdẹ̀ra. Wọ́n máa wẹ̀ nínú rẹ̀, wọ́n sì máa jáde bí ẹni pé dájúdájú ìwé àjákọ fúnfun ni wọ́n.” Lẹ́yìn náà, a padà sí ìlú, a sì sọ pé, “Ṣíọ̀ yín - ẹ̀yin Kawārij - ṣé ẹ lérò pé àgbàlágbà Sọhābah ń parọ́ mọ́ Òjíṣẹ́ Allāhu - kí ìkẹ́ àti ọlà Allāhu máa bá a - ni?” Nítorí náà, àwa ṣẹ́rí padà kúrò níbi ìròrí kawārij. Mo sì fi Allāhu búra, kò sí ẹnì kan nínú wa tí ó yapa òdodo náà yàtọ̀ sí ọkùnrin ẹyọ kan - tàbí gẹ́gẹ́ bí bàbá Nu‘aem ṣe sọ.” \n (Àwọn ènìyàn wọ̀nyí wá fún iṣẹ́ hajj, wọ́n sì ní àdánwò àṣìgbọ́ kan pé àwọn ẹlẹ́ṣẹ̀ ńlá, yàtọ̀ sí ẹ̀ṣẹ̀ abẹ̀sìnjẹ́, wọn kò níí jáde kúrò nínú Iná gẹ́gẹ́ bí àwọn kèfèrí àti àwọn ọ̀ṣẹbọ ṣe máa ṣe gbére nínú Iná. Àwọn ènìyàn náà ń lo àwọn āyah tó wá lórí ọ̀rọ̀ àwọn aláìgbàgbọ́ fún àwọn mùsùlùmí tí wọ́n kú sórí àwọn ẹ̀ṣẹ̀ ńlá. Àdìsọ́kàn náà jẹ ọ̀kan nínú àwọn àdìsọ́kàn ìjọ Kawārij.\n Àwọn ènìyàn wọ̀nyí sì ń jáde sí àwọn ènìyàn pẹ̀lú àdìsọ́kàn burúkú yìí lẹ́yìn ìgbà tí wọ́n parí iṣẹ́ hajj. Àmọ́ lórí ìrìn-àjò náà, Allāhu fi wọ́n ṣe kòǹgẹ́ Sọhābah kan Jābir ọmọ ‘Abdullāh ’Ansọ̄riy - kí Allāhu yọ́nú sí àwọn méjèèjì -. Ó sì ṣàlàyé aburú àṣìgbọ́ wọn fún wọn. Wọ́n sì kúrò lórí ohun tí wọ́n ti dì sọ́kàn tẹ́lẹ̀ àfi ẹnì kan nínú wọn tí ó kọ òdodo náà. \n Ìṣẹ̀lẹ́ yìí tún fi hàn pé, àlòpọ̀ mọ́ra wọn ni al-Ƙur’ān alápọ̀n-ọ́nlé àti hadīth Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - tí ó fẹsẹ̀ rinlẹ̀. Bí bẹ́ẹ̀ kọ́, àṣìgbọ̀ ẹ̀sìn ni mùsùlùmí yóò máa kàkún àgbọ́yé ẹ̀sìn.)","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"wa-ammā alladhīna fasaqū famawāhumu al-nāru kullamā arādū an yakhrujū min'hā uʿīdū fīhā waqīla lahum dhūqū ʿadhāba al-nāri alladhī kuntum bihi tukadhibūna ","translations":["But as for","those who","are defiantly disobedient","then their refuge","(is) the Fire","Every time","they wish","to","come out","from it","they (will) be returned","in it","and it (will) be said","to them","Taste","(the) punishment","(of) the Fire","which","you used (to)","[in it]","deny","(20)"],"transliterationArr":["wa-ammā","alladhīna","fasaqū","famawāhumu","al-nāru","kullamā","arādū","an","yakhrujū","min'hā","uʿīdū","fīhā","waqīla","lahum","dhūqū","ʿadhāba","al-nāri","alladhī","kuntum","bihi","tukadhibūna",null],"verseTiming":[[1,0,1600],[2,1600,2600],[3,2600,3370],[4,3370,4880],[5,4880,8620],[6,8620,10930],[7,10930,13129],[8,13129,13399],[9,13399,14379],[10,14379,17319],[11,17319,18149],[12,18149,19179],[13,19179,19929],[14,19929,20949],[15,20949,21769],[16,21769,22279],[17,22279,23139],[18,23139,23879],[19,23879,25449],[20,25449,26209],[21,26209,28389],[22,28389,29089],[23,29089,32564]]}}