{"name":"33:34","price":"Ẹ rántí ohun tí wọ́n ń ké nínú ilé yín nínú àwọn āyah Allāhu àti ìjìnlẹ̀ òye (ìyẹn, sunnah Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a -). Dájúdájú Allāhu ń jẹ́ Aláàánú, Onímọ̀-ìkọ̀kọ̀.¹","arabic":"وَٱذۡكُرۡنَ مَا يُتۡلَىٰ فِي بُيُوتِكُنَّ مِنۡ ءَايَٰتِ ٱللَّهِ وَٱلۡحِكۡمَةِۚ إِنَّ ٱللَّهَ كَانَ لَطِيفًا خَبِيرًا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab","Chapter Al-Ahzab","Ahzab","Surah Ahzab","Chapter Ahzab","Al Ahzab","Surah Al Ahzab","Chapter Al Ahzab","Surah 33","Chapter 33","The Combined Forces","الأحزَاب"],"ayahNumber":3567,"juzNumber":22,"footnotes":"1. Àwọn àkíyèsí méjì kan ń bẹ lára gbogbo gbólóhùn àṣẹ tí ó wà nínú sūrah yìí láti āyah 28 sí 34. Àkíyèsí kìíní ni pé, àwọn tí Allāhu - tó ga jùlọ - dojú àwọn àṣẹ náà kọ ni àwọn ìyàwó Ànábì - kí Allāhu yọ́nú sí wọn -, ṣùgbọ́n kò sí àṣẹ kan nínú rẹ̀ tí ó yọ àwọn mùsùlùmí lóbìnrin yòókù sílẹ̀. Ìdí ni pé, àgbékalẹ̀ àwọn àṣẹ náà dúró fún gbígbèrò gbogbogbò pẹ̀lú dídojú-ọ̀rọ̀ kọ aṣíwájú. Nítorí náà, ẹ wo ìṣerẹ́gí láààrin gbólóhùn yìí “Ẹ má ṣe fi ara àti ọ̀ṣọ́ hàn níta gẹ́gẹ́ bí ti ìfara-fọ̀ṣọ́-hàn ìgbà àìmọ̀kan àkọ́kọ́ (ìyẹn, ṣíwájú kí ẹ tó di mùsùlùmí)...” àti gbólóhùn yìí “Kí wọ́n má ṣe ṣàfi hàn ọ̀ṣọ́ wọn àfi èyí tí ó bá hàn nínú rẹ̀…” èyí tí ó wà nínú sūrah an-Nūr; 24:31. \n Àkíyèsí kejì ni pé, èdè Lárúbáwá jẹ́ èdè jẹ́ńdà. Èdè jẹ́ńdà ni èdè tó ni ìhun ọ̀tọ̀ọ̀tọ̀ fún akọ àti abo. Ìyẹn ni pé, tí Lárúbáwá bá ń d’ojú ọ̀rọ̀ kọ ọkùnrin tàbí n̄ǹkan akọ tàbí ó ń sọ̀rọ̀ nípa ọkùnrin tàbí n̄ǹkan akọ, èdè Lárúbáwá ti ní ìhun akọ fún akọ. Bákan náà, tí Lárúbáwá bá ń d’ojú ọ̀rọ̀ kọ obìnrin tàbí n̄ǹkan abo tàbí ó ń sọ̀rọ̀ nípa obìnrin tàbí n̄ǹkan abo, èdè Lárúbáwá ti ní ìhun abo fún abo. Irúfẹ́ àbùdá yìí kò sí fún èdè Yorùbá. Ìhun akọ kò yàtọ̀ sí ìhun abo. \n Nítorí náà, gbogbo àwọn gbólóhùn àṣẹ tí Allāhu - tó ga jùlọ - mú wá nínú sūrah yìí láti āyah 28 sí 34 jẹ́ gbólóhùn àṣẹ fún ìhun abo nítorí pé, àwọn obìnrin ni Allāhu - tó ga jùlọ - ń sọ nípa wọn. Àwọn sì ni Ó ń dojú gbólóhùn àṣẹ náà kọ. \n Ẹ̀kọ́ pàtàkì tí a fẹ́ rí kọ́ nínú èyí ni pé, bí Allāhu - tó ga jùlọ - ṣe pàṣẹ ìjọ́sìn fún àwọn ọkùnrin, bẹ́ẹ̀ náà ni Ó ṣe pàṣẹ rẹ̀ fún àwọn obìnrin. Àti pé èèwọ̀ ni ohunkóhun tí ó bá lè sọ mùsùlùmí lóbìnrin di aláìgbàgbọ́ nípasẹ̀ níní ọkọ nítorí pé, obìnrin ní ẹ̀sìn. ’Islām sì ni ẹ̀sìn rẹ̀, ẹ̀sìn Allāhu. Ẹ̀rí apayànjẹ (= ẹ̀rí tó ń pa iyàn jíjà jẹ / ẹ̀rí tí kò ṣe é jà níyàn) ni bí Allāhu - tó ga jùlọ - ṣe ń sọ nípa ẹ̀san àwọn olújọ́sìn; Ó ń sọ ọ́ pẹ̀lú ìhun akọ àti ìhun abo láì fi àwọn obìnrin ṣe olùjọ́sìn afarahẹ. Ẹ wo āyah 35 nínú sūrah yìí àti sūrah āli ‘Imrọ̄n; 3:195, sūrah an-Nisā’; 4:124, sūrah an-Nahl; 16:97, sūrah Gọ̄fir; 40:40 àti sūrah al-Hujurāt; 49:13.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"wa-udh'kur'na mā yut'lā fī buyūtikunna min āyāti al-lahi wal-ḥik'mati inna al-laha kāna laṭīfan khabīran ","translations":["And remember","what","is recited","in","your houses","of","(the) Verses","(of) Allah","and the wisdom","Indeed","Allah","is","All-Subtle","All-Aware","(34)"],"transliterationArr":["wa-udh'kur'na","mā","yut'lā","fī","buyūtikunna","min","āyāti","al-lahi","wal-ḥik'mati","inna","al-laha","kāna","laṭīfan","khabīran",null],"verseTiming":[[1,0,990],[2,990,1360],[3,1360,2070],[4,2070,2490],[5,2490,4650],[6,4650,5010],[7,5010,5950],[8,5950,6690],[9,6690,8050],[10,8050,9290],[11,9290,10160],[12,10160,10840],[13,10840,11850],[14,11850,13695]]}}