{"name":"33:37","price":"(Rántí) nígbà tí ò ń sọ fún ẹni tí Allāhu ṣèdẹ̀ra fún, tí ìwọ náà ṣèdẹ̀ra fún¹ pé: “Mú ìyàwó rẹ dání, kí o sì bẹ̀rù Allāhu.” O sì ń fi pamọ́ sínú ẹ̀mí rẹ ohun tí Allāhu yó ṣàfi hàn rẹ̀. Àti pé ò ń páyà àwọn ènìyàn. Allāhu l’Ó sì lẹ́tọ̀ọ́ jùlọ pé kí o páyà Rẹ̀. Nígbà tí Zaed ti parí bùkátà rẹ̀ lọ́dọ̀ rẹ̀ (tí ó sì ti kọ̀ ọ́ sílẹ̀), A ti ṣe é ní ìyàwó fún ọ nítorí kí ó má baà jẹ́ láìfí fún àwọn onígbàgbọ́ òdodo láti fẹ́ ìyàwó ọmọ-ọlọ́mọ tí wọ́n ń pè ní ọmọ wọn nígbà tí wọ́n bá ti parí bùkátà wọn lọ́dọ̀ wọn (tí wọ́n sì ti kọ̀ wọ́n sílẹ̀). Àṣẹ Allāhu sì gbọ́dọ̀ ṣẹ.²","arabic":"وَإِذۡ تَقُولُ لِلَّذِيٓ أَنۡعَمَ ٱللَّهُ عَلَيۡهِ وَأَنۡعَمۡتَ عَلَيۡهِ أَمۡسِكۡ عَلَيۡكَ زَوۡجَكَ وَٱتَّقِ ٱللَّهَ وَتُخۡفِي فِي نَفۡسِكَ مَا ٱللَّهُ مُبۡدِيهِ وَتَخۡشَى ٱلنَّاسَ وَٱللَّهُ أَحَقُّ أَن تَخۡشَىٰهُۖ فَلَمَّا قَضَىٰ زَيۡدٞ مِّنۡهَا وَطَرٗا زَوَّجۡنَٰكَهَا لِكَيۡ لَا يَكُونَ عَلَى ٱلۡمُؤۡمِنِينَ حَرَجٞ فِيٓ أَزۡوَٰجِ أَدۡعِيَآئِهِمۡ إِذَا قَضَوۡاْ مِنۡهُنَّ وَطَرٗاۚ وَكَانَ أَمۡرُ ٱللَّهِ مَفۡعُولٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab","Chapter Al-Ahzab","Ahzab","Surah Ahzab","Chapter Ahzab","Al Ahzab","Surah Al Ahzab","Chapter Al Ahzab","Surah 33","Chapter 33","The Combined Forces","الأحزَاب"],"ayahNumber":3570,"juzNumber":22,"footnotes":"1. Ẹni yìí ni Zaed ọmọ Hārithah - kí Allāhu yọ́nú sí i -. Ìdẹ̀ra Allāhu lórí rẹ̀ ni pé, Allāhu ṣe é ní mùsùlùmí. Ìdẹ̀ra Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - lórí rẹ̀ ni pé, Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - mú un kúrò lóko ẹrú. Ó sọ ọ́ di olómìnira. \n 2. Ohun tí Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - fi pamọ́ sínú ẹ̀mí rẹ̀ ni gbólóhùn yìí: “Nígbà tí Zaed ti parí bùkátà rẹ̀ lọ́dọ̀ rẹ̀ (tí ó sì ti kọ̀ ọ́ sílẹ̀), A ti ṣe é ní ìyàwó fún ọ …”. Àmọ́ kàkà kí Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - kéde gbólóhùn yìí fún àwọn mùsùlùmí, kí ó sì jíṣẹ́ fún Zaed, ńṣe ni Ànábì ń sọ fún un pé: “Mú ìyàwó rẹ dání...” \n Ohun tí ó sì fa èyí fún Ànábì wa - kí ìkẹ́ àti ọlà Allāhu máa bá a - ni pé, kí àwọn ṣọ̀bẹ-ṣèlu mùsùlùmí àti àwọn aláìgbàgbọ́ má baà wí pé: “Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - l’ó fi Zaenab fún Zaed, ọmọ rẹ̀. Ó tún fi ìyàwó tí ọmọ rẹ̀ kọ̀ sílẹ̀ ṣaya…”. Zaed kì í sì ṣe ọmọ Ànábì wa - kí ìkẹ́ àti ọlà Allāhu máa bá a -. Hārithah ni bàbá tó bí Zaed lọ́mọ. Ìṣẹ̀lẹ̀ yìí ni ìdí tí àwọn aṣíwájú rere - kí Allāhu kẹ́ wọn - fi sọ pé, nínú gbogbo āyah al-Ƙur’ān alápọ̀n-ọ́nlé kò sí èyí tí ó lágbára lára Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - láti fi jíṣẹ́ fún àwọn ènìyàn bí kò ṣe āyah: “Nígbà tí Zaed ti parí bùkátà rẹ̀ lọ́dọ̀ rẹ̀ (tí ó sì ti kọ̀ ọ́ sílẹ̀), A ti ṣe é ní ìyàwó fún ọ …”. Nítorí náà, ẹ jìnnà sí àwọn ìtànkítàn tí àwọn nasọ̄rọ̄ bá ń sọ kiri nípa ìṣẹ̀lẹ̀ náà, kò sí èyí tí ó fẹsẹ̀ rinlẹ̀ nínú rẹ̀ àfi èyí tí A sọ sókè yìí.\n Kíyè sí i, bóyá ni Ànábì tàbí Òjíṣẹ́ kan nínú àwọn Òjíṣẹ́ Allāhu - kí ọlà Allāhu máa bá wọn - wà tí àwọn ọ̀tá ẹ̀sìn ’Islām kì í sọ ìsọkúsọ nípa rẹ̀. Ìṣe àti àṣà wọn nìyẹn. Ẹni tí a sì lérò pé àwọn nasọ̄rọ̄ máa pọ́nlé, ohun tí wọ́n tún sọ nípa rẹ̀ ju fífi ẹ̀sùn ìyàwó púpọ̀ kan Ànábì wa - kí ìkẹ́ àti ọlà Allāhu máa bá a - àti fífẹ́ tí ó fẹ́ Zaenab tí Zaed kọ̀ sílẹ̀. Pípè tí àwọn nasọ̄rọ̄ ń pe Ànábì ‘Īsā ni ọmọ Allāhu, pípè tí wọ́n ń pè é ní ọlọ́hun ọmọ, pípè tí wọ́n ń pè é ní olúwa àti olùgbàlà, ó burú yéye ju fífi ẹ̀sùn ìyàwó púpọ̀ kan Ànábì wa - kí ìkẹ́ àti ọlà Allāhu máa bá a -, gẹ́gẹ́ bí Allāhu ti ṣe pe àkíyèsí wa sí aburú rẹ̀ nínú sūrah Mọryam; 19:88 - 95. Àmọ́ àwọn nasọ̄rọ̄ kò fura!","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"wa-idh taqūlu lilladhī anʿama al-lahu ʿalayhi wa-anʿamta ʿalayhi amsik ʿalayka zawjaka wa-ittaqi al-laha watukh'fī fī nafsika mā al-lahu mub'dīhi watakhshā al-nāsa wal-lahu aḥaqqu an takhshāhu falammā qaḍā zaydun min'hā waṭaran zawwajnākahā likay lā yakūna ʿalā al-mu'minīna ḥarajun fī azwāji adʿiyāihim idhā qaḍaw min'hunna waṭaran wakāna amru al-lahi mafʿūlan ","translations":["And when","you said","to the one","Allah bestowed favor","Allah bestowed favor","on him","and you bestowed favor","on him","Keep","to yourself","your wife","and fear","Allah","But you concealed","within","yourself","what","Allah","(was to) disclose","And you fear","the people","while Allah","has more right","that","you (should) fear Him","So when","ended","Zaid","from her","necessary (formalities)","We married her to you","so that","not","there be","on","the believers","any discomfort","concerning","the wives","(of) their adopted sons","when","they have ended","from them","necessary (formalities)","And is","(the) Command","(of) Allah","accomplished","(37)"],"transliterationArr":["wa-idh","taqūlu","lilladhī","anʿama","al-lahu","ʿalayhi","wa-anʿamta","ʿalayhi","amsik","ʿalayka","zawjaka","wa-ittaqi","al-laha","watukh'fī","fī","nafsika","mā","al-lahu","mub'dīhi","watakhshā","al-nāsa","wal-lahu","aḥaqqu","an","takhshāhu","falammā","qaḍā","zaydun","min'hā","waṭaran","zawwajnākahā","likay","lā","yakūna","ʿalā","al-mu'minīna","ḥarajun","fī","azwāji","adʿiyāihim","idhā","qaḍaw","min'hunna","waṭaran","wakāna","amru","al-lahi","mafʿūlan",null],"verseTiming":[[1,0,600],[2,600,1360],[3,1360,3450],[4,3450,4100],[5,4100,4900],[6,4900,5720],[7,5720,6790],[8,6790,7590],[9,7590,8210],[10,8210,9110],[11,9110,9910],[12,9910,10620],[13,10620,12410],[14,12410,13780],[15,13780,14570],[16,14570,15420],[17,15420,16150],[18,16150,16930],[19,16930,17870],[20,17870,18310],[21,18310,19070],[22,19070,19200],[23,19200,19980],[24,19980,20870],[25,20870,21590],[26,21590,24660],[27,24660,25400],[28,25400,27020],[29,27020,27960],[30,27960,28650],[31,28650,29480],[32,29480,32310],[33,32310,34330],[34,34330,34920],[35,34920,35540],[36,35540,37190],[37,37190,38340],[38,38340,40170],[39,40170,40500],[40,40500,41050],[41,41050,41770],[42,41770,42230],[43,42230,43490],[44,43490,44180],[45,44180,45080],[46,45080,45630],[47,45630,46410],[48,46410,46790],[49,46790,48170],[50,48170,49540],[51,49540,51290],[52,51290,52240],[53,52240,55030],[54,55030,55550],[55,55550,56180],[56,56180,57740],[57,57740,59010],[58,59010,59680],[59,59680,60280],[60,60280,61020],[61,61020,62625]]}}