{"name":"33:40","price":"(Ànábì) Muhammad kì í ṣe bàbá ẹnì kan kan nínú àwọn ọkùnrin yín, ṣùgbọ́n (ó jẹ́) Òjíṣẹ́ Allāhu àti òpin àwọn Ànábì.¹ Allāhu sì ń jẹ́ Onímọ̀ nípa gbogbo n̄ǹkan.","arabic":"مَّا كَانَ مُحَمَّدٌ أَبَآ أَحَدٖ مِّن رِّجَالِكُمۡ وَلَٰكِن رَّسُولَ ٱللَّهِ وَخَاتَمَ ٱلنَّبِيِّـۧنَۗ وَكَانَ ٱللَّهُ بِكُلِّ شَيۡءٍ عَلِيمٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab","Chapter Al-Ahzab","Ahzab","Surah Ahzab","Chapter Ahzab","Al Ahzab","Surah Al Ahzab","Chapter Al Ahzab","Surah 33","Chapter 33","The Combined Forces","الأحزَاب"],"ayahNumber":3573,"juzNumber":22,"footnotes":"1. Ìtúmọ̀ “Ànábì” ni olùgba-wáhàyí, arímìsíígbà tàbí onímìísí. Ìmísí yìí náà sì ni ó máa fi jíṣẹ́ fún àwọn ìjọ rẹ̀. Èyí túmọ̀ sí pé, kò sí ẹni tí ó lè di Òjíṣẹ́ Allāhu (afìmísíjíṣẹ́) àfi kí ó kọ́kọ́ jẹ́ Ànábì (arímìsíígbà). Ìmísí mímọ́ náà ni ó máa jẹ́ òfin ẹ̀sìn fún onímìísí náà àti ìjọ rẹ̀. Fún wí pé Ànábì wa - kí ìkẹ́ àti ọlà Allāhu máa bá a - ni “kātamu-nnabiyyīn” òpin àwọn arímìsíígbà, kò lè sí afìmísíjíṣẹ́ kan kan mọ́ lẹ́yìn rẹ̀. \n Ìtúmọ̀ “kātamu-nnabiyyīn” nìyí nínú ẹ̀gbàwá Jubaer ọmọ Mut‘im - kí Allāhu yọ́nú sí i -, Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - sọ pé: “(Orúkọ mi nìwọ̀nyí): èmi ni Muhammad. Èmi ni ’Ahmad. Èmi ni Mọ̄hi - ẹni tí Allāhu fi pa àìgbàgbọ́ rẹ́. - Èmi ni Hāṣir - ẹni tí wọn yóò kó àwọn ènìyàn jọ lẹ́yìn rẹ̀ fún àjíǹde. - Èmi sì ni ‘Āƙib, ẹni tí kò níí sí Ànábì kan mọ́ lẹ́yìn rẹ̀.” (Muslim). \n Kíyè sí i, àwọn kan bíi ijọ Ahmadiyyah kò gbàgbọ́ pé, Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - ni òpin àwọn Ànábì àti àwọn Òjíṣẹ́ Allāhu. Wọ́n kọ́kọ́ fún “kātamu-nnabiyyīn” ní ìtúmọ̀ tó yàtọ̀ sí èròǹgbà Allāhu nínú āyah náà. Wọ́n ní “òrùka òòlù àwọn Ànábì” ni ìtúmọ̀ “kātamu-nnabiyyīn”. Lẹ́yìn náà, ìjọ Ahmadiyyah sọ pé, “Ànábì àti Òjíṣẹ́ Allāhu tí ó dìde nínú ìlú Ƙọ̄diyan, nílẹ̀ India tún ni olùdásílẹ́ ìjọ Ahmadiyyah, mirza ghulam Ahmad.” Lẹ́yìn náà, wọ́n tún sọ pé, “Mirza ghulam Ahmad tún ni Imam Mahdi tí à ń retí lópin ayé.” Lẹ́yìn náà, wọ́n tún sọ pé, “Mirza ghulam Ahmad tún ni Mọsīh, ‘Īsā ọmọ Mọryam tí à ń retí lópin ayé.” Lẹ́yìn náà, wọ́n tún sọ pé, “Mirza ghulam Ahmad tún sọ àwọn ẹgbẹẹgbẹ̀rún nínú ìjọ rẹ̀ di ànábì.” \n Èsì: Ní àkọ́kọ́ ná, fúnra Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - àti àwọn Sọhābah - kí Allāhu yọ́nú sí wọn - ló túmọ̀ “kātamu-nnabiyyīn” sí “òpin àwọn Ànábì”. Ìṣìnà pọ́nńbélé ni fún ẹnikẹ́ni láti túmọ̀ “kātamu-nnabiyyīn” sí n̄ǹkan mìíràn. “Òpin àwọn Ànábì” sì ni gbogbo tírà Tafsīr túmọ̀ “kātamu-nnabiyyīn” sí. Kò sì sí ìyapa-ẹnu láààrin gbogbo àwọn onímọ̀ ẹ̀sìn ’Islām lórí títúmọ̀ “kātamu-nnabiyyīn” sí “òpin àwọn Ànábì”. Dandan sì ni kí á gbógun ti ẹnikẹ́ni tí ó bá yapa ìpanupọ̀ àwọn onímọ̀ ẹ̀sìn ’Islām. \n Lẹ́yìn náà, ní ti arákùnrin tí wọ́n ń pè ní mirza ghulam Ahmad, òpùrọ́ asòòkùn sẹ́sìn wulẹ̀ ni òun. Irọ́ ẹnu rẹ̀ ti pọ̀ jù. Alágbárí pọ́nńbélé sì ni pẹ̀lú. Irú iṣẹ́ aburú tí ṣeeu Ahmada Tijāni ṣe fún ’Islām gẹ́lẹ́ náà ni mirza ghulam Ahmad ṣe. Àwọn méjèèjì ni Pọ́ọ̀lù láààrin àwa mùsùlùmí.\n Ẹ wo díẹ̀ nínú irọ́ ńlá rẹ̀. Mirza ghulam Ahmad sọ pé: “Allāhu sọ fún mi ní èdè Lárúbáwá pé, bí ọmọ Mi ló ṣe wà sí Mi.” (Tadhkirah, 362) Ṣé Allāhu bímọ ni? Ṣebí àwọn nasọ̄rọ̄ ló ń parọ́mọ́ Ọlọ́hun pé Ó bímọ, Allāhu - subhānahu wa ta‘ālā - kò bímọ, kò sì sọ ẹnì kan kan di ọmọ Rẹ̀. \n Irọ́ mìíràn nìyí láti ẹnu mirza ghulām Ahmad, ó sọ pé: “Allāhu sọ fún mi ní èdè Lárúbáwá pé, ìwọ wá láti ara Mi; Èmi náà wá láti ara rẹ.” (Tadhkirah, ojú ewé 295) Ṣebí àwọn nasọ̄rọ̄ l’ó máa ń sọ pé ọlọ́hun tó wá láwòrán ọmọ ni Ànábì 'Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a -! Ṣé ẹ̀ ń rí ìjọra láààrin ìjọ Ahmadiyyah àti àwọn nasọ̄rọ̄ báyìí. \n Irọ́ mìíràn nìyí láti ẹnu mirza ghulām Ahmad, ó sọ pé: “Nínú ìríran ẹ̀mí, mo rí ara mi pé èmi gan-an ni Allāhu. Mo sì ní ìgbàgbọ́ pé èmi gan-an nìyẹn.” (Tadhkirah, 118) Ẹ wo bí ó ṣe sọra rẹ̀ di ọlọ́hun! \n Lẹ́yìn náà, ẹ wo ìtọsẹ̀-ọ̀rọ̀ sūrah an-Nisā’; 4:158 kí ẹ rí bí ó ṣe sọra rẹ̀ di Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a -. Nítorí náà, ẹ ṣọ́ra fún òun àti ìjọ rẹ̀. Ẹ má ṣe jẹ́ kí wọ́n tàn yín jẹ. Àti òun àti ṣeeu Ahmada Tijāniy, wọ́n wáyé láti wá tako Allāhu àti Òjíṣẹ́ Rẹ̀ ni ní ọ̀nà ẹkọrọ lórúkọ ’Islām. \n Síwájú sí i, àwọn kan tún sọ pé, “Tí ó bá jẹ́ pé Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - ni òpin àwọn Ànábì Ọlọ́hun, kò yẹ fún Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - láti padà wá sáyé mọ́ lópin ayé.” Wọ́n tún sọ pé, “Ìgbàgbọ́ àwọn nasọ̄rọ̄ lásán ni ìgbàgbọ́ nínú ìpadàbọ̀ Ànábì ‘Īsā ọmọ Mọryam lópin ayé. Kì í ṣe ìgbàgbọ́ ’Islām rárá.” \n Èsì: Ní ti àwọn wọ̀nyí, wọ́n gbà pé, Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - ni òpin àwọn Ànábì Ọlọ́hun, àmọ́ ìṣòro tiwọn ni pé, wọn kò gbàgbọ́ pé Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - wà nípò ẹni tí kò ì kú, wọn kò sì gbàgbọ́ pé Ànábì ‘Īsā ọmọ Mọryam ń padà bọ̀ lópin ayé. Ọ̀gá ìṣòro àwọn wọ̀nyí ni pé, wọ́n wọ́gilé gbogbo hadīth tó fẹsẹ̀ rinlẹ̀ nínú Bukọ̄riy àti Muslim lórí ìpadàbọ̀ Ànábì ‘Īsā ọmọ Mọryam lópin ayé. Àwọn hadith náà sì pọ̀ púpọ̀, wọ́n fẹsẹ̀ rinlẹ̀, wọn kò sì ní pọ́n-na rárá. Àmọ́ èrò-ọkàn àwọn ènìyàn wọ̀nyẹn ni pé, àwọn hadīth náà tako āyah tí àwọn ń túmọ̀ sí ikú Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a -.\n Ẹ wo bí wọ́n ṣe ń tinú wàhálà kan bọ́ sínú wàhálà mìíràn lórí ọ̀rọ̀ Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a -. Àdánwò kúkú ṣọ̀tọ̀ọ̀tọ̀. Kí Allāhu kó wa yọ. Àmọ́ sá, ẹ lọ ka ìtọsẹ̀-ọ̀rọ̀ sūrah āli-’Imrọ̄n; 3:55 àti sūrah an-Nisā’; 4:157 kí ẹ lè rí àlàyé apayànjẹ lórí pé Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - kò ì kú, ó wà ní ààyè, ó sì ń padà bọ̀ lópin ayé. Ẹ tún ka ìtọsẹ̀-ọ̀rọ̀ sūrah al-Hajj 22:75.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"mā kāna muḥammadun abā aḥadin min rijālikum walākin rasūla al-lahi wakhātama al-nabiyīna wakāna al-lahu bikulli shayin ʿalīman ","translations":["Not","is","Muhammad","(the) father","(of) anyone","of","your men","but","(he is the) Messenger","(of) Allah","and Seal","(of) the Prophets","And Allah is","And Allah is","of every","thing","All-Knower","(40)"],"transliterationArr":["mā","kāna","muḥammadun","abā","aḥadin","min","rijālikum","walākin","rasūla","al-lahi","wakhātama","al-nabiyīna","wakāna","al-lahu","bikulli","shayin","ʿalīman",null],"verseTiming":[[1,0,390],[2,390,940],[3,940,2720],[4,2720,4460],[5,4460,5050],[6,5050,5950],[7,5950,7290],[8,7290,8200],[9,8200,9000],[10,9000,11400],[11,11400,12140],[12,12140,12950],[13,12950,13790],[14,13790,14900],[15,14900,18150],[16,18150,18800],[17,18800,19630],[18,19630,20350],[19,20350,21090],[20,21090,22675]]}}