{"name":"33:52","price":"Kò lẹ́tọ̀ọ́ fún ọ (láti fẹ́) àwọn obìnrin (mìíràn) lẹ́yìn (ìsọ̀rí àwọn obìnrin tí A ti sọ ṣíwájú¹, kò sì lẹ́tọ̀ọ́ fún ọ) láti fi àwọn obìnrin (mìíràn) pààrọ̀ wọn, kódà kí dáadáa wọn jọ ọ́ lójú, àfi àwọn ẹrú rẹ. Allāhu sì ń jẹ́ Olùṣọ́ lórí gbogbo n̄ǹkan.²","arabic":"لَّا يَحِلُّ لَكَ ٱلنِّسَآءُ مِنۢ بَعۡدُ وَلَآ أَن تَبَدَّلَ بِهِنَّ مِنۡ أَزۡوَٰجٖ وَلَوۡ أَعۡجَبَكَ حُسۡنُهُنَّ إِلَّا مَا مَلَكَتۡ يَمِينُكَۗ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَيۡءٖ رَّقِيبٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab","Chapter Al-Ahzab","Ahzab","Surah Ahzab","Chapter Ahzab","Al Ahzab","Surah Al Ahzab","Chapter Al Ahzab","Surah 33","Chapter 33","The Combined Forces","الأحزَاب"],"ayahNumber":3585,"juzNumber":22,"footnotes":"1. Ìyẹn nínú āyah 50.\n 2. Āyah yìí kò túmọ̀ sí pé kí Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - má ṣe fẹ́ ìyàwó kún àwọn ìyàwó rẹ̀ ní àsìkò tí āyah yìí sọ̀kalẹ̀, àmọ́ kò gbọ́dọ̀ fẹ́ obìnrin kan àyàfi nínú àwọn ìsọ̀rí obìnrin tí Allāhu ti ṣe ní ẹ̀tọ́ fún un nínú āyah 50. \n Lẹ́yìn náà, āyah yìí kọ̀ fún Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - láti yọ èyíkéyìí ìyàwó rẹ̀ kúrò ní ipò ìyá àwọn onígbàgbọ́ òdodo nípasẹ̀ ìkọ̀sílẹ̀ àfi ìyàwó tí ó bá jẹ́ ẹrú ogun ní ìpìlẹ̀. Ìyá wa ‘Ā’iṣah - kí Allāhu yọ́nú sí i - sọ pé: “Òjíṣẹ́ Allāhu kò tí ì kú títí Allāhu fi ṣe àwọn obìnrin ayé ní ẹ̀tọ́ fún un láti fẹ́.” Ìyẹn ni pé, Òjíṣẹ́ Allāhu - kí ìkẹ́ àti ọlà Allāhu máa bá a - lẹ́tọ̀ọ́ láti máa fẹ́ ìyàwó lọ́ títí ọjọ́ ikú rẹ̀. \n Kíyè sí i, Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - kọ ìyá wa Hafsọh ọmọ ‘Umar sílẹ̀, lẹ́yìn náà ó fẹ́ ẹ padà. Bákan náà, Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - gbèrò láti kọ ìyá wa Saodah sílẹ̀. Èyí sì ni ó ṣokùnfà tí Saodah - kí Allāhu yọ́nú sí i - fi yọ̀ǹda ọjọ́ tirẹ̀ fún ‘Ā’iṣah - kí Allāhu yọ́nú sí i -. Àwọn ìṣẹ̀lẹ̀ méjèèjì yìí ti ṣẹlẹ̀ ṣíwájú ìsọ̀kalẹ̀ āyah yìí. (at-Tọbariy). \n Nítorí náà, kí Ànábì fẹ́ ìyàwó kún àwọn ìyàwó rẹ̀ láì ní ẹnu ààlà, láì sì gbọdọ̀ tìtorí èyí kọ òmíràn sílẹ̀, àfi ẹrú ogun, èyí tún jẹ́ n̄ǹkan ẹ̀ṣà tí Allāhu fi ṣà á lẹ́ṣà. Ìdí ni pé, òǹkà ìyàwó mùsùlùmí kò gbọdọ̀ tayọ mẹ́rin ní abẹ́ àkóṣo rẹ̀. Tí òǹkà ìyàwó Mùsùlùmí bá sì pé mẹ́rin, mùsùlùmí lè kọ ọ̀kan sílẹ̀ láti lè fi òmíràn jìrọ̀ rẹ̀, ìyẹn nígbà tí ọ̀rọ̀ rẹ̀ bá jẹmọ́ bẹ́ẹ̀ pẹ̀lú ìbẹ̀rù Allāhu tàbí ẹnì kan kú nínú wọn. Ẹ wo sūrah an-Nisā’;4:3 àti 20 - 21.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"lā yaḥillu laka al-nisāu min baʿdu walā an tabaddala bihinna min azwājin walaw aʿjabaka ḥus'nuhunna illā mā malakat yamīnuka wakāna al-lahu ʿalā kulli shayin raqīban ","translations":["(It is) not","lawful","for you","(to marry) women","after (this)","after (this)","and not","to","exchange","them","for","(other) wives","even if","pleases you","their beauty","except","whom","you rightfully possess","you rightfully possess","And Allah is","And Allah is","over","all","things","an Observer","(52)"],"transliterationArr":["lā","yaḥillu","laka","al-nisāu","min","baʿdu","walā","an","tabaddala","bihinna","min","azwājin","walaw","aʿjabaka","ḥus'nuhunna","illā","mā","malakat","yamīnuka","wakāna","al-lahu","ʿalā","kulli","shayin","raqīban",null],"verseTiming":[[1,0,470],[2,470,1210],[3,1210,1590],[4,1590,4250],[5,4250,4990],[6,4990,5650],[7,5650,7320],[8,7320,8130],[9,8130,9130],[10,9130,10370],[11,10370,10710],[12,10710,12390],[13,12390,12880],[14,12880,13780],[15,13780,15400],[16,15400,16210],[17,16210,16570],[18,16570,17290],[19,17290,18210],[20,18210,19250],[21,19250,20080],[22,20080,20690],[23,20690,21300],[24,21300,21990],[25,21990,24315]]}}