{"name":"33:56","price":"Dájúdájú Allāhu àti àwọn mọlāika Rẹ̀ ń kẹ́ Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a -. Ẹ̀yin tí ẹ gbàgbọ́ ní òdodo, ẹ tọrọ ìkẹ́ fún un, kí ẹ sì kí i ní kíkí àlàáfíà.¹","arabic":"إِنَّ ٱللَّهَ وَمَلَٰٓئِكَتَهُۥ يُصَلُّونَ عَلَى ٱلنَّبِيِّۚ يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ صَلُّواْ عَلَيۡهِ وَسَلِّمُواْ تَسۡلِيمًا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab","Chapter Al-Ahzab","Ahzab","Surah Ahzab","Chapter Ahzab","Al Ahzab","Surah Al Ahzab","Chapter Al Ahzab","Surah 33","Chapter 33","The Combined Forces","الأحزَاب"],"ayahNumber":3589,"juzNumber":22,"footnotes":"1. Níkété tí Allāhu - tó ga jùlọ - sọ āyah yìí kalẹ̀ ni àwọn Sọhābah -kí Allāhu yọ́nú sí wọn - bèèrè ohun tí àwọn náà yóò fi máa tọrọ ìkẹ́ fún Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a -. Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - sì kọ́ wọn ní as-sọlātu al-’Ibrọ̄hīmiyyah. Ẹ̀gbàwá kan nìyí: \n اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ.\n Allahummọ sọlli ‘alā Muhammadin wa ‘alā āli Muhammadin kamọ̄ sọllaeta ‘alā āli ’Ibrọ̄hīmọ ’innaka Hamīdun Mọjīd. Allahummọ bārik ‘alā Muhammadin wa ‘alā āli Muhammadin kamọ̄ bārọkta ‘alā āli ’Ibrọ̄hīmọ ’innaka Hamīdun Mọjīd (Allāhu kẹ́ Ànábì Muhammad àti àwọn ará ilé Ànábì Muhammad gẹ́gẹ́ bí Ó ṣe kẹ́ ará ilé Ànábì ’Ibrọ̄hīm, dájúdájú Ìwọ ni Ẹlẹ́yìn, Ológo. Allāhu bùkún Ànábì Muhammad àti àwọn ará ilé Ànábì Muhammad gẹ́gẹ́ bí Ó ṣe bùkún ará ilé Ànábì ’Ibrọ̄hīm, dájúdájú Ìwọ ni Ẹlẹ́yìn, Ológo.) Bukọ̄riy àti Muslim\n Gbólóhùn wọ̀nyí tún tọ sunnah; “sọlla-llāhu ‘aleehi wa sallam” tàbí “‘aleehi sọlātun wa salām.” ìyẹn nígbàkígbà tí wọ́n bá dárúkọ rẹ̀. Èyí sì jẹ́ ohun àjogúnbá láti ọ̀dọ̀ gbogbo àwọn Sọhābah rẹ̀ - kí Allāhu yọ́nú sí gbogbo wọn -. \n Kíyè sí i, kò sí aburú níbi kí mùsùlùmí máa sọ̀rọ̀ lọ́wọ́ kí ó sì fi gbólóhùn kan ní ọ̀dọ̀ ara rẹ̀ tọrọ ìkẹ́, ọlà àti ìbùkún fún Ànábì wa. Irú ẹni bẹ́ẹ̀ kò tí ì dáràn nítorí pé, àwọn Sọhābah náa - kí Allāhu yọ́nú sí wọn - máa ń ṣe bẹ́ẹ̀. Ẹ̀yin náà ẹ wo bí àwọn àáfà sunnah ṣe ń ṣe asọlātu fún Ànábì nínú àwọn ọ̀rọ̀ ìṣáájú nínú àwọn tírà wọn. Kò sí aburú nínú èyí rárá. Ṣùgbọ́n mùsùlùmí yóò ṣe àgbékalẹ̀ ìhun asọlātu dáràn tí ó bá fi lè kó sínú ọ̀kan nínú àwọn n̄ǹkan mẹ́fà kan. \n Ìkíní: Lílo àwọn ọ̀rọ̀ tí ó lòdì sí òfin àti àdìsọ́kàn ’Islām nínú àwọn gbólóhùn asọlātu náà.\n Ìkejì: Sísọ gbólóhùn asọlātu yẹn gan-angan-an di ìlànà tí wọn yóò máa pèpè sí, tí irúfẹ́ gbólóhùn náà yóò fi wá dà bí ẹni pé hadīth kan l’ó gbà á wá, tí kò sì rí bẹ́ẹ̀. \n Ìkẹta: Ṣíṣe àgbékalẹ̀ òǹkà kan tàbí àsìkò kan tàbí ọjọ́ kan ní pàtó fún ṣíṣe irúfẹ́ asọlātu àdáhun náà. \n Ìkẹrin: Ṣíṣe àgbékalẹ̀ ìlànà kan ní pàtó fún ṣíṣe irúfẹ́ asọlātu àdáhun náà, bí kí wọ́n wí pé ẹnì kan kò gbọdọ̀ kà á àfi pẹ̀lú àlùwàlá. \n Ìkarùn-ún: Ṣíṣe àgbékalẹ̀ láádá fún irúfẹ́ asọlātu àdáhun náà, tí èyí yó sì bí níní àdìsọ́kàn nípa àwọn láádá àgbélẹ̀rọ náà. \n Ìkẹfà: Kíka irúfẹ́ asọlātu àdáhun náà kún ìmísí mímọ́ láti ọ̀dọ̀ Allāhu tàbí ṣíṣe àfitì irúfẹ́ asọlātu àdáhun náà sí ọ̀dọ̀ Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - ní ti irọ́. \n Àwọn n̄ǹkan mẹ́fẹ̀ẹ̀fà wọ̀nyí l’ó ṣe àkóbá ńlá fún àwọn asọlātu àdáhun kan bíi sọlātul-fātih, sọlātu tunjīnā, sọlātul-gaebiyyah, sọlātu rọf‘il-’a‘mọ̄l, sọlātul-kamsah, jaoharatul-kamọ̄l, dalā’ilul-kaerāt, sọlawātul-kibrītu al-’ahmọr àti bẹ́ẹ̀ bẹ́ẹ̀ lọ. Àwọn onisūfi ni wọ́n ṣe àdádáálẹ̀ àwọn asọlātu aburú wọ̀nyẹn sínú ẹ̀sìn. Ìṣìnà àti òfò pọ́nńbélé sì ni gbogbo wọn.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"inna al-laha wamalāikatahu yuṣallūna ʿalā al-nabiyi yāayyuhā alladhīna āmanū ṣallū ʿalayhi wasallimū taslīman ","translations":["Indeed","Allah","and His Angels","send blessings","upon","the Prophet","O you who believe","O you who believe","O you who believe","Send blessings","on him","and greet him","(with) greetings","(56)"],"transliterationArr":["inna","al-laha","wamalāikatahu","yuṣallūna","ʿalā","al-nabiyi","yāayyuhā","alladhīna","āmanū","ṣallū","ʿalayhi","wasallimū","taslīman",null],"verseTiming":[[1,0,1080],[2,1080,2000],[3,2000,5120],[4,5120,6350],[5,6350,6720],[6,6720,8440],[7,8440,11770],[8,11770,12740],[9,12740,13750],[10,13750,14590],[11,14590,15360],[12,15360,16510],[13,16510,18415]]}}