{"name":"33:72","price":"Dájúdájú Àwa fi àgbàfipamọ́ (iṣẹ́ ẹ̀sìn àṣegbaláádá) lọ àwọn sánmọ̀ àti ilẹ̀ àti àpáta. Wọ́n kọ̀ láti gbé e; wọ́n páyà rẹ̀. Ènìyàn sì gbé e. Dájúdájú (ènìyàn) jẹ́ alábòsí, aláìmọ̀kan.¹","arabic":"إِنَّا عَرَضۡنَا ٱلۡأَمَانَةَ عَلَى ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَٱلۡجِبَالِ فَأَبَيۡنَ أَن يَحۡمِلۡنَهَا وَأَشۡفَقۡنَ مِنۡهَا وَحَمَلَهَا ٱلۡإِنسَٰنُۖ إِنَّهُۥ كَانَ ظَلُومٗا جَهُولٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab","Chapter Al-Ahzab","Ahzab","Surah Ahzab","Chapter Ahzab","Al Ahzab","Surah Al Ahzab","Chapter Al Ahzab","Surah 33","Chapter 33","The Combined Forces","الأحزَاب"],"ayahNumber":3605,"juzNumber":22,"footnotes":"1. Àgbàfipamọ́ ni ìtúmọ̀ “ ’amọ̄nah”. Èyí sì túmọ̀ sí ohun tí wọ́n gbé lé wa lọ́wọ́ fún ṣíṣọ́ àti àmójútó. Ohun tí Allāhu - tó ga jùlọ - gbélé wa lọ́wọ́ tí a óò máa ṣọ́, tí a óò máa ṣe àmójútó rẹ̀ títí di ọjọ́ ikú ẹnì kọ̀ọ̀kan wa ni ẹ̀sìn Rẹ̀, ’Islām. Allāhu sì gbé ẹ̀sìn náà kalẹ̀ pẹ̀lú ẹ̀san. Ìyẹn ni pé, ẹni tí ó bá rí i ṣe gẹ́gẹ́ bí Allāhu ṣe gbé e kalẹ̀, ó máa gba láádá lórí rẹ̀. Àwọn sánmọ̀, ilẹ̀ àti àpáta gbà láti máa ṣàfọ̀mọ́ fún Allāhu, àmọ́ wọ́n ní àwọn kò bùkátà sí láádá. Ènìyàn tẹ́wọ́ gba ẹ̀sìn àṣegbaláádá tán, ó di wàhálà sí wọn lọ́rùn nítorí pé, wọn kò mọ̀ pé tí ṣíṣe n̄ǹkan bá la láádá lọ, àìṣe rẹ̀ máa la ìyà lọ. Ìbá kúkú ṣuwọ̀n fún ènìyàn àti àlùjànnú láti ṣe ẹ̀sìn láì retí láádá kan tayọ ìtẹ̀lé-àṣẹ Allāhu nìkan ṣoṣo gẹ́gẹ́ bí àwọn ẹ̀dá yòókù ṣe gbà á.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"innā ʿaraḍnā al-amānata ʿalā al-samāwāti wal-arḍi wal-jibāli fa-abayna an yaḥmil'nahā wa-ashfaqna min'hā waḥamalahā al-insānu innahu kāna ẓalūman jahūlan ","translations":["Indeed, We","[We] offered","the Trust","to","the heavens","and the earth","and the mountains","but they refused","to","bear it","and they feared","from it","but bore it","the man","Indeed, he","was","unjust","ignorant","(72)"],"transliterationArr":["innā","ʿaraḍnā","al-amānata","ʿalā","al-samāwāti","wal-arḍi","wal-jibāli","fa-abayna","an","yaḥmil'nahā","wa-ashfaqna","min'hā","waḥamalahā","al-insānu","innahu","kāna","ẓalūman","jahūlan",null],"verseTiming":[[1,0,1500],[2,1500,2290],[3,2290,3490],[4,3490,3870],[5,3870,5270],[6,5270,6230],[7,6230,7340],[8,7340,8260],[9,8260,8620],[10,8620,10600],[11,10600,12070],[12,12070,12360],[13,12360,14330],[14,14330,15490],[15,15490,16230],[16,16230,17180],[17,17180,21270],[18,21270,22740],[19,22740,23390],[20,23390,24470],[21,24470,26585]]}}