{"name":"34:50","price":"Sọ pé: “Tí mo bá ṣìnà, mo ṣìnà fún ẹ̀mí ara mi ni. Tí mo bá sì mọ̀nà, nípa ohun tí Olúwa mi fi ránṣẹ́ sì mi ní ìmísí ni. Dájúdájú Òun ni Olùgbọ́, Alásùn-únmọ́ ẹ̀dá.”¹","arabic":"قُلۡ إِن ضَلَلۡتُ فَإِنَّمَآ أَضِلُّ عَلَىٰ نَفۡسِيۖ وَإِنِ ٱهۡتَدَيۡتُ فَبِمَا يُوحِيٓ إِلَيَّ رَبِّيٓۚ إِنَّهُۥ سَمِيعٞ قَرِيبٞ","category":["34 (Saba)","Saba","Surah Saba","Chapter Saba","Surah 34","Chapter 34","Sheba","سَبَأ"],"ayahNumber":3656,"juzNumber":22,"footnotes":"1. Okùnfà āyah yìí ni pé, àwọn ọ̀ṣẹbọ ìlú Mọkkah ń sọ fún Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - pé, “Tí o bá fi lè pa ẹ̀sìn ìbọ̀rìṣà àwọn bàbá rẹ tì, o ti ṣìnà nìyẹn.” Allāhu sì sọ āyah kalẹ̀ pé, kí ó fún wọn lésì pé “Tí mo bá ṣìnà gẹ́gẹ́ bí ẹ ti sọ láì ní ẹ̀rí lọ́wọ́, ìyà ìṣìnà mi kò kàn yín. Àmọ́ tí mo bá mọ̀nà nípasẹ̀ bí mo ṣe ń jọ́sìn fún Allāhu nìkan ṣoṣo, mo rí ìmọ̀nà náà nípasẹ̀ ìmísí tí Allāhu fi ránṣẹ́ sí mi ni. Kì í ṣe àdáṣe mi.” Ƙurtubiy","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"qul in ḍalaltu fa-innamā aḍillu ʿalā nafsī wa-ini ih'tadaytu fabimā yūḥī ilayya rabbī innahu samīʿun qarībun ","translations":["Say","If","I err","then only","I will err","against","myself","But if","I am guided","then it is by what","reveals","to me","my Lord","Indeed, He","(is) All-Hearer","Ever-Near","(50)"],"transliterationArr":["qul","in","ḍalaltu","fa-innamā","aḍillu","ʿalā","nafsī","wa-ini","ih'tadaytu","fabimā","yūḥī","ilayya","rabbī","innahu","samīʿun","qarībun",null],"verseTiming":[[1,0,420],[2,420,660],[3,660,2290],[4,2290,5420],[5,5420,6230],[6,6230,6750],[7,6750,7890],[8,7890,8410],[9,8410,9340],[10,9340,9980],[11,9980,12160],[12,12160,12940],[13,12940,14020],[14,14020,15440],[15,15440,17400],[16,17400,19715]]}}