{"name":"35:28","price":"Àti pé ó wà nínú àwọn ènìyàn, àwọn n̄ǹkan ẹlẹ́mìí àti àwọn ẹran-ọ̀sìn tí àwọ̀ wọn yàtọ̀ síra wọn, gẹ́gẹ́ bí (àwọ̀ èso àti àpáta) wọ̀nyẹn (ṣe yàtọ̀ síra wọn). Àwọn tó ń páyà Allāhu nínú àwọn ẹrúsìn Rẹ̀ ni àwọn onímọ̀ (tí wọ́n mọ̀ pé), dájúdájú Allāhu ni Alágbára, Aláforíjìn.¹","arabic":"وَمِنَ ٱلنَّاسِ وَٱلدَّوَآبِّ وَٱلۡأَنۡعَٰمِ مُخۡتَلِفٌ أَلۡوَٰنُهُۥ كَذَٰلِكَۗ إِنَّمَا يَخۡشَى ٱللَّهَ مِنۡ عِبَادِهِ ٱلۡعُلَمَٰٓؤُاْۗ إِنَّ ٱللَّهَ عَزِيزٌ غَفُورٌ","category":["35 (Fatir)","Fatir","Surah Fatir","Chapter Fatir","Surah 35","Chapter 35","The Originator","فَاطِر"],"ayahNumber":3688,"juzNumber":22,"footnotes":"1. Àìmọ̀kan kò ṣeé lò láti fi páyà Allāhu - subhānahu wa ta‘ālā - . Aláìmọ̀kan yóò máa ṣe àwọn kiní kàn tí ó máa lérò pé òun ń fi páyà Allāhu ni, àmọ́ tó jẹ́ pé ńṣe l’ó ń da ara rẹ̀ láàmú. Ìmọ̀ nípa Allāhu ni ènìyàn lè fi páyà Allāhu ní ọ̀nà òtítọ́ àti ní ọ̀nà ẹ̀tọ́. Ìmọ̀ náà ní àsìkò yìí ni ìmọ̀ al-Ƙur’ān àti sunnah Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - . Méjèèjì l’ó máa jogún ìpáyà Allāhu fún olówó rẹ̀. \n Kíyè sí i! Tí a bá rí onímímọ̀ ẹ̀sìn tí kì í páyà Allāhu, ó wù ú bẹ́ẹ̀ láti ṣe bẹ́ẹ̀ ni. Kì í ṣe pé ìmọ̀ nípa Allāhu l’ó sọ ọ́ di bẹ́ẹ̀. Àpẹ̀ẹrẹ irú àwọn ènìyàn bẹ́ẹ̀ ni àwọn onibidiah. Nítorí náà, tí ẹ̀dá bá kéú tán, tó sọ bidiah di iṣẹ́, tó kúndùn bidiah ju sunnah Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - , Allāhu - subhānahu wa ta‘ālā - ti yọ barka “ìbùkún” kúrò nínú ìmọ̀ rẹ̀ nìyẹn. Ẹ ka sūrah al-’A‘rọ̄f; 7:175 àti 176 kí ẹ rí àpẹ̀ẹrẹ irú wọn.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"wamina al-nāsi wal-dawābi wal-anʿāmi mukh'talifun alwānuhu kadhālika innamā yakhshā al-laha min ʿibādihi al-ʿulamāu inna al-laha ʿazīzun ghafūrun ","translations":["And among","men","and moving creatures","and the cattle","(are) various","[their] colors","likewise","Only","fear","Allah","among","His slaves","those who have knowledge","Indeed","Allah","(is) All-Mighty","Oft-Forgiving","(28)"],"transliterationArr":["wamina","al-nāsi","wal-dawābi","wal-anʿāmi","mukh'talifun","alwānuhu","kadhālika","innamā","yakhshā","al-laha","min","ʿibādihi","al-ʿulamāu","inna","al-laha","ʿazīzun","ghafūrun",null],"verseTiming":[[1,0,570],[2,570,2100],[3,2100,5690],[4,5690,6980],[5,6980,7980],[6,7980,9740],[7,9740,11180],[8,11180,12980],[9,12980,13590],[10,13590,14370],[11,14370,14700],[12,14700,15750],[13,15750,18970],[14,18970,20620],[15,20620,21360],[16,21360,22210],[17,22210,25305]]}}