{"name":"36:37","price":"Àmì kan ni òru jẹ́ fún wọn, tí À ń yọ ọ̀sán jáde láti inú rẹ̀. Nígbà náà (tí A bá yọ ọ́ tán) wọn yóò tún wà nínú òkùnkùn (alẹ́ mìíràn).¹","arabic":"وَءَايَةٞ لَّهُمُ ٱلَّيۡلُ نَسۡلَخُ مِنۡهُ ٱلنَّهَارَ فَإِذَا هُم مُّظۡلِمُونَ","category":["36 (Ya-Sin)","Ya-Sin","Surah Ya-Sin","Chapter Ya-Sin","Sin","Surah Sin","Chapter Sin","Ya Sin","Surah Ya Sin","Chapter Ya Sin","Surah 36","Chapter 36","Ya-Sin","يس"],"ayahNumber":3742,"juzNumber":23,"footnotes":"1. Kókó inú āyah yìí ni pé, òru l’ó ń ṣíwájú ọ̀sán nínú ọjọ́, bí àpẹ̀ẹrẹ, òru Jímọ̀ mọ́júmọ́ ọ̀sán Jímọ̀, òru Sabt mọ́júmọ́ ọ̀sán Sabt. Nítorí náà, kò sí òru Àlàmísì mọ́júmọ́ ọ̀sán Jímọ̀. Kò sì sí òru Jímọ̀ mọ́júmọ́ Sabt. \n Bákan náà, wíwọ̀ òòrùn ni ìparí ọjọ́ kan àti ìbẹ̀rẹ̀ ọjọ́ mìíràn. Ìyẹn ni pé, níkété tí òòrùn bá ti wọ̀, a ti parí ọjọ́ tí à ń lò bọ̀, a sì ti = \n = bẹ̀rẹ̀ ọjọ́ titun. Ní ọ̀dọ̀ àwọn aláìgbàgbọ́, ni ọjọ́ kan ń parí, tí ọjọ́ titun ń bẹ̀rẹ̀ ní aago méjìlá òru. Ìyẹn kì í ṣe ìlànà ti Allāhu - Ọba tó ga jùlọ -.\n Síwájú sí i, tí obìnrin bá bímọ, ọjọ́ keje ni ọjọ́ ìparan súná ọmọ náà. Báwo ni a ó ṣe ka ọjọ́ méje náà? Tẹ́lẹ̀tẹ́lẹ̀, àwọn kan lérò pé, ọjọ́ mẹ́jọ ni ọjọ́ súná ọmọ. Èyí sì tako hadīth súná ọmọ ṣíṣe tí Samrah ọmọ Jundub - kí Allāhu yọ́nú sí i - gbà wá pé, dájúdájú Òjíṣẹ́ Allāhu - kí ìkẹ́ àti ọlà Allāhu máa bá a - sọ pé: \n كُلُّ غُلاَمٍ رَهِينَةٌ بِعَقِيقَتِهِ تُذْبَحُ عَنْهُ يَوْمَ سَابِعِهِ وَيُحْلَقُ وَيُسَمَّى.\n Ìtúmọ̀: “Ọmọ titun kọ̀ọ̀kan ni wọ́n ti fi ẹran ‘aƙīkọh kan dógò fún tí wọ́n máa bá a pa ní ọjọ́ keje rẹ̀ (tó dáyé). Wọ́n máa fá irun orí rẹ̀. Wọ́n sì máa fún un ní orúkọ.” (Abu Dāud) Irú ẹ̀gbàwá yìí wà nínú An-Nasā’iy, Ahmad àti Baehaƙiy. \n Àṣìṣe tí àwọn ọlọ́jọ́ mẹ́jọ fún súná ọmọ ṣíṣe ṣe ni pé, wọn kì í ka ọjọ́ ìbímọ mọ́ ọn. Dandan sì ni kí ọjọ́ ìbímọ jẹ́ ọjọ́ àkọ́kọ́ nínú ọjọ́ méje náà, kódà kí ọjọ́ ìbímọ ku ìṣẹ́jú kan tí a ó fi bọ́ sínú ọjọ́ titun. Bí àpẹ̀ẹrẹ, tí obìnrin kan bá bímọ ní ọ̀sán Alaadi, ní àkókò kan bíi kó ku ìṣẹ́jú díẹ̀ tí òòrùn máa wọ̀ ní ọjọ́ náà, ọjọ́ Alaadi ni ọjọ́ ìbímọ̀ rẹ̀. Ọjọ́ Sabt l’ó sì máa jẹ́ ọjọ́ keje, tí ó máa jẹ́ ọjọ́ súná ọmọ náà. Ṣebí nínú ààwẹ̀ Rọmọdọ̄n, tí obìnrin kan bá rí n̄ǹkan oṣù rẹ̀ ní àkókò kan bíi kó ku ìsẹ́jú díẹ̀ tí òòrùn máa wọ̀, ọ́ máa mú ọjọ́ yẹn kà mọ́ iye òǹkà ọjọ́ tí ó máa san padà lẹ́yìn oṣù Rọmọdọ̄n. \n Nítorí náà, ọjọ́ keje súná ọmọ kò gbọ́dọ̀ di ọjọ́ kẹjọ mọ́ wa lọ́wọ́. \n Bákan náà, àdádáálẹ́ ni ṣíṣe ìjókòó aláàfáà fún súná ọmọ ṣíṣe. Súná ọmọ ṣíṣe kò tayọ bí ó ṣe wà nínú hadīth yẹn. Àti pé dandan ni fún òbí láti fá irun orí ọmọ titun náà ní ọjọ́ keje, yálà ọmọkùnrin tàbí ọmọbìnrin. Ọmọ kó gbọ́dọ̀ di dàda nítorí pé, irun ọ̀bùn àti irun ẹbọ ni irun dàda.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"waāyatun lahumu al-laylu naslakhu min'hu al-nahāra fa-idhā hum muẓ'limūna ","translations":["And a Sign","for them","(is) the night","We withdraw","from it","the day","Then behold","They","(are) those in darkness","(37)"],"transliterationArr":["waāyatun","lahumu","al-laylu","naslakhu","min'hu","al-nahāra","fa-idhā","hum","muẓ'limūna",null],"verseTiming":[[1,0,1170],[2,1170,1820],[3,1820,2730],[4,2730,3600],[5,3600,4150],[6,4150,5920],[7,5920,6710],[8,6710,7140],[9,7140,11905]]}}