{"name":"37:10","price":"(Wọn kò níí gbọ́ ọ̀rọ̀ ní ẹ̀kúnrẹ́rẹ́) àyàfi ẹni tí ó bá rí ọ̀rọ̀ àjígbọ́ gbé, nígbà náà (ni mọlāika) yó sì fi ẹ̀ta ìràwọ̀ iná tó máa jó o tẹ̀lé e.¹","arabic":"إِلَّا مَنۡ خَطِفَ ٱلۡخَطۡفَةَ فَأَتۡبَعَهُۥ شِهَابٞ ثَاقِبٞ","category":["37 (As-Saffat)","As-Saffat","Surah As-Saffat","Chapter As-Saffat","Saffat","Surah Saffat","Chapter Saffat","As Saffat","Surah As Saffat","Chapter As Saffat","Surah 37","Chapter 37","Those Who Set The Ranks","الصَّافَات"],"ayahNumber":3798,"juzNumber":23,"footnotes":"1. Àwọn èṣù àlùjànnú máa ń gbé ara wọn gunra wọn láti lè súnmọ́ etí sánmọ̀ ilé ayé. Bí wọ́n bá bá àwọn mọlāika lórí àwọn ìro kan tí Allāhu fi ránṣẹ́ sí wọn, wọ́n máa jí i gbọ́. Níkété tí àwọn mọlāika bá fura sí wọn, wọ́n máa fi adó olóró ẹta ìràwọ̀ tú wọn ká. Nígbà mìíràn, àwọn èṣù àlùjànnú yìí yóò ti ṣe àtagbà ìró náà síra wọn tán ṣíwájú kí wọ́n tó tú wọn ká. Nígbà mìíràn ẹ̀wẹ̀, ẹni tí ó wà lókè pátápátá nínú wọn, kò níí tí ì ṣe àtagbà ìró sí àwọn yòókù rẹ̀ ṣíwájú kí wọ́n tó tú wọn ká. Èyí tí wọ́n bá jàjà rí jí gbé lọ, wọ́n máa lọ kọ bí àkùkọ sínú etí àwọn ẹni wọn nínú àwọn èṣù ènìyàn tí wọ́n yẹsẹ́ wò. Wọ́n sì máa fi irọ́ ọgọ́rùn-ún kún un fúnra wọn ní ọ̀dọ̀ àwọn tó ń pawọ́ dà, tí wọ́n ń yẹsẹ́ wò.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"illā man khaṭifa al-khaṭfata fa-atbaʿahu shihābun thāqibun ","translations":["Except","(him) who","snatches","(by) theft","but follows him","a burning flame","piercing","(10)"],"transliterationArr":["illā","man","khaṭifa","al-khaṭfata","fa-atbaʿahu","shihābun","thāqibun",null],"verseTiming":[[1,0,900],[2,900,1200],[3,1200,1910],[4,1910,3050],[5,3050,4380],[6,4380,5810],[7,5810,7845]]}}