{"name":"38:24","price":"(Ànábì Dāwūd) sọ pé: “Ó ti ṣàbòsí sí ọ nípa bíbèèrè abo ewúrẹ́ tìrẹ mọ́ àwọn abo ewúrẹ́ tirẹ̀. Dájúdájú ọ̀pọ̀lọ́pọ̀ nínú àwọn olùbáda-n̄ǹkanpọ̀, apá kan wọn máa ń tayọ ẹnu-ààlà lórí apá kan àfi àwọn tó bá gbàgbọ́ ní òdodo, tí wọ́n sì ṣe iṣẹ́ rere. Díẹ̀ sì ni wọ́n.” (Ànábì) Dāwūd sì mọ̀ dájú pé A kàn fi (ìbéèrè náà) ṣàdánwò fún òun ni. Nítorí náà, ó tọrọ àforíjìn lọ́dọ̀ Olúwa rẹ̀ (nípa àìtẹ́tí gbọ́ ọ̀rọ̀ lẹ́nu ẹni-afẹ̀sùnkàn). Ó dojú bolẹ̀ láti forí kanlẹ̀. Ó sì ronú pìwàdà (sọ́dọ̀ Allāhu).¹","arabic":"قَالَ لَقَدۡ ظَلَمَكَ بِسُؤَالِ نَعۡجَتِكَ إِلَىٰ نِعَاجِهِۦۖ وَإِنَّ كَثِيرٗا مِّنَ ٱلۡخُلَطَآءِ لَيَبۡغِي بَعۡضُهُمۡ عَلَىٰ بَعۡضٍ إِلَّا ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ وَقَلِيلٞ مَّا هُمۡۗ وَظَنَّ دَاوُۥدُ أَنَّمَا فَتَنَّٰهُ فَٱسۡتَغۡفَرَ رَبَّهُۥ وَخَرَّۤ رَاكِعٗاۤ وَأَنَابَ۩","category":["38 (Sad)","Sad","Surah Sad","Chapter Sad","Surah 38","Chapter 38","Saad","ص"],"ayahNumber":3994,"juzNumber":23,"footnotes":"1. Kíyè sí i, àwọn ìtàn kan tí àwọn nasọ̄rọ̄ máa ń sọ nípa Ànábì Dāwūd - kí ọlà Allāhu máa bá a - pé gbígbà tí ó gba ìyàwó ẹnì kan nínú àwọn ọmọ-ogun rẹ̀ lẹ́yìn rẹ̀, tí ó fi kún mọ́kàndínlọ́gọ́rùn-ún ìyàwó tirẹ̀ l’ó bí ìṣẹ̀lẹ̀ tó jẹyọ nínú āyah yìí. Kódà, àwọn tírà tafsīr kan mú ìtàn náà wá pẹ̀lú láì ṣọ̀fín-tótó rẹ̀.\n Àwọn olùtọpinpin ọ̀rọ̀ ẹ̀sìn kúkú ti tànmọ́lẹ̀ sí ọ̀rọ̀ náà. Wọ́n sì sọ pé, “Ìtàn àwọn ọmọ Isrọ̄’īl lásán ni gbogbo rẹ̀. Ìtàn irọ́ ni. Kódà èyí tí wọ́n ṣàfitì rẹ̀ sí ọ̀dọ̀ Ànábì wa Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - nínú rẹ̀ kò fẹsẹ̀ rinlẹ̀, kò sì ní àlàáfíà.” Tafsīr ’Adwā’ul-bayān ti Ṣinƙītiy l’ó kúkú kó ilà kúrò lára ẹ̀kọ lórí ọ̀rọ̀ náà. \n Bí ọ̀rọ̀ ṣe rí náà sì nìyẹn nítorí pé, kò sí olùgbàyàwó-oníyàwó nínú àwọn Ànábì Ọlọ́hun - kí ọlà Allāhu máa bá wọn -. Ní òdodo ni pé, òǹkà ìyàwó wọn lè pọ̀ ní òǹkà, kì í ṣe ní ti ìgbádùn adùn-ara lásán tàbí ní ti ọ̀nà àbòsí tàbí ní ti ọ̀nà àgbèrè (zinā) bí kò ṣe pé, wọ́n fẹ́ òǹkà ìyàwó púpọ̀ lábẹ́ òfin ẹ̀tọ́ fún àgbéga ẹ̀sìn ’Islām. Kò sì yẹ kí ọ̀rọ̀ àwọn yẹhudi àti àwọn nasọ̄rọ̄ bá wa ní òjijì rárá nítorí pé, kò sí Ànábì kan tàbí Òjíṣẹ́ kan tí wọn kò tàbùkù rẹ̀. \n Síwájú sí i, òye tó wà nínú ìṣẹ̀lẹ̀ àwọn ẹlẹ́ran yìí ni pé, Allāhu - Onídàájọ́ òdodo àti déédé - fẹ́ kọ́ Ànábì Dāwūd - kí ọlà Allāhu máa bá a - ní ẹ̀kọ́ ìgbẹ́jọ́ nítorí pé, Allāhu fẹ́ fi ṣe adájọ́ láààrin àwọn ìjọ rẹ̀. Àìtẹ́tí gbọ́ ọ̀rọ̀ lẹ́nu ẹni-afẹ̀sùnkàn ni àṣíṣe tó ṣẹlẹ̀ sí Ànábì Dāwūd - kí ọlà Allāhu máa bá a - nínú ìgbẹ́jọ́ náà. Èyí náà sì ni ohun tí ó tọrọ àforíjìn Ọlọ́hun fún, kì í ṣe ọ̀rọ̀ ìyàwó gbígbà, èyí tí kò ṣẹlẹ̀ nínú āyah náà, tí kò sì ṣẹlẹ̀ sí Ànábì Dāwūd - kí ọlà Allāhu máa bá a - rí nínú ìṣẹ̀mí ayé rẹ̀.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"qāla laqad ẓalamaka bisuāli naʿjatika ilā niʿājihi wa-inna kathīran mina al-khulaṭāi layabghī baʿḍuhum ʿalā baʿḍin illā alladhīna āmanū waʿamilū al-ṣāliḥāti waqalīlun mā hum waẓanna dāwūdu annamā fatannāhu fa-is'taghfara rabbahu wakharra rākiʿan wa-anāba ","translations":["He said","Certainly","he has wronged you","by demanding","your ewe","to","his ewes","And indeed","many","of","the partners","certainly oppress","some of them","[on]","another","except","those who","believe","and do","righteous deeds","and few","(are) they","(are) they","And became certain","Dawood","that","We (had) tried him","and he asked forgiveness","(of) his Lord","and fell down","bowing","and turned in repentance","(24)"],"transliterationArr":["qāla","laqad","ẓalamaka","bisuāli","naʿjatika","ilā","niʿājihi","wa-inna","kathīran","mina","al-khulaṭāi","layabghī","baʿḍuhum","ʿalā","baʿḍin","illā","alladhīna","āmanū","waʿamilū","al-ṣāliḥāti","waqalīlun","mā","hum","waẓanna","dāwūdu","annamā","fatannāhu","fa-is'taghfara","rabbahu","wakharra","rākiʿan","wa-anāba",""],"verseTiming":[[1,0,660],[2,660,1160],[3,1160,2010],[4,2010,3000],[5,3000,4020],[6,4020,4640],[7,4640,6210],[8,6210,7550],[9,7550,8460],[10,8460,9470],[11,9470,12160],[12,12160,13130],[13,13130,14080],[14,14080,14690],[15,14690,15540],[16,15540,16090],[17,16090,17040],[18,17040,18200],[19,18200,18900],[20,18900,20070],[21,20070,22160],[22,22160,23749],[23,23749,25379],[24,25379,26479],[25,26479,27759],[26,27759,28759],[27,28759,30479],[28,30479,32459],[29,32459,33789],[30,33789,34819],[31,34819,35619],[32,35619,36439],[33,36439,37989],[34,37989,40304]]}}