{"name":"38:34","price":"Dájúdájú A dán (Ànábì) Sulaemọ̄n wò. A ju abara kan sórí àga rẹ̀. Lẹ́yìn náà, (Ànábì Sulaemọ̄n) ṣẹ́rí padà (pẹ̀lú ìronúpìwàdà).¹","arabic":"وَلَقَدۡ فَتَنَّا سُلَيۡمَٰنَ وَأَلۡقَيۡنَا عَلَىٰ كُرۡسِيِّهِۦ جَسَدٗا ثُمَّ أَنَابَ","category":["38 (Sad)","Sad","Surah Sad","Chapter Sad","Surah 38","Chapter 38","Saad","ص"],"ayahNumber":4004,"juzNumber":23,"footnotes":"1. Gẹ́gẹ́ bí àwọn ọmọ ’Isrọ̄’īl ṣe parọ́ ìyàwó gbígbà mọ́ Ànábì Dā’ūd - kí ọlà Allāhu máa bá a -, bẹ́ẹ̀ náà ni wọ́n ṣe parọ́ pé èṣù àlùjànnú kan gba ìjọba lọ́wọ́ Ànábì Sulaemọ̄n - kí ọlà Allāhu máa bá a -. Wọ́n sì sọ pé, èṣù àlùjànnú náà lo ìjọba rẹ̀ fún ogójì ọjọ́ tó ṣe dọ́gba sí òǹkà ọjọ́ tí ọ̀kan nínú àwọn ìyàwó Ànábì Sulaemọ̄n fi yọ ẹbọ ṣe ní ìkọ̀kọ̀. Wọ́n ní, nígbà tí ogójì ọjọ́ pé, ni àṣírí èṣù àlùjànnú náà tó tú. Ànábì Sulaemọ̄n - kí ọlà Allāhu máa bá a - sì padà sórí àga ìjọba rẹ̀.’ \n Irọ́ burúkú ni èyí. Ìṣe àwọn ọmọ ’Isrọ̄’īl sì ni irọ́ pípa mọ́ àwọn Ànábì àti àwọn Òjíṣẹ́ Ọlọ́hun - kí ọlà Allāhu máa bá wọn -. Bí ó tilẹ̀ jẹ́ pé ìtàn burúkú yìí wà nínú ọ̀pọ̀lọ́pọ̀ tírà tafsīr nípasẹ̀ àìfura, àwọn ọlọ́fìn-íntótó àti olùtọpinpin nínú àwọn onímọ̀ ẹ̀sìn ’Islām ti padà fi rinlẹ̀ pé, irọ́ ni ìtàn náà nítorí pé, ìṣẹ̀lẹ̀ náà tako ààbò mímọ́ tó wà fún àwọn Ànábì àti àwọn Òjíṣẹ́ Ọlọ́hun - kí ọlà Allāhu máa bá wọn -.\n Síwájú sí i, èyí tí àwọn àáfà fi rinlẹ̀ lórí àgbọ́yé āyah náà ni pé, Ànábì Sulaemọ̄n - kí ọlà Allāhu máa bá a - ní ìyàwó tó tó ọgọ́rùn-ún lábẹ́ òfin ẹ̀tọ́ (ìyẹn ni pé, Allāhu l’Ó ṣe é ní ẹ̀tọ́ fún un). Ànábì Sulaemọ̄n - kí ọlà Allāhu máa bá a - sì fi Allāhu búra ní ọjọ́ kan pé, òun máa súnmọ́ ìkọ̀ọ̀kan àwọn ìyàwó rẹ̀ náà, gbogbo wọn pátápátá, ní alẹ́ ọjọ́ kan nítorí kí ìkọ̀ọ̀kan wọn lè bí ọmọkùnrin jagunjagun kọ̀ọ̀kan fún ẹ̀sìn Allāhu. Ó búra láti ṣe bẹ́ẹ̀, àmọ́ ó kùnà láti fi kún ìbúra rẹ̀ pé “tí Allāhu bá fẹ́.” Allāhu sì sọ ọ̀rọ̀ náà di àdánwò fún un nítorí pé, kò sí ìyàwó kan tí ó lóyún nípasẹ̀ oorun-ìfẹ́ alẹ́ ọjọ́ náà àfi ìyàwò kan tí ó bí ààbọ̀ ọmọ, tí wọ́n gbé jù sórí àga ọlá rẹ̀. Lẹ́sẹ̀kẹsẹ̀ tí ó rí èyí, ó ṣẹ́rí padà sọ́dọ̀ Allāhu. \n Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - sì sọ̀rọ̀ lórí ìṣẹ̀lẹ̀ yìí pé, “Tí Ànábì Sulaemọ̄n - kí ọlà Allāhu máa bá a - bá sọ pé, ‘tí Allāhu bá fẹ́’ lásìkò ìbúra rẹ̀ ni, ìbúra rẹ̀ kò níí di ẹ̀ṣẹ̀ sí i lọ́rùn. Àti pé ọwọ́ rẹ̀ ìbá ba ohun tí ó ń fẹ́ lọ́dọ̀ Allāhu Ọba Ọlọ́rẹ.” Ìṣẹ̀lẹ̀ yìí wà nínú ẹ̀gbàwá Abū Huraerah - kí Allāhu yọ́nú sí i -. Ó sì wà nínú hadīth Bukọ̄riy (àkọlé: bāb al-’Istithnā’ fi-l-’aemọ̄n) àti Muslim (àkọlé: bāb al-’Istithnā’). Nítorí náà, ààbọ̀ ọmọ tí wọ́n jù sórí àga Sulaemọn ni “jasad” tó jẹyọ nínú āyah náà, kì í ṣe àlùjànnú èṣù. Àwọn èṣù kì í gbé àwòrán àwọn Ànábì wọ̀. \n Kíyè sí i, nínú ẹ̀rí tó dájú tó ń fi rinlẹ̀ pé kò sí èṣù àlùjànnú kan tí ó lè gbé àwòrán Ànábì kan kan wọ̀ ni pé, kì í ṣe ara òrùka Ànábì Sulaemọ̄n - kí ọlà Allāhu máa bá a - ni àwọ̀ Ànábì Sulaemọ̄n wà. Báwo wá ni ó ṣe máa jẹ́ pé, nípasẹ̀ òrùka Ànábì Sulaemọ̄n ni àwọ̀ rẹ̀ fi máa kúrò lára rẹ̀ sí ara èṣù àlùjànnú nígbà tí Ànábì Sulaemọ̄n kì í ṣe òpìdán? Ànábì Sulaemọ̄n kò sì fi òrùka jọba áḿbọ̀sìbọ́sí pé nígbà tí kò bá sí òrùka rẹ̀ lọ́wọ́ rẹ̀ l’ó máa fún ẹlòmíìràn ní àyè láti di ọba! Ẹ tún wo ìtọsẹ̀-ọ̀rọ̀ sūrah al-Baƙọrah; 2:102. W-Allāhu ’a‘lam.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"walaqad fatannā sulaymāna wa-alqaynā ʿalā kur'siyyihi jasadan thumma anāba ","translations":["And certainly","We tried","Sulaiman","and We placed","on","his throne","a body","then","he turned","(34)"],"transliterationArr":["walaqad","fatannā","sulaymāna","wa-alqaynā","ʿalā","kur'siyyihi","jasadan","thumma","anāba",null],"verseTiming":[[1,0,860],[2,860,2370],[3,2370,3670],[4,3670,4940],[5,4940,5650],[6,5650,7150],[7,7150,8770],[8,8770,10240],[9,10240,13685]]}}