{"name":"38:44","price":"Fi ọwọ́ rẹ mú ìdì igi koríko tútù kí o fi lu (ìyàwó) rẹ. Má ṣe yapa ìbúra rẹ.¹ Dájúdájú Àwa rí (’Ayyūb) ní onísùúrù. Ẹrúsìn rere ni. Dájúdájú olùṣẹ́rí sí ọ̀dọ̀ Allāhu ni (nípa ìronúpìwàdà).","arabic":"وَخُذۡ بِيَدِكَ ضِغۡثٗا فَٱضۡرِب بِّهِۦ وَلَا تَحۡنَثۡۗ إِنَّا وَجَدۡنَٰهُ صَابِرٗاۚ نِّعۡمَ ٱلۡعَبۡدُ إِنَّهُۥٓ أَوَّابٞ","category":["38 (Sad)","Sad","Surah Sad","Chapter Sad","Surah 38","Chapter 38","Saad","ص"],"ayahNumber":4014,"juzNumber":23,"footnotes":"1. Ní àsìkò tí àìlera wà fún Ànábì ’Ayyūb - kí ọlà Allāhu máa bá a -, ìyàwó rẹ̀ ṣẹ̀ ẹ́ ní ẹ̀ṣẹ̀ kan. Ànábì ’Ayyūb sì fi Allāhu búra pé òun yóò lù ú ní ẹgba ọgọ́rùn-ún lórí àṣìṣe náà tí òun bá gbádùn. Èyí ni Allāhu - Ọba tó ga jùlọ - fi ń pa á láṣẹ pé kí ó mú ìbúra rẹ̀ ṣẹ, ṣùgbọ́n kí ó mú ìbáwí náà ní fífúyẹ́ nípa dídi igi koríko tútù ọgọ́rùn-ún jọ, kí ó sì fi lu ìyàwó rẹ̀ ní ẹ̀ẹ̀ kan péré. Ìdì igi koríko ọgọ́rùn-ún náà sì ti dúró fún lílu ìyàwó rẹ̀ nígbà ọgọ́rùn-ún. \n Èyí fi rinlẹ̀ pé, a kò gbọdọ̀ fi àpá sí ara ìyàwó wa nípasẹ̀ ìbáwí. Ẹ tún wo ìtọsẹ̀-ọ̀rọ̀ sūrah an-Nisā’; 4:34.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"wakhudh biyadika ḍigh'than fa-iḍ'rib bihi walā taḥnath innā wajadnāhu ṣābiran niʿ'ma al-ʿabdu innahu awwābun ","translations":["And take","in your hand","a bunch","and strike","with it","and (do) not","break (your) oath","Indeed, We","[We] found him","patient","an excellent","slave","Indeed, he","repeatedly turned","(44)"],"transliterationArr":["wakhudh","biyadika","ḍigh'than","fa-iḍ'rib","bihi","walā","taḥnath","innā","wajadnāhu","ṣābiran","niʿ'ma","al-ʿabdu","innahu","awwābun",null],"verseTiming":[[1,0,610],[2,610,1550],[3,1550,3060],[4,3060,3840],[5,3840,4540],[6,4540,5180],[7,5180,6100],[8,6100,8279],[9,8279,9559],[10,9559,11289],[11,11289,11779],[12,11779,12699],[13,12699,16009],[14,16009,19324]]}}