{"name":"3:101","price":"Báwo ni ẹ̀yin ṣe lè ṣàì gbàgbọ́, ẹ̀yin mà ni wọ́n ń ké àwọn āyah Allāhu fún, Òjíṣẹ́ Rẹ̀ sì wà láààrin yín! Ẹnikẹ́ni tí ó bá dúró ṣinṣin ti Allāhu, A ti tọ́ ọ sí ọ̀nà tààrà.¹","arabic":"وَكَيۡفَ تَكۡفُرُونَ وَأَنتُمۡ تُتۡلَىٰ عَلَيۡكُمۡ ءَايَٰتُ ٱللَّهِ وَفِيكُمۡ رَسُولُهُۥۗ وَمَن يَعۡتَصِم بِٱللَّهِ فَقَدۡ هُدِيَ إِلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":394,"juzNumber":4,"footnotes":"1. Kíyè sí i, gbólóhùn yìí, “Òjíṣẹ́ Rẹ̀ sì wà láààrin yín!” Ìyẹn ṣíwájú kí ó tó kú - kí ìkẹ́ àti ọlà Allāhu máa bá a -. Àmọ́ lẹ́yìn ikú rẹ̀ - kí ìkẹ́ àti ọlà Allāhu máa bá a -, kò sí láààrin wa mọ́. Irú āyah yìí wà nínú sūrah at-Taobah; 9:94 àti 105 àti sūrah an-Nisā’; 4:64. \n Àwọn onibidia nìkan ni wọ́n tún gbà pé títí dí àsìkò yìí ni Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - ń bẹ láààrin wa, tí ó ń rí iṣẹ́ ọwọ́ wa. Bí àpẹ̀ẹrẹ, ìjọ Ahmadiyyah gbà pé Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a- padà wá sáyé, ó sì ń bá mirza Ghulam Ahmad, olùdásílẹ̀ ìjọ Ahmadiyyah ṣe ìpàdé ojú ayé. Bákan náà, ìjọ Tijāniyyah náà gbà pé Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a- padà wá sáyé láti fún ṣeeu Ahmada Tijāni lọ́wọ́ wírìdí. Kódà wọ́n gbà pé lójoojúmọ́ àti níbi gbogbo ni Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a- àti àwọn àrólé rẹ̀ mẹ́rẹ̀ẹ̀rin - kí Allāhu yọ́nú sí wọn - máa wá jókòó sórí aṣọ funfun, èyí tí wọ́n máa ń tẹ́ sáààrin lásìkò tí wọ́n bá ń ka Jaoharatul-kamāl lọ́wọ́. Irọ́ ńlá ni gbogbo àdìsọ́kàn burúkú wọ̀nyí. Àwọn āyah tí à ń tọsẹ̀ rẹ̀ lọ́wọ́ kò sì jẹmọ́ “lẹ́yìn ikú Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a-” bí kò ṣe “ṣíwájú ikú rẹ̀ - kí ìkẹ́ àti ọlà Allāhu máa bá a-”. Kí á lè mọ̀ bẹ́ẹ̀ pẹ̀lú àmọ̀dájú, Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a- sọ pé: “Kíyè sí i, dájúdájú wọn máa mú àwọn ọkùnrin kan wá nínú ìjọ mi (ìyẹn l’ọ́jọ́ Ìdájọ́), wọ́n sì máa mú wọn lọ sí apá òṣì, n̄g ó sì sọ pé; “Olúwa mi, àwọn ènìyàn mi (nìyí).” Wọ́n sì máa sọ pé: “Dájúdájú ìwọ kò mọ ohun tí wọ́n dáálẹ̀ lẹ́yìn (ikú) rẹ.” (Bukọ̄riy àti Muslim)","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"wakayfa takfurūna wa-antum tut'lā ʿalaykum āyātu al-lahi wafīkum rasūluhu waman yaʿtaṣim bil-lahi faqad hudiya ilā ṣirāṭin mus'taqīmin ","translations":["And how (could)","you disbelieve","while [you]","is recited","upon you","(the) Verses","(of) Allah","and among you","(is) His Messenger","And whoever","holds firmly","to Allah","then surely","he is guided","to","a path","straight","(101)"],"transliterationArr":["wakayfa","takfurūna","wa-antum","tut'lā","ʿalaykum","āyātu","al-lahi","wafīkum","rasūluhu","waman","yaʿtaṣim","bil-lahi","faqad","hudiya","ilā","ṣirāṭin","mus'taqīmin",null],"verseTiming":[[1,0,1070],[2,1070,2320],[3,2320,4070],[4,4070,4990],[5,4990,6020],[6,6020,7100],[7,7100,8020],[8,8020,9130],[9,9130,10210],[10,10210,11080],[11,11080,13040],[12,13040,14500],[13,14500,15070],[14,15070,15740],[15,15740,16320],[16,16320,17400],[17,17400,21605]]}}