{"name":"3:144","price":"Kí ni (Ànábì) Muhammad bí kò ṣe Òjíṣẹ́, tí àwọn Òjíṣẹ́ kan ti lọ ṣíwájú rẹ̀.¹ Ṣé tí ó bá kú tàbí tí wọ́n bá pa á, ẹ máa pẹ̀yìndà (sẹ́sìn)? Ẹnikẹ́ni tí ó bá pẹ̀yìndà (sẹ́sìn) kò lè kó ìnira kan kan bá Allāhu. Allāhu yó sì san àwọn olùdúpẹ́ ní ẹ̀san rere.","arabic":"وَمَا مُحَمَّدٌ إِلَّا رَسُولٞ قَدۡ خَلَتۡ مِن قَبۡلِهِ ٱلرُّسُلُۚ أَفَإِيْن مَّاتَ أَوۡ قُتِلَ ٱنقَلَبۡتُمۡ عَلَىٰٓ أَعۡقَٰبِكُمۡۚ وَمَن يَنقَلِبۡ عَلَىٰ عَقِبَيۡهِ فَلَن يَضُرَّ ٱللَّهَ شَيۡـٔٗاۚ وَسَيَجۡزِي ٱللَّهُ ٱلشَّٰكِرِينَ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":437,"juzNumber":4,"footnotes":"1. Āyah yìí jẹ́ ọ̀kan pàtàkì nínú àwọn ẹ̀rí àtamọ́-àtọmọ̀ lọ́dọ̀ àwọn tó gbàgbọ́ pé Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - ti kú. Wọ́n ní ikú rẹ̀ ti jẹyọ nínú “Kí ni (Ànábì) Muhammad bí kò ṣe Òjíṣẹ́, tí àwọn Òjíṣẹ́ kan ti lọ ṣíwájú rẹ̀” \n Èsì: Āyah yìí jẹ́ àpẹ̀ẹrẹ àwọn āyah tí àwọn onímọ̀ ẹ̀sìn ń pè ní nassun ‘āmmun maksūs “ọ̀rọ̀ gbogbogbò tó ní àyàfi”. Ìyẹn ni pé, wọ́n mú un wá bí ẹni pé gbogbo àwọn Ànábì àti Òjíṣẹ́ ló ti kú, àmọ́ tí ó jẹ́ pé, Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - jẹ́ àyàfi nítorí pé, àwọn ọ̀rọ̀ (nusūs) mìíràn wá nínú hadīth Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - tí ó fi rinlẹ̀ pé, kò ì kú, ó ń padà bọ̀. Kì í sì ṣe ohun titun kí ọ̀rọ̀ jẹ́ “ọ̀rọ̀ gbogbogbò tó ní àyàfi”. Àti pé, hadīth Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - ló ń ṣàlàyé al-Ƙur’ān. Bí ó tilẹ̀ jẹ́ pé āyah náà ń sọ̀rọ̀ nípa ikú àwọn Ànábì àti àwọn Òjíṣẹ́ Allāhu - kí ọlà Allāhu máa bá wọn - tó ṣíwájú Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a -, kò pọn dandan kí āyah náà yà lọ síbi ọ̀rọ̀ nípa àì tí ì kú Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a -. \n Ẹ kíyè sí i, bí ọ̀rọ̀ bá wá ní àwòrán gbogbogbò nínú al-Ƙur’ān, kò túmọ̀ sí pé kò lè ní àyàfi nínú nínú āyah mìíràn tàbí nínú hadīth Ànábì tó fẹsẹ̀ rinlẹ̀. Bí àpẹ̀ẹrẹ, nínú sūrah an-Nisā’; 4:117, Allāhu ń sọ̀rọ̀ nípa àwọn n̄ǹkan tí àwọn ènìyàn ń jọ́sìn fún lẹ́yìn Rẹ̀ pé, “Wọn kò pe kiní kan lẹ́yìn Allāhu bí kò ṣe àwọn abo òrìṣà.” Nínú ohun tí àwọn kan sì sọ di òrìṣà ni Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a -. Ṣé abo sì ni òun náà ni tàbí akọ? Ìsọkúsọ l’ó sì máa jẹ́ láti pe Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - ní abo. Bẹ́ẹ̀ sì ni pé, Allāhu kò ṣe “àyàfi” nínú āyah “abo òrìṣà”, àmọ́ ó yé wa nínú àwọn āyah mìíràn pé Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - kì í ṣe abo. Akọ ni. \n Àpẹ̀ẹrẹ mìíràn fún mímú “àyàfi” fún āyah al-Ƙur’ān wá nínú hadīth, òhun ni pé al-Ƙur’ān sọ pé kí á gé ọwọ́ olè lọ́kùnrin àti ọwọ́ olè lóbìnrin. Ọwọ́ sì lè dúrò fún gbogbo ọwọ́, bẹ̀rẹ̀ láti èjìká títí dé àtẹlẹwọ́. Hadīth ló yọ èjìká ọwọ́ títí dé ọrùn ọwọ́ sílẹ̀ níbi gígé. \n Nítorí náà, kò sí ohun tó sọ ọ́ di dandan nínú āyah òkè yìí láti sọ pé “Kí ni (Ànábì) Muhammad bí kò ṣe Òjíṣẹ́, tí àwọn Òjíṣẹ́ kan ti lọ ṣíwájú rẹ̀ (àyàfi ‘Īsā ọmọ Mọryam).” Níwọ̀n ìgbà tí hadīth ti wà ní ipò àlàyé fún al-Ƙur’ān. Méjèèjì sì ni ìmísí láti ọ̀dọ̀ Allāhu, àmọ́ ipò ìmísí al-Ƙur’ān ju ipò ìmísí hadīth tó dára tó fẹsẹ̀ rinlẹ̀.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"wamā muḥammadun illā rasūlun qad khalat min qablihi al-rusulu afa-in māta aw qutila inqalabtum ʿalā aʿqābikum waman yanqalib ʿalā ʿaqibayhi falan yaḍurra al-laha shayan wasayajzī al-lahu al-shākirīna ","translations":["And not","(is) Muhammad ","except","a Messenger","certainly","passed away","from","before him","[the] (other) Messengers","So if","he died","or","is slain","will you turn back","on","your heels","And whoever","turns back","on","his heels","then never","will he harm","Allah","(in) anything","And will reward","Allah","the grateful ones","(144)"],"transliterationArr":["wamā","muḥammadun","illā","rasūlun","qad","khalat","min","qablihi","al-rusulu","afa-in","māta","aw","qutila","inqalabtum","ʿalā","aʿqābikum","waman","yanqalib","ʿalā","ʿaqibayhi","falan","yaḍurra","al-laha","shayan","wasayajzī","al-lahu","al-shākirīna",null],"verseTiming":[[1,0,830],[2,830,2760],[3,2760,3540],[4,3540,5350],[5,5350,5780],[6,5780,6510],[7,6510,7410],[8,7410,8290],[9,8290,9200],[10,9200,10320],[11,10320,11810],[12,11810,12200],[13,12200,12890],[14,12890,14920],[15,14920,16960],[16,16960,18610],[17,18610,20248],[18,20248,21892],[19,21892,22655],[20,22655,23804],[21,23804,25393],[22,25393,26660],[23,26660,27160],[24,27160,28276],[25,28276,29669],[26,29669,30420],[27,30420,33125]]}}