{"name":"40:11","price":"Wọ́n wí pé: “Olúwa wa, O pa wá ní ẹ̀ẹ̀ méjì. O sì ji wá ní ẹ̀ẹ̀ méjì.¹ Nítorí náà, a jẹ́wọ́ àwọn ẹ̀ṣẹ̀ wa. Ǹjẹ́ ọ̀nà kan wà láti jáde (padà sí ilé ayé) bí?”","arabic":"قَالُواْ رَبَّنَآ أَمَتَّنَا ٱثۡنَتَيۡنِ وَأَحۡيَيۡتَنَا ٱثۡنَتَيۡنِ فَٱعۡتَرَفۡنَا بِذُنُوبِنَا فَهَلۡ إِلَىٰ خُرُوجٖ مِّن سَبِيلٖ","category":["40 (Ghafir)","Ghafir","Surah Ghafir","Chapter Ghafir","Surah 40","Chapter 40","The Forgiver","غافِر"],"ayahNumber":4144,"juzNumber":24,"footnotes":"1. Àwọn kan lérò pé, ìtúmọ̀ āyah yìí ni pé, ènìyàn máa wáyé ní ẹ̀ẹ̀ méjì, ó sì máa kú ní ẹ̀ẹ̀ méjì. Rárá o, kò rí bẹ́ẹ̀. Ìtúmọ̀ rẹ̀ ni pé, ènìyàn wà ní ipò òkú nígbà tí ó jẹ́ aláìsí ní ìbẹ̀rẹ̀ pẹ̀pẹ̀, ìyẹn ṣíwájú ìṣẹ̀dá rẹ̀. Ìyẹn ni ikú àkọ́kọ́. Lẹ́yìn náà, ó máa wà ní ipò alààyè nígbà tí ó bá délé ayé. Ìyẹn ni ìṣẹ̀mí àkọ́kọ́. Lẹ́yìn náà, ó máa di aláìsí nígbà tí ó bá parí òǹkà àkókò tí Allāhu pèbùbù fún un láti lò nílé ayé. Ìyẹn sì ni ikú kejì. Lẹ́yìn náà, ó máa di alààyè ní ọjọ́ Àjíǹde, kò sì níí kú mọ́. Ìyẹn sì ni ìṣẹ̀mí kejì. Èyí ni ìtúmọ̀ āyah náà. Irú āyah yìí sì kúkú ti ṣíwájú nínú sūrah al-Baƙọrah; 2:28.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"qālū rabbanā amattanā ith'natayni wa-aḥyaytanā ith'natayni fa-iʿ'tarafnā bidhunūbinā fahal ilā khurūjin min sabīlin ","translations":["They (will) say","Our Lord","You gave us death","twice","and You gave us life","twice","and we confess","our sins","So is (there)","to","get out","any","way","(11)"],"transliterationArr":["qālū","rabbanā","amattanā","ith'natayni","wa-aḥyaytanā","ith'natayni","fa-iʿ'tarafnā","bidhunūbinā","fahal","ilā","khurūjin","min","sabīlin",null],"verseTiming":[[1,0,880],[2,880,3370],[3,3370,4310],[4,4310,5340],[5,5340,6600],[6,6600,7600],[7,7600,9010],[8,9010,10510],[9,10510,12360],[10,12360,13650],[11,13650,14310],[12,14310,14860],[13,14860,15710],[14,15710,17310],[15,17310,19805]]}}