{"name":"40:55","price":"Nítorí náà, ṣe sùúrù. Dájúdájú àdéhùn Allāhu ni òdodo. Tọrọ àforíjìn fún ẹ̀ṣẹ̀ rẹ.¹ Kí o sì ṣe àfọ̀mọ́ pẹ̀lú ẹyìn fún Olúwa rẹ² ní ìrọ̀lẹ́ àti ní òwúrọ̀ kùtùkùtù.","arabic":"فَٱصۡبِرۡ إِنَّ وَعۡدَ ٱللَّهِ حَقّٞ وَٱسۡتَغۡفِرۡ لِذَنۢبِكَ وَسَبِّحۡ بِحَمۡدِ رَبِّكَ بِٱلۡعَشِيِّ وَٱلۡإِبۡكَٰرِ","category":["40 (Ghafir)","Ghafir","Surah Ghafir","Chapter Ghafir","Surah 40","Chapter 40","The Forgiver","غافِر"],"ayahNumber":4188,"juzNumber":24,"footnotes":"1. Irú gbólóhùn yìí tún wà nínú sūrah Muhammad; 47:19. Ẹ̀̀ṣẹ̀ wo ni Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - dá? Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - kì i ṣé ẹlẹ́ṣẹ̀ tàbí ọ̀daràn tàbí olùyapa àṣẹ Allāhu - Ọba Aláforíjìn -. Àmọ́ nítorí pé, Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - kì í ṣe mọlāika, kì í sì ṣe ọlọ́hun, ó ṣeé ṣe kí ó ṣe ìṣe kan tí Allāhu máa sọ di ní ẹ̀ṣẹ̀ fún un. Irúfẹ́ àwọn ìṣe náà kò tàbùkù ipò rẹ̀ gẹ́gẹ́ bí Ànábì àti Òjíṣẹ́ Ọlọ́hun. Kò sì yọ ọ́ kúrò nípò àwòkọ́ṣe rere fún gbogbo ẹ̀dá.\n Allāhu kì í kúkú ṣe Ọba alábòsí, Ó ṣàfi hàn ẹ̀ṣẹ̀ tí Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - dá. \n Àṣìṣe kìíní tó di ẹ̀ṣẹ̀: Títú tí Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - tú àwọn ẹrú ogun Badr sílẹ̀ dípò pípa wọ́n, ó di ẹ̀ṣẹ̀ sí i lọ́rùn nítorí pé, àwọn tí Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - tú sílẹ̀ wọ̀nyí, àwọn ni olórí àwọn ọ̀ṣẹbọ nínú ìlú Mọkkah. Wọ́n sì ti pa àwọn mùsùlùmí kan nípakúpa ṣíwájú kí ọwọ́ tó tẹ àwọn náà lójú ogun Badr. Àmọ́ ohun tí Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - rò tó fi tú wọn sílẹ̀ ni pé, àwùjọ mùsùlùmí bùkátà sí owó àti ẹ̀kọ́ mọ̀ọ́kọ-mọ̀ọ́kà. Wọ́n sì gba owó ìtúsílẹ̀ lọ́wọ́ àwọn ẹrú kan nínú àwọn ẹrú ogun náà, nígbà tí àwọn ẹrú mìíràn rí ìtúsílẹ̀ gbà nípasẹ̀ kíkọ́ àwọn Sọhābah kan ní ẹ̀kọ́ mọ̀ọ́kọ-mọ̀ọ́kà. Ní òdodo ni pé, ìgbésẹ̀ yìí dára. Àmọ́ Allāhu kà á kún àṣìṣe. Ó sì jẹ́ kí ó di mímọ̀ fún un pé, pípa wọ́n lásìkò náà l’ó lóore ju títú wọn sílẹ̀ wọn lọ nítorí pé, àìpa wọ́n l’ó padà bí àwọn ogun mìíràn. \n Ńṣe ni àwọn ọ̀ṣẹbọ náà lọ túnra mú. Wọ́n sì bẹ̀rẹ̀ sí gbé àwọn ogun mìíràn dìde. Wọn ìbá ti pa wọ́n nígbà àkọ́kọ́, ogun ìbá ti dáwọ́ dúró. Èyí ni Allāhu sọ nípa rẹ̀ nínú sūrah al-’Anfāl; 8:67 - 71. Allāhu sì padà yọ̀ǹda ìtúsílẹ̀ ẹrú ogún pẹ̀lú owó ìtúsílẹ̀ tàbí ní ọ̀fẹ́ fún Ànábì Rẹ̀ - kí ìkẹ́ àti ọlà Allāhu máa bá a - nínú sūrah Muhammad; 47:4. \n Àṣìṣe kejì tó di ẹ̀ṣẹ̀: Àìtètè gbà kí Zaed ọmọ Hārithah - kí Allāhu yọ́nú sí i - kọ Zaenab ọmọ Jahṣ - kí Allāhu yọ́nú sí i - sílẹ̀ lẹ́yìn tí Allāhu ti sọ ọ́ di mímọ̀ fún Ànábì Rẹ̀ - kí ìkẹ́ àti ọlà Allāhu máa bá a - pé Zaed ti lẹ́tọ̀ọ́ láti kọ̀ ọ́ sílẹ̀ níwọ̀n ìgbà tí kò bùkátà sí i mọ́. Ohun tí ó sì mú kí Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - kóra ró ni pé, ó ń páyà pé àwọn aláìsàn-ọkàn yóò máa sọ pé, “Ó gba ìyàwó lọ́wọ́ ọmọ rẹ̀, ó sì fi ṣaya!”. Ọ̀rọ̀ kò sì rí bẹ́ẹ̀ nítorí pé, Zaed ọmọ Hārithah - kí Allāhu yọ́nú sí i - kì í ṣe ọmọbíbí inú Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a -. Àti pé kò sí èèwọ̀ nínú kí Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - fẹ́ Zaenab ọmọ Jahṣ lẹ́yìn tí Allāhu ti pa á láṣẹ fún un láti fi ṣaya. Èyí ni Allāhu sọ nípa rẹ̀ nínú sūrah al-’Ahzāb; 33:37-38. Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - sì ṣẹ́rí padà síbi ohun tí Allāhu yàn fún un. \n Àṣìṣe kẹta tó di ẹ̀ṣẹ̀: Sísọ tí Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - sọ fún ọ̀kan nínú àwọn ìyàwó rẹ̀ pé òun kò níí fi ẹrúbìnrin rẹ̀ kan ṣaya. Sísọ bẹ́ẹ̀ jẹ́ àṣìṣe fún un nítorí pé, ohun tí Allāhu ṣe ní ẹ̀tọ́ fún un ni ó fẹ́ ṣe ní èèwọ̀ fún ẹ̀mí ara rẹ̀ láti fi wá ìyọ́nú ìyàwó rẹ̀ kan. Èyí ni Allāhu sọ nípa rẹ̀ nínú sūrah at-Tahrīm; 66:1. \n Àṣìṣe kẹ́rin tó di ẹ̀ṣẹ̀: Fífajúro tí Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - fajú ro sí afọ́jú kan tí Allāhu ti ṣípayá ọkàn rẹ̀ fún gbígba ’Islām. Ohun tí ó ṣẹlẹ̀ nip é, Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - wà pẹ̀lú ọ̀kan pàtàkì nínú àwọn ọ̀ṣẹbọ, tí ó ń ṣe wáàsí fún lọ́wọ́ nígbà tí afọ́jú yìí ń sáré bọ́ wá sí ọ̀dọ̀ rẹ̀. Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - sì ti kó ọ̀rọ̀ ẹni tí ó ń bá sọ̀rọ̀ lọ́wọ́ léyà tó bẹ́ẹ̀ gẹ́ tí kò fi fẹ́ kí afọ́jú tó ṣẹ̀ṣẹ̀ dé di òun lọ́wọ́. Ṣíṣẹ bẹ́ẹ̀ l’ó di ẹ̀ṣẹ̀ sí i lọ́rùn gẹ́gẹ́ bí Allāhu ṣe fi ìdí èyí náà múlẹ̀ nínú sūrah ‘Abas; 80:1-11. \n Ìwọ̀nyẹn ni àwọn àṣìṣe tó di ẹ̀ṣẹ̀ sí Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - lọ́rùn. Kì í ṣe pé Ànábì jẹ́ ẹlẹ́ṣẹ̀ ńla kan tàbí ọ̀daràn. Tòhun tí bí ó ṣe mọ yìí, Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - kò yé tọrọ àforíjìn lórí rẹ̀ títí di ọjọ́ ikú rẹ̀. Kódà Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - kò lè má tọrọ àforíjìn lọ́dọ̀ Allāhu lórí ìwọ̀nyẹn nígbà ọgọ́rùn-ún lójúmọ́. \n Ẹ̀kọ́ pàtàkì tí ó yẹ kí èyí kọ́ èmi àti ẹ̀yin ni pé, a kò gbọ́dọ̀ fojú bín-íntín wo èyíkéyìí àṣìṣe tàbí ẹ̀ṣẹ̀. A gbọ́dọ̀ kún fún títọrọ àforíjìn ni lọ́dọ̀ Allāhu, Aláforíjìn. Kò sí ohun tó dára tó rírí àforíjìn gbà lọ́dọ̀ Allāhu lórí gbogbo àṣìṣe wa ṣíwájú ọjọ́ ikú wa, irú àforíjìn yìí ni Allāhu ṣe fún Ànábì wa - kí ìkẹ́ àti ọlà Allāhu máa bá a -, tí Allāhu sì sọ ọ́ di mímọ̀ fún gbogbo ayé nínú sūrah al-Fath; 48:1 - 2. \n Ìyẹn ni abala èyí tó jẹmọ́ àṣìṣe Ànábì wa - kí ìkẹ́ àti ọlà Allāhu máa bá a - lẹ́yìn tí ó di Ànábì àti Òjíṣẹ́ Ọlọ́hun - kí ìkẹ́ àti ọlà Allāhu máa bá a -. \n Ẹ wo ìtọsẹ̀-ọ̀rọ̀ sūrah aṣ-Ṣẹrh; 94:3 fún abala kejì, èyí tó jẹmọ́ àṣìṣe rẹ̀ ṣíwájú kí ó tó di Ànábì àti Òjíṣẹ́ Ọlọ́hun - kí ìkẹ́ àti ọlà Allāhu máa bá a -. \n 2. Ìyẹn ni pé, ṣe àfọ̀mọ́ Allāhu kúrò níbi gbogbo àdínkù àti àbùkù, kí o sì yìn Ín lógo pé, Ó pé tán pátápátá.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"fa-iṣ'bir inna waʿda al-lahi ḥaqqun wa-is'taghfir lidhanbika wasabbiḥ biḥamdi rabbika bil-ʿashiyi wal-ib'kāri ","translations":["So be patient","indeed","(the) Promise of Allah","(the) Promise of Allah","(is) true","And ask forgiveness","for your sin","and glorify","(the) praise","(of) your Lord","in the evening","and the morning","(55)"],"transliterationArr":["fa-iṣ'bir","inna","waʿda","al-lahi","ḥaqqun","wa-is'taghfir","lidhanbika","wasabbiḥ","biḥamdi","rabbika","bil-ʿashiyi","wal-ib'kāri",null],"verseTiming":[[1,0,830],[2,830,1900],[3,1900,2430],[4,2430,3260],[5,3260,4520],[6,4520,5620],[7,5620,7170],[8,7170,8080],[9,8080,8820],[10,8820,9630],[11,9630,10820],[12,10820,13975]]}}