{"name":"40:81","price":"(Allāhu) ń fi àwọn àmì Rẹ̀ hàn yín. Nítorí náà, èwo nínú àwọn àmì Allāhu l’ẹ máa takò?¹","arabic":"وَيُرِيكُمۡ ءَايَٰتِهِۦ فَأَيَّ ءَايَٰتِ ٱللَّهِ تُنكِرُونَ","category":["40 (Ghafir)","Ghafir","Surah Ghafir","Chapter Ghafir","Surah 40","Chapter 40","The Forgiver","غافِر"],"ayahNumber":4214,"juzNumber":24,"footnotes":"1. Kíyè sí i! Àwọn asòòkùn sẹ́sìn àti àwọn onibidiah yóò máa pe iṣẹ́ aburú ọwọ́ wọn nípasẹ̀ idán pípa àti bidiah ṣíṣe ní “àmì Allāhu” láti lè ṣi àwọn ènìyàn lọ́nà. Kíyè sí i, ohunkóhun tí ó bá máa jẹ́ “àmì Allāhu / àmì Ọlọ́hun” kò níí fi ọ̀nà kan kan lòdì sí “āyah” kan kan nínú al-Ƙur’ān alápọ̀n-ọ́nlé nítorí pé, àwọn āyah al-Ƙur’ān alápọ̀n-ọ́nlé ni òṣùwọ̀n ìdáláre àti ìdálẹ́bi fún ohun tí ẹnikẹ́ni bá pè ní “àmì Ọlọ́hun”. Kódà, ohunkóhun tí ó bá máa jẹ́ “àmì Allāhu” kò níí fi ọ̀nà kan kan lòdì sí hadīth kan nínú àwọn hadīth Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - tó fẹsẹ̀ rinlẹ̀.\n Síwájú sí i, ọ̀tọ̀ ni pàápàá bíbẹ Allāhu - tó ga jùlọ -, ọ̀tọ̀ ni “àmì Ọlọ́hun”. Ẹlẹ́dàá ni Allāhu. Àmì Ọlọ́hun sì ń túmọ̀ sí ẹ̀dá Ọlọ́hun tàbí ọ̀rọ̀ Ọlọ́hun gẹ́gẹ́ bí āyah al-Ƙur’ān alápọ̀n-ọ́nlé. Nítorí náà, àmì Ọlọ́hun ni a lè fojú rí nílé ayé yìí, kì í ṣe pàápàá bíbẹ Allāhu. Ẹni tí ó rí àmì Ọlọ́hun, kò rí Ọlọ́hun. Wallāhu ’a‘lam.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"wayurīkum āyātihi fa-ayya āyāti al-lahi tunkirūna ","translations":["And He shows you","His Signs","Then which","(of the) Signs","(of) Allah","will you deny","(81)"],"transliterationArr":["wayurīkum","āyātihi","fa-ayya","āyāti","al-lahi","tunkirūna",null],"verseTiming":[[1,0,1330],[2,1330,2750],[3,2750,3600],[4,3600,4630],[5,4630,5430],[6,5430,9385]]}}