{"name":"41:10","price":"Ó sì fi àwọn àpáta sínú ilẹ̀ láti òkè rẹ̀. Ó fi ìbùkún sínú rẹ̀. Ó sì pèbùbù àwọn arísìkí (àti ohun àmúsọrọ̀) sínú rẹ̀ láààrin ọjọ́ mẹ́rin.¹ (Àwọn ọjọ́ náà) dọ́gba (síra wọn) fún àwọn olùbèèrè (nípa rẹ̀).","arabic":"وَجَعَلَ فِيهَا رَوَٰسِيَ مِن فَوۡقِهَا وَبَٰرَكَ فِيهَا وَقَدَّرَ فِيهَآ أَقۡوَٰتَهَا فِيٓ أَرۡبَعَةِ أَيَّامٖ سَوَآءٗ لِّلسَّآئِلِينَ","category":["41 (Fussilat)","Fussilat","Surah Fussilat","Chapter Fussilat","Surah 41","Chapter 41","Explained in Detail","فُصِّلَت"],"ayahNumber":4228,"juzNumber":24,"footnotes":"1. Àwọn nasọ̄rọ̄ lérò pé āyah yìí tako àwọn āyah tó ń fi ọjọ́ mẹ́fà rinlẹ̀ fún ìṣẹ̀dá ayé àti ọ̀run àti ohunkóhun tó wà láààrin méjèèjì. Wọ́n ni āyah yìí pè é ní ọjọ́ mẹ́jọ, àwọn āyah yòókù pè é ní ọjọ́ mẹ́fà. Àwọn “nasọ̄rọ̄ tún sọ pé, yálà ọjọ́ mẹ́fà tàbí ọjọ́ mẹ́jọ, ìkíní kejì tún tako àwọn āyah kunfayakūn tó wà nínú al-Ƙur’ān. Wọ́n ní, “Kò wulẹ̀ yẹ kí Allāhu lo ọjọ́ mẹ́fà tàbí ọjọ́ mẹ́jọ kan kan mọ́ níwọ̀n ìgbà tí ó ti jẹ́ pé Ó ti sọ nínú al-Ƙur’ān pé nígbà tí Òun bá gbèrò láti ṣẹ̀dá n̄ǹkan, gbólóhùn “Jẹ́ bẹ́ẹ̀-ó-sì-máa-jẹ́-bẹ́ẹ̀” ni Òun máa ń sọ.” \n Èsì: Ìtakora tófẹ́jọbẹ́ẹ̀ ni èyí. Kì í ṣe ìtakora tóríbẹ́ẹ̀. Àlàyé ọ̀rọ̀ nìyí. Ní ti òǹkà ọjọ́ fún ìṣẹ̀dá sánmọ̀ àti ilẹ̀, àyè mẹ́jọ ni Allāhu Ẹlẹ́dàá ti sọ̀rọ̀ nípa wọn. Ní àyè mẹ́rin nínú wọn, ó jẹyọ nínú wọn pé, “Allāhu ṣẹ̀dá àwọn sánmọ̀ àti ilẹ̀ fún ọjọ́ mẹ́fà.” Ó wà bẹ́ẹ̀ nínú sūrah al-’A‘rọ̄f; 7:54, sūrah Yūnus; 10:3, sūrah Hūd; 11:7 àti sūrah al-Hadīd; 57:4. Ní àyè mẹ́ta nínú wọn, ó jẹyọ nínú wọn pé, “Allāhu ṣẹ̀dá àwọn sánmọ̀, ilẹ̀ àti ohunkóhun tó wà láààrin méjèèjì fún ọjọ́ mẹ́fà.” Ó wà bẹ́ẹ̀ nínú sūrah al-Furƙọ̄n; 25:59, sūrah as-Sajdah; 32:4 àti sūrah Ƙọ̄f; 50:38. Kíyè sí awẹ́ gbólóhùn “àti ohunkóhun tó wà láààrin méjèèjì”. Ìyẹn ti fi hàn pé, ọjọ́ méjì ni Allāhu lò fún ìṣẹ̀dá sánmọ̀ méje, ọjọ́ méjì fún ìṣẹ̀dá ilẹ̀ méje, ọjọ́ méjì fún ìṣẹ̀da ohunkóhun tó wà láààrin méjèèjì. Ohunkóhun tó wà láààrin méjèèjì sì ń túmọ̀ sí gbogbo ohun tó wà lórí ilẹ̀. Èyí tí já sí pé, ilẹ̀ àti ohun tó wà lórí ilẹ̀ kó ọjọ́ mẹ́rin nínú ọjọ́ mẹ́fà.\n Ìtúpalẹ̀ ìṣírò yìí ni Allāhu fúnra Rẹ̀ fi rinlẹ̀ nínú āyah tí à ń ṣe ìtọsẹ̀-ọ̀rọ̀ fún yìí, sūrah Fussilat 41; 9-10. Ìdí nìyí tí àwọn onímọ̀ èdè Lárúbáwá àti àwọn onímọ̀ ẹ̀sìn ’Islām fi ṣàlàyé āyah 10 pé ọjọ́ mẹ́rin yẹn kó ọjọ́ méjì tí Allāhu dárúkọ nínú āyah 9 sínú. Wọ́n ní àpapọ̀ ọjọ́ ìṣẹ̀dá ilẹ̀ àti ohunkóhun tó wà lórí ilẹ̀ ni òǹkà ọjọ́ mẹ́rin náà dúró fún, kì í ṣe fún ohunkóhun tó wà lórí ilẹ̀ nìkan, gẹ́gẹ́ bí èrò ọkàn àwọn aláìnímọ̀ nípa ìlò èdè Lárúbáwá. Irúfẹ́ ìṣírò yìí l’ó tún jẹyọ nínú sūrah an-Nisā’; 4:3 àti Fātir; 35:1. Ní ti gbólóhùn “kunfayakūn” tí í ṣe “Jẹ́ bẹ́ẹ̀-ó-sì-máa-jẹ́-bẹ́ẹ̀”, kò rújú rárá pé, Allāhu ni Alágbára lórí gbogbo n̄ǹkan. Àmọ́ t’òhun ti bẹ́ẹ̀ náà, Allāhu kì í ṣe n̄ǹkan pẹ̀lú ìkánjú. Àti pé Allāhu kò níí ṣe ìṣe kan tí ó máa mú kí ìtakora ṣẹlẹ̀ láààrin àwọn orúkọ Rẹ̀ tó dára jùlọ àti àwọn ìròyìn Rẹ̀ tó ga jùlọ. Ẹ̀dá l’ó lè jẹ́ alágbára-mámèrò, kì í ṣe Allāhu. Ìwọ̀nyẹn ni àwọn ẹ̀kọ́ pàtàkì tí ó wà lábẹ́ lílo òǹkà ọjọ́ mẹ́fà fún ìṣẹ̀dá ayé àti ọ̀run. \n Ipò tí gbólóhùn “kunfayakūn” wà nínú ìṣẹ̀dá ni ipò ìparí ọ̀rọ̀ àti àṣẹ dídi bíbẹ láti ọ̀dọ̀ Allāhu Ẹlẹ́dàá. Ìyẹn ni pé, lẹ́yìn ìkójọ èròjà ìṣẹ̀dá, n̄ǹkan náà kò níí dòhun àfi pẹ̀lú gbólóhùn “kunfayakūn”. Àwọn ẹ̀dá tí kò bá sì jẹmọ́ èròjà ìṣẹ̀dá tàbí àwọn ẹ̀dá tí Allāhu kò sọ nípa èròjà ìṣẹ̀dá wọn fún wa, Allāhu l’Ó kúkú nímọ̀ nípa ìṣẹ̀dá àwọn ẹ̀dá Rẹ̀, ìkíní kejì kò níí di ẹ̀dá àfi pẹ̀lú gbólóhùn “kunfayakūn”. \n Pẹ̀lú àlàyé yìí, ó ń túmọ̀ sí pé, àwọn ẹ̀dá kan di ẹ̀dá pẹ̀lú gbólóhùn “kunfayakūn” nìkan. Àwọn ẹ̀dá kan sì di ẹ̀dá nípasẹ̀ èròjà ìṣẹ̀dá àti gbólóhùn “kunfayakūn”. Allāhu ń ṣẹ̀dá ohun tí Ó bá fẹ́ ní ọ̀nà tí Ó bá fẹ́. Nítorí náà, gbólóhùn “kunfayakūn” tó jẹ́ ti Allāhu nìkan ṣoṣo kò lè sọ Allāhu di olùkánjú. Ìkánjú kì í ṣe ìròyìn rere fún Allāhu. Bí Allāhu ṣe gbàròyìn pẹ̀lú gbólóhùn “kunfayakūn”, bẹ́ẹ̀ náà l’Ó ṣe gbàròyìn pẹ̀lú pẹ̀lẹ́pẹ̀lẹ́, èyí tí í ṣe ìdà kejì ìkánjú. Nítorí náà, Allāhu lágbára láti ṣẹ̀dá ayé àti ọ̀run láààrin ohun tí ó kéré jùlọ sí ìṣẹ́jú kan. Bí Ó bá ṣe bẹ́ẹ̀, kò kúkú sí ẹni tí Ó lè pè É lẹ́jọ́. Bí Allāhu bá sì lo ọjọ́ mẹ́fà fún ìṣẹ̀dá ayé àti ọ̀run, ìyẹn kò túmọ̀ sí pé àṣẹ “Jẹ́-bẹ́ẹ̀” kò jẹ́ tiRẹ̀. Òun l’Ó kúkú ni gbogbo ìjọba, gbogbo agbára àti gbogbo ògo.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"wajaʿala fīhā rawāsiya min fawqihā wabāraka fīhā waqaddara fīhā aqwātahā fī arbaʿati ayyāmin sawāan lilssāilīna ","translations":["And He placed","therein","firmly-set mountains","above it","above it","and He blessed","therein","and determined","therein","its sustenance","in","four","periods","equal","for those who ask","(10)"],"transliterationArr":["wajaʿala","fīhā","rawāsiya","min","fawqihā","wabāraka","fīhā","waqaddara","fīhā","aqwātahā","fī","arbaʿati","ayyāmin","sawāan","lilssāilīna",null],"verseTiming":[[1,0,890],[2,890,1550],[3,1550,2530],[4,2530,3670],[5,3670,4680],[6,4680,5670],[7,5670,6460],[8,6460,7490],[9,7490,9770],[10,9770,11380],[11,11380,11440],[12,11440,12890],[13,12890,15280],[14,15280,16690],[15,16690,18740],[16,18740,19710],[17,19710,21530],[18,21530,23850],[19,23850,29615]]}}