{"name":"41:42","price":"Ìbàjẹ́ kò níí kàn án láti iwájú rẹ̀ àti láti ẹ̀yìn rẹ̀.¹ Ìmísí tí wọ́n sọ̀kalẹ̀ ni láti ọ̀dọ̀ Ọlọ́gbọ́n, Ẹlẹ́yìn.","arabic":"لَّا يَأۡتِيهِ ٱلۡبَٰطِلُ مِنۢ بَيۡنِ يَدَيۡهِ وَلَا مِنۡ خَلۡفِهِۦۖ تَنزِيلٞ مِّنۡ حَكِيمٍ حَمِيدٖ","category":["41 (Fussilat)","Fussilat","Surah Fussilat","Chapter Fussilat","Surah 41","Chapter 41","Explained in Detail","فُصِّلَت"],"ayahNumber":4260,"juzNumber":24,"footnotes":"1. Ìyẹn ni pé, kò sí tírà sánmọ̀ kan tí ó sọ àsọtẹ́lẹ̀ pé irọ́ wà nínú al-Ƙur’ān ṣíwájú ìsọ̀kalẹ̀ rẹ̀. Kò sì wulẹ̀ níí sí tírà kan kan mọ́ lẹ́yìn rẹ̀ láti sánmọ̀, áḿbọ̀sìbọ́sí pé ó máa pe al-Ƙur’ān ní irọ́. Ní ṣókí, kò sí ẹni tí ó lè rí āyah kan pè ní irọ́ nínú al-Ƙur’ān. Èyí jẹ́ ààbò mímọ́ tí Allāhu - Ọba Aláààbò - fi bo al-Ƙur’ān yàtọ̀ sí àwọn tírà yòókù tó ṣíwájú rẹ̀ nítorí pé, ọwọ́kọ́wọ́ ti wọ inú wọn ní ìbámú sí sūrah al-Baƙọrah; 2:75 àti 79 àti sūrah al-Mọ̄’idah; 5:13. \n Kódà ìwé kan tí àwọn nasọ̄rọ̄ ń pè ní “Bíbélì”, ohun tí àwọn òǹtẹ̀wé rẹ̀ “The Bible Societies” sọ nípa rẹ̀ nínú ọ̀rọ̀ ìṣáájú tí wọ́n kọ sínú “Revised Standard Version” ni pé: “Àwọn ìwé bíbélì tí wọ́n kọ́kọ́ túmọ̀ sí èdè Gẹ̀ẹ́sì wáyé láti inú ojúlówó èdè Hébérù àti èdè Greek tààrà. Títúmọ̀ ìwé bíbélì tó sì jẹ́ àtẹ̀jáde àkọ́kọ́ ni iṣẹ́ ọwọ́ William Tyndale. Ó fojú winá àtakò tó lágbára. Wọ́n fi ẹ̀sùn kàn án pé, ó fínnú-fíndọ̀ dojú ìtúmọ̀ àwọn ọ̀rọ̀ inú bíbélì rú, wọ́n sì pa á láṣẹ pé kí wọ́n dáná sun àwọn májẹ̀mu titun rẹ̀ gẹ́gẹ́ bí ó ṣe jẹ́ “àwọn ìtúmọ̀ tí kì í ṣe òdodo”. Arákùnrin náà padà bọ́ sọ́wọ́ àwọn ọ̀tá rẹ̀, wọ́n pa á níta gban̄gba, wọ́n kangi ikú fún un, wọ́n sì dáná sun ún lórí rẹ̀ ní October 1536. Síbẹ̀síbẹ̀ ńkọ́, iṣẹ́ ìtúmọ̀ tí Tyndale ṣe ló padà di ìpìlẹ̀ ìtọ́kasí fún àwọn bíbélì tí wọ́n ń padà túmọ̀ sí èdè Gẹ̀ẹ́sì… Àwọn tí wọ́n ṣe iṣẹ́ ìtúmọ̀ bíbélì ti King James Version ṣe àkíyèsí sí àwọn èyí tí wọ́n ti ṣe ṣíwájú; … Síbẹ̀síbẹ̀ ńkọ́, iṣẹ́ ìtúmọ̀ tí King James Version ṣe tún ní àléébù tó burú gan-an nínú. Láààrin 19 sẹ́ńtúrì, ìdàgbàsókè ẹ̀kọ́ bíbélì àti ṣíṣe àwárí àwọn àkọsílẹ̀ ìpìlẹ̀ bíbélì tí ó lọ́jọ́ lórí ju èyí tí king James Version gbé iṣẹ́ ìtúmọ̀ bíbélì tirẹ̀ lé lórí, ó fi hàn kedere pé àwọn àlèébù = wọ̀nyí pọ̀ púpọ̀ gan-an, wọ́n sì lágbára gan-an dé ibi pé ó bèèrè fún àtúnṣe àwọn ìtúmọ̀ tí wọ́n túmọ̀ bíbélì sí…”","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"lā yatīhi al-bāṭilu min bayni yadayhi walā min khalfihi tanzīlun min ḥakīmin ḥamīdin ","translations":["Not","comes to it","the falsehood","from","before it","before it","and not","from","behind it","A Revelation","from","(the) All-Wise","(the) Praiseworthy","(42)"],"transliterationArr":["lā","yatīhi","al-bāṭilu","min","bayni","yadayhi","walā","min","khalfihi","tanzīlun","min","ḥakīmin","ḥamīdin",null],"verseTiming":[[1,0,600],[2,600,1660],[3,1660,2720],[4,2720,3850],[5,3850,4550],[6,4550,5420],[7,5420,6080],[8,6080,6370],[9,6370,7540],[10,7540,10400],[11,10400,11450],[12,11450,12570],[13,12570,15235]]}}