{"name":"42:10","price":"Ohunkóhun tí ẹ bá yapa-ẹnu lórí rẹ̀, ìdájọ́ rẹ̀ di ọ̀dọ̀ Allāhu. Ìyẹn ni Allāhu, Olúwa mi. Òun ni mo gbáralé. Ọ̀dọ̀ Rẹ̀ sì ni mo máa ṣẹ́rí padà sí (ní ti ìronúpìwàdà). ¹","arabic":"وَمَا ٱخۡتَلَفۡتُمۡ فِيهِ مِن شَيۡءٖ فَحُكۡمُهُۥٓ إِلَى ٱللَّهِۚ ذَٰلِكُمُ ٱللَّهُ رَبِّي عَلَيۡهِ تَوَكَّلۡتُ وَإِلَيۡهِ أُنِيبُ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura","Chapter Ash-Shura","Shura","Surah Shura","Chapter Shura","Ash Shura","Surah Ash Shura","Chapter Ash Shura","Surah 42","Chapter 42","The Consultation","الشُّورىٰ"],"ayahNumber":4282,"juzNumber":25,"footnotes":"1. Àgbọ́yé méjì ni gbogbo tafsīr mú wá lórí gbólóhùn yìí “Ohunkóhun tí ẹ bá yapa-ẹnu lórí rẹ̀, ìdájọ́ rẹ̀ di ọ̀dọ̀ Allāhu.” Ìkíní ni pé, lẹ́yìn tí Allāhu ti mú ìdájọ́ wá pé ’Islām nìkan ṣoṣo ni ẹ̀sìn àṣelà, àmọ́ tí àwọn aláìgbàgbọ́ yapa rẹ̀, kí àwa mùsùlùmí fi wọ́n sílẹ̀ títí di Ọjọ́ àjíǹde tí Allāhu máa fi ìdájọ́ Rẹ̀ mú ìlèrí ìyà Rẹ̀ ṣẹ lórí wọn. Pẹ̀lú àgbọ́yé yìí, āyah yìí jẹ́ ọ̀kan nínú àwọn āyah tó sọ̀kalẹ̀ ṣíwájú àwọn āyah tó ń pàṣẹ ìgbógun ti àwọn aláìgbàgbọ́ tó ń gbógun ti àwa mùsùlùmí àti āyah tó ń pàṣẹ gbígba owó-orí lọ́wọ́ àwọn aláìgbàgbọ́ tí kò gbógun ti àwa mùsùlùmí. \n Ní àgbékalẹ̀ ọ̀rọ̀ mìíràn, āyah yìí ń pàrọwà sùúrù àti ìfaradà fún èyíkéyìí àwùjọ mùsùlùmí tó wà nípò ọ̀lẹ ní orílẹ̀ èdè tí àwọn kèfèrí bá ti ń lo òfin kèfèrí lé wa lórí. Sùúrù náà máa wà bẹ́ẹ̀ títí di ọjọ́ tí ọwọ́ àwa mùsùlùmí yóò ba èkù-idà, tí agbára sì máa jẹ́ ti ’Islām. \n Àgbọ́yé kejì ni pé, kí á ṣẹ́rí gbogbo àwọn ọ̀rọ̀ tí ìyapa-ẹnu bá wáyé lórí wọn sínú al-Ƙur’ān, ọ̀rọ̀ Allāhu àti ìdájọ́ Rẹ̀. Pẹ̀lú àgbọ́yé yìí, āyah yìí jẹ́ ọ̀kan nínú àwọn āyah tó ń pa wá láṣẹ láti fi al-Ƙur’an àti sunnah Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - yanjú àwọn ọ̀rọ̀ ìyapa-ẹnu, gẹ́gẹ́ bí sūrah an-Nisā’; 4:59. \n Àṣìgbọ́ l’ó jẹ́ nígbà náà láti lérò pé āyah náà ń pa wá láṣẹ láti má ṣe mú ìdájọ́ wá lórí àwọn ọ̀rọ̀ ìyapa-ẹnu tí al-Ƙur’ān ti yanjú. Èyí sì máa mú ìtúmọ̀ wíwo ìbàjẹ́ níran lọ́wọ́. Nípasẹ̀ bẹ́ẹ̀ ìbàjẹ́ oníran-ànran àti àdádáálẹ̀ ẹ̀sìn nínú ’Islam sì máa gbòde kanrí láààrin àwọn ẹ̀dá. Àṣẹ wíwo ìbàjẹ́ níran títí dọjọ́ àjíǹde kò sì ti ọ̀dọ̀ Allāhu wá nínú tírà sánmọ̀ kan kan.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"wamā ikh'talaftum fīhi min shayin faḥuk'muhu ilā al-lahi dhālikumu al-lahu rabbī ʿalayhi tawakkaltu wa-ilayhi unību ","translations":["And whatever","you differ","in it","of","a thing","then its ruling","(is) to","Allah","That","(is) Allah","my Lord","upon Him","I put my trust","and to Him","I turn","(10)"],"transliterationArr":["wamā","ikh'talaftum","fīhi","min","shayin","faḥuk'muhu","ilā","al-lahi","dhālikumu","al-lahu","rabbī","ʿalayhi","tawakkaltu","wa-ilayhi","unību",null],"verseTiming":[[1,0,590],[2,590,1840],[3,1840,2580],[4,2580,3520],[5,3520,5030],[6,5030,7750],[7,7750,8130],[8,8130,11170],[9,11170,12260],[10,12260,13140],[11,13140,13940],[12,13940,14840],[13,14840,16170],[14,16170,17120],[15,17120,19215]]}}