{"name":"42:52","price":"Báyẹn sì ni A ṣe fi ìmísí ránṣẹ́ sí ọ nínú àṣẹ Wa. Ìwọ kò mọ kí ni Tírà àti ìgbàgbọ́ òdodo tẹ́lẹ̀ (ṣíwájú ìmísí náà),¹ ṣùgbọ́n A ṣe ìmísí náà ní ìmọ́lẹ̀ kan tí À ń fi ṣe ìmọ̀nà fún ẹni tí A bá fẹ́ nínú àwọn ẹrúsìn Wa. Dájúdájú ìwọ ń pèpè sí ọ̀nà tààrà (’Islām).²","arabic":"وَكَذَٰلِكَ أَوۡحَيۡنَآ إِلَيۡكَ رُوحٗا مِّنۡ أَمۡرِنَاۚ مَا كُنتَ تَدۡرِي مَا ٱلۡكِتَٰبُ وَلَا ٱلۡإِيمَٰنُ وَلَٰكِن جَعَلۡنَٰهُ نُورٗا نَّهۡدِي بِهِۦ مَن نَّشَآءُ مِنۡ عِبَادِنَاۚ وَإِنَّكَ لَتَهۡدِيٓ إِلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ","category":["42 (Ash-Shura)","Ash-Shura","Surah Ash-Shura","Chapter Ash-Shura","Shura","Surah Shura","Chapter Shura","Ash Shura","Surah Ash Shura","Chapter Ash Shura","Surah 42","Chapter 42","The Consultation","الشُّورىٰ"],"ayahNumber":4324,"juzNumber":25,"footnotes":"1. Āyah yìí ń fi kókó pàtàkì kan rinlẹ̀ nípa ìbẹ̀rẹ̀ ìṣẹ̀mí ayé Ànábì wa Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - pé, ṣíwájú kí ìmísí mímọ́ tó bẹ̀rẹ̀ sí ṣọ̀kalẹ̀ fún un kò sí nínú ẹni tó nímọ̀ sí tírà sánmọ̀ kan kan, kò sì dá ìgbàgbọ́ òdodo mọ. Allāhu - tó ga jùlọ - tún fi èyí rinlẹ̀ bẹ́ẹ̀ nínú sūrah ad-Duhā; 93:7. Àmọ́ níkété tí Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - bẹ̀rẹ̀ sí gba ìmísí mímọ́, Allāhu fi ìmọ̀ tírà al-Ƙur’ān àti ìgbàgbọ́ òdodo mọ̀ ọ́n. Ó sì di olùpèpè sínú ìmọ̀nà. Ọ̀pọ̀lọ́pọ̀ àwọn Ànábì àti Òjíṣẹ́ Ọlọ́hun ni ìṣẹ̀mí ayé wọn rí bí Ànábì wa - kí ìkẹ́ àti ọlà Allāhu máa bá a - ti ṣe rí àfi ẹni tí bàbá rẹ̀ bá jẹ́ Ànábì àti Òjíṣẹ́ Ọlọ́hun. \n Àmọ́ ṣá, kò sí abọ̀rìṣà kan tí Allāhu sọ di Ànábì tàbí Òjíṣẹ́ Rẹ̀ rí. Ẹni tí Allāhu máa sọ di Ànábì tàbí Òjíṣẹ́ lè má tí ì mọ tírà nígbà tí Ọlọ́hun kò ì tí ì fún un, ó sì lè má tí ì dá ìgbàgbọ́ òdodo mọ̀, nígbà tí Ọlọ́hun kò tí ì ròyìn Ara Rẹ̀ fún un, àmọ́ kò níí sí nínú àwọn ọ̀ṣẹbọ tàbí àwọn òbìlẹ̀jẹ́ ènìyàn. Kódà, láti kékeré wọn ni Allāhu - Ọba mímọ́ - ti máa ń jogún òye fún wọn pé, “irọ́ ni òrìṣà” títí àsìkò ìmísí wọn yóò fi dé bá wọn. \n Síwájú sí i, tí ẹnì kan bá sì sọ pé, iṣẹ́ wiridi ni Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - máa ń ṣe nínú ọ̀gbun Hirā ṣíwájú kí ó tó di Ànábì Ọlọ́hun, irọ́ l’ó fi pa. Ìdí ni pé, ẹnì kan kì í ṣe wiridi láì gbọwọ́, ta ni ó fún Ànábì lọ́wọ́ wiridi? Kò sí. \n Bákan náà, kò sí ojú ọ̀nà wiridi tí kò lórúkọ, kí ni orúkọ tọrikọ sūfī tí Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - ṣe? Kò sí.\n Èyí tó wá kó ọ̀rọ̀ tán nílẹ̀ ni pé, títẹ̀lé Muhammad ọmọ ‘Abdullah - kí ìkẹ́ àti ọlà Allāhu máa bá a -, kò di ẹ̀sìn àfi láti àsìkò tí ó di Ànábì àti Òjíṣẹ́ Ọlọ́hun. Kò sì lọ sínú ọ̀gbun Hirā mọ́ bẹ̀rẹ̀ láti ọjọ́ àkọ́kọ́ tí mọlāika Jibrīl - kí ọlà Allāhu máa bá a - ti fún un ní ìmísí àkọ́kọ́. Nítorí náà, Ànábì kì í ṣe sūfī, kò sì ṣe wiridi sūfī rí. \n 2. Ẹ wo ìtọsẹ̀-ọ̀rọ̀ sūrah al-Ƙọsọs; 28:56.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"wakadhālika awḥaynā ilayka rūḥan min amrinā mā kunta tadrī mā al-kitābu walā al-īmānu walākin jaʿalnāhu nūran nahdī bihi man nashāu min ʿibādinā wa-innaka latahdī ilā ṣirāṭin mus'taqīmin ","translations":["And thus","We have revealed","to you","an inspiration","by","Our Command","Not","(did) you","know","what","the Book (is)","and not","the faith","But","We have made it","a light","We guide","with it","whom","We will","of","Our slaves","And indeed, you","surely guide","to","(the) Path","Straight","(52)"],"transliterationArr":["wakadhālika","awḥaynā","ilayka","rūḥan","min","amrinā","mā","kunta","tadrī","mā","al-kitābu","walā","al-īmānu","walākin","jaʿalnāhu","nūran","nahdī","bihi","man","nashāu","min","ʿibādinā","wa-innaka","latahdī","ilā","ṣirāṭin","mus'taqīmin",null],"verseTiming":[[1,0,1430],[2,1430,4160],[3,4160,4990],[4,4990,5660],[5,5660,7130],[6,7130,8310],[7,8310,9320],[8,9320,10780],[9,10780,11640],[10,11640,11800],[11,11800,12900],[12,12900,13330],[13,13330,14810],[14,14810,16450],[15,16450,17750],[16,17750,18440],[17,18440,20220],[18,20220,20870],[19,20870,21150],[20,21150,24060],[21,24060,24450],[22,24450,25920],[23,25920,28000],[24,28000,30580],[25,30580,31120],[26,31120,32160],[27,32160,36495]]}}