{"name":"43:45","price":"Bèèrè wò lọ́wọ́ àwọn tí A rán níṣẹ́ ṣíwájú rẹ nínú àwọn Òjíṣẹ́ Wa (pé): “Ǹjẹ́ A sọ àwọn kan di ọlọ́hun tí wọn yóò máa jọ́sìn fún lẹ́yìn Àjọkẹ́-ayé bí?”¹","arabic":"وَسۡـَٔلۡ مَنۡ أَرۡسَلۡنَا مِن قَبۡلِكَ مِن رُّسُلِنَآ أَجَعَلۡنَا مِن دُونِ ٱلرَّحۡمَٰنِ ءَالِهَةٗ يُعۡبَدُونَ","category":["43 (Az-Zukhruf)","Az-Zukhruf","Surah Az-Zukhruf","Chapter Az-Zukhruf","Zukhruf","Surah Zukhruf","Chapter Zukhruf","Az Zukhruf","Surah Az Zukhruf","Chapter Az Zukhruf","Surah 43","Chapter 43","The Gold Adornments","الزُّخْرُف"],"ayahNumber":4370,"juzNumber":25,"footnotes":"1. “Bèèrè wò lọ́wọ́ àwọn tí A rán níṣẹ́ ṣíwájú rẹ nínú àwọn Òjíṣẹ́ Wa”. Àgbọ́yé méjì ni àwọn tafsīr mú wá lórí rẹ̀. \n Àgbọ́yé kìíní ni pé, ìbéèrè náà wáyé nínú ìrìn-àjò òru àti ìgun-sánmọ̀ tí Allāhu mú Ànábì wa - kí ìkẹ́ àti ọlà Allāhu máa bá a - rìn. \n Àgbọ́yé kejì ni pé, ìbéèrè náà wáyé láààrin Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - àti àwọn tó nímọ̀ nípa Taorāt àti ’Injīl. Ìyẹn ni pé, kí ni àwọn tírà méjèèjì sọ nípa “ta ni a gbọ́dọ̀ máa jọ́sìn fún ní ọ̀nà òdodo, ṣé Allāhu ni tàbí àwọn ọlọ́hun mìíràn?” \n Nípa àgbọ́yé kejì yìí, dídárúkọ àwọn Òjíṣẹ́ Allāhu nínú āyah yìí dípò àwọn tírà wọn jọ bí Allāhu ṣe pàṣẹ pé “Tí ẹ bá yapa-ẹnu lórí kiní kan, ẹ ṣẹ́rí rẹ̀ sí ọ̀dọ̀ Allāhu àti ọ̀dọ̀ Òjíṣẹ́ - kí ìkẹ́ àti ọlà Allāhu máa bá a - (ìyẹn nínú sūrah an-Nisā’; 4:59), tí èyí sì túmọ̀ sí al-Ƙur’ān àti sunnah Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a -.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"wasal man arsalnā min qablika min rusulinā ajaʿalnā min dūni al-raḥmāni ālihatan yuʿ'badūna ","translations":["And ask","(those) whom","We sent","before you","before you","of","Our Messengers","did We make","besides","besides","the Most Gracious","gods","to be worshipped","(45)"],"transliterationArr":["wasal","man","arsalnā","min","qablika","min","rusulinā","ajaʿalnā","min","dūni","al-raḥmāni","ālihatan","yuʿ'badūna",null],"verseTiming":[[1,0,1020],[2,1020,1260],[3,1260,2580],[4,2580,3710],[5,3710,4500],[6,4500,4680],[7,4680,7309],[8,7309,8579],[9,8579,9199],[10,9199,10169],[11,10169,11589],[12,11589,12769],[13,12769,17734]]}}