{"name":"43:59","price":"Kí ni òun bí kò ṣe ẹrúsìn kan tí A ṣe ìdẹ̀ra fún. A sì ṣe é ní àpẹ̀ẹrẹ rere fún àwọn ọmọ ’Isrọ̄’īl.¹","arabic":"إِنۡ هُوَ إِلَّا عَبۡدٌ أَنۡعَمۡنَا عَلَيۡهِ وَجَعَلۡنَٰهُ مَثَلٗا لِّبَنِيٓ إِسۡرَٰٓءِيلَ","category":["43 (Az-Zukhruf)","Az-Zukhruf","Surah Az-Zukhruf","Chapter Az-Zukhruf","Zukhruf","Surah Zukhruf","Chapter Zukhruf","Az Zukhruf","Surah Az Zukhruf","Chapter Az Zukhruf","Surah 43","Chapter 43","The Gold Adornments","الزُّخْرُف"],"ayahNumber":4384,"juzNumber":25,"footnotes":"1. Nígbà tí Allāhu - Ọba tó ga jùlọ - fi iná wíwọ̀ rínlẹ̀ fún àwọn òrìṣà àti àwọn abọ̀rìṣà wọn, ìyẹn nínú sūrah al-’Ambiyā’; 21:98-100, àwọn abọ̀rìṣà náà bá mú ọ̀rọ̀ ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - wá gẹ́gẹ́ bí àpẹ̀ẹrẹ òrìṣà àkúnlẹ̀bọ tó máa wọná. Allāhu sì ṣàfọ̀mọ́ ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - fúnra Rẹ̀ pé kò sọra rẹ̀ d’òòṣà, àmọ́ àwọn tí wọ́n sọ ọ́ d’òòṣà nìkan ló máa wọná. Nítorí náà, ọ̀rọ̀ ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - kò jọ ọ̀rọ̀ àwọn tó sọra wọn d’òòṣà lẹ́yìn Allāhu. \n Irú āyah yìí tún ni āyah tí Allāhu ti pé àwọn òrìṣà àkúnlẹ̀bọ ní òkú, ìyẹn nínú sūrah an-Nahl; 16:21. Èyí tún ni ìjọ Ahmadiyyah àti ìjọ asòòkùn sẹ́sìn mìíràn tún sọ pé òkú ni ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a -. Ọ̀rọ̀ kò sì rí bẹ́ẹ̀ rárá nítorí pé, bí ó bá jẹ́ pé ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - ti kú ni Òjíṣẹ́ Allāhu - kí ìkẹ́ àti ọlà Allāhu máa bá a - kò níí sọ pé ‘Īsā ọmọ Mọryam ń padà bọ̀ lópin aye, gẹ́gẹ́ bí ó ṣe rinlẹ̀ bẹ́ẹ̀ nínú àwọn hadith rẹ̀ tó fẹsẹ̀ rinlẹ̀. \n Àmọ́ sá, ìdí tí ìjọ Ahmadiyyah fi gbà pé ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - ti kú ni pé, olùdásílẹ́ ìjọ wọn, mirza ghulam Ahmad ti sọ ara rẹ di ‘Īsā ọmọ Mọryam mọ́ ìjọ rẹ̀ lọ́wọ́. Ìdí sì nìyí tí ìjọ Ahmadiyyah fi ń pè é ní “Mọsīh táàńretí”. Òpùrọ̀ pọ́nńbelé sì ni ọ̀gbẹni náà.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"in huwa illā ʿabdun anʿamnā ʿalayhi wajaʿalnāhu mathalan libanī is'rāīla ","translations":["Not","he","(was) except","a slave","We bestowed Our favor","on him","and We made him","an example","for (the) Children of Israel","for (the) Children of Israel","(59)"],"transliterationArr":["in","huwa","illā","ʿabdun","anʿamnā","ʿalayhi","wajaʿalnāhu","mathalan","libanī","is'rāīla",null],"verseTiming":[[1,0,490],[2,490,800],[3,800,1630],[4,1630,2460],[5,2460,3730],[6,3730,4560],[7,4560,5960],[8,5960,6550],[9,6550,8150],[10,8150,14185]]}}