{"name":"43:61","price":"Dájúdájú òun ni ìmọ̀ (tàbí àmì fún ìsúnmọ́) Àkókò náà. Nítorí náà, ẹ kò gbọdọ̀ ṣeyèméjì lórí rẹ̀. Kí ẹ sì tẹ̀lé mi. Èyí ni ọ̀nà tààrà.¹","arabic":"وَإِنَّهُۥ لَعِلۡمٞ لِّلسَّاعَةِ فَلَا تَمۡتَرُنَّ بِهَا وَٱتَّبِعُونِۚ هَٰذَا صِرَٰطٞ مُّسۡتَقِيمٞ","category":["43 (Az-Zukhruf)","Az-Zukhruf","Surah Az-Zukhruf","Chapter Az-Zukhruf","Zukhruf","Surah Zukhruf","Chapter Zukhruf","Az Zukhruf","Surah Az Zukhruf","Chapter Az Zukhruf","Surah 43","Chapter 43","The Gold Adornments","الزُّخْرُف"],"ayahNumber":4386,"juzNumber":25,"footnotes":"1. Àgbọ́yé mẹ́ta ni àwọn tafsīr mú wá lórí àrọ́pò ọ̀rọ̀-orúkọ tó jẹyọ nínú “ wa’innahu”. \n Àgbọ́yé kìíní ni pé, àrọ́pò ọ̀rọ̀-orúkọ náà dúró fún “Ìsọ̀kalẹ̀ ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - láti ojú sánmọ̀, ìyẹn sì máa jẹ́ àmì láti mọ̀ pé dájúdájú Àkókò náà ti súnmọ́ pẹ́kípẹ́kí.\n Àgbọ́yé kejì ni pé, àrọ́pò ọ̀rọ̀-orúkọ náà dúró fún ìsọ̀kalẹ̀ al-Ƙur̂ān, tí ó ń fi ìmọ̀ mọ̀ wá, tí ó sì ń fi àmì hàn wá nípa ìsúnmọ́ Àkókò náà. Àgbọ́yé kẹta ni pé, àrọ́pò ọ̀rọ̀-orúkọ náà dúró fún ìwásáyé Ànábì wa Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a -. Gbogbo rẹ̀ túmọ̀ sí pé, ìkọ̀ọ̀kan wọn ń jẹ́ àmì ńlá láti mọ̀ pé Àkókò náà ti fẹ́ ṣẹlẹ̀. Àgbọ́yé mẹ́tààta wọ̀nyí kúkú ni òdodo ọ̀rọ̀ nítorí pé, kò sí èyí tí kò ní ẹ̀rí láti inú hadīth Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a -. Kò sì sí ọ̀kan nínú àwọn àgbọ́yé mẹ́tààta wọ̀nyí tí ẹ̀rí àtakò wà fún láti inú hadīth Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a -. \n Àmọ́ nígbà tí pọ́nna bá jẹyọ nínú āyah al-Ƙur’ān bí irú èyí, ọ̀nà kan pàtàkì nínú ìyọní-pọ́nna ni lílo hadīth Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a -. Bí ó tilẹ̀ jẹ́ pé ṣíwájú kí á tó lè lo hadīth kan kan fún ìyọní-pọ́nna, al-Ƙur’ān fúnra rẹ̀ ni ohun àkọ́kọ́ tí a máa lò. Èyí máa ṣẹlẹ̀ nípasẹ̀ wíwo sàkánì tí ọ̀rọ̀ onípọ́nna náà ti jẹyọ. A máa wòye sí ọ̀rọ̀ tí ó ń bá á bọ̀ níwájú àti ọ̀rọ̀ tí ó tún mú wá lẹ́yìn rẹ̀. Kódà ìwòye yìí lè ṣẹlẹ̀ nígbà mìíràn nínú āyah kan náà tàbí nínú sūrah mìíràn pẹ̀lú. Nítorí náà, àgbọ́yé tó ń fi rinlẹ̀ pé ìsọ̀kalẹ̀ ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - láti ojú sánmọ̀ ni āyah náà ń sọ nípa rẹ̀ l’ó padà gbéwọ̀n jùlọ nítorí pé, ọ̀rọ̀ ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - l’ó ń sọ bọ̀ láti inú āyah 57 títí dé āyah 65. Kì í ṣe ọ̀rọ̀ nípa al-Ƙur’ān tàbí ọ̀rọ̀ nípa Ànábì wa Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a -.\n Àmọ́ sá, tí ẹnì kan bá bá àgbọ́yé mìíràn lọ nínú àwọn àgbọ́yé méjèèjì yòókù, kò la àtakò lọ níwọ̀n ìgbà tí onítọ̀un kò bá ti tako ìsọ̀kalẹ̀ ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - láti ojú sánmọ̀ lópin ayé nítorí pé, níwọ̀n ìgbà tí hadīth tó fẹsẹ̀ rinlẹ̀ ti fi rinlẹ̀, aláìgbàgbọ́ tí ó máa jẹ̀bi ikú lábẹ́ òfin ’Islām ni ẹnikẹ́ni nínú àwọn mùsùlùmí tó bá takò ìsọ̀kalẹ̀ ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - láti ojú sánmọ̀ lópin ayé.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"wa-innahu laʿil'mun lilssāʿati falā tamtarunna bihā wa-ittabiʿūni hādhā ṣirāṭun mus'taqīmun ","translations":["And indeed, it","surely (is) a knowledge","of the Hour","So (do) not","(be) doubtful","about it","and follow Me","This","(is the) Path","Straight","(61)"],"transliterationArr":["wa-innahu","laʿil'mun","lilssāʿati","falā","tamtarunna","bihā","wa-ittabiʿūni","hādhā","ṣirāṭun","mus'taqīmun",null],"verseTiming":[[1,0,1760],[2,1760,2690],[3,2690,4060],[4,4060,4650],[5,4650,6530],[6,6530,7180],[7,7180,11000],[8,11000,11750],[9,11750,12690],[10,12690,16685]]}}