{"name":"44:32","price":"A kúkú ṣà wọ́n lẹ́ṣà lórí àwọn ẹ̀dá (àsìkò tiwọn) pẹ̀lú ìmọ̀ (tí a mọ̀ nípa wọn).¹","arabic":"وَلَقَدِ ٱخۡتَرۡنَٰهُمۡ عَلَىٰ عِلۡمٍ عَلَى ٱلۡعَٰلَمِينَ","category":["44 (Ad-Dukhan)","Ad-Dukhan","Surah Ad-Dukhan","Chapter Ad-Dukhan","Dukhan","Surah Dukhan","Chapter Dukhan","Ad Dukhan","Surah Ad Dukhan","Chapter Ad Dukhan","Surah 44","Chapter 44","The Smoke","الدُّخَان"],"ayahNumber":4446,"juzNumber":25,"footnotes":"1 “pẹ̀lú ìmọ̀” ní àyè yìí túmọ̀ sí pé, ṣíṣa àwọn ọmọ ’Isrọ̄’īl lẹ́ṣà lórí àwọn ẹ̀dá, ó ti wà nínú ìmọ̀ Allāhu - Ọba Alámọ̀tán - nípa wọn ṣíwájú ìṣẹ̀dá wọn. Nítorí náà, àwọn tí Allāhu ṣe ní Ànábì àti Òjíṣẹ́ Rẹ̀ nínú wọn, kì í ṣe àṣìmú tàbí àṣìyàn bí kò ṣe àṣàyàn ẹ̀dá. Irú āyah yìí ni ọ̀rọ̀ Allāhu tó sọ pé: “Allāhu ló nímọ̀ jùlọ nípa ibi tí Ó ń fí iṣẹ́-rírán Rẹ̀ sí.” Sūrah al-’Ani‘ām; 6:124\n Bákan náà, “lórí àwọn ẹ̀dá” ní àyè yìí túmọ̀ sí àwọn ẹ̀dá ìgbà tiwọn. \n Àmọ́ lẹ́yìn ìgbédìde Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a -, ìjọ rẹ̀ ni Allāhu tún ṣà lẹ́ṣà lórí àwọn ọmọ ’Isrọ̄’īl àti àwọn ènìyàn yòókù pátápátá. Èyí wà ní ìbámu sí sūrah āli ‘Imrọ̄n; 3:110. \n Kíyè sí i, ibikíbi nínú al-Ƙur’ān tí Allāhu bá ti sọ pé, Òun ṣa àwọn ẹ̀dá kan lẹ́ṣà lórí àwọn ẹ̀dá mìíràn, ó dúró fún àwọn ẹ̀dá ìgbà tiwọn nìkan. Ìṣàlẹ́ṣà náà kò sì kan àwọn ará ìgbà mìíràn. Ẹ wo sūrah al-Baƙọrah; 2:47 àti 122, sūrah āli ‘Imrọ̄n; 3:33, sūrah al-’Ani‘ām; 6:86, sūrah al-’A‘rọ̄f; 7:140 àti sūrah al-Jāthiyah; 45:16.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"walaqadi ikh'tarnāhum ʿalā ʿil'min ʿalā al-ʿālamīna ","translations":["And certainly","We chose them","by","knowledge","over","the worlds","(32)"],"transliterationArr":["walaqadi","ikh'tarnāhum","ʿalā","ʿil'min","ʿalā","al-ʿālamīna",null],"verseTiming":[[1,0,900],[2,900,2450],[3,2450,3110],[4,3110,3900],[5,3900,4370],[6,4370,8175]]}}