{"name":"47:4","price":"Nítorí náà, nígbà tí ẹ bá pàdé àwọn tó ṣàì gbàgbọ́ (lójú ogun ẹ̀sìn), ẹ máa bẹ́ wọn lọ́rùn ǹsó títí di ìgbà tí ẹ máa fi rí wọn pa dáadáa. (Nígbà tí ọwọ́ yín bá ti bà wọ́n tán), ẹ dè wọ́n mọ́lẹ̀ sórí ìgbèkùn. Lẹ́yìn náà, ẹ lè tú wọn sílẹ̀ ní ọ̀fẹ́ tàbí kí ẹ tú wọn sílẹ̀ pẹ̀lú owó ìtúsílẹ̀ títí kò fi níí sí ogun ẹ̀sìn mọ́.1 Ìyẹn (wà bẹ́ẹ̀). Tí ó bá jẹ́ pé Allāhu bá fẹ́, ìbá gbẹ̀san fúnra Rẹ̀ (láì níí la ogun lọ), ṣùgbọ́n nítorí kí Ó lè dán apá kan yín wò lára apá kan ni. Àwọn mùsùlùmí tí wọ́n sì pa sí ojú-ọ̀nà Allāhu, Allāhu kò níí sọ iṣẹ́ wọn dòfo.","arabic":"فَإِذَا لَقِيتُمُ ٱلَّذِينَ كَفَرُواْ فَضَرۡبَ ٱلرِّقَابِ حَتَّىٰٓ إِذَآ أَثۡخَنتُمُوهُمۡ فَشُدُّواْ ٱلۡوَثَاقَ فَإِمَّا مَنَّۢا بَعۡدُ وَإِمَّا فِدَآءً حَتَّىٰ تَضَعَ ٱلۡحَرۡبُ أَوۡزَارَهَاۚ ذَٰلِكَۖ وَلَوۡ يَشَآءُ ٱللَّهُ لَٱنتَصَرَ مِنۡهُمۡ وَلَٰكِن لِّيَبۡلُوَاْ بَعۡضَكُم بِبَعۡضٖۗ وَٱلَّذِينَ قُتِلُواْ فِي سَبِيلِ ٱللَّهِ فَلَن يُضِلَّ أَعۡمَٰلَهُمۡ","category":["47 (Muhammad)","Muhammad","Surah Muhammad","Chapter Muhammad","Surah 47","Chapter 47","Muhammad","مُحَمَّد"],"ayahNumber":4549,"juzNumber":26,"footnotes":"1. “títí kò fi níí sí ogun ẹ̀sìn mọ́” Ìgbà wo ni ìyẹn máa ṣẹlẹ̀ nílé ayé? Mujāhid - kí Allāhu kẹ́ ẹ - sọ pé, “Títí di ìgbà tí Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - yóò fi sọ̀kalẹ̀ láti ojú sánmọ̀ ní òpin ayé.” Ìyẹn ni pé, ó di ìgbà tí Ànábì ‘Īsā bá tó sọ̀kalẹ̀ láti ojú sánmọ̀ kí ogun ẹ̀sìn tó kásẹ̀ nílẹ̀. Ƙọtādah - kí Allāhu kẹ́ ẹ - sọ pé, “Títí di ìgbà tí kò bá sí ìbọ̀rìsà mọ́ nílé ayé.” Ibn Kathīr. \n Kíyè sí i! Nígbà tí ogun ẹ̀sìn ṣẹ̀ṣẹ̀ bẹ̀rẹ̀ ní àsìkò Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a -, kò sí kíkó ẹrú ogun wálé. Èyí jẹ́ òfin ìpìlẹ̀ tí ó wà nínú sūrah Al-’Anfāl; 8:67. Àmọ́ lẹ́yìn tí ọwọ́ pípa ti dun àwọn aláìgbàgbọ́ dáadáa lójú ogun ẹ̀sìn, tí àwọn èèkàn èèkan nínú wọn ti bá ogun lọ, ẹ̀tọ́ wà nígbà náà láti máa sọ wọ́n di ẹrú ogun. Èyí sì ni ó jẹyọ nínú āyah òkè yìí.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"fa-idhā laqītumu alladhīna kafarū faḍarba al-riqābi ḥattā idhā athkhantumūhum fashuddū al-wathāqa fa-immā mannan baʿdu wa-immā fidāan ḥattā taḍaʿa al-ḥarbu awzārahā dhālika walaw yashāu al-lahu la-intaṣara min'hum walākin liyabluwā baʿḍakum bibaʿḍin wa-alladhīna qutilū fī sabīli al-lahi falan yuḍilla aʿmālahum ","translations":["So when","you meet","those who","disbelieve","then strike","the necks","until","when","you have subdued them","then bind firmly","the bond","then either","a favor","afterwards","or","ransom","until","lays down","the war","its burdens","That","And if","Allah had willed","Allah had willed","surely, He could have taken retribution","from them","but","to test","some of you","with others","And those who","are killed","in","(the) way of Allah","(the) way of Allah","then never","He will cause to be lost","their deeds","(4)"],"transliterationArr":["fa-idhā","laqītumu","alladhīna","kafarū","faḍarba","al-riqābi","ḥattā","idhā","athkhantumūhum","fashuddū","al-wathāqa","fa-immā","mannan","baʿdu","wa-immā","fidāan","ḥattā","taḍaʿa","al-ḥarbu","awzārahā","dhālika","walaw","yashāu","al-lahu","la-intaṣara","min'hum","walākin","liyabluwā","baʿḍakum","bibaʿḍin","wa-alladhīna","qutilū","fī","sabīli","al-lahi","falan","yuḍilla","aʿmālahum",null],"verseTiming":[[1,0,870],[2,870,1890],[3,1890,2890],[4,2890,3760],[5,3760,4550],[6,4550,5690],[7,5690,7910],[8,7910,10490],[9,10490,12660],[10,12660,13510],[11,13510,14550],[12,14550,16500],[13,16500,17860],[14,17860,19040],[15,19040,19690],[16,19690,21400],[17,21400,24190],[18,24190,25000],[19,25000,25680],[20,25680,26550],[21,26550,28180],[22,28180,29970],[23,29970,30510],[24,30510,32720],[25,32720,33570],[26,33570,35350],[27,35350,36230],[28,36230,37120],[29,37120,38230],[30,38230,40270],[31,40270,41140],[32,41140,42730],[33,42730,43520],[34,43520,43950],[35,43950,45070],[36,45070,45680],[37,45680,46290],[38,46290,47950],[39,47950,49815]]}}