{"name":"4:158","price":"bí kò ṣe pé Allāhu gbé e wá sókè lọ́dọ̀ Rẹ̀ ni. Allāhu sì ń jẹ́ Alágbára, Ọlọ́gbọ́n.¹","arabic":"بَل رَّفَعَهُ ٱللَّهُ إِلَيۡهِۚ وَكَانَ ٱللَّهُ عَزِيزًا حَكِيمٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":651,"juzNumber":6,"footnotes":"1. Āyah 157 àti 158 yìí jẹ́ ọ̀kan nínú àwọn āyah tí ó sọ ìjọ Ahmadiyyah Ƙọ̄diyaniyyah tàbí Lahọ̄riyyah) di ìjọ kèfèrí. Ìdí ni pé, ìgbàgbọ́ ìjọ Ahmadiyyah ni pé, wọn kan ‘Īsā ọmọ Mọryam mọ́ igi àgbélébùú - kí ọlà Allāhu máa bá a -, àmọ́ kò kú sí orí rẹ̀. Ìjọ Ahmadiyyah sì tún gbà pé ‘Īsā ọmọ Mọryam sá àsálà wá sí ilẹ̀ India. Ó fẹ́ ìyàwó níbẹ̀. Ó kú síbẹ̀. Wọ́n sì sin ín síbẹ̀. Lẹ́yìn náà, ìjọ Ahmadiyyah gbà pé ẹni tí ó padà wá sáyé lábẹ́ ìpadàbọ̀ ‘Īsā ọmọ Mọryam kò jẹ́ ẹnì kan bí kò ṣe mirza Ghulam Ahmad, olùdásílẹ̀ ìjọ Ahmadiyyah. \n Ọ̀nà tí èyí sì gbà ṣẹlẹ̀ nìyí nínú ìtọ́kasí wọn: “The word of God which I set out at some places in my book, the Baraheen Ahmadiyya explains how God Almighty made me Isa Son of Mary. In that book God first named me Mary and then disclosed that God had breathed His spirit into this Mary and said that after the breathing of this spirit my status as Mary was converted into my status as Isa, and thus Isa having been born of Mary was called Son of Mary.” Ìtúmọ̀: Mirza Ghulam Ahmad wí pé “Ọ̀rọ̀ Allāhu tí mo mú jáde láti inú ìwé mi, Baraheen Ahmadiyya, ó ń ṣe àlàyé ọ̀nà tí Allāhu gbà sọ mí di ‘Īsā ọmọ Mọryam. Nínú ìwé yẹn, Allāhu kọ́ sọ mí ní Mọryam. Lẹ́yìn náà, wọ́n fi hàn mí pé Allāhu ti fẹ́ ẹ̀mí mímọ́ Rẹ̀ sí Mọryam yìí lára. Ó sì sọ pé lẹ́yìn tí Òun ti fẹ́ ẹ̀mí mímọ́ sí mi lára, ipò mi gẹ́gẹ́ bí Mọryam ti paradà báyìí, mo sì ti di ‘Īsā. Èyí rí bẹ́ẹ̀ fún wí pé bíbí tí Mọryam bí ‘Īsā ni wọ́n fi ń pè é ní ‘Īsā ọmọ Mọryam. [Ìwé Tadhkirah, òǹkọ̀wé: = = (Ahmadi) Muhammad Zafrullah Khan; ojú ewé: 369.] Ibi dandan Allāhu kí ó máa bá òpùrọ́ yìí.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"bal rafaʿahu al-lahu ilayhi wakāna al-lahu ʿazīzan ḥakīman ","translations":["Nay","he was raised","(by) Allah","towards Him","And is","Allah","All-Mighty","All-Wise","(158)"],"transliterationArr":["bal","rafaʿahu","al-lahu","ilayhi","wakāna","al-lahu","ʿazīzan","ḥakīman",null],"verseTiming":[[1,0,230],[2,230,1230],[3,1230,2120],[4,2120,4540],[5,4540,5270],[6,5270,6130],[7,6130,7060],[8,7060,8665]]}}