{"name":"4:159","price":"Kò sì níí sí ẹnì kan nínú àwọn onítírà (láyé nígbà tí ‘Īsā ọmọ Mọryam bá sọ̀kalẹ̀ padà láti ojú sánmọ̀) àfi kí ó gbà á gbọ́ ní òdodo ṣíwájú ikú rẹ̀.¹Ní Ọjọ́ Àjíǹde, ó sì máa jẹ́ ẹlẹ́rìí lórí wọn.","arabic":"وَإِن مِّنۡ أَهۡلِ ٱلۡكِتَٰبِ إِلَّا لَيُؤۡمِنَنَّ بِهِۦ قَبۡلَ مَوۡتِهِۦۖ وَيَوۡمَ ٱلۡقِيَٰمَةِ يَكُونُ عَلَيۡهِمۡ شَهِيدٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":652,"juzNumber":6,"footnotes":"1. Àgbọ́yé méjì ni àwọn tafsīr mú wá lórí arọ́pò ọ̀rọ̀-orúkọ tó jẹyọ nínú àpólà ọ̀rọ̀-orúkọ yìí “قَبْلَ مَوْتِهِۦۖ”. \n Àgbọ́yé kìíní ni pé, arọ́pò ọ̀rọ̀-orúkọ náà dúró fún ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a -. Nípa bẹ́ẹ̀ ìtúmọ̀ āyah náà máa lọ báyìí pé: “Kò sì níí sí ẹnì kan nínú àwọn onítírà (láyé nígbà tí ‘Īsā bá sọ̀kalẹ̀ padà láti ojú sánmọ̀) àfi kí ó gba ‘Īsā ọmọ Mọryam gbọ́ ní òdodo ṣíwájú ikú ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a -.” Èyí sì máa jẹ́ oore ìronúpìwàdà àti ìpadà sínú ẹ̀sìn ’Islām fún ọ̀wọ́ àwọn tí ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - bá padà bá láyé nínú àwọn tó ti sọ ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - di olúwa àti olùgbàlà wọn. \n Àgbọ́yé kejì ni pé, arọ́pò ọ̀rọ̀-orúkọ náà dúró fún ikú àwọn onítírà tó ń pọ́kàkà ikú. Nípa bẹ́ẹ̀ ìtúmọ̀ āyah náà máa lọ báyìí pé: “Kò sì níí sí ẹnì kan nínú àwọn onítírà àfi kí ó gba ‘Īsā ọmọ Mọryam gbọ́ ní òdodo ṣíwájú ikú àwọn onítírà náà lásìkò ìpọ́kàkà ikú.” \n Àlàyé tí àwọn onímọ̀ Tafsīr mú wá fún àgbọ́yé kejì yìí ni pé, àwọn mọlāika máa fi àwòrán ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - han ẹnikẹ́ni tí ó fẹ́ kú láti fojú rí àṣìṣe rẹ̀ lórí ọ̀rọ̀ ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a -. Ó máa ronú pìwàdà lásìkò náà, àmọ́ kò sí ìronúpìwàdà àti ìgbàgbọ́ òdodo tó wúlò lásìkò ìpọ́kàkà ikú. \n Àgbọ́yé méjèèjì wọ̀nyí kúkú dára, àmọ́ nígbà tí pọ́n-na (ṣubhah) bá jẹyọ nínú āyah al-Ƙur’ān, ọ̀nà kan pàtàkì nínú ìyọnípọ́n-na ni lílo hadīth Ànábì. Àmọ́, ṣíwájú kí á tó lè lo hadīth kan kan fún ìyọnípọ́n-na, al-Ƙur’ān fúnra rẹ̀ ni ohun àkọ́kọ́ tí a máa lò. Èyí máa ṣẹlẹ̀ nípasẹ̀ wíwo sàkánì tí ọ̀rọ̀ onípọ́n-na náa ti jẹyọ. A máa wòye sí ọ̀rọ̀ tí ń bá á bọ̀ níwájú (tàbí) àti ọ̀rọ̀ tí ó tún mú wá lẹ́yìn rẹ̀ (bí ó bá wà). Kódà ìwòye yìí lè ṣẹlẹ̀ nígbà mìíràn nínú āyah kan náà. Nítorí náà, lórí āyah yìí, àgbọ́yé tó gbéwọ̀n jùlọ ni àgbọ́yé kìíní. Èyí tí ó ń fi rinlẹ̀ pé ikú ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - lópin ayé ni arọ́pò ọ̀rọ̀-orúkọ náà dúró fún. Èyí rí bẹ́ẹ̀ nítorí pé, ọ̀rọ̀ tó jẹyọ nínú āyah 157 ń sọ nípa pé àwọn kan ń sọ pé àwọn pa ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a -, àwọn kàn án mọ́ igi àgbélébùú. Ó sì ti kú. Allāhu - subhānahu wa ta'ālā - sì sọ pé ọ̀rọ̀ náà kò rí bẹ́ẹ̀ rárá bí kò ṣe pé Òun gbé ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - wá sókè lọ́dọ̀ Òun ni. Òkodoro ọ̀rọ̀ náà sì máa hàn sí gbogbo ayé ní àsìkò ìpadà-sọ̀kalẹ̀ rẹ̀ láti ojú sánmọ̀. Ìyẹn sì ni àlàyé tó jẹyọ nínú àwọn āyah 158 àti 159. \n Síwájú sí i, kalmọh “رفع” (rọfa‘a) lè túmọ̀ sí àgbéga tẹ̀mí (ìyẹn, àgbéga ipò gẹ́gẹ́ bí èyí tó jẹyọ nínú sūrah Al-’a‘rọ̄f; 7:176 àti sūrah Mọryam; 19:57) tàbí kí ó túmọ̀ sí àgbéga tara (ìyẹn gbígbé ara kúrò láti àyè ìsàlẹ̀ sí àyè òkè gẹ́gẹ́ bí èyí tó jẹyọ nínú sūrah Fātir; 35:10). Àmọ́ kò ní tàbí-ṣùgbọ́n nínú mọ́ pé, ìgbàkígbà tí harafi “إلى” bá ti tẹ̀lé “رفع”, àgbéga tara l’ó máa jẹ́ ìtúmọ̀ rẹ̀. Wàyí, níwọ̀n ìgbà tí ó sì ti jẹ́ pé òkè sánmọ̀ ni pàápàá bíbẹ Allāhu - subhānahu wa ta'ālā - wà, ìdí nìyí tí “بَل رَّفَعَهُ ٱللَّهُ إِلَيْهِۚ” fi túmọ̀ sí “kò rí bẹ́ẹ̀, Allāhu gbé ‘Īsā ọmọ Mọryam wá sókè sínú sánmọ̀ lọ́dọ̀ Rẹ̀ ni.” \n Bí ẹnì kan bá wá ń retí kalmọh “السماء” (sánmọ̀) nínú āyah náà ṣíwájú kí ó tó lè gbàgbọ́ pé nínú sánmọ̀ ni Allāhu gbé ‘Īsā ọmọ Mọryam wá ní ẹ̀mí àti ara, bóyá ni onítọ̀ún gbàgbọ́ pé sánmọ̀ ni pàápàá bíbẹ Allāhu gan-an wà. Lórí èyí, ẹ wo ìtọsẹ̀-ọ̀rọ̀ fún sūrah al-’Ani‘ām; 6:18. \n Nítorí náà, gbogbo Mùsùlùmí onisunnah l’ó mọ̀ ní àmọ̀dájú pé, òkè sánmọ̀ keje ni Allahu wà nítorí pé, sánmọ̀ yìí náà ni Ànábì wa Muhammad - kí ọlà Allāhu máa bá a - gùn lọ láti lọ gba ìrun wákàtí márààrùn wá lọ́dọ̀ Allāhu - subhānahu wa ta'ālā - lásìkò ìrìn òru àti ìgun-sánmọ̀ gẹ́gẹ́ bí Allāhu ṣe fi rinlẹ̀ ní ìbẹ̀rẹ̀ sūrah al-’Isrọ̄’. \n Kíyè sí i! Tòhun ti bí àìgbàgbọ́ Fir‘aon ṣe gbópọn tó, ó kúkú gbà pé sánmọ̀ ni Allāhu wà. Ó sì bẹ Hāmọ̄n ní ilé gíga fíofío kọ́. Ó fẹ́ yọjú wo Allāhu! (sūrah al-Ƙọsọs; 28:38). Nítorí náà, inú sánmọ̀ ni Allāhu gbé ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - wá. Ó sì wà níbẹ̀, kì í ṣe ní ti ìgbésí ayé ti ayé, àmọ́ ní ti ìgbésí ayé tó bá inú sánmọ̀ mu, ìyẹn irú ìgbésí ayé tàwọn mọlāika, tí wọn kì í jẹun, tí wọn kì í mu, tí wọn kì í ṣẹ̀gbin, tí wọn kì í dàgbà sí i, tí wọn kì í gbó lára àti bẹ́ẹ̀ bẹ́ẹ̀ lọ. Àti pé nípasẹ̀ àwọn iṣẹ́ tí ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - máa ṣe nígbà tí ó bá padà dé láti ojú sánmọ̀ níbi rírún àgbélébùú, pípa ẹlẹ́dẹ̀, kíkọ gbogbo ẹ̀sìn àfi ẹ̀sìn ’Islām nìkan ṣoṣo, pípa Mọsīh Dajjāl àti bẹ́ẹ̀ bẹ́ẹ̀ lọ l’ó máa mú kí àwọn onítírà àsìkò náà ronú pìwàdà sínú ẹ̀sìn ’Islām. \n Kíyè sí i, ìpadàbọ̀ ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - lópin ayé kì í ṣe ní àwòrán ipò Ànábì, bí kò ṣe ní àwòrán ọmọlẹ́yìn Ànábì wa Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - àti adájọ́ onídéédé nítorí pé, kò níí sí Ànábì titun kan kan mọ́ lẹ́yìn Ànábì wa Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a -. Àti pé, ìjọ Ànábì wa - kí ìkẹ́ àti ọlà Allāhu máa bá a - nìkan l’ó wà láyé báyìí, nítorí náà Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - ẹni tí kádàrá rẹ̀ jẹmọ́ ìpadàbọ̀ sáyé kò níí wà nípò Ànábì lásìkò náà bí kò ṣe pé, ó máa wà nípò ọ̀kan nínú àwọn ọmọlẹ́yìn Ànábì àsìkò yìí. Ìdí sì nìyí tí kò fi níí fi tírà kan dájọ́ lẹ́yìn al-Ƙur’ān. Pẹ̀lú àlàyé yìí, àgbọ́yé kejì kò lè rọ́nà lọ. \n Àmọ́ sá, tí ẹnì kan bá bá àgbọ́yé kejì yìí lọ, kò la àtakò lọ níwọ̀n ìgbà tí onítọ̀ún kò bá ti tako ìsọ̀kalẹ̀ ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - láti ojú sánmọ̀ l’ópin ayé nítorí pé, níwọ̀n ìgbà tí hadīth tó fẹsẹ̀ rinlẹ̀ ti fi rinlẹ̀, aláìgbàgbọ́ tí ó máa jẹ̀bi ikú lábẹ́ òfin ’Islām ni ẹnikẹ́ni nínú àwọn mùsùlùmí tó bá tako ìsọ̀kalẹ̀ ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - láti ojú sánmọ̀ l’ópin ayé. Wòóore! Gbogbo òǹkà arọ́pò ọ̀rọ̀-orúkọ “ẹyọ ẹnì kẹta” ìyẹn “هـُ” tó jẹyọ láti inú āyah 157 títí dé 159 nínú sūrah yìí jẹ́ méjìlá. Àyè kan péré l’ó ti ń tọ́ka sí Allāhu, ìyẹn sì ni kalmọh “إِلَيْهِ”, ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - ni mọ́kànlá yòókù ń tọ́ka sí nítorí pé, ọ̀rọ̀ rẹ̀ nìkan ni kókó nínú àwọn āyah náà. Ìwòyesí yìí tún jẹ́ àtìlẹ́yìn fún àgbọ́yé kìíní láti fi rinlẹ̀ pé “قَبْلَ مَوْتِهِۦۖ” ń túmọ̀ sí “ṣíwájú ikú ‘Isā ọmọ Mọryam - kí ọlà Allāhu máa bá a - lópin ayé.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"wa-in min ahli al-kitābi illā layu'minanna bihi qabla mawtihi wayawma al-qiyāmati yakūnu ʿalayhim shahīdan ","translations":["And (there is) not","from","(the) People","(of) the Book","but","surely he believes","in him","before","his death","And (on the) Day","(of) the Resurrection","he will be","against them","a witness","(159)"],"transliterationArr":["wa-in","min","ahli","al-kitābi","illā","layu'minanna","bihi","qabla","mawtihi","wayawma","al-qiyāmati","yakūnu","ʿalayhim","shahīdan",null],"verseTiming":[[1,0,540],[2,540,1540],[3,1540,2170],[4,2170,3150],[5,3150,3950],[6,3950,5980],[7,5980,6500],[8,6500,7210],[9,7210,8110],[10,8110,8850],[11,8850,10180],[12,10180,10920],[13,10920,11900],[14,11900,13425]]}}