{"name":"4:171","price":"Ẹ̀yin onítírà, ẹ má ṣe tayọ ẹnu-ààlà nínú ẹ̀sìn yín, kí ẹ sì má sọ ohun kan nípa Allāhu àfi òdodo. Òjíṣẹ́ Allāhu ni Mọsīh ‘Īsā ọmọ Mọryam. Ọ̀rọ̀ Rẹ̀ (kun fayakūn) tí Ó sọ ránṣẹ́ sí Mọryam l’Ó sì fi ṣẹ̀dá rẹ̀. Ẹ̀mí kan (tí Allāhu ṣẹ̀dá) láti ọ̀dọ̀ Rẹ̀ sì ni (Ó fi dá Mọsīh ‘Īsā ọmọ Mọryam). Nítorí náà, ẹ gbàgbọ́ nínú Allāhu àti àwọn Òjíṣẹ́ Rẹ̀. Ẹ yé sọ mẹ́ta (lọ́kan) mọ́. Kí ẹ jáwọ́ níbẹ̀ ló jẹ́ oore fún yín. Allāhu nìkan ni Ọlọ́hun, Ọ̀kan ṣoṣo tí a gbọ́dọ̀ jọ́sìn fún ní ọ̀nà òdodo. Ó mọ́ tayọ kí Ó ní ọmọ. TiRẹ̀ ni ohunkóhun tó wà nínú àwọn sánmọ̀ àti ohunkóhun tó wà nínú ilẹ̀. Allāhu sì tó ní Alámòjúútó.¹","arabic":"يَٰٓأَهۡلَ ٱلۡكِتَٰبِ لَا تَغۡلُواْ فِي دِينِكُمۡ وَلَا تَقُولُواْ عَلَى ٱللَّهِ إِلَّا ٱلۡحَقَّۚ إِنَّمَا ٱلۡمَسِيحُ عِيسَى ٱبۡنُ مَرۡيَمَ رَسُولُ ٱللَّهِ وَكَلِمَتُهُۥٓ أَلۡقَىٰهَآ إِلَىٰ مَرۡيَمَ وَرُوحٞ مِّنۡهُۖ فَـَٔامِنُواْ بِٱللَّهِ وَرُسُلِهِۦۖ وَلَا تَقُولُواْ ثَلَٰثَةٌۚ ٱنتَهُواْ خَيۡرٗا لَّكُمۡۚ إِنَّمَا ٱللَّهُ إِلَٰهٞ وَٰحِدٞۖ سُبۡحَٰنَهُۥٓ أَن يَكُونَ لَهُۥ وَلَدٞۘ لَّهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ وَكَفَىٰ بِٱللَّهِ وَكِيلٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":664,"juzNumber":6,"footnotes":"1. Kíyè sí i, Allāhu - subhānahu wa ta'ālā - fún ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - ní orúkọ mẹ́rin wọ̀nyí nínú āyah yìí: “mọsīh”, “rọsūlullāh”, “kalmọtu-llāh” àti “rūhu-llāh”. Àwọn nasọ̄rọ̄ sì ń tìràn mọ́ “mọsīh”, “kalmọtu-llāh” àti “rūhu-llah” bí ẹni pé orúkọ mẹ́tẹ̀ẹ̀ta wọ̀nyí túmọ̀ sí pé ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - ni olùgbàlà, ọlọ́run, ẹlẹ́dàá àti olúwa. Èyí kò sì rí bẹ́ẹ̀ rárá. \n Ní àkọ́kọ́ náà, nínú èdè Lárúbáwá kò sí èyí tí ó túmọ̀ sí olùgbàlà tàbí ọlọ́run tàbí ẹlẹ́dàá tàbí olúwa nínú àwọn orúkọ àti ìròyìn mẹ́tẹ̀ẹ̀ta náà tí al-Ƙur’ān fún ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a -. \n Ìtúmọ̀ “mọsīh” nínú èdè Lárúbáwá nìwọ̀nyí: ẹni tí kò ní kòjẹ̀gbin, alárìnká tí kò ní ibùgbé kan ní pàtó, ẹni tí wọ́n fi òróró pa lára, ẹni tí ó máa ń fọwọ́ àdúà pa aláìlera láti tọrọ ìwòsàn fún un lọ́dọ̀ Ọlọ́hun, olódodo, ẹlẹ́ṣẹ̀ tí wọ́n ti pa ẹ̀ṣẹ̀ rẹ̀ rẹ́. \n Ní ti “kalmọtu-llāh”, ìtúmọ̀ rẹ̀ ni “ọ̀rọ̀ Allāhu / ọ̀rọ̀ Ọlọ́hun”. Ọ̀rọ̀ Allāhu ni ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - nítorí pé, Allāhu - subhānahu wa ta'ālā - ṣẹ̀dá rẹ̀ pẹ̀lú gbólóhùn “kun fayakūn”. Ìtúmọ̀ yìí sì ni Allāhu - subhānahu wa ta‘ālā - fi rinlẹ̀ fúnra Rẹ̀ nínú sūrah āli-‘Imrọ̄n; 3:45, 47 àti 59 pẹ̀lú sūrah Mọryam; 19:35. Kódà pípè tí Allāhu - subhānahu wa ta'ālā - pe ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - ní “kalmọtu-llāh” jẹ́ àpọ́nlé fún un ni nítorí pé, kò wúlẹ̀ sí ẹ̀dá kan, yálà n̄ǹkan ẹlẹ́mìí tàbí aláìlẹ́mìí, àfi kí ó jẹ́ “kalmọtu-llāh”. Ìyẹn ni pé, gbogbo ẹ̀dá tí Allāhu ṣẹ̀dá rẹ̀ l’Ó sọ “Jẹ́ bẹ́ẹ̀” fún ṣíwájú kí irú ẹ̀dá bẹ́ẹ̀ tó máa bẹ. Allāhu nìkan ṣoṣo l’Ó sì ni “Jẹ́ bẹ́ẹ̀”, kì í ṣe ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - tàbí ẹlòmíìràn. \n Bákan náà, ní ti “rūhu-llāh”, ìtúmọ̀ rẹ̀ ni “ẹ̀mí Allāhu / ẹ̀mí Ọlọ́hun ”. Ẹ̀mí Allāhu ni ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a -nítorí pé, Allāhu ṣẹ̀dá rẹ̀ sínú ikùn ìyá rẹ̀, Ó sì ní kí mọlāika Jibrīl - kí ọlà Allāhu máa bá a - wá fẹ́ atẹ́gùn ẹ̀mí mímọ́ sára ìyá rẹ̀ nítorí kí ‘Īsā lè di n̄ǹkan ẹlẹ́mìí. Àti ẹ̀mí mímọ́ àti ẹ̀mí àìmọ́ tàbí ẹ̀mí òkùnkùn, Allāhu l’Ó ṣẹ̀dá ìkíní kejì wọn. Kì í ṣe Èṣù. Èṣù kò dá ohun kan kan. Èṣù gan-an fúnra rẹ̀, ẹ̀dá kan nínú àwọn ẹ̀dá tí Allāhu ṣẹ̀dá l’ó wà. Wòóore, fúnra Allāhu l’Ó kúkú fẹ́ atẹ́gùn ẹ̀mí mímọ́ kan sára Ànábì Ādam - kí ọlà Allāhu máa bá a - nígbà tí Ó mọ ọ́n kalẹ̀ tán ní ọ̀bọrọgidi gẹ́gẹ́ bí ó ṣe wà nínú sūrah Sọ̄d; 38:72 àti sūrah al-Hijr; 15:29. Ìyẹn kò sì sọ Ànábì Ādam di olúwa lẹ́yìn Allāhu. Báwo ni ‘Īsā ọmọ Mọryam tí wọ́n fi atẹ́gùn ẹ̀mí rẹ̀ rán mọlāika Jibril ṣe máa wá di olúwa? Rárá, kò lè di olúwa. Tí Allāhu bá wá pe ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - ní “rūhu-llāh” àpọ́nlé ni fún un nítorí pé, kò sí ẹ̀dá ẹlẹ́mìí kan níbikíbi àfi kí ó jẹ́ pé “rūhu-llāh” ni òun náà. \n Síwájú sí i, lílo “Ọlọ́hun” gẹ́gẹ́ bí ẹ̀yán fún ẹ̀dá kan nínú àwọn ẹ̀dá Ọlọ́hun kò sọ n̄ǹkan náà di ọlọ́hun tàbí olúwa tàbí ẹlẹ́dàá tàbí olùgbàlà, àmọ́ àpọ́nlé ni fún ẹ̀dá náà. \n Wòye sí àwọn ìbéèrè wọ̀nyí kí ó tún lè yé ọ yékéyéké: Ẹ̀mí wo ni Ọlọ́hun fi sọ ‘Īsā ọmọ Mọryam di n̄ǹkan ẹlẹ́mìí? Ẹ̀mí wo ni Ọlọ́hun fi sọ Mọryam di n̄ǹkan ẹlẹ́mìí? Ẹ̀mí wo ni Ọlọ́hun fi sọ Èṣù di n̄ǹkan ẹlẹ́mìí? Èsì kan náà ni gbogbo wọn ní. Èsì náà sì ni pé, “Ẹ̀mí Ọlọ́hun “rūhu-llāh” ni.” Èyí tí ó túmọ̀ sí pé Allāhu l’Ó ṣẹ̀dá ẹ̀mí tó wà lára ẹnì kọ̀ọ̀kan wa. \n Síwájú sí i, nínú al-Ƙur’ān, Allāhu pe ràkúnmí kan ní “nọ̄ƙọtu-llāh”, ìtúmọ̀ “ràkúnmí Ọlọ́hun”. Èyí kò sì túmọ̀ sí pé, “ràkúnmí ni Ọlọ́hun” bí kò ṣe pé ràkúnmí ìyanu tí ó jáde tòhun ti ọmọ rẹ̀ lẹ́yìn rẹ̀ láti inú àpáta. Àti pé Allāhu fi ṣe àpọ́nlé fún orúkọ ràkúnmí náà ni. \n Bákan náà, nínú al-Ƙur’ān, Allāhu pe ilé kan ní “Baetu-llāh”, ìtúmọ̀ “ilé Ọlọ́hun”. Èyí kò sì túmọ̀ sí pé “ilé ni Ọlọ́hun” bí kò ṣe pé ilé tí àwọn ẹ̀dá ti ń jọ́sìn fún Ọlọ́hun, ìyẹn sì ni mọ́sálásí. Àti pé Allāhu fi ṣe àpọ́nlé fún orúkọ ilé náà ni. \n Bákan náà, nínú al-Ƙur’ān, Allāhu pe ẹ̀dá kan ní “’abdullāh”, ìtúmọ̀ “ẹrú Ọlọ́hun”. Èyí kò sì túmọ̀ sí pé “ẹrú ni Ọlọ́hun” bí kò ṣe pé ẹ̀dá tí ń jọ́sìn fún Ọlọ́hun, tí ó sì wà lábẹ́ òfin Ọlọ́hun pẹ̀lú ìjuwọ́-jusẹ̀-sílẹ̀ pátápátá fún Ọlọ́hun. Àti pé Allāhu fi ṣe àpọ́nlé fún ẹ̀dá náà ni nítorí pé, gbogbo wa ni ẹrú Ọlọ́hun, a fẹ́ tàbí a kọ̀. Báwo wá ni “kalmọtu-llāh” ṣe máa túmọ̀ sí “kalmọh ni Ọlọ́hun / ọ̀rọ̀ ni Ọlọ́hun”? Àní sẹ́ báwo ni “rūhu-llāh” ṣe máa túmọ̀ sí “rūhu ni Ọlọ́hun / ẹ̀mí ni Ọlọ́hun”? Ìròrí àwọn nasọ̄rọ̄ lásán ni ọ̀rọ̀ ìsọkúsọ náà, tí wọ́n ti mú wọ inú ìwé wọn pé “Láti ìṣẹ̀ṣẹ̀kọ́ṣe ni ọ̀rọ̀ ti wà. Ọ̀rọ̀ sì wà pẹ̀lú Ọlọ́run. Ọlọ́run sì ni ọ̀rọ̀ náà.” Láéláé, Ọlọ́hun àwa mùsùlùmí kì í ṣe ọ̀rọ̀. Ọlọ́hun wa kì í ṣe ẹ̀mí. Nítorí náà, kò sí ẹ̀dá kan àfi kí ó di bíbẹ nígbà tí Allāhu bá sọ pé “Jẹ́ bẹ́ẹ̀” Ó sì máa jẹ́ bẹ́ẹ̀. \n Bákan náà, mọ̀ dájú pé àpọ́nlé ni Mọ́là, Haúsá l’a Haúsá ń jẹ́. Nínú àpólà ọ̀rọ̀-orúkọ (noun phrase), ìgbàkígbà tí Allāhu bá fi orúkọ ara Rẹ̀ ṣe ẹ̀yán-ajórúkọ (nominal modifier) fún ọ̀rọ̀-orúkọ kan ìyẹn ni pé, ìgbàkígbà tí Allāhu bá ṣe àfitì ẹ̀dá kan nínú àwọn ẹ̀dá Rẹ̀ tì sọ́dọ̀ ara Rẹ̀, bí irú èyí “kalmọtu-llāh, rūhu-llāh, nāƙọtu-llāh, baetu-llāh, kitābu-llāh, ‘abdu-llāh, nabiyyu-llāh, rọsūlu-llāh” àti bẹ́ẹ̀ bẹ́ẹ̀ lọ, yàtọ̀ sí pé Allāhu fi ṣe àpọ́nlé fún ọ̀rọ̀-orúkọ agbẹ̀yán náà, kò tún ní ìtúmọ̀ mìíràn bí kò ṣe láti fi “ìbátan ìní” hàn (possessive genitive). \n Nínú àgbékalẹ̀ ọ̀rọ̀ mìíràn, ẹ̀hun oníbàátan ìní (possessive genitive construction) ni ìtúmọ̀ tó máa ń wà níbikíbi tí Allāhu bá ti lo orúkọ ara Rẹ̀ gẹ́gẹ́ bí ẹ̀yán-ajórúkọ nínú àpólà orúkọ, kì í sì ní ìtúmọ̀ alálàjẹ́ (appositive). \n Pẹ̀lú àlàyé yìí, ìtúmọ̀ “kalmọtu-llāh” ni “kalmọh ti Allāhu / kalmọh tí ó jẹ́ ohun ìní Allāhu, kì í ṣe Allāhu tí ó ń jẹ́ kalmọh nítorí pé, kalmọh kò sí nínú àlàjẹ́ fún Allāhu”. \n Rūhu-llāh, “rūhu ti Allāhu / rūhu tí ó jẹ́ ohun ìní Allāhu, kì í ṣe Allāhu tí ó ń jẹ́ rūhu nítorí pé, rūhu kò sí nínú àlàjẹ́ fún Allāhu”. Nāƙọtu-llāh “nāƙọh ti Allāhu / nāƙọh tí ó jẹ́ ohun ìní Allāhu, kì í ṣe Allāhu tí ó ń jẹ́ nāƙọh nítorí pé, nāƙọh kò sí nínú àlàjẹ́ fún Allāhu”. Baetu-llāh, “baeutu ti Allāhu / baetu tí ó jẹ́ ohun ìní Allāhu, kì í ṣe Allāhu tí ó ń jẹ́ baetu nítorí pé, baetu kò sí nínú àlàjẹ́ fún Allāhu” àti bẹ́ẹ̀ bẹ́ẹ̀ lọ. \n Gẹ́gẹ́ bí a sì ti sọ síwájú pé àpọ́nlé láti ọ̀dọ̀ Allāhu l’ó jẹ́ fún ẹ̀dá kan nígbàkígbà tí Allāhu bá fi orúkọ ara Rẹ̀ ṣe ẹ̀yán ajórúkọ fún un. Nítorí náà, kò wúlẹ̀ sí kiní kan láyé àti lọ́run, yálà ipò ọlá tàbí ipò ìjọba, àfi kí ó jẹ́ ohun ìní fún Allāhu nítorí pé, ti Allāhu ni ohunkóhun tó wà nínú sánmọ̀ àti nínú ilẹ̀. Ọ̀dọ̀ Rẹ̀ sì ni àbọ̀ gbogbo wọn. \n Báwo wá ni Allāhu, Olúwa gbogbo ẹ̀dá ṣe lè jẹ́ ohun ìní, tí ohun ìní sì máa tún jẹ́ Allāhu, Ọlọ́hun Olúwa? Kò lè ṣẹlẹ̀ láéláé. Nítorí náà, èyíkéyìí orúkọ ipò tí Allāhu bá lò fún ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a -, kò fi ibì kan kan túmọ̀ sí pé ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - ni olúwa tàbí olùgbàlà lẹ́yìn Allāhu. Ṣebí àràkárà tí alágbẹ̀dẹ bá fi irin dá, kò lè sọ irin di alágbẹ̀dẹ.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"yāahla al-kitābi lā taghlū fī dīnikum walā taqūlū ʿalā al-lahi illā al-ḥaqa innamā al-masīḥu ʿīsā ub'nu maryama rasūlu al-lahi wakalimatuhu alqāhā ilā maryama warūḥun min'hu faāminū bil-lahi warusulihi walā taqūlū thalāthatun intahū khayran lakum innamā al-lahu ilāhun wāḥidun sub'ḥānahu an yakūna lahu waladun lahu mā fī al-samāwāti wamā fī al-arḍi wakafā bil-lahi wakīlan ","translations":["O People","(of) the Book","(Do) not","commit excess","in","your religion","and (do) not","say","about","Allah","except","the truth","Only","the Messiah","Isa","son","(of) Maryam","(was) a Messenger","(of) Allah","and His word","which He conveyed","to","Maryam","and a spirit","from Him","So believe","in Allah","and His Messengers","And (do) not","say","Three","desist","(it is) better","for you","Only","Allah","(is) God","One","Glory be to Him","That","He (should) have","for Him","a son","To Him (belongs)","whatever","(is) in","the heavens","and whatever","(is) in","the earth","And is sufficient","Allah","(as) a Disposer of affairs","(171)"],"transliterationArr":["yāahla","al-kitābi","lā","taghlū","fī","dīnikum","walā","taqūlū","ʿalā","al-lahi","illā","al-ḥaqa","innamā","al-masīḥu","ʿīsā","ub'nu","maryama","rasūlu","al-lahi","wakalimatuhu","alqāhā","ilā","maryama","warūḥun","min'hu","faāminū","bil-lahi","warusulihi","walā","taqūlū","thalāthatun","intahū","khayran","lakum","innamā","al-lahu","ilāhun","wāḥidun","sub'ḥānahu","an","yakūna","lahu","waladun","lahu","mā","fī","al-samāwāti","wamā","fī","al-arḍi","wakafā","bil-lahi","wakīlan",null],"verseTiming":[[1,0,2380],[2,2380,3440],[3,3440,3800],[4,3800,4580],[5,4580,5060],[6,5060,6110],[7,6110,6680],[8,6680,7710],[9,7710,8060],[10,8060,8940],[11,8940,9480],[12,9480,10700],[13,10700,12030],[14,12030,13110],[15,13110,13630],[16,13630,14120],[17,14120,14890],[18,14890,15700],[19,15700,16570],[20,16570,18850],[21,18850,19750],[22,19750,21350],[23,21350,21950],[24,21950,22730],[25,22730,23600],[26,23600,24640],[27,24640,26370],[28,26370,27490],[29,27490,28780],[30,28780,29390],[31,29390,30430],[32,30430,31950],[33,31950,33240],[34,33240,34180],[35,34180,35420],[36,35420,36560],[37,36560,37490],[38,37490,39320],[39,39320,40090],[40,40090,42960],[41,42960,43240],[42,43240,44060],[43,44060,44860],[44,44860,45470],[45,45470,45970],[46,45970,46910],[47,46910,47310],[48,47310,47510],[49,47510,48980],[50,48980,49560],[51,49560,49770],[52,49770,50830],[53,50830,51620],[54,51620,52640],[55,52640,54065]]}}