{"name":"4:3","price":"Tí ẹ bá páyà pé ẹ ò níí ṣe déédé nípa (fífẹ́) ọmọ òrukàn,¹ ẹ fẹ́ ẹni tó lẹ́tọ̀ọ́ si yín nínú àwọn obìnrin; méjì tàbí mẹ́ta tàbí mẹ́rin.² Ṣùgbọ́n tí ẹ bá páyà pé ẹ ò níí ṣe déédé, (ẹ fẹ́) ẹyọ kan tàbí ẹrúbìnrin yín. Ìyẹn súnmọ́ jùlọ pé ẹ ò níí ṣàbòsí.","arabic":"وَإِنۡ خِفۡتُمۡ أَلَّا تُقۡسِطُواْ فِي ٱلۡيَتَٰمَىٰ فَٱنكِحُواْ مَا طَابَ لَكُم مِّنَ ٱلنِّسَآءِ مَثۡنَىٰ وَثُلَٰثَ وَرُبَٰعَۖ فَإِنۡ خِفۡتُمۡ أَلَّا تَعۡدِلُواْ فَوَٰحِدَةً أَوۡ مَا مَلَكَتۡ أَيۡمَٰنُكُمۡۚ ذَٰلِكَ أَدۡنَىٰٓ أَلَّا تَعُولُواْ","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":496,"juzNumber":4,"footnotes":"1. Bí àpẹ̀ẹrẹ, kí ẹni tí ó ń mójútó ọmọ òrukàn obìnrin nífẹ̀ẹ́ láti fẹ́ ọmọbìnrin náà lẹ́yìn tí ó bàlágà tán, àmọ́ ọkùnrin náà kọ̀ láti fún un ní sọ̀daàkí rẹ̀ nítorí pé, ó mọ bí ogún ọmọbìnrin náà ṣe tó ní iye. \n 2. Kíyè sí i, àgbọ́yé “méjì” ni pé “fẹ́ méjì”, àgbọ́yé “mẹ́ta” ni pé “fẹ́ mẹ́ta”, àgbọ́yé “mẹ́rin” sì ni pé, “fẹ́ mẹ́rin”. Àgbọ́yé ọ̀rọ̀ àsọpọ̀ “wa” tó sì jẹyọ láààrin “mọthnā wa thulātha wa rubā‘” ni “tàbí”. Ìyẹn ni pé, “fẹ́ méjì tàbí mẹ́ta tàbí mẹ́rin”. Níwọ̀n ìgbà tí o ò bá gbọ́ “méjì” yé sí “fẹ́ méjì papọ̀ ní ọjọ́ kan náà”, tí o ò gbọ́ “mẹ́ta” yé sí “fẹ́ mẹ́ta papọ̀ ní ọjọ́ kan náà”, tí o ò sí gbọ́ “mẹ́rin” yé sí “fẹ́ mẹ́rin papọ̀ ní ọjọ́ kan náà”, o ò gbọ́dọ̀ gbọ́ “mọthnā wa thulātha wa rubā‘” yé sí “fẹ́ mẹ́sàn-án” ìyẹn, nípasẹ̀ lílo ọ̀rọ̀-àsopọ̀ “àti” fún ṣíṣírò méjì, mẹ́ta àti mẹ́rin papọ̀ mọ́ra wọn. Má sì ṣe sọ̀rọ̀ ní ìsọ̀rọ̀ àwọn aláìmọ̀kan nípa sísọ pé, “mẹ́ ni Ọlọ́hun wí”. Wọ́n ń parọ́ mọ́ Allāhu ni. Allāhu kò sọ “mẹ́”. Àwọn ni ìyà “mẹ́” ń wù ú jẹ. \n Bákan náà, má ṣe korò ojú sí fífẹ́ ìyàwó dé orí méjì tàbí mẹ́ta tàbí mẹ́rin fún ẹni tí ó fẹ́ máa gbé bùkátà púpọ̀. \n Ọkọ lè jẹ̀bi ẹ̀sùn àìṣe déédé, kódà kó jẹ́ oníyàwó kan péré, níwọ̀n ìgbà tí ó bá ti jẹ́ ahun, aláìbìkátà tàbí alápámáṣiṣẹ́ ọkùnrin. \n Wòóore! Pẹ̀lú āyah yìí, mẹ́rin lòpin òǹkà àpapọ̀ ìyàwó tó lè wà nípò ìyàwó fún mùsùlùmí ẹyọ kan. Òfin t’ó rọ̀ mọ́ òǹkà àpapọ̀ ìyàwó Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - ni sūrah al-’Ahazāb; 33: 50 - 52. Òfin náà ló fún Ànábì wa Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - ní ẹ̀tọ́ láti fẹ́ kọjá mẹ́rin. Kò dojú rú rárá. Al-hamdu lillāh. Láti ọ̀dọ̀ ọmọ Ṣihāb, dájúdájú ó gbọ́ pé dájúdájú Òjíṣẹ́ Allāhu - kí ìkẹ́ àti ọlà Allāhu máa bá a - sọ fún ọkùnrin kan láti ìdìlé Thaƙīf tí ó gba ’Islām, tí ìyàwó rẹ̀ sì jẹ́ mẹ́wàá ní àsìkò tí ó gba ’Islām pé, “Mú mẹ́rin nínú wọn, kí o sì kọ àwọn yòókù sílẹ̀.” (Muwattọ’u Imām Mọ̄lik, Musnad Ṣāfi‘iy, Sunan Baehaƙiy àti Sọhīhu bn Hibbān)","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"wa-in khif'tum allā tuq'siṭū fī al-yatāmā fa-inkiḥū mā ṭāba lakum mina al-nisāi mathnā wathulātha warubāʿa fa-in khif'tum allā taʿdilū fawāḥidatan aw mā malakat aymānukum dhālika adnā allā taʿūlū ","translations":["And if","you fear","that not","you will be able to do justice","with","the orphans","then marry","what","seems suitable","to you","from","the women","two","or three","or four","But if","you fear","that not","you can do justice","then (marry) one","or","what","possesses","your right hand","That","(is) more appropriate","that (may) not","you oppress","(3)"],"transliterationArr":["wa-in","khif'tum","allā","tuq'siṭū","fī","al-yatāmā","fa-inkiḥū","mā","ṭāba","lakum","mina","al-nisāi","mathnā","wathulātha","warubāʿa","fa-in","khif'tum","allā","taʿdilū","fawāḥidatan","aw","mā","malakat","aymānukum","dhālika","adnā","allā","taʿūlū",null],"verseTiming":[[1,0,680],[2,680,1590],[3,1590,2350],[4,2350,3430],[5,3430,3650],[6,3650,4830],[7,4830,6650],[8,6650,6910],[9,6910,7750],[10,7750,8160],[11,8160,9020],[12,9020,12610],[13,12610,14250],[14,14250,14520],[15,14520,15410],[16,15410,16480],[17,16480,17020],[18,17020,20040],[19,20040,20860],[20,20860,21940],[21,21940,24400],[22,24400,24990],[23,24990,25850],[24,25850,26650],[25,26650,27730],[26,27730,29210],[27,29210,29630],[28,29630,30070],[29,30070,30920],[30,30920,32780],[31,32780,33660],[32,33660,35870],[33,35870,36610],[34,36610,37995]]}}