{"name":"4:34","price":"Àwọn ọkùnrin ni òpómúléró¹ fún àwọn obìnrin nítorí pé, Allāhu ṣ’oore àjùlọ fún apá kan wọn lórí apá kan² àti nítorí ohun tí wọ́n ń ná nínú dúkìá wọn.³ Àwọn obìnrin rere ni àwọn olùtẹ̀lé-àṣẹ (Allāhu àti Òjíṣẹ́ Rẹ̀, lẹ́yìn náà àṣẹ ọkọ), àwọn olùṣọ́-ẹ̀tọ́ ọkọ ní kọ̀rọ̀ fún wí pé Allāhu ṣọ́ (ẹ̀tọ́ tiwọn náà fún wọn lọ́dọ̀ ọkọ wọn). Àwọn tí ẹ sì ń páyà oríkunkun wọn4, ẹ ṣe wáàsí fún wọn, ẹ takété sí ibùsùn wọn, ẹ lù wọ́n. Tí wọ́n bá sì tẹ̀lé àṣẹ yín, ẹ má ṣe fí ọ̀nà kan kan wá wọn níjà5. Dájúdájú Allāhu ga, Ó tóbi.6","arabic":"ٱلرِّجَالُ قَوَّٰمُونَ عَلَى ٱلنِّسَآءِ بِمَا فَضَّلَ ٱللَّهُ بَعۡضَهُمۡ عَلَىٰ بَعۡضٖ وَبِمَآ أَنفَقُواْ مِنۡ أَمۡوَٰلِهِمۡۚ فَٱلصَّٰلِحَٰتُ قَٰنِتَٰتٌ حَٰفِظَٰتٞ لِّلۡغَيۡبِ بِمَا حَفِظَ ٱللَّهُۚ وَٱلَّٰتِي تَخَافُونَ نُشُوزَهُنَّ فَعِظُوهُنَّ وَٱهۡجُرُوهُنَّ فِي ٱلۡمَضَاجِعِ وَٱضۡرِبُوهُنَّۖ فَإِنۡ أَطَعۡنَكُمۡ فَلَا تَبۡغُواْ عَلَيۡهِنَّ سَبِيلًاۗ إِنَّ ٱللَّهَ كَانَ عَلِيّٗا كَبِيرٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":527,"juzNumber":5,"footnotes":"1. aláṣẹ, olùdarí, alámòójútó àti onímọ̀ràn rere.\n 2. Ìyẹn ni pé, Allāhu ṣ’oore àjùlọ fún àwọn ọkùnrin lórí àwọn obìnrin wọn.\n 3. Ìyẹn ni pé, àwọn ọkùnrin ni wọn yóò máa gbé bùkátà àwọn obìnrin wọn. Àmọ́ ọ̀pọ̀lọ́pọ̀ àwọn ọkùnrin ti yẹrí kúrò níbẹ̀. Ìdí nìyí tí ọ̀pọ̀lọ́pọ̀ obìnrin fi kún ìgboro fọ́fọ́. Bí ó tilẹ̀ jẹ́ pé òṣì tí ìjọba orílẹ̀ èdè Nàìjíríà dẹ sí àwọn ará ìlú jẹ́ okùnfà kan pàtàkì, àwọn ọlọ́mọge fúnra wọn ń fi títako ṣíṣe ìyàwó kejì tàbí ìkẹta tàbí ìkẹrin bọ́ sí ọwọ́ alápámáṣiṣẹ́ ọ̀dọ́ ọkùnrin. \n 4. Èyí ni ti olóríkunkun obìnrin. Ní ti olóríkunkun ọkùnrin, ẹ wo āyah 128.\n 5. Ẹ má ṣe fi ọ̀nà kan kan ṣàbòsí sí wọn, Ẹ má ṣe fi ọ̀nà kan kan tayọ ẹnu-ààlà sí wọn.\n 6. Kíyè sí i, ọkọ kò gbọ́dọ̀ lu ìyàwó rẹ̀ àfi pẹ̀lú àwọn májẹ̀mu mẹ́fà kan. Ìkíní: lílù náà gbọ́dọ̀ jẹ́ lẹ́yìn tí wáàsí àti títakété sí ibùsùn rẹ̀ kò bá so èso rere lára ìyàwó. Ìkejì: lílù náà kò gbọ́dọ̀ ṣẹlẹ̀ lásìkò ìbínú. Ìkẹta: ohun tí ọkọ yóò fi lu ìyàwó rẹ̀ kò gbọ́dọ̀ nípọn ju etí aṣọ lọ. Ìkẹrin: kò gbọ́dọ̀ tayọ òǹkà mẹ́wàá. Ìkarùn-ún: kò gbọ́dọ̀ fi àpá sí ìyàwó rẹ̀ lára. Ìkẹfà: kò gbọ́dọ̀ lu ìyàwó rẹ̀ ní àyè ọ̀wọ̀ tàbí àyè ẹlẹgẹ́ bí ojú, orí àti ikùn. Ẹ tún wo ìtọsẹ̀-ọ̀rọ̀ fún sūrah Sọ̄d; 38:44. \n Bákan náà, tí lílù bá ń wáyé lemọ́lemọ́, ìfisùn fún àtúnṣe tàbí ìkọ̀sílẹ̀ lọpọ́n súnkàn ní ìbámu sí āyah 35.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"al-rijālu qawwāmūna ʿalā al-nisāi bimā faḍḍala al-lahu baʿḍahum ʿalā baʿḍin wabimā anfaqū min amwālihim fal-ṣāliḥātu qānitātun ḥāfiẓātun lil'ghaybi bimā ḥafiẓa al-lahu wa-allātī takhāfūna nushūzahunna faʿiẓūhunna wa-uh'jurūhunna fī al-maḍājiʿi wa-iḍ'ribūhunna fa-in aṭaʿnakum falā tabghū ʿalayhinna sabīlan inna al-laha kāna ʿaliyyan kabīran ","translations":["[The] men","(are) protectors","of","the women","because","(has) bestowed","Allah","some of them","over","others","and because","they spend","from","their wealth","So the righteous women","(are) obedient","guarding","in the unseen","that which","(orders) them to guard","(by) Allah","And those (from) whom","you fear","their ill-conduct","then advise them","and forsake them","in","the bed","and [finally] strike them","Then if","they obey you","then (do) not","seek","against them","a way","Indeed","Allah","is","Most High","Most Great","(34)"],"transliterationArr":["al-rijālu","qawwāmūna","ʿalā","al-nisāi","bimā","faḍḍala","al-lahu","baʿḍahum","ʿalā","baʿḍin","wabimā","anfaqū","min","amwālihim","fal-ṣāliḥātu","qānitātun","ḥāfiẓātun","lil'ghaybi","bimā","ḥafiẓa","al-lahu","wa-allātī","takhāfūna","nushūzahunna","faʿiẓūhunna","wa-uh'jurūhunna","fī","al-maḍājiʿi","wa-iḍ'ribūhunna","fa-in","aṭaʿnakum","falā","tabghū","ʿalayhinna","sabīlan","inna","al-laha","kāna","ʿaliyyan","kabīran",null],"verseTiming":[[1,0,1450],[2,1450,2890],[3,2890,3300],[4,3300,6219],[5,6219,6769],[6,6769,7549],[7,7549,8509],[8,8509,9529],[9,9529,10239],[10,10239,11629],[11,11629,13699],[12,13699,15099],[13,15099,15499],[14,15499,16889],[15,16889,18949],[16,18949,20309],[17,20309,21669],[18,21669,22929],[19,22929,23469],[20,23469,24039],[21,24039,26649],[22,26649,27879],[23,27879,29149],[24,29149,30879],[25,30879,32979],[26,32979,34979],[27,34979,35199],[28,35199,36519],[29,36519,38759],[30,38759,39819],[31,39819,41109],[32,41109,41719],[33,41719,42649],[34,42649,44659],[35,44659,46229],[36,46229,47509],[37,47509,48419],[38,48419,49029],[39,49029,50639],[40,50639,52324]]}}