{"name":"4:6","price":"Ẹ dán àwọn ọmọ òrukàn wò¹ títí wọn yóò fi dàgbà wọ ẹni tí ò lè ṣe ìgbéyàwó.² Tí ẹ bá sì ti rí òye lára wọn, kí ẹ dá dúkìá wọn padà fún wọn. Ẹ ò gbọdọ̀ jẹ dúkìá wọn ní ìjẹ àpà àti ìjẹkújẹ kí wọ́n tó dàgbà. Ẹni tí ó bá jẹ́ ọlọ́rọ̀, kí ó mójú kúrò (níbẹ̀). Ẹni tí ó bá jẹ́ aláìní, kí ó jẹ nínú rẹ̀ ní ọ̀nà tó dára. Nítorí náà, tí ẹ bá fẹ́ dá dúkìá wọn padà fún wọn, ẹ pe àwọn ẹlẹ́rìí sí wọn. Allāhu sì tó ní Olùṣírò.","arabic":"وَٱبۡتَلُواْ ٱلۡيَتَٰمَىٰ حَتَّىٰٓ إِذَا بَلَغُواْ ٱلنِّكَاحَ فَإِنۡ ءَانَسۡتُم مِّنۡهُمۡ رُشۡدٗا فَٱدۡفَعُوٓاْ إِلَيۡهِمۡ أَمۡوَٰلَهُمۡۖ وَلَا تَأۡكُلُوهَآ إِسۡرَافٗا وَبِدَارًا أَن يَكۡبَرُواْۚ وَمَن كَانَ غَنِيّٗا فَلۡيَسۡتَعۡفِفۡۖ وَمَن كَانَ فَقِيرٗا فَلۡيَأۡكُلۡ بِٱلۡمَعۡرُوفِۚ فَإِذَا دَفَعۡتُمۡ إِلَيۡهِمۡ أَمۡوَٰلَهُمۡ فَأَشۡهِدُواْ عَلَيۡهِمۡۚ وَكَفَىٰ بِٱللَّهِ حَسِيبٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":499,"juzNumber":4,"footnotes":"1. Ìyẹn ni pé, ẹ kọ́kọ́ fi díẹ̀ tó kéré gan-an lé e lọ́wọ́ nínú ogún rẹ̀ tó jẹ́ ohun àmúṣọrọ̀, kí ẹ wo bí ó ṣe máa ṣe àmójútó rẹ̀.\n 2. “eni tí ó lè ṣe ìgbéyàwó” ni ẹni tí ó ti di ọmọkùnrin tàbí ẹni tí ó ti di ọmọbìnrin. Irú ọmọ náà ni a óò sọ nípa rẹ̀ pé, “ó ti bàlágà”. Ẹni tí ó = = ti bàlágà ni ẹni tí ó lè ṣe ìgbéyàwó. Ẹni tí ó ti bàlágà sì ni ẹni tí ó ti kúrò nípò ọmọdé. Ẹni tí ó ti bàlágà sì ni ẹni tí wọ́n ti la àwọn iṣẹ́ ẹ̀sìn bọ̀ lọ́rùn “mukallaf”. Nípa bẹ́ẹ̀, bí ó bá ṣe iṣẹ́ rere, ó máa gba ẹ̀san rẹ̀. Bí ó bá sì ṣe iṣẹ́ aburú, ó máa gba ẹ̀san rẹ̀. Kí wá ni àwọn àmì tí ẹ̀sìn ’Islām gbékalẹ̀ fún bíbàlágà ọmọdé? Òhun ni ìwọ̀nyí: (1) Dída àtọ̀ mọniyyu sára yálà láti ojú-oorun tàbí láti ojú-ayé nípasẹ̀ oorun ìfẹ́ tàbí ní ọ̀nà mìíràn, (2) tàbí híhu irun abẹ́, (3) tàbí kí ọjọ́ orí ẹni wọ ọdún mẹ́ẹ̀ẹ́dógún pẹ̀lú òǹkà oṣù ’Islām, (4) tàbí kí obìnrin bẹ̀rẹ̀ n̄ǹkan oṣù rẹ̀ (héélà), (5) tàbí kí obìnrin ní oyún. Èyíkéyìí tí ó bá kọ́kọ́ ṣẹlẹ̀ nínú àwọn n̄ǹkan márààrún wọ̀nyí ti sọ ọmọdé di àgbà (ẹni tí ó bàlágà).","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"wa-ib'talū al-yatāmā ḥattā idhā balaghū al-nikāḥa fa-in ānastum min'hum rush'dan fa-id'faʿū ilayhim amwālahum walā takulūhā is'rāfan wabidāran an yakbarū waman kāna ghaniyyan falyastaʿfif waman kāna faqīran falyakul bil-maʿrūfi fa-idhā dafaʿtum ilayhim amwālahum fa-ashhidū ʿalayhim wakafā bil-lahi ḥasīban ","translations":["And test","the orphans","until","[when]","they reach[ed]","(the age of) marriage","then if","you perceive","in them","sound judgement","then deliver","to them","their wealth","And (do) not","eat it","extravagantly","and hastily","(fearing) that","they will grow up","And whoever","is","rich","then he should refrain","and whoever","is","poor","then let him eat (of it)","in a fair manner","Then when","you deliver","to them","their wealth","then take witnesses","on them","And is sufficient","Allah","(as) a Reckoner","(6)"],"transliterationArr":["wa-ib'talū","al-yatāmā","ḥattā","idhā","balaghū","al-nikāḥa","fa-in","ānastum","min'hum","rush'dan","fa-id'faʿū","ilayhim","amwālahum","walā","takulūhā","is'rāfan","wabidāran","an","yakbarū","waman","kāna","ghaniyyan","falyastaʿfif","waman","kāna","faqīran","falyakul","bil-maʿrūfi","fa-idhā","dafaʿtum","ilayhim","amwālahum","fa-ashhidū","ʿalayhim","wakafā","bil-lahi","ḥasīban",null],"verseTiming":[[1,0,890],[2,890,2190],[3,2190,4390],[4,4390,4990],[5,4990,5700],[6,5700,7080],[7,7080,7690],[8,7690,8850],[9,8850,10280],[10,10280,11600],[11,11600,12830],[12,12830,15530],[13,15530,16550],[14,16550,18480],[15,18480,19050],[16,19050,22150],[17,22150,24000],[18,24000,25230],[19,25230,25490],[20,25490,26550],[21,26550,28120],[22,28120,29470],[23,29470,30110],[24,30110,31630],[25,31630,33430],[26,33430,34570],[27,34570,35180],[28,35180,36920],[29,36920,38250],[30,38250,39180],[31,39180,41960],[32,41960,43120],[33,43120,44110],[34,44110,45630],[35,45630,46880],[36,46880,47970],[37,47970,49250],[38,49250,50300],[39,50300,51805]]}}