{"name":"4:71","price":"Ẹ̀yin tí ẹ gbàgbọ́ ní òdodo, ẹ mú ohun ìṣọ́ra yín lọ́wọ́, kí ẹ sì tú jáde s’ójú ogun ẹ̀sìn níkọ̀níkọ̀ tàbí kí ẹ tú jáde ní àpapọ̀.¹","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ خُذُواْ حِذۡرَكُمۡ فَٱنفِرُواْ ثُبَاتٍ أَوِ ٱنفِرُواْ جَمِيعٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":564,"juzNumber":5,"footnotes":"1. Àkànlò èdè ni mímú ìṣọ́ra lọ́wọ́. N̄ǹkan ìjagun bí ọfà àti idà ló ṣe é mú lọ́wọ́. Bí ó tilẹ̀ jẹ́ pé àtẹ ìgbọfà wà nínú ìṣọ́ra tí ó ṣe é mú lọ́wọ́, wíwà tífura-tìfura lójú ogun ẹ̀sìn ní wíwà-ojú-lalákàn-fi-í- ṣọ́rí ni àgbọ́yé āyah náà. Má ṣe gba ìtànjẹ nípa títúmọ̀ ìṣọ́ra sí lílo òògùn bíi àgbéró, òkígbẹ́, ìṣíjú, ayẹta, àfẹ́ẹ̀rí, asákì àti bẹ́ẹ̀ bẹ́ẹ̀ lọ. Èèwọ̀ ni gbogbo ìwọ̀nyẹn nítorí pé, wọn kò là níbi idán pípa àti bíbẹ àwọn ẹ̀mí àìrí èṣù àlùjànnú kan níṣẹ́. Nítorí náà, ẹnì kan kò níí fi òògùn abẹnugọ̀ǹgọ̀ ja’gun ẹ̀sìn àfi kí ó jẹ́ ẹlẹ́bọ.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"yāayyuhā alladhīna āmanū khudhū ḥidh'rakum fa-infirū thubātin awi infirū jamīʿan ","translations":["O you","who","believe[d]","Take","your precautions","and advance","(in) groups","or","advance","all together","(71)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","khudhū","ḥidh'rakum","fa-infirū","thubātin","awi","infirū","jamīʿan",null],"verseTiming":[[1,0,2990],[2,2990,4100],[3,4100,5050],[4,5050,5730],[5,5730,6750],[6,6750,8290],[7,8290,9370],[8,9370,9840],[9,9840,11040],[10,11040,12595]]}}