{"name":"52:48","price":"Ṣe sùúrù fún ìdájọ́ Olúwa Rẹ, dájúdájú ìwọ wà ní ojútó Wa. Kí ó sì ṣe àfọ̀mọ́ pẹ̀lú ẹyìn fún Olúwa rẹ nígbà tí o bá fẹ́ dìde.¹","arabic":"وَٱصۡبِرۡ لِحُكۡمِ رَبِّكَ فَإِنَّكَ بِأَعۡيُنِنَاۖ وَسَبِّحۡ بِحَمۡدِ رَبِّكَ حِينَ تَقُومُ","category":["52 (At-Tur)","At-Tur","Surah At-Tur","Chapter At-Tur","Tur","Surah Tur","Chapter Tur","At Tur","Surah At Tur","Chapter At Tur","Surah 52","Chapter 52","The Mount","الطور"],"ayahNumber":4783,"juzNumber":27,"footnotes":"1. Nínú Sunan Abī Dāwud, láti ọ̀dọ̀ bàbá Barzah ’Azlamiy - kí Allāhu yọ́nú sí i -, ó sọ pé, Òjíṣẹ́ Allāhu - kí ìkẹ́ àti ọlà Allāhu máa bá a - máa ń sọ ní ìparí nígbà tí ó bá fẹ́ dìde kúrò lórí ìjókòó, \n « سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ أَنْتَ أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ ».\n “Subhānaka-llahummọ wabihamdika ’aṣhadu ’anlā ’ilāha ’illā ’anta ’astagfiruka wa ’atūbu ’ilaek” (Mímọ́ ni fún Allāhu, ẹyìn sì ni fún Ọ. Mò ń jẹ́rìí pé kò sí ọlọ́hun kan tí a gbọ́dọ̀ jọ́sìn fún ní ọ̀nà òdodo àyàfi Ìwọ. Mò ń tọrọ àforíjìn lọ́dọ̀ Rẹ, mo sì ń ronú pìwàdà sọ́dọ̀ Rẹ.) Ọkùnrin kan sọ pé, “Òjíṣẹ́ Allāhu, dájúdájú o sọ ọ̀rọ̀ kan tí o kì í sọ tẹ́tẹ̀tẹ́lẹ̀?” Ó sọ pé, “Pípa-ẹ̀ṣẹ̀-rẹ́ ni fún n̄ǹkan tí ó bá ṣẹlẹ̀ ní ìjókòó.” Albāniy sọ pé, “Ó dára, ó fẹsẹ̀ rinlẹ̀.”","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"wa-iṣ'bir liḥuk'mi rabbika fa-innaka bi-aʿyuninā wasabbiḥ biḥamdi rabbika ḥīna taqūmu ","translations":["So be patient","for (the) Command","(of) your Lord","for indeed, you","(are) in Our Eyes","And glorify","(the) praise","(of) your Lord","when","you arise","(48)"],"transliterationArr":["wa-iṣ'bir","liḥuk'mi","rabbika","fa-innaka","bi-aʿyuninā","wasabbiḥ","biḥamdi","rabbika","ḥīna","taqūmu",null],"verseTiming":[[1,0,960],[2,960,1800],[3,1800,2730],[4,2730,4840],[5,4840,6490],[6,6490,8070],[7,8070,8960],[8,8960,9950],[9,9950,10640],[10,10640,13895]]}}