{"name":"53:13","price":"Àti pé dájúdájú ó tún rí i nígbà kejì¹","arabic":"وَلَقَدۡ رَءَاهُ نَزۡلَةً أُخۡرَىٰ","category":["53 (An-Najm)","An-Najm","Surah An-Najm","Chapter An-Najm","Najm","Surah Najm","Chapter Najm","An Najm","Surah An Najm","Chapter An Najm","Surah 53","Chapter 53","The Star","النجم"],"ayahNumber":4797,"juzNumber":27,"footnotes":"1. Gbólóhùn “rọ’āhu” jẹyọ nínú āyah yìí. Ó tún jẹyọ bẹ́ẹ̀ nínú sūrah at-Takwīr; 81:23. Ìtúmọ̀ rẹ̀ sì ni pé, “Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - rí i.” Ta ni ó rí? Ṣé Allāhu ni tàbí mọlāika Jibrīl? Àní sẹ́, ta ni ọ̀rọ̀ arọ́pò-orúkọ ẹnì kẹta yìí “hu” tó jẹyọ nínú gbólóhùn yìí ń tọ́ka sí? Kí á má gbàgbé pé āyah yẹn ń sọ̀rọ̀ nípa ìrìn-àjò òru àti ìgun sánmọ̀ tí Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - ṣe ni. \n Èsì: Àwọn igun kan nínú àwọn àáfà sọ pé, mọlāika Jibrīl ni Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - rí. Igun kejì sì sọ pé, Allāhu - tó ga jùlọ - ni ó rí, bí ó tilẹ̀ jẹ́ pé igun yìí fi kún un pé ọkàn l’ó fi rí Allāhu, kì í ṣe ojú. Ṣebí bí ẹ̀dá ṣe ní ojú ìta, ni ó ní ojú inú. Àmọ́ èyí tí ó gbéwọ̀n jùlọ lọ́dọ̀ ọ̀pọ̀lọ́pọ̀ àwọn onímọ̀ ẹ̀sìn ’Islām ni pé, orúkọ mọlāika Jibrīl - kí ọlà Allāhu máa bá a - ni “hu” yẹn ń rọ́pò. \n Ìdí tí èyí fi rí bẹ́ẹ̀ ni hadīth tí ìyá wa ‘Ā’iṣah - kí Allāhu yọ́nú sí i - gbàwá lórí ọ̀rọ̀ náà pé, “Èmi ni àkọ́kọ́ nínú ìjọ yìí tí ó béèrè nípa ìyẹn lọ́dọ̀ Òjíṣẹ́ Allāhu - kí ìkẹ́ àti ọlà Allāhu máa bá a -. Ó sì sọ pé. “Jibrīl ni mo rí.” (Muslim). \n Bákan náà, nínú ẹ̀gbàwá Abū Tharr - kí Allāhu yọ́nú sí i -, ó sọ pé, mo bi Òjíṣẹ́ Allāhu ní ìbéèrè pé, “Ṣé o fojú rí Olúwa rẹ bí?” Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - sì sọ pé: “Ìmọ́lẹ̀ kan (dí mi lọ́wọ́), báwo ni mo ṣe máa rí I nígbà náà!” (Muslim) \n Irú èyí náà l’ó ṣẹlẹ̀ sí Ànábì Mūsā - kí ọlà Allāhu máa bá a - gẹ́gẹ́ bí ó ṣe wà nínú sūrah al-’A‘rọ̄f; 7:143. \n Tọ́ọ̀, ó ṣeé ṣe kí á rí ọ̀rọ̀ mìíràn kan láti ọ̀dọ̀ àwọn Sọhābah - kí Allāhu yọ́nú sí wọn -, bíi ọ̀rọ̀ tí ó tọ̀dọ̀ Ọmọ ‘Abbās - kí Allāhu yọ́nú sí i - wá pé, “Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - fi ọkàn rẹ̀ rí Allāhu ni.” Ìyẹn ni pé, ó fojú inú rí I, kì í ṣe ojú ìta. \n Kíyè sí i, kò sí ọ̀rọ̀ kan tí ó lágbára tó èyí tí ó tọ̀dọ̀ Ànábì fúnra rẹ̀ wá tààrà lórí ọ̀rọ̀ náà. Ẹ̀gbàwá ‘Ā’iṣah àti ẹ̀gbàwá Abū Tharr sì ni ẹ̀gbàwá tó ti ọ̀dọ̀ Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - wá lórí ọ̀rọ̀ náà. Má ṣe fọkàn sí ibò míìràn. Àti pé, sūrah al-’Ani‘ām; 6:103 àti sūrah aṣ-Ṣūrā; 42:51 ti fi rinlẹ̀ pé, ojú kan kò lè fojú rinjú pẹ̀lú Allāhu, yálà fún gbígba iṣẹ́ òjíṣẹ́ láti ọ̀dọ̀ Allāhu tàbí fún n̄ǹkan mìíràn. \n Àmọ́ sá, rírí Allāhu sójú máa wáyé fún àwọn onígbàgbọ́ òdodo nìkan lọ́jọ́ Àjíǹde. Èyí sì wà ní ìbámu sí sūrah al-Ƙiyāmọh; 75:22 - 23.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"walaqad raāhu nazlatan ukh'rā ","translations":["And certainly","he saw him","(in) descent","another","(13)"],"transliterationArr":["walaqad","raāhu","nazlatan","ukh'rā",null],"verseTiming":[[1,0,850],[2,850,1810],[3,1810,2950],[4,2950,4395]]}}