{"name":"54:9","price":"Ìjọ (Ànábì) Nūh pe òdodo ní irọ́ ṣíwájú wọn. Nígbà náà, wọ́n pe ẹrúsìn Wa ní òpùrọ́. Wọ́n sì wí pé: “Wèrè ni.” Wọ́n sì kọ̀ fún un pẹ̀lú ohùn líle.¹","arabic":"۞ كَذَّبَتۡ قَبۡلَهُمۡ قَوۡمُ نُوحٖ فَكَذَّبُواْ عَبۡدَنَا وَقَالُواْ مَجۡنُونٞ وَٱزۡدُجِرَ","category":["54 (Al-Qamar)","Al-Qamar","Surah Al-Qamar","Chapter Al-Qamar","Qamar","Surah Qamar","Chapter Qamar","Al Qamar","Surah Al Qamar","Chapter Al Qamar","Surah 54","Chapter 54","The Moon","القَمَر"],"ayahNumber":4855,"juzNumber":27,"footnotes":"1. Àwọn nasọ̄rọ̄ sọ pé, “Gbólóhùn ìparí āyah yìí ń sọ pé, ‘ìjọ Nūh lé Nūh jáde kúrò nínú ìlú’. Àmọ́ sūrah Hūd; 11:38 ń sọ pé, ‘Nígbàkígbà tí àwọn ọ̀tọ̀kùlú nínú ìjọ rẹ̀ bá kọjá lọ́dọ̀ rẹ̀, wọ́n yó sì máa fi ṣe yẹ̀yẹ́.” Wọ́n ní, “Kò gbọ́dọ̀ jẹ́ Nūh tí wọ́n ti lé jáde kúrò nínú ìlú ni ẹni tí wọ́n fi ń ṣe yẹ̀yẹ́!”\n Èsì: Kò sí ìtakora kan nínú rẹ̀. Al-Ƙur’ān kò fi rinlẹ̀ níbì kan kan pé, ìjọ Nūh lé Ànábì Nūh - kí ọlà Allāhu máa bá a - jáde kúrò nínú ìlú. Ìpìlẹ̀ “wa-zdujir” ni “zajara” láti ara “zajr” – kíkọ n̄ǹkan àti híhánnà n̄ǹkan pẹ̀lú ohùn líle. Ìyẹn ni pé, wọ́n fi ohùn líle kọ òdodo sílẹ̀ fún Ànábì Nūh - kí ọlà Allāhu máa bá a - ní kíkọ̀ àlésá-sẹ́yìn fún wọn nípasẹ̀ sísọ ọ̀rọ̀ burúkú sí i, híhalẹ̀ mọ̀ ọn, dídúnkokò mọ́ ọn nítorí kí ó lè máa wò wọ́n níran. Ìtúmọ̀ “wa-zdujir” yìí ni Allāhu ṣàpèjúwe rẹ̀ nínú sūrah aṣ-Ṣu‘arā’; 26:116 pé wọ́n ń fi lílẹ̀ lókò halẹ̀ mọ́ ọn. Ìtúmọ̀ kíkọ̀ náà ni ìtúmọ̀ tó jẹyọ nínú “muzdajar” tó parí āyah 4 ṣíwájú. Ìtúmọ̀ àkànlò fún “zajr” sì jẹyọ nínú sūrah as-Sọ̄ffāt; 37:2. \n Kókó ọ̀rọ̀ ni pé, ìjọ Nūh fi ohùn líle kọ ọ̀rọ̀ sí Ànábì Nūh - kí ọlà Allāhu máa bá a - lẹ́nu ni, kì í ṣe pé wọ́n lé e jáde kúrò nínú ìlú. Wọ́n kọ ìtẹ̀lé Ànábì Nūh - kí ọlà Allāhu máa bá a - sílẹ̀ pẹ̀lú sísọ ọ̀rọ̀ burúkú sí i. Àmọ́ Ànábì Nūh - kí ọlà Allāhu máa bá a - wà nínú ìlú pẹ̀lú wọn títí ó fi kan ọkọ̀ ojú omi. W-Allāhu ’a‘lam.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"kadhabat qablahum qawmu nūḥin fakadhabū ʿabdanā waqālū majnūnun wa-uz'dujira ","translations":["Denied","before them","(the) people","(of) Nuh","and they denied","Our slave","and said","A madman","and he was repelled","(9)"],"transliterationArr":["kadhabat","qablahum","qawmu","nūḥin","fakadhabū","ʿabdanā","waqālū","majnūnun","wa-uz'dujira",null],"verseTiming":[[1,0,1030],[2,1030,2130],[3,2130,2730],[4,2730,3860],[5,3860,5580],[6,5580,6690],[7,6690,7790],[8,7790,9940],[9,9940,11295]]}}