{"name":"5:110","price":"(Rántí) nígbà tí Allāhu sọ pé: “‘Īsā ọmọ Mọryam, rántí ìdẹ̀ra Mi lórí rẹ àti lórí ìyá rẹ, nígbà tí Mo fi ẹ̀mí Mímọ́ (mọlāika Jibrīl) ràn ọ́ lọ́wọ́, tí o sì ń bá àwọn ènìyàn sọ̀rọ̀ lórí ìtẹ́ ní òpóǹló àti nígbà tí o dàgbà. (Rántí) nígbà tí Mo fún ọ ní ìmọ̀ Tírà, òye ìjìnlẹ̀, at-Taorāh àti al-’Injīl. (Rántí) nígbà tí ò ń mọ n̄ǹkan láti inú amọ̀ bí ìrísí ẹyẹ, tí ò ń fẹ́ atẹ́gùn sínú rẹ̀, tí ó ń di ẹyẹ pẹ̀lú ìyọ̀ǹda Mi. Ò ń wo afọ́jú àti adẹ́tẹ̀ sàn pẹ̀lú ìyọ̀ǹda Mi. (Rántí) nígbà tí ò ń mú àwọn òkú jáde (ní alààyè láti inú sàréè) pẹ̀lú ìyọ̀ǹda Mi. (Rántí) nígbà tí Mo dí àwọn ọmọ ’Isrọ̄’īl lọ́wọ́ fún ọ,¹ nígbà tí o mú àwọn ẹ̀rí tó yanjú wá bá wọn. Àwọn tó ṣàì gbàgbọ́ nínú wọn sì wí pé: “Kí ni èyí bí kò ṣe idán pọ́nńbélé.”²","arabic":"إِذۡ قَالَ ٱللَّهُ يَٰعِيسَى ٱبۡنَ مَرۡيَمَ ٱذۡكُرۡ نِعۡمَتِي عَلَيۡكَ وَعَلَىٰ وَٰلِدَتِكَ إِذۡ أَيَّدتُّكَ بِرُوحِ ٱلۡقُدُسِ تُكَلِّمُ ٱلنَّاسَ فِي ٱلۡمَهۡدِ وَكَهۡلٗاۖ وَإِذۡ عَلَّمۡتُكَ ٱلۡكِتَٰبَ وَٱلۡحِكۡمَةَ وَٱلتَّوۡرَىٰةَ وَٱلۡإِنجِيلَۖ وَإِذۡ تَخۡلُقُ مِنَ ٱلطِّينِ كَهَيۡـَٔةِ ٱلطَّيۡرِ بِإِذۡنِي فَتَنفُخُ فِيهَا فَتَكُونُ طَيۡرَۢا بِإِذۡنِيۖ وَتُبۡرِئُ ٱلۡأَكۡمَهَ وَٱلۡأَبۡرَصَ بِإِذۡنِيۖ وَإِذۡ تُخۡرِجُ ٱلۡمَوۡتَىٰ بِإِذۡنِيۖ وَإِذۡ كَفَفۡتُ بَنِيٓ إِسۡرَٰٓءِيلَ عَنكَ إِذۡ جِئۡتَهُم بِٱلۡبَيِّنَٰتِ فَقَالَ ٱلَّذِينَ كَفَرُواْ مِنۡهُمۡ إِنۡ هَٰذَآ إِلَّا سِحۡرٞ مُّبِينٞ","category":["5 (Al-Ma'idah)","Al-Ma'idah","Surah Al-Ma'idah","Chapter Al-Ma'idah","Ma'idah","Surah Ma'idah","Chapter Ma'idah","Al Ma'idah","Surah Al Ma'idah","Chapter Al Ma'idah","Surah 5","Chapter 5","The Table Spread","المَائدة"],"ayahNumber":779,"juzNumber":7,"footnotes":"1. Allāhu Alágbára dí àwọn ọmọ Isrọ̄’īl lọ́wọ́ lórí pípa tí wọ́n fẹ́ pa Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a -. Allāhu kò jẹ́ kí wọ́n rí i kàn mọ́ igi àgbélébùú, kò sì jẹ́ kí wọ́n rí i pa. Èyí wà ní ìbámu sí sūrah an-Nisā’; 4:157.\n 2. Nínú āyah alápọ̀n-ọ́nlé yìí, Allāhu - subhānahu wa ta‘ālā - sọ nípa àwọn iṣẹ́ ìyanu kan tí Ó fún Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - ṣe ní àsìkò tó fi jíṣẹ́ fún àwọn ọmọ ’Isrọ̄’īl. Àwọn iṣẹ́ ìyanu náà nìwọ̀nyí; \n Ìkíní: Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - sọ̀rọ̀ lórí ìtẹ́ ní òpóǹló. \n Ìkejì: Ó fi amọ̀ mọ ẹyẹ, ó sì fẹ́ atẹ́gùn sínú rẹ̀, ẹyẹ náà sì fò lọ. \n Ìkẹta: Ó wo afọ́jú àti adẹ́tẹ̀ sàn. \n Ìkẹrin: Ó mú àwọn òkú jáde ní alààyè láti inú sàréè, ìyẹn ni pé, ó jí òkú dìde. \n Iṣẹ́ ìyanu wọ̀nyẹn jẹyọ bẹ́ẹ̀ nínú āyah 110 nínú sūrah yìí, sūrah al-Mọ̄’idah. \n Ìkarùn-ún: Ó sọ ọpọ́n oúnjẹ ńlá kalẹ̀ láti ojú sánmọ̀, wọ́n sì jẹ oúnjẹ àtọ̀runwá nílé ayé. Ìyẹn wà nínú āyah 114, nínú sūrah yìí bákan náà. Iṣẹ́ ìyanu yìí gan-an ni Allāhu - subhānahu wa ta'ālā - fi sọ sūrah yìí “al-Mọ̄’idah” lórúkọ. \n Ìkẹfà: Ó máa ń sọ àṣírí ohun tí àwọn ènìyàn rẹ̀ jẹ nínú oúnjẹ àti èyí tí wọ́n gbépamọ́ sínú ilé wọn. Ìyẹn wà nínú sūrah āli ‘Imrọ̄n; 3:40. Èyí ni àwọn nasọ̄rọ̄ tún tìràn mọ́ gẹ́gẹ́ bi ìṣe wọn. Wọ́n sì ń wí pé “Nítorí tí ‘Īsā ọmọ Mọryam la’jú afọ́jú, tí ó wo adẹ́tẹ̀ sàn, tí ó fún ẹyẹ amọ̀ àti okú ènìyàn ní ẹ̀mí, nítorí náà, ìyè wà nínú ‘Īsā ọmọ Mọryam, òun sì ni olúwa àti olùgbàlà nítorí pé, kò tún sí ẹlòmíìràn tó ṣe irú rẹ̀ rí, kódà Muhammad.” \n Èsì: Ní àkọ́kọ́ náà, al-Ƙur’ān kò sọ pé ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - fi agbára ara rẹ̀ ṣe iṣẹ́ ìyanu, bí kò ṣe pẹ̀lú agbára àti ìyọ̀ǹda Ọlọ́hun Ẹlẹ́dàá. Èyí sì ní awẹ́ gbólóhùn “bi’ithnī” tó ń jẹyọ nínú āyah náà. Àti pé awẹ́ gbólóhùn “bi’ithnī” yìí ni Allāhu - subhānahu wa ta'ālā - mú wá ní ẹ̀kúnrẹ́rẹ́ nínú sūrah ar-Ra‘d; 13:38, sūrah Gọ̄fir; 40:78 àti sūrah al ‘Ani‘ām; 6:34-35. \n Nígbà tí ọ̀rọ̀ rí báyìí, ti ta ni ògo àwọn iṣẹ́ ìyanu tí ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - ṣe, ṣé tirẹ̀ ni tàbí t’Ọlọ́hun? Ọlọ́hun Ẹlẹ́dàá l’Ó ni ògo náà, kì í ṣe ti ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a -, rárá. Báwo wá ni ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - ṣe lè di olúwa nítorí iṣẹ́ tí Allāhu Ẹlẹ́dàá Rẹ̀ fún un ṣe! \n Bákan náà, àwọn onígbàgbọ́ òdodo tó jẹ́ ọmọlẹ́yìn àwọn Ànábì (aleehim salām) kì í retí iṣẹ́ ìyanu, wọ́n kì í sì bèèrè fún un ṣíwájú kí wọ́n tó mọ Ọlọ́hun Òdodo ní Ọlọ́hun tí a gbọ́dọ̀ máa jọ́sìn fún ní ọ̀nà òdodo. Ẹsẹ ọ̀rọ̀ Ọlọ́hun ti tò wọn lórí ìgbàgbọ́ òdodo wọn àti ìjọ́sìn wọn. Àmọ́ nítorí àwọn aláìgbàgbọ́, àwọn agbọ́mágbà, àwọn ọlọ́kàn-gíga tí wọ́n máa ń gbógun líle ti àwọn Òjíṣẹ́ Ọlọ́hun ní àsìkò olúkùlùkù wọn ni Allāhu - subhānahu wa ta‘ālā - ṣe máa ń fún àwọn Òjíṣẹ́ Rẹ̀ ní àǹfààní iṣẹ́ ìyanu ṣe. \n Bí ó tilẹ̀ já sí pé kò sí ẹ̀dá tí ìṣẹ̀dá rẹ̀ kì í ṣe iṣẹ́ ìyanu Allāhu, àìláròjinlẹ̀ ènìyàn l’ó tún fi ń wá iṣẹ́ ìyanu mìíràn kiri kí ó tó lè mọ Allāhu ní Ọlọ́hun Ẹlẹ́dàá tí a gbọ́dọ̀ jọ́sìn fún ní ọ̀nà òdodo. Ìdí nìyí tí al-Ƙur’ān alápọ̀n-ọ́nlé fi ń darí wa síbi wíwo àwọn iṣẹ́ ìyanu t’ara wa gan-an, gẹ́gẹ́ bí ó ṣe wà nínú sūrah ath-Thāriyāt; 51:21. “Nínú ara yín gan-an (àmì ìyanu wà nínú rẹ̀). Ṣé ẹ kò ríran ni?” \n Lẹ́yìn náà, kò fẹ́ẹ̀ sí Ànábì kan tàbí Òjíṣẹ́ kan tí Allāhu rán níṣẹ́, tí Allāhu kò fún ní iṣẹ́ ìyanu kan tàbí òmíràn ṣe, bí ó tilẹ̀ jẹ́ pé irú iṣẹ́ ìyanu bẹ́ẹ̀ máa jẹmọ́ àsìkò àti irú àwọn tí Allāhu - subhānahu wa ta'ālā - rán Òjíṣẹ́ náà níṣẹ́ sí. Ẹ jẹ́ kí a wòye sí àwọn iṣẹ́ ìyanu wọ̀nyí gẹ́gẹ́ bí àpẹ̀ẹrẹ: Al-Ƙur’ān alápọ̀n-ọ́nlé, nínú sūrah Hūd; 11:37 - 48 àti sūrah al-Mu’minūn; 23: 27 - 30, ó fi iṣẹ́ ìyanu kíkan ọkọ̀ ojú-omi rinlẹ̀ fún Òjíṣẹ́ àkọ́kọ́, Ànábì Nūh - kí ọlà Allāhu máa bá a -. Ní àsìkò tí Allāhu - subhānahu wa ta'ālā - kọ́kọ́ pa ilé ayé rẹ́ pẹ̀lú omi ìyanu. Ṣebí ọkọ̀ ojú-omi tí Ànábì Nūh - kí ọlà Allāhu máa bá a - kàn nígbà náà ni Allāhu fi ṣe ìgbàlà fún àwọn onígbàgbọ́ òdodo lásìkò náà. Ànábì Nūh - kí ọlà Allāhu máa bá a - ni ìbá kúkú lẹ́tọ̀ọ́ sí oríkì olùgbàlà aráyé nípasẹ̀ ọ̀kọ̀ ìgbàlà rẹ̀. Àmọ́ a ò lè pè é ní olùgbàlà nítorí pé, pẹ̀lú ìyọ̀ǹda, àṣẹ, ògo àti agbára Allāhu l’ó lò fún kíkan ọkọ̀ ojú-omi ńlá náà àti wíwa ọkọ̀ náà gúnlẹ̀ sí èbúté ayọ̀, láì kọ́ ẹ̀kọ́ kíkan ọkọ̀ ojú-omi àti wíwa ọkọ̀ ojú-omi tẹ́lẹ̀, - Allāhu ’akbar - .\n Bákan náà, al-Ƙur’ān alápọ̀n-ọ́nlé fi iṣẹ́ ìyanu méjì rinlẹ̀ fún ẹni tí àwọn nasọ̄rọ̄ mọ̀ sí “Àpẹ̀ẹrẹ Ìgbàgbọ́”, Ọ̀rẹ́ Àyò Ọlọ́hun “kọlīlu-llāh” baba-ńlá àwọn Òjíṣẹ́ Ànábì ’Ibrọ̄hīm - kí ọlà Allāhu máa bá a -. Ìkíní: Nínú sūrah al-’Anbiyā’; 21:68 - 69 la ti ka ìtàn nípa bí àwọn ọ̀ṣẹbọ ṣe ju Ànábì ’Ibrọ̄hīm - kí ọlà Allāhu máa bá a - sínú iná ńlá láti gbẹ̀mí rẹ̀. Àmọ́ iná náà di ohun tútù àlàáfíà fún Ànábì ’Ibrọ̄hīm - kí ọlà Allāhu máa bá a -. \n Ìkejì: Nínú sūrah al-Baƙọrah; 2:260 la ti ka ìṣẹ̀lẹ̀ kan nípa Ànábì ’Ibrọ̄hīm - kí ọlà Allāhu máa bá a - pé, ó pa oríṣi ẹyẹ mẹ́rin, ó gún wọn papọ̀ mọ́ra wọn, ó sọ wọ́n di lúbúlúbú. Lẹ́yìn náà, ó bù ú díẹ̀ díẹ̀, ó sì bò wọ́n mọ́’nú ilẹ̀ ní àyè ọ̀tọ̀ọ̀tọ̀. Lẹ́yìn náà, ó bẹ̀rẹ̀ sí pe ẹyẹ kọ̀ọ̀kan pẹ̀lú orúkọ rẹ̀, eegun àti ẹran ara ẹyẹ kọ̀ọ̀kan sì bẹ̀rẹ̀ sí parapọ̀ lójú rẹ̀. Àwọn òkú ẹyẹ mẹ́rẹ̀ẹ̀rin tí ó ti gún kúnná, tí ó sì ti bò mọ́lẹ̀ sì padà sípò aláàyè, - Allāhu ’akbar. - Ṣé ẹ rí i báyìí pé, Ànábì ’Ibrọ̄hīm náà - kí ọlà Allāhu máa bá a - ṣe iṣẹ́ ìyanu. Òun náà jí òkú ẹyẹ dìde? \n Kódà Ànábì ’Ibrọ̄hīm kò wulẹ̀ mọ ọ̀bọrọgidi kan kan gẹ́gẹ́ bí ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - tí ó fi amọ̀ mọ ẹyẹ ti ṣe. Àní sẹ́, Ànábì ’Ibrọ̄hīm - kí ọlà Allāhu máa bá a - kò kúkú ṣẹ̀ṣẹ̀ fátẹ́gùn kan kan sínú àwọn ẹyẹ náà kí wọ́n tó di aláàyè padà. Ànábì ’Ibrọ̄hīm - kí ọlà Allāhu máa bá a - kàn pè wọ́n ní ìkọ̀ọ̀kan, wọ́n sì jẹ́pè rẹ̀. Ti ta ni ògo àti agbára wọ̀nyí bí kò ṣe ti Allāhu - ọba Alààyè -. \n Lẹ́yìn náà, Ànábì Mūsā - kí ọlà Allāhu máa bá a -, al-Ƙur’ān alápọ̀n-ọ́nlé fi àwọn iṣẹ́ ìyanu kan ròyìn òun náà. Ànábì Mūsā - kí ọlà Allāhu máa bá a - ń lo ọ̀pá rẹ̀ láti fi ṣe àwọn iṣẹ́ ìyanu gẹ́gẹ́ bí ọ̀pá náà ṣe di ejò, tí ejò náà sì kó gbogbo idán kàbìtì-kàbìtì tí àwọn òpìdán Fir‘aon pa kalẹ̀ jẹ kálókáló. \n Ànábì Mūsā - kí ọlà Allāhu máa bá a - tún fi ọ̀pá yìí pín agbami òkun sí méjì pẹ̀lú àwọn ojú-ọ̀nà gbòòrò láààrin rẹ̀ fún ìgbàlà àwọn ọmọ ’Isrọ̄’īl lọ́wọ́ ìyà Fir‘aon. Ó sì tún fi pa odò náà dé papọ̀ mọ́ra wọn fún ìparun Fir‘aon àti àwọn ọmọ ogun rẹ̀. \n Bákan náà, Ànábì Mūsā - kí ọlà Allāhu máa bá a - fi burè ẹran ara màálù “baƙọrah” jí òkú díde, gẹ́gẹ́ bí ó ṣe wà nínú sūrah al-Baƙọrah; 2:73. Iṣẹ́ ìyanu yìí gan-an ni Allāhu - subhānahu wa ta'ālā - fi sọ sūrah yìí ní “al-Baƙọrah” - “màálù”. – Sūrah yìí sì tún ni ọgbà ọ̀rọ̀ tó ní ẹsẹ ọ̀rọ̀ (āyah) tó pọ̀ jùlọ nínú al-Ƙur’ān alápọ̀n-ọ́nlé. Gbogbo ìwọ̀nyí kò sọ Ànábì Mūsā - kí ọlà Allāhu máa bá a - di olúwa àti olùgbàlà, tòhun ti bí ó tún ṣe gba àwọn ọmọ ’Isrọ̄’īl là kúrò lọ́wọ́ ìjọba amúnisìn Fir‘aon. \n Síwájú sí i, ní ti Ànábì wa Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a -, Allāhu fún òun náà ní àwọn iṣẹ́ ìyanu kan ṣe, àmọ́ èyí tó ga jùlọ nínú àwọn iṣẹ́ ìyanu náà ni ààbò mímọ́ tí Allāhu fi bo al-Ƙur’ān alápọ̀n-ọ́nlé. Èyí ń jẹ́ iṣẹ́ ìyanu tó ga jùlọ nítorí àwọn ìdí wọ̀nyí: \n Ìkíní ni pé, gbogbo àwọn iṣẹ́ ìyanu tí Allāhu - subhānahu wa ta‘ālā - fún àwọn Ànábì tó ṣíwájú l’ó ti lọ. Gbogbo àwọn iṣẹ́ ìyanu wọn sì ti di ìtàn gẹ́gẹ́ bí àwọn fúnra wọn ti ṣe di ẹni-ìtàn rere. Al-Ƙur’ān nìkan ni kò níí di ìtàn láéláé. \n Ìkejì: òǹkà díẹ̀ díẹ̀ ló kúkú gbà fún àwọn Ànábì oníṣẹ́-ìyanu wọ̀nyẹn. Ṣebí tòhun ti àwọn iṣẹ́ ìyanu ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - bíi ènìyàn méjìlá ni ọmọ-lẹ́yìn rẹ̀ lójú ayé rẹ̀. Ẹ wo ọmọ-lẹ́yìn púpọ̀ tí al-Ƙur’ān mú wá fún Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - lójú ayé rẹ̀. Iṣẹ́ ìyanu wo ni àwọn ènìyàn gbàgbọ́ nínú rẹ̀ tó tó báyìí? Kò sí. \n Tí mo bá tún wá mẹ́nulé àwọn iṣẹ́ ìyanu tí Allāhu - subhānahu wa ta'ālā - fún Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - ṣe, ó máa gba ojú-ewé púpọ̀. Àmọ́ èròǹgbà àwọn aláìmọ̀kan ni pé, nígbà tí wọn kò ti rí àwọn iṣẹ́ ìyanu Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - kà nínú al-Ƙur’ān, wọ́n ti lérò pé kò rí iṣẹ́ ìyanu kan kan ṣe, irú èyí tí wọ́n ń wá kiri bí ẹni tí ń wá ìwo ẹṣin kiri. Ẹ lọ ka àwọn tírà lórí rẹ̀. Òdidi tírà ni àwọn onímọ̀ ẹ̀sìn ṣe lórí àwọn iṣẹ́ ìyanu Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a -. \n Bákan náà, nínú sūrah Yūsuf; 12: 26 - 27 ni a ti ka ìtàn nípa ọmọ òpóǹló tí òun náà sọ̀rọ̀ lórí ìtẹ́ nígbà tí wọ́n fi ẹ̀sùn ìbàjẹ́ àti ìbani-lórúkọjẹ́ kan Ànábì Yūsuf - kí ọlà Allāhu máa bá a -. Allāhu - subhānahu wa ta‘ālā - sì ṣe àfọ̀mọ́ rẹ̀ níbi ẹ̀sùn náà pẹ̀lú ọ̀rọ̀ ẹnu ọmọ òpóǹló náà. \n Nítorí náà, kì í ṣe Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - nìkan ló sọ̀rọ̀ lórí ìtẹ́ ní òpóǹló. \n Wàyí, kókó ọ̀rọ̀ wa ni pé, iṣẹ́ ìyanu kan kò sọ Ànábì tàbí Òjíṣẹ́ Ọlọ́hun kan di olúwa àti olùgbàlà. Èyí sì ni òdodo ọ̀rọ̀ pọ́nńbélé tí Allāhu - subhānahu wa ta‘ālā - fi rinlẹ̀ nípa àwọn Ànábì Rẹ̀ àti àwọn Òjíṣẹ́ Rẹ̀ (aleehim sọlāt wa salām) fún àwọn tí kò bá fẹ́ tara wọn wọ inú Iná gbére l’ọ́jọ́ Àjíǹde. Ẹ kà á nínú sūrah āli ‘Imrọ̄n; 3:79 - 80.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"idh qāla al-lahu yāʿīsā ib'na maryama udh'kur niʿ'matī ʿalayka waʿalā wālidatika idh ayyadttuka birūḥi al-qudusi tukallimu al-nāsa fī al-mahdi wakahlan wa-idh ʿallamtuka al-kitāba wal-ḥik'mata wal-tawrāta wal-injīla wa-idh takhluqu mina al-ṭīni kahayati al-ṭayri bi-idh'nī fatanfukhu fīhā fatakūnu ṭayran bi-idh'nī watub'ri-u al-akmaha wal-abraṣa bi-idh'nī wa-idh tukh'riju al-mawtā bi-idh'nī wa-idh kafaftu banī is'rāīla ʿanka idh ji'tahum bil-bayināti faqāla alladhīna kafarū min'hum in hādhā illā siḥ'run mubīnun ","translations":["When","said","Allah","O Isa","son","(of) Maryam","Remember","My Favor","upon you","and upon","your mother","when","I strengthened you","with (the) Spirit","the Holy","you spoke","(to) the people","in","the cradle","and (in) maturity","And when","I taught you","the Book","and the wisdom","and the Taurat","and the Injeel","and when","you make","from","the clay","like the shape","(of) the bird","by My permission","then you breath","into it","and it becomes","a bird","by My permission","and you heal","the born blind","and the leper","by My permission","and when","you bring forth","the dead","by My permission","And when","I restrained","(the) Children","(of) Israel","from you","when","you came to them","with the clear proofs","then said","those who","disbelieved","among them","Not","(is) this","but","magic","clear","(110)"],"transliterationArr":["idh","qāla","al-lahu","yāʿīsā","ib'na","maryama","udh'kur","niʿ'matī","ʿalayka","waʿalā","wālidatika","idh","ayyadttuka","birūḥi","al-qudusi","tukallimu","al-nāsa","fī","al-mahdi","wakahlan","wa-idh","ʿallamtuka","al-kitāba","wal-ḥik'mata","wal-tawrāta","wal-injīla","wa-idh","takhluqu","mina","al-ṭīni","kahayati","al-ṭayri","bi-idh'nī","fatanfukhu","fīhā","fatakūnu","ṭayran","bi-idh'nī","watub'ri-u","al-akmaha","wal-abraṣa","bi-idh'nī","wa-idh","tukh'riju","al-mawtā","bi-idh'nī","wa-idh","kafaftu","banī","is'rāīla","ʿanka","idh","ji'tahum","bil-bayināti","faqāla","alladhīna","kafarū","min'hum","in","hādhā","illā","siḥ'run","mubīnun",null],"verseTiming":[[1,0,670],[2,670,1190],[3,1190,2140],[4,2140,3180],[5,3180,3670],[6,3670,4390],[7,4390,5100],[8,5100,6140],[9,6140,7040],[10,7040,7860],[11,7860,9120],[12,9120,9540],[13,9540,10770],[14,10770,11560],[15,11560,12450],[16,12450,13370],[17,13370,14570],[18,14570,15400],[19,15400,16260],[20,16260,17250],[21,17250,18570],[22,18570,18770],[23,18770,19640],[24,19640,20790],[25,20790,21840],[26,21840,23140],[27,23140,24240],[28,24240,25540],[29,25540,27040],[30,27040,29090],[31,29090,30850],[32,30850,31390],[33,31390,32260],[34,32260,32590],[35,32590,33560],[36,33560,34650],[37,34650,35480],[38,35480,36460],[39,36460,38020],[40,38020,38820],[41,38820,39910],[42,39910,41300],[43,41300,42870],[44,42870,43820],[45,43820,44980],[46,44980,46160],[47,46160,47130],[48,47130,47710],[49,47710,48540],[50,48540,49610],[51,49610,51220],[52,51220,51870],[53,51870,52770],[54,52770,54380],[55,54380,57250],[56,57250,58460],[57,58460,58840],[58,58840,60410],[59,60410,62050],[60,62050,62770],[61,62770,63960],[62,63960,64880],[63,64880,66170],[64,66170,67180],[65,67180,68040],[66,68040,68910],[67,68910,69270],[68,69270,71060],[69,71060,71850],[70,71850,72510],[71,72510,75445]]}}