{"name":"5:32","price":"Nítorí ìyẹn, A sì ṣe é ní òfin fún àwọn ọmọ ’Isrọ̄’īl pé, dájúdájú ẹnikẹ́ni tí ó bá pa ẹ̀mí (ènìyàn) kan láìjẹ́ nítorí pípa ẹ̀mí (ènìyàn) kan tàbí ṣíṣe ìbàjẹ́ kan lórí ilẹ̀¹, ó dà bí ẹni tí ó pa gbogbo ènìyàn pátápátá. Ẹnikẹ́ni tí ó bá sì mú ẹ̀mí (ènìyàn) ṣẹ̀mí, ó dà bí ẹni tí ó mú gbogbo ènìyàn ṣẹ̀mí pátápátá. Àwọn Òjíṣẹ́ Wa sì ti wá bá wọn pẹ̀lú àwọn ẹ̀rí tó yanjú. Lẹ́yìn náà, dájúdájú ọ̀pọ̀lọ́pọ̀ nínú wọn lẹ́yìn ìyẹn ni alákọyọ lórí ilẹ̀.","arabic":"مِنۡ أَجۡلِ ذَٰلِكَ كَتَبۡنَا عَلَىٰ بَنِيٓ إِسۡرَٰٓءِيلَ أَنَّهُۥ مَن قَتَلَ نَفۡسَۢا بِغَيۡرِ نَفۡسٍ أَوۡ فَسَادٖ فِي ٱلۡأَرۡضِ فَكَأَنَّمَا قَتَلَ ٱلنَّاسَ جَمِيعٗا وَمَنۡ أَحۡيَاهَا فَكَأَنَّمَآ أَحۡيَا ٱلنَّاسَ جَمِيعٗاۚ وَلَقَدۡ جَآءَتۡهُمۡ رُسُلُنَا بِٱلۡبَيِّنَٰتِ ثُمَّ إِنَّ كَثِيرٗا مِّنۡهُم بَعۡدَ ذَٰلِكَ فِي ٱلۡأَرۡضِ لَمُسۡرِفُونَ","category":["5 (Al-Ma'idah)","Al-Ma'idah","Surah Al-Ma'idah","Chapter Al-Ma'idah","Ma'idah","Surah Ma'idah","Chapter Ma'idah","Al Ma'idah","Surah Al Ma'idah","Chapter Al Ma'idah","Surah 5","Chapter 5","The Table Spread","المَائدة"],"ayahNumber":701,"juzNumber":6,"footnotes":"1. Ìbàjẹ́ ṣíṣe lórí ilẹ̀ pé oríṣiríṣi. Nítorí náà, àwọn ìbàjẹ́ kan wà tí ó jẹ́ pé pípa ọ̀daràn ni ìjìyà rẹ̀. Bẹ́ẹ̀ sì ni pé, àwọn ìbàjẹ́ kan wà tí ìjìyà wọn kò wọ ipò pípa ọ̀daràn. Nínú ìbàjẹ́ tí ìjìyà rẹ̀ wọ pípa ọ̀daràn ni ó jẹyọ nínú hadīth yìí: \n عَنْ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ -صلى الله عليه وسلم- « لاَ يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ يَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنِّى رَسُولُ اللَّهِ إِلاَّ بِإِحْدَى ثَلاَثٍ الثَّيِّبُ الزَّانِ وَالنَّفْسُ بِالنَّفْسِ وَالتَّارِكُ لِدِينِهِ الْمُفَارِقُ لِلْجَمَاعَةِ ». Láti ọ̀dọ̀ ‘Abdullāh - kí Allāhu yọ́nú sí i -, ó sọ pé, Òjíṣẹ́ Allāhu - kí ìkẹ́ àti ọlà Allāhu máa bá a - sọ pé, “Ẹ̀jẹ̀ ènìyàn tí ó jẹ́ mùsùlùmí kò lẹ́tọ̀ọ́ (kò lẹ́tọ̀ọ́ láti pa mùsùlùmí kan) tí ó ń jẹ́rìí pé “kò sí ọlọ́hun kan tí a gbọ́dọ̀ jọ́sìn fún ní ọ̀nà òdodo àyàfi Allāhu, àti pé dájúdájú Òjíṣẹ́ Allāhu ni mí” àfi nítorí ọ̀kan nínú àwọn n̄ǹkan mẹ́ta (wọ̀nyí): ẹni tí ó ti ṣe ìgbéyàwó rí tí ó lọ ṣe sìná (wọ́n máa lẹ̀ ẹ́ lókò pa), ẹ̀mí (olùpànìyàn) fún ẹ̀mí (ènìyàn tí ó pa) àti ẹni tí ó gbé ẹ̀sìn ’Islām rẹ̀ jù sílẹ̀, tí ó fi ìjọ mùsùlùmí sílẹ̀.” (Muslim àti Bukọ̄riy ló gbà á wá.) \n Kíyè sí i, ẹni tí ó gbé ẹ̀sìn ’Islām rẹ̀ jù sílẹ̀ fẹ́ gbógun ti gbogbo ìjọ mùsùlùmí, ó sì fẹ́ sọ ara di alákòóbá fún ìran rẹ̀ ni. Nítorí náà, ọ̀ràn rẹ̀ ti wọ ipò ẹni tí ó di ọ̀tẹ̀ mọ́ ìjọba ’Islām lórí ilẹ̀ ’Islām. Pípa ni ìjìyà rẹ̀ láyé. Iná gbére sì ni ìyà rẹ̀ ní ọ̀run.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"min ajli dhālika katabnā ʿalā banī is'rāīla annahu man qatala nafsan bighayri nafsin aw fasādin fī al-arḍi faka-annamā qatala al-nāsa jamīʿan waman aḥyāhā faka-annamā aḥyā al-nāsa jamīʿan walaqad jāathum rusulunā bil-bayināti thumma inna kathīran min'hum baʿda dhālika fī al-arḍi lamus'rifūna ","translations":["From","time","that","We ordained","on","(the) Children","(of) Israel","that he","who","kills","a soul","other than","(for) a soul","or","(for) spreading corruption","in","the earth","then (it) is as if","he has killed","mankind","all","and whoever","saves it","then (it) is as if","he has saved","mankind","all","And surely","came to them","Our Messengers","with clear Signs","yet","indeed","many","of them","after","that","in","the earth","(are) surely those who commit excesses","(32)"],"transliterationArr":["min","ajli","dhālika","katabnā","ʿalā","banī","is'rāīla","annahu","man","qatala","nafsan","bighayri","nafsin","aw","fasādin","fī","al-arḍi","faka-annamā","qatala","al-nāsa","jamīʿan","waman","aḥyāhā","faka-annamā","aḥyā","al-nāsa","jamīʿan","walaqad","jāathum","rusulunā","bil-bayināti","thumma","inna","kathīran","min'hum","baʿda","dhālika","fī","al-arḍi","lamus'rifūna",null],"verseTiming":[[1,0,590],[2,590,1220],[3,1220,1980],[4,1980,3080],[5,3080,3670],[6,3670,5450],[7,5450,8360],[8,8360,9850],[9,9850,11000],[10,11000,11630],[11,11630,12880],[12,12880,13800],[13,13800,14550],[14,14550,14910],[15,14910,16430],[16,16430,16710],[17,16710,17490],[18,17490,19370],[19,19370,22000],[20,22000,22560],[21,22560,24070],[22,24070,25110],[23,25110,26360],[24,26360,27600],[25,27600,30860],[26,30860,31400],[27,31400,32770],[28,32770,34230],[29,34230,35060],[30,35060,37560],[31,37560,38390],[32,38390,40220],[33,40220,41200],[34,41200,42340],[35,42340,43220],[36,43220,45330],[37,45330,45960],[38,45960,46710],[39,46710,46920],[40,46920,47810],[41,47810,50495]]}}