{"name":"5:47","price":"Kí àwọn tí A fún ní al-’Injīl ṣèdájọ́ pẹ̀lú ohun tí Allāhu sọ̀kalẹ̀ nínú rẹ̀. Ẹnikẹ́ni tí kò bá ṣèdájọ́ pẹ̀lú ohun tí Allāhu sọ̀kalẹ̀, àwọn wọ̀nyẹn ni òbìlẹ̀jẹ́.¹","arabic":"وَلۡيَحۡكُمۡ أَهۡلُ ٱلۡإِنجِيلِ بِمَآ أَنزَلَ ٱللَّهُ فِيهِۚ وَمَن لَّمۡ يَحۡكُم بِمَآ أَنزَلَ ٱللَّهُ فَأُوْلَٰٓئِكَ هُمُ ٱلۡفَٰسِقُونَ","category":["5 (Al-Ma'idah)","Al-Ma'idah","Surah Al-Ma'idah","Chapter Al-Ma'idah","Ma'idah","Surah Ma'idah","Chapter Ma'idah","Al Ma'idah","Surah Al Ma'idah","Chapter Al Ma'idah","Surah 5","Chapter 5","The Table Spread","المَائدة"],"ayahNumber":716,"juzNumber":6,"footnotes":"1. Kíyè sí i, tí àwọn onítírà ’Injīl bá lò ó gẹ́gẹ́ bí Allāhu - subhānahu wa ta'ālā - ṣe sọ̀ ọ́ kalẹ̀, dandan ni fún wọn láti tẹ̀lé Ànábì àsìkò yìí, Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a -. Nítorí pé, àsọtẹ́lẹ̀ nípa Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - kúkú wà nínú rẹ̀. Bí àpẹ̀ẹrẹ, nínú ìwé Johannu 1:19-21, bíbélì sọ pé: (19) Eyi si ni ẹri Johannu, nigba ti awọn Ju ran awọn alufa ati awọn ọmọ Lefi lati Jerusalẹmu wa lati bi i leere pe. Tani iwọ ṣe? (20) O si jẹwọ, ko si sẹ; o si jẹwọ pe. Emi ki i ṣe Kristi naa. (21) Wọn si bi i pe, Tani iwọ ha ṣe? Elijah ni ọ bi? O si wipe Bẹẹkọ, Iwọ ni woli naa bi “ẹni tí à ń retí”? O si dahun wipe, Bẹẹkọ. [Complete Jewish Bible àti New Living Translation Bible. Kíyè sí i, àwọn bíbélì yòókú ti yọ “ẹni tí à ń retí” kúrò gẹ́gẹ́ bí ìṣe wọn.] Nítorí irú àsọtẹ́lẹ̀ wọ̀nyí ló mú kí Waraƙọh ọmọ Naofal, ẹbí ìyáwó àkọ́fẹ́ Ànábì wa - kí ìkẹ́ àti ọlà Allāhu máa bá a - Kọdījah ọmọ Kuwaelid - kí Allāhu yọ́nú sí i -, ṣe gbà pé òun máa tẹ̀lé Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - nígbàkígbà tí Allāhu bá rán an níṣẹ́ sí àwọn ènìyàn. Àmọ́ ó kú ṣíwájú àsìkò náà. \n Síwájú sí i, kàyéfì tí ń bẹ lára àwọn yẹ̀húdí àti nasọ̄rọ̄ ni pé, wọ́n kò yé retí ìmúṣẹ àsọtẹ́lẹ̀ náà. Kódà wọ́n máa ń fi bá àwọn ọ̀ṣẹbọ sọ̀rọ̀ nínú ìwàásù wọn fún wọn. Àmọ́ nígbà tí àsọtẹ́lẹ̀ náà wá sí ìmúṣẹ, ọ̀pọ̀lọ́pọ̀ wọn l’ó gbúnrí. Wọ́n sì ṣàì gbàgbọ́ nínú Ànábì náà - kí ìkẹ́ àti ọlà Allāhu máa bá a -. Èyí ni Allāhu - subhānahu wa ta'ālā - sọ nípa rẹ̀ nínú sūrah al-Baƙọrah; 2:89. Ẹ tún wo ìtọsẹ̀-ọ̀rọ̀ sūrah Yūnus; 10:94.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"walyaḥkum ahlu al-injīli bimā anzala al-lahu fīhi waman lam yaḥkum bimā anzala al-lahu fa-ulāika humu al-fāsiqūna ","translations":["And let judge","(the) People","(of) the Injeel","by what","has revealed","Allah","in it","And whoever","(does) not","judge","by what","has revealed","Allah","then those","[they] (are)","the defiantly disobedient","(47)"],"transliterationArr":["walyaḥkum","ahlu","al-injīli","bimā","anzala","al-lahu","fīhi","waman","lam","yaḥkum","bimā","anzala","al-lahu","fa-ulāika","humu","al-fāsiqūna",null],"verseTiming":[[1,0,1380],[2,1380,1970],[3,1970,4130],[4,4130,5970],[5,5970,7320],[6,7320,8300],[7,8300,10590],[8,10590,10930],[9,10930,11510],[10,11510,12840],[11,12840,14850],[12,14850,15990],[13,15990,16990],[14,16990,19819],[15,19819,20189],[16,20189,23124]]}}