{"name":"5:5","price":"Wọ́n ṣe àwọn n̄ǹkan dáadáa ní ẹ̀tọ́ fún yín lónìí. Àti oúnjẹ àwọn tí A fún ní tírà, ẹ̀tọ́ ni fún yín.¹ Oúnjẹ tiyín náà, ẹ̀tọ́ ni fún wọn. (Ẹ̀tọ́ ni fún yín láti fẹ́) àwọn olómìnira nínú àwọn onígbàgbọ́ òdodo lóbìnrin àti àwọn olómìnira lóbìnrin nínú àwọn tí A fún ní tírà ṣíwájú yín, nígbà tí ẹ bá ti fún wọn ní ṣọ̀daàkí wọn; ẹ fẹ́ wọn ní fífẹ́ (bí ’Islām ṣe ní kí ẹ fẹ́ ìyàwó), láì níí máa bá wọn ṣe sìná (ṣíwájú yìgì) láì sì níí máa yàn wọ́n lálè.² Ẹnikẹ́ni tí ó bá lòdì sí ìgbàgbọ́ òdodo³, iṣẹ́ rẹ̀ ti bàjẹ́. Ní Ọjọ́ Ìkẹ́yìn, ó sì máa wà nínú àwọn ẹni òfò.","arabic":"ٱلۡيَوۡمَ أُحِلَّ لَكُمُ ٱلطَّيِّبَٰتُۖ وَطَعَامُ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ حِلّٞ لَّكُمۡ وَطَعَامُكُمۡ حِلّٞ لَّهُمۡۖ وَٱلۡمُحۡصَنَٰتُ مِنَ ٱلۡمُؤۡمِنَٰتِ وَٱلۡمُحۡصَنَٰتُ مِنَ ٱلَّذِينَ أُوتُواْ ٱلۡكِتَٰبَ مِن قَبۡلِكُمۡ إِذَآ ءَاتَيۡتُمُوهُنَّ أُجُورَهُنَّ مُحۡصِنِينَ غَيۡرَ مُسَٰفِحِينَ وَلَا مُتَّخِذِيٓ أَخۡدَانٖۗ وَمَن يَكۡفُرۡ بِٱلۡإِيمَٰنِ فَقَدۡ حَبِطَ عَمَلُهُۥ وَهُوَ فِي ٱلۡأٓخِرَةِ مِنَ ٱلۡخَٰسِرِينَ","category":["5 (Al-Ma'idah)","Al-Ma'idah","Surah Al-Ma'idah","Chapter Al-Ma'idah","Ma'idah","Surah Ma'idah","Chapter Ma'idah","Al Ma'idah","Surah Al Ma'idah","Chapter Al Ma'idah","Surah 5","Chapter 5","The Table Spread","المَائدة"],"ayahNumber":674,"juzNumber":6,"footnotes":"1. Kíyè sí i, ìwọ̀nyí ni àwọn májẹ̀mu jíjẹ oúnjẹ àwọn onítírà: (1) Kí oúnjẹ náà jẹ oúnjẹ kan bíi oúnjẹ ojoojúmọ́, oúnjẹ títà, oúnjẹ ìgbéyàwó àti oúnjẹ ìsọmọlórúkọ, oúnjẹ náà kò gbọ́dọ̀ jẹmọ́ ọdún wọn tàbí ìjọ́sìn wọn nítorí pé, ẹ̀sìn ló bí oúnjẹ ọdún, kò sì sí oúnjẹ ọdún tí Allāhu yọ́nú sí àfi oúnjẹ ọdún Ìtúnu Ààwẹ̀ àti oúnjẹ ọdún Adhā (ọdún Ìléyá) gẹ́gẹ́ bí ó ṣe jẹ́ pé, kò sí ẹ̀sìn kan tí Allāhu yọ́nú sí àfi ẹ̀sìn ’Islām; (2) Bí oúnjẹ náà bá jẹ́ n̄ǹkan ẹlẹ́mìí, kí ó jẹ́ pé orúkọ “Allāhu” ni wọ́n fi pa á, kó gbọ́dọ̀ jẹ́ orúkọ mìíràn bíi “ọlọ́run baba” tàbí “ọlọ́run ọmọ” tàbí “ọlọ́run ẹ̀mí mímọ́”; (3) Bí oúnjẹ náà bá jẹ́ n̄ǹkan ẹlẹ́mìí, kò gbọ́dọ̀ jẹ́ ọ̀kan nínú àwọn ẹran èèwọ̀ fún mùsùlùmí bí òkúnbete, ẹlẹ́dẹ̀ àti bẹ́ẹ̀ bẹ́ẹ̀ lọ.\n 2. Kíyè sí i, kò sí ìgbà kan kan tí Allāhu yọ̀ǹda fún obìnrin mùsùlùmí láti fẹ́ yẹhudi tàbí nasọ̄rọ̄, kódà kí ìwà wọn dára. Ẹnikẹ́ni tí ó bá fi mùsùlùmọ́ ọmọbìnrin rẹ̀ fún yẹhudi tàbí nasọ̄rọ̄, kí ó lọ mọ̀ pé, yìgì ààrin wọn kò ní àlàáfíà, nítorí náà kí ó lọ gba ọmọbìnrin rẹ̀ padà, wọn ìbáà ti bímọ fúnra wọn. Àti pé, ìwà ẹ̀ṣẹ̀ pọ́nńbélé ni ṣíṣe bẹ́ẹ̀. Àmọ́ tí ọ̀kunrin náà bá ti di mùsùlùmí ṣíwájú síso yìgì náà, yìgì síso náà ti ní àlàáfíà. \n Wàyí, Allāhu yọ̀ǹda fún àwọn ọkùnrin mùsùlùmí láti fẹ́ yẹhudi tàbí nasọ̄rọ̄ lóbìnrin pẹ̀lú àwọn májẹ̀mu wọ̀nyí: (1) Kí ó jẹ́ lábẹ́ ìjọba ’Islām, kò gbọ́dọ̀ jẹ́ lábẹ́ ìjọba kèfèrí nítorí pé, lẹ́yìn tí ìjọba ’Islām dìde ni ’Islām tó yọ̀ǹda fífẹ́ àwọn onítírà obìnrin; (2) Òfin ’Islām ni wọ́n máa lò lórí ìsoyìgì àti èso yìgì; (3) Obìnrin nasọ̄rọ̄ náà kò gbọ́dọ̀ jẹ́ alákitiyan nínú ẹ̀sìn nasọ̄rọ̄; (4) Irú obìnrin náà máa jẹ́ “thamiyyah” ẹni tí ó wá ààbò ẹ̀mí àti dúkìá wá sí orílẹ̀ òfin ’Islām; (5) Kò gbọ́dọ̀ pe àwọn ọmọ rẹ̀ sínú ẹ̀sìn nasọ̄rọ̄; (6) Ní àsìkò ìkọ̀sílẹ̀, bàbá ló ni ọmọ, kì í ṣe ìyá; (6) Nígbà tí kò bá sí obìnrin mùsùlùmí àti ẹrúbìnrin mùsùlùmí nílẹ̀ lọ̀rọ̀ tó kan rírọ́jú fẹ́ àwọn onítírà obìnrin; àti (7) Ìgbéyàwó yìí kò gbọ́dọ̀ jẹ́ láààrin mùsùlùmí lóbìnrin àti onítírà lọ́kùnrin. Èèwọ̀ pọ́nńbélé ni èyí.\n Kíyè sí i, kò sí ìtakora láààrin āyah yìí àti āyah 221 nínú sūrah al-Baƙọrah. Bí ó tilẹ̀ jẹ́ pé ẹlẹ́bọ ni àwọn ọ̀sẹbọ àti àwọn onítírà fún pípe ẹ̀dá lẹ́yìn Allāhu, ìyàtọ̀ ààrin àwọn méjèèjì ni pé, àwọn onítírà gbàgbọ́ pé Allāhu rán àwọn Òjíṣẹ́ Rẹ̀ kan níṣẹ́ sáyé, wọ́n sì gbàgbọ́ pé Allāhu sọ àwọn tírà kan kalẹ̀. Àmọ́ àwọn ọ̀ṣẹbọ kò gbàgbọ́ nínú ìwọ̀nyẹn. \n 3. Ìyẹn ni pé, mùsùlùmí kò gbọ́dọ̀ ti ìpasẹ̀ jíjẹ oúnjẹ onítírà àti fífẹ́ onítírà obìnrin di kèfèrí. Nítorí náà, àwọn n̄ǹkan méjèèjì tí Allāhu ṣe ní ẹ̀tọ́ nínú āyah yìí ló ní àwọn májẹ̀mu, bí bẹ́ẹ̀ kọ́ mùsùlùmí máa padà lòdì sí ìgbàgbọ́ rẹ̀ nípasẹ̀ jíjẹ oúnjẹ àwọn onítírà àti fífẹ́ àwọn onítírà obìnrin.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"al-yawma uḥilla lakumu al-ṭayibātu waṭaʿāmu alladhīna ūtū al-kitāba ḥillun lakum waṭaʿāmukum ḥillun lahum wal-muḥ'ṣanātu mina al-mu'mināti wal-muḥ'ṣanātu mina alladhīna ūtū al-kitāba min qablikum idhā ātaytumūhunna ujūrahunna muḥ'ṣinīna ghayra musāfiḥīna walā muttakhidhī akhdānin waman yakfur bil-īmāni faqad ḥabiṭa ʿamaluhu wahuwa fī al-ākhirati mina al-khāsirīna ","translations":["This day","are made lawful","for you","the good things","and (the) food","(of) those who","were given","the Book","(is) lawful","for you","and your food","(is) lawful","for them","And the chaste women","from","the believers","and the chaste women","from","those who","were given","the Book","from","before you","when","you have given them","their bridal due","being chaste","not","being lewd","and not","ones (who are) taking","secret lovers","And whoever","denies","the faith ","then surely","(are) wasted","his deeds","and he","in","the Hereafter","(will be) among","the losers","(5)"],"transliterationArr":["al-yawma","uḥilla","lakumu","al-ṭayibātu","waṭaʿāmu","alladhīna","ūtū","al-kitāba","ḥillun","lakum","waṭaʿāmukum","ḥillun","lahum","wal-muḥ'ṣanātu","mina","al-mu'mināti","wal-muḥ'ṣanātu","mina","alladhīna","ūtū","al-kitāba","min","qablikum","idhā","ātaytumūhunna","ujūrahunna","muḥ'ṣinīna","ghayra","musāfiḥīna","walā","muttakhidhī","akhdānin","waman","yakfur","bil-īmāni","faqad","ḥabiṭa","ʿamaluhu","wahuwa","fī","al-ākhirati","mina","al-khāsirīna",null],"verseTiming":[[1,0,1270],[2,1270,2080],[3,2080,2870],[4,2870,4480],[5,4480,5400],[6,5400,6630],[7,6630,7240],[8,7240,8380],[9,8380,8890],[10,8890,9900],[11,9900,11420],[12,11420,11830],[13,11830,13390],[14,13390,15100],[15,15100,15380],[16,15380,17010],[17,17010,18700],[18,18700,19060],[19,19060,20280],[20,20280,20910],[21,20910,22000],[22,22000,23070],[23,23070,24110],[24,24110,26410],[25,26410,26750],[26,26750,27940],[27,27940,28550],[28,28550,29690],[29,29690,30800],[30,30800,31840],[31,31840,33790],[32,33790,36360],[33,36360,38250],[34,38250,41100],[35,41100,42350],[36,42350,43050],[37,43050,44520],[38,44520,45140],[39,45140,48040],[40,48040,48720],[41,48720,50600],[42,50600,51080],[43,51080,52740],[44,52740,54240],[45,54240,54910],[46,54910,55600],[47,55600,56870],[48,56870,57460],[49,57460,57660],[50,57660,59090],[51,59090,59460],[52,59460,63355]]}}