{"name":"65:1","price":"Ìwọ Ànábì, nígbà tí ẹ bá fẹ́ kọ àwọn obìnrin sílẹ̀, ẹ kọ̀ wọ́n sílẹ̀ pẹ̀lú òǹkà ọjọ́ opó ìkọ̀sílẹ̀ tí wọ́n máa ṣe.¹ Kí ẹ sì ṣọ́ òǹkà ọjọ́ opó ìkọ̀sílẹ̀ náà. Kí ẹ bẹ̀rù Allāhu, Olúwa yín. Ẹ má ṣe mú wọn jáde kúrò nínú ilé wọn, àwọn náà kò sì gbọdọ̀ jáde àfi tí wọ́n bá lọ ṣe ìbàjẹ́ tó fojú hàn.² Ìwọ̀nyẹn sì ni àwọn ẹnu-ààlà òfin tí Allāhu gbékalẹ̀. Ẹnikẹ́ni tí ó bá tayọ àwọn ẹnu-ààlà òfin tí Allāhu gbékalẹ̀, o kúkú ti ṣàbòsí sí ẹ̀mí ara rẹ̀. Ìwọ kò sì mọ̀ bóyá Allāhu máa mú ọ̀rọ̀ titun kan ṣẹlẹ̀ lẹ́yìn ìyẹn.","arabic":"يَٰٓأَيُّهَا ٱلنَّبِيُّ إِذَا طَلَّقۡتُمُ ٱلنِّسَآءَ فَطَلِّقُوهُنَّ لِعِدَّتِهِنَّ وَأَحۡصُواْ ٱلۡعِدَّةَۖ وَٱتَّقُواْ ٱللَّهَ رَبَّكُمۡۖ لَا تُخۡرِجُوهُنَّ مِنۢ بُيُوتِهِنَّ وَلَا يَخۡرُجۡنَ إِلَّآ أَن يَأۡتِينَ بِفَٰحِشَةٖ مُّبَيِّنَةٖۚ وَتِلۡكَ حُدُودُ ٱللَّهِۚ وَمَن يَتَعَدَّ حُدُودَ ٱللَّهِ فَقَدۡ ظَلَمَ نَفۡسَهُۥۚ لَا تَدۡرِي لَعَلَّ ٱللَّهَ يُحۡدِثُ بَعۡدَ ذَٰلِكَ أَمۡرٗا","category":["65 (At-Talaq)","At-Talaq","Surah At-Talaq","Chapter At-Talaq","Talaq","Surah Talaq","Chapter Talaq","At Talaq","Surah At Talaq","Chapter At Talaq","Surah 65","Chapter 65","The Divorce","الطلاق"],"ayahNumber":5218,"juzNumber":28,"footnotes":"1. Ìyẹn ni pé, ẹ jẹ́ kí wọ́n ṣe “‘iddatu-ttọlāƙ” (opó ìkọ̀sílẹ̀) parí kí yìgì ààrin yín tó ó já. Lẹ́yìn náà, kí ó padà sí ọ̀dọ̀ àwọn ènìyàn rẹ̀. Bákan náà, a kì í sọ pé “mo kọ̀ ọ́ sílẹ̀” ní àsìkò tí obìnrin bá ń ṣe héélà rẹ̀ lọ́wọ́ tàbí lẹ́yìn ìbálòpọ̀ tó wáyé lẹ́yìn ìmọ́ra níbi héélà. \n 2. Ìbàjẹ́ tó fojú hàn tí ó lè dínà kí obìnrin rí opó ìkọ̀sílẹ̀ rẹ̀ ṣe nínú ilé ọkọ rẹ̀ pín sí bíi oríṣi mẹ́ta nínú àwọn tírà Tafsīr: \n Ìbàjẹ́ kìíní: kí obìnrin ṣe zina.\n Ìbàjẹ́ kejì: kí ẹnu obìnrin mú fún èébú bíbú, èpè ṣíṣẹ́ àti ariwo burúkú tí ó ń fi kó ìnira bá ọkọ rẹ̀ àti ará ilé ọkọ rẹ̀. \n Ìbàjẹ́ kẹta: kí igun kìíní kejì wà nínú ẹ̀rù àti àìbalẹ̀-ọkàn síra wọn nípa aburú tí ó súnmọ́ kí wọ́n fi kanra wọn tàbí dúkìá wọn.\n Láti lè dènà irúfẹ́ ìwọ̀nyí, obìnrin máa lọ ṣe opó ìkọ̀sílẹ̀ rẹ̀ ní àyè mìíràn. Fún àlàyé yòókù lórí tọlāƙ (kíkọ ìyàwó sílẹ̀), ẹ lọ ka sūrah al-Baƙọrah; 2: 228 - 232.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"yāayyuhā al-nabiyu idhā ṭallaqtumu al-nisāa faṭalliqūhunna liʿiddatihinna wa-aḥṣū al-ʿidata wa-ittaqū al-laha rabbakum lā tukh'rijūhunna min buyūtihinna walā yakhruj'na illā an yatīna bifāḥishatin mubayyinatin watil'ka ḥudūdu al-lahi waman yataʿadda ḥudūda al-lahi faqad ẓalama nafsahu lā tadrī laʿalla al-laha yuḥ'dithu baʿda dhālika amran ","translations":["O","Prophet","When","you divorce","[the] women","then divorce them","for their waiting period","and keep count","(of) the waiting period","and fear","Allah","your Lord","(Do) not","expel them","from","their houses","and not","they should leave","except","that","they commit","an immorality","clear","And these","(are the) limits","(of) Allah","And whoever","transgresses","(the) limits","(of) Allah","then certainly","he has wronged","himself","Not","you know","Perhaps","Allah","will bring about","after","that","a matter","(1)"],"transliterationArr":["yāayyuhā","al-nabiyu","idhā","ṭallaqtumu","al-nisāa","faṭalliqūhunna","liʿiddatihinna","wa-aḥṣū","al-ʿidata","wa-ittaqū","al-laha","rabbakum","lā","tukh'rijūhunna","min","buyūtihinna","walā","yakhruj'na","illā","an","yatīna","bifāḥishatin","mubayyinatin","watil'ka","ḥudūdu","al-lahi","waman","yataʿadda","ḥudūda","al-lahi","faqad","ẓalama","nafsahu","lā","tadrī","laʿalla","al-laha","yuḥ'dithu","baʿda","dhālika","amran",null],"verseTiming":[[1,0,2570],[2,2570,4150],[3,4150,4570],[4,4570,5810],[5,5810,8620],[6,8620,10840],[7,10840,13130],[8,13130,13890],[9,13890,15270],[10,15270,16040],[11,16040,16860],[12,16860,18170],[13,18170,18450],[14,18450,20670],[15,20670,21670],[16,21670,23660],[17,23660,24200],[18,24200,25110],[19,25110,25910],[20,25910,26560],[21,26560,27130],[22,27130,28030],[23,28030,29970],[24,29970,30380],[25,30380,31760],[26,31760,32970],[27,32970,35540],[28,35540,36280],[29,36280,37100],[30,37100,39930],[31,39930,40200],[32,40200,41820],[33,41820,42510],[34,42510,43350],[35,43350,43860],[36,43860,44530],[37,44530,45760],[38,45760,46100],[39,46100,46920],[40,46920,47550],[41,47550,48410],[42,48410,49190],[43,49190,49650],[44,49650,50540],[45,50540,51505]]}}