{"name":"66:3","price":"Rántí nígbà tí Ànábì bá ọ̀kan nínú àwọn ìyàwó rẹ̀ s’ọ̀rọ̀ àṣírí. Nígbà tí (ẹni tó bá sọ̀rọ̀, ìyẹn Hafsọh) sì sọ̀rọ̀ náà fún (‘Ā’iṣah), Allāhu sì fi han Ànábì (pé ẹlòmíìràn ti gbọ́ sí i).¹ Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - sì sọ apá kan rẹ̀ (fún Hafsọh pé: “O ti fi ọ̀rọ̀ Mọ̄riyah tó ‘Ā’iṣah létí.”). Ó sì fi apá kan sílẹ̀ (ìyẹn, ọ̀rọ̀ nípa ipò àrólé). Àmọ́ nígbà tí (Ànábì) fi ìró náà tó o létí, Hafsọh) sọ pé: “Ta ni ó fún ọ ní ìró èyí?” (Ànábì) sọ pé: “Onímọ̀, Alámọ̀tán l’Ó fún mi ní ìró náà.”","arabic":"وَإِذۡ أَسَرَّ ٱلنَّبِيُّ إِلَىٰ بَعۡضِ أَزۡوَٰجِهِۦ حَدِيثٗا فَلَمَّا نَبَّأَتۡ بِهِۦ وَأَظۡهَرَهُ ٱللَّهُ عَلَيۡهِ عَرَّفَ بَعۡضَهُۥ وَأَعۡرَضَ عَنۢ بَعۡضٖۖ فَلَمَّا نَبَّأَهَا بِهِۦ قَالَتۡ مَنۡ أَنۢبَأَكَ هَٰذَاۖ قَالَ نَبَّأَنِيَ ٱلۡعَلِيمُ ٱلۡخَبِيرُ","category":["66 (At-Tahrim)","At-Tahrim","Surah At-Tahrim","Chapter At-Tahrim","Tahrim","Surah Tahrim","Chapter Tahrim","At Tahrim","Surah At Tahrim","Chapter At Tahrim","Surah 66","Chapter 66","The Prohibition","التحريم"],"ayahNumber":5232,"juzNumber":28,"footnotes":"1. Méjì ni ọ̀rọ̀ àṣírí náà. Ìkíní: bíbúra tí Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - fi Allāhu búra pé òun kò níí fẹ́ ẹrúbìnrin rẹ̀ kan, Mọ̄riyah Ƙibtiyyah - kí Allāhu yọ́nú sí i -, ẹni tó bí ’Ibrọ̄hīm fún Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a -. Ìkejì: sísọ tí Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - sọ pé Abu Bakr Siddīƙ ni àrólé àkọ́kọ́, ‘Umọr ọmọ Kattọ̄b sì ni àrólé kejì - kí Allāhu yọ́nú sí wọn - . Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - fi àwọn ọ̀rọ̀ méjèèjì náà pamọ́ sí ọwọ́ Hafsọh. Àmọ́, Hafsọh fi tó ‘Ā’iṣah létí - kí Allāhu yọ́nú sí wọn - .","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"wa-idh asarra al-nabiyu ilā baʿḍi azwājihi ḥadīthan falammā nabba-at bihi wa-aẓharahu al-lahu ʿalayhi ʿarrafa baʿḍahu wa-aʿraḍa ʿan baʿḍin falammā nabba-ahā bihi qālat man anba-aka hādhā qāla nabba-aniya al-ʿalīmu al-khabīru ","translations":["And when","confided","the Prophet","to","one","(of) his wives","a statement","and when","she informed","about it","and made it apparent","Allah","to him","he made known","a part of it","and avoided","[of]","a part","Then when","he informed her","about it","she said","Who","informed you","this","He said","Has informed me","the All-Knower","the All-Aware","(3)"],"transliterationArr":["wa-idh","asarra","al-nabiyu","ilā","baʿḍi","azwājihi","ḥadīthan","falammā","nabba-at","bihi","wa-aẓharahu","al-lahu","ʿalayhi","ʿarrafa","baʿḍahu","wa-aʿraḍa","ʿan","baʿḍin","falammā","nabba-ahā","bihi","qālat","man","anba-aka","hādhā","qāla","nabba-aniya","al-ʿalīmu","al-khabīru",null],"verseTiming":[[1,0,560],[2,560,1340],[3,1340,2900],[4,2900,3450],[5,3450,4030],[6,4030,5320],[7,5320,6960],[8,6960,8600],[9,8600,9490],[10,9490,10100],[11,10100,11240],[12,11240,12030],[13,12030,12800],[14,12800,13660],[15,13660,14620],[16,14620,15590],[17,15590,15850],[18,15850,17130],[19,17130,19470],[20,19470,20560],[21,20560,21150],[22,21150,21900],[23,21900,22280],[24,22280,24040],[25,24040,24970],[26,24970,26040],[27,26040,27150],[28,27150,28060],[29,28060,30895]]}}