{"name":"6:12","price":"Sọ pé: “Ti ta ni ohunkóhun tó wà nínú àwọn sánmọ̀ àti ilẹ̀?” Sọ pé: “Ti Allāhu ni.” Ó ṣe àánú ní ọ̀ran-anyàn léra Rẹ̀ lórí.¹ Dájúdájú Ó máa ko yín jọ ní Ọjọ́ Àjíǹde, kò sí iyèméjì nínú rẹ̀. Àwọn tó ṣe ẹ̀mí wọn lófò (sínú àìgbàgbọ́), wọn kò níí gbàgbọ́.","arabic":"قُل لِّمَن مَّا فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ قُل لِّلَّهِۚ كَتَبَ عَلَىٰ نَفۡسِهِ ٱلرَّحۡمَةَۚ لَيَجۡمَعَنَّكُمۡ إِلَىٰ يَوۡمِ ٱلۡقِيَٰمَةِ لَا رَيۡبَ فِيهِۚ ٱلَّذِينَ خَسِرُوٓاْ أَنفُسَهُمۡ فَهُمۡ لَا يُؤۡمِنُونَ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":801,"juzNumber":7,"footnotes":"1. Irú àánú wo? Èsì rẹ̀ wá níwájú nínú āyah 54, bí ó tilẹ̀ jẹ́ pé àànú kan tún ni lílọ́ ẹ̀dá lára títí di Ọjọ́ Àjíǹde gẹ́gẹ́ bí ó ṣe wà nínú āyah tí à ń tọsẹ̀ rẹ̀ lọ́wọ́. \n Lẹ́yìn náà, bí Allāhu - subhānahu wa ta‘ālā - kò ṣe fi apá kan mọ̀nà, kò túmọ̀ sí pé Allāhu kì í ṣe Aláàánú, kò sì túmọ̀ sí pé àánú Rẹ̀ kò lè kárí gbogbo wa ní ayé àti ní ọ̀run, gẹ́gẹ́ bí ó ṣe jẹ́ pé bí Allāhu ṣe fi ọ̀nà tààrà Rẹ̀ ’Islām mọ apá kan kò túmọ̀ sí pé Allāhu - subhānahu wa ta‘ālā - jẹ́ alábòsí. Àmọ́ ẹ̀kọ́ tí Allāhu - subhānahu wa ta‘ālā - fẹ́ kọ́ wa nínú ìwọ̀nyẹn pọ̀ púpọ̀. \n Nínú rẹ̀ ni pé, gbogbo ìròyìn ara Rẹ̀ l’ó gbọ́dọ̀ wá sí ìmúṣẹ. Lára ìròyìn Rẹ̀ ni ìfinimọ̀nà àti ìṣinilọ́nà, àánú àti ìyà. Kò sí èyí tó máa ṣe àlékún ọlá Rẹ̀ nínú wọn, kò sì sí èyí tí ó máa tàbùkù ipò Rẹ̀ nínú wọn. Ẹnì kọ̀ọ̀kan ni kó wòye sí ọ̀rọ̀ ara rẹ̀ pẹ̀lú ọpọlọ tó mọ ọ̀tún yàtọ̀ sí òsì nítorí pé, kò sí ẹni tí Allāhu - subhānahu wa ta'ālā - kò ní àwíjàre lórí rẹ̀.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"qul liman mā fī al-samāwāti wal-arḍi qul lillahi kataba ʿalā nafsihi al-raḥmata layajmaʿannakum ilā yawmi al-qiyāmati lā rayba fīhi alladhīna khasirū anfusahum fahum lā yu'minūna ","translations":["Say","To whom (belongs)","what","(is) in","the heavens","and the earth","Say","To Allah","He has decreed","upon","Himself","the Mercy","Surely He will assemble you","on","(the) Day","(of) the Resurrection","(there is) no","doubt","about it","Those who","have lost","themselves","then they","(do) not","believe","(12)"],"transliterationArr":["qul","liman","mā","fī","al-samāwāti","wal-arḍi","qul","lillahi","kataba","ʿalā","nafsihi","al-raḥmata","layajmaʿannakum","ilā","yawmi","al-qiyāmati","lā","rayba","fīhi","alladhīna","khasirū","anfusahum","fahum","lā","yu'minūna",null],"verseTiming":[[1,0,430],[2,430,930],[3,930,2030],[4,2030,2250],[5,2250,3760],[6,3760,4810],[7,4810,5070],[8,5070,8260],[9,8260,8840],[10,8840,9490],[11,9490,10240],[12,10240,11650],[13,11650,13950],[14,13950,14560],[15,14560,15170],[16,15170,16520],[17,16520,16830],[18,16830,17500],[19,17500,19940],[20,19940,21150],[21,21150,23500],[22,23500,25230],[23,25230,25850],[24,25850,26140],[25,26140,28985]]}}