{"name":"6:14","price":"Sọ pé: “Ṣé kí n̄g mú olùrànlọ́wọ́ kan yàtọ̀ sí Allāhu, Ẹlẹ́dàá àwọn sánmọ̀ àti ilẹ̀? Òun sì ni Ó ń bọ́ (ẹ̀dá), wọn kì í bọ́ Ọ.” Sọ pé: “Dájúdájú Wọ́n pa mí láṣẹ pé kí n̄g jẹ́ ẹni àkọ́kọ́ tí ó máa ṣe ’Islām (ní àsìkò tèmi).”¹ Ìwọ kò sì gbọdọ̀ wà nínú àwọn ọ̀ṣẹbọ.","arabic":"قُلۡ أَغَيۡرَ ٱللَّهِ أَتَّخِذُ وَلِيّٗا فَاطِرِ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَهُوَ يُطۡعِمُ وَلَا يُطۡعَمُۗ قُلۡ إِنِّيٓ أُمِرۡتُ أَنۡ أَكُونَ أَوَّلَ مَنۡ أَسۡلَمَۖ وَلَا تَكُونَنَّ مِنَ ٱلۡمُشۡرِكِينَ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":803,"juzNumber":7,"footnotes":"Irú āyah yìí wà níwájú ní āyah 163. Ó tún wà nínú sūrah az-Zumọr; 39:12. Kíyè sí i, Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - bá ’Islām láyé ni, kì í ṣe òun ni ẹni àkọ́kọ́ tí ó kọ́kọ́ ṣe ’Islām nítorí pé, ’Islām ni ẹ̀sìn tí gbogbo àwọn Òjíṣẹ́ Allāhu - kí ọlà Allāhu máa bá wọn - tó ṣíwájú rẹ̀ ṣe. Àmọ́ nínú ìjọ tirẹ̀, òun ni ẹni àkọ́kọ́ onígbàgbọ́ òdodo. \n Bákan náà, bí ìkọ̀ọ̀kan àwọn Ànábì àti Òjíṣẹ́ Allāhu - kí ọlà Allāhu máa bá wọn - ṣe máa ń sọ nìyẹn nínú ìjọ kóówá wọn ní ìgbà kóówá wọn gẹ́gẹ́ bí èyí ṣe rinlẹ̀ nínú sūrah al-’A‘rọ̄f; 7: 143. Nítorí náà, Ànábì kọ̀ọ̀kan ní ẹni àkọ́kọ́ onígbàgbọ́ òdodo nínú ìjọ rẹ̀. Kódà fún wí pé nínú ìjọ Fir‘aon, àwọn òpìdán rẹ̀ ni àwọn tó kọ́kọ́ gbàgbọ́ ní òdodo, l’ó mú àwọn náà pe ara wọn ní ẹni àkọ́kọ́ onígbàgbọ́ òdodo, gẹ́gẹ́ bí èyí ṣe rinlẹ̀ bẹ́ẹ̀ nínú sūrah aṣ-Ṣu‘arā’; 26:51. \n Síwájú sí i, nígbà tí Allāhu - subhānahu wa ta‘ālā - ń kìlọ̀ fún àwọn ọmọ ’Isrọ̄’īl pé kí wọ́n má ṣe jẹ́ ẹni àkọ́kọ́ aláìgbàgbọ́, ìyẹn nínú sūrah al-Baƙọrah; 2:41, wọ́n sì kúkú di aláìgbàgbọ́ ní gbogbo ọ̀nà lẹ́yìn Ànábì Mūsā - kí ọlà Allāhu máa bá a -. Ǹjẹ́ àwọn ọmọ ’Isrọ̄’īl sì ni àwọn ẹni àkọ́kọ́ aláìgbàgbọ́ bí? Rárá. Ọ̀pọ̀lọ́pọ̀ nínú ìjọ ìjọ tó ṣíwájú wọn di aláìgbàgbọ́ ṣíwájú wọn bí ìjọ Ànábì Nūh - kí ọlà Allāhu máa bá a -. Àmọ́ nígbà tàwọn ọmọ ’Isrọ̄’īl, àwọn ni wọ́n tún wà nípò àwọn ẹni àkọ́kọ́ aláìgbàgbọ́ nínú ìjọ tiwọn. Nítorí náà, kò sí “ìtakora tóríbẹ́ẹ̀” nínú àwọn āyah wọ̀nyẹn.\n Síwájú sí i, ìtúmọ̀ ’Islām ni ìjuwọ́-jusẹ̀ sílẹ̀ pátápátá fún àṣẹ Allāhu, òfin Rẹ̀ àti ìlànà Rẹ̀. Èyí ni àwọn kan mọ̀ sí “ṣíṣe ìfẹ́-tỌlọ́hun”. Èwo nínú àwọn Ànábì Ọlọ́hun àti Òjíṣẹ́ Rẹ̀ ni kò juwọ́-jusẹ̀ sílẹ̀ pátápátá fún àṣẹ Allāhu, òfin Rẹ̀ àti ìlànà Rẹ̀? Èwo nínú wọn sẹ́ ni kò ṣe ìfẹ́-tỌlọ́hun? Kò sí. Ìdí nìyí ti gbogbo wọn fi jẹ́ mùsùlùmí gẹ́gẹ́ bi Allāhu - subhānahu wa ta‘ālā - ṣe fi rinlẹ̀ nínú sūrah al-Baƙọrah; 2:128 – 141.\n Kíyè sí i! Nasrọ̄niyyah kò túmọ̀ sí “ṣíṣe ìfẹ́ tỌlọ́hun”. Nasrọ̄niyyah kò sì túmọ̀ sí ìjuwọ́-jusẹ̀ sílẹ̀ pátápátá fún àṣẹ Ọlọ́hun, òfin Ọlọ́hun àti ìlànà Rẹ̀. Kódà àwọn nasọ̄rọ̄ wulẹ̀ ti kó ara wọn kúrò lábẹ́ òfin Ọlọ́hun, wọ́n ti wà lábẹ́ òfin “ìfẹ́-àwọn wòlíì” ní orúkọ “oore-ọ̀fẹ́ ‘Īsā ọmọ Mọryam”. Èyí ni Allāhu - subhānahu wa ta‘ālā - sọ nípa rẹ̀ nínú sūrah at-Taobah; 9:31 àti sūrah āli-‘Imrọ̄n; 3:64. \n Nítorí náà, Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - kì í ṣe ẹni àkọ́kọ́ tí ó kọ́kọ́ juwọ́-jusẹ̀ sílẹ̀ pátápátá fún àṣẹ Allāhu, òfin Rẹ̀ àti ìlànà Rẹ̀. Àmọ́ nínú ìjọ rẹ̀, òun ni ẹni àkọ́kọ́ tí ó kọ́kọ́ ṣe bẹ́ẹ̀.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"qul aghayra al-lahi attakhidhu waliyyan fāṭiri al-samāwāti wal-arḍi wahuwa yuṭ'ʿimu walā yuṭ'ʿamu qul innī umir'tu an akūna awwala man aslama walā takūnanna mina al-mush'rikīna ","translations":["Say","Is it other than","Allah","I (should) take","(as) a protector","Creator","(of) the heavens","and the earth","while (it is) He","Who feeds","and not","He is fed","Say","Indeed I","[I] am commanded","that","I be","(the) first","who","submits (to Allah)","and not","be","of","the polytheists","(14)"],"transliterationArr":["qul","aghayra","al-lahi","attakhidhu","waliyyan","fāṭiri","al-samāwāti","wal-arḍi","wahuwa","yuṭ'ʿimu","walā","yuṭ'ʿamu","qul","innī","umir'tu","an","akūna","awwala","man","aslama","walā","takūnanna","mina","al-mush'rikīna",null],"verseTiming":[[1,0,420],[2,420,1180],[3,1180,2110],[4,2110,3170],[5,3170,4950],[6,4950,5890],[7,5890,7400],[8,7400,8470],[9,8470,9100],[10,9100,10010],[11,10010,10510],[12,10510,11240],[13,11240,12390],[14,12390,15430],[15,15430,16260],[16,16260,16680],[17,16680,17510],[18,17510,18390],[19,18390,18770],[20,18770,19660],[21,19660,20210],[22,20210,22470],[23,22470,22790],[24,22790,26065]]}}