{"name":"6:18","price":"Òun sì ni Olùborí tó wà lókè àwọn ẹrú Rẹ̀. Òun ni Ọlọ́gbọ́n, Alámọ̀tán.¹","arabic":"وَهُوَ ٱلۡقَاهِرُ فَوۡقَ عِبَادِهِۦۚ وَهُوَ ٱلۡحَكِيمُ ٱلۡخَبِيرُ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":807,"juzNumber":7,"footnotes":"Āyah yìí àti āyah 61 nínú sūrah yìí ti fi rinlẹ̀ pé, òkè lókè àwọn sánmọ̀ ni pàápàá bíbẹ Allāhu - subhānahu wa ta‘ālā - wà pẹ̀lú títóbi Rẹ̀. Àmọ́ sūrah az-Zukruf; 43:84, sūrah al-Hadīd; 57:4 àti = = sūrah al-Mujādilah; 58:7 èyí tí àwọn kan fi lérò pé kò sí ibi tí pàápàá bíbẹ Allāhu kò sí, lókè àti nílẹ̀ ní kọ̀rọ̀ àti ní gban̄gba, ó jẹ́ ìtúmọ̀ òdì tí kò wà ní ìbámu sí èròǹgbà Allāhu - subhānahu wa ta‘ālā - lórí àwọn āyah náà. Ìdí ni pé, àwọn āyah 18 àti 61 nínú sūrah al-’Ani‘ām àti sūrah an-Nahl; 16:50 ń sọ nípa ibi tí pàápàá bíbẹ Allāhu - subhānahu wa ta'ālā - wà, ìyẹn sì ni òkè sánmọ̀ keje. Àmọ́ àwọn sūrah az-Zukruf; 43: 84, sūrah al-Hadīd; 57:4 àti sūrah al-Mujādilah; 58:7 sì ń sọ nípa ìmọ̀ Allāhu àti nípa bí ìmọ̀ Rẹ̀ ṣe gbòòrò, tó sì fi ìmọ̀ Rẹ̀ yípo gbogbo ẹ̀dá Rẹ̀ pátápátá, tó bẹ́ẹ̀ gẹ́ tí kò fi sí ẹ̀dá kan kan tí Allāhu kò nímọ̀ nípa ibi tí ó wà. \n Ìdí nìyí tí Allāhu - subhānahu wa ta‘ālā - ṣe fi sūrah al-’Ani‘ām; 6:80, sūrah Tọ̄hā; 20:98 àti sūrah at-Tọlāƙ; 65:12 yanjú ìrújú tí àwọn aláṣìtú wọ̀nyẹn ní. \n Kíyè sí i, tòhun ti bí Fir‘aon ṣe ṣàì gbàgbọ́ tó nínú pàápàá bíbẹ Allāhu, kò kúkú wá Allāhu lọ sí àyè kan kan lórí ilẹ̀ ayé bí kò ṣe òkè ayé, ìyẹn sánmọ̀, bí ó tilẹ̀ já sí pé kò lè rí Allāhu - subhānahu wa ta'ālā -. Èyí wà nínú sūrah Gọ̄fir; 40:36 - 37. \n Ọ̀kan pàtàkì tó sì burú nínú àwọn àdìsọ́kàn àwọn aláìgbàgbọ́ ni pé, “ibi gbogbo ni Ọlọ́hun wà”. Má ṣe bá wọn sọ bẹ́ẹ̀ nítorí kí o má baà dà bí tiwọn. Ẹ tún wo ìtọsẹ̀-ọ̀rọ̀ fún sūrah al-Mujādilah; 58:7.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"wahuwa al-qāhiru fawqa ʿibādihi wahuwa al-ḥakīmu al-khabīru ","translations":["And He","(is) the Subjugator","over","His slaves","And He","(is) the All-Wise","the All-Aware","(18)"],"transliterationArr":["wahuwa","al-qāhiru","fawqa","ʿibādihi","wahuwa","al-ḥakīmu","al-khabīru",null],"verseTiming":[[1,0,740],[2,740,1850],[3,1850,2500],[4,2500,4140],[5,4140,4710],[6,4710,5790],[7,5790,8595]]}}