{"name":"6:78","price":"Nígbà tí ó rí òòrùn tó yọ, ó sọ pé: “Èyí ni olúwa mi; èyí tóbi jùlọ.” Nígbà tó wọ̀, ó sọ pé: “Ẹ̀yin ènìyàn mi, dájúdájú èmi yọwọ́ yọsẹ̀ nínú ohun tí ẹ ń fi ṣẹbọ (sí Allāhu).¹","arabic":"فَلَمَّا رَءَا ٱلشَّمۡسَ بَازِغَةٗ قَالَ هَٰذَا رَبِّي هَٰذَآ أَكۡبَرُۖ فَلَمَّآ أَفَلَتۡ قَالَ يَٰقَوۡمِ إِنِّي بَرِيٓءٞ مِّمَّا تُشۡرِكُونَ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":867,"juzNumber":7,"footnotes":"1. Nínú àwọn āyah 76, 77 àti 78, ní tẹ̀léǹtẹ̀lé ni Ànábì ’Ibrọ̄hīm - kí ọlà Allāhu máa bá a - ti pe ìràwọ̀, òṣùpá àti òòrùn ní olúwà rẹ̀ lẹ́yìn Allāhu! Èèwọ̀ sì ni sísọ bẹ́ẹ̀. Ànábì ’Ibrọ̄hīm - kí ọlà Allāhu máa bá a - tún wọ́gi lé ìkọ̀ọ̀kan wọn ní tẹ̀léǹtẹ̀lé àti lẹ́sẹ̀kẹsẹ̀! Ǹjẹ́ pípè tí Ànábì ’Ibrọ̄hīm - kí ọlà Allāhu máa bá a - pe ìràwọ̀, òṣùpá àti òòrùn ní olúwà rẹ̀ sọ ọ́ di ọ̀ṣẹbọ bí? Rárá. Ànábì ’Ibrọ̄hīm - kí ọlà Allāhu máa bá a - kò jọ́sìn fún ìràwọ̀, òṣùpá, òòrùn àti òrìṣà kan kan rí nínú ìṣẹ̀mí ayé rẹ̀, láti ọjọ́ ìbí rẹ̀ títí ọjọ́ ikú rẹ̀, gẹ́gẹ́ bí àwọn yòókù nínú àwọn Ànábì àti àwọn Òjíṣẹ́ Allāhu - kí ọlà Allāhu máa bá gbogbo wọn - kò ṣe ṣẹbọ rí. Allāhu - subhānahu wa ta‘ālā - sì ti ṣe àfọ̀mọ́ Ànábì ’Ibrọ̄hīm - kí ọlà Allāhu máa bá a - pé kò ṣẹbọ rí, gẹ́gẹ́ bí èyí ṣe rinlẹ̀ bẹ́ẹ̀ nínú sūrah al-Baƙọrah; 2:135, sūrah āli ‘Imrọ̄n; 3:67 àti 95, sūrah al-’Ani‘ām; 6:161 àti sūrah an-Nahl; 16:120 àti 123. Àwọn onímọ̀ sì ṣe àlàyé lórí àwọn āyah 76, 77 àti 78 nínú sūrah al-’Ani‘ām yìí púpọ̀ pẹ̀lú èròǹgbà láti ṣọ́ ẹnu wa níbi sísọ ìsọkúsọ nípa Ànábì ’Ibrọ̄hīm, àyò Allāhu (kọlīlu-llāh). Èyí tí àwọn onímọ̀ ṣe yìí pé kí á ṣọ́ ẹnu wa níbi sísọ ìsọkúsọ nípa Ànábì ’Ibrọ̄hīm - kí ọlà Allāhu máa bá a - wà ní ìbámu sí sūrah Mọryam; 90:50. \n Lẹ́yìn náà, èyí tí ó tẹ́rùn jùlọ gẹ́gẹ́ bí ibùgbékà ọ̀rọ̀ náà ni àlàyé tí àwọn àfáà mú wá pé, “Ànábì ’Ibrọ̄hīm - kí ọlà Allāhu máa bá a - mú ọ̀rọ̀ náà wá lójú pọ̀n-nà ìgbémọ́ra àti ìjẹ́nilẹ́gọ̀ọ́ láti sọ àròjàre ìjọ rẹ̀ di àròjẹ̀bi wọn, kì í ṣe lójú pọ̀n-nà ìṣeyèméjì nípa Allāhu - subhānahu wa ta'ālā -. Bí ọ̀rọ̀ ṣe rí gẹ́lẹ́ nìyẹn - w-Allahu ’a‘lam - nítorí pé ohun tí ọ̀rọ̀ náà jọ ni kí a sọ pé, Ànábì ’Ibrọ̄hīm - kí ọlà Allāhu máa bá a - sọ pé, “Ṣé èyí “ìràwọ̀” ni olúwa mi? Rárá. Ṣé èyí “òṣùpá” ni olúwá mi? Rárá… Ìwọ̀nyẹn sì ni àwọn n̄ǹkan tí ìjọ rẹ̀ ń jọ́sìn fún lẹ́yìn Allāhu. Ìjọ rẹ̀ l’ó ń pe ìwọ̀nyẹn ní olúwa wọn. Àmọ́ Ànábì ’Ibrọ̄hīm - kí ọlà Allāhu máa bá a - ń wá ọ̀nà tí ó máa gbà fi yé wọn pé ìràwọ̀, òṣùpá, òòrùn tàbí òrìṣà kan kò lè jẹ́ olúwa kí ó máa sá lọ sá bọ̀. \n A kúkú tún rí ìṣẹ̀lẹ̀ mìíràn lọ́dọ̀ Ànábì ’Ibrọ̄hīm - kí ọlà Allāhu máa bá a - lójú pọ̀n-nà ẹ̀lọ́. Ìyẹn nígbà tí àwọn abọ̀rìṣà bi í léèrè pé, “Ṣé ìwọ l’o ṣe èyí pẹ̀lú àwọn ọlọ́hun wa, ’Ibrọ̄hīm?” Ànábì ’Ibrọ̄hīm - kí ọlà Allāhu máa bá a - sì sọ pé: “Rárá o, àgbà wọn yìí l’ó ṣe (wọ́n bẹ́ẹ̀).” Ànábì ’Ibrọ̄hīm - kí ọlà Allāhu máa bá a - l’ó sì yọ àáké ti àwọn òrìṣà wọn, tí ó sì rún wọn wómúwómú. Àmọ́ ó kúkú sọ òye tó fẹ́ kí àwọn ọ̀ṣẹbọ mú jáde nínú ìṣẹ̀lẹ̀ náà. Òye náà ni pé, ó sọ pé: “Nítorí náà, ẹ bi wọ́n léèrè wò tí wọ́n bá máa ń sọ̀rọ̀.” (sūrah al-’Anbiyā’; 21:62-63). \n Èyí kò kúkú sọ Ànábì ’Ibrọ̄hīm - kí ọlà Allāhu máa bá a - di òpùrọ́, ìyẹn kò sì sọ Ànábì ’Ibrọ̄hīm - kí ọlà Allāhu máa bá a - di ọ̀ṣẹbọ, àmọ́ ìkíní kejì wà lábẹ́ fífi òye ṣàyẹ̀wò òye wọn wò bóyá òye wọn ti rí ìmọ́lẹ̀ tàbí ó sì wà nínú òkùnkùn. Òye tí ó bá rí ìmọ́lẹ̀ l’ó máa rí ìdáláre fún ohun tí Ànábì ’Ibrọ̄hīm - kí ọlà Allāhu máa bá a - ṣe wọ̀nyí. Àmọ́ tí òye bá wà nínú òkùnkùn kò níí rí ìdáláre náà, gẹ́gẹ́ bí òye àwọn ọ̀ṣẹbọ ọjọ́ náà kò ṣe rí ìdáláre fún Ànábì ’Ibrọ̄hīm - kí ọlà Allāhu máa bá a -.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"falammā raā al-shamsa bāzighatan qāla hādhā rabbī hādhā akbaru falammā afalat qāla yāqawmi innī barīon mimmā tush'rikūna ","translations":["When","he saw","the sun","rising","he said","This (is)","my Lord","this (is)","greater","But when","it set","he said","O my people","Indeed, I am","free","of what","you associate (with Allah)","(78)"],"transliterationArr":["falammā","raā","al-shamsa","bāzighatan","qāla","hādhā","rabbī","hādhā","akbaru","falammā","afalat","qāla","yāqawmi","innī","barīon","mimmā","tush'rikūna",null],"verseTiming":[[1,0,1690],[2,1690,2130],[3,2130,2950],[4,2950,4870],[5,4870,5620],[6,5620,6340],[7,6340,7260],[8,7260,10010],[9,10010,11350],[10,11350,14620],[11,14620,15420],[12,15420,16030],[13,16030,17110],[14,17110,18440],[15,18440,20790],[16,20790,23370],[17,23370,26195]]}}