{"name":"6:9","price":"Tí ó bá jẹ́ pé A ṣe é ní mọlāika ni, Àwa ìbá ṣe é ní ọkùnrin. Àti pé Àwa ìbá tún fi ohun tí wọ́n ń darú mọ́ra wọn lójú rú wọn lójú.¹","arabic":"وَلَوۡ جَعَلۡنَٰهُ مَلَكٗا لَّجَعَلۡنَٰهُ رَجُلٗا وَلَلَبَسۡنَا عَلَيۡهِم مَّا يَلۡبِسُونَ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":798,"juzNumber":7,"footnotes":"1. Ìyẹn ni pé, níwọ̀n ìgbà tí àwọn ọ̀ṣẹbọ wọ̀nyẹn ti da ọ̀rọ̀ rú mọ́ra wọn lọ́wọ́ lórí ṣíṣà tí Allāhu ṣa Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - lẹ́ṣà láààrin wọn, ẹni tí àwọn náà jẹ́rìí sí jíjẹ́ olódodo àti olùfọkàntán rẹ̀ ṣíwájú kí ó tó di Òjíṣẹ́ Ọlọ́hun, tí wọ́n sì ń sọ ìsọkúsọ sí i lóríṣiríṣi lọ́nà àìtọ́, bẹ́ẹ̀ náà ni wọ́n ṣe máa dojú ọ̀rọ̀ rú mọ́ra wọn lọ́wọ́ tí ó bá jẹ́ pé mọlāika kan ni Allāhu ní kí ó jẹ́ Òjíṣẹ́ Rẹ̀ láààrin wọn nítorí pé, àwọn tí wọn kò gbàgbọ́ nínú ènìyàn tí wọ́n mọ ìtàn ìgbésí-ayé rẹ̀ sí òdodo àti ìfọkàntán, wọn kò níí wulẹ̀ gbàgbọ́ pàápàá nínú mọlāika tí wọn kò mọ n̄ǹkan kan nípa ìtàn ìgbésí-ayé rẹ̀.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"walaw jaʿalnāhu malakan lajaʿalnāhu rajulan walalabasnā ʿalayhim mā yalbisūna ","translations":["And if","We had made him","an Angel","certainly We (would) have made him","a man","and certainly We (would) have obscured","to them","what","they are obscuring","(9)"],"transliterationArr":["walaw","jaʿalnāhu","malakan","lajaʿalnāhu","rajulan","walalabasnā","ʿalayhim","mā","yalbisūna",null],"verseTiming":[[1,0,3148],[2,3148,4434],[3,4434,5266],[4,5266,6762],[5,6762,7897],[6,7897,9524],[7,9524,10804],[8,10804,12113],[9,12113,15380]]}}