{"name":"7:185","price":"Ṣé wọn kò wo ìjọba àwọn sánmọ̀ àti ilẹ̀ pẹ̀lú gbogbo n̄ǹkan tí Allāhu dá? Àmọ́ sá ó lè jẹ́ pé Àkókò ikú wọn ti súnmọ́. Nígbà náà, ọ̀rọ̀ wo ni wọn yóò gbàgbọ́ lẹ́yìn rẹ̀?¹","arabic":"أَوَلَمۡ يَنظُرُواْ فِي مَلَكُوتِ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَمَا خَلَقَ ٱللَّهُ مِن شَيۡءٖ وَأَنۡ عَسَىٰٓ أَن يَكُونَ قَدِ ٱقۡتَرَبَ أَجَلُهُمۡۖ فَبِأَيِّ حَدِيثِۭ بَعۡدَهُۥ يُؤۡمِنُونَ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":1139,"juzNumber":9,"footnotes":"1. Gbólóhùn yìí \"Nígbà náà, “hadīth wo” ọ̀rọ̀ wo ni wọn yóò gbàgbọ́ lẹ́yìn rẹ̀?\" àti irú rẹ̀ tó wà nínú sūrah al-Mursalāt; 77:50 àti sūrah al-Jāthiyah; 45:6, àwọn kan lérò pé ó ń túmọ̀ sí pé, a ò gbọ́dọ̀ gbàgbọ́ nínú hadīth Ànábì kan kan, áḿbọ̀sìbọ́sí pé a óò máa fi ṣe ẹ̀rí ọ̀rọ̀ ẹ̀sìn. \n Èsì: Wọ́n ti dojú ìtúmọ̀ āyah náà rú mọ́ra wọn lọ́wọ́ pátápátá. Ní àkọ́kọ́ ná, ọ̀rọ̀ arọ́pò-orúkọ tó wà nínú àpólà ọ̀rọ̀-orúkọ yìí “ba‘dahu” (lẹ́yìn rẹ̀) ń dúró fún n̄ǹkan méjì. Ìkíní: Ó dúró fún “ọjọ́ ikú àti ọjọ́ Àjíǹde”. Ìkejì: Ó ń dúró fún al-Ƙur’ān alápọ̀n-ọ́nlé.\n Tí ó bá dúró fún “ọjọ́ ikú àti ọjọ́ Àjíǹde”, ìtúmọ̀ gbólóhùn “fabi ’ayyi hadīthin ba‘dahu yu’minūn” máa túmọ̀ sí pé, “ọ̀rọ̀ wo nínú ọ̀rọ̀ al-Ƙur’ān ni wọn yóò gbàgbọ́ lẹ́yìn tí ọjọ́ ikú wọn bá dé tàbí lẹ́yìn tí ọjọ́ Àjíǹde bá ṣẹlẹ̀? Bí wọ́n bá padà gba ọ̀rọ̀ al-Ƙu’ān gbọ́ lọ́jọ́ ikú wọn tàbí lọ́jọ́ Àjíǹde, kò lè wúlò fún wọn mọ́, kò sì lè rọ̀ wọ́n lọ́rọ̀ mọ́ nítorí pé, kò sí ìronúpìwàdà mọ́ tí ikú bá ti dé bá ẹ̀dá, kò sì sí ìronúpìwàdà mọ́ fún ẹ̀dá lọ́jọ́ Àjíǹde.” Èyí gan-an ni ìtúmọ̀ “fabi ’ayyi hadīthin ba‘dahu yu’minūn” nínú sūrah yìí àti nínú sūrah al-Mursalāt; 77:50 nítorí pé, ọ̀rọ̀ nípa ọjọ́ ikú ló ṣíwájú nínú āyah tí à ń tọsẹ̀ rẹ̀ lọ́wọ́ yìí . Bákan náà, ọ̀rọ̀ nípa àwọn tó pe ọjọ́ Àjíǹde nírọ́ ló ṣíwájú gbólóhùn náà nínú sūrah al-Mursalāt.\n Tí ó bá sì jẹ́ pé ọ̀rọ̀ arọ́pò-orúkọ náà ń dúró fún al-Ƙur’ān, ìtúmọ̀ gbólóhùn “fabi ’ayyi hadīthin ba‘dahu yu’minūn” máa túmọ̀ sí pé, ọ̀rọ̀ irọ́ wo ni wọn yóò gbàgbọ́ lẹ́yìn tí al-Ƙur’ān ti mú ọ̀rọ̀ òdodo wá? Ṣé àwọn ìròrí ìgbà àìmọ́kan àti àwọn àṣà àìmọ́kan èyí tí ìran ẹnì kọ̀ọ̀kan jogún bá láti ọ̀dọ̀ àwọn bàbá ńlá wọn tí wọn kì í ṣe Òjíṣẹ́ Ọlọ́hun, ṣé àwọn ìròrí wọn àti àwọn àṣà ìbọ̀rìṣà wọn ni wọn yóò máa lò lẹ́yìn al-Ƙur’ān? Èyí gan-an ni ìtúmọ̀ “fabi ’ayyi hadīthin ba‘dahu yu’minūn” nínú sūrah al-Jāthiyah; 45:6 nítorí pé gbólóhùn tó ṣíwájú rẹ̀ ní ìbẹ̀rẹ̀ āyah náà ń sọ̀rọ̀ nípa bí al-Ƙur’ān ṣe jẹ́ ọ̀rọ̀ òdodo. Èyí wá túmọ̀ sí pé, bí ènìyàn kò bá gbàgbọ́ nínú ọ̀rọ̀ òdodo al-Ƙur’ān, ọ̀rọ̀ irọ́ oríṣiríṣi l’ó máa kù ú kù tí ó máa gbàgbọ́ nínú rẹ̀. \n Nítorí náà, “fabi ’ayyi hadīthin ba‘dahu yu’minūn” kò fi ọ̀nà kan kan túmọ̀ sí pé kí á má gbàgbọ́ nínú hadīth Ànábì wa Muhammad - kí ìkẹ́ àti ọlà máa bá a -. Ẹnikẹ́ni kò wulẹ̀ lè gbọ́ àgbọ́yé al-Ƙur’ān àfi pẹ̀lú ìtọ́sọ́nà àwọn hadīth Ànábì wa Muhammad - kí ìkẹ́ àti ọlà máa bá a -. Tí ẹnì kan bá sì ṣàì gbàgbọ́ nínú àwọn hadīth Ànábì wa Muhammad tó fẹsẹ̀ rinlẹ̀, onítọ̀ún ti wọ ipò kèfèrí títí ó máa fi ronú pìwàdà.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"awalam yanẓurū fī malakūti al-samāwāti wal-arḍi wamā khalaqa al-lahu min shayin wa-an ʿasā an yakūna qadi iq'taraba ajaluhum fabi-ayyi ḥadīthin baʿdahu yu'minūna ","translations":["Do not","they look","in","(the) dominion","(of) the heavens","and the earth","and what","has (been) created","(by) Allah","of","(every)thing","and that","perhaps","[that]","has","verily","come near ","their term","So in what","statement","after this","will they believe","(185)"],"transliterationArr":["awalam","yanẓurū","fī","malakūti","al-samāwāti","wal-arḍi","wamā","khalaqa","al-lahu","min","shayin","wa-an","ʿasā","an","yakūna","qadi","iq'taraba","ajaluhum","fabi-ayyi","ḥadīthin","baʿdahu","yu'minūna",null],"verseTiming":[[1,0,800],[2,800,2530],[3,2530,3000],[4,3000,4060],[5,4060,5630],[6,5630,6680],[7,6680,7310],[8,7310,7970],[9,7970,8810],[10,8810,9600],[11,9600,11110],[12,11110,11590],[13,11590,12390],[14,12390,13430],[15,13430,15430],[16,15430,15780],[17,15780,17300],[18,17300,17710],[19,17710,18660],[20,18660,20080],[21,20080,21100],[22,21100,22500],[23,22500,24050],[24,24050,27345]]}}