{"name":"7:190","price":"Ṣùgbọ́n nígbà tí Allāhu fún àwọn méjèèjì ní ọmọ rere, wọ́n sọ (àwọn ẹ̀dá kan) di akẹgbẹ́ fún Un nípasẹ̀ ohun tí Ó fún àwọn méjèèjì. Allāhu sì ga tayọ n̄ǹkan tí wọ́n ń fi ṣẹbọ sí I.¹","arabic":"فَلَمَّآ ءَاتَىٰهُمَا صَٰلِحٗا جَعَلَا لَهُۥ شُرَكَآءَ فِيمَآ ءَاتَىٰهُمَاۚ فَتَعَٰلَى ٱللَّهُ عَمَّا يُشۡرِكُونَ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":1144,"juzNumber":9,"footnotes":"1. Ta ni ọkọ àti ìyàwó nínú āyah yìí? Kí sì ni ẹbọ tí wọ́n ṣe nípasẹ̀ ọmọ wọn? Àwọn onímọ̀-ẹ̀sìn pín sí méjì lórí ìbéèrè àkọ́kọ́. \n Igun kan nínú àwọn onímọ̀ ’Islām fi rinlẹ̀ pé Ànábì Ādam - kí ọlà Allāhu máa bá a - àti ìyá wa, Hawā’ - kí Allāhu yọ́nú sí i - ni àwọn ọkọ àti ìyàwó tí āyah náà ń tọ́ka sí ní ìbámu sí āyah 189 tó síwájú. \n Igun kejì sọ pé, bí ó tilẹ̀ jẹ́ pé āyah 189 tó síwájú ń tọ́ka sí Ànábì Ādam - kí ọlà Allāhu máa bá a - àti ìyá wa, Hawā’ - kí Allāhu yọ́nú sí i -, àwọn àrọ́mọdọ́mọ wọn ni āyah 190 ń tọ́ka sí. Wọ́n ní ìdí nìyí tí ọ̀rọ̀-ìṣe tó parí āyah 190 fi wá pẹ̀lú ẹ̀hun ọ̀pọ̀, èyí tí ó ń fi hàn pé tọkọ tìyàwó yẹn kò mọ ní ènìyàn méjì pèrè. Wọ́n fi kún un pé, ìbá jẹ́ pé Ànábì Ādam - kí ọlà Allāhu máa bá a - àti ìyá wa, Hawā’ - kí Allāhu yọ́nú sí i - ni ìṣẹ̀lẹ̀ náà ṣẹlẹ̀ sí ni, ẹ̀hun èjì tí ó máa dúró fún ọ̀wọ́ àwọn méjèèjì nìkan ni kò bá parí āyah náà gẹ́gẹ́ bí ọ̀rọ̀ náà ṣe bẹ̀rẹ̀ pẹ̀lú rẹ̀ nínú āyah 189 tó ṣíwájú. \n Ẹbọ tí wọ́n ṣe nípasẹ̀ ọmọ wọn ni sísọ ọmọ náà ni orúkọ tí ó fi àìmoore hàn sí Allāhu. Bí àpẹ̀ẹrẹ, kí Allāhu fún ènìyàn lọ́mọ, kí ènìyàn wá sọ ọmọ náà ni “ ‘abdu-ṣṣams, ‘abdul-ƙọmọr” dípò “ ‘abdullāh, ‘abdur-Rahmọ̄n” àti bẹ́ẹ̀ bẹ́ẹ̀ lọ. \n Wàyí, wọ́n ṣe àfitì ìtàn kan sí ọ̀dọ̀ ọmọ ‘Abbās - kí Allāhu yọ́nú sí àwọn méjèèjì -. Ìtàn náà wà nínú àwọn tírà tafsīr kan, bí ó tilẹ̀ jẹ́ pé Ibn Kathīr ka ìtàn náà mọ́ ara ìtàn irọ́ àwọn ọmọ Isrọ̄’īl. Àmọ́ ìtàn tí ẹnu kùn yìí kúkú ni àwọn tí wọ́n gbà pé Ànábì Ādam àti ìyá wa Hawā’ ni tọkọ tìyàwó tí ìṣẹ̀lẹ̀ náà ṣẹlẹ̀ sí rí mú lò láti fi túmọ̀ = = āyah náà. Kókó ìtàn náà ni pé, nígbà tí ìyá wa Hawā’ - kí Allāhu yọ́nú sí i - lóyún, Èṣù wá ba á ní àwòrán ènìyàn, ó sì sọ fún un pé, “Tí kò bá fẹ́ bí àwòrán ẹranko lọ́mọ tàbí tí kò bá fẹ́ kí ọmọ náà kú ní òpóǹló, kí ó sọ ọmọ náà ní “ ‘abdul-hārith”. Hawā’ - kí Allāhu yọ́nú sí i - kò dá a lóhùn, kò sì tẹ̀lé àṣẹ rẹ̀. Ó bí ọmọ. Ọmọ náà sì kú. Ó tún ṣẹlẹ̀ bẹ́ẹ̀ nígbà kejì. Àmọ́ nígbà tí ó lóyún ìkẹta, kò fẹ́ kí ó kú. Wọ́n sì sọ ọmọ náà ní “ ‘abdul-hārith”! Èyí ni Allāhu - Ọba tó ga jùlọ - pè ní ẹbọ nítorí pé, wọ́n tẹ̀lé àṣẹ tó yapa sí àṣẹ Allāhu pé wọn kò gbọ́dọ̀ tẹ̀lé ọ̀rọ̀ Èṣù. Kì í ṣe pé wọ́n gbé ẹbọ fún Èṣù láti fi wá ààbò fún ọmọ náà. Láti ìgbà náà ló ti di èèwọ̀ pọ́nńbélé nínú ìlànà ìsọmọlórúkọ láti ṣe àfitì “ẹrú” sí ọ̀dọ̀ ẹlòmíìràn lẹ́yìn Allāhu. Ànábì Ādam - kí ọlà Allāhu máa bá a - àti ìyá wa Hawā’ - kí Allāhu yọ́nú sí i - sì tọrọ àforíjìn lọ́dọ̀ Allāhu lórí bí àwọn méjèèjì ṣe tẹ̀lé àṣẹ Èṣù níbi sísọ ọmọ wọn ní orúkọ tí Èṣù mú wá fún wọn, kì í ṣe pé wọ́n bímọ tán wọ́n wá ń bọ Èṣù bí àwọn kan ṣe máa ń bọ ìbejì. Allāhu sì tẹ́wọ́ gba ìronùpìwàdà wọn. \n Tí àwọn nasọ̄rọ̄ bá wá tàbùkù Ànábì Ādam - kí ọlà Allāhu máa bá a - àti ìyá wa Hawā’ nípa èyí, ṣebí wọ́n sọ pé, Ànábì 'Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - tẹ̀lé àṣẹ Èṣù ni Èṣù fi rí òun náà mú lọ káàkiri láti dán olúwa wọn wò! Ànábì 'Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - kúkú tẹ̀lé àṣẹ Èsù nínú àwọn ìwé wọn, àmọ́ kò forí balẹ̀ fún Èṣù rárá. Ìyẹn wà nínú ìwé Luku 4: 1-13. Nítorí náà, Allāhu nìkan ṣoṣo ni kò lè ṣàṣìṣe.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"falammā ātāhumā ṣāliḥan jaʿalā lahu shurakāa fīmā ātāhumā fataʿālā al-lahu ʿammā yush'rikūna ","translations":["But when","He gives them","a good, (child)","they make","for Him","partners","in what","He has given them","But exalted","(is) Allah","above what","they associate (with Him)","(190)"],"transliterationArr":["falammā","ātāhumā","ṣāliḥan","jaʿalā","lahu","shurakāa","fīmā","ātāhumā","fataʿālā","al-lahu","ʿammā","yush'rikūna",null],"verseTiming":[[1,0,2930],[2,2930,4360],[3,4360,6350],[4,6350,7260],[5,7260,7850],[6,7850,10430],[7,10430,12790],[8,12790,14340],[9,14340,15850],[10,15850,16700],[11,16700,18290],[12,18290,21925]]}}