{"name":"7:23","price":"Àwọn méjèèjì sọ pé: “Olúwa wa, a ti ṣàbòsí sí ẹ̀mí wa. Tí O ò bá foríjìn wá, kí O sì kẹ́ wa, dájúdájú a máa wà nínú àwọn ẹni òfò.” ¹","arabic":"قَالَا رَبَّنَا ظَلَمۡنَآ أَنفُسَنَا وَإِن لَّمۡ تَغۡفِرۡ لَنَا وَتَرۡحَمۡنَا لَنَكُونَنَّ مِنَ ٱلۡخَٰسِرِينَ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":977,"juzNumber":8,"footnotes":"1. Láti āyah 19 sí 24 nínú sūrah yìí, Allāhu - tó ga jùlọ - sọ nípa ìṣẹ̀lẹ̀ tó ṣẹlẹ̀ sí bàbá ńlá wa Ànábì Ādam - kí ọlà Allāhu máa bá a - àti ìyá ńlá wa, Hawā’ - kí Allāhu yọ́nú sí i - nípa bí àwọn méjèèjì ṣe jẹ èso igi tí Allāhu kọ̀ fún wọn láti jẹ. Ó tún wà nínú sūrah al-Baƙọrah; 2:35 - 39 àti sūrah Tọ̄hā; 20:120 - 123. Ìṣẹ̀lẹ̀ náà jẹ́ ọ̀kan nínú àwọn okùnfà ìṣìnà fún gbogbo àwọn nasọ̄rọ̄ pátápátá tó bẹ́ẹ̀ gẹ́ tí ìgbàgbọ́ wọn fi forí sánpọ́n láti ìpìlẹ̀. Allāhu - tó ga jùlọ - kò kúkú ṣàdédé pe àwọn nasọ̄rọ̄ ní olùṣìnà nínú sūrah al-Fātihah, Allāhu kò sì ṣàdédé kọ̀ fún àwa mùsùlùmí láti mú wọn ní ọ̀rẹ́, tí kì í bá ṣe pé ìgbàgbọ́ wọn dúró sórí àwọn ìṣìnà gban̄kọgban̄kọ méje kan. \n Ìkíní: àwọn nasọ̄rọ̄ di olùṣìnà bẹ̀rẹ̀ láti ara sísọ pé gbogbo àwọn ọmọ Ànábì Ādam jogún ègún ẹ̀ṣẹ̀ èso tí Ànábì Ādam jẹ láti ọjọ́ ìbí ẹnì kọ̀ọ̀kan wọn.\n Ìkejì: àwọn nasọ̄rọ̄ di olùṣìnà nípa bí wọ́n ṣe gbàgbọ́ pé wọ́n kan Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - mọ́ igi àgbélébùú. Allāhu - tó ga jùlọ - sì sọ pé “wọn kò pa á, wọn kò sì kàn án mọ́ àgbélébùú…” ní ìbámu sí sūrah an-Nisā'; 4:157 - 158.\n Ìkẹta; àwọn nasọ̄rọ̄ di olùṣìnà nípa bí wọ́n ṣe gbàgbọ́ pé ìgbàlà wà nínú ẹ̀jẹ̀ Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - lórí igi àgbélébùú àti pé ó fi ẹ̀jẹ̀ rẹ̀ ṣe ìràpadà fún àwọn àrọ́mọdọ́mọ Ànábì Ādam tí wọ́n di ẹlẹ́ṣẹ̀ nípasẹ̀ ègún ẹ̀ṣẹ̀ èso tí òun àti ìyàwó rẹ̀ jẹ, gẹ́gẹ́ bí wọ́n tún ṣe gbàgbọ́ pé ẹ̀jẹ̀ Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - lórí igi àgbélébùú ti pa àwọn ẹ̀ṣẹ̀ mìíràn rẹ́ fún gbogbo àwọn tó gbàgbọ́ nínú Ànábì ‘Īsā. Allāhu sì sọ pé ẹlẹ́rù-ẹ̀ṣẹ̀ kan kò níí ru ẹrù-ẹ̀ṣẹ̀ ẹlòmìíràn mọ́ tirẹ̀ ní ìbámu sí sūrah Fātir; 35:18.\n Ìkẹrin; àwọn nasọ̄rọ̄ di olùṣìnà nípa bí wọ́n ṣe sọ Ànábì ‘Īsā ọmọ Mọryam àti ìyá rẹ̀ di ọlọ́hun tí wọ́n ń jọ́sìn fún nítorí pé, wọ́n gbàgbọ́ pé ìkíní kejì wọn nìkan ni kò ní ègún ẹ̀ṣẹ̀ èso jíjẹ lọ́rùn àti pé wọ́n tún gbàgbọ́ pé, ìkíní kejì wọn ni kò dá ẹ̀ṣẹ̀ mìíràn rí. Allāhu sì sọ pé kò sí ọlọ́hun kan tí a gbọ́dọ̀ jọ́sìn fún ní ọ̀nà òdodo àyàfi Òun. \n Ìkarùn-ún; àwọn nasọ̄rọ̄ di olùṣìnà nípa bí wọ́n ṣe sọ ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - di ọmọ Ọlọ́hun. Allāhu sì sọ pé Òun kò bímọ, Òun kò sì fi ẹnì kan kan ṣọmọ. \n Ìkẹfà: àwọn nasọ̄rọ̄ di olùṣìnà nípa bí wọ́n ṣe ń ṣe ẹ̀yàmẹ̀yà láààrin àwọn Ànábì Ọlọ́hun àti àwọn Òjíṣẹ́ Rẹ̀ tó bẹ́ẹ̀ gẹ́ tí wọ́n fi ṣàì gbàgbọ́ nínú Ànábì wa Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá gbogbo wọn -, tí wọ́n sì ń fi ẹnu àbùkù tó lágbára kàn òun pẹ̀lú = = àwọn Ànábì àti Òjíṣẹ́ mìíràn tí Allāhu rán níṣẹ́ sáyé. Allāhu - tó ga jùlọ - sì sọ pé àwọn tó ń ṣẹ̀yàmẹ̀yà láààrin àwọn Ànábì àti Òjíṣẹ́ ni ojúlówó aláìgbàgbọ́ ní ìbámu sí sūrah an-Nisā'; 4:150 - 152.\n Ìkeje: àwọn nasọ̄rọ̄ di olùṣìnà nípasẹ̀ bí wọ́n ṣe ń tọwọ́bọ tírà tí Allāhu fún Ànábì Mūsā - kí ọlà Allāhu máa bá a - àti tírà tí Allāhu fún Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - lójú, tó bẹ́ẹ̀ gẹ́ tí oríṣiríṣi tírà méjèèjì náà fi pọ̀ lórí igbá, tí wọn kò sì yé yí wọn padà sí ìfẹ́-inú wọn lórúkọ “àtúnṣe” látìgbàdégbà. Allāhu sì sọ pé ègbé ni fún àwọn tó ń fi ọwọ́ ara wọn kọ tírà lẹ́yìn náà tí wọ́n ń wí pé, ó wá láti ọ̀dọ̀ Ọlọ́hun, ní ìbámu sí sūrah āl-'Imrọ̄n; 3:78. \n Wàyí nípa ìṣìnà àwọn nasọ̄rọ̄ lórí èso tí Ànábì Ādam àti Hawā’ jẹ, kókó mẹ́fà wọ̀nyí ni òdodo nípa ìṣẹ̀lẹ̀ náà. \n Kókó kìíní: Bàbá ńlá wa Ànábì Ādam - kí ọlà Allāhu máa bá a - àti ìyá ńlá wa, Hawā’ - kí Allāhu yọ́nú sí i - jẹ èso igi náà. Jíjẹ rẹ̀ sì jẹ́ ẹ̀ṣẹ̀ lọ́rùn àwọn méjèèjì nìkan, kò sí ẹ̀ṣẹ̀ èso jíjẹ lọ́rùn àwọn ọmọ wọn kan kan. \n Kókó kejì: Àwọn méjèèjì tọrọ àforíjìn lórí àṣìṣe náà, Allāhu sì foríjìn àwọn méjèèjì. Èyí wà ní ìbámu sí sūrah al-Baƙọrah; 2:37 àti sūrah al-’A‘rọ̄f; 7:19 - 23. \n Kókó kẹta: Allāhu ti foríjìn àwọn méjèèjì pátápátá ṣíwájú kí àwọn méjèèjì tó ṣọ̀kalẹ̀ sórí ilẹ̀ ayé ní ìbámu sí sūrah Tọ̄hā; 20:120 - 123. Kókó kẹrin: Ìsọ̀kalẹ̀ àwọn méjèèjì sórí ilẹ̀ ayé yìí wá sí ìmúṣẹ nípasẹ̀ àsọtẹ́lẹ̀ Allāhu pé Òun fẹ́ dá àrólé kan sórí ilẹ̀ ayé, kì í ṣe sínú Ọgbà Ìdẹ̀ra ní ìbámu sí sūrah al-Baƙọrah; 2:30. \n Kókó karùn-ún: Kò sí ẹnì kan kan tó jogún ègún ẹ̀ṣẹ̀ èso jíjẹ náà láti ara àwọn méjèèjì nítorí pé, Allāhu ti foríjìn àwọn méjèèjì pátápátá. \n Kókó kẹfà: Àdámọ́ tí Allāhu dámọ́ ìṣẹ̀dá Ànábì Ādam - kí ọlà Allāhu máa bá a - nìkan ṣoṣo ni àwọn ọmọ rẹ̀ jogún pẹ̀lú ìṣẹ̀lẹ̀ náà nítorí pé, Allāhu ti fi àdámọ́ ìtẹ̀lé-àṣẹ àti ìyapa àṣẹ sínú ìṣẹ̀dá wa láti ara Ànábì Ādam - kí ọlà Allāhu máa bá a -. Àdámọ́ méjèèjì náà sì ti wà lára Ànábì Ādam láti ọjọ́ ìṣẹ̀dá rẹ̀ àti ṣíwájú ọjọ́ tí ó jẹ èso. Nítorí náà, tí a bá tẹ̀lé àṣẹ Allāhu, a fi jọ Ànábì Ādam ni - kí ọlà Allāhu máa bá a -. Tí a bá yapa àṣẹ Allāhu, a fi jọ Ànábì Ādam ni - kí ọlà Allāhu máa bá a -. Tí a bá ronú pìwàdà sọ́dọ̀ Allāhu lẹ́yìn ìyapa àṣẹ Rẹ̀, tí a sì tọrọ àforínjìn lọ́dọ̀ Rẹ̀, a fi jọ Ànábì Ādam ni - kí ọlà Allāhu máa bá a -. Tí a bá lo ìkápá tí Allāhu fún wa láti lè tẹ̀lé àṣẹ Rẹ̀, a fi jọ Ànábì Ādam ni - kí ọlà Allāhu máa bá a -. Tí a bá sì lo ìkápá tí Allāhu fún wa láti tẹ̀lé ìfẹ́-inú wa, a fi jọ Ànábì Ādam ni - kí ọlà Allāhu máa bá a -. Àmọ́ tí a bá kùnà láti ronú pìwàdà lórí ìyapa àṣẹ Allāhu, tí a ò sì tọrọ àforíjìn lọ́dọ̀ Allāhu, kì í ṣe Ànábì Ādam - kí ọlà Allāhu máa bá a - l’a fi jọ.\n Nítorí náà, ìyàtọ̀ wà láààrin sísọ pé a jogún ègún ẹ̀ṣẹ̀ èso láti ara Ànábì Ādam - kí ọlà Allāhu máa bá a - àti sísọ pé a jogún àwọn àdámọ́ ìyapa àṣẹ àti ìtọrọ-àforíjìn láti ara Ànábì Ādam - kí ọlà Allāhu máa bá a -. Ní ti jíjẹ ogún ègún ẹ̀ṣẹ̀ èso tí Ànábì Ādam - kí ọlà Allāhu máa bá a - jẹ, ìyẹn ń fi dídi ẹrù ẹ̀ṣẹ̀ ẹlẹ́ṣẹ̀ ru ẹlòmíìràn rinlẹ̀. Àbòsì ńlá sì nìyẹn. Allāhu kì í sì ṣe Ọba alábòsí. Ní ti jíjẹ ogún àdámọ́ ìyapa àṣẹ àti ìtọrọ-àforíjìn láti ara Ànábì Ādam, ìyẹn ń fi dídi ẹrù ẹ̀ṣẹ̀ ru ẹlẹ́ṣẹ̀ lọ́rùn. Déédé àti dọ́gba sì nìyẹn. Allāhu sì ni Ọba Onídéédé. \n Síwájú sí i, lára ohun tó ń ṣàfi hàn ìṣìnà àwọn nasọ̄rọ̄ lórí èso tí Ànábì Ādam - kí ọlà Allāhu máa bá a - jẹ, tí wọ́n sì sọ gbogbo ọmọ rẹ̀ di ẹlẹ́ṣẹ̀ èso nípasẹ̀ rẹ̀, òhun ni pé: \n Àwọn ìjọ tí Allāhu parẹ́ ṣíwájú Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a -, ṣé nítorí ẹ̀ṣẹ̀ èso tí Ādam àti ìyàwó rẹ̀ jẹ ni tàbí nítorí ẹ̀ṣẹ̀ mìíràn tí àwọn ènìyàn wọ̀nyẹn dá lẹ́ṣẹ̀? Allāhu kò pa ìjọ kan run rí bí kò ṣe nítorí ẹ̀ṣẹ̀ ọwọ́ wọn. \n Bákan náà, àwọn ọmọ wẹẹrẹ tí kò ì bàlágà, kò sí ẹ̀ṣẹ̀ kan kan lọ́rùn wọn títí wọ́n fi máa bàlágà. Ẹ̀ṣẹ̀ tí wọ́n bá dá nígbà náà nìkan ni ẹ̀ṣẹ̀ tí ó máa wà lọ́rùn wọn. Nítorí náà, kò sí ègún kan kan lórí àwọn ọmọ Ànábì Ādam nípasẹ̀ ẹ̀ṣẹ̀ èso tí Ànábì Ādam - kí ọlà Allāhu máa bá a - jẹ. \n Bákan náà, kò sí ẹni tí kò dá ẹ̀ṣẹ̀ tara tirẹ̀ rí nínú gbogbo àwọn Ànábì àti àwọn Òjíṣẹ́ Ọlọ́hun, kódà tó fi mọ́ Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - nítorí pé, ọmọ ènìyàn ni, kì í ṣe ọmọ Ọlọ́hun. Àrọ́mọdọ́mọ Ànábì Ādam ni ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a -, kò ṣàì jogún àwọn àdámọ́ lára Ànábì Ādam - kí ọlà Allāhu máa bá a -. Bí ó tilẹ̀ jẹ́ pé al-Ƙur’ān kò sí fún kíka ẹ̀ṣẹ̀ sí àwọn Ànábì àti àwọn Òjíṣẹ́ lọ́rùn - ṣebí ẹni ẹ̀ṣà jùlọ ni gbogbo wọn, - ọ̀wọ́ ohun tí Allāhu bá sọ fún wa nípa wọn nìkan l’ó kúkú kàn wá jùlọ nínú ọ̀rọ̀ wọn. Tí a ò bá rí ẹ̀ṣẹ̀ kan kan nípa ti Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a – kà nínú al-Ƙur’ān, kò túmọ̀ sí pé òun náà kò dá ẹ̀ṣẹ̀ kan kan rí. Ṣebí a ò rí ẹ̀ṣẹ̀ kan kan kà nínú al-Ƙur’ān nípa àwọn Ànábì mìíràn, gẹ́gẹ́ bí Ànábì Lūt, Ànábì Sọ̄lih, Ànábì Ṣu‘aeb, Ànábì Ya‘ƙūb, Ànábì ’Ishāƙ, Ànábì ’Ismọ‘īl, Ànábì Yahyā, Ànábì Yūṣa‘u àti bẹ́ẹ̀ bẹ́ẹ̀ lọ (aleehim salām). \n Bákan náà, èyí kò túmọ̀ sí pé wọn kò jogún àwọn àdámọ́ òkè wọ̀nyẹn lára Ànábì Ādam - kí ọlà Allāhu máa bá a -, bẹ́ẹ̀ sì ni pé, àìrí ẹ̀ṣẹ̀ kan kan kà nípa wọn kò sọ wọ́n di olúwa àti olùgbàlà. Kíyè sí i, ẹ̀dá Ọlọ́hun kúkú ni àwọn mọlā’ika, àmọ́ kò sí àdámọ́ ẹ̀ṣẹ̀ dídá nínú ìṣẹ̀dá tiwọn. Tòhun ti bẹ́ẹ̀ náà, ìyẹn kò sọ ẹnikẹ́ni nínú wọn di olúwa àti olùgbàlà, yálà mọlāika Jibrīl, ẹni tí àlàjẹ́ rẹ̀ ń jẹ́ “Ẹ̀mí Mímọ́” tàbí mọlāika mìíràn. \n Nítorí náà, olùtàbùkù Ànábì Ādam ni ẹni tí ó bá ń sọ pé àwa ọmọ rẹ̀ jogún ègún ẹ̀ṣẹ̀ èso tó jẹ lára rẹ̀. Irú ẹni náà kì í ṣọmọ rere. W-Allāhu ’a‘lam.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"qālā rabbanā ẓalamnā anfusanā wa-in lam taghfir lanā watarḥamnā lanakūnanna mina al-khāsirīna ","translations":["Both of them said","Our Lord","we have wronged","ourselves","and if","not","You forgive","[for] us","and have mercy (on) us","surely, we will be","among","the losers","(23)"],"transliterationArr":["qālā","rabbanā","ẓalamnā","anfusanā","wa-in","lam","taghfir","lanā","watarḥamnā","lanakūnanna","mina","al-khāsirīna",null],"verseTiming":[[1,0,1130],[2,1130,2250],[3,2250,3410],[4,3410,5020],[5,5020,7310],[6,7310,7780],[7,7780,8360],[8,8360,9280],[9,9280,10060],[10,10060,11560],[11,11560,14110],[12,14110,14460],[13,14460,17635]]}}