{"name":"7:3","price":"Ẹ tẹ̀lé ohun tí wọ́n sọ̀kalẹ̀ fún yín láti ọ̀dọ̀ Olúwa yín. Kí ẹ sì má ṣe tẹ̀lé àwọn wòlíì¹ (èṣù àti òrìṣà) lẹ́yìn Rẹ̀. Díẹ̀ l’ẹ̀ ń lò nínú ìrántí.","arabic":"ٱتَّبِعُواْ مَآ أُنزِلَ إِلَيۡكُم مِّن رَّبِّكُمۡ وَلَا تَتَّبِعُواْ مِن دُونِهِۦٓ أَوۡلِيَآءَۗ قَلِيلٗا مَّا تَذَكَّرُونَ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":957,"juzNumber":8,"footnotes":"1. Wòlíì túmọ̀ sí alásùn-únmọ́, aláfẹ̀yìntì, ọ̀rẹ́ àti aláàbò. Ohun tí āyah yìí ń sọ ni pé, kí á tẹ̀lé ohun tí Allāhu sọ̀kalẹ̀. Ohun tí Allāhu sọ̀kalẹ̀ sì ni pé, ẹ tẹ̀lé Allāhu, ẹ tẹ̀lé Òjíṣẹ́ Rẹ̀ - kí ìkẹ́ àti ọlà Allāhu máa bá a -. Èèwọ̀ sì ni kí á tẹ̀lé ẹnikẹ́ni tí ó máa mú wa yapa sí àṣẹ Allāhu àti àṣẹ Òjíṣẹ́ Rẹ̀. Ní ọ̀pọ̀ ìgbà sì ni pé, “wòlìí” ni àwọn olùṣìnà aṣinilọ́nà máa ń pe ara wọn. Ìdí nìyí tí “wòlíì” fi jẹyọ nínú āyah yìí. \n Gbogbo ayé sì pín sí oríṣi wòlíì méjì. Wòlíì Ọlọ́hun àti wòlíì Èṣù. Wòlíì Ọlọ́hun ni ẹni Ọlọ́hun, alásùn-únmọ́ Ọlọ́hun, ọ̀rẹ́ Ọlọ́hun. Wòlíì Èṣù ni ẹni Èṣù, alásùn-únmọ́ Èṣù, ọ̀rẹ́ Èṣù.\n Āyah nípa àwọn wòlíì Ọlọ́hun ni sūrah al-’Anfāl; 8:34 àti sūrah Yūnus; 10:62 - 64. Āyah nípa àwọn wòlíì Èṣù ni āyah tí à ń tọsẹ̀ rẹ̀ lọ́wọ́ yìí, àti sūrah Ṣūrọ̄; 42:6 àti sūrah an-Nisā’; 4:76.\n Bí a bá lọ ka gbogbo àwọn āyah wọ̀nyẹn, a óò rí i pé, ẹnì kan kò lè jẹ́ wòlìí Ọlọ́hun àfi mùsùlùmí onígbàgbọ́ òdodo. Ẹnì kan kò sì lè jẹ́ wòlíì Èṣù àfi onibid‘ah, kèfèrí àti ọ̀ṣẹbọ. \n Kíyè sí i, pípe ẹnì kan ní “wòlíì Ọlọ́hun” nínú ìlànà àwọn onisūfī jẹ́ ọ̀nà kan pàtàkì láti sọ onítọ̀ún di “wòlíì Èṣù” nítorí pé, àwọn wòlíì onisūfī máa ń sọra wọn di àwọn Èṣù àti Tọ̄gūt fún àwọn murīdī wọn ni. Ìdí sì nìyí tí wòlíì onisūfī fi máa ń fi àwọn bid‘ah lọ́lẹ̀.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"ittabiʿū mā unzila ilaykum min rabbikum walā tattabiʿū min dūnihi awliyāa qalīlan mā tadhakkarūna ","translations":["Follow","what","has been revealed","to you","from","your Lord","and (do) not","follow","from","beside Him","any allies","Little","(is) what","you remember","(3)"],"transliterationArr":["ittabiʿū","mā","unzila","ilaykum","min","rabbikum","walā","tattabiʿū","min","dūnihi","awliyāa","qalīlan","mā","tadhakkarūna",null],"verseTiming":[[1,0,1310],[2,1310,3190],[3,3190,4750],[4,4750,5680],[5,5680,6510],[6,6510,7850],[7,7850,8470],[8,8470,9780],[9,9780,10310],[10,10310,11060],[11,11060,13390],[12,13390,16530],[13,16530,18020],[14,18020,19400],[15,19400,23275]]}}