{"name":"7:43","price":"A ó sì mú inúnibíni kúrò nínú ọkàn wọn. Àwọn odò yó sì máa ṣàn ní ìsàlẹ̀ wọn. Wọn yóò sọ pé: “Gbogbo ẹyìn ń jẹ́ ti Allāhu,¹ Ẹni tí Ó fi wá mọ̀nà yìí. Àwa ìbá tí mọ̀nà, tí kì í bá ṣe pé Allāhu tọ́ wa sí ọ̀nà. Dájúdájú àwọn Òjíṣẹ́ Olúwa wa ti mú òdodo wá.” Wọ́n sì máa pè wọ́n pé: “Ìyẹn ni Ọgbà Ìdẹ̀ra tí A jogún rẹ̀ fún yín nítorí ohun tí ẹ̀ ń ṣe níṣẹ́.”²","arabic":"وَنَزَعۡنَا مَا فِي صُدُورِهِم مِّنۡ غِلّٖ تَجۡرِي مِن تَحۡتِهِمُ ٱلۡأَنۡهَٰرُۖ وَقَالُواْ ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِي هَدَىٰنَا لِهَٰذَا وَمَا كُنَّا لِنَهۡتَدِيَ لَوۡلَآ أَنۡ هَدَىٰنَا ٱللَّهُۖ لَقَدۡ جَآءَتۡ رُسُلُ رَبِّنَا بِٱلۡحَقِّۖ وَنُودُوٓاْ أَن تِلۡكُمُ ٱلۡجَنَّةُ أُورِثۡتُمُوهَا بِمَا كُنتُمۡ تَعۡمَلُونَ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":997,"juzNumber":8,"footnotes":"Ẹ wo ìtọsẹ̀-ọ̀rọ̀ sūrah al-Fātihah;1:2.\n عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَنْ يُنَجِّيَ أَحَدًا مِنْكُمْ عَمَلُهُ قَالُوا وَلَا أَنْتَ يَا رَسُولَ اللَّهِ قَالَ وَلَا أَنَا إِلَّا أَنْ يَتَغَمَّدَنِي اللَّهُ بِرَحْمَةٍ.\n Láti ọ̀dọ̀ bàbá Huraerah - kí Allāhu yọ́nú sí i -, ó sọ pé, Òjíṣẹ́ Allāhu - kí ìkẹ́ àti ọlà Allāhu máa bá a - sọ pé, “Iṣẹ́ ẹnì kan kan nínú yín kò lè là á (kò lè mú un rí ìgbàlà níbi Iná).” Wọ́n sọ pé, “Àti ìwọ náà, Òjíṣẹ́ Allāhu?” Ó sọ pé, “Àti èmi náà àfi kí Allāhu fi àánú bò mí ní àṣírí. (Bukọ̄riy) \n Kíyè sí i, àwọn kan lérò pé, hadīth yìí tako āyah yìí àti irú rẹ̀. Kódà àwọn kan sọ pé, hadīth yìí kò ní àlàáfíà. Àwọn kan wulẹ̀ sọ pé, “Nítorí irú hadīth yìí ni àwọn kò fi gba àwọn hadīth wọlé.” \n Ní àkọ́kọ́ ná, kò sí ìtakora kan kan láààrin āyah àti hadīth yìí. Àlàyé tí ó wà lórí rẹ̀ ni pé, kódà kí ẹ̀dá sin Allāhu - tó ga jùlọ - = \n = fún gbogbo ìṣẹ̀mí ayé rẹ̀, ó gbọ́dọ̀ mọ̀ dájú pé, kò lè mú Allāhu pẹ̀lú ipá láti gba iṣẹ́ náà. Gbígbà tí Allāhu bá gba iṣẹ́ ẹ̀dá nígbà náà kò jẹ́ kiní kan bí kò ṣe àánú Rẹ̀. Ẹni tí Allāhu bá ṣíjú àánú Rẹ̀ wo lórí iṣẹ́ rẹ̀ ni iṣẹ́ rẹ̀ máa là á níbi ìyà Iná. Ẹni tí Allāhu bá kọ iṣẹ́ rẹ̀ lé lọ́wọ́, iṣẹ́ náà ti di iṣẹ́ òfò. Ìdí nìyí tí àwọn Ànábì fi máa ń tọrọ pé “Allāhu, gbà á lọ́wọ́ wa”. \n Síwájú sí i, dípò kí àwọn ènìyàn ṣọra wọn, kí wọ́n sì jìnnà tefétefé sí iṣẹ́ tí kò bá òfin ẹ̀sìn mu, àìmọ̀kan ara wọn tún ń tì wọ́n lọ síbi pípe hadīth tó ní àlàáfíà parí ní hadīth tí kò ní àlàáfíà. Níwọ̀n ìgbà tí hadīth bá ti wà nínú Sọhīhul-Bukọ̄riy tàbí Sọhīhu Muslim, ó gbọ́dọ̀ ní àlàáfíà. Àgbọ́yé rẹ̀ nìkan ló kù wá kù.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"wanazaʿnā mā fī ṣudūrihim min ghillin tajrī min taḥtihimu al-anhāru waqālū al-ḥamdu lillahi alladhī hadānā lihādhā wamā kunnā linahtadiya lawlā an hadānā al-lahu laqad jāat rusulu rabbinā bil-ḥaqi wanūdū an til'kumu al-janatu ūrith'tumūhā bimā kuntum taʿmalūna ","translations":["And We will remove","whatever","(is) in","their breasts","of","malice","Flows","from","underneath them","the rivers","And they will say","All the praise","(is) for Allah","the One Who","guided us","to this","and not","we were","to receive guidance","if not","[that]","(had) guided us","Allah","Certainly","came","Messengers","(of) our Lord","with the truth","And they will be addressed","[that]","This","(is) Paradise","you have been made to inherit it","for what","you used to","do","(43)"],"transliterationArr":["wanazaʿnā","mā","fī","ṣudūrihim","min","ghillin","tajrī","min","taḥtihimu","al-anhāru","waqālū","al-ḥamdu","lillahi","alladhī","hadānā","lihādhā","wamā","kunnā","linahtadiya","lawlā","an","hadānā","al-lahu","laqad","jāat","rusulu","rabbinā","bil-ḥaqi","wanūdū","an","til'kumu","al-janatu","ūrith'tumūhā","bimā","kuntum","taʿmalūna",null],"verseTiming":[[1,0,1350],[2,1350,1720],[3,1720,2090],[4,2090,3380],[5,3380,4490],[6,4490,5530],[7,5530,6900],[8,6900,8030],[9,8030,9010],[10,9010,12500],[11,12500,13400],[12,13400,14230],[13,14230,15330],[14,15330,16200],[15,16200,17250],[16,17250,18370],[17,18370,19030],[18,19030,20660],[19,20660,22060],[20,22060,22840],[21,22840,24540],[22,24540,25310],[23,25310,28560],[24,28560,29170],[25,29170,31640],[26,31640,32320],[27,32320,33350],[28,33350,34780],[29,34780,37470],[30,37470,38490],[31,38490,39400],[32,39400,41520],[33,41520,43300],[34,43300,43940],[35,43940,45590],[36,45590,48755]]}}