{"name":"94:3","price":"èyí tí ó wọ̀ ọ́ lọ́rùn.¹","arabic":"ٱلَّذِيٓ أَنقَضَ ظَهۡرَكَ","category":["94 (Ash-Sharh)","Ash-Sharh","Surah Ash-Sharh","Chapter Ash-Sharh","Sharh","Surah Sharh","Chapter Sharh","Ash Sharh","Surah Ash Sharh","Chapter Ash Sharh","Surah 94","Chapter 94","The Relief","الشرح"],"ayahNumber":6093,"juzNumber":30,"footnotes":"1. Bí ó tilẹ̀ jẹ́ pé Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - kò ṣẹbọ rí ṣíwájú kí ó tó di Òjíṣẹ́ Allāhu, ọ̀kan nínú ohun tí ó máa ń kọ Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - lóminú, tí ó sì máa ń bà á nínú jẹ́ ni àìdá ìgbàgbọ́ òdodo mọ̀ àti àìní ìlànà ìjọ́sìn kan lọ́wọ́ ṣíwájú ogójì ọdún tí ó kọ́kọ́ lò. \n Ní òdodo ni pé, Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - ní orúkọ rere gẹ́gẹ́ bí olóòótọ́ àti olùfọkàntán láààrin àwọn Lárúbáwá ṣíwájú kí Allāhu tó gbé e dìde ní Òjíṣẹ́ Rẹ̀, àmọ́ ńṣe ni ìṣẹ̀mí ayé ìgbà-àìmọ̀kan àkọ́kọ́ nínú ìlú Mọkkah máa ń bà á nínú jẹ́ gan-an. Ìdí nìyí tí Allāhu ṣe ń fún un ní ìró ìdùnnú pé kò sí ẹ̀ṣẹ̀ ìgbà-àìmọ̀kan ní ọrùn rẹ̀ mọ́ - kí ìkẹ́ àti ọlà Allāhu máa bá a -. \n Àti pé Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - kàn wulẹ̀ ń banújẹ́ lórí ìgbà-àìmọ̀kan, èyí tí ìdàjọ́ rẹ̀ jẹ́ pé tí ó bá ṣẹlẹ̀ bẹ́ẹ̀ sí ẹnikẹ́ni, àmọ́ tí onítọ̀ún padà gba ’Islām, ìbáà jẹ́ pé ó gbà á ní òwúrọ̀, ó sì jáde kúrò láyé ní ọ̀sán ọjọ́ náà, bí ó tilẹ̀ wù kí ẹrù ẹ̀ṣẹ̀ rẹ̀ wúwo tó, gbogbo ẹ̀ṣẹ̀ náà ti di ohun tí wọ́n ti ṣàforíjìn rẹ̀ fún un pátápátá. Èyí wà ní ìbámu sí sūrah an-Nisā’; 4:17-18.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"alladhī anqaḍa ẓahraka ","translations":["Which","weighed upon","your back","(3)"],"transliterationArr":["alladhī","anqaḍa","ẓahraka",null],"verseTiming":[[1,0,2700],[2,2700,4140],[3,4140,5465]]}}