{"name":"9:1","price":"(Èyí ni) ìyọwọ́-yọsẹ̀ láti ọ̀dọ̀ Allāhu àti Òjíṣẹ́ Rẹ̀ sí àwọn tí ẹ ṣe àdéhùn fún nínú àwọn ọ̀ṣẹbọ.","arabic":"بَرَآءَةٞ مِّنَ ٱللَّهِ وَرَسُولِهِۦٓ إِلَى ٱلَّذِينَ عَٰهَدتُّم مِّنَ ٱلۡمُشۡرِكِينَ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1236,"juzNumber":10,"footnotes":"1. Ẹ́ẹ́rìnlé láàádọ́fà sūrah (114) ni àpapọ̀ sūrah tí ó wà nínú al-Ƙur’ān alápọ̀n-ọ́nlé. Gbólóhùn “Bismi-llāhir-Rahmọ̄nir-Rọhīm.” sì ni ohun tí wọ́n fi ṣe ìpínrọ̀ láààrin sūrah kan àti òmíràn. Ó tún lè dá dúró lọ́tọ̀ gẹ́gẹ́ bí āyah àkọ́kọ́ nínú sūrah al-Fātihah. Bákan náà, ó jẹ́ awẹ́ āyah gẹ́gẹ́ bí ó ṣe jẹyọ nínú sūrah an-Naml; 27:30. Bí ó tilẹ̀ jẹ́ pé ìpín-sūrah ní gbólóhùn “Bismi-llāhir-Rahmọ̄nir-Rọhīm.” dúró fún jùlọ nínú al-Ƙur’ān alápọ̀n-ọ́nlé, wọn kò fi pín sūrah at-Taobah sọ́tọ̀ nítorí pé Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - kò pa á láṣẹ fún àwọn Sọhābah láti ṣe bẹ́ẹ̀ ṣíwájú kí ó tó jáde kúrò láyé. Kò sì lẹ́tọ̀ó fún àwọn Sọhābah - kí Allāhu yọ́nú sí wọn - láti ṣe àfikún ohunkóhun sí àkọsílẹ̀ al-Ƙur’ān alápọ̀n-ọ́nlé yálà lójú ayé Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - tàbí lẹ́yìn ikú rẹ̀.\n Báyìí sì ni ó ṣe di sunnah pé sūrah at-Taobah kò bẹ̀rẹ̀ pẹ̀lú gbólóhùn ìpín-sūrah, èyí tí a mọ̀ sí gbólóhùn “Bismi-llāhir-Rahmọ̄nir-Rọhīm.” \n Kíyè sí i, kò sí orí-ọ̀rọ̀ kan tó bẹ̀rẹ̀ pẹ̀lú “Ní orúkọ Ọlọ́hun.” nínú àwọn ìwé kan tí àwọn kan tún ń pè ní “Ìwé Ọlọ́hun”. Àwọn ìwé náà ìbá jẹ́ òdodo ọ̀rọ̀ Ọlọ́hun, àwọn orí-ọ̀rọ̀ inú rẹ̀ ìbá máa bẹ̀rẹ̀ pẹ̀lú orúkọ Ọlọ́hun tí wọ́n sọ pé Òun l’Ó sọ̀ ọ́ kalẹ̀! Ẹyìn àti ọpẹ́ ni fún Allāhu, Ọba tó fi orúkọ ara Rẹ̀ ṣe ìbẹ̀rẹ̀ fún àwọn sūrah al-Ƙur’ān alápọ̀n-ọ́nlé.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"barāatun mina al-lahi warasūlihi ilā alladhīna ʿāhadttum mina al-mush'rikīna ","translations":["Freedom from obligations","from","Allah","and His Messenger","to","those (with) whom","you made a covenant","from","the polytheists","(1)"],"transliterationArr":["barāatun","mina","al-lahi","warasūlihi","ilā","alladhīna","ʿāhadttum","mina","al-mush'rikīna",null],"verseTiming":[[1,0,3320],[2,3320,4210],[3,4210,5080],[4,5080,7800],[5,7800,8150],[6,8150,9160],[7,9160,10780],[8,10780,11720],[9,11720,15075]]}}