{"name":"9:108","price":"Má ṣe dúró (kírun) nínú rẹ̀ láéláé.¹ Dájúdájú mọ́sálásí tí wọ́n bá fi ìpìlẹ̀ rẹ̀ lélẹ̀ lórí ìbẹ̀rù Allāhu láti ọjọ́ àkọ́kọ́ lo lẹ́tọ̀ọ́ jùlọ pé kí o dúró (kírun) nínú rẹ̀. Àwọn ènìyàn tó nífẹ̀ẹ́ láti máa ṣe ìmọ́ra wà nínú rẹ̀. Allāhu sì fẹ́ràn àwọn olùṣèmọ́ra.","arabic":"لَا تَقُمۡ فِيهِ أَبَدٗاۚ لَّمَسۡجِدٌ أُسِّسَ عَلَى ٱلتَّقۡوَىٰ مِنۡ أَوَّلِ يَوۡمٍ أَحَقُّ أَن تَقُومَ فِيهِۚ فِيهِ رِجَالٞ يُحِبُّونَ أَن يَتَطَهَّرُواْۚ وَٱللَّهُ يُحِبُّ ٱلۡمُطَّهِّرِينَ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1343,"juzNumber":11,"footnotes":"1. Kíyè sí i! Gbólóhùn yìí “Má ṣe dúró (kírun) nínú rẹ̀ láéláé.” àti āyah 107 ló ń ṣe é ní èèwọ̀ fún àwa mùsùlùmí onisunnah láti kírun nínú àwọn mọ́sálásí àwọn mùsùlùmí onibidiah pẹ̀lú májẹ̀mu pé tí ó bá jẹ́ pé wọ́n fi mọ́sálásí náà sọrí bid‘ah wọn. Irú àwọn mọ́sálásí tí èyí kàn ni mọ́sálásí Ahmadiyyah àti Zāwiyah àwọn oníwírìdí Tijāniyah, Ƙọ̄diriyyah àti bẹ́ẹ̀ bẹ́ẹ̀ lọ. Tí ó bá wá jẹ́ pé wọn kò fi mọ́sálásí sọrí bid‘ah, àmọ́ tí wọ́n fi imām ẹlẹ́sìn Ahmadiyyah tàbí ẹlẹ́sìn Tijāniyyah tàbí Ƙọ̄diriyyah ṣe imām nínú mọ́sálásí náà, mùsùlùmí lè kírun nínú mọ́sálásí náà kò kàn níí kírun lẹ́yìn imām onibid'ah yẹn ni.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"lā taqum fīhi abadan lamasjidun ussisa ʿalā al-taqwā min awwali yawmin aḥaqqu an taqūma fīhi fīhi rijālun yuḥibbūna an yataṭahharū wal-lahu yuḥibbu al-muṭahirīna ","translations":["(Do) not","stand","in it","ever","A masjid","founded","on","the righteousness","from","(the) first","day","(is) more worthy","that","you stand","in it","Within it","(are) men","who love","to","purify themselves","and Allah","loves","the ones who purify themselves","(108)"],"transliterationArr":["lā","taqum","fīhi","abadan","lamasjidun","ussisa","ʿalā","al-taqwā","min","awwali","yawmin","aḥaqqu","an","taqūma","fīhi","fīhi","rijālun","yuḥibbūna","an","yataṭahharū","wal-lahu","yuḥibbu","al-muṭahirīna",null],"verseTiming":[[1,0,500],[2,500,1220],[3,1220,1970],[4,1970,2970],[5,2970,4750],[6,4750,5730],[7,5730,6110],[8,6110,7320],[9,7320,7780],[10,7780,8690],[11,8690,9510],[12,9510,10470],[13,10470,11480],[14,11480,12430],[15,12430,14860],[16,14860,15590],[17,15590,16590],[18,16590,18480],[19,18480,18780],[20,18780,21250],[21,21250,22700],[22,22700,23600],[23,23600,27405]]}}