{"name":"9:13","price":"Ṣé ẹ ò níí gbógun ti ìjọ kan tó ba ìbúra rẹ̀ jẹ́ (ó sì jù ú nù), tí wọ́n sì gbèrò láti lé Òjíṣẹ́ kúrò (nínú ìlú); àwọn sì ni wọ́n kọ́ bẹ̀rẹ̀ sí gbógun tì yín ní ìgbà àkọ́kọ́? Ṣé ẹ̀ ń páyà wọn ni? Allāhu l’Ó ní ẹ̀tọ́ jùlọ sí pé kí ẹ páyà Rẹ̀ tí ẹ bá jẹ́ onígbàgbọ́ òdodo.¹","arabic":"أَلَا تُقَٰتِلُونَ قَوۡمٗا نَّكَثُوٓاْ أَيۡمَٰنَهُمۡ وَهَمُّواْ بِإِخۡرَاجِ ٱلرَّسُولِ وَهُم بَدَءُوكُمۡ أَوَّلَ مَرَّةٍۚ أَتَخۡشَوۡنَهُمۡۚ فَٱللَّهُ أَحَقُّ أَن تَخۡشَوۡهُ إِن كُنتُم مُّؤۡمِنِينَ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1248,"juzNumber":10,"footnotes":"1. Ní ọ̀pọ̀lọ́pọ̀ ìgbà ni àwọn nasọ̄rọ̄ máa ń sọ̀rọ̀ àtakò burúkú sí Allāhu àti Òjíṣẹ́ Rẹ̀ Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - nítorí ọ̀rọ̀ ogun ẹ̀sìn “Jihād”, èyí tí ó jẹ́ ọ̀kan pàtàkì nínú ìlànà ẹ̀sìn ’Islām. \n Bí àwọn nasọ̄rọ̄ kan ṣe ka jihād kún ìfipámúni-ṣẹ̀sìn-’Islām, bẹ́ẹ̀ ni àwọn nasọ̄rọ̄ mìíràn ka jihād kún ọ̀nà ìdigunjalè l’órúkọ́ ẹ̀sìn ’Islām. Nínú ọ̀rọ̀ burúkú àwọn nasọ̄rọ̄ mìíràn lórí ọ̀rọ̀ jihād ni pé, wọ́n ti ìpasẹ̀ jihād sọ àwa mùsùlùmí di mùjẹ̀mùjẹ̀ bí àwọn Boko Harām. \n Ó kéré parí, dípò kí àwọn nasọ̄rọ̄ ṣẹ̀ṣà orúkọ rere fún àwa mùsùlùmí lórí ọ̀rọ̀ jihād, gẹ́gẹ́ bí wọ́n ṣe ṣẹ̀ṣà orúkọ rere fún àwọn kan tí wọ́n ń pè ni “ajàjàgbara” tàbí “ajàfẹ́tọ̀ọ́-ọmọnìyàn”, “alákatakítí-ẹ̀sìn ’Islām” ni orúkọ abunikù mìíràn tí àwọn nasọ̄rọ̄ tún fún wa nítorí ọ̀rọ̀ Jihād. \n Àwọn ọ̀rọ̀ burúkú wọ̀nyí tí àwọn nasọ̄rọ̄ ń sọ sí àwa mùsùlùmí lórí ọ̀rọ̀ jihād burú gan-an tó bẹ́ẹ̀ gẹ́ tó fi jẹ́ pé, tí ẹnì kan bá kọ́kọ́ ka èyíkéyìí ìwé àtakò wọn sí ẹ̀sìn ’Islām tí wọ́n tẹ̀ jáde lórí ọ̀rọ̀ jihad, kò níí rí dáadáa kan kan lára Allāhu, Òjíṣẹ́ Rẹ̀, àwa mùsùlùmí àti ’Islām gan-an fúnra rẹ̀.\n Àwọn ọ̀rọ̀ àtakò burúkú àwọn nasọ̄rọ̄ wọ̀nyí sì ni ohun àkọ́kọ́ tí wọ́n máa ń gbìn sínú ọkàn àwọn èwe wẹẹrẹ bẹ̀rẹ̀ láti àwọn ilé-ìwé alákọ̀ọ́-bẹ̀rẹ̀ pé “’Islām bẹ̀rẹ̀ pẹ̀lú idà lọ́wọ́ ọ̀tún, Kurāni lọ́wọ́ òsì!” \n Àwọn nasọ̄rọ̄, wọn a tún máa fi kún un pé, “Ìsọ̀rí mẹ́ta péré ni Allāhu àti Muhammad pín gbogbo ayé sí lórí ọ̀rọ̀ ẹ̀sìn. Ìsọ̀rí àwọn ènìyàn kìíní ni àwọn mùsùlùmí tó lè pa àwọn ènìyàn bí àwọn pààyàn-pààyàn, tó sì lè gba àwọn dúkìá àwọn ènìyàn lọ́wọ́ wọn bí ìgárá-ọlọ́ṣà; àwọn wọ̀nyẹn ni onígbàgbọ́ òdodo tó máa wọ inú àwọn Ọgbà Ìdẹ̀ra. \n Ìsọ̀rí àwọn ènìyàn kejì ni àwọn mùsùlùmí tí wọn kò fẹ́ kí ẹ̀mí ènìyàn kan kan tọwọ́ àwọn bọ́, tí wọ́n sì ka fífi ogun jíjà gba dúkìá àwọn ènìyàn kún ìwà ọ̀daràn pọ́nńbélé; àwọn wọ̀nyẹn ni Allāhu wọn pè ní munāfiki, alágàbàǹgebè tó máa wà nínú àjà ìṣàlẹ̀ pátápátá nínú Iná. \n Ìsọ̀rí àwọn ènìyàn kẹta ni gbogbo àwọn ẹlẹ́sìn mìíràn yàtọ̀ sí ẹ̀sìn ‘Islām; àwọn wọ̀nyẹn sì ni àwọn aláìgbàgbọ́, àwọn ọ̀ṣẹbọ.” \n Ní àkótán, àwọn nasọ̄rọ̄, wọn á tún máa sọ pé. “Àlàáfíà ni ‘Īsā ọmọ Mọryam mú wá sáyé ni kò fi jagun ẹ̀sìn. Àmọ́ ìparun ni Muhammad mú wá sáyé ló fi kógun ja gbogbo ayé!” \n Ìwọ̀nyẹn ni díẹ̀ nínú ọ̀rọ̀ àtakò tí àwọn nasọ̄rọ̄ máa ń sọ lásọtúnsọ sí àwa mùsùlùmí. \n Kódà, nígbà mìíràn ẹ̀wẹ̀, wọn máa ń tọ́ka sí àwọn āyah kọ̀ọ̀kan àti àwọn hadīth kọ̀ọ̀kan tó ń pa àwa mùsùlùmí òdodo láṣẹ ogun jíjà s’ójú ọ̀nà Allāhu. Ẹnikẹ́ni tí ó bá ti ka ẹyọ kan tàbí òmíràn nínú àwọn ìwé àwọn nasọ̄rọ̄ lórí àwa mùsùlùmí kò níí ṣàì rí irúfẹ́ ọ̀kan-ò-jọ̀kan àwọn ọ̀rọ̀ tí mo mú wá ṣíwájú wọ̀nyẹn nínú wọn. Ní pàápàá jùlọ, àwọn oníròyìn lórí ẹ̀rọ rédíò àti tẹlifísọ̀n àti àwọn ìwé ìròyìn gbogbo kò là nínú sísọ àwọn ọ̀rọ̀ abunikù bẹ́ẹ̀ sí àwa mùsùlùmí. \n Mo ṣetán báyìí láti mú àlàyé díẹ̀ ní ṣókíṣókí wá lórí ọ̀rọ̀ jihād. Ní àkọ́kọ́ ná, bóyá ni ẹnì kan fi lè gbọ́ ọ̀rọ̀ ogun jíjà fún ẹ̀sìn ‘Islām yé tí onítọ̀ún kò bá ní ìmọ̀ òdodo pọ́nńbélé nípa ìtàn ìgbésí ayé Ànábì wa Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - àti ìtàn àwọn ẹlẹ̀sìn tó wà lásìkò rẹ̀. Ìdí èyí ni pé, kódà tí ẹnì kan bá ń tọ́ka sí āyah ogun tàbí hadīth ogun, ó gbọ́dọ̀ yé onítọ̀ún - tí kò bá níí ṣàbòsí sórí ara rẹ̀ - pé ọ̀rọ̀ ló ń ṣíwájú ogun, ọ̀rọ̀ l’ó ń kẹ́yìn ogun.\n Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - bẹ̀rẹ̀ ’Islām rẹ̀ nínú ìlú Mọkkah láààrin kìkìdá ọ̀ṣẹbọ. Àwọn ará ìlú Mọkkah, lásìkò náà, ni ọmọ-ojúmọ́-kan òòṣà kan. Àwọn ọ̀ṣẹbọ náà sì bẹ̀rẹ̀ sí fi ọwọ́ ìnira tó lágbára kan Ànábì àti àwọn ènìyàn díẹ̀ tó ti gbà fún Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a -. Ṣíwájú kí Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - tó di Òjíṣẹ́ Ọlọ́hun, ìyẹn ogójì ọdún àkọ́kọ́ nínú ìṣẹ̀mí ayé rẹ̀, Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - jẹ́ ẹni rere, olódodo, olùfọkàntán, oníwà-ìrẹ̀lẹ̀, akínkanjú ènìyàn àti ọmọlúàbí láààrin ìlú Mọkkah. Kò sì sí ẹnì kan nígbà náà tó ń f’ẹnu àbùkù kàn án. Kódà gbogbo ará ìlú wọn ló mọ Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - sí olódodo àti olùfọkàntán. \n Àmọ́ níkété tó bẹ̀rẹ̀ iṣẹ́ Ọlọ́hun nínú ìlú, àwọn ará ìlú sọ ọ́ di “wèrè, òpìdán, akéwì” fún wí pé ìpèpè rẹ̀ lòdì sí ìbọ̀rìṣà. Ìdí nìyí tí wọ́n fi kọ’jú oro sí òun àti àwọn ọmọlẹ́yìn rẹ̀. Àwọn ọ̀ṣẹbọ lu èyí tí ó ṣe é lù lálùbami nínú àwọn ọmọlẹ́yìn rẹ̀. Àwọn ọ̀ṣẹbọ sì pa èyí tí ó ṣe é pa nínú wọn ní ìpakúpa. Bí àwọn ọ̀ṣẹbọ ṣe ń pa àwọn ọkùnrin, bẹ́ẹ̀ ni wọ́n ń pa àwọn obìnrin. Àwọn ọmọ wẹẹrẹ gan-an kò mórí bọ́ lọ́wọ́ àwọn ọ̀ṣẹbọ lásìkò náà. Kò sì sí ìgbà kan tí àwọn ọ̀ṣẹbọ bá pitú ọwọ́ wọn han àwọn mùsùlùmí lásìkò náà, àfi kí Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - fún wọn ní àrọwà sùúrù. Ó sì tún máa jẹ́ kí ó yé wọn pé, irú ìyà mìíràn tí òun kò mọ̀ tún lè tọ̀dọ̀ àwọn ọ̀ṣẹbọ wá lọ́jọ́ iwájú. Àmọ́ sá, kí àwọn mùsùlùmí má ṣe tìtorí ìnira àwọn ọ̀ṣẹbọ fi ẹ̀sìn Ọlọ́hun sílẹ̀. Èyí l’ó jẹyọ nínú sūrah al-‘Ahƙọ̄f; 46:9. \n Ní òdodo kàkà kí àwọn ọ̀ṣẹbọ yìí fi àwọn mùsùlùmí lọ́rùn sílẹ̀, ńṣe ni wọ́n tún le mọ́ wọn sí i. Nígbà tí ìnira yìí sì ń lọ síbi ìfojú-egbò-rìn, láì dáràn kan tayọ pípe “Allāhu ni Ọlọ́hun àti Olúwa”, Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - yọ̀ǹda fún àwọn mùsùlùmí kan pé kí wọ́n fi ìlú bàbá wọn sílẹ̀, kí wọ́n gbé ẹ̀sìn wọn sá fún àwọn ọ̀ṣẹbọ, kí wọ́n lọ forí pamọ́ sínú ìlú mìíràn. Èyí ló ṣokùnfà bí àwọn kan nínú àwọn ọmọlẹ́yìn rẹ̀ ṣe lọ ṣàtìpó nílẹ̀ Habaṣah (Ethopia). Èyí sì ni ohun tí a mọ̀ sí Hijrah àkọ́kọ́ tó wáyé nínú ìjọ Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a -. Ìkọ̀ kìíní lọ. Ìkọ̀ kejì náà lọ.\n Ilẹ̀ Habaṣah wà lábẹ́ ọba nasọ̄rọ̄ kan lásìkò náà. Orúkọ ọba náà ni ’Ashamọh bun al-Hurr an-Najāṣīy - kí Allāhu yọ́nú sí i -. Àwọn ọ̀ṣẹbọ ìlú Mọkkah kúkú tọpasẹ̀ àwọn mùsùlùmí dé inú ìlú náà.\n Wọ́n sì lọ ṣe tánàdí àwọn mùsùlùmí lọ́dọ̀ ọba náà. Wọ́n fi ẹ̀sùn gban̄kọ mẹ́ta ọ̀tọ̀ọ̀tọ̀ kan àwọn mùsùlùmí. Àwọn ọ̀ṣẹbọ sọ fún ọba pé, “ẹrú àwọn tó sá mọ́ àwọn lọ́wọ́ ni àwọn mùsùlùmí náà.” Wọ́n ní, “àwọn mùsùlùmí náà kò ní ìtẹríba fún àwọn àgbà.” Paríparí rẹ̀ ni pé, àwọn ọ̀ṣẹbọ sọ pé, “àwọn mùsùlùmí ń sọ àìdáa sí ‘Īsā ọmọ Mọryam àti ìyá rẹ̀.” \n Orí ọba náà gbóná wá. Lójú ẹsẹ̀, ó pàṣẹ pé kí wọ́n lọ kó gbogbo àwọn mùsùlùmí náà wá ṣíwájú òun. Èsì tí àwọn mùsùlùmí fọ̀ sí àwọn ẹ̀sùn náà ni pé, “àwọn kì í kúnlẹ̀ tàbí dọ̀bálẹ̀ fún ẹnikẹ́ni àfi Allāhu. Ìkíni “àlàáfíà fún ọ” ni ìkíni tàwọn. Àwọn kì í ṣe ẹrú tó sá mọ́ olówó rẹ̀ lọ́wọ́, àmọ́ nítorí pé àwọn kọ̀ láti máa bá wọn bọ̀rìṣà lọ ló mú àwọn ọ̀ṣẹbọ tó ń darí ìlú gbógun líle ti àwọn. Wọ́n pa nínú àwọn nípakúpa nígbà tí lílù àlùbami àti lílẹ̀lókò kò ran àwọn mọ́. Níwọ̀n ìgbà tí àyè mìíràn sì wà láyé l’àwọn fi sá wá síbí. \n Nípa ti ọ̀rọ̀ ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - àti ìyá rẹ̀, kò sí ẹni tó fẹnu àbùkù kàn wọ́n rí nínú àwọn.” Agbẹnusọ wọn, Ja‘far - kí Allāhu yọ́nú sí i - sì ké sūrah Mọryam fún wọn nínú ààfin ọba. Orí ọba wú nígbà tí ó ń gbọ́ àwọn ọ̀rọ̀ òdodo tí al-Ƙur’ān ń sọ nípa ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - àti ìyá rẹ̀. Èyí tí ń ṣe àfihàn pé “wòlíì náà tí à ń retí ti dé”. Ọba náà kò ṣe méní, kò ṣe méjì, ó gbàfà fún Ànábì Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a -. Ó sì fínnúfíndọ̀ gba ’Islām. Ó sì ṣe ẹ̀sìn ’Islām d’ọjọ́ ikú rẹ̀ - kí Allāhu yọ́nú sí i -. Ọba wá ṣẹ̀ṣẹ̀ ṣe àdéhùn àtìlẹ́yìn rẹ̀ fún àwọn mùsùlùmí nínú ìlú rẹ̀. Ojú ti àwọn ọ̀ṣẹbọ náà. Wọ́n sì dárí padà wá sínú ìlú Mọkkah láti tẹ̀ síwájú nínú ìfìnira kan àwọn mùsùlùmí tó ṣẹ́kù nínú ìlú wọn. Ọba yìí àti irú rẹ̀ mìíràn nínú àwọn èèkàn èèkàn nasọ̄rọ̄ tó gba ẹ̀sìn ’Islām sínú ayé wọn wọ́ọ́rọ́wọ́ ni al-Ƙur’ān ń tọ́ka sí nínú àwọn súrah kan bíi tinú sūrah al-Mọ̄’idah; 5:82-85. \n Síwájú sí i, àwọn ọ̀ṣẹbọ ìlú Mọkkah tún ń fínná mọ́ àwọn mùsùlùmí ìlú Mọkkah ju ti àtẹ̀yìnwá lọ tó bẹ́ẹ̀ gẹ́ tí wọ́n fi ṣèpàdé lórí bí wọ́n ṣe máa pa Òjíṣẹ́ Ọlọ́hun - kí ìkẹ́ àti ọlà Allāhu máa bá a -. Ní alẹ́ ọjọ́ tí àwọn ọ̀ṣẹbọ ìlú Mọkkah gbéra láti gbẹ̀mí Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - ni Allāhu tú àṣírí èròkérò wọn fún Ànábì Rẹ̀ - kí ìkẹ́ àti ọlà Allāhu máa bá a -. Ó sì pa á láṣẹ láti sá kúrò nínú ìlú bàbá rẹ̀ fún wọn. Allāhu pa òun àti àwọn ọmọlẹ́yìn rẹ̀ láṣẹ pé kí wọ́n lọ ṣàtìpó sínú ìlú Mọdīnah.\n Bí ó tilẹ̀ jẹ́ pé àwọn ọ̀ṣẹbọ tọpasẹ̀ òun àti ọ̀rẹ́ rẹ̀ Abu-Bakr as-Siddīƙ - kí Allāhu yọ́nú sí i - lórí ìrìn-àjò wọn sí ìlú Mọdināh, Allāhu kó àwọn méjèèjì yọ nínú ṣùtá àwọn tó tọpasẹ̀ wọn. Èyí mú kí àwọn ọ̀ṣẹbọ fàbọ̀ sórí àwọn tó kù lẹ́yìn. Àwọn ọ̀ṣẹbọ ń dènà dè wọ́n bí ìgbà tí ẹkùn bá ń dènà de ẹranko. Àwọn tí ọwọ́ àwọn ọ̀ṣẹbọ ba bà nínú àwọn mùsùlùmí, yálà kí ó padà sínú ìlú Mọkkah fún ìdíyàjẹ tó kọjá ìfaradà tàbí tí ó bá kọ̀ kí wọ́n pa á lẹ́sẹ̀kẹsẹ̀ sójú ọ̀nà. \n Àyà kò tún ko àwọn ọ̀ṣẹbọ ìlú Mọkkah láti máa lé àwọn mùsùlùmí wọnú ìlú Modīnah. Nígbà tí ọwọ́ wọn bá sì tẹ̀ wọ́n níbẹ̀, wọ́n sì máa dá wọn padà sínú ìlú Mọkkah pẹ̀lú ìjìyà tó dópin. Lásìkò yìí ni Allāhu - Ọba tó ga jùlọ - yọ̀ǹda fún àwọn mùsùlùmí náà láti jàjà gbára fún ẹ̀mí ara wọn, láti gba àwọn ìyàwó wọn sílẹ̀ pẹ̀lú àwọn ọmọ wọn àti àwọn tí kò rọ́nà jáde kúrò nínú ìlú Mọkkah. Kí wọ́n lè dáàbò bo ẹ̀sìn wọn lọ́wọ́ àwọn ọ̀ṣẹbọ. Èyí wà ní ìbámu sí sūrah al-Hajj; 22: 39-41 àti sūrah an-Nisā’; 4:75. Gbogbo ìwọ̀nyí ló kúkú bi āyah ogun ẹ̀sìn, èyí tí àwọn nasọ̄rọ̄ ń tọ́ka sí lódì lódì báyìí. \n Āyah àti hadīth tí wọ́n sì tún ń tọ́ka sí lórí jíja àwọn nasọ̄rọ̄ àti àwọn yẹhudi lógun kò ṣàdédé wáyé bí kò ṣe nítorí ìwà ọ̀dàlẹ̀ tí àwọn ìjọ méjèèjì hù níwà sí àwọn mùsùlùmí nínú ìlú Mọdinah Onímọ̀ọ́lẹ́. Ìdí ni pé, Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - bá ìjọ yẹhudi àti nasọ̄rọ̄ nínú ìlú Mọdīnah gẹ́gẹ́ bí àrè, wọn kì í ṣe ọmọ-onílùú rárá nítorí pé àwọn ìdílé ’Aos àti ìdílé Kazraj ló ni ìlú wọn, ìlú Mọdīnah. \n Níkété tí Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - gúnlẹ̀ sínú ìlú Mọdīnah ni àwọn ìdílé méjèèjì wọ̀nyí fa àkóṣo àti ìjọba ìlú Mọdīnah lé Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - lọ́wọ́ wọ́ọ́rọ́wọ́ láì bèèrè fún un nítorí pé, kò fẹ́ẹ̀ ṣẹ́ku ẹnì kan kan tí kò gba ’Islām wọ́ọ́rọ́wọ́. Ìgbàláàyè tí àwọn ọmọ ìlú Mọdīnah ṣe fún Ànábì wa yìí l’ó kúkú sọ àwọn náà di “al-’Ansọ̄r” - alárànṣe-ẹ̀sìn. Àti pé orúkọ ìlú Mọdīnah yí padà kúrò ní Yẹthrib, ó sì di Mọdīnah Onímọ̀ọ́lẹ̀. Bẹ́ẹ̀ náà ni àwọn tó wá ṣàtìpó sínú ìlú náà ṣe ń jẹ́ “al-Muhājirūn” - àwọn tó gbé ìlú wọn jù sílẹ̀ nítorí ẹ̀sìn -. Nígbà tí àṣẹ ìlú Mọdīnah Onímọ̀ọ́lẹ̀ dé ọwọ́ Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a -, ó di alásẹ gbogbogbò fún ìlú Mọdīnah láti ọdún àkọ́kọ́ tó ti wọ inú ìlú náà. Tòhun ti bẹ́ẹ̀ náà, Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - kò lé àwọn yẹhudi àti àwọn nasọ̄rọ̄ kúrò nínú ìlú Mọdīnah àti ìgbéríko rẹ̀. Kódà àwọn ìjọ yẹhudi ní abúlé tiwọn tí wọ́n mọ odi yíra wọn ká pẹ̀lú rẹ̀. Lábẹ́ “ààbò-ara-ẹni lààbò ìlú” l’ó mú kí àdéhùn ojú-lalákàn fi í ṣọ́rí wáyé láààriin ìjọ mùsùlùmí àti àwọn yẹhudi tó ń gbé nínú ìlú Mọdīnah. Àmọ́ ńṣe ni àwọn yẹhudi wọ̀nyí lẹ̀dí àpò pọ̀ mọ́ àwọn ọ̀ṣẹbọ ìlú Mọkkah. Wọ́n sì fi ọ̀bẹ ẹ̀yìn jẹ àwọn mùsùlùmí níṣu. Èyí lóbí àwọn āyah àti hadīth tí wọ́n ń tọ́ka sí lónìí lódì lódì lórí gbígbé ogun tí àwọn ahlul-kitāb. \n Nípasẹ̀ Jihād, ìṣẹ́gun ńlá àti àrànṣe tó lágbára fún àwọn mùsùlùmí àkọ́kọ́ dé lórí àwọn ọ̀tá ’Islām àkọ́kọ́. Allāhu sì kó Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - àti àwọn ọmọlẹ́yìn rẹ̀ yọ lọ́wọ́ ṣùtá àwọn ọ̀ṣẹbọ àti àwọn ahlul-kitāb. \n Ní ti Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a -, ọwọ́ rẹ̀ kò tẹ èkù-idà rárá títí Allāhu fi gbé e lọ sínú sánmọ̀. Òun náà ìbá kúkú jagun nítorí pé, àwọn yẹhudi kò fi òun àti àwọn ọmọlẹ́yìn rẹ̀ sílẹ̀ láì gbógun tì wọ́n. Àmọ́, Ànábì ‘Īsā ọmọ Mọryam - kí ọlà Allāhu máa bá a - kò wọ ipò aláṣẹ ìlú, áḿbọ̀sìbọ̀sí pé ó máa ní ọmọ ogun tó lè kó jagun ẹ̀sìn. Àti pé mélòó gan-an ni àwọn ọmọlẹ́yìn rẹ̀ tó fi máa dira ogun? \n Gbígbà tí Allāhu gbà fún Ànábì wa Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a - tó bẹ́ẹ̀ gẹ́ tí Ó fi jogún ìjọba ìlú fún un l’ó fi rí ogun àjàyè jà lórí àwọn ọ̀tá ẹ̀sìn ’Islām. Tàbí ṣe a rí ìjọba kan láyé tí kò ní ọmọ ogun ni? Ìjọba ni Ànábì wa Muhammad - kí ìkẹ́ àti ọlà Allāhu máa bá a -. Ìjọba àlàáfíà sì ni pẹ̀lú nítorí pé, nípasẹ̀ ogun ẹ̀sìn ni àlàáfíà fi jọba lérékùsù Lárúbáwá. Ìkọjá-ẹnu-ààlà àwọn ọ̀ṣẹbọ àti àwọn ahlul-kitāb l’ó sì bí jihad nítorí pé, ìwàásù ọ̀rọ̀ Ọlọ́hun ni Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - fi pèpè sẹ́sìn. \n Àwọn ọ̀ṣẹbọ àti àwọn onítírà wọ̀nyẹn kò sì yé tayọ ẹnu-ààlà sí àwa mùsùlùmí títí di àsìkò yìí. Ṣebí ọ̀rọ̀-ẹnu ni àwa mùsùlùmí sì fi ń yanjú rẹ̀ lọ́wọ́ lásìkò tiwa yìí. Ó sàn fún àwọn olùtayọ-ẹnu-ààlà wọ̀nyẹn kí wọ́n jẹ́ kí ó mọ bẹ́ẹ̀. \n Kò sí ìfipámúni-ṣẹ̀sìn ’Islām nítorí pé, àwọn āyah kan, bíi sūrah Yūnus; 10:99-100, ti fi rinlẹ̀ pé, kì í ṣe gbogbo ènìyàn ni Allāhu máa ṣe ní mùsùlùmí. Àmọ́ Allāhu kọ kí ẹlẹ̀sìn máa fi ìnira kan ẹlẹ̀sìn mìíràn. Nítorí náà, òkìkí tí àwọn nasọ̄rọ̄ ń fún àwa mùsùlùmí kò lè yọ jihād kúrò nínú ẹ̀sìn ’Islām. Tí wọn kò bá fẹ́ ká ṣe jihād lórí àwọn kí wọ́n so ewé agbéjẹ́ mọ́wọ́.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"alā tuqātilūna qawman nakathū aymānahum wahammū bi-ikh'rāji al-rasūli wahum badaūkum awwala marratin atakhshawnahum fal-lahu aḥaqqu an takhshawhu in kuntum mu'minīna ","translations":["Will not","you fight","a people","who broke","their oaths","and determined","to drive out","the Messenger","and they","began (to attack) you","first","time","Do you fear them","But Allah","(has) more right","that","you should fear Him","if","you are","believers","(13)"],"transliterationArr":["alā","tuqātilūna","qawman","nakathū","aymānahum","wahammū","bi-ikh'rāji","al-rasūli","wahum","badaūkum","awwala","marratin","atakhshawnahum","fal-lahu","aḥaqqu","an","takhshawhu","in","kuntum","mu'minīna",null],"verseTiming":[[1,0,590],[2,590,2260],[3,2260,3010],[4,3010,5830],[5,5830,7370],[6,7370,9380],[7,9380,12080],[8,12080,13420],[9,13420,14560],[10,14560,15460],[11,15460,17100],[12,17100,18040],[13,18040,19490],[14,19490,21810],[15,21810,22930],[16,22930,23810],[17,23810,24720],[18,24720,26140],[19,26140,27390],[20,27390,29390],[21,29390,33295]]}}