{"name":"9:73","price":"Ìwọ Ànábì, gbógun ti àwọn aláìgbàgbọ́ àti àwọn ṣọ̀bẹ-ṣèlu mùsùlùmí. Kí o sì le mọ́ wọn. Iná Jahanamọ ni ibùgbé wọn. Ìkángun náà sì burú.¹","arabic":"يَٰٓأَيُّهَا ٱلنَّبِيُّ جَٰهِدِ ٱلۡكُفَّارَ وَٱلۡمُنَٰفِقِينَ وَٱغۡلُظۡ عَلَيۡهِمۡۚ وَمَأۡوَىٰهُمۡ جَهَنَّمُۖ وَبِئۡسَ ٱلۡمَصِيرُ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1308,"juzNumber":10,"footnotes":"1. Mẹ́ta ni gbogbo ènìyàn pín sí lórí òṣùwọ̀n ẹ̀sìn. Igun àkọ́kọ́ ni àwa mùsùlùmí tí a jẹ́ onígbàgbọ́ òdodo. Igun yìí nìkan ló sì máa jèrè ní Ọjọ́ Àjíǹde. Igun kejì ni igun tó jẹ́ ìdàkejì sí igun àkọ́kọ́. Igun tí kì í ṣe mùsùlùmí rárá. Àwọn sì ni igun aláìgbàgbọ́ àti àwọn ọ̀ṣẹbọ. \n Wàyí ní ti igun kẹta, àwọn ni igun alágàbàǹgebè. Igun yìí ni igun tí ó ń pe ara rẹ̀ ní mùsùlùmí, tí ó sì ń ṣe ìṣe mùsùlùmí. Wọ́n ń kírun wákàtí márààrún, wọ́n ń dojú kọ Ƙiblah, wọ́n ń gbààwẹ̀ Rọmọdọ̄n, wọ́n ń ṣe hajj, wọ́n sì ń wí kalmọtu-ṣṣahādah, àmọ́ wọn kò faramọ́ àwọn ìgbàgbọ́ òdodo àti àdìsọ́kàn Islām. Ìgbàgbọ́ igun kẹta yìí máa ń bá ti igun kejì lọ ní ọ̀pọ̀lọ́pọ̀ ìgbà. Ìsọ̀rí méjì sì ni àwọn igun ṣọ̀bẹ-ṣèlu mùsùlùmí. Ìsọ̀rí àkọ́kọ́ ni igun àwọn ahlul-bid‘ah bí ìjọ Ahmadiyyah, Ìjọ Tijāniyyah, ìjọ Ƙọ̄diriyyah, ìjọ Ṣī‘ah. Ìsọ̀rí kejì ni gbogbo ẹnikẹ́ni tí ó ń pe ara rẹ̀ ní mùsùlùmí àmọ́ tí ó jẹ́ ọ̀rẹ́ àyò àti alátìlẹ́yìn fún àwọn kèfèrí àti àwọn ọ̀ṣẹbọ. Nítorí náà, āyah yìí ń pa àwa mùsùlùmí onígbàgbọ́ òdodo ní àṣẹ láti gbógun ti gbogbo ìjọ méjèèjì. Èyí sì máa jẹ́ nípasẹ̀ ṣíṣe wáàsí tó lágbára fún gbogbo wọn àti dídojú ìjà kọ èyí tí ó bá dojú ìjà kọ wá.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"yāayyuhā al-nabiyu jāhidi al-kufāra wal-munāfiqīna wa-ugh'luẓ ʿalayhim wamawāhum jahannamu wabi'sa al-maṣīru ","translations":["O Prophet","O Prophet","Strive (against)","the disbelievers","and the hypocrites","and be stern","with them","And their abode","(is) Hell","and wretched","(is) the destination","(73)"],"transliterationArr":["yāayyuhā","al-nabiyu","jāhidi","al-kufāra","wal-munāfiqīna","wa-ugh'luẓ","ʿalayhim","wamawāhum","jahannamu","wabi'sa","al-maṣīru",null],"verseTiming":[[1,0,3050],[2,3050,5150],[3,5150,6120],[4,6120,7560],[5,7560,9530],[6,9530,10360],[7,10360,12100],[8,12100,13660],[9,13660,15570],[10,15570,16320],[11,16320,19855]]}}