{"name":"9:80","price":"Yálà o tọrọ àforíjìn fún wọ́n tàbí o ò tọrọ àforíjìn fún wọn - kódà kí o tọrọ àforíjìn fún wọn nígbà ààdọ́rin - Allāhu kò níí foríjìn wọ́n. Ìyẹn nítorí pé, dájúdájú wọ́n ṣàì gbàgbọ́ nínú Allāhu àti Òjísẹ́ Rẹ̀. Allāhu kò níí fi ọ̀nà mọ ìjọ òbìlẹ̀jẹ́.¹","arabic":"ٱسۡتَغۡفِرۡ لَهُمۡ أَوۡ لَا تَسۡتَغۡفِرۡ لَهُمۡ إِن تَسۡتَغۡفِرۡ لَهُمۡ سَبۡعِينَ مَرَّةٗ فَلَن يَغۡفِرَ ٱللَّهُ لَهُمۡۚ ذَٰلِكَ بِأَنَّهُمۡ كَفَرُواْ بِٱللَّهِ وَرَسُولِهِۦۗ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلۡفَٰسِقِينَ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1315,"juzNumber":10,"footnotes":"1. Pẹ̀lú gbólóhùn yìí, àwọn kò-gbédè-ó-gbékèé nínú àwọn nasọ̄rọ̄ lérò pé Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - kò lè tọrọ àforíjìn lọ́dọ̀ Allāhu fún àwa ọmọlẹ́yìn rẹ̀, kí Allāhu sì foríjìn wá. Ọ̀rọ̀ kò sì rí bẹ́ẹ̀ rárá. Àmọ́ ohun tí ń bẹ nínú āyah yìí ni pé, kò sí àforíjìn Allāhu fún òkú àwọn ṣọ̀bẹ-ṣèlu mùsùlùmí, gẹ́gẹ́ bí kò ṣe sí àforíjìn Allāhu fún òkú àwọn aláìgbàgbọ́ àti òkú àwọn ọ̀ṣẹbọ, ẹni yòówù ó bá wọn tọrọ àforíjìn. Nípa ti òkú àwọn aláìgbàgbọ́, ẹ wo āyah 84 níwájú. Nípa ti òkú àwọn ṣọ̀bẹ-ṣèlu mùsùlùmí, ẹ wo sūrah al-Munāfiƙūn; 63:6. Bákan náà, nípa ti òkú àwọn ọ̀ṣẹbọ, ẹ wo sūrah an-Nisā’; 4:48 àti 116 àti sūrah at-Taobah; 9:113. \n Bákàn náà, bíbá tí Allāhu ni kí àwọn mùsùlùmí lọ bá Ànábí - kí ìkẹ́ àti ọlà Allāhu máa bá a - láti lè bá wọn tọrọ àforíjìn, gẹ́gẹ́ bí ó ṣe wà nínú sūrah an-Nisā’; 4:64, ìyẹn náà ti wá sópin nípasẹ̀ ikú Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a -. Ọ̀wọ́ ìgbà tí Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - ń bẹ nílé ayé ṣíwájú kí ó tó kú nìkan ni ó lè bá ẹnikẹ́ni nínú àwọn mùsùlùmí tọrọ àforíjìn lọ́dọ̀ Allāhu - subhānahu wa ta'ālā -. Allāhu - subhānahu wa ta‘ālā - sì máa foríjìn ín. Àmọ́, Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - kò lè ṣe bẹ́ẹ̀ mọ́ lẹ́yìn ikú rẹ̀ nínú sàréè rẹ̀. Ó sì di Ọjọ́ Àjíǹde kí Ànábì wa - kí ìkẹ́ àti ọlà Allāhu máa bá a -tó lè bá wa ṣ’ìpẹ̀ àṣegbà níwájú Allāhu - subhānahu wa ta‘ālā -. Nítorí náà, ìṣẹbọ sí Allāhu ni fún ẹnikẹ́ni láti lọ bá Ànábì - kí ìkẹ́ àti ọlà Allāhu máa bá a - ní ìdí sàréè rẹ̀ fún títọrọ n̄ǹkan lọ́dọ̀ rẹ̀.","lang":"yo","version":{"key":"yoruba_mikail","direction":"ltr","language_iso_code":"yo","version":"1.0.6","last_update":1637046492,"title":"Yoruba translation","description":"Translation of the Quran meanings into Yoruba by Abu Rahima Mikhail Aikweiny, printed in 1432 H."},"meta":{"transliteration":"is'taghfir lahum aw lā tastaghfir lahum in tastaghfir lahum sabʿīna marratan falan yaghfira al-lahu lahum dhālika bi-annahum kafarū bil-lahi warasūlihi wal-lahu lā yahdī al-qawma al-fāsiqīna ","translations":["Ask forgiveness","for them","or","(do) not","ask forgiveness","for them","If","you ask forgiveness","for them","seventy","times","never","will Allah forgive","will Allah forgive","[for] them","That","(is) because they","disbelieved","in Allah","and His Messenger","and Allah","(does) not","guide","the people","the defiantly disobedient","(80)"],"transliterationArr":["is'taghfir","lahum","aw","lā","tastaghfir","lahum","in","tastaghfir","lahum","sabʿīna","marratan","falan","yaghfira","al-lahu","lahum","dhālika","bi-annahum","kafarū","bil-lahi","warasūlihi","wal-lahu","lā","yahdī","al-qawma","al-fāsiqīna",null],"verseTiming":[[1,0,1270],[2,1270,2070],[3,2070,2460],[4,2460,2910],[5,2910,4200],[6,4200,4910],[7,4910,6190],[8,6190,7430],[9,7430,8150],[10,8150,9290],[11,9290,11130],[12,11130,11730],[13,11730,13370],[14,13370,14240],[15,14240,15510],[16,15510,16420],[17,16420,18440],[18,18440,19350],[19,19350,20520],[20,20520,22300],[21,22300,23370],[22,23370,23860],[23,23860,24560],[24,24560,25430],[25,25430,29615]]}}