{"name":"102:8","price":" 8. Then on that Day you shall be asked about the delights[2] (you indulged in, in this world)!","arabic":"ثُمَّ لَتُسۡـَٔلُنَّ يَوۡمَئِذٍ عَنِ ٱلنَّعِيمِ","category":["102 (At-Takathur)","At-Takathur","Surah At-Takathur","Chapter At-Takathur","Takathur","Surah Takathur","Chapter Takathur","At Takathur","Surah At Takathur","Chapter At Takathur","Surah 102","Chapter 102","The Rivalry","التكاثر"],"ayahNumber":6176,"juzNumber":30,"footnotes":"(V.102:8) Narrated Abu Hurairah رضي الله عنه: Once during a day or a night Allâh’s Messenger صلى الله عليه وسلم came out and found Abu Bakr and ‘Umar رضي الله عنهما: he said: \"What has brought you out of your homes at this hour?\" They replied: \"Hunger, O Allâh’s Messenger.\" He said: \"By Him (Allâh) in Whose Hand my soul is, I too have come out for the same reason for which you have come out\". Then he صلى الله عليه وسلم said to them (both): \"Come along! \"And he went along with them to a man from the Ansâr but they did not find him in his house. The wife of that man saw the Prophet صلى الله عليه وسلم and said: \"You are welcome.\" Allâh’s Messenger صلى الله عليه وسلم asked her (saying): \"Where is so-and-so?\" She replied: \"He has gone to fetch some water for us.\" In the mean time the Ansarî man came, saw Allâh’s Messenger صلى الله عليه وسلم with his two Companions and said: \"All the praise and thanks be to Allâh: today there is none superior to me as regards guests.\" Then he went and brought a part of a bunch of date-fruit, having dates, some still green, some ripe and some fully ripe and requested them to eat from it. He then took his knife (to slaughter for them a sheep). Allâh’s Messenger صلى الله عليه وسلم said to him: \"Beware! Do not slaughter a milch sheep\". So he slaughtered a sheep (prepared the meals from its meat). They ate from that sheep and that bunch of dates and drank water. After they had finished eating and drinking to their fill, Allâh’s Messenger صلى الله عليه وسلم said to Abu Bakr and ‘Umar رضي الله عنهما : \"By Him in Whose Hand my soul is, you will be asked about this treat on the Day of Resurrection. He (Allâh) brought you out of your homes with hunger and you are not returning to your homes till you have been blessed with this treat.\" (Sahih Muslim, Vol.6, The Book of Drinks, Chapter 20, Pages 116,117).","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"thumma latus'alunna yawma-idhin ʿani al-naʿīmi ","translations":["Then","surely you will be asked","that Day","about","the pleasures","(8)"],"transliterationArr":["thumma","latus'alunna","yawma-idhin","ʿani","al-naʿīmi",null],"verseTiming":[[1,0,1580],[2,1580,3839],[3,3839,5159],[4,5159,5639],[5,5639,11874]]}}