{"name":"111:5","price":" 5. In her neck is a twisted rope of Masad (palm fibre).[3]","arabic":"فِي جِيدِهَا حَبۡلٞ مِّن مَّسَدِۭ","category":["111 (Al-Masad)","Al-Masad","Surah Al-Masad","Chapter Al-Masad","Masad","Surah Masad","Chapter Masad","Al Masad","Surah Al Masad","Chapter Al Masad","Surah 111","Chapter 111","The Palm Fiber","المسد"],"ayahNumber":6221,"juzNumber":30,"footnotes":"(V.111:5) \"In her neck is a twisted rope of palm fibre, [i.e. the chain which is in the Fire (of Hell)].\" (Sahih Al-Bukhari, Vol. 6, Chapter 356, Page 469).\n[Imâm Qurtubî says in the Tafsîr of the (V.17:45)]:\nNarrated Sa‘îd bin Jubâir رضي الله عنه : \"When Sûrah No.111 Al-Masad was revealed, the wife of Abu Lahab came looking out for the Prophet صلى الله عليه وسلم while Abu Bakr رضي الله عنه was sitting beside him. Abu Bakr said to the Prophet صلى الله عليه وسلم : ‘I wish if you get aside (or go away) as she is coming, to us, she may harm you’. The Prophet said: ‘There will be a screen set between me and her’. So she did not see him صلى الله عليه وسلم. She said to Abu Bakr: ‘Your companion is saying poetry against me.’ Abu Bakr said: ‘By Allâh he does not say poetry.’ She said: ‘Do you believe that’. Then she left. Abu Bakr said, ‘O Allâh’s Messenger! She did not see you’. The Prophet صلى الله عليه وسلم said: ‘An angel was screening me from her.’\" [This Hadith is quoted in Musnad Abû Ya‘lâ]\nIt is said that if the Verse [(17: 45) The Qur’an] is recited by a real believer (of Islâmic Monotheism) he will be screened from a disbeliever. (Allâh knows best). (Tafsîr Al-Qurtubî, Vol.10, Page 269).","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"fī jīdihā ḥablun min masadin ","translations":["In","her neck","(will be) a rope","of","palm-fiber","(5)"],"transliterationArr":["fī","jīdihā","ḥablun","min","masadin",null],"verseTiming":[[1,0,470],[2,470,1530],[3,1530,3110],[4,3110,3670],[5,3670,6285]]}}