{"name":"12:67","price":" 67. And he said: \"O my sons! Do not enter by one gate, but enter by different gates, and I cannot avail you against Allâh at all. Verily! The decision rests only with Allâh. In Him, I put my trust and let all those that trust, put their trust in Him.\"[1]","arabic":"وَقَالَ يَٰبَنِيَّ لَا تَدۡخُلُواْ مِنۢ بَابٖ وَٰحِدٖ وَٱدۡخُلُواْ مِنۡ أَبۡوَٰبٖ مُّتَفَرِّقَةٖۖ وَمَآ أُغۡنِي عَنكُم مِّنَ ٱللَّهِ مِن شَيۡءٍۖ إِنِ ٱلۡحُكۡمُ إِلَّا لِلَّهِۖ عَلَيۡهِ تَوَكَّلۡتُۖ وَعَلَيۡهِ فَلۡيَتَوَكَّلِ ٱلۡمُتَوَكِّلُونَ","category":["12 (Yusuf)","Yusuf","Surah Yusuf","Chapter Yusuf","Surah 12","Chapter 12","Joseph","يوسُف"],"ayahNumber":1663,"juzNumber":13,"footnotes":"(V.12:67).\na) Narrated Ibn ‘Abbâs رضي الله عنهما : Allâh’s Messenger صلى الله عليه وسلم said, \"Seventy thousand people of my followers will enter Paradise without account, and they are those who do not practise Ar-Ruqyah and do not see an evil omen in things, and put their trust in their Lord.\" (Sahih Al-Bukhari, Vol.8, Hadith No. 479)\nAr-Ruqyah: See the glossary.\nb) Narrated Abu Hurairah رضي الله عنه : The Prophet صلى الله عليه وسلم said, \"An Israeli man asked another Israeli to lend him one thousand dinars. The second man required witnesses. The former replied, ‘Allâh is Sufficient as a witness.’ The second said, ‘I want a surety.’ The former replied, ‘Allâh is Sufficient as a Surety.’ The second said, ‘You are right’ and lent him the money for a certain period. The debtor went across the sea. When he finished his job, he searched for a conveyance so that he might reach in time for the repayment of the debt, but he could not find any. So, he took a piece of wood and made a hole in it, inserted in it one thousand dinars and a letter to the lender and then closed (i.e. sealed) the hole tightly. He took the piece of wood to the sea and said. ‘O Allâh! You know well that I took a loan of one thousand dinars from so-and-so. He demanded a surety from me but I told him that Allâh’s Guarantee was sufficient and he accepted Your Guarantee. He then asked for a witness and I told him that Allâh was sufficient as a Witness, and he accepted You as a Witness. No doubt, I have tried hard to find a conveyance so that I could pay his money back but could not find, so I hand over this money to You.’ Saying that, he threw the piece of wood into the sea till it went out far into it, and then he went away. Meanwhile he started searching for a conveyance in order to reach the creditor’s country. One day the lender came out of his house to see whether a ship had arrived bringing his money, and all of a sudden he saw the piece of wood (in which his money had been deposited). He took it home to use for fire. When he sawed it, he found his money and the letter inside it. Shortly after that, the debtor came bringing one thousand dinars to him and said, ‘By Allâh, I had been trying hard to get a boat so that I could bring you your money, but failed to get one before the one I have come by.’ The lender asked, ‘Have you sent something to me?’ The debtor replied, ‘I have told you I could not get a boat other than the one I have come by.’\nThe lender said, ‘Allâh has delivered on your behalf the money you sent in the piece of wood. So, you may keep your one thousand dinars and depart guided on the Right Path.’\"\n(Sahih Al-Bukhari, Vol.3, Hadith No.488B).","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"waqāla yābaniyya lā tadkhulū min bābin wāḥidin wa-ud'khulū min abwābin mutafarriqatin wamā ugh'nī ʿankum mina al-lahi min shayin ini al-ḥuk'mu illā lillahi ʿalayhi tawakkaltu waʿalayhi falyatawakkali al-mutawakilūna ","translations":["And he said","O my sons","(Do) not","enter","from","one gate","one gate","but enter","from","gates","different","And not","I can avail","you","against","Allah","any","thing","Not","(is) the decision","except","with Allah","upon Him","I put my trust","and upon Him","let put (their) trust","the ones who put trust","(67)"],"transliterationArr":["waqāla","yābaniyya","lā","tadkhulū","min","bābin","wāḥidin","wa-ud'khulū","min","abwābin","mutafarriqatin","wamā","ugh'nī","ʿankum","mina","al-lahi","min","shayin","ini","al-ḥuk'mu","illā","lillahi","ʿalayhi","tawakkaltu","waʿalayhi","falyatawakkali","al-mutawakilūna",null],"verseTiming":[[1,0,970],[2,970,2340],[3,2340,2670],[4,2670,3770],[5,3770,4710],[6,4710,6300],[7,6300,8120],[8,8120,9110],[9,9110,9600],[10,9600,10700],[11,10700,13320],[12,13320,15500],[13,15500,16350],[14,16350,17740],[15,17740,18920],[16,18920,19860],[17,19860,20960],[18,20960,23830],[19,23830,24190],[20,24190,25020],[21,25020,25910],[22,25910,29440],[23,29440,30370],[24,30370,31700],[25,31700,32720],[26,32720,34400],[27,34400,38395]]}}