{"name":"14:37","price":" 37. \"O our Lord! I have made some of my offspring to dwell in an uncultivable valley by Your Sacred House (the Ka‘bah at Makkah) in order, O our Lord, that they may perform As-Salât (Iqâmat-as-Salât). So fill some hearts among men with love towards them, and (O Allâh) provide them with fruits so that they may give thanks.[1]","arabic":"رَّبَّنَآ إِنِّيٓ أَسۡكَنتُ مِن ذُرِّيَّتِي بِوَادٍ غَيۡرِ ذِي زَرۡعٍ عِندَ بَيۡتِكَ ٱلۡمُحَرَّمِ رَبَّنَا لِيُقِيمُواْ ٱلصَّلَوٰةَ فَٱجۡعَلۡ أَفۡـِٔدَةٗ مِّنَ ٱلنَّاسِ تَهۡوِيٓ إِلَيۡهِمۡ وَٱرۡزُقۡهُم مِّنَ ٱلثَّمَرَٰتِ لَعَلَّهُمۡ يَشۡكُرُونَ","category":["14 (Ibrahim)","Ibrahim","Surah Ibrahim","Chapter Ibrahim","Surah 14","Chapter 14","Abraham","إبراهيم"],"ayahNumber":1787,"juzNumber":13,"footnotes":"(V.14:37). The Story of the building of the Ka‘bah at Makkah:\nNarrated Ibn ‘Abbâs رضي الله عنهما : [On the authority of the Prophet صلى الله عليه وسلم (See Fath Al-Bari, Vol. 7, Page 210)]. The first lady to use a girdle was the mother of Ismâ‘îl (Ishmael). She used a girdle so that she might hide her tracks from Sârah.* Ibrâhîm (Abraham) brought her and her son Ismâ‘îl (Ishmael) while she used to nurse him at her breast, near the Ka‘bah under a tree on the spot of Zamzam , at the highest place in the mosque. During those days there was nobody in Makkah, nor was there any water. So he made them sit over there and placed near them a leather bag containing some dates, and a small water-skin containing some water, and set out homeward. Ismâ‘îl’s (Ishmael) mother followed him saying, \"O Ibrâhîm (Abraham)! Where are you going, leaving us in this valley where there is no person whose company we may enjoy, nor is there anything (to enjoy)?\" She repeated that to him many times, but he did not look back at her. Then she asked him, \"Has Allâh ordered you to do so?\" He said, \"Yes.\" She said, \"Then He will not neglect us,\" and returned while Ibrâhîm (Abraham) proceeded onwards, and on reaching the Thaniyyah where they could not see him, he faced the Ka‘bah, and raising both hands invoked Allâh saying the following supplication:\n‘O our Lord! I have made some of my offspring to dwell in an uncultivable valley by Your Sacred House (the Ka‘bah at Makkah); in order, O our Lord, that they may perform As-Salât (Iqâmat-as-Salât). So fill some hearts among men with love towards them, and (O Allâh) provide them with fruits, so that they may give thanks.’ (V.14:37)\nIsmâ‘îl’s (Ishmael) mother went on suckling Ismâ‘îl (Ishmael) and drinking from the water (she had). When the water in the water-skin had all been used up, she became thirsty and her child also became thirsty. She started looking at him [i.e. Ismâ‘îl (Ishmael)] tossing in agony; she left him, for she could not endure looking at him, and found that the mountain of As-Safâ was the nearest mountain to her on that land. She stood on it and started looking at the valley keenly so that she might see somebody, but she could not see anybody. Then she descended from As-Safâ and when she reached the valley, she tucked up her robe and ran in the valley like a person in distress and trouble, till she crossed the valley and reached Al-Marwah mountain where she stood and started looking, expecting to see somebody, but she could not see anybody. She repeated that (running between As-Safâ and Al-Marwah) seven times.\" The Prophet صلى الله عليه وسلم said, \"This is the source of the tradition of the Sa‘y (the going) of people between them (i.e. As-Safâ and Al-Marwah). When she reached Al-Marwah (for the last time) she heard a voice and she asked herself to be quiet and listened attentively. She heard the voice again and said, ‘O (whoever you may be)! You have made me hear your voice; have you got something to help me?’ And behold! She saw an angel at the place of Zamzam , digging the earth with his heel (or his wing), till water flowed from that place. She started to make something like a basin around it, using her hands in this way and started filling her water-skin with water with her hands, and the water was flowing out after she had scooped some of it.\" The Prophet صلى الله عليه وسلم added, \"May Allâh bestow mercy on Ismâ‘îl’s (Ishmael) mother! Had she let the Zamzam (flow without trying to control it) (or had she not scooped from that water) (to fill her water-skin), Zamzam would have been a stream flowing on the surface of the earth.\" The Prophet صلى الله عليه وسلم further added, \"Then she drank (water) and suckled her child. The angel said to her, ‘Don’t be afraid of being neglected, for this is the House of Allâh which will be built by this boy and his father, and Allâh never neglects His people.’ The House (i.e. Ka‘bah) at that time was on a high place resembling a hillock, and when torrents came, they flowed to its right and left. She lived in that way till some people from the tribe of Jurhum or a family from Jurhum passed by her and her child, as they (i.e. the Jurhum people) were coming through the way of Kadâ’. They landed in the lower part of Makkah where they saw a bird that had the habit of flying around water and not leaving it. They said, ‘This bird must be flying around water, though we know that there is no water in this valley.’ They sent one or two messengers who discovered the source of water, and returned to inform them of the water. So, they all came (towards the water).\" The Prophetصلى الله عليه وسلم added, \" Ismâ‘îl’s (Ishmael) mother was sitting near the water. They asked her, ‘Do you allow us to stay with you?’ She replied, ‘Yes, but you will have no right to possess the water.’ They agreed to that.\" The Prophet صلى الله عليه وسلم further said, \" Ismâ‘îl’s (Ishmael) mother was pleased with the whole situation as she used to love to enjoy the company of the people. So, they settled there, and later on they sent for their families who came and settled with them so that some families became permanent residents there. The child [i.e. Ismâ‘îl (Ishmael)] grew up and learnt Arabic from them and (his virtues) caused them to love and admire him as he grew up, and when he reached the age of puberty they made him marry a woman from amongst them. After Ismâ‘îl’s (Ishmael) mother had died, Ibrâhîm (Abraham) came after Ismâ‘îl’s (Ishmael) marriage in order to see his family that he had left before, but he did not find Ismâ‘îl (Ishmael) there. When he asked Ismâ‘îl’s (Ishmael) wife about him, she replied, ‘He has gone in search of our livelihood.’ Then he asked her about their way of living and their condition, and she replied, ‘We are living in misery; we are living in hardship and destitution,’ complaining to him. He said, ‘When your husband returns, convey my salutation to him and tell him to change the threshold of the gate (of his house).’ When Ismâ‘îl (Ishmael) came, he seemed to have felt something unusual, so he asked his wife, ‘Has anyone visited you?’ She replied, ‘Yes, an old man of such and such description came and asked me about you and I informed him, and he asked about our state of living, and I told him that we were living in a hardship and poverty.’ On that Ismâ‘îl (Ishmael) said, ‘Did he advise you anything?’ She replied, ‘Yes, he told me to convey his salutation to you and to tell you to change the threshold of your gate.’ Ismâ‘îl (Ishmael) said, ‘It was my father, and he has ordered me to divorce you. Go back to your family.’ So, Ismâ‘îl (Ishmael) divorced her and married another woman from amongst them (i.e. Jurhum). Then Ibrâhîm (Abraham) stayed away from them for a period as long as Allâh wished and called on them again but did not find Ismâ‘îl (Ishmael). So he came to Ismâ‘îl’s (Ishmael) wife and asked her about Ismâ‘îl (Ishmael). She said, ‘He has gone in search of our livelihood.’ Ibrâhîm (Abraham) asked her, ‘How are you getting on?’ asking her about their sustenance and living. She replied, ‘We are prosperous and well-off (i.e. we have everything in abundance).’ Then she thanked Allâhعز وجل Ibrâhîm (Abraham) said, ‘What kind of food do you eat?’ She said, ‘Meat.’ He said, ‘What do you drink?’ She said, ‘Water.’ He said, ‘O Allâh! Bless their meat and water.’ \" The Prophet صلى الله عليه وسلم added, \"At that time they did not have grain, and if they had grain, he would have also invoked Allâh to bless it.\" The Prophet صلى الله عليه وسلم added, \"If somebody has only these two things as his sustenance, his health and disposition will be badly affected, unless he lives in Makkah.\" The Prophetصلى الله عليه وسلم added, \"Then Ibrâhîm (Abraham) said to Ismâ‘îl’s (Ishmael) wife, ‘When your husband comes, give my regards to him and tell him that he should keep firm the threshold of his gate.’ When Ismâ‘îl (Ishmael) came back, he asked his wife, ‘Did anyone call on you?’ She replied, ‘Yes, a good-looking old man came to me,’ so she praised him and added. ‘He asked about you, and I informed him, and he asked about our livelihood and I told him that we were in a good condition.’ Ismâ‘îl (Ishmael) asked her, ‘Did he give you any piece of advice?’ She said, ‘Yes, he told me to give his regards to you and ordered that you should keep firm the threshold of your gate.’ On that Ismâ‘îl (Ishmael) said, ‘It was my father, and you are the threshold (of the gate). He has ordered me to keep you with me.’ Then Ibrâhîm (Abraham) stayed away from them for a period as long as Allâh wished, and called on them afterwards. He saw Ismâ‘îl (Ishmael) under a tree near Zamzam, sharpening his arrows. When he saw Ibrâhîm (Abraham), he rose up to welcome him (and they greeted each other as a father does with his son or a son does with his father). Ibrâhîm (Abraham) said, ‘O Ismâ‘îl (Ishmael)! Allâh has given me an order.’ Ismâ‘îl (Ishmael) said, ‘Do what your Lord has ordered you to do.’ Ibrâhîm (Abraham) asked, ‘Will you help me?’ Ismâ‘îl (Ishmael) said, ‘I will help you.’ Ibrâhîm (Abraham) said, ‘Allâh has ordered me to build a house here,’ pointing to a hillock higher than the land surrounding it.’\" The Prophet صلى الله عليه وسلم added, \"Then they raised the foundations of the House (i.e. the Ka‘bah). Ismâ‘îl (Ishmael) brought the stones and Ibrâhîm (Abraham) was building; and when the walls became high, Ismâ‘îl (Ishmael) brought this stone and put it for Ibrâhîm (Abraham) who stood over it and carried on building, while Ismâ‘îl (Ishmael) was handing him the stones, and both of them were saying, ‘O our Lord! Accept (this service) from us. Verily, You are the All-Hearer the All-Knower.’\" (V.2:127).\nThe Prophet صلى الله عليه وسلم added, \"Then both of them went on building and going round the Ka‘bah saying ‘O our Lord! Accept (this service) from us. Verily, You are the All-Hearer, the All-Knower.’ \" (V.2:127) [Sahih Al-Bukhari, Vol.4, Hadith No.583].\n* When Ibrâhîm (Abraham) married Hâjar and she conceived Ismâ‘îl (Ishmael), Sârah, Ibrâhîm (Abraham)’s first wife became jealous of her and swore that she would cut three parts from her body. So Hâjar tied a girdle round her waist and ran away, dragging her robe behind her so as to wipe out her tracks lest Sârah should pursue her. \"Allâh knows better.\"","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"rabbanā innī askantu min dhurriyyatī biwādin ghayri dhī zarʿin ʿinda baytika al-muḥarami rabbanā liyuqīmū al-ṣalata fa-ij'ʿal afidatan mina al-nāsi tahwī ilayhim wa-ur'zuq'hum mina al-thamarāti laʿallahum yashkurūna ","translations":["Our Lord","Indeed, I","[I] have settled","(some) of","my offsprings","in a valley","not","with","cultivation","near","Your Sacred House","Your Sacred House","our Lord","That they may establish","the prayers","So make","hearts","of","the men","incline","towards them","and provide them","with","the fruits","so that they may","be grateful","(37)"],"transliterationArr":["rabbanā","innī","askantu","min","dhurriyyatī","biwādin","ghayri","dhī","zarʿin","ʿinda","baytika","al-muḥarami","rabbanā","liyuqīmū","al-ṣalata","fa-ij'ʿal","afidatan","mina","al-nāsi","tahwī","ilayhim","wa-ur'zuq'hum","mina","al-thamarāti","laʿallahum","yashkurūna",null],"verseTiming":[[1,0,2460],[2,2460,3675],[3,3675,5252],[4,5252,5660],[5,5660,7736],[6,7736,8954],[7,8954,9915],[8,9915,10413],[9,10413,10982],[10,10982,12028],[11,12028,12844],[12,12844,14317],[13,14317,16043],[14,16043,17026],[15,17026,18262],[16,18262,19144],[17,19144,20174],[18,20174,21502],[19,21502,22497],[20,22497,23871],[21,23871,26486],[22,26486,27429],[23,27429,29144],[24,29144,31216],[25,31216,32257],[26,32257,33172],[27,33172,34538],[28,34538,37159]]}}