{"name":"16:51","price":" 51. And Allâh said (O mankind!): \"Take not ilâhain (two gods in worship). Verily, He (Allâh) is (the) only One Ilâh[1] (God). Then, fear Me (Allâh جل جلاله) much [and Me (Alone), i.e. be away from all kinds of sins and evil deeds that Allâh has forbidden and do all that Allâh has ordained and worship none but Allâh][2].","arabic":"۞ وَقَالَ ٱللَّهُ لَا تَتَّخِذُوٓاْ إِلَٰهَيۡنِ ٱثۡنَيۡنِۖ إِنَّمَا هُوَ إِلَٰهٞ وَٰحِدٞ فَإِيَّٰيَ فَٱرۡهَبُونِ","category":["16 (An-Nahl)","An-Nahl","Surah An-Nahl","Chapter An-Nahl","Nahl","Surah Nahl","Chapter Nahl","An Nahl","Surah An Nahl","Chapter An Nahl","Surah 16","Chapter 16","The Bee","النَّحل"],"ayahNumber":1952,"juzNumber":14,"footnotes":"[1] (V.16:51) Ilâh: He Who has all the right to be worshipped.\n[2] (V.16:51) Narrated ‘Ubâdah رضي الله عنه: The Prophet صلى الله عليه وسلم said, \"If anyone testifies that Lâ ilâha illallâh (none has the right to be worshipped but Allâh Alone) Who has no partners, and that Muhammad صلى الله عليه وسلم is His slave and His Messenger, and that ‘Îsâ (Jesus) عليه السلام is Allâh’s slave and His Messenger and His Word (\"Be!\" - and he was) which He bestowed on Maryam (Mary) and a spirit (Rûh ) created by Him, and that Paradise is the truth, and Hell is the truth, Allâh will admit him into Paradise with the deeds which he had done even if those deeds were few.\" (Junadah, the subnarrator said, \" ‘Ubâdah added,\n‘Such a person can enter Paradise through any of its eight gates he likes.’ \") (Sahih Al-Bukhari, Vol. 4, Hadith No. 644).","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"waqāla al-lahu lā tattakhidhū ilāhayni ith'nayni innamā huwa ilāhun wāḥidun fa-iyyāya fa-ir'habūni ","translations":["And Allah has said","And Allah has said","(Do) not","take","[two] gods","two","only","He","(is) God","One","so Me Alone","you fear [Me]","(51)"],"transliterationArr":["waqāla","al-lahu","lā","tattakhidhū","ilāhayni","ith'nayni","innamā","huwa","ilāhun","wāḥidun","fa-iyyāya","fa-ir'habūni",null],"verseTiming":[[1,0,810],[2,810,1650],[3,1650,2040],[4,2040,4409],[5,4409,5600],[6,5600,6490],[7,6490,7950],[8,7950,8260],[9,8260,9780],[10,9780,11100],[11,11100,12370],[12,12370,14915]]}}