{"name":"17:45","price":" 45. And when you (Muhammad صلى الله عليه و سلم) recite the Qur’ân, We put between you and those who believe not in the Hereafter, an invisible veil[1] (or screen their hearts, so they hear or understand it not).","arabic":"وَإِذَا قَرَأۡتَ ٱلۡقُرۡءَانَ جَعَلۡنَا بَيۡنَكَ وَبَيۡنَ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱلۡأٓخِرَةِ حِجَابٗا مَّسۡتُورٗا","category":["17 (Al-Isra)","Al-Isra","Surah Al-Isra","Chapter Al-Isra","Isra","Surah Isra","Chapter Isra","Al Isra","Surah Al Isra","Chapter Al Isra","Surah 17","Chapter 17","The Night Journey","الإسرَاء"],"ayahNumber":2074,"juzNumber":15,"footnotes":"(V.17:45) It is said in the Book of Tafsîr (Imâm Qurtubî) as regards this Verse (17:45):\nNarrated Sa‘îd bin Jubair رضي الله عنه \"When the Sûrah No.111 (Tabbat Yadâ) was revealed, the wife of Abu Lahab came looking for the Prophet صلى الله عليه وسلم while Abu Bakr رضي الله عنه, was sitting beside him. Abu Bakr said to the Prophet صلى الله عليه وسلم: \"I wish if you get aside (or go away) as she is coming to us, she may harm you.\" The Prophet صلى الله عليه وسلم said: \"There will be a screen set between me and her.\" So she did not see him. She said to Abu Bakr: \"Your companion is saying poetry against me,\" Abu Bakr said: \"By Allâh, he does not say poetry.\" She said: \"Do you believe that?\" Then she left. Abu Bakr said, \"O Allâh’s Messenger! She did not see you.\" The Prophet صلى الله عليه وسلم said: \"An angel was screening me from her.\" [This Hadith is quoted in Musnad Abu Ya‘la.]\nIt is said that if the above Verse (17:45) is recited by a real believer (of Islâmic Monotheism) he will be screened from a disbeliever. (Allâh knows better). (Tafsîr Al-Qurtubî, Vol.10, Page 269).","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"wa-idhā qarata al-qur'āna jaʿalnā baynaka wabayna alladhīna lā yu'minūna bil-ākhirati ḥijāban mastūran ","translations":["And when","you recite","the Quran","We place","between you","and between","those who","(do) not","believe","in the Hereafter","a barrier","hidden","(45)"],"transliterationArr":["wa-idhā","qarata","al-qur'āna","jaʿalnā","baynaka","wabayna","alladhīna","lā","yu'minūna","bil-ākhirati","ḥijāban","mastūran",null],"verseTiming":[[1,0,880],[2,880,1730],[3,1730,3050],[4,3050,4140],[5,4140,5110],[6,5110,5860],[7,5860,7050],[8,7050,7460],[9,7460,8770],[10,8770,10210],[11,10210,11070],[12,11070,13505]]}}