{"name":"17:79","price":" 79. And in some parts of the night (also) offer the Salât (prayer) with it (i.e. recite the Qur’ân in the prayer), as an additional prayer (Tahajjud optional prayer - Nawâfil) for you (O Muhammad صلى الله عليه و سلم). It may be that your Lord will raise you to Maqâm Mahmûd (a station of praise and glory, i.e. the honour of intercession on the Day of Resurrection.)[3].","arabic":"وَمِنَ ٱلَّيۡلِ فَتَهَجَّدۡ بِهِۦ نَافِلَةٗ لَّكَ عَسَىٰٓ أَن يَبۡعَثَكَ رَبُّكَ مَقَامٗا مَّحۡمُودٗا","category":["17 (Al-Isra)","Al-Isra","Surah Al-Isra","Chapter Al-Isra","Isra","Surah Isra","Chapter Isra","Al Isra","Surah Al Isra","Chapter Al Isra","Surah 17","Chapter 17","The Night Journey","الإسرَاء"],"ayahNumber":2108,"juzNumber":15,"footnotes":"(V.17:79)\nA). Narrated Ibn ‘Umar رضي الله عنهما \"On the Day of Resurrection the people will fall on their knees and every nation will follow their Prophet and they will say, ‘O so-and-so! Intercede (for us with Allâh)’, till (the right of) of intercession will be given to the Prophet (Muhammad صلى الله عليه وسلم) and that will be the day when Allâh will raise him to Maqâm Mahmûd (a station of praise and glory i.e the honour of intercession on the Day of Resurrection)\". (Sahih Al-Bukhari, Vol.6, Hadith No.242)\nB). Narrated Jâbir bin ‘Abdullâhرضي الله عنهما: Allâh’s Messenger صلى الله عليه وسلم said, \"Whoever, after listening to the Adhân (call for the prayer) says, ‘O Allâh, the Lord of this complete call and of this prayer, which is going to be established! Give Muhammad Al-Wasîlah and Al-Fadîlah* and raise him to Maqâm Mahmûd , which You have promised him,’ will be granted my intercession for him on the Day of Resurrection.\" (Sahih Al-Bukhari, Vol.6, Hadith No.243).\n* Al-Wasîlah is the highest position in Paradise which is granted to the Prophet صلى الله عليه وسلم particularly; Al-Fadîlah is the extra degree of honour which is bestowed on him above all creation.","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"wamina al-layli fatahajjad bihi nāfilatan laka ʿasā an yabʿathaka rabbuka maqāman maḥmūdan ","translations":["And from","the night","arise from sleep for prayer","with it","(as) additional","for you","it may be","that","will raise you","your Lord","(to) a station","praiseworthy","(79)"],"transliterationArr":["wamina","al-layli","fatahajjad","bihi","nāfilatan","laka","ʿasā","an","yabʿathaka","rabbuka","maqāman","maḥmūdan",null],"verseTiming":[[1,0,660],[2,660,1630],[3,1630,2900],[4,2900,3520],[5,3520,4890],[6,4890,5300],[7,5300,5980],[8,5980,6720],[9,6720,9080],[10,9080,10000],[11,10000,10910],[12,10910,13385]]}}