{"name":"18:104","price":" 104. \"Those whose efforts have been wasted in this life while they thought that they were acquiring good by their deeds.[2]","arabic":"ٱلَّذِينَ ضَلَّ سَعۡيُهُمۡ فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَهُمۡ يَحۡسَبُونَ أَنَّهُمۡ يُحۡسِنُونَ صُنۡعًا","category":["18 (Al-Kahf)","Al-Kahf","Surah Al-Kahf","Chapter Al-Kahf","Kahf","Surah Kahf","Chapter Kahf","Al Kahf","Surah Al Kahf","Chapter Al Kahf","Surah 18","Chapter 18","The Cave","الكَهف"],"ayahNumber":2244,"juzNumber":16,"footnotes":"(V.18:104) For the acceptance of the righteous deeds it is stipulated that the following two basic conditions must be fulfilled:\na) The intentions while doing such deeds must be totally for Allâh’s sake only without any show-off or to gain praise or fame.\nb) Such a deed must be performed in accordance with the Sunnah of Allâh’s Messenger Muhammad bin ‘Abdullâh صلى الله عليه وسلم , the last of the Prophets and the Messengers.\nNarrated ‘Âishah رضي الله عنها : Allâh’s Messenger صلى الله عليه وسلم said, \"If somebody innovates something which is not present in our religion (of Islâmic Monotheism), then that thing will be rejected.\" (Sahih Al-Bukhari, Vol.3, Hadith No.861).\nIn another Hadith narrated ‘Âishah رضي الله عنها: The Prophet صلى الله عليه وسلم said: \"Whoever performs a (good) deed which we have not ordered (anyone) to do (or is not in accord with our religion of Islâmic Monotheism), then that deed will be rejected and will not be accepted.\" (Sahih Al-Bukhari, Vol.9, Chapter No.20 before Hadith No.449).","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"alladhīna ḍalla saʿyuhum fī al-ḥayati al-dun'yā wahum yaḥsabūna annahum yuḥ'sinūna ṣun'ʿan ","translations":["Those ","is lost","their effort","in","the life","(of) the world","while they","think","that they","(were) acquiring good","(in) work","(104)"],"transliterationArr":["alladhīna","ḍalla","saʿyuhum","fī","al-ḥayati","al-dun'yā","wahum","yaḥsabūna","annahum","yuḥ'sinūna","ṣun'ʿan",null],"verseTiming":[[1,0,1260],[2,1260,1980],[3,1980,3150],[4,3150,3400],[5,3400,4570],[6,4570,5610],[7,5610,6290],[8,6290,9230],[9,9230,9850],[10,9850,11240],[11,11240,12680],[12,12680,13970],[13,13970,15065]]}}