{"name":"18:102","price":" 102. Do then those who disbelieved think that they can take My slaves [i.e., the angels, Allâh’s Messengers, ‘Îsâ (Jesus), son of Maryam (Mary)] as Auliyâ’ (lords, gods, protectors) besides Me? Verily, We have prepared Hell as an entertainment for the disbelievers (in the Oneness of Allâh - Islâmic Monotheism)[1].","arabic":"أَفَحَسِبَ ٱلَّذِينَ كَفَرُوٓاْ أَن يَتَّخِذُواْ عِبَادِي مِن دُونِيٓ أَوۡلِيَآءَۚ إِنَّآ أَعۡتَدۡنَا جَهَنَّمَ لِلۡكَٰفِرِينَ نُزُلٗا","category":["18 (Al-Kahf)","Al-Kahf","Surah Al-Kahf","Chapter Al-Kahf","Kahf","Surah Kahf","Chapter Kahf","Al Kahf","Surah Al Kahf","Chapter Al Kahf","Surah 18","Chapter 18","The Cave","الكَهف"],"ayahNumber":2242,"juzNumber":16,"footnotes":"(V.18:102) Almighty Allâh says: \"They (Jews and Christians) took their rabbis and their monks to be their lords (by obeying them in things that they made lawful or unlawful according to their own desires without being ordered by Allâh) besides Allâh, and (they also took as their Lord) Messiah, son of Maryam (Mary), while they (Jews and Christians) were commanded [in the Taurât (Torah) and the Injeel (Gospel)] to worship none but one Ilâh (God - Allâh), Lâ ilâha illa Huwa (none has the right to be worshipped but He). Praise and Glory be to Him, (far above is He) from having the partners they associate (with Him).\" [The Qur’ân, Verse 9:31]\nOnce, while Allâh’s Messenger صلى الله عليه وسلم was reciting the above Verse, ‘Adi bin Hâtim said, \"O Allâh’s Prophet! They do not worship them (rabbis and monks).\" Allâh’s Messengerصلى الله عليه وسلم said, \"They certainly do. They (i.e. rabbis and monks) made legal things illegal, and illegal things legal, and they (i.e. Jews and Christians) followed them, and by doing so they really worshipped them.\" [Narrated by Ahmad, At-Tirmidhi, and Ibn Jarir. (Tafsîr At-Tabarî, Vol.10, Page No.114)]","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"afaḥasiba alladhīna kafarū an yattakhidhū ʿibādī min dūnī awliyāa innā aʿtadnā jahannama lil'kāfirīna nuzulan ","translations":["Do then think","those who","disbelieve","that","they (can) take","My servants","besides Me","besides Me","(as) protectors","Indeed, We ","We have prepared","Hell","for the disbelievers","(as) a lodging","(102)"],"transliterationArr":["afaḥasiba","alladhīna","kafarū","an","yattakhidhū","ʿibādī","min","dūnī","awliyāa","innā","aʿtadnā","jahannama","lil'kāfirīna","nuzulan",null],"verseTiming":[[1,0,1030],[2,1030,2180],[3,2180,4130],[4,4130,4660],[5,4660,6370],[6,6370,7450],[7,7450,8040],[8,8040,10950],[9,10950,13750],[10,13750,17190],[11,17190,19030],[12,19030,20720],[13,20720,22560],[14,22560,23905]]}}