{"name":"18:60","price":" 60. And (remember) when Mûsâ (Moses) said to his boy-servant: \"I will not give up (travelling) until I reach the junction of the two seas or (until) I spend years and years in travelling.\"[1]","arabic":"وَإِذۡ قَالَ مُوسَىٰ لِفَتَىٰهُ لَآ أَبۡرَحُ حَتَّىٰٓ أَبۡلُغَ مَجۡمَعَ ٱلۡبَحۡرَيۡنِ أَوۡ أَمۡضِيَ حُقُبٗا","category":["18 (Al-Kahf)","Al-Kahf","Surah Al-Kahf","Chapter Al-Kahf","Kahf","Surah Kahf","Chapter Kahf","Al Kahf","Surah Al Kahf","Chapter Al Kahf","Surah 18","Chapter 18","The Cave","الكَهف"],"ayahNumber":2200,"juzNumber":15,"footnotes":"(V.18:60) The Story of Mûsâ (Moses) and Khidr عليهما السلام Narrated Sa‘îd bin Jubair: I said to Ibn ‘Abbâs, \"Nauf Al-Bikâli claims that Mûsâ (Moses), the companion of Al-Khidr was not the Mûsâ (Moses) of the Children of Israel.\" Ibn ‘Abbâs said, \"The enemy of Allâh (Nauf) told a lie.\" Narrated Ubayy bin Ka‘b that he heard Allâh’s Messenger صلى الله عليه وسلم saying, \"Mûsâ (Moses) got up to deliver a speech before the Children of Israel and he was asked, ‘Who is the most learned person among the people?’ Mûsâ (Moses) replied, ‘I (am the most learned).’ Allâh admonished him for he did not ascribe knowledge to Allâh Alone.\nSo Allâh revealed to him: ‘At the junction of the two seas there is a slave of Ours who is more learned than you.’ Mûsâ (Moses) asked, ‘O my Lord, how can I meet him?’ Allâh said, Take a fish and put it in a basket and then proceed (set out and where you lose the fish, you will find him).’ So Mûsâ (Moses) (took a fish and put it in a basket and) set out, along with his boy-servant Yûsha‘ bin Nûn, till they reached a rock (on which) they both lay their heads and slept. The fish moved vigorously in the basket and got out of it and fell into the sea and there it took its way through the sea (straight) as in a tunnel. (V.18:61) Allâh stopped the current of water on both sides of the way created by the fish, and so that way was like a tunnel. When Mûsâ (Moses) got up, his companion forgot to tell him about the fish, and so they carried on their journey during the rest of the day and the whole night. The next morning Mûsâ (Moses) asked his boy-servant ‘Bring us our morning meal; truly, we have suffered much fatigue in this, our journey.’ (V.18:62)\nMûsâ (Moses) did not get tired till he had passed the place which Allâh had ordered him to seek after. His boy-servant then said to him, ‘Do you remember when we betook ourselves to the rock? I indeed forgot the fish; none but Satan made me forget to remember it. It took its course into the sea in a strange way.’ (V.18:63)\nThere was a tunnel for the fish and for Mûsâ (Moses) and his boy-servant there was astonishment. Mûsâ (Moses) said, ‘That is what we have been seeking’. So they went back retracing their footsteps. (V.18:64) They both returned, retracing their steps till they reached the rock. Behold! There they found a man covered with a garment. Mûsâ (Moses) greeted him. Al-Khidr said astonishingly. ‘Is there such a greeting in your land?’ Mûsâ (Moses) said, ‘I am Mûsâ (Moses).’ He said, ‘Are you the Mûsâ (Moses) of the Children of Israel?’ Mûsâ (Moses) said, ‘Yes’; and added, ‘I have come to you so that you may teach me something of that knowledge which you have been taught’.\nAl-Khidr said, ‘You will not be able to have patience with me.’ (V.18:67)\n‘O Mûsâ (Moses)! I have some of Allâh’s Knowledge which He has bestowed upon me but you do not know it; and you too, have some of Allâh’s Knowledge which He has bestowed upon you, but I do not know it.\" Mûsâ (Moses) said, ‘If Allâh wills, you will find me patient, and I will not disobey you in aught.’ (V.18:69).\nAl-Khidr said to him. ‘Then, if you follow me, ask me not about anything till I myself mention it to you.’ (V.18:70). After that both of them proceeded along the sea coast, till a ship passed by and they requested the crew to let them go on board. The crew recognized Al-Khidr and allowed them to get on board free of charge. When they got on board, suddenly Mûsâ (Moses) saw that Al-Khidr had pulled out one of the planks of the ship with an adze. Mûsâ (Moses) said to him, ‘These people gave us a free lift, yet you have scuttled their ship so as to drown its people! Verily, you have committed a thing ‘Imra’ (a Munkar - evil, bad, dreadful thing).’ (V.18:71)\nAl-Khidr said, ‘Did I not tell you, that you would not be able to have patience with me?’ (V.18:72)\nMûsâ (Moses) said, ‘Call me not to account for what I forgot and be not hard upon me for my affair (with you.)’ (V.18:73).\"\nAllâh’s Messenger صلى الله عليه وسلم said, \"The first excuse given by Mûsâ (Moses), was that he had forgotten. Then a sparrow came and sat over the edge of the ship and dipped its beak once in the sea. Al-Khidr said to Mûsâ (Moses), ‘My knowledge and your knowledge, compared to Allâh’s Knowledge is like what this sparrow has taken out of the sea.’ Then they both got out of the ship, and while they were walking on the sea shore, Al-Khidr saw a boy playing with other boys. Al-Khidr got hold of the head of that boy and pulled it out with his hands and killed him. Mûsâ (Moses) said, ‘Have you killed an innocent person who had killed none! Verily, you have committed a thing ‘Nukra’ (a great Munkar - prohibited, evil, dreadful thing)!’ (V.18:74) He said, ‘Did I not tell you that you would not be able to have patience with me?’ (V.18:75) (The subnarrator said, ‘The second blame was stronger than the first one). Mûsâ (Moses) said, ‘If I ask you anything after this, keep me not in your company; you have received an excuse from me.’ (V.18:76)\nThen they both proceeded until they came to the people of a town. They asked them for food but they refused to entertain them. (Then) they found there a wall on the point of falling down. (V.18:77) (Al-Khidr) set it up straight with his own hands. Mûsâ (Moses) said, ‘We came to these people, but they neither fed us nor received us as guests. If you had wished, you could surely have exacted some recompense for it.’ (Al-Khidr) said, ‘This is the parting between me and you, (please read V. 18:79, 80-82) that is the interpretation of those (things) over which you could not hold patience.’ (V.18:78-82).\"\nAllâh’s Messenger صلى الله عليه وسلم said, \"We wished Mûsâ (Moses) had more patience so that Allâh might have described to us more about their story.\" (Sahih Al-Bukhari, Vol.6, Hadith No.249).","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"wa-idh qāla mūsā lifatāhu lā abraḥu ḥattā ablugha majmaʿa al-baḥrayni aw amḍiya ḥuquban ","translations":["And when","said","Musa","to his boy","Not","I will cease","until","I reach","the junction","(of) the two seas","or","I continue","(for) a long period","(60)"],"transliterationArr":["wa-idh","qāla","mūsā","lifatāhu","lā","abraḥu","ḥattā","ablugha","majmaʿa","al-baḥrayni","aw","amḍiya","ḥuquban",null],"verseTiming":[[1,0,720],[2,720,1475],[3,1475,2165],[4,2165,3429],[5,3429,3895],[6,3895,6197],[7,6197,8671],[8,8671,9584],[9,9584,10281],[10,10281,11485],[11,11485,12025],[12,12025,12843],[13,12843,13898]]}}