{"name":"19:39","price":" 39. And warn them (O Muhammad صلى الله عليه وسلم) of the Day of grief and regrets, when the case has been decided, while (now) they are in a state of carelessness, and they believe not[1].","arabic":"وَأَنذِرۡهُمۡ يَوۡمَ ٱلۡحَسۡرَةِ إِذۡ قُضِيَ ٱلۡأَمۡرُ وَهُمۡ فِي غَفۡلَةٖ وَهُمۡ لَا يُؤۡمِنُونَ","category":["19 (Maryam)","Maryam","Surah Maryam","Chapter Maryam","Surah 19","Chapter 19","Mary","مَريَم"],"ayahNumber":2289,"juzNumber":16,"footnotes":"(V.19:39) Narrated Abu Sa‘îd Al-Khudrî رضي الله عنه: Allâh’s Messenger صلى الله عليه وسلم said, \"On the Day of Resurrection, death will be brought forward in the shape of a black and white ram. Then a call-maker will call, ‘O people of Paradise!’ Thereupon they will stretch their necks and look carefully. The caller will say, ‘Do you know this?’ They will say: ‘Yes, this is death.’ By then all of them would have seen it. Then it will be announced again, ‘O people of Hell!’ They will stretch their necks and look carefully. The caller will say, ‘Do you know this?’ They will say, ‘Yes, this is death.’ \" And by then all of them would have seen it. Then it (that ram) will be slaughtered and the caller will say. ‘O people of Paradise! Eternity for you and no death. O people of Hell! Eternity for you and no death.’ Then the Prophet صلى الله عليه وسلم recited: \"And warn them (O Muhammad صلى الله عليه وسلم) of the Day of grief and regrets when the case has been decided, while (now) they (i.e. the people of the world) are in a state of carelessness and they believe not.\" (Sahih Al-Bukhari, Vol.6, Hadith No. 254).","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"wa-andhir'hum yawma al-ḥasrati idh quḍiya al-amru wahum fī ghaflatin wahum lā yu'minūna ","translations":["And warn them","(of the) Day","(of) the Regret","when","has been decided","the matter","And they","(are) in","heedlessness","and they","(do) not","believe","(39)"],"transliterationArr":["wa-andhir'hum","yawma","al-ḥasrati","idh","quḍiya","al-amru","wahum","fī","ghaflatin","wahum","lā","yu'minūna",null],"verseTiming":[[1,0,2130],[2,2130,2800],[3,2800,4040],[4,4040,4490],[5,4490,5140],[6,5140,6160],[7,6160,6760],[8,6760,7250],[9,7250,8980],[10,8980,9800],[11,9800,10400],[12,10400,13595]]}}