{"name":"20:134","price":" 134. And if We had destroyed them with a torment before this (i.e. Messenger Muhammad صلى الله عليه وسلم and the Qur’ân), they would surely have said: \"Our Lord! If only You had sent us a Messenger, we should certainly have followed Your Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.), before we were humiliated and disgraced.\"[1]","arabic":"وَلَوۡ أَنَّآ أَهۡلَكۡنَٰهُم بِعَذَابٖ مِّن قَبۡلِهِۦ لَقَالُواْ رَبَّنَا لَوۡلَآ أَرۡسَلۡتَ إِلَيۡنَا رَسُولٗا فَنَتَّبِعَ ءَايَٰتِكَ مِن قَبۡلِ أَن نَّذِلَّ وَنَخۡزَىٰ","category":["20 (Ta-Ha)","Ta-Ha","Surah Ta-Ha","Chapter Ta-Ha","Ha","Surah Ha","Chapter Ha","Ta Ha","Surah Ta Ha","Chapter Ta Ha","Surah 20","Chapter 20","Ta-Ha","طه"],"ayahNumber":2482,"juzNumber":16,"footnotes":"(V.20:134) Narrated Abu Sa‘îd Al-Khudrî رضي الله عنه: ‘Alî bin Abî Tâlib sent a piece of gold, not yet taken out of its ore, in a tanned leather container to Allâh’s Messenger صلى الله عليه وسلم . Allâh’s Messenger صلى الله عليه وسلم distributed that amongst four persons: ‘Uyainah bin Badr, Aqra‘ bin Hâbis, Zaid Al-Khail and the fourth was either ‘Alqamah or ‘Âmir bin At-Tufail. On that, one of his companions said, \"We are more deserving of this (gold) than these (persons).\" When that news reached the Prophet صلى الله عليه وسلم he said, \"Don’t you trust me though I am the trustworthy man of the One in the heavens, and I receive the news of heavens (i.e. Divine Revelation) both in the morning and in the evening?\" There got up a man with sunken eyes, raised cheek bones, raised forehead, a thick beard, a shaven head and a waist-sheet that was tucked up and he said, \"O Allâh’s Messenger! Be afraid of Allâh.\" The Prophet صلى الله عليه وسلم said, \"Woe to you! Am I not of all the people of the earth the most entitled to fear Allâh?\" Then that man went away. Khâlid bin Al-Walîd said, \"O Allâh’s Messenger! Shall I chop his neck off?\" The Prophet صلى الله عليه وسلم said, \"No, may be he offers prayers.\" Khâlid said, \"Numerous are those who offer prayers and say by their tongues (i.e. mouths) what is not in their hearts.\" Allâh’s Messenger صلى الله عليه وسلم said, \"I have not been ordered (by Allâh) to search the hearts of the people or cut open their bellies.\" Then the Prophet صلى الله عليه وسلم looked at him (i.e. that man) while the latter was going away and said, \"From the offspring of this (man) there will come out (people) who will recite the Qur’ân continuously and elegantly but it will not exceed their throats. (They will neither understand it nor act upon it). They would go out of the religion (i.e., discard Islâm) as an arrow goes out through a game’s body.\" I think he also said, \"If I should be present at their time, I would kill them as the nations of Thamûd were killed.\" [Sahih Al-Bukhari, Vol.5, Hadith No.638].","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"walaw annā ahlaknāhum biʿadhābin min qablihi laqālū rabbanā lawlā arsalta ilaynā rasūlan fanattabiʿa āyātika min qabli an nadhilla wanakhzā ","translations":["And if","We","(had) destroyed them","with a punishment","before him","before him","surely they (would) have said","Our Lord","why not","You sent","to us","a Messenger","so we (could) have followed","Your signs","before","before","[that]","we were humiliated","and disgraced","(134)"],"transliterationArr":["walaw","annā","ahlaknāhum","biʿadhābin","min","qablihi","laqālū","rabbanā","lawlā","arsalta","ilaynā","rasūlan","fanattabiʿa","āyātika","min","qabli","an","nadhilla","wanakhzā",null],"verseTiming":[[1,0,5090],[2,5090,5700],[3,5700,8550],[4,8550,9660],[5,9660,10800],[6,10800,12260],[7,12260,13150],[8,13150,15210],[9,15210,16240],[10,16240,17140],[11,17140,18170],[12,18170,20380],[13,20380,21620],[14,21620,22720],[15,22720,23290],[16,23290,23540],[17,23540,25299],[18,25299,26305]]}}