{"name":"2:139","price":" 139. Say (O Muhammad صلى الله عليه وسلم to the Jews and Christians), \"Dispute you with us about Allâh while He is our Lord and your Lord? And we are to be rewarded for our deeds and you for your deeds.[2] And we are sincere to Him [in worship and obedience (i.e. we worship Him Alone and none else, and we obey His Orders)].\"","arabic":"قُلۡ أَتُحَآجُّونَنَا فِي ٱللَّهِ وَهُوَ رَبُّنَا وَرَبُّكُمۡ وَلَنَآ أَعۡمَٰلُنَا وَلَكُمۡ أَعۡمَٰلُكُمۡ وَنَحۡنُ لَهُۥ مُخۡلِصُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":146,"juzNumber":1,"footnotes":"(V.2:139):\na) \"Narrated Al-Mughirah bin Shu‘bah: The Prophet صلى الله عليه وسلم used to pray so much that his feet used to become edematous or swollen, and when he was asked as to why he prays so much, he would say: \"Shall I not be a thankful slave (to Allâh)?\" (Sahih Al-Bukhâri, Vol.8, Hadîth No.478).\nb) Narrated ‘Âishah رضي الله عنها: The Prophet صلى الله عليه وسلم said, \"Do good deeds properly, sincerely and moderately, and receive good news because one’s good deeds will not make him enter Paradise.\" They asked, \"Even you, O Allâh’s Messenger?\" He said, \"Even I, unless and until Allâh protects or covers me with His pardon and His Mercy.\" (Sahih Al-Bukhâri, Vol.8, Hadîth No.474).\nc) Narrated Abû Hurairah رضي الله عنه: Allâh’s Messenger صلى الله عليه وسلم said, \"If I had gold equal to the mountain of Uhud, it would not please me that anything of it should remain with me after three nights (i.e., I would spend all of it in Allâh’s Cause) except what I would keep for repaying debts.\" (Sahih Al-Bukhâri, Vol.8, Hadîth No.452.\nd) Narrated ‘Abdullâh رضي الله عنه: The Prophet صلى الله عليه وسلم said, \"Who among you considers the wealth of his heirs dearer to him than his own wealth?\" They replied, \"O Allâh’s Messenger! There is none among us but loves his own wealth more.\" The Prophet صلى الله عليه وسلم said, \"So his wealth is whatever he spends (in Allâh’s Cause), during his life (on good deeds) while the wealth of his heirs is whatever he leaves after his death.\" (Sahih Al-Bukhâri, Vol.8, Hadîth No.449)\ne) Narrated Abu Hurairah رضي الله عنه: The Prophet صلى الله عليه وسلم said, \"While a dog was going round a well and was about to die of thirst, an Israeli prostitute saw it and took off her shoes and watered it. So Allâh forgave her because of that good deed.\" (Sahih Al-Bukhâri, Vol.8, Hadîth No.673).\n","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"qul atuḥājjūnanā fī al-lahi wahuwa rabbunā warabbukum walanā aʿmālunā walakum aʿmālukum wanaḥnu lahu mukh'liṣūna ","translations":["Say","Do you argue with us","about","Allah","while He","(is) our Lord","and your Lord","And for us","(are) our deeds","and for you","(are) your deeds","and we","to Him","(are) sincere","(139)"],"transliterationArr":["qul","atuḥājjūnanā","fī","al-lahi","wahuwa","rabbunā","warabbukum","walanā","aʿmālunā","walakum","aʿmālukum","wanaḥnu","lahu","mukh'liṣūna",null],"verseTiming":[[1,0,420],[2,420,4550],[3,4550,4950],[4,4950,5600],[5,5600,6260],[6,6260,7230],[7,7230,8550],[8,8550,10700],[9,10700,12140],[10,12140,12990],[11,12990,14450],[12,14450,15210],[13,15210,15820],[14,15820,18315]]}}