{"name":"2:135","price":" 135. And they say, \"Be Jews or Christians, then you will be guided.\" Say (to them O Muhammad صلى الله عليه وسلم), \"Nay, (we follow) only the religion of Ibrâhîm (Abraham), Hanîfa [Islâmic Monotheism, i.e. to worship none but Allâh (Alone)], and he was not of Al-Mushrikûn (those who worshipped others along with Allâh - see V.2:105).\"[1]","arabic":"وَقَالُواْ كُونُواْ هُودًا أَوۡ نَصَٰرَىٰ تَهۡتَدُواْۗ قُلۡ بَلۡ مِلَّةَ إِبۡرَٰهِـۧمَ حَنِيفٗاۖ وَمَا كَانَ مِنَ ٱلۡمُشۡرِكِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":142,"juzNumber":1,"footnotes":"(V.2:135) Narration about Zaid bin ‘Amr bin Nufail.\nNarrated ‘Abdullâh bin ‘Umar رضي الله عنهما: The Prophet صلى الله عليه وسلم met Zaid bin ‘Amr bin Nufail in the bottom of (the valley of) Baldah before the descent of any Divine revelation to the Prophet صلى الله عليه وسلم. A meal was presented to the Prophet صلى الله عليه وسلم but he refused to eat from it. (Then it was presented to Zaid) who said, \"I do not eat anything which you slaughter on your Nusub * in the name of your idols, etc. I eat only those (animals meat) on which Allâh’s Name has been mentioned at the time of (their) slaughtering.\" Zaid bin ‘Amr used to criticise the way Quraish used to slaughter their animals and used to say, \"Allâh has created the sheep and He has sent the water for it from the sky, and He has grown the grass for it from the earth; yet you slaughter it in others than the Name of Allâh.\" He used to say so, for he rejected that practice and considered it as something abominable.\nNarrated Ibn ‘Umar رضي الله عنهما: Zaid bin ‘Amr bin Nufail went to Shâm (the region comprising Syria, Lebanon, Palestine and Jordan), enquiring about a true religion to follow. He met a Jewish religious scholar and asked him about their religion. He said, \"I intend to embrace your religion, so tell me something about it\". The Jew said, \"You will not embrace our religion unless you receive your share of Allâh’s Anger. Zaid said, I do not run except from Allâh’s Anger, and I will never bear a bit of it if I have the power to avoid it. Can you tell me of some other religion? He said, \"I do not know any other religion except Hanîf (Islâmic Monotheism).\" Zaid enquired, \"What is Hanîf?\" He said, \"Hanîf is the religion of (the Prophet) Ibrâhîm (Abraham) عليه السلام, he was neither a Jew nor a Christian, and he used to worship none but Allâh (Alone) - Islâmic Monotheism.\" Then Zaid went out and met a Christian religious scholar and told him the same (as before). The Christian said, \"You will not embrace our religion unless you get a share of Allâh’s Curse.\" Zaid replied, \"I do not run except from Allâh’s Curse, and I will never bear any of Allâh’s Curse and His Anger if I have the power to avoid them. Will you tell me of some other religion?\" He replied, \"I do not know any other religion except Hanîf (Islâmic Monotheism).\" Zaid enquired, \"What is Hanîf ?\" He replied \"Hanîf is the religion of (the Prophet) Ibrâhîm (Abraham) عليه السلام, he was neither a Jew nor a Christian, and he used to worship none but Allâh (Alone) - Islâmic Monotheism.\" When Zaid heard their statement about (the religion of) Ibrâhîm (Abraham), he left that place, and when he came out, he raised both his hands and said, \"O Allâh! I make You my Witness that I am on the religion of Ibrâhîm (Abraham)\".\nNarrated Asmâ bint Abu Bakr رضي الله عنها: I saw Zaid bin ‘Amr bin Nufail standing with his back against the Ka‘bah and saying, \"O people of Quraish! By Allâh, none amongst you is on the religion of Ibrâhîm (Abraham) except me.\" She added: He (Zaid) used to preserve the lives of little girls: if somebody wanted to kill his daughter he would say to him, \"Do not kill her for I will feed her on your behalf\". So he would take her, and when she grew up nicely, he would say to her father, ‘Now if you will (wish), I will give her to you, and if you will (wish), I will feed her on your behalf.\" (Sahih Al-Bukhâri, Vol.5, Hadîth No.169).\n* Nusub: See the glossary.","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"waqālū kūnū hūdan aw naṣārā tahtadū qul bal millata ib'rāhīma ḥanīfan wamā kāna mina al-mush'rikīna ","translations":["And they said","Be","Jews","or","Christians","(then) you will be guided","Say","Nay","(the) religion","(of) Ibrahim","(the) upright","and not","he was","of","those who associated partners (with Allah)","(135)"],"transliterationArr":["waqālū","kūnū","hūdan","aw","naṣārā","tahtadū","qul","bal","millata","ib'rāhīma","ḥanīfan","wamā","kāna","mina","al-mush'rikīna",null],"verseTiming":[[1,0,1090],[2,1090,2000],[3,2000,2800],[4,2800,3200],[5,3200,4280],[6,4280,5430],[7,5430,6280],[8,6280,6710],[9,6710,7560],[10,7560,8890],[11,8890,10490],[12,10490,10940],[13,10940,11620],[14,11620,11960],[15,11960,15185]]}}