{"name":"2:172","price":" 172. O you who believe (in the Oneness of Allâh - Islâmic Monotheism)! Eat of the lawful things that We have provided you[1] with, and be grateful to Allâh, if it is indeed He Whom you worship.","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ كُلُواْ مِن طَيِّبَٰتِ مَا رَزَقۡنَٰكُمۡ وَٱشۡكُرُواْ لِلَّهِ إِن كُنتُمۡ إِيَّاهُ تَعۡبُدُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":179,"juzNumber":2,"footnotes":"(V.2:172) Narrated An-Nu‘mân bin Bashîr رضي الله عنه: I heard Allâh’s Messenger صلى الله عليه وسلم saying, \"Both legal and illegal things are evident but in between them there are doubtful (unclear) things, and most of the people have no knowledge about them. So whoever saves himself from these unclear things, he saves his religion and his honour. And whoever indulges in these unclear things is like a shepherd who grazes (his animals) near the Himâ (private pasture) of someone else, and at any moment he is liable to get in it. (O people!) Beware! Every king has a Himâ and the Himâ of Allâh عز وجل on the earth is His illegal (forbidden) things. Beware! There is a piece of flesh in the body if it becomes good (reformed), the whole body becomes good, but if it gets spoilt, the whole body gets spoilt and that is the heart.\" (Sahih Al-Bukhâri, Vol.1, Hadîth No.49).","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"yāayyuhā alladhīna āmanū kulū min ṭayyibāti mā razaqnākum wa-ush'kurū lillahi in kuntum iyyāhu taʿbudūna ","translations":["O you","who","believe[d]","Eat","from","(the) good","(of) what","We have provided you","and be grateful","to Allah","if","you","alone","worship Him","(172)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","kulū","min","ṭayyibāti","mā","razaqnākum","wa-ush'kurū","lillahi","in","kuntum","iyyāhu","taʿbudūna",null],"verseTiming":[[1,0,2650],[2,2650,3530],[3,3530,4400],[4,4400,4990],[5,4990,5840],[6,5840,6990],[7,6990,7280],[8,7280,8640],[9,8640,9460],[10,9460,11830],[11,11830,12690],[12,12690,13610],[13,13610,14610],[14,14610,16010],[15,16010,16880],[16,16880,19815]]}}