{"name":"2:185","price":" 185. The month of Ramadan in which was revealed the Qur’ân, a guidance for mankind and clear proofs for the guidance and the criterion (between right and wrong). So whoever of you sights (the crescent on the first night of) the month (of Ramadan i.e. is present at his home), he must observe Saum (fasts) that month, and whoever is ill or on a journey, the same number [of days which one did not observe Saum (fasts) must be made up] from other days. Allâh intends for you ease, and He does not want to make things difficult for you. (He wants that you) must complete the same number (of days), and that you must magnify Allâh [i.e. to say Takbîr (Allâhu Akbar; Allâh is the Most Great] for having guided you so that you may be grateful to Him.[3]","arabic":"شَهۡرُ رَمَضَانَ ٱلَّذِيٓ أُنزِلَ فِيهِ ٱلۡقُرۡءَانُ هُدٗى لِّلنَّاسِ وَبَيِّنَٰتٖ مِّنَ ٱلۡهُدَىٰ وَٱلۡفُرۡقَانِۚ فَمَن شَهِدَ مِنكُمُ ٱلشَّهۡرَ فَلۡيَصُمۡهُۖ وَمَن كَانَ مَرِيضًا أَوۡ عَلَىٰ سَفَرٖ فَعِدَّةٞ مِّنۡ أَيَّامٍ أُخَرَۗ يُرِيدُ ٱللَّهُ بِكُمُ ٱلۡيُسۡرَ وَلَا يُرِيدُ بِكُمُ ٱلۡعُسۡرَ وَلِتُكۡمِلُواْ ٱلۡعِدَّةَ وَلِتُكَبِّرُواْ ٱللَّهَ عَلَىٰ مَا هَدَىٰكُمۡ وَلَعَلَّكُمۡ تَشۡكُرُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":192,"juzNumber":2,"footnotes":" (V.2:185)\n(A) Narrated Talhah bin ‘Ubaidullâh: A bedouin with unkempt hair came to Allâh’s Messenger صلى الله عليه وسلم and said, \"O Allâh’s Messenger! Inform me what Allâh has made compulsory for me as regards the Salât (prayers).\" He replied: \"You have to offer perfectly the five compulsory Salât (prayers) in a day and night (24 hours), unless you want to pray Nawâfil .\" The bedouin further asked, \"Inform me what Allâh has made compulsory for me as regards Saum (fasting).\" He replied, \"You have to fast during the whole month of Ramadân, unless you want to fast more as Nawâfil .\" The bedouin further asked, \"Tell me how much Zakât Allâh has enjoined on me.\" The narrator added: Then, Allâh’s Messenger صلى الله عليه وسلم informed him all about the Laws (i.e. fundamentals) of Islâm. The bedouin then said, \"By Him Who has honoured you, I will neither perform any Nawâfil nor will I decrease what Allâh has enjoined on me.\" Allâh’s Messenger صلى الله عليه وسلم said, \"If he is saying the truth, he will succeed (or he will be granted Paradise). (Sahih Al-Bukhâri, Hadîth No.115, Vol.3).\n(B) Narrated Abû Hurairah رضي الله عنه: Allâh’s Messenger صلى الله عليه وسلم said, \" As-Siyâm (the fasting) is Junnah (protection or shield or a screen or a shelter from the Hell-fire*). So, the person observing Saum (fasting) should avoid sexual relation with his wife and should not behave foolishly and impudently, and if somebody fights with him or abuses him, he should say to him twice, ‘I am fasting.’ \" The Prophet صلى الله عليه وسلم added, \"By Him in Whose Hands my soul is, the smell coming out from the mouth of a fasting person is better with Allâh تعالى than the smell of musk. (Allâh says about the fasting person), ‘He has left his food, drink and desires for My sake. The Saum (fast) is for Me**. So I will reward (the fasting person) for it and the reward of good deeds is multiplied ten times.’ \" (Sahih Al-Bukhâri, Hadîth No.118, Vol.3).\n* See Fath Al-Barî , Vol.5, Page 5.\n** Although all practices of worshipping are for Allâh, here Allâh تعالى singles out Saum (fasting), because fasting cannot be practiced for the sake of showing-off, as nobody except Allâh can know whether one is fasting or not. Therefore, fasting is a pure performance that cannot be blemished with hypocrisy. (Fath Al-Barî, Vol.5, Page 10)\n(C) Narrated Abû Hurairah رضي الله عنه: The Prophet صلى الله عليه وسلم said, \"Whoever does not give up lying speech - false statements (i.e. telling lies) and acting on those (lies), and evil actions etc., then Allâh is not in need of his leaving his food and drink (i.e. Allâh will not accept his fasting*)\". (Sahih Al-Bukhâri, Hadîth No.127, Vol.3).\n* See Fath Al-Barî , Vol.5, Page 18.","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"shahru ramaḍāna alladhī unzila fīhi al-qur'ānu hudan lilnnāsi wabayyinātin mina al-hudā wal-fur'qāni faman shahida minkumu al-shahra falyaṣum'hu waman kāna marīḍan aw ʿalā safarin faʿiddatun min ayyāmin ukhara yurīdu al-lahu bikumu al-yus'ra walā yurīdu bikumu al-ʿus'ra walituk'milū al-ʿidata walitukabbirū al-laha ʿalā mā hadākum walaʿallakum tashkurūna ","translations":["Month","(of) Ramadhaan","(is) that","was revealed","therein","the Quran","a Guidance","for mankind","and clear proofs","of","[the] Guidance","and the Criterion","So whoever","witnesses","among you","the month","then he should fast in it","and whoever","is","sick","or","on","a journey","then prescribed number (should be made up)","from","days","other","Intends","Allah","for you","[the] ease","and not","intends","for you","[the] hardship","so that you complete","the prescribed period","and that you magnify","Allah","for","[what]","He guided you","so that you may","(be) grateful","(185)"],"transliterationArr":["shahru","ramaḍāna","alladhī","unzila","fīhi","al-qur'ānu","hudan","lilnnāsi","wabayyinātin","mina","al-hudā","wal-fur'qāni","faman","shahida","minkumu","al-shahra","falyaṣum'hu","waman","kāna","marīḍan","aw","ʿalā","safarin","faʿiddatun","min","ayyāmin","ukhara","yurīdu","al-lahu","bikumu","al-yus'ra","walā","yurīdu","bikumu","al-ʿus'ra","walituk'milū","al-ʿidata","walitukabbirū","al-laha","ʿalā","mā","hadākum","walaʿallakum","tashkurūna",null],"verseTiming":[[1,0,760],[2,760,1520],[3,1520,3570],[4,3570,4930],[5,4930,5440],[6,5440,6540],[7,6540,6990],[8,6990,8750],[9,8750,10170],[10,10170,11290],[11,11290,12100],[12,12100,14920],[13,14920,16770],[14,16770,17420],[15,17420,18660],[16,18660,19480],[17,19480,20550],[18,20550,22050],[19,22050,22590],[20,22590,23560],[21,23560,23930],[22,23930,24420],[23,24420,25650],[24,25650,26680],[25,26680,27870],[26,27870,28980],[27,28980,30150],[28,30150,30970],[29,30970,31720],[30,31720,32230],[31,32230,33070],[32,33070,33560],[33,33560,34330],[34,34330,34820],[35,34820,35670],[36,35670,36650],[37,36650,37630],[38,37630,39050],[39,39050,42120],[40,42120,43380],[41,43380,44100],[42,44100,44730],[43,44730,45110],[44,45110,46130],[45,46130,47440],[46,47440,49885]]}}