{"name":"2:190","price":" 190. And fight in the Way of Allâh[1] those who fight you, but transgress not the limits. Truly, Allâh likes not the transgressors. [This Verse is the first one that was revealed in connection with Jihâd, but it was supplemented by another (9:36)].","arabic":"وَقَٰتِلُواْ فِي سَبِيلِ ٱللَّهِ ٱلَّذِينَ يُقَٰتِلُونَكُمۡ وَلَا تَعۡتَدُوٓاْۚ إِنَّ ٱللَّهَ لَا يُحِبُّ ٱلۡمُعۡتَدِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":197,"juzNumber":2,"footnotes":"(V.2:190) Al-Jihâd (holy fighting) in Allâh’s Cause (with full force of numbers and weaponry) is given the utmost importance in Islâm and is one of its pillar (on which it stands). By Jihâd Islâm is established, Allâh’s Word is made superior, (His Word being Lâ ilaha illallâh which means none has the right to be worshipped but Allâh), and His Religion (Islâm) is propagated. By abandoning Jihâd (may Allâh protect us from that) Islâm is destroyed and the Muslims fall into an inferior position; their honour is lost, their lands are stolen, their rule and authority vanish. Jihâd is an obligatory duty in Islâm on every Muslim, and he who tries to escape from this duty, or does not in his innermost heart wish to fulfil this duty, dies with one of the qualities of a hypocrite.\nNarrated ‘Abdullâh bin Mas‘ûd رضي الله عنه: I asked Allâh’s Messenger صلى الله عليه وسلم \"O Allâh’s Messenger! What is the best deed?\" He replied, \"To offer the Salât (prayers) at their early fixed stated times.\" I asked, \"What is next in goodness?\" He replied, \"To be good and dutiful to your parents.\" I further asked, \"What is next in goodness?\" He replied, \"To participate in Jihâd in Allâh’s Cause.\" I did not ask Allâh’s Messenger صلى الله عليه وسلم anymore and if I had asked him more, he would have told me more. (Sahih Al-Bukhâri, Vol.4, Hadîth No.41).","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"waqātilū fī sabīli al-lahi alladhīna yuqātilūnakum walā taʿtadū inna al-laha lā yuḥibbu al-muʿ'tadīna ","translations":["And fight","in","(the) way","(of) Allah","those who","fight you","and (do) not","transgress","Indeed","Allah","(does) not","like","the transgressors","(190)"],"transliterationArr":["waqātilū","fī","sabīli","al-lahi","alladhīna","yuqātilūnakum","walā","taʿtadū","inna","al-laha","lā","yuḥibbu","al-muʿ'tadīna",null],"verseTiming":[[1,0,1220],[2,1220,1590],[3,1590,2610],[4,2610,3140],[5,3140,4060],[6,4060,5850],[7,5850,6310],[8,6310,7430],[9,7430,8930],[10,8930,9770],[11,9770,10110],[12,10110,10880],[13,10880,13645]]}}