{"name":"2:191","price":" 191. And kill them wherever you find them, and turn them out from where they have turned you out. And Al-Fitnah [1] is worse than killing. And fight not with them at Al-Masjid-Al-Harâm (the sanctuary at Makkah),[2] unless they (first) fight you there. But if they attack you, then kill them. Such is the recompense of the disbelievers.","arabic":"وَٱقۡتُلُوهُمۡ حَيۡثُ ثَقِفۡتُمُوهُمۡ وَأَخۡرِجُوهُم مِّنۡ حَيۡثُ أَخۡرَجُوكُمۡۚ وَٱلۡفِتۡنَةُ أَشَدُّ مِنَ ٱلۡقَتۡلِۚ وَلَا تُقَٰتِلُوهُمۡ عِندَ ٱلۡمَسۡجِدِ ٱلۡحَرَامِ حَتَّىٰ يُقَٰتِلُوكُمۡ فِيهِۖ فَإِن قَٰتَلُوكُمۡ فَٱقۡتُلُوهُمۡۗ كَذَٰلِكَ جَزَآءُ ٱلۡكَٰفِرِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":198,"juzNumber":2,"footnotes":"[1] (V.2:191) Al-Fitnah: polytheism, to disbelieve after one has believed in Allâh, or a trial or a calamity or an affliction.\n[2] (V.2:191) Narrated Abu-Bakrah رضي الله عنه: The Prophet صلى الله عليه وسلم delivered to us a Khutbah (religious talk) on the day of Nahr (10th of Dhul Hijjah ). He said, \"Do you know what is the day today?\" We said, \"Allâh and His Messenger know better.\" He remained silent till we thought that he might give that day another name. He said, \"Isn’t it the day of Nahr ?\" We said, \"It is.\" He further asked, \"Which month is this?\" We said, \"Allâh and His Messenger know better.\" He remained silent till we thought that he might give it another name. He then said, \"Isn’t it the month of Dhul-Hijjah ?\" We replied: \"Yes, it is.\" He further asked, \"What town is this?\" We replied, \"Allâh and His Messenger know it better.\" He remained silent till we thought that he might give it another name. He then said, \"Isn’t it the forbidden (sacred) town (of Makkah)?\" We said, \"Yes, it is.\" He said, \"No doubt, your blood and your properties are sacred to one another like the sanctity of this day of yours, in this month of yours, in this town of yours, till the day you meet your Lord. No doubt! Haven’t I conveyed Allâh’s Message to you? We said, \"Yes.\" He said, \"O Allâh! Be witness. So it is in incumbent upon those who are present to convey it (this information) to those who are absent because the informed one might comprehend it (what I have said) better than the present audience, who will convey it to him. Beware! Do not renegade (as) disbelievers after me by striking the necks (cutting the throats) of one another.\" (Sahih Al-Bukhâri, Vol.2, Hadîth No.797).","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"wa-uq'tulūhum ḥaythu thaqif'tumūhum wa-akhrijūhum min ḥaythu akhrajūkum wal-fit'natu ashaddu mina al-qatli walā tuqātilūhum ʿinda al-masjidi al-ḥarāmi ḥattā yuqātilūkum fīhi fa-in qātalūkum fa-uq'tulūhum kadhālika jazāu al-kāfirīna ","translations":["And kill them","wherever","you find them","and drive them out","from","wherever","they drove you out","and [the] oppression","(is) worse","than","[the] killing","And (do) not","fight them","near","Al-Masjid","Al-Haraam","until","they fight you","in it","Then if","they fight you","then kill them","Such","(is the) reward","(of) the disbelievers","(191)"],"transliterationArr":["wa-uq'tulūhum","ḥaythu","thaqif'tumūhum","wa-akhrijūhum","min","ḥaythu","akhrajūkum","wal-fit'natu","ashaddu","mina","al-qatli","walā","tuqātilūhum","ʿinda","al-masjidi","al-ḥarāmi","ḥattā","yuqātilūkum","fīhi","fa-in","qātalūkum","fa-uq'tulūhum","kadhālika","jazāu","al-kāfirīna",null],"verseTiming":[[1,0,1470],[2,1470,2000],[3,2000,3590],[4,3590,4880],[5,4880,6080],[6,6080,6700],[7,6700,8390],[8,8390,9470],[9,9470,10190],[10,10190,10500],[11,10500,11220],[12,11220,12170],[13,12170,13700],[14,13700,14960],[15,14960,15930],[16,15930,16840],[17,16840,17600],[18,17600,19210],[19,19210,21180],[20,21180,21920],[21,21920,23910],[22,23910,25700],[23,25700,26600],[24,26600,28790],[25,28790,31405]]}}