{"name":"2:252","price":" 252. These are the Verses of Allâh, We recite them to you (O Muhammad صلى الله عليه وسلم) in truth, and surely, you are one of the Messengers (of Allâh).[2]","arabic":"تِلۡكَ ءَايَٰتُ ٱللَّهِ نَتۡلُوهَا عَلَيۡكَ بِٱلۡحَقِّۚ وَإِنَّكَ لَمِنَ ٱلۡمُرۡسَلِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":259,"juzNumber":2,"footnotes":"(V.2:252) A. Narrated Jâbir bin ‘Abdullâh رضي الله عنهما: The Prophet صلى الله عليه وسلم said, \"I have been given five (things) which were not given to any one else before me:\na) Allâh made me victorious by awe, (by His frightening my enemies) for a distance of one month’s journey.\nb) The earth has been made for me (and for my followers) a place for praying and a thing to purify (perform Tayammum), therefore anyone of my followers can pray wherever he is, at the time of prayer.\nc) The booty has been made Halâl (lawful) to me yet it was not lawful to anyone else before me.\nd) I have been given the right of intercession (on the Day of Resurrection).\ne) Every Prophet used to be sent to his nation only, but I have been sent to all mankind.\" (Sahih Al-Bukhâri, Vol. 1, Hadîth No.331).\nB. Narrated Abu Hurairah رضي الله عنه: Allâh’s Messenger صلى الله عليه وسلم said, \"My similitude in comparison with the other Prophets before me is that of a man who has built a house nicely and beautifully, except for a place of one brick in a corner. The people go round about it and wonder at its beauty, but say: ‘Would that this brick be put in its place!’ So I am that brick, and I am the last (end) of the Prophets.\" (Sahih Al-Bukhâri, Vol. 4, Hadîth No.735).\nC. Narrated Ibn Mas‘ûd رضي الله عنه: As if I saw the Prophet صلى الله عليه وسلم talking about one of the Prophets whose nation had beaten him and caused him to bleed, while he was cleaning the blood off his face and saying, \"O Allâh! Forgive my nation, for they have no knowledge.\" (Sahih Al-Bukhâri, Vol. 4, Hadîth No.683).\nD. Narrated ‘Âishah رضي الله عنها and Ibn ‘Abbâs رضي الله عنهما: On his death-bed, Allâh’s Messenger صلى الله عليه وسلم put a sheet over his face and when he felt hot, he would remove it from his face. When in that state (of putting and removing the sheet) he said, \"May Allâh’s Curse be on the Jews and the Christians for they built places of worship at the graves of their Prophets.\" (By that) he intended to warn (the Muslims) from what they (i.e., Jews and Christians) had done. (Sahih Al-Bukhâri, Vol. 4, Hadîth No.660).\nE. Narrated Abu Hurairah رضي الله عنه: The Prophet صلى الله عليه وسلم said, \"The Isrâelis used to be ruled and guided by Prophets. Whenever a Prophet died, another would take over his place. There will be no Prophet after me, but there will be caliphs who will increase in number.\" The people asked, \"O Allâh’s Messenger! What do you order us (to do)?\" He said, \"Obey the one who will be given the Bai‘a - pledge first.* Fulfil their (i.e. the caliphs’) rights, for Allâh will ask them about (any shortcomings in) ruling those whom Allâh has put under their guardianship.\" (Sahih Al-Bukhâri, Vol. 4, Hadîth No. 661).\n* If the Bai‘a (pledge) is given to a caliph and after a while another caliph is given the Bai‘a (pledge) by some members of the society, the common Muslims should abide by the Bai‘a (pledge) given to the first caliph, for the election of the second is invalid.","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"til'ka āyātu al-lahi natlūhā ʿalayka bil-ḥaqi wa-innaka lamina al-mur'salīna ","translations":["These","(are the) Verses","(of) Allah","We recite them","to you","in [the] truth","And indeed, you","(are) surely of","the Messengers","(252)"],"transliterationArr":["til'ka","āyātu","al-lahi","natlūhā","ʿalayka","bil-ḥaqi","wa-innaka","lamina","al-mur'salīna",null],"verseTiming":[[1,0,600],[2,600,1610],[3,1610,2310],[4,2310,3340],[5,3340,4220],[6,4220,5550],[7,5550,7020],[8,7020,7510],[9,7510,11725]]}}