{"name":"2:278","price":" 278. O you who believe! Be afraid of Allâh and give up what remains (due to you) from Ribâ (usury) (from now onward), if you are (really) believers.[2]","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱتَّقُواْ ٱللَّهَ وَذَرُواْ مَا بَقِيَ مِنَ ٱلرِّبَوٰٓاْ إِن كُنتُم مُّؤۡمِنِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":285,"juzNumber":3,"footnotes":"(V.2:278)\na) Narrated ‘Aun bin Abu Juhaifah رضي الله عنه: My father bought a slave who practised the profession of cupping. (My father broke the slave’s instruments of cupping). I asked my father why he had done so. He replied, \"The Prophet صلى الله عليه وسلم forbade the acceptance of the price of a dog or blood, and also forbade the profession of tattooing, or getting tattooed and receiving or giving Ribâ (usury), and cursed the picture-makers.\" (Sahih Al-Bukhâri, Vol. 3, Hadîth No.299).\nb) Narrated Abu Juhaifah that he had bought a slave whose profession was cupping and then said: The Prophet صلى الله عليه وسلم forbade taking the price of blood and the price of a dog and the earnings of a prostitute, and cursed the one who took or gave Ribâ (usury), and the lady who tattooed others or got herself tattooed, and the picture-maker. (Sahih Al-Bukhâri, Vol. 7, Hadîth No.845).","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"yāayyuhā alladhīna āmanū ittaqū al-laha wadharū mā baqiya mina al-riba in kuntum mu'minīna ","translations":["O you","who","believe[d]","Fear","Allah","and give up","what","remained","of","[the] usury","if","you are","believers","(278)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","ittaqū","al-laha","wadharū","mā","baqiya","mina","al-riba","in","kuntum","mu'minīna",null],"verseTiming":[[1,0,2940],[2,2940,3850],[3,3850,4520],[4,4520,5280],[5,5280,5860],[6,5860,6540],[7,6540,6920],[8,6920,7470],[9,7470,7800],[10,7800,9830],[11,9830,10750],[12,10750,12120],[13,12120,15165]]}}