{"name":"2:279","price":" 279. And if you do not do it, then take a notice of war from Allâh and His Messenger[3] but if you repent, you shall have your capital sums. Deal not unjustly (by asking more than your capital sums), and you shall not be dealt with unjustly (by receiving less than your capital sums).","arabic":"فَإِن لَّمۡ تَفۡعَلُواْ فَأۡذَنُواْ بِحَرۡبٖ مِّنَ ٱللَّهِ وَرَسُولِهِۦۖ وَإِن تُبۡتُمۡ فَلَكُمۡ رُءُوسُ أَمۡوَٰلِكُمۡ لَا تَظۡلِمُونَ وَلَا تُظۡلَمُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":286,"juzNumber":3,"footnotes":" (2:279)\na) Narrated Abu Sa‘îd Al-Khudrî رضي الله عنه: Once Bilâl brought Bami (a kind of) dates to the Prophet صلى الله عليه وسلم and the Prophet صلى الله عليه وسلم asked him, \"From where have you brought these?\" Bilâl replied, \"I had some inferior kind of dates and exchanged two Sâ‘ of it for one Sâ‘ of Bami dates, in order to give it to the Prophet صلى الله عليه وسلم to eat.\" Thereupon the Prophet صلى الله عليه وسلم said, \"Beware! Beware! This is definitely Ribâ (usury)! This is definitely Ribâ (usury)! Don’t do so, but if you want to buy (a superior kind of dates) sell the inferior kind of dates for money and then, buy the superior kind of dates with that money.\" (Sahih Al-Bukhari, Vol. 3, Hadîth No.506).\nb) Narrated Samura bin Jundub رضي الله عنه: Allâh’s Messenger صلى الله عليه وسلم very often used to ask his companions, \"Did anyone of you see a dream?\" So, dreams would be narrated to him by those whom Allâh willed to relate. One morning the Prophet صلى الله عليه وسلم said, \"Last night two persons (angels) came to me (in a dream) and woke me up and said to me, ‘Proceed!’ I set out with them and we came across a man lying down, and behold, another man was standing over his head, holding a big rock. Behold, he was throwing the rock at the man’s head, smashing it. The rock rolled away and the thrower followed it and took it back. By the time he reached the man, his head returned to its normal state. The thrower then did the same as he had done before. I said to my two companions, ‘Subhan Allâh! Who are these two persons?’ They said, ‘Proceed!’ So we proceeded and came to a man lying in a prone position, and another man standing over his head with an iron hook, and behold, he would put the hook in one side of the man’s mouth and tear off that side of his face to the back (of the neck), and similarly tear his nose from front to back, and his eye from front to back. Then he turned to the other (second) side of the man’s face and did just as he had done with the first side. He hardly completed that (second) side when the first side returned to its normal state. Then he returned to it to repeat what he had done before. I said to my two companions, ‘Subhan Allâh! Who are these two persons?’ They said to me, ‘Proceed!’ So we proceeded and came across something like a Tannur (a kind of baking oven, a pit usually clay-lined for baking bread).\" I think the Prophet صلى الله عليه وسلم said, \"In that oven there was much noise and voices.\" The Prophet صلى الله عليه وسلم added, \"We looked into it and found naked men and women, and behold, a flame of fire was reaching to them from underneath, and when it reached them, they cried loudly. I asked them, ‘Who are these?’ They said to me, ‘Proceed!’ And so we proceeded and came across a river.\" I think he said, \"- red like blood.\" The Prophet صلى الله عليه وسلم added, \"And behold, in the river there was a man swimming, and on the bank there was a man who had collected many stones. Behold, while the other man was swimming, he went near him. The former opened his mouth and the latter (on the bank) threw a stone into his mouth whereupon he went swimming again. Then again he (the former) returned to him (the latter), and every time the former returned, he opened his mouth, and the latter threw a stone into his mouth, (and so on) the performance was repeated. I asked my two companions, ‘Who are these two persons?’ They replied, ‘Proceed! Proceed!’ And we proceeded till we came to a man with a repulsive appearance, the most repulsive appearance you ever saw a man having! Beside him there was a fire, and he was kindling it and running around it. I asked my companions, ‘Who is this (man)?’ They said to me, ‘Proceed! Proceed!’ So we proceeded till we reached a garden of deep green dense vegetation, having all sorts of spring colours. In the midst of the garden there was a very tall man, and I could hardly see his head because of his great height, and around him there were children in such a large number as I have never seen. I said to my companions, ‘Who is this?’ They replied, ‘Proceed! Proceed!’ So we proceeded till we came to a majestic huge garden, greater and better than I have ever seen! My two companions said to me, ‘Ascend up’ and I ascended up.\" The Prophet صلى الله عليه وسلم added, \"So we ascended till we reached a city built of gold and silver bricks, and we went to its gate and asked (the gatekeeper) to open the gate, and it was opened and we entered the city and found in it men with one side of their bodies as handsome as the most handsome person you have ever seen, and the other side as ugly as the ugliest person you have ever seen. My two companions ordered those men to throw themselves into the river. Behold, there was a river flowing across (the city), and its water was like milk in whiteness. Those men went and threw themselves in it and then returned to us after the ugliness (of their bodies) had disappeared, and they became in the best shape.\" The Prophet صلى الله عليه وسلم further added, \"My two companions (angels) said to me: ‘This place is the ‘Adn Paradise, and that is your place.’ I raised up my sight, and behold, there I saw a palace like a white cloud! My two companions said to me: ‘That (palace) is your place’ I said to them: ‘May Allâh bless you both! Let me enter it.’ They replied, ‘As for now, you will not enter it, but you shall enter it (one day).’ I said to them, ‘I have seen many wonders tonight. What does all that mean which I have seen?’ They replied, ‘We will inform you: As for the first man you came upon whose head was being smashed with the rock, he is the symbol of the one who studies the Qur’ân, and then neither recites it, nor acts on its orders, and sleeps, neglecting the enjoined prayers. As for the man you came upon, whose sides of mouth, nostrils, and eyes were torn off from front to back, he is the symbol of the man who goes out of his house in the morning and tells lies that are spread all over the world. And those naked men and women whom you saw in a construction resembling an oven, they are the adulterers-fornicators and the adulteresses-fornicatresses, and the man whom you saw swimming in the river, and was given a stone to swallow, is the eater of Ribâ (usury), and the bad looking man whom you saw near the fire kindling it and going around it, is Mâlik; the gatekeeper of Hell, and the tall man whom you saw in the garden, is Ibrâhîm (Abraham), and the children around him are those who die on Al-Fitrah (the Islâmic Faith of Monotheism).’ \" The narrator added : Some Muslims asked the Prophet صلى الله عليه وسلم Allâh’s Messenger! What about the children of Al-Mushrikûn?*\" The Prophet صلى الله عليه وسلم replied, \"And also the children of Al-Mushrikûn.\" The Prophet صلى الله عليه وسلم added, \"My two companions added, ‘The men you saw half handsome and half ugly were those persons who had mixed an act that was good with another that was evil, but Allâh forgave them.’ \" (Sahih Al-Bukhâri, Vol. 9, Hadîth No. 171).\n* Al-Mushrikûn: polytheists, pagans, idolaters, and disbelievers in the Oneness of Allâh and in His Messenger Muhammad صلى الله عليه وسلم.","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"fa-in lam tafʿalū fadhanū biḥarbin mina al-lahi warasūlihi wa-in tub'tum falakum ruūsu amwālikum lā taẓlimūna walā tuẓ'lamūna ","translations":["And if","not","you do","then be informed","of a war","from","Allah","and His Messenger","And if","you repent","then for you","(is)","your capital ","(do) not","wrong","and not","you will be wronged","(279)"],"transliterationArr":["fa-in","lam","tafʿalū","fadhanū","biḥarbin","mina","al-lahi","warasūlihi","wa-in","tub'tum","falakum","ruūsu","amwālikum","lā","taẓlimūna","walā","tuẓ'lamūna",null],"verseTiming":[[1,0,510],[2,510,980],[3,980,1870],[4,1870,2840],[5,2840,3720],[6,3720,4640],[7,4640,5430],[8,5430,6920],[9,6920,7910],[10,7910,8610],[11,8610,9370],[12,9370,10130],[13,10130,11480],[14,11480,11780],[15,11780,12990],[16,12990,13500],[17,13500,15905]]}}