{"name":"2:274","price":" 274. Those who spend their wealth (in Allâh’s Cause) by night and day, in secret and in public, they shall have their reward with their Lord. On them shall be no fear, nor shall they grieve.[2]","arabic":"ٱلَّذِينَ يُنفِقُونَ أَمۡوَٰلَهُم بِٱلَّيۡلِ وَٱلنَّهَارِ سِرّٗا وَعَلَانِيَةٗ فَلَهُمۡ أَجۡرُهُمۡ عِندَ رَبِّهِمۡ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":281,"juzNumber":3,"footnotes":"(V.2:274) Narrated Abu Hurairah رضي الله عنه: The Prophet صلى الله عليه وسلم said, \"Seven people will be shaded by Allâh under His Shade on the Day (i.e. the Day of Resurrection) when there will be no shade except His. They are:\na) a just ruler;\nb) a young man who has been brought up in the worship of Allâh, [i.e. worships Allâh (Alone) sincerely from his childhood];\nc) a man whose heart is attached to the mosques (who offers the five compulsory congregational prayers in the mosques);\nd) two persons who love each other only for Allâh’s sake, and they meet and part in Allâh’s Cause only;\ne) a man who refuses the call of a charming woman of noble birth for illegal sexual intercourse with her and says: I fear Allâh;\nf) a person who practises charity so secretly that his left hand does not know what his right hand has given (i.e., nobody knows how much he has given in charity).\ng) a person who remembers Allâh in seclusion and his eyes become flooded with tears.\" (Sahih Al-Bukhâri, Vol. 2, Hadîth No.504).","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"alladhīna yunfiqūna amwālahum bi-al-layli wal-nahāri sirran waʿalāniyatan falahum ajruhum ʿinda rabbihim walā khawfun ʿalayhim walā hum yaḥzanūna ","translations":["Those who","spend","their wealth","by night","and day","secretly","and openly","then for them","(is) their reward","with","their Lord","and no","fear","on them","and not","they","will grieve","(274)"],"transliterationArr":["alladhīna","yunfiqūna","amwālahum","bi-al-layli","wal-nahāri","sirran","waʿalāniyatan","falahum","ajruhum","ʿinda","rabbihim","walā","khawfun","ʿalayhim","walā","hum","yaḥzanūna",null],"verseTiming":[[1,0,1170],[2,1170,2840],[3,2840,4800],[4,4800,5670],[5,5670,7250],[6,7250,8530],[7,8530,10430],[8,10430,11270],[9,11270,12570],[10,12570,13270],[11,13270,14160],[12,14160,15470],[13,15470,16420],[14,16420,16910],[15,16910,17650],[16,17650,18640],[17,18640,19170],[18,19170,19520],[19,19520,22155]]}}