{"name":"2:3","price":" 3. Who believe in the Ghaib [1] and perform As-Salât (Iqâmat-as-Salât),[2] and spend out of what We have provided for them [i.e. give Zakât [3], spend on themselves, their parents, their children, their wives, etc., and also give charity to the poor and also in Allâh’s Cause - Jihâd].","arabic":"ٱلَّذِينَ يُؤۡمِنُونَ بِٱلۡغَيۡبِ وَيُقِيمُونَ ٱلصَّلَوٰةَ وَمِمَّا رَزَقۡنَٰهُمۡ يُنفِقُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":10,"juzNumber":1,"footnotes":"[1] (V.2:3): Al-Ghaib: literally means a thing not seen. But this word includes vast meanings: Belief in Allâh, Angels, Holy Books, Allâh’s Messengers, Day of Resurrection and Al-Qadar (Divine Pre-ordainments). It also includes what Allâh and His Messenger صلى الله عليه وسلم informed about the knowledge of the matters of past, present, and future e.g., news about the creation of the heavens and earth, botanical and zoological life, the news about the nations of the past, and about Paradise and Hell.\n[2] (V.2:3): Iqâmat-as-Salât إقامة الصلاة: The performance of Salât (prayers). It means that:\n[3] (V.2:3) Zakât زكاة : A certain fixed proportion of the wealth and of each and every kind of property liable to Zakât of a Muslim to be paid yearly for the benefit of the poor in the Muslim community. The payment of Zakât is obligatory as it is one of the five pillars of Islâm. Zakât is the major economic means for establishing social justice and leading the Muslim society to prosperity and security. [See Sahih Al- Bukhâri, Vol. 2, Book of Zakât, No. 24]","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"alladhīna yu'minūna bil-ghaybi wayuqīmūna al-ṣalata wamimmā razaqnāhum yunfiqūna ","translations":["Those who","believe","in the unseen","and establish","the prayer","and out of what","We have provided them","they spend","(3)"],"transliterationArr":["alladhīna","yu'minūna","bil-ghaybi","wayuqīmūna","al-ṣalata","wamimmā","razaqnāhum","yunfiqūna",null],"verseTiming":[[1,0,1040],[2,1040,2190],[3,2190,3090],[4,3090,4260],[5,4260,5220],[6,5220,6580],[7,6580,7990],[8,7990,11365]]}}