{"name":"2:31","price":" 31. And He taught Adam all the names (of everything)[1], then He showed them to the angels and said, \"Tell Me the names of these if you are truthful.\"","arabic":"وَعَلَّمَ ءَادَمَ ٱلۡأَسۡمَآءَ كُلَّهَا ثُمَّ عَرَضَهُمۡ عَلَى ٱلۡمَلَٰٓئِكَةِ فَقَالَ أَنۢبِـُٔونِي بِأَسۡمَآءِ هَٰٓؤُلَآءِ إِن كُنتُمۡ صَٰدِقِينَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":38,"juzNumber":1,"footnotes":"(V.2:31) The Statement of Allâh تعالى: ‘And He taught Adam all the names (of everything).’ Narrated Anas رضي الله عنه: The Prophet صلى الله عليه وسلم said, \"On the Day of Resurrection the believers will assemble and say, ‘Let us ask somebody to intercede for us with our Lord.’ So they will go to Adam and say, ‘You are the father of all the people, and Allâh created you with His Own Hands, and ordered the angels to prostrate themselves to you, and taught you the names of all things; so please intercede for us with our Lord, so that He may relieve us from this place of ours.’ Adam will say, ‘I am not fit for this (i.e. intercession for you).’ Then Adam will remember his sin and feel ashamed thereof. He will say, ‘Go to Nûh (Noah), for he was the first Messenger Allâh sent to the inhabitants of the earth.’ They will go to him and Nûh (Noah) will say, ‘I am not fit for this undertaking.’ He will remember his appeal to his Lord to do something of which he had no knowledge, then he will feel ashamed thereof and will say, ‘Go to Khalil-ur-Rahmân. * [i.e. Ibrâhîm (Abraham)]. They will go to him and will say, ‘I am not fit for this undertaking. Go to Mûsâ (Moses), the slave to whom Allâh spoke (directly) and gave him the Taurât (Torah).’ So they will go to him and he will say, ‘I am not fit for this undertaking,’ and he will mention (his) killing a person who was not a killer, and so he will feel ashamed thereof before his Lord, and he will say, ‘Go to ‘Îsâ (Jesus), Allâh’s slave, His Messenger and Allâh’s Word and a spirit coming from Him. ** ‘Îsâ (Jesus) will say, ‘I am not fit for this undertaking, go to Muhammad صلى الله عليه وسلم the slave of Allâh whose past and future sins were forgiven by Allâh.’ So they will come to me and I will proceed till I ask my Lord’s Permission and I will be given permission. When I see my Lord, I will fall down in prostration and He will let me remain in that state as long as He wishes and then I will be addressed. ‘(Muhammad!) Raise your head. Ask, and your request will be granted; say and your saying will be listened to; intercede, and your intercession will be accepted.’ I will raise my head and praise Allâh with a saying (i.e. invocation) He will teach me, and then I will intercede. He will fix a limit for me (to intercede) whom I will admit into Paradise. Then I will come back again to Allâh, and when I see my Lord, the same thing will happen to me. And then I will intercede and Allâh will fix a limit for me (to intercede) whom I will admit into Paradise, then I will come back for the third time; and then I will come back for the fourth time, and He will say, ‘None remains in Hell but those whom the Qur’ân has imprisoned (in Hell) and who have been destined to an eternal stay in Hell.’\" (The compiler) Abu ‘Abdullâh said; ‘But those whom the Qur’ân has imprisoned in Hell’ refers to the statement of Allâh عز وجل: \"To abide therein ... V.16:29\" (Sahih Al-Bukhâri, Vol.6, Hadîth No. 3).\n* The intimate friend of the Most Gracious (Allâh).\n** This may wrongly be understood as the spirit or soul of Allâh, in fact, it is a soul created by Allâh, i.e. ‘Îsâ (Jesus). It was His Word: \"Be!\" - and he was (created like the creation of Adam). Please see the word Rûh-ullâh in the glossary for further details.","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"waʿallama ādama al-asmāa kullahā thumma ʿaraḍahum ʿalā al-malāikati faqāla anbiūnī bi-asmāi hāulāi in kuntum ṣādiqīna ","translations":["And He taught","Adam","the names ","all of them","Then","He displayed them","to","the angels","then He said","Inform Me","of (the) names","(of) these","if","you are","truthful","(31)"],"transliterationArr":["waʿallama","ādama","al-asmāa","kullahā","thumma","ʿaraḍahum","ʿalā","al-malāikati","faqāla","anbiūnī","bi-asmāi","hāulāi","in","kuntum","ṣādiqīna",null],"verseTiming":[[1,0,1120],[2,1120,1790],[3,1790,4090],[4,4090,5040],[5,5040,5950],[6,5950,6890],[7,6890,7270],[8,7270,9580],[9,9580,10400],[10,10400,12830],[11,12830,13650],[12,13650,15780],[13,15780,18280],[14,18280,22680],[15,22680,23480],[16,23480,24780],[17,24780,27145]]}}