{"name":"2:42","price":" 42. And mix not truth with falsehood, nor conceal the truth [i.e. Muhammad صلى الله عليه وسلم is Allâh’s Messenger and his qualities are written in your Scriptures, the Taurât (Torah) and the Injeel (Gospel)] while you know (the truth).[1]","arabic":"وَلَا تَلۡبِسُواْ ٱلۡحَقَّ بِٱلۡبَٰطِلِ وَتَكۡتُمُواْ ٱلۡحَقَّ وَأَنتُمۡ تَعۡلَمُونَ","category":["2 (Al-Baqarah)","Al-Baqarah","Surah Al-Baqarah","Chapter Al-Baqarah","Baqarah","Surah Baqarah","Chapter Baqarah","Al Baqarah","Surah Al Baqarah","Chapter Al Baqarah","Surah 2","Chapter 2","The Cow","البَقَرَة"],"ayahNumber":49,"juzNumber":1,"footnotes":"(V.2:42) Narrated ‘Atâ bin Yasâr: I met ‘Abdullâh bin ‘Amr bin Al-‘Aas and asked him, \"Tell me about the description of Allâh’s Messenger صلى الله عليه وسلم which is mentioned in the Taurât (Torah).\" He replied, \"Yes. By Allâh, he is described in the Taurât (Torah) with some of the qualities attributed to him in the Qur’ân as follows: ‘O Prophet! We have sent you as a witness (for Allâh’s True Religion). And a giver of glad tidings (to the faithful believers). And a warner (to the disbelievers), and a guardian of the illiterates. You are My slave and My Messenger I have named you Al-Mutawakkil (who depends upon Allâh). You are neither discourteous, harsh nor a noise-maker in the markets, and you do not do evil to those who do evil to you, but you deal with them with forgiveness and kindness. Allâh will not let him (the Prophet صلى الله عليه وسلم) die till he makes straight the crooked people by making them say: ‘La ilâha illallâh ’ (none has the right to be worshipped but Allâh), by which ‘blind eyes, deaf ears and closed hearts’ will be opened.\" (Sahih Al-Bukhâri Vol.3, Hadîth No.335).","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"walā talbisū al-ḥaqa bil-bāṭili wataktumū al-ḥaqa wa-antum taʿlamūna ","translations":["And (do) not","mix","the Truth","with [the] falsehood","and conceal","the Truth","while you","[you] know","(42)"],"transliterationArr":["walā","talbisū","al-ḥaqa","bil-bāṭili","wataktumū","al-ḥaqa","wa-antum","taʿlamūna",null],"verseTiming":[[1,0,700],[2,700,1450],[3,1450,2250],[4,2250,3350],[5,3350,4220],[6,4220,5090],[7,5090,6670],[8,6670,9445]]}}