{"name":"33:28","price":" 28. O Prophet (Muhammad صلى الله عليه وسلم)! Say to your wives: \"If you desire the life of this world, and its glitter, then come! I will make a provision for you and set you free in a handsome manner (divorce).[2]","arabic":"يَٰٓأَيُّهَا ٱلنَّبِيُّ قُل لِّأَزۡوَٰجِكَ إِن كُنتُنَّ تُرِدۡنَ ٱلۡحَيَوٰةَ ٱلدُّنۡيَا وَزِينَتَهَا فَتَعَالَيۡنَ أُمَتِّعۡكُنَّ وَأُسَرِّحۡكُنَّ سَرَاحٗا جَمِيلٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab","Chapter Al-Ahzab","Ahzab","Surah Ahzab","Chapter Ahzab","Al Ahzab","Surah Al Ahzab","Chapter Al Ahzab","Surah 33","Chapter 33","The Combined Forces","الأحزَاب"],"ayahNumber":3561,"juzNumber":21,"footnotes":"(V.33:28)\na) Narrated ‘Âishah رضي الله عنها, the wife of the Prophet صلى الله عليه وسلم: When Allâh’s Messenger صلى الله عليه وسلم was ordered to give option to his wives, he started with me, saying, \"I am going to mention to you something, but you shall not hasten (to give your reply) unless you consult your parents.\" The Prophet صلى الله عليه وسلم knew that my parents would not order me to leave him. Then he said, \"Allâh says: \"O Prophet (Muhammad صلى الله عليه وسلم)! Say to your wives: ‘If you desire the life of this world and its glitter... an enormous reward.’ \" (V.33:29).\nI said, \"Then why consult I my parents? Verily, I desire Allah, His Messenger and the Home of the Hereafter.\" Then all the other wives of the Prophet did the same as I did.\n(Sahih Al-Bukhari, Vol.6, Hadith No.309).\nb) Narrated ‘Âishah رضي الله عنها: Allâh’s Messenger صلى الله عليه وسلم gave us the option (to remain with him or to be divorced) and we chose Allâh and His Messenger. So that option was not regarded as divorce. (Sahih Al-Bukhâri, Vol.7, Hadîth No.188).","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"yāayyuhā al-nabiyu qul li-azwājika in kuntunna turid'na al-ḥayata al-dun'yā wazīnatahā fataʿālayna umattiʿ'kunna wa-usarriḥ'kunna sarāḥan jamīlan ","translations":["O Prophet","O Prophet","Say","to your wives","If","you","desire","the life","(of) the world","and its adornment","then come","I will provide for you","and release you","(with) a release","good","(28)"],"transliterationArr":["yāayyuhā","al-nabiyu","qul","li-azwājika","in","kuntunna","turid'na","al-ḥayata","al-dun'yā","wazīnatahā","fataʿālayna","umattiʿ'kunna","wa-usarriḥ'kunna","sarāḥan","jamīlan",null],"verseTiming":[[1,0,2440],[2,2440,4080],[3,4080,4390],[4,4390,5800],[5,5800,6820],[6,6820,9420],[7,9420,10180],[8,10180,11090],[9,11090,12110],[10,12110,13400],[11,13400,14760],[12,14760,16180],[13,16180,17480],[14,17480,19940],[15,19940,22340],[16,22340,23860],[17,23860,25455]]}}