{"name":"33:35","price":" 35. Verily, the Muslims (those who submit to Allâh in Islâm) men and women, the believers men and women (who believe in Islâmic Monotheism), the men and the women who are obedient (to Allâh), the men and women who are truthful (in their speech and deeds), the men and the women who are patient (in performing all the duties which Allâh has ordered and in abstaining from all that Allâh has forbidden), the men and the women who are humble (before their Lord - Allâh), the men and the women who give Sadaqât (i.e. Zakât, and alms), the men and the women who observe Saum (fast) (the obligatory fasting during the month of Ramadân, and the optional Nawâfil fasting), the men and the women who guard their chastity (from illegal sexual acts) and the men and the women who remember Allâh much with their hearts and tongues [1] Allâh has prepared for them forgiveness and a great reward (i.e. Paradise).","arabic":"إِنَّ ٱلۡمُسۡلِمِينَ وَٱلۡمُسۡلِمَٰتِ وَٱلۡمُؤۡمِنِينَ وَٱلۡمُؤۡمِنَٰتِ وَٱلۡقَٰنِتِينَ وَٱلۡقَٰنِتَٰتِ وَٱلصَّٰدِقِينَ وَٱلصَّٰدِقَٰتِ وَٱلصَّٰبِرِينَ وَٱلصَّٰبِرَٰتِ وَٱلۡخَٰشِعِينَ وَٱلۡخَٰشِعَٰتِ وَٱلۡمُتَصَدِّقِينَ وَٱلۡمُتَصَدِّقَٰتِ وَٱلصَّٰٓئِمِينَ وَٱلصَّٰٓئِمَٰتِ وَٱلۡحَٰفِظِينَ فُرُوجَهُمۡ وَٱلۡحَٰفِظَٰتِ وَٱلذَّٰكِرِينَ ٱللَّهَ كَثِيرٗا وَٱلذَّٰكِرَٰتِ أَعَدَّ ٱللَّهُ لَهُم مَّغۡفِرَةٗ وَأَجۡرًا عَظِيمٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab","Chapter Al-Ahzab","Ahzab","Surah Ahzab","Chapter Ahzab","Al Ahzab","Surah Al Ahzab","Chapter Al Ahzab","Surah 33","Chapter 33","The Combined Forces","الأحزَاب"],"ayahNumber":3568,"juzNumber":22,"footnotes":"(V.33:35)\na) \"Remember Allâh\" (while sitting, standing, lying for more than 300 times extra over the remembrance of Allâh during the five compulsory congregational prayer) or praying extra additional nawâfil prayers of night in the last part of night.)\nb) See the footnote of (V.13:28).\nc) Narrated Abû Huraira رضي الله عنه: Allâh’s Messenger صلى الله عليه وسلم said, \"Allâh has some angels who look for those who remember (glorify the Praises of) Allâh on the roads and paths. And when they find some people remembering (glorifying the Praises of) Allâh, they call each others, saying, ‘Come to the object of your pursuit’.\" He added, \"Then the angels encircle them with their wings up to the nearest Heaven to us.\" He added, \"[After those people remembered (glorified the Praises of) Allâh, and the angels go back to Allâh, their Lord عز وجلasks them (those angels) - though He knows better than them - ‘What do My slaves say?’ The angels reply, ‘They say: Subhân Allâh, Allâh Akbar, and Alham-du-lillâh’ Allâh then says, ‘Did they see Me?’ The angels reply, ‘No! By Allâh, they didn’t see You.’ Allâh says, ‘How it would have been if they saw Me?’ The angels reply, ‘If they saw You, they would worship You more devoutly and remember You (glorify Your Praises) more deeply, and declare Your freedom from any resemblance to any thing more often,’ Allâh says (to the angels), ‘What do they ask Me for?’ The angels reply, ‘They ask You for Paradise.’ Allâh says (to the angels), ‘Did they see it?’ The angels say, ‘No! By Allâh, O Lord They didn’t see it.’ Allâh says: ‘How it would have been if they saw it?’ The angels say, ‘If they saw it, they would have greater covetousness for it and would seek it for greater zeal and would have greater desire for it.’ Allâh says, ‘From what do they seek refuge?’ The angels reply, ‘They seek refuge from the (Hell) Fire.’ Allâh says, ‘Did they see it?’ The angels say, ‘No! By Allâh, O Lord! They didn’t see it.’ Allâh says, ‘How it would have been if they saw it?’ The angels say, ‘If they saw it, they would flee from it with the extreme fleeing and would have extreme fear from it.’ Then Allâh says, ‘I make you witness that I have forgiven them’.\" Allâh’s Messenger صلى الله عليه وسلم added, \"One of the angels would say, ‘There was so-and-so amongst them, and he was not one of them, but he had just come for some need.’ Allâh would say, ‘These are those people whose companions will not be reduced to misery’.\" (Sahih Al-Bukhari, Vol.8, Hadîth No.417).","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"inna al-mus'limīna wal-mus'limāti wal-mu'minīna wal-mu'mināti wal-qānitīna wal-qānitāti wal-ṣādiqīna wal-ṣādiqāti wal-ṣābirīna wal-ṣābirāti wal-khāshiʿīna wal-khāshiʿāti wal-mutaṣadiqīna wal-mutaṣadiqāti wal-ṣāimīna wal-ṣāimāti wal-ḥāfiẓīna furūjahum wal-ḥāfiẓāti wal-dhākirīna al-laha kathīran wal-dhākirāti aʿadda al-lahu lahum maghfiratan wa-ajran ʿaẓīman ","translations":["Indeed","the Muslim men","and the Muslim women","and the believing men","and the believing women","and the obedient men","and the obedient women","and the truthful men","and the truthful women","and the patient men","and the patient women","and the humble men","and the humble women","and the men who give charity","and the women who give charity","and the men who fast","and the women who fast","and the men who guard","their chastity","and the women who guard (it)","and the men who remember","Allah","much","and the women who remember","Allah has prepared","Allah has prepared","for them","forgiveness","and a reward","great","(35)"],"transliterationArr":["inna","al-mus'limīna","wal-mus'limāti","wal-mu'minīna","wal-mu'mināti","wal-qānitīna","wal-qānitāti","wal-ṣādiqīna","wal-ṣādiqāti","wal-ṣābirīna","wal-ṣābirāti","wal-khāshiʿīna","wal-khāshiʿāti","wal-mutaṣadiqīna","wal-mutaṣadiqāti","wal-ṣāimīna","wal-ṣāimāti","wal-ḥāfiẓīna","furūjahum","wal-ḥāfiẓāti","wal-dhākirīna","al-laha","kathīran","wal-dhākirāti","aʿadda","al-lahu","lahum","maghfiratan","wa-ajran","ʿaẓīman",null],"verseTiming":[[1,0,1300],[2,1300,2670],[3,2670,4220],[4,4220,5610],[5,5610,7150],[6,7150,8590],[7,8590,10080],[8,10080,11620],[9,11620,13110],[10,13110,15790],[11,15790,17390],[12,17390,18850],[13,18850,20350],[14,20350,21840],[15,21840,23720],[16,23720,25530],[17,25530,28530],[18,28530,31560],[19,31560,34380],[20,34380,35950],[21,35950,37200],[22,37200,38680],[23,38680,40110],[24,40110,40920],[25,40920,42490],[26,42490,43940],[27,43940,44670],[28,44670,45390],[29,45390,45900],[30,45900,47500],[31,47500,49030],[32,49030,50715]]}}