{"name":"33:56","price":" 56. Allâh sends His Salât (Graces, Honours, Blessings, Mercy) on the Prophet (Muhammad صلى الله عليه وسلم), and also His angels (ask Allâh to bless and forgive him). O you who believe! Send your Salât[1] on (ask Allâh to bless) him (Muhammad صلى الله عليه وسلم), and (you should) greet (salute) him with the Islâmic way of greeting (salutation i.e. As-Salâmu ‘Alaikum ).","arabic":"إِنَّ ٱللَّهَ وَمَلَٰٓئِكَتَهُۥ يُصَلُّونَ عَلَى ٱلنَّبِيِّۚ يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ صَلُّواْ عَلَيۡهِ وَسَلِّمُواْ تَسۡلِيمًا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab","Chapter Al-Ahzab","Ahzab","Surah Ahzab","Chapter Ahzab","Al Ahzab","Surah Al Ahzab","Chapter Al Ahzab","Surah 33","Chapter 33","The Combined Forces","الأحزَاب"],"ayahNumber":3589,"juzNumber":22,"footnotes":"(V.33:56). Narrated ‘Abdur-Rahmân bin Abî Laila: Ka‘b bin ‘Ujrah met me and said, ‘Shall I not give you a present I got from the Prophet صلى الله عليه وسلم?\" ‘Abdur-Rahmân said, \"Yes, give it to me.\" I said, \"We asked Allâh’s Messenger صلى الله عليه وسلمsaying, ‘O Allâh’s Messenger! How should one (ask Allâh to) send As-Salât upon you and the Ahl-al-Bait أهل البيت (the members of the family of the prophet صلى الله عليه وسلم, for Allah has taught us how to greet you?’ He said, ‘Say Allahumma Salli ‘alâ Muhammadin Wa‘âlâ âli Muhammadin, Kamâ Sal-laita ‘alâ Ibrâhîma wa ‘ali âli Ibrahîma, Innaka Hamidun Majid. Allahumma bârik ‘alâ Muhammadin wa ‘alâ âli Muhammadin Kamâ bârakta ‘alâ Ibrâhîma wa ‘alâ âli Ibrâhîm, Innaka Hamidun Majid.’ [O Allâh! Send Your Salât (Graces, Honours and Mercy) on Muhammad and on the family or the followers of Muhammad, as You sent Your Salât (Graces Honour and Mercy) on Abraham and on the family or the followers of Abraham, for You are the Most Praise-Worthy, the Most Glorious. O Allâh! Send Your Blessings on Muhammad and on the family or the followers of Muhammad as You sent your Blessings on Abraham and on the family or the followers of Abraham, for You are the Most Praise-Worthy, the Most Glorious.’ \" (Sahih Al-Bukhari, Vol.4, Hadîth No.589).","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"inna al-laha wamalāikatahu yuṣallūna ʿalā al-nabiyi yāayyuhā alladhīna āmanū ṣallū ʿalayhi wasallimū taslīman ","translations":["Indeed","Allah","and His Angels","send blessings","upon","the Prophet","O you who believe","O you who believe","O you who believe","Send blessings","on him","and greet him","(with) greetings","(56)"],"transliterationArr":["inna","al-laha","wamalāikatahu","yuṣallūna","ʿalā","al-nabiyi","yāayyuhā","alladhīna","āmanū","ṣallū","ʿalayhi","wasallimū","taslīman",null],"verseTiming":[[1,0,1080],[2,1080,2000],[3,2000,5120],[4,5120,6350],[5,6350,6720],[6,6720,8440],[7,8440,11770],[8,11770,12740],[9,12740,13750],[10,13750,14590],[11,14590,15360],[12,15360,16510],[13,16510,18415]]}}