{"name":"33:69","price":" 69. O you who believe! Be not like those who annoyed Mûsa (Moses), but Allâh cleared him of that which they alleged, and he was honourable before Allâh.[1]","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَكُونُواْ كَٱلَّذِينَ ءَاذَوۡاْ مُوسَىٰ فَبَرَّأَهُ ٱللَّهُ مِمَّا قَالُواْۚ وَكَانَ عِندَ ٱللَّهِ وَجِيهٗا","category":["33 (Al-Ahzab)","Al-Ahzab","Surah Al-Ahzab","Chapter Al-Ahzab","Ahzab","Surah Ahzab","Chapter Ahzab","Al Ahzab","Surah Al Ahzab","Chapter Al Ahzab","Surah 33","Chapter 33","The Combined Forces","الأحزَاب"],"ayahNumber":3602,"juzNumber":22,"footnotes":"(V.33:69) Narrated Abû Hurairah رضي الله عنه: Allâh’s Messenger صلى الله عليه وسلم said, \"(Prophet) Mûsâ (Moses) was a shy person and used to cover his body completely because of his extensive shyness. One of the Children of Israel annoyed him by saying, ‘He covers his body in this way only because of some defect in his skin, either leprosy or scrotal hernia, or he had some other defect.’ Allah wished to clear Mûsâ (Moses) of what they said about him: so one day while Mûsâ (Moses) was in seclusion, he took off his clothes and put them on a stone and started taking a bath. When he had finished the bath, he moved towards his clothes so as to take them, but the stone took his clothes and fled. Mûsâ (Moses) picked up his stick and ran after the stone saying, ‘O stone! give me my clothes!’ till he reached a group of Banî Israel who saw him naked then, and found him the best of what Allah had created; and Allah cleared him of what they had accused him of. The stone stopped there and Mûsâ (Moses) took and put his garment on and started hitting the stone with his stick. By Allah, the stone still has some traces of the hitting: three, four or five marks. This was what Allah عز وجل refers to in His Saying:\n‘O you who believe! Be not like those, who annoyed Mûsâ (Moses), but Allâh cleared him of that which they alleged and he was honourable before Allâh...’ \" (V.33:69) (Sahih Al Bukhari, Vol. 4, Hadîth No. 616).","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"yāayyuhā alladhīna āmanū lā takūnū ka-alladhīna ādhaw mūsā fabarra-ahu al-lahu mimmā qālū wakāna ʿinda al-lahi wajīhan ","translations":["O you who believe","O you who believe","O you who believe","(Do) not","be","like those who","abused","Musa","then Allah cleared him","then Allah cleared him","of what","they said","And he was","near","Allah","honorable","(69)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","lā","takūnū","ka-alladhīna","ādhaw","mūsā","fabarra-ahu","al-lahu","mimmā","qālū","wakāna","ʿinda","al-lahi","wajīhan",null],"verseTiming":[[1,0,2440],[2,2440,3380],[3,3380,4380],[4,4380,4760],[5,4760,5710],[6,5710,6930],[7,6930,7660],[8,7660,8380],[9,8380,9560],[10,9560,10340],[11,10340,11450],[12,11450,12440],[13,12440,13580],[14,13580,14770],[15,14770,15620],[16,15620,16695]]}}