{"name":"36:26","price":" 26. It was said (to him when the disbelievers killed him): \"Enter Paradise.\" He said: \"Would that my people knew[1]","arabic":"قِيلَ ٱدۡخُلِ ٱلۡجَنَّةَۖ قَالَ يَٰلَيۡتَ قَوۡمِي يَعۡلَمُونَ","category":["36 (Ya-Sin)","Ya-Sin","Surah Ya-Sin","Chapter Ya-Sin","Sin","Surah Sin","Chapter Sin","Ya Sin","Surah Ya Sin","Chapter Ya Sin","Surah 36","Chapter 36","Ya-Sin","يس"],"ayahNumber":3731,"juzNumber":22,"footnotes":"(V.36:26)\na) Narrated Abu Mûsâ رضي الله عنه : Allah’s Messenger صلى الله عليه وسلم said, \"My example and the example of the Message with which Allah has sent me is like that of a man who came to some people and said, ‘I have seen with my own eyes the enemy forces, and I am a naked warner (to you) so save yourselves, save yourselves’ A group of them obeyed him and went out at night, slowly and stealthily and were safe, while another group did not believe him and thus the army took them in the morning and destroyed them.\" (Sahih Al-Bukhari, Vol.8, Hadith No.489).\nb) Narrated Anas bin Mâlik رضي الله عنه : The Prophet صلى الله عليه وسلم said, \"Nobody who enters Paradise likes to go back to the world even if he got everything on the earth, except a martyr who wishes to return to the world so that he may be martyred ten times because of the honour and dignity he received (from Allâh).\" (Sahih Al-Bukhari, Vol.4, Hadith No.72).\nc) Narrated ‘Abdullâh bin Abî Aufâ رضي الله عنهما: Allâh’s Messenger صلى الله عليه وسلم said, \"Know that Paradise is under the shades of swords. (Jihâd in Allâh’s Cause).\" (Sahih Al-Bukhari, Vol.4, Hadith No.73).\nd) Narrated Anas bin Mâlik رضي الله عنه: The Prophet صلى الله عليه وسلم used to say, \"O Allah! I seek refuge with You from helplessness, laziness, cowardice and senile old age; I seek refuge with You from Fitan (trials and afflictions) of life and death and seek refuge with You from the punishment in the grave.\" (Sahih Al-Bukhari, Vol.4, Hadith No.77).\ne) Narrated ‘Abdullah bin Umar رضي الله عنهما: I heard Allah’s Messenger صلى الله عليه وسلم saying, \"People are just like camels: out of one hundred, one can hardly find a single camel suitable to ride.\" (Sahih Al Bukhari, Vol.8, Hadith No.505).","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"qīla ud'khuli al-janata qāla yālayta qawmī yaʿlamūna ","translations":["It was said","Enter","Paradise","He said","I wish","my people","knew","(26)"],"transliterationArr":["qīla","ud'khuli","al-janata","qāla","yālayta","qawmī","yaʿlamūna",null],"verseTiming":[[1,0,540],[2,540,1270],[3,1270,3220],[4,3220,3920],[5,3920,4970],[6,4970,5850],[7,5850,9835]]}}