{"name":"3:161","price":" 161. It is not for any Prophet to take illegally a part of booty (Ghulul ),[1] and whosoever deceives his companions as regards the booty, he shall bring forth on the Day of Resurrection that which he took (illegally). Then every person shall be paid in full what he has earned, and they shall not be dealt with unjustly.","arabic":"وَمَا كَانَ لِنَبِيٍّ أَن يَغُلَّۚ وَمَن يَغۡلُلۡ يَأۡتِ بِمَا غَلَّ يَوۡمَ ٱلۡقِيَٰمَةِۚ ثُمَّ تُوَفَّىٰ كُلُّ نَفۡسٖ مَّا كَسَبَتۡ وَهُمۡ لَا يُظۡلَمُونَ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":454,"juzNumber":4,"footnotes":"(V.3:161) Al-Ghulul: (Stealing from the war booty before its distribution), and the Statement of Allâh تعالى: \"And whosoever deceives his companions as regards booty, he shall bring forth on the Day of Resurrection that which he took (illegally)\".\nNarrated Abu Hurairah رضي الله عنه: The Prophet صلى الله عليه وسلم got up amongst us and mentioned Al-Ghulul, emphasised its magnitude and declared that it was a great sin saying, \"Don’t commit Al-Ghulul for I should not like to see anyone amongst you on the Day of Resurrection, carrying over his neck a sheep that will be bleating, or carrying over his neck a horse that will be neighing. Such a man will be saying: ‘O Allâh’s Messenger! Intercede with Allâh for me,’ and I will reply, ‘I can’t help you, for I have conveyed Allâh’s Message to you.’ Nor should I like to see a man carrying over his neck, a camel that will be grunting. Such a man will say, ‘O Allâh’s Messenger! Intercede with Allâh for me,’ and I will say, ‘I can’t help you for I have conveyed Allâh’s Message to you’; or one carrying over his neck gold and silver and saying, ‘O Allâh’s Messenger! Intercede with Allâh for me.’ And I will say, ‘I can’t help you, for I have conveyed Allâh’s Message to you, or one carrying clothes that will be fluttering, and the man will say, ‘O Allâh’s Messenger! Intercede with Allâh for me.’ And I will say, ‘I can’t help you, for I have conveyed Allâh’s Message to you.’ \" (Sahih Al-Bukhâri, Vol.4, Hadîth No.307).","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"wamā kāna linabiyyin an yaghulla waman yaghlul yati bimā ghalla yawma al-qiyāmati thumma tuwaffā kullu nafsin mā kasabat wahum lā yuẓ'lamūna ","translations":["And not","is","for a Prophet","that","he defrauds","And whoever","defrauds","will bring","what","he had defrauded","(on the) Day","(of) Resurrection","Then","is repaid in full","every","soul","what","it earned","and they","(will) not","be wronged","(161)"],"transliterationArr":["wamā","kāna","linabiyyin","an","yaghulla","waman","yaghlul","yati","bimā","ghalla","yawma","al-qiyāmati","thumma","tuwaffā","kullu","nafsin","mā","kasabat","wahum","lā","yuẓ'lamūna",null],"verseTiming":[[1,0,780],[2,780,1529],[3,1529,2648],[4,2648,3430],[5,3430,4760],[6,4760,6124],[7,6124,7270],[8,7270,7996],[9,7996,8616],[10,8616,9184],[11,9184,9878],[12,9878,11109],[13,11109,12750],[14,12750,13872],[15,13872,14527],[16,14527,15020],[17,15020,16060],[18,16060,16930],[19,16930,17590],[20,17590,18030],[21,18030,20585]]}}