{"name":"3:164","price":" 164. Indeed Allâh conferred a great favour on the believers when He sent among them a Messenger (Muhammad صلى الله عليه وسلم) from among themselves, reciting unto them His Verses (the Qur’ân), and purifying them (from sins by their following him), and instructing them (in) the Book (the Qur’ân) and Al-Hikmah [the wisdom and the Sunnah of the Prophet صلى الله عليه وسلم (i.e. his legal ways, statements, acts of worship)], while before that they had been in manifest error.[2]","arabic":"لَقَدۡ مَنَّ ٱللَّهُ عَلَى ٱلۡمُؤۡمِنِينَ إِذۡ بَعَثَ فِيهِمۡ رَسُولٗا مِّنۡ أَنفُسِهِمۡ يَتۡلُواْ عَلَيۡهِمۡ ءَايَٰتِهِۦ وَيُزَكِّيهِمۡ وَيُعَلِّمُهُمُ ٱلۡكِتَٰبَ وَٱلۡحِكۡمَةَ وَإِن كَانُواْ مِن قَبۡلُ لَفِي ضَلَٰلٖ مُّبِينٍ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":457,"juzNumber":4,"footnotes":"(V.3:164) Following the Sunnah (legal ways) of the Prophet صلى الله عليه وسلم. And the Statement of Allâh عز وجل - \"And make us leaders for the righteous.\" (V.25:74).\nMujâhid said, \"(Make us) a community that follows the Muttaqûn (righteous) people who preceded us, and whom those succeeding may follow.\" Ibn ‘Aun said, \"(There are) three things which I love for myself and for my brothers, i.e. this Sunnah (the legal ways of the Prophet صلى الله عليه وسلم) which they should learn and ask about; the Qur’ân which they should understand and ask the people about; and that they should leave the people except when intending to do good (for them).\" (Sahih Al-Bukhâri, Vol.9, Chap. 2, P.282)\nA) Narrated Hudhaifah: Allâh’s Messenger صلى الله عليه وسلم said to us, \"Certainly Al-Amânah (the trust or the moral responsibility or honesty, and all the duties which Allâh has ordained) descended from the heavens and settled in the roots of the hearts of men (faithful believers), and then the Qur’ân was revealed and the people read the Qur’ân, (and learnt Al-Amânah from it) and also learnt it from the Sunnah, [Both the Qur’ân and As-Sunnah strengthened their (the faithful believer’s) Amânah ].\" (Sahih Al-Bukhâri, Vol. 9, Hadîth No.381).\nB) Narrated Abu Hurairah رضي الله عنه: Allâh’s Messenger صلى الله عليه وسلم said, \"All my followers will enter Paradise except those who refuse.\" They said, \"O Allâh’s Messenger! Who will refuse?\" He said, \"Whoever obeys me will enter Paradise, and whoever disobeys me is the one who refuses (to enter it).\" (Sahih Al-Bukhâri, Vol.9, Hadîth No.384).\nC) Narrated Jâbir bin ‘Abdullâh رضي الله عنهما: Some angels came to Prophet Muhammad (صلى الله عليه وسلم) while he was sleeping. Some of them said, \"He is sleeping.\" Others said, His eyes are sleeping but his heart is awake.\" Then they said, \"There is an example for this companion of yours.\" One of them said, \"Then set forth an example for him.\" Some of them said, \"He is sleeping.\" The others said, \"His eyes are sleeping but his heart is awake.\" Then they said, \"His example is that of a man who has built a house and then, offered therein a banquet and sent an inviter (messenger) to invite the people. So whosoever accepted the invitation of the inviter, entered the house and ate of the banquet, and whoever did not accept the invitation of the inviter, did not enter the house, nor did he eat of the banquet.\" Then the angels said, \"Interpret this parable to him so that he may understand it.\" Some of them said, \"He is sleeping.\" The others said, \"His eyes are sleeping but his heart is awake.\" And then they said, \"The house stands for Paradise and the call-maker is Muhammad صلى الله عليه وسلم and whoever obeys Muhammad صلى الله عليه وسلم , obeys Allâh; and whoever disobeys Muhammad صلى الله عليه وسلم, disobeys Allâh. Muhammad صلى الله عليه وسلم separated the people (i.e., through his message, the good is distinguished from the bad, and the believers from the disbelievers).\" (Sahih Al-Bukhâri, Vol.9, Hadîth No.385).\nD) Narrated Abu Mûsa رضي الله عنه: The Prophet صلى الله عليه وسلم said, \"My example, and the example of what I have been sent with, is that of a man who came to some people and said, ‘O people I have seen the enemy’s army with my own eyes, and I am the naked warner; so protect yourselves!’ Then a group of his people obeyed him and fled at night proceeding stealthily till they were safe, while another group of them disbelieved him and stayed at their places till morning when the army came upon them, and killed and ruined them completely. So this is the example of that person who obeys me and follows that truth which I have brought (the Qur’ân and the Sunnah), and the example of the one who disobeys me and disbelieves the truth I have brought.\" (Sahih Al-Bukhari, Vol.9, Hadîth No.387).","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"laqad manna al-lahu ʿalā al-mu'minīna idh baʿatha fīhim rasūlan min anfusihim yatlū ʿalayhim āyātihi wayuzakkīhim wayuʿallimuhumu al-kitāba wal-ḥik'mata wa-in kānū min qablu lafī ḍalālin mubīnin ","translations":["Certainly","bestowed a Favor","Allah","upon","the believers","as","He raised","among them","a Messenger","from","themselves","reciting","to them","His Verses","and purifying them","and teaching them","the Book","and the wisdom","although","they were","from","before (that)","certainly in","(the) error","clear","(164)"],"transliterationArr":["laqad","manna","al-lahu","ʿalā","al-mu'minīna","idh","baʿatha","fīhim","rasūlan","min","anfusihim","yatlū","ʿalayhim","āyātihi","wayuzakkīhim","wayuʿallimuhumu","al-kitāba","wal-ḥik'mata","wa-in","kānū","min","qablu","lafī","ḍalālin","mubīnin",null],"verseTiming":[[1,0,790],[2,790,2280],[3,2280,3300],[4,3300,3750],[5,3750,5340],[6,5340,5860],[7,5860,6600],[8,6600,7430],[9,7430,8430],[10,8430,9540],[11,9540,11700],[12,11700,12570],[13,12570,13690],[14,13690,15340],[15,15340,17390],[16,17390,19515],[17,19515,21629],[18,21629,22600],[19,22600,23890],[20,23890,25120],[21,25120,26010],[22,26010,26850],[23,26850,27560],[24,27560,28210],[25,28210,29240],[26,29240,32755]]}}