{"name":"3:46","price":"46. \"He will speak to the people in the cradle[1] and in manhood, and he will be one of the righteous.\"","arabic":"وَيُكَلِّمُ ٱلنَّاسَ فِي ٱلۡمَهۡدِ وَكَهۡلٗا وَمِنَ ٱلصَّٰلِحِينَ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":339,"juzNumber":3,"footnotes":"(V.3:46) Narrated Abu Hurairah رضي الله عنه: The Prophet صلى الله عليه وسلم said, \"None spoke in cradle but three: (The first was) Jesus, (the second child was): There was a man from Banî Israel called Juraij. While he was offering prayer, his mother came and called him. He said (to himself), \"Shall I answer her or keep on praying?\" (He went on praying and did not answer her). His mother said, \"O Allâh! Do not let him die till he sees the faces of prostitutes.\" So while he was in his hermitage, a lady came and sought to seduce him, but he refused. So she went to a shepherd and presented herself to him to commit illegal sexual intercourse with her, and then later she gave birth to a child and claimed that it belonged to Juraij. The people, therefore, came to him and dismantled his hermitage and expelled him out of it and abused him. Juraij performed ablution and offered prayer, and then came to the child and said: \"O child! Who is your father?\" The child replied, \"The shepherd\" (after hearing this) the people said, \"We shall rebuild your hermitage of gold,\" but he said: \"No, of nothing but mud.\" (The third was the hero of the following story): A lady from Banî Israel was nursing her child at her breast when a handsome rider passed by her. She said, \"O Allâh! Make my child like him.\" On that the child left her breast and facing the rider said: \"O Allâh! Do not make me like him.\" The child then started to suck her breast again. [Abu Hurairah further said, \"As if I were now looking at the Prophet صلى الله عليه و سلم sucking his finger (in way of demonstration.\")]. After a while they (some people) passed by, with a lady slave and she (i.e. the child’s mother) said, \"O Allâh! Do not make my child like this (slave-girl)!\" On that the child left her breast, and said, \"O Allâh! Make me like her.\" When she asked why, the child replied, \"The rider is one of the tyrants while this slave-girl is falsely accused of theft and illegal sexual intercourse.\" (Sahih Al-Bukhâri, Vol.4, Hadîth No.645).","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"wayukallimu al-nāsa fī al-mahdi wakahlan wamina al-ṣāliḥīna ","translations":["And he will speak","(to) the people","in","the cradle","and (in) maturity","and (he will be) of","the righteous","(46)"],"transliterationArr":["wayukallimu","al-nāsa","fī","al-mahdi","wakahlan","wamina","al-ṣāliḥīna",null],"verseTiming":[[1,0,1220],[2,1220,2560],[3,2560,2800],[4,2800,3630],[5,3630,5190],[6,5190,5820],[7,5820,8805]]}}