{"name":"3:64","price":" 64. Say (O Muhammad صلى الله عليه وسلم): \"O people of the Scripture (Jews and Christians): Come to a word that is just between us and you, that we worship none but Allâh (Alone), and that we associate no partners with Him, and that none of us shall take others as lords besides Allâh[1]. Then, if they turn away, say: \"Bear witness that we are Muslims.\"","arabic":"قُلۡ يَٰٓأَهۡلَ ٱلۡكِتَٰبِ تَعَالَوۡاْ إِلَىٰ كَلِمَةٖ سَوَآءِۭ بَيۡنَنَا وَبَيۡنَكُمۡ أَلَّا نَعۡبُدَ إِلَّا ٱللَّهَ وَلَا نُشۡرِكَ بِهِۦ شَيۡـٔٗا وَلَا يَتَّخِذَ بَعۡضُنَا بَعۡضًا أَرۡبَابٗا مِّن دُونِ ٱللَّهِۚ فَإِن تَوَلَّوۡاْ فَقُولُواْ ٱشۡهَدُواْ بِأَنَّا مُسۡلِمُونَ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":357,"juzNumber":3,"footnotes":"(V.3:64) Narrated Ibn ‘Abbâs رضي الله عنهما: Abu Sufyân narrated to me personally, saying, \"I set out during the truce that had been concluded between me and Allâh’s Messenger صلى الله عليه وسلم. While I was in Shâm, a letter sent by the Prophet صلى الله عليه وسلم was brought to Heraclius. Dihya Al-Kalbi had brought and given it to the governor of Busra, and the latter forwarded it to Heraclius. Heraclius said, ‘Is there anyone from the people of this man who claims to be a Prophet?’ The people replied, ‘Yes,’ so, along with some other Quraishi men, I was called and we entered upon Heraclius, and we were seated in front of him. Then he said, ‘Who amongst you is the nearest relative to the man who claims to be a Prophet?’ I (Abu Sufyân) replied: ‘I am the nearest relative to him from amongst the group.’ So they made me sit in front of him and made my companions sit behind me. Then he called upon his translator and said (to him). ‘Tell them (i.e. Abu Sufyân’s companions) that I am going to ask him (i.e. Abu Sufyân) regarding that man who claims to be a Prophet. So, if he tells me a lie, they should contradict him (instantly).’ By Allâh, had I not been afraid that my companions would consider me a liar, I would have told lies. Heraclius then said to his translator, ‘Ask him: What is his (i.e. the Prophet’s) family status amongst you?’ I said, ‘He belongs to a noble family amongst us.’ Heraclius said, ‘Was any of his ancestors a king?’ I said, ‘No’. He said, ‘Did you ever accuse him of telling lies before his saying what he has said?’ I said, ‘No’. He said, ‘Do the nobles follow him or the poor people?’ I said, ‘It is the poor who follow him.’ He said, ‘Is the number of his followers increasing or decreasing?’ I said, ‘They are increasing.’ He said, ‘Does anyone renounce his religion (i.e. Islâm) after embracing it, being displeased with it?’ I said, ‘No.’ He said, ‘Did you fight with him?’ I replied, ‘Yes.’ He said, ‘How was your fighting with him?’ I said, ‘The fighting between us was undecided and victory was shared by him and us in turns. He inflicts casualties upon us and we inflict casualties upon him.’ He said, ‘Did he ever betray?’ I said, ‘No, but now we are away from him in this truce and we do not know what he will do in it.’ \" Abu Sufyân added, \"By Allâh, I was not able to insert in my speech a word (against him) except that. Heraclius said, ‘Did anybody else (amongst you) ever claim the same (i.e. to be Allâh’s Prophet) before him?’ I said, ‘No’. Then Heraclius told his translator to tell me (i.e. Abu Sufyân), ‘I asked you about his family status amongst you, and you told me that he comes from a noble family amongst you. Verily, all Messengers come from the noblest family among their people. Then I asked you whether any of his ancestors was a king, and you denied that. Thereupon I thought that had one of his forefathers been a king, I would have said that he (i.e. Muhammad صلى الله عليه وسلم) was seeking to rule the kingdom of his forefathers. Then I asked you regarding his followers, whether they were the noble or the poor among the people, and you said that they were only poor (who follow him). In fact, such are the followers of the Messengers. Then I asked you whether you have ever accused him of telling lies before he said what he said, and your reply was in the negative. Therefore, I took for granted that a man who did not tell a lie about others, could never tell a lie about Allâh. Then I asked you whether anyone of his followers had renounced his religion (i.e. Islâm) after embracing it, being displeased with it, and you denied that. And such is faith when its delight enters the heart and mixes with it completely. Then I asked you whether his followers were increasing or decreasing. You claimed that they were increasing, that is the way of true faith till it is complete. Then I asked you whether you had ever fought with him, and you claimed that you had fought with him and the battle between you and him was undecided and the victory was shared by you and him in turns; he inflicted casualties upon you and you inflicted casualties upon them. Such is the case with the Messengers, they are put to trials and the final victory is for them. Then I asked you whether he has ever betrayed anyone; you claimed that he had never betrayed. Indeed, Messengers never betray. Then I asked you whether anyone had said this statement before him; and you denied that. Thereupon I thought if somebody had said that statement before him, then I would have said that he was but a man copying some sayings said before him.’ Abu Sufyân said, \"Heraclius then asked me, ‘What does he order you to do?’ I said, ‘He orders us (to offer) prayers and (to pay) Zakât, and to keep good relationship with the kith and kin, and to be chaste.’ Then Heraclius said, ‘If whatever you have said is true, then he is really a Prophet. I knew that he (i.e. the Prophet صلى الله عليه وسلم) was going to appear, but I never thought that he would be from amongst you. If I were certain that I can reach him, I would like to meet him and if I were with him, I would wash his feet; and his kingdom will expand (surely) to what is under my feet.’ Then Heraclius asked for the letter of Allâh’s. Messenger صلى الله عليه وسلم and read it, wherein was written: In the Name of Allâh, the Most Gracious, the Most Merciful\n(This letter is) from Muhammad, Messenger of Allâh, to Heraclius, the sovereign of Byzantine\nPeace be upon him who follows the Right Path. Now then, I call you to embrace Islâm. Embrace Islâm and you will be saved (from Allâh’s punishment); embrace Islâm, and Allâh will give you a double reward, but if you reject this, you will be responsible for the sins of all the people of your kingdom: (Allâh’s Statement): \"O people of the Scripture (Jews and Christians)! Come to a word that is just between us and you, that we worship none but Allâh (Alone) ... bear witness that we are Muslims.\" (3:64). \"When he finished reading the letter, voices grew louder near him and there was a great hue and cry, and we were ordered to go out.\" Abu Sufyân added, \"While coming out, I said to my companions, ‘The matter of Ibn Abu Kabshah* (i.e. Muhammad صلى الله عليه وسلم has become so prominent that even the king of Banu Al-Asfar (i.e. the Romans) is afraid of him.’ So I continued to believe that Allâh’s Messengerصلى الله عليه وسلم would be victorious, till Allâh made me embrace Islâm.\" Az-Zuhri said, \"Heraclius then invited all the chiefs of the Byzantine and had them assembled in his house and said, ‘O group of Byzantine! Do you wish to have a permanent success and guidance and that your kingdom should remain with you?’ (Immediately after hearing that), they rushed towards the gate like onagers, but they found them closed. Heraclius then said, ‘Bring them back to me.’ So he called them and said, ‘I just wanted to test the strength of your adherence to your religion. Now I have observed of you that which I like.’ Then the people fell in prostration before him and became pleased with him.\" (Sahih Al-Bukhâri Vol.6, Hadîth No.75).\n* Abu Kabshah was not the father of the Prophet صلى الله عليه وسلم but it was a mockery done by Abu Sufyân out of hostility against the Prophet صلى الله عليه وسلم.","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"qul yāahla al-kitābi taʿālaw ilā kalimatin sawāin baynanā wabaynakum allā naʿbuda illā al-laha walā nush'rika bihi shayan walā yattakhidha baʿḍunā baʿḍan arbāban min dūni al-lahi fa-in tawallaw faqūlū ish'hadū bi-annā mus'limūna ","translations":["Say","O People","(of) the Book","Come","to","a word","equitable","between us","and between you ","that not","we worship","except","Allah","and not","we associate partners","with Him ","anything","and not","take","some of us","(to) others","(as) lords","from","besides","Allah","Then if","they turn away","then say","Bear witness","that we","(are) Muslims","(64)"],"transliterationArr":["qul","yāahla","al-kitābi","taʿālaw","ilā","kalimatin","sawāin","baynanā","wabaynakum","allā","naʿbuda","illā","al-laha","walā","nush'rika","bihi","shayan","walā","yattakhidha","baʿḍunā","baʿḍan","arbāban","min","dūni","al-lahi","fa-in","tawallaw","faqūlū","ish'hadū","bi-annā","mus'limūna",null],"verseTiming":[[1,0,450],[2,450,2830],[3,2830,3940],[4,3940,4960],[5,4960,5500],[6,5500,7110],[7,7110,9820],[8,9820,11189],[9,11189,12639],[10,12639,13469],[11,13469,14339],[12,14339,14849],[13,14849,17529],[14,17529,18529],[15,18529,19319],[16,19319,19919],[17,19919,20909],[18,20909,21469],[19,21469,22309],[20,22309,22899],[21,22899,24179],[22,24179,24769],[23,24769,25799],[24,25799,26799],[25,26799,27719],[26,27719,28889],[27,28889,29809],[28,29809,31169],[29,31169,33749],[30,33749,35059],[31,35059,36139],[32,36139,36999],[33,36999,37829],[34,37829,39459],[35,39459,42164]]}}