{"name":"3:71","price":" 71. O people of the Scripture (Jews and Christians): \"Why do you mix truth with falsehood and conceal the truth while you know?\"[1]","arabic":"يَٰٓأَهۡلَ ٱلۡكِتَٰبِ لِمَ تَلۡبِسُونَ ٱلۡحَقَّ بِٱلۡبَٰطِلِ وَتَكۡتُمُونَ ٱلۡحَقَّ وَأَنتُمۡ تَعۡلَمُونَ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":364,"juzNumber":3,"footnotes":" (V.3:71) Narrated Anas رضي الله عنه : There was a christian who embraced Islâm and read Sûrat-Al-Baqara and Al-‘Imrân, and he used to write (the revelations) for the Prophet صلى الله عليه وسلم. Later on he reverted to Christianity again, and he used to say: \"Muhammad صلى الله عليه وسلم knows nothing but what I have written for him.\" Then Allâh caused him to die, and the people buried him, but in the morning they saw that the earth had thrown his body out. They said, \"This is the act of Muhammad صلى الله عليه وسلم and his companions. They dug the grave of our companion and took his body out because he had run away from them.\" They again dug the grave deeply for him, but in the morning they again saw that the earth had thrown his body out. They said, \"This is an act of Muhammad صلى الله عليه وسلم and his companions. They dug the grave of our companion and took his body outside it, for he had run away from them.\" They dug the grave for him as deep as they could, but in the morning they again saw that the earth had thrown his body out. So they believed that what had befallen him was not done by human beings and had to leave him thrown (on the ground). (Sahih Al-Bukhâri, Vol.4, Hadîth No.814).","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"yāahla al-kitābi lima talbisūna al-ḥaqa bil-bāṭili wataktumūna al-ḥaqa wa-antum taʿlamūna ","translations":["O People","(of) the Book","Why","do you mix","the truth","with the falsehood","and conceal","the truth","while you","know","(71)"],"transliterationArr":["yāahla","al-kitābi","lima","talbisūna","al-ḥaqa","bil-bāṭili","wataktumūna","al-ḥaqa","wa-antum","taʿlamūna",null],"verseTiming":[[1,0,2600],[2,2600,3650],[3,3650,4030],[4,4030,5330],[5,5330,6280],[6,6280,7520],[7,7520,8960],[8,8960,9980],[9,9980,11720],[10,11720,14835]]}}