{"name":"3:73","price":" 73. And believe no one except the one who follows your religion. Say (O Muhammad صلى الله عليه وسلم): \"Verily! Right guidance is the Guidance of Allâh\" and do not believe that anyone can receive like that which you have received, otherwise they would engage you in argument before your Lord. Say (O Muhammad صلى الله عليه وسلم): \"All the bounty is in the Hand[2] of Allâh; He grants to whom He wills. And Allâh is All-Sufficient for His creatures’ needs, All-Knower.\"","arabic":"وَلَا تُؤۡمِنُوٓاْ إِلَّا لِمَن تَبِعَ دِينَكُمۡ قُلۡ إِنَّ ٱلۡهُدَىٰ هُدَى ٱللَّهِ أَن يُؤۡتَىٰٓ أَحَدٞ مِّثۡلَ مَآ أُوتِيتُمۡ أَوۡ يُحَآجُّوكُمۡ عِندَ رَبِّكُمۡۗ قُلۡ إِنَّ ٱلۡفَضۡلَ بِيَدِ ٱللَّهِ يُؤۡتِيهِ مَن يَشَآءُۗ وَٱللَّهُ وَٰسِعٌ عَلِيمٞ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":366,"juzNumber":3,"footnotes":"(V.3:73) \"The Qualities of Allâh عز وجل \"\nصفات الله عز وجل\nإن جميع ما ورد في كتاب الله عز وجل من صفات الله تعالى كالوجه والعين واليد والساق والمجيء، والاستواء وغيرها من الصفات ، أو مما وصفه الرسول صلى الله عليه وسلم وثبت في الأحاديث النبوية الصحيحة كالنزول ، والضحك ، وغيرها فإن العلماء بالكتاب والسنة يؤمنون بهذه الصفات ، ويثبتونها لله تعالى من غير تأويل أو تشبيه أو تعطيل ، وهي صفات تليق بالله تعالى لا تشبه صفات أحد من المخلوقين لقوله تعالى (لَيْسَ كَمِثْلِهِ شَيْءٌ) 42/11 وقوله تعالى (وَلَمْ يَكُن لَّهُ كُفُواً أَحَدُ) 112/4 .\n\nSifât-ullâh (Qualities of Allâh).\nAll that has been revealed in Allâh’s Book [the Qur’ân] as regards the [Sifâf ] Qualities of Allâh عز وجل , the Most High, like His Face, Eyes, Hands, Shins, (Legs), His Coming, His (Istawa ) rising over His Throne and others, or all that Allâh’s Messenger صلى الله عليه وسلم qualified Him in the true authentic Prophet’s Ahadith (narrations) as regards His Qualities like [Nuzûl ], His Descent or His laughing and others, the religious scholars of the Qur’ân and the Sunnah believe in these Qualities of Allâh and they confirm that these are really His Qualities, without Ta’wîl (interpreting their meanings into different things) or Tashbîh\" (giving resemblance or similarity to any of the creatures) or [Ta‘tîl ] (completely ignoring or denying them i.e., there is no Face, or Eyes or Hands, or Shins for Allâh). These Qualities befit or suit only for Allâh Alone, and He does not resemble any of (His) creatures. As Allâh’s Statement (in the Qur’ân): (1) \"There is nothing like Him, and He is the All-Hearer, The All-Seer\" (V.42.11) There is none comparable unto him (V.112:4).\"","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"walā tu'minū illā liman tabiʿa dīnakum qul inna al-hudā hudā al-lahi an yu'tā aḥadun mith'la mā ūtītum aw yuḥājjūkum ʿinda rabbikum qul inna al-faḍla biyadi al-lahi yu'tīhi man yashāu wal-lahu wāsiʿun ʿalīmun ","translations":["And (do) not","believe","except","(the one) who","follows","your religion","Say","Indeed","the (true) guidance","(is the) Guidance","(of) Allah ","lest","is given","(to) one ","(the) like","(of) what","was given to you","or","they may argue with you","near","your Lord","Say","Indeed","the Bounty","(is) in the Hand","(of) Allah","He gives it","(to) whom","He wills","and Allah","(is) All-Encompassing","All-Knowing","(73)"],"transliterationArr":["walā","tu'minū","illā","liman","tabiʿa","dīnakum","qul","inna","al-hudā","hudā","al-lahi","an","yu'tā","aḥadun","mith'la","mā","ūtītum","aw","yuḥājjūkum","ʿinda","rabbikum","qul","inna","al-faḍla","biyadi","al-lahi","yu'tīhi","man","yashāu","wal-lahu","wāsiʿun","ʿalīmun",null],"verseTiming":[[1,0,670],[2,670,2920],[3,2920,3700],[4,3700,4300],[5,4300,5660],[6,5660,6780],[7,6780,7150],[8,7150,8150],[9,8150,9070],[10,9070,9470],[11,9470,12320],[12,12320,12680],[13,12680,13790],[14,13790,14680],[15,14680,15070],[16,15070,16060],[17,16060,16380],[18,16380,19180],[19,19180,19670],[20,19670,21060],[21,21060,22570],[22,22570,23950],[23,23950,24310],[24,24310,28530],[25,28530,30010],[26,30010,31560],[27,31560,32090],[28,32090,33420],[29,33420,34380],[30,34380,35010],[31,35010,35770],[32,35770,36960],[33,36960,38918],[34,38918,40984],[35,40984,42409],[36,42409,43240],[37,43240,45535]]}}