{"name":"3:85","price":" 85. And whoever seeks a religion other than Islâm, it will never be accepted of him, and in the Hereafter he will be one of the losers[1].","arabic":"وَمَن يَبۡتَغِ غَيۡرَ ٱلۡإِسۡلَٰمِ دِينٗا فَلَن يُقۡبَلَ مِنۡهُ وَهُوَ فِي ٱلۡأٓخِرَةِ مِنَ ٱلۡخَٰسِرِينَ","category":["3 (Al-Imran)","Al-Imran","Surah Al-Imran","Chapter Al-Imran","Imran","Surah Imran","Chapter Imran","Al Imran","Surah Al Imran","Chapter Al Imran","Surah 3","Chapter 3","The Family of Imran","آل عِمرَان"],"ayahNumber":378,"juzNumber":3,"footnotes":"(V.3:85).\na) It is obligatory to have Belief in the Messengership of the Prophet (Muhammad صلى الله عليه وسلم). Narrated Abu Hurairah رضي الله عنه: Allâh’s Messenger صلى الله عليه وسلم said: \"By Him (Allâh) in Whose Hand Muhammad’s soul is, there is none from amongst the Jews and the Christians (of these present nations) who hears about me and then dies without believing in the Message with which I have been sent (i.e. Islâmic Monotheism), but he will be from the dwellers of the (Hell) Fire.\" (Sahih Muslim , the Book of Faith, Vol.1, Hadith No.240). [See also (V.3:116)]\nb) The asking of (angel) Jibrael (Gabriel) from the Prophet صلى الله عليه وسلم about Belief, Islâm, Ihsân (perfection) and the knowledge of the Hour (Doomsday), and their explanation given to him by the Prophet صلى الله عليه وسلم. Then the Prophet صلى الله عليه وسلم said (to his companions): \"Jibrael (Gabriel) عليه السلام came to teach you your religion.\" So the Prophet صلى الله عليه وسلم regarded all that as a religion. And all that which the Prophet صلى الله عليه وسلم explained to the delegation of ‘Abdûl-Qais was a part of faith. (See Sahih Al-Bukhâri, Vol.1, Hadîth No.50 and 87) And the Statement of Allâhعز وجل : \"And whoever seeks a religion other than Islam, it will never be accepted of him.\" (3:85).\nNarrated Abu Hurairah رضي الله عنه : One day while the Prophet صلى الله عليه وسلم was sitting in the company of some people, (The angel) Jibrael (Gabriel) عليه السلام came and asked, \"What is Faith?\" Allâh’s Messenger صلى الله عليه وسلم replied, \"Faith is to believe in Allâh, His angels, (the) meeting with Him, His messengers, and to believe in Resurrection.\"* Then he further asked, \"What is Islâm?\" Allâh’s Messenger صلى الله عليه وسلم replied, \"To worship Allâh Alone and none else, to perform As-Salât (Iqamât-as-Salât), to give the Zakât and to observe Saum (fasts) during the month of Ramadân,\"** then he further asked, \"What is Ihsân (perfection)?\" Allâh’s Messenger صلى الله عليه وسلم replied, \"To worship Allâh عز وجل as if you see Him, and if you cannot achieve this state of devotion then you must consider that He is looking at you.\" Then he further asked, \"When will the Hour be established?\" Allâh’s Messenger صلى الله عليه وسلم replied, \"The answerer has no better knowledge than the questioner. But I will inform you about its portents:\n(1) When a slave (lady) gives birth to her master.\n(2) When the shepherds of black camels start boasting and competing with others in the construction of higher buildings. And the Hour is one of the five things which nobody knows except Allâh.\nThe Prophet صلى الله عليه وسلم then recited: \"Verily, the knowledge of the Hour is with Allâh (Alone).\" (31:34). Then that man (Gabriel عليه السلام) left and the Prophet صلى الله عليه وسلم asked his Companions to call him back, but they could not see him. Then the Prophet صلى الله عليه وسلم said, \"That was (angel) Gabriel عليه السلام who came to teach the people their religion.\"\nAbu ‘Abdullâh رضي الله عنه said: He (the Prophet صلى الله عليه وسلم) considered all that as a part of faith. (Sahih Al-Bukhâri, Vol.1, Hadîth No.47).\n*In this Hadîth, only 4 articles are mentioned, while in another Hadîth, 6 articles are mentioned: (i) Allâh, (ii) His Angels, (iii) His Books (The Torah, The Gospel, The Qur’ân and all the other Holy Books revealed by Allâh), (iv) His Messengers, (v) Day of Resurrection and (vi) Al-Qadar (Divine Pre-ordainments), i.e. whatever Allâh has ordained, must come to pass.\n**Again the principles of Islâm mentioned here are 4, but in other narrations, they are 5 - 5th is the pilgrimage (Haji ) to Makkah for the one who can afford it once in a lifetime.","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"waman yabtaghi ghayra al-is'lāmi dīnan falan yuq'bala min'hu wahuwa fī al-ākhirati mina al-khāsirīna ","translations":["And whoever","seeks","other than","[the] Islam","(as) religion","then never","will be accepted","from him","and he","in","the Hereafter","(will be) from","the losers","(85)"],"transliterationArr":["waman","yabtaghi","ghayra","al-is'lāmi","dīnan","falan","yuq'bala","min'hu","wahuwa","fī","al-ākhirati","mina","al-khāsirīna",null],"verseTiming":[[1,0,660],[2,660,2362],[3,2362,3111],[4,3111,4394],[5,4394,5586],[6,5586,7017],[7,7017,8430],[8,8430,9176],[9,9176,10850],[10,10850,11550],[11,11550,12297],[12,12297,12994],[13,12994,13430],[14,13430,14628],[15,14628,15225],[16,15225,18264]]}}