{"name":"41:46","price":" 46. Whosoever does righteous good deed, it is for (the benefit of) his ownself; and whosoever does evil, it is against his ownself. And your Lord is not at all unjust to (His) slaves.[3]","arabic":"مَّنۡ عَمِلَ صَٰلِحٗا فَلِنَفۡسِهِۦۖ وَمَنۡ أَسَآءَ فَعَلَيۡهَاۗ وَمَا رَبُّكَ بِظَلَّٰمٖ لِّلۡعَبِيدِ","category":["41 (Fussilat)","Fussilat","Surah Fussilat","Chapter Fussilat","Surah 41","Chapter 41","Explained in Detail","فُصِّلَت"],"ayahNumber":4264,"juzNumber":24,"footnotes":"(V.41:46)\na) See the footnote of (V.6:61).\nb) See the footnote of (V.3:85).\nc) Narrated Abu Mûsâ رضي الله عنه: The Prophet صلى الله عليه وسلم said, \"The example of Muslims, Jews and Christians is like the example of a man who employed labourers to work for him from morning till night for specific wages. They worked till mid-day and then said, We do not need your money which you have fixed for us and let whatever we have done be annulled.’ The man said to them, ‘Don’t quit the work, but complete the rest of it and take your full wages.’ But they refused and went away (like the Jews who refused to believe in the Message of Jesus عليه السلام). The man employed another batch after them and said to them, ‘Complete the rest of the day and yours will be the wages I had fixed for the first batch.’ So, they worked till the time of ‘Asr Prayer. They said, ‘Let what we have done be annulled and keep the wages you have promised us for yourself!’ The man said to them, ‘Complete the rest of the work, as only a little of the day remains’: but they refused (like the Christians who refused to believe in the Message of Muhammad صلى الله عليه وسلم). Thereafter, he employed another batch to work for the rest of the day, and they worked for the rest of the day till the sunset, and they received the wages of the two former batches. So that was the example of these people (Muslims) and the example of this light [Islâmic Monotheism, the Qur’ân, the Sunnah (legal ways of the Prophet صلى الله عليه وسلم) and the guidance which Prophet Muhammad صلى الله عليه وسلم brought] which they have accepted willingly.\"* (Sahih Al-Bukhari, Vol.3, Hadith No.471).\n* The Jews refused to believe in the Message of ‘Îsâ (Jesus), so all their work was annulled; similarly the Christians refused to accept the Message of Muhammad صلى الله عليه وسلم and thus their work was annulled too. Such people were not rewarded, because they refused to have true faith for the rest of their lives and died as disbelievers. They should have believed in the latest Message; for their insistence on keeping their old religion deprived them of the reward which they would have got for their previous good deeds achieved before the advent of the new religion. On the other hand, Muslims accepted and believed in all the three Messages and deserved a full reward for their complete surrender to Allâh (Al-Qastalâni, Vol.4, Page 133).","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"man ʿamila ṣāliḥan falinafsihi waman asāa faʿalayhā wamā rabbuka biẓallāmin lil'ʿabīdi ","translations":["Whoever","does","righteous deeds","then it is for his soul","and whoever","does evil","then it is against it","And not","(is) your Lord","unjust","to His slaves","(46)"],"transliterationArr":["man","ʿamila","ṣāliḥan","falinafsihi","waman","asāa","faʿalayhā","wamā","rabbuka","biẓallāmin","lil'ʿabīdi",null],"verseTiming":[[1,0,480],[2,480,1140],[3,1140,2950],[4,2950,4490],[5,4490,5150],[6,5150,7640],[7,7640,9020],[8,9020,10080],[9,10080,11030],[10,11030,12320],[11,12320,16145]]}}