{"name":"45:35","price":" 35. This, because you took the revelations of Allâh (this Qur’ân) in mockery, and the life of the world deceived you. So this Day, they shall not be taken out from there (Hell),[1] nor shall they be returned to the worldly life, (so that they repent to Allâh, and beg His Pardon for their sins).","arabic":"ذَٰلِكُم بِأَنَّكُمُ ٱتَّخَذۡتُمۡ ءَايَٰتِ ٱللَّهِ هُزُوٗا وَغَرَّتۡكُمُ ٱلۡحَيَوٰةُ ٱلدُّنۡيَاۚ فَٱلۡيَوۡمَ لَا يُخۡرَجُونَ مِنۡهَا وَلَا هُمۡ يُسۡتَعۡتَبُونَ","category":["45 (Al-Jathiyah)","Al-Jathiyah","Surah Al-Jathiyah","Chapter Al-Jathiyah","Jathiyah","Surah Jathiyah","Chapter Jathiyah","Al Jathiyah","Surah Al Jathiyah","Chapter Al Jathiyah","Surah 45","Chapter 45","The Crouching","الجاثية"],"ayahNumber":4508,"juzNumber":25,"footnotes":"(V.45:35)\na) Narrated Anas bin Mâlik رضي الله عنه: Allâh’s Messenger صلى الله عليه وسلم said, \"When carried to his grave, a dead person is followed by three, two of which return (after his burial) and one remains with him: his relatives, his property and his deeds follow him; relatives and his property return back while his deeds remain with him.\" (Sahih Al-Bukhari, Vol.8, Hadith No.521\nb) Narrated Anas رضي الله عنهما: The Prophet صلى الله عليه وسلم said, \"The people will be thrown into Hell (Fire) and it will keep on saying, ‘Is there any more,\" till the Lord of the ‘Âlamîn (mankind, jinn and all that exists) puts His Foot over it, whereupon its different sides will come close to each other, and it will say, ‘Qat ! Qat ! (enough! enough!) By Your ‘Izzat (Honour and Power) and Your Karam (Generosity)!’ Paradise will remain spacious enough to accommodate more people until Allâh will create some more people and let them dwell in the superfluous (empty) space of Paradise.\" (Sahih Al-Bukhari, Vol.9, Hadith No.481).\nc) Narrated Ibn ‘Abbâs رضي الله عنه: The Prophet صلى الله عليه وسلم used to say, \"I seek refuge (with You) By Your ‘Izzat (Honour and Power) Lâ ilâha illâ Anta (none has the right to be worshipped but You); Who does not die, while the jinn and the human beings die.\" (Sahih Al-Bukhari, Vol.9, Hadith No.480).","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"dhālikum bi-annakumu ittakhadhtum āyāti al-lahi huzuwan wagharratkumu al-ḥayatu al-dun'yā fal-yawma lā yukh'rajūna min'hā walā hum yus'taʿtabūna ","translations":["That","(is) because you","took","(the) Verses","(of) Allah","(in) ridicule","and deceived you","the life","(of) the world","So this Day","not","they will be brought forth","from it","and not","they","will be asked to appease","(35)"],"transliterationArr":["dhālikum","bi-annakumu","ittakhadhtum","āyāti","al-lahi","huzuwan","wagharratkumu","al-ḥayatu","al-dun'yā","fal-yawma","lā","yukh'rajūna","min'hā","walā","hum","yus'taʿtabūna",null],"verseTiming":[[1,0,1920],[2,1920,3930],[3,3930,5130],[4,5130,6190],[5,6190,7010],[6,7010,8550],[7,8550,9860],[8,9860,11020],[9,11020,12230],[10,12230,13780],[11,13780,14420],[12,14420,15540],[13,15540,16560],[14,16560,17110],[15,17110,17500],[16,17500,21465]]}}