{"name":"4:145","price":" 145. Verily, the hypocrites will be in the lowest depth (grade) of the Fire; no helper will you find for them.[2]","arabic":"إِنَّ ٱلۡمُنَٰفِقِينَ فِي ٱلدَّرۡكِ ٱلۡأَسۡفَلِ مِنَ ٱلنَّارِ وَلَن تَجِدَ لَهُمۡ نَصِيرًا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":638,"juzNumber":5,"footnotes":"(V.4:145):\na) Narrated ‘Abdullâh bin ‘Amr رضي الله عنهما: The Prophet صلى الله عليه وسلم said: \"Whoever has the following four (characteristics) will be a pure hypocrite and whoever has one of the following four characteristics will have one characteristic of hypocrisy unless and until he gives it up:\n1. Whenever he is entrusted, he betrays (proves dishonest).\n2. Whenever he speaks, he tells a lie.\n3. Whenever he makes a covenant, he proves treacherous.\n4. Whenever he quarrels, he behaves in a very imprudent, evil and insulting manner.\" (Sahih Al-Bukhâri, Vol.1, Hadîth No.33).\nb) See the footnote of (V.9:54).\nc) Narrated Abu Hurairah رضي الله عنه: The Prophet صلى الله عليه وسلم said, \"The worst people before Allâh on the Day of Resurrection will be the double-faced people who appear to some people with one face and to other people with another face.\" (Sahih Al-Bukhâri, Vol.8, Hadith No.84).","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"inna al-munāfiqīna fī al-darki al-asfali mina al-nāri walan tajida lahum naṣīran ","translations":["Indeed","the hypocrites","(will be) in","the depths","the lowest","of","the Fire","and never","you will find","for them","any helper","(145)"],"transliterationArr":["inna","al-munāfiqīna","fī","al-darki","al-asfali","mina","al-nāri","walan","tajida","lahum","naṣīran",null],"verseTiming":[[1,0,1410],[2,1410,3150],[3,3150,3410],[4,3410,4240],[5,4240,5320],[6,5320,5760],[7,5760,7060],[8,7060,8300],[9,8300,9030],[10,9030,9700],[11,9700,11235]]}}