{"name":"4:171","price":" 171. O people of the Scripture (Christians)! Do not exceed the limits in your religion, nor say of Allâh aught but the truth. The Messiah ‘Îsâ (Jesus), son of Maryam (Mary), was (no more than) a Messenger of Allâh and His Word, (\"Be!\" - and he was) which He bestowed on Maryam (Mary) and a spirit (Rûh )[1] created by Him; so believe in Allâh and His Messengers. Say not: \"Three (trinity)!\" Cease! (it is) better for you. For Allâh is (the only) One Ilâh (God), glory be to Him (Far Exalted is He) above having a son. To Him belongs all that is in the heavens and all that is in the earth. And Allâh is All-Sufficient as a Disposer of affairs.[2]","arabic":"يَٰٓأَهۡلَ ٱلۡكِتَٰبِ لَا تَغۡلُواْ فِي دِينِكُمۡ وَلَا تَقُولُواْ عَلَى ٱللَّهِ إِلَّا ٱلۡحَقَّۚ إِنَّمَا ٱلۡمَسِيحُ عِيسَى ٱبۡنُ مَرۡيَمَ رَسُولُ ٱللَّهِ وَكَلِمَتُهُۥٓ أَلۡقَىٰهَآ إِلَىٰ مَرۡيَمَ وَرُوحٞ مِّنۡهُۖ فَـَٔامِنُواْ بِٱللَّهِ وَرُسُلِهِۦۖ وَلَا تَقُولُواْ ثَلَٰثَةٌۚ ٱنتَهُواْ خَيۡرٗا لَّكُمۡۚ إِنَّمَا ٱللَّهُ إِلَٰهٞ وَٰحِدٞۖ سُبۡحَٰنَهُۥٓ أَن يَكُونَ لَهُۥ وَلَدٞۘ لَّهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ وَكَفَىٰ بِٱللَّهِ وَكِيلٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":664,"juzNumber":6,"footnotes":"[1] (V.4:171) Rûh-ullâh: According to the early religious scholars from among the Companions of the Prophet صلى الله عليه وسلم and their students and the Mujtahidûn , there is a rule to distinguish between the two nouns in the genitive construction:\na) When one of the two nouns is Allâh, and the other is a person or a thing, e.g. Allâh’s House (Bait-ullâh); Allâh’s Messenger (Rasul-ullâh): Allâh’s slave (‘Abdullâh): Allâh’s spirit (Rûh-ullâh), the rule for the above words is that the second noun, e.g., house, messenger, slave, spirit is created by Allâh and is honourable in His Sight, and similarly, Allâh’s spirit may be understood as the spirit of Allâh, in fact it is a soul created by Allâh, i.e. ‘Îsâ (Jesus). And it was His Word: \"Be!\" -and he was.[i.e. ‘Îsâ (Jesus) was created like Adam].\nb) But when one of the two is Allâh and the second is neither a person nor a thing, then it is not a created thing but is a quality of Allâh e.g. Allâh’s Knowledge (‘Ilm-ullâh); Allâh’s Life (Hayât-ullâh); Allâh’s Statement (Kalâm-ullâh); Allâh’s Self (Dhat-ullâh).\n[2] (V.4:171) Narrated ‘Ubadah رضي الله عنه : The Prophet صلى الله عليه وسلم said, \"If anyone testifies that lâ ilâha illallâh (none has the right to be worshipped but Allâh Alone) Who has no partners, and that Muhammad صلى الله عليه وسلم is His slave and His Messenger, and that Jesus عليه السلام is Allâh’s slave and His Messenger and His Word (\"Be!\" - and he was) which He bestowed on Mary and a spirit (Rûh) created by Him, and that Paradise is the truth, and Hell is the truth - Allâh will admit him into Paradise with the deeds which he had done even if those deeds were few.\" (Junadah, the subnarrator said; \"Ubâdah added: ‘Such a person can enter Paradise through any of its eight gates he likes.’ \") (Sahih Al Bukhârî, Vol. 4, Hadîth No. 644).","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"yāahla al-kitābi lā taghlū fī dīnikum walā taqūlū ʿalā al-lahi illā al-ḥaqa innamā al-masīḥu ʿīsā ub'nu maryama rasūlu al-lahi wakalimatuhu alqāhā ilā maryama warūḥun min'hu faāminū bil-lahi warusulihi walā taqūlū thalāthatun intahū khayran lakum innamā al-lahu ilāhun wāḥidun sub'ḥānahu an yakūna lahu waladun lahu mā fī al-samāwāti wamā fī al-arḍi wakafā bil-lahi wakīlan ","translations":["O People","(of) the Book","(Do) not","commit excess","in","your religion","and (do) not","say","about","Allah","except","the truth","Only","the Messiah","Isa","son","(of) Maryam","(was) a Messenger","(of) Allah","and His word","which He conveyed","to","Maryam","and a spirit","from Him","So believe","in Allah","and His Messengers","And (do) not","say","Three","desist","(it is) better","for you","Only","Allah","(is) God","One","Glory be to Him","That","He (should) have","for Him","a son","To Him (belongs)","whatever","(is) in","the heavens","and whatever","(is) in","the earth","And is sufficient","Allah","(as) a Disposer of affairs","(171)"],"transliterationArr":["yāahla","al-kitābi","lā","taghlū","fī","dīnikum","walā","taqūlū","ʿalā","al-lahi","illā","al-ḥaqa","innamā","al-masīḥu","ʿīsā","ub'nu","maryama","rasūlu","al-lahi","wakalimatuhu","alqāhā","ilā","maryama","warūḥun","min'hu","faāminū","bil-lahi","warusulihi","walā","taqūlū","thalāthatun","intahū","khayran","lakum","innamā","al-lahu","ilāhun","wāḥidun","sub'ḥānahu","an","yakūna","lahu","waladun","lahu","mā","fī","al-samāwāti","wamā","fī","al-arḍi","wakafā","bil-lahi","wakīlan",null],"verseTiming":[[1,0,2380],[2,2380,3440],[3,3440,3800],[4,3800,4580],[5,4580,5060],[6,5060,6110],[7,6110,6680],[8,6680,7710],[9,7710,8060],[10,8060,8940],[11,8940,9480],[12,9480,10700],[13,10700,12030],[14,12030,13110],[15,13110,13630],[16,13630,14120],[17,14120,14890],[18,14890,15700],[19,15700,16570],[20,16570,18850],[21,18850,19750],[22,19750,21350],[23,21350,21950],[24,21950,22730],[25,22730,23600],[26,23600,24640],[27,24640,26370],[28,26370,27490],[29,27490,28780],[30,28780,29390],[31,29390,30430],[32,30430,31950],[33,31950,33240],[34,33240,34180],[35,34180,35420],[36,35420,36560],[37,36560,37490],[38,37490,39320],[39,39320,40090],[40,40090,42960],[41,42960,43240],[42,43240,44060],[43,44060,44860],[44,44860,45470],[45,45470,45970],[46,45970,46910],[47,46910,47310],[48,47310,47510],[49,47510,48980],[50,48980,49560],[51,49560,49770],[52,49770,50830],[53,50830,51620],[54,51620,52640],[55,52640,54065]]}}