{"name":"4:29","price":" 29. O you who believe! Eat not up your property among yourselves unjustly except it be a trade amongst you, by mutual consent. And do not kill yourselves (nor kill one another). Surely, Allâh is Most Merciful to you.[1]","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَأۡكُلُوٓاْ أَمۡوَٰلَكُم بَيۡنَكُم بِٱلۡبَٰطِلِ إِلَّآ أَن تَكُونَ تِجَٰرَةً عَن تَرَاضٖ مِّنكُمۡۚ وَلَا تَقۡتُلُوٓاْ أَنفُسَكُمۡۚ إِنَّ ٱللَّهَ كَانَ بِكُمۡ رَحِيمٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":522,"juzNumber":5,"footnotes":" (V.4:29) What is said about committing suicide.\nNarrated Thâbit bin Ad-Dahhak رضي الله عنه: The Prophet صلى الله عليه وسلم said, \"Whoever intentionally swears falsely by a religion other than Islâm, then he is what he had said, (e.g. if he says, ‘If such thing is not true then I am a Jew, ‘he is really a Jew if he is a liar). And whoever commits suicide with a piece of iron, will be punished with the same piece of iron in the Hell-fire.\"\nNarrated Jundub: The Prophetصلى الله عليه وسلم said, \"A man was inflicted with wounds and he committed suicide, and so Allâh said: My slave has caused death on himself hurriedly, so I forbid Paradise for him.\" (Sahih Al-Bukhâri, Vol. 2, Hadîth No.445).\nNarrated Abu Hurairah رضي الله عنه: The Prophetصلى الله عليه وسلم said, \"He who commits suicide by throttling shall keep on throttling himself in the Hell-fire, and he who commits suicide by stabbing himself shall keep on stabbing himself in the Hell-fire.\" (Sahih Al-Bukhâri, Vol.2, Hadîth No.446).","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"yāayyuhā alladhīna āmanū lā takulū amwālakum baynakum bil-bāṭili illā an takūna tijāratan ʿan tarāḍin minkum walā taqtulū anfusakum inna al-laha kāna bikum raḥīman ","translations":["O you","who","believe[d]","(Do) not","eat","your wealth","between yourselves","unjustly","But","that","(there) be","business","on","mutual consent","among you","And (do) not","kill","yourselves","Indeed","Allah","is","to you","Most Merciful","(29)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","lā","takulū","amwālakum","baynakum","bil-bāṭili","illā","an","takūna","tijāratan","ʿan","tarāḍin","minkum","walā","taqtulū","anfusakum","inna","al-laha","kāna","bikum","raḥīman",null],"verseTiming":[[1,0,2720],[2,2720,3640],[3,3640,4540],[4,4540,4860],[5,4860,6840],[6,6840,8900],[7,8900,10210],[8,10210,11530],[9,11530,12360],[10,12360,14710],[11,14710,15460],[12,15460,16200],[13,16200,17360],[14,17360,18170],[15,18170,19010],[16,19010,21160],[17,21160,21670],[18,21670,23690],[19,23690,26250],[20,26250,27640],[21,27640,28430],[22,28430,29060],[23,29060,29630],[24,29630,31085]]}}