{"name":"4:40","price":" 40. Surely! Allâh wrongs not even of the weight of an atom (or a small ant),[1] but if there is any good (done), He doubles it, and gives from Him a great reward.","arabic":"إِنَّ ٱللَّهَ لَا يَظۡلِمُ مِثۡقَالَ ذَرَّةٖۖ وَإِن تَكُ حَسَنَةٗ يُضَٰعِفۡهَا وَيُؤۡتِ مِن لَّدُنۡهُ أَجۡرًا عَظِيمٗا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":533,"juzNumber":5,"footnotes":" (V. 4:40)\na) Narrated Abu Sa‘îd Al-Khudrî رضي الله عنه: During the lifetime of the Prophet صلى الله عليه وسلم some people said, \"O Allâh’s Messenger! Shall we see our Lord on the Day of Resurrection?\" The Prophet صلى الله عليه وسلم said: \"Yes; do you have any difficulty in seeing the sun at midday when it is bright and there is no cloud in the sky?\" They replied, \"No.\" He said, \"Do you have any difficulty in seeing the moon on a fullmoon night when it is bright and there is no cloud in the sky?\" They replied, \"No.\" The Prophet صلى الله عليه وسلم said, \"(Similarly) you will have no difficulty in seeing Allâh (عز وجل) on the Day of Resurrection, as you have no difficulty in seeing either of them.\" On the Day of Resurrection, a call-maker will announce, \"Let every nation follow that which they used to worship.\" Then none of those who used to worship anything other than Allâh like idols and other deities, but will fall in Hell (Fire), till there will remain none but those who used to worship Allâh, both those who were obedient (i.e. good) and those who were disobedient (i.e. bad) and the remaining party of the people of the Scripture. Then the Jews will be called upon and it will be said to them, \"Who did you use to worship?\" They will say, \"We used to worship ‘Uzair (Ezra), the son of Allâh.\" It will be said to them, \"You are liars, for Allâh has never taken anyone as a wife or a son. What do you want now?\" They will say, \"O our Lord! We are thirsty, so give us something to drink.\" They will be directed and addressed thus, \"Will you drink\" whereupon they will be gathered unto Hell (Fire) which will look like a mirage whose different sides will be destroying each other. Then they will fall into the Fire. Afterwards the Christians will be called upon and it will be said to them, \"Who did you use to worship?\" They will say, \"We used to worship ‘Îsâ (Jesus), the son of Allâh.\" It will be said to them, \"You are liars, for Allâh has never taken anyone as a wife or a son.\" Then it will be said to them, \"What do you want now?\" They will say what the former people have said (and will be thrown in the Hell-fire like the Jews). Then, when there remain (in the gathering) none but those who used to worship Allâh [Alone; the real Lord of the ‘Âlamîn (mankind, jinn and all that exists)], whether they were obedient or disobedient. Then Allâh, (the Lord of the ‘Âlamîn (mankind, jinn and all that exists)], will come to them in a shape nearest to the picture they had in their minds about Him. It will be said, \"What are you waiting for? Every nation has followed what it used to worship.\" They will reply, \"We left the people in the world when we were in great need of them and we did not take them as friends. Now we are waiting for our Lord Whom we used to worship.\" Allâh will say, \"I am your Lord.\" They will say twice or thrice, \"We do not worship anything besides Allâh.\" (Sahih Al-Bukhâri, Vol.6, Hadîth No. 105).\nSee the footnote of (V.68:42)","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"inna al-laha lā yaẓlimu mith'qāla dharratin wa-in taku ḥasanatan yuḍāʿif'hā wayu'ti min ladun'hu ajran ʿaẓīman ","translations":["Indeed","Allah","(does) not","wrong","(as much as) weight","(of) an atom","And if","there is","a good","He doubles it","and gives","from","near Him","a reward","great","(40)"],"transliterationArr":["inna","al-laha","lā","yaẓlimu","mith'qāla","dharratin","wa-in","taku","ḥasanatan","yuḍāʿif'hā","wayu'ti","min","ladun'hu","ajran","ʿaẓīman",null],"verseTiming":[[1,0,1120],[2,1120,2000],[3,2000,2430],[4,2430,3330],[5,3330,4390],[6,4390,5460],[7,5460,6520],[8,6520,7080],[9,7080,7920],[10,7920,9830],[11,9830,10690],[12,10690,10960],[13,10960,11920],[14,11920,12640],[15,12640,14105]]}}