{"name":"4:86","price":" 86. When you are greeted with a greeting, greet in return with what is better than it, or (at least) return it equally. Certainly, Allâh is Ever a Careful Account Taker of all things.[2]","arabic":"وَإِذَا حُيِّيتُم بِتَحِيَّةٖ فَحَيُّواْ بِأَحۡسَنَ مِنۡهَآ أَوۡ رُدُّوهَآۗ إِنَّ ٱللَّهَ كَانَ عَلَىٰ كُلِّ شَيۡءٍ حَسِيبًا","category":["4 (An-Nisa)","An-Nisa","Surah An-Nisa","Chapter An-Nisa","Nisa","Surah Nisa","Chapter Nisa","An Nisa","Surah An Nisa","Chapter An Nisa","Surah 4","Chapter 4","The Women","النِّسَاء"],"ayahNumber":579,"juzNumber":5,"footnotes":"(V.4:86) How the Salâm (greeting) began.\nNarrated Abu Hurairah رضي الله عنه : The Prophet صلى الله عليه وسلم said, \"Allâh created Adam in His Image,* sixty cubits (about 30 metres) in height. When He created him, He said (to him), \"Go and greet that group of angels sitting there, and listen what they will say in reply to you, for that will be your greeting and the greeting of your offspring.\" Adam (went and) said, \"As-Salâmu ‘Alaikum (peace be upon you).\" They replied, \"As-Salâmu ‘Alaikum wa Rahmatullah (Peace and Allâh’s Mercy be on you).\" So they increased ‘wa Rahmatullah ’ \" The Prophet صلى الله عليه وسلم added, \"So, whoever will enter Paradise, will be of the shape and picture of Adam. Since then the creation of Adam’s (offspring) (i.e. stature of human beings) is being diminished continuously up to the present time.\" (Sahih Al-Bukhâri, Vol.8, Hadîth No.246).\n*\"His Image\" means that Adam has been bestowed with life, knowledge, power of hearing, seeing, understanding, but the features of Adam are different from those of Allâh, only the names are the same, e.g., Allâh has life and knowledge and power of understanding, and Adam also has them, but there is no comparison between the Creator and the created thing. As Allâh says in the Qur’ân: \"There is nothing like Him, and He is the All-Hearer, the All-Seer.\" (V.42:11), Allâh does not eat or sleep, while Adam used to eat and sleep [for details See Fath Al-Bâri, Vol.6, Page 108,9 and Vol.13, Page 238,9].","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"wa-idhā ḥuyyītum bitaḥiyyatin faḥayyū bi-aḥsana min'hā aw ruddūhā inna al-laha kāna ʿalā kulli shayin ḥasīban ","translations":["And when","you are greeted","with a greeting","then greet","with better","than it","or","return it","Indeed","Allah","is","of","every","thing","an Accountant","(86)"],"transliterationArr":["wa-idhā","ḥuyyītum","bitaḥiyyatin","faḥayyū","bi-aḥsana","min'hā","aw","ruddūhā","inna","al-laha","kāna","ʿalā","kulli","shayin","ḥasīban",null],"verseTiming":[[1,0,890],[2,890,2660],[3,2660,4080],[4,4080,5500],[5,5500,6600],[6,6600,8660],[7,8660,9080],[8,9080,10430],[9,10430,12080],[10,12080,12940],[11,12940,13610],[12,13610,14210],[13,14210,14830],[14,14830,15710],[15,15710,17185]]}}