{"name":"51:30","price":" 30. They said: \"Even so says your Lord.[4] Verily, He is the All-Wise, the All-Knower.\"","arabic":"قَالُواْ كَذَٰلِكِ قَالَ رَبُّكِۖ إِنَّهُۥ هُوَ ٱلۡحَكِيمُ ٱلۡعَلِيمُ","category":["51 (Adh-Dhariyat)","Adh-Dhariyat","Surah Adh-Dhariyat","Chapter Adh-Dhariyat","Dhariyat","Surah Dhariyat","Chapter Dhariyat","Adh Dhariyat","Surah Adh Dhariyat","Chapter Adh Dhariyat","Surah 51","Chapter 51","The Winnowing Winds","الذَّاريَات"],"ayahNumber":4705,"juzNumber":26,"footnotes":"(V.51:30)\na) The Statement of Allâh عز وجل:\n‘Verily, Our Word (Command) unto a thing, when We intend it, is only that We say unto it:\n\"Be!\" - and it is.’ (V.16:40)\nNarrated Mu‘âwiyah رضي الله عنه: I heard the Prophet صلى الله عليه وسلم saying, \"A group of my followers will keep on following Allâh’s Orders [i.e., following strictly Allâh’s Book (the Qur’ân) and the Prophet’s Sunnah (legal ways)] strictly and they will not be harmed by those who will belie (disbelieve) them or desert (stand against) them till Allâh’s Order (the Hour) will come while they will be in that state.\" (Sahih Al-Bukhari, Vol.9, Hadith No.552).\nb) Narrated Abu Hurairah رضي الله عنه: Allâh’s Messenger صلى الله عليه وسلم said, \"Allâh said, ‘I have prepared for My pious slaves things which have never been seen by an eye, nor heard by an ear, or (even) imagined by a human being.’\" (Sahih Al-Bukhari, Vol. 4, Hadith No. 467)\nc) Narrated Abû Sa‘îd Al-Khudrî رضي الله عنه: The Prophet صلى الله عليه وسلم said, \"The people of Paradise will look at the dwellers of Al-Ghuraf (the lofty mansions i.e. a superior place in Paradise) in the same way as one looks at a brilliant star far away in the east or in the west on the horizon; all that is because of their superiority over one another (in rewards).\" On that the people said, \"O Allâh’s Messenger! Are these residences (lofty mansions) for the Prophets which nobody else can reach?\" The Prophet صلى الله عليه وسلم replied, \"No! By Him (Allah) in Whose Hand my soul is, these are for the men who believed in Allah and also believed in the Messengers.\" (Sahih Al-Bukhari, Vol. 4, Hadith No. 478)\nd) Narrated Abu Hurairah رضي الله عنه: Allâh’s Messenger صلى الله عليه وسلم said, \"The first batch (of people) who will enter Paradise will be (glittering) like the moon on a full-moon night and those who will enter next will be glittering like the brightest star. Their hearts will be as if the heart of a single man for they will have neither difference nor any enmity amongst themselves, and everyone of them shall have two wives, each of whom will be so beautiful, pure and transparent that the marrow of the bones of their legs will be seen through the flesh. They will be glorifying Allâh in the morning and afternoon, and will never fall ill, and they will neither blow their noses nor spit. Their utensils will be of gold and silver, and their combs will be of gold and the fuel used in their censers will be of aloes-wood and their sweat will smell like musk.\" ... (Sahih Al-Bukhari, Vol. 4, Hadith No. 469).","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"qālū kadhāliki qāla rabbuki innahu huwa al-ḥakīmu al-ʿalīmu ","translations":["They said","Thus","said","your Lord","Indeed, He","[He]","(is) the All-Wise","the All-Knower","(30)"],"transliterationArr":["qālū","kadhāliki","qāla","rabbuki","innahu","huwa","al-ḥakīmu","al-ʿalīmu",null],"verseTiming":[[1,0,920],[2,920,2140],[3,2140,2940],[4,2940,3790],[5,3790,5820],[6,5820,6160],[7,6160,7320],[8,7320,10375]]}}