{"name":"59:7","price":" 7. What Allâh gave as booty (Fai’) to His Messenger (Muhammad صلى الله عليه وسلم) from the people of the townships - it is for Allâh, His Messenger (Muhammad صلى الله عليه وسلم), the kindred (of Messenger Muhammad صلى الله عليه وسلم), the orphans, Al-Masâkin (the poor), and the wayfarer, in order that it may not become a fortune used by the rich among you. And whatsoever the Messenger (Muhammad صلى الله عليه وسلم) gives you, take it; and whatsoever he forbids you, abstain (from it).[1] And fear Allâh; verily, Allâh is Severe in punishment.","arabic":"مَّآ أَفَآءَ ٱللَّهُ عَلَىٰ رَسُولِهِۦ مِنۡ أَهۡلِ ٱلۡقُرَىٰ فَلِلَّهِ وَلِلرَّسُولِ وَلِذِي ٱلۡقُرۡبَىٰ وَٱلۡيَتَٰمَىٰ وَٱلۡمَسَٰكِينِ وَٱبۡنِ ٱلسَّبِيلِ كَيۡ لَا يَكُونَ دُولَةَۢ بَيۡنَ ٱلۡأَغۡنِيَآءِ مِنكُمۡۚ وَمَآ ءَاتَىٰكُمُ ٱلرَّسُولُ فَخُذُوهُ وَمَا نَهَىٰكُمۡ عَنۡهُ فَٱنتَهُواْۚ وَٱتَّقُواْ ٱللَّهَۖ إِنَّ ٱللَّهَ شَدِيدُ ٱلۡعِقَابِ","category":["59 (Al-Hashr)","Al-Hashr","Surah Al-Hashr","Chapter Al-Hashr","Hashr","Surah Hashr","Chapter Hashr","Al Hashr","Surah Al Hashr","Chapter Al Hashr","Surah 59","Chapter 59","The Exile","الحشر"],"ayahNumber":5133,"juzNumber":28,"footnotes":"(V.59:7) Narrated ‘Alqamah: ‘Abdullâh (bin Mas‘ûd) said. \"Allâh curses those ladies who practise tatooing and those who get themselves tatooed, and those ladies who get their hair removed from their eyebrows and faces except the beard and moustache, and those who make artificial spaces between their teeth in order to look more beautiful whereby they change Allâh’s creation.\" His saying reached a lady from Banû Asad, called Umm Ya‘qûb, who came (to ‘Abdullâh) and said, \"I have come to know that you have cursed such-and-such (ladies)?\" He replied, \"Why should I not curse these whom Allâh’s Messenger صلى الله عليه وسلم has cursed and who are (cursed) in Allâh’s Book!\" Umm Ya‘qûb said, \"I have read the whole Qur’ân, but I did not find in it what you say.\" He said, \"Verily, if you have read it (i.e. the Qur’ân), you have found it. Didn’t you read:\n\"And whatsoever the Messenger (Muhammad صلى الله عليه وسلم) gives you, take it, and whatsoever he forbids you, abstain (from it).\" (V.59:7).\nShe replied, \"Yes, I did\", He said, \"Verily, Allâh’s Messenger صلى الله عليه وسلم forbade such things.\" She said, \"But I see your wife doing these things?\" He said, \"Go and watch her\". She went and watched her but could not see anything in support of her statement. On that he said, \"If my wife was as you thought, I would not keep her in my company\" (i.e. I would divorce her). (Sahih Al-Bukhari, Vol.6, Hadîth No.408).\nNarrated ‘Abdullâh (bin Mas‘ûd) رضي الله عنه: Allâh’s Messenger صلى الله عليه وسلم has cursed the lady who uses false hair. (See Sahih Al-Bukhari, Vol.6, Hadîth No.409).","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"mā afāa al-lahu ʿalā rasūlihi min ahli al-qurā falillahi walilrrasūli walidhī al-qur'bā wal-yatāmā wal-masākīni wa-ib'ni al-sabīli kay lā yakūna dūlatan bayna al-aghniyāi minkum wamā ātākumu al-rasūlu fakhudhūhu wamā nahākum ʿanhu fa-intahū wa-ittaqū al-laha inna al-laha shadīdu al-ʿiqābi ","translations":["What","(was) restored","(by) Allah","to","His Messenger","from","(the) people","(of) the towns","(it is) for Allah","and His Messenger","and for those","(of) the kindred","and the orphans","and the needy","and","the wayfarer","that","not","it becomes","a (perpetual) circulation","between","the rich","among you","And whatever","gives you","the Messenger","take it","and whatever","he forbids you","from it","refrain","And fear","Allah","Indeed","Allah","(is) severe","(in) penalty","(7)"],"transliterationArr":["mā","afāa","al-lahu","ʿalā","rasūlihi","min","ahli","al-qurā","falillahi","walilrrasūli","walidhī","al-qur'bā","wal-yatāmā","wal-masākīni","wa-ib'ni","al-sabīli","kay","lā","yakūna","dūlatan","bayna","al-aghniyāi","minkum","wamā","ātākumu","al-rasūlu","fakhudhūhu","wamā","nahākum","ʿanhu","fa-intahū","wa-ittaqū","al-laha","inna","al-laha","shadīdu","al-ʿiqābi",null],"verseTiming":[[1,0,2010],[2,2010,2470],[3,2470,3110],[4,3110,4390],[5,4390,5280],[6,5280,5880],[7,5880,7090],[8,7090,7500],[9,7500,8070],[10,8070,8840],[11,8840,10030],[12,10030,13010],[13,13010,14810],[14,14810,16170],[15,16170,16730],[16,16730,17670],[17,17670,19060],[18,19060,20640],[19,20640,21220],[20,21220,22220],[21,22220,22360],[22,22360,22970],[23,22970,23740],[24,23740,25090],[25,25090,25220],[26,25220,25820],[27,25820,26540],[28,26540,27540],[29,27540,28310],[30,28310,28780],[31,28780,31820],[32,31820,33870],[33,33870,36020],[34,36020,37230],[35,37230,38180],[36,38180,39240],[37,39240,39760],[38,39760,40700],[39,40700,41330],[40,41330,43210],[41,43210,44390],[42,44390,47290],[43,47290,48650],[44,48650,49500],[45,49500,50300],[46,50300,52865]]}}