{"name":"5:58","price":" 58. And when you proclaim the call for As-Salât [call for the prayer (Adhân)], they take it (but) as a mockery and fun; that is because they are a people who understand not.[1]","arabic":"وَإِذَا نَادَيۡتُمۡ إِلَى ٱلصَّلَوٰةِ ٱتَّخَذُوهَا هُزُوٗا وَلَعِبٗاۚ ذَٰلِكَ بِأَنَّهُمۡ قَوۡمٞ لَّا يَعۡقِلُونَ","category":["5 (Al-Ma'idah)","Al-Ma'idah","Surah Al-Ma'idah","Chapter Al-Ma'idah","Ma'idah","Surah Ma'idah","Chapter Ma'idah","Al Ma'idah","Surah Al Ma'idah","Chapter Al Ma'idah","Surah 5","Chapter 5","The Table Spread","المَائدة"],"ayahNumber":727,"juzNumber":6,"footnotes":"(V.5:58) How the Adhân (the call to prayer)* for the prayer was started. And the Statement of Allâh عز وجل:\n\"And when you proclaim the call to prayer (Adhân ) they take it (but) as a mockery and fun; that is because they are a people who understand not.\" (V.5:58).\nAnd also the Statement of Allâh عز وجل: \"When the call (Adhân ) for the prayer is proclaimed on the day of Friday.\" (V.62:9).\nNarrated Anas رضي الله عنه: The people mentioned the fire and the bell (they suggested those as signals to indicate the starting of prayers), and by that they mentioned the Jews and the Christians, then Bilâl was ordered to pronounce Adhân for the prayer by saying its wordings twice (in doubles), and for the Iqâmah (the call for the actual standing for the prayers in rows) by saying its wordings once (in singles) (Iqâmah is pronounced when the people are ready for the prayer). (Sahih Al-Bukhâri, Vol.1, Hadîth No.577).\n* The wording of Adhân : Allâhu-Akbar, Allâhu-Akbar, Allâhu-Akbar, Aâhu-Akbar; Ash-hadu an lâ ilaha illallâh, Ash-hadu an lâ ilâha illallâh; Ash-hadu anna Muhammad-ar Rasûl-Ullâh, Ash-hadu anna Muhammad-ar-Rasûl-Ullâh; Hayya-‘alas-Salâh, Hayya ‘alas-Salâh; Hayya ‘alal-Falâh, Hayya ‘alal-Falâh; Allâhu-Akbar, Allâhu-Akbar; Lâ ilâha illallâh.","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"wa-idhā nādaytum ilā al-ṣalati ittakhadhūhā huzuwan walaʿiban dhālika bi-annahum qawmun lā yaʿqilūna ","translations":["And when","you make a call","for","the prayer","they take it","(in) ridicule","and fun","That","(is) because they","(are) a people","(who do) not","understand","(58)"],"transliterationArr":["wa-idhā","nādaytum","ilā","al-ṣalati","ittakhadhūhā","huzuwan","walaʿiban","dhālika","bi-annahum","qawmun","lā","yaʿqilūna",null],"verseTiming":[[1,0,1030],[2,1030,2350],[3,2350,2690],[4,2690,3810],[5,3810,5150],[6,5150,6760],[7,6760,7890],[8,7890,9340],[9,9340,11260],[10,11260,12000],[11,12000,12540],[12,12540,15405]]}}