{"name":"5:66","price":" 66. And if only they had acted according to the Taurât (Torah), the Injeel (Gospel), and what has (now) been sent down to them from their Lord (the Qur’ân), they would surely have gotten provision from above them and from underneath their feet. There are from among them people who are on the right course (i.e. they act on the revelation and believe in Prophet Muhammad صلى الله عليه وسلم as ‘Abdullâh bin Salâm[1] رضي الله عنه), but many of them do evil deeds.","arabic":"وَلَوۡ أَنَّهُمۡ أَقَامُواْ ٱلتَّوۡرَىٰةَ وَٱلۡإِنجِيلَ وَمَآ أُنزِلَ إِلَيۡهِم مِّن رَّبِّهِمۡ لَأَكَلُواْ مِن فَوۡقِهِمۡ وَمِن تَحۡتِ أَرۡجُلِهِمۚ مِّنۡهُمۡ أُمَّةٞ مُّقۡتَصِدَةٞۖ وَكَثِيرٞ مِّنۡهُمۡ سَآءَ مَا يَعۡمَلُونَ","category":["5 (Al-Ma'idah)","Al-Ma'idah","Surah Al-Ma'idah","Chapter Al-Ma'idah","Ma'idah","Surah Ma'idah","Chapter Ma'idah","Al Ma'idah","Surah Al Ma'idah","Chapter Al Ma'idah","Surah 5","Chapter 5","The Table Spread","المَائدة"],"ayahNumber":735,"juzNumber":6,"footnotes":"(V.5: 66) Narrated Anas رضي الله عنه: When the news of the arrival of the Prophet صلى الله عليه وسلم, at Al-Madinah reached ‘Abdullâh bin Salâm, he went to him (i.e. the Prophet صلى الله عليه وسلم) to ask him about certain things. He said, \"I am going to ask you about three things which only a Prophet can answer: What is the first sign of The Hour? What is the first food which the people of Paradise will eat? Why does a child attract the similarity to his father or to his mother?\" the Prophet صلى الله عليه وسلم replied, \"Jibrael (Gabriel) has just now informed me of that.\" Ibn Salâm said, \"He [i.e. Jibrael (Gabriel)] is the enemy of the Jews from amongst the angels.\" The Prophet صلى الله عليه وسلم said, \"As for the first sign of The Hour, it will be a fire that will collect (or gather) the people from the east to the west. As for the first meal which the people of Paradise will eat, it will be the caudate (extra) lobe of the fish-liver. As for the child, if the man’s discharge precedes the woman’s discharge, the child attracts the similarity to the man, and if the woman’s discharge precedes the man’s, then the child attracts the similarity to the woman.\" On this, ‘Abdullâh bin Salâm said, \"I testify that Lâ ilâha illallâh (none has the right to be worshipped but Allâh) and that you are the Messenger of Allâh\", and added, \"O Allâh’s Messenger! Jews make such lies as make one astonished, so please ask them about me before they know about my conversion to Islâm.\"\nThe Jews came and the Prophet صلى الله عليه وسلم said, \"What kind of man is ‘Abdullâh bin Salâm among you?\" They replied, \"The best of us and the son of the best of us and the most superior among us, and the son of the most superior among us.\" The Prophet صلى الله عليه وسلم said, \"What would you think if ‘Abdullâh bin Salâm should embrace Islâm?\" They said, \"May Allâh protect him from that.\" The Prophet صلى الله عليه وسلم repeated his question and they gave the same answer, then ‘Abdullâh came out to them and said. \"I testify that Lâ ilâha illallâh (none has the right to be worshipped but Allâh), and that Muhammad صلى الله عليه وسلم is the Messenger of Allâh!\" On this, the Jews said, \"He is the most wicked among us and the son of the most wicked among us.\" So they degraded him. On this, he (i.e. ‘Abdullâh bin Salâm) said, \"It is this that I was afraid of, O Allâh’s Messenger.\" (Sahih Al-Bukhârî, Vol.5, Hadîth No.275).","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"walaw annahum aqāmū al-tawrāta wal-injīla wamā unzila ilayhim min rabbihim la-akalū min fawqihim wamin taḥti arjulihim min'hum ummatun muq'taṣidatun wakathīrun min'hum sāa mā yaʿmalūna ","translations":["And if","that they","had stood firmly","(by) the Taurat","and the Injeel","and what","was revealed","to them","from","their Lord","surely they (would have) eaten","from","above them","and from","beneath","their feet","Among them","(is) a community","moderate","but many","of them ","evil","(is) what","they do","(66)"],"transliterationArr":["walaw","annahum","aqāmū","al-tawrāta","wal-injīla","wamā","unzila","ilayhim","min","rabbihim","la-akalū","min","fawqihim","wamin","taḥti","arjulihim","min'hum","ummatun","muq'taṣidatun","wakathīrun","min'hum","sāa","mā","yaʿmalūna",null],"verseTiming":[[1,0,760],[2,760,2400],[3,2400,3250],[4,3250,4490],[5,4490,6690],[6,6690,8540],[7,8540,9990],[8,9990,11210],[9,11210,11670],[10,11670,12910],[11,12910,13940],[12,13940,14280],[13,14280,15910],[14,15910,17210],[15,17210,17880],[16,17880,19670],[17,19670,20410],[18,20410,22250],[19,22250,24770],[20,24770,26000],[21,26000,27470],[22,27470,30070],[23,30070,30130],[24,30130,33045]]}}