{"name":"5:78","price":" 78. Those among the Children of Israel[1] who disbelieved were cursed by the tongue of Dâwûd (David) and ‘Îsâ (Jesus), son of Maryam (Mary). That was because they disobeyed (Allâh and the Messengers) and were ever transgressing beyond bounds.","arabic":"لُعِنَ ٱلَّذِينَ كَفَرُواْ مِنۢ بَنِيٓ إِسۡرَٰٓءِيلَ عَلَىٰ لِسَانِ دَاوُۥدَ وَعِيسَى ٱبۡنِ مَرۡيَمَۚ ذَٰلِكَ بِمَا عَصَواْ وَّكَانُواْ يَعۡتَدُونَ","category":["5 (Al-Ma'idah)","Al-Ma'idah","Surah Al-Ma'idah","Chapter Al-Ma'idah","Ma'idah","Surah Ma'idah","Chapter Ma'idah","Al Ma'idah","Surah Al Ma'idah","Chapter Al Ma'idah","Surah 5","Chapter 5","The Table Spread","المَائدة"],"ayahNumber":747,"juzNumber":6,"footnotes":"(V.5:78). The tale of a leper, a bald man and a blind man:\nNarrated Abu Hurairah رضي الله عنه that he heard Allâh’s Messenger صلى الله عليه وسلم saying, \"Allâh willed to test three Isrâelis who were a leper, a blind man and a bald headed man. So, He sent them an angel who came to the leper and said, ‘What thing do you like most?’ He replied, ‘Good colour and good skin, for the people have a strong aversion to me.’ The angel touched him and his illness was cured, and he was given a good colour and beautiful skin. The angel asked him, ‘What kind of property do you like best?’ He replied, ‘Camels.’\nSo he (i.e., the leper) was given a pregnant she-camel, and the angel said (to him), ‘May Allâh bless you in it.’ The angel then went to the bald-headed man and said, ‘What thing do you like most?’ He said, ‘I like good hair and wish to be cured of this disease, for the people feel repulsion for me.’ The angel touched him and his illness was cured, and he was given good hair. The angel asked (him), ‘What kind of property do you like best?’ He replied ‘Cows.’ The angel gave him a pregnant cow and said, ‘May Allâh bless in it.’ The angel went to the blind man and asked, ‘What thing do you like best?’ He said, ‘(I like) that Allâh may restore my eyesight to me so that I may see the people.’ The angel touched his eyes and Allâh gave him back his eyesight. The angel asked him, ‘What kind of property do you like best?’ He replied, ‘Sheep.’ The angel gave him a pregnant sheep. Afterwards, all the three pregnant animals gave birth to young ones, and multiplied and brought forth so much that one of the (three) men had a herd of camels filling a valley, and one had a herd of cows filling a valley, and one had a flock of sheep filling a valley. Then the angel, disguised in the shape and appearance of a leper, went to the leper and said, ‘I am a poor man, who has lost all means of livelihood while on a journey. So none will satisfy my need except Allâh and then you. In the Name of Him Who has given you such nice colour and beautiful skin, and so much property, I ask you to give me a camel so that I may reach my destination.’ The man replied, ‘I have many obligations (so I cannot give you).’ The angel said, ‘I think I know you. Were you not a leper to whom the people had a strong aversion? Weren’t you a poor man, and then Allâh gave you (all this property).’ He replied, ‘(This is all wrong), I got this property through inheritance from my forefathers.’ The angel said, ‘If you are telling a lie then let Allâh make you as you were before.’ Then the angel, disguised in the shape and appearance of a bald man, went to the bald man and said to him the same as he told the first one, and he too answered the same as the first one did. The angel said, ‘If you are telling a lie, then let Allâh make you as you were before.’ The angel, disguised in the shape of a blind man, went to the blind man and said, ‘I am a poor man and a traveller, whose means of livelihood have been exhausted while on a journey. I have nobody to help me except Allâh, and after Him, you yourself. I ask you in the Name of Him Who has given you back your eyesight to give me a sheep, so that with its help, I may complete my journey.’ The man said, ‘No doubt, I was blind and Allâh gave me back my eyesight; I was poor and Allâh made me rich; so take anything you wish from my property. By Allâh, I will not stop you for taking anything (you need) of my property which you may take for Allâh’s sake.’ The angel replied, ‘Keep your property with you. You (i.e., three men) have been tested and Allâh is pleased with you and is angry with your two companions.’\" (Sahih Al Bukhâri, Vol.4, Hadîth No.670).","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"luʿina alladhīna kafarū min banī is'rāīla ʿalā lisāni dāwūda waʿīsā ib'ni maryama dhālika bimā ʿaṣaw wakānū yaʿtadūna ","translations":["Were cursed","those who","disbelieved","from","(the) Children","(of) Israel","by","(the) tongue","(of) Dawood","and Isa","son","(of) Maryam","that (was)","because","they disobeyed","and they were","transgressing","(78)"],"transliterationArr":["luʿina","alladhīna","kafarū","min","banī","is'rāīla","ʿalā","lisāni","dāwūda","waʿīsā","ib'ni","maryama","dhālika","bimā","ʿaṣaw","wakānū","yaʿtadūna",null],"verseTiming":[[1,0,620],[2,620,1800],[3,1800,2660],[4,2660,3400],[5,3400,4980],[6,4980,7660],[7,7660,8270],[8,8270,9220],[9,9220,10300],[10,10300,11080],[11,11080,11570],[12,11570,12360],[13,12360,13700],[14,13700,14300],[15,14300,15000],[16,15000,16090],[17,16090,19285]]}}