{"name":"5:90","price":" 90. O you who believe! Intoxicants (all kinds of alcoholic drinks), and gambling, and Al-Ansâb[1], and Al-Azlâm (arrows for seeking luck or decision) are an abomination of Shaitan’s (Satan) handiwork. So avoid (strictly all) that (abomination) in order that you may be successful.[2]","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِنَّمَا ٱلۡخَمۡرُ وَٱلۡمَيۡسِرُ وَٱلۡأَنصَابُ وَٱلۡأَزۡلَٰمُ رِجۡسٞ مِّنۡ عَمَلِ ٱلشَّيۡطَٰنِ فَٱجۡتَنِبُوهُ لَعَلَّكُمۡ تُفۡلِحُونَ","category":["5 (Al-Ma'idah)","Al-Ma'idah","Surah Al-Ma'idah","Chapter Al-Ma'idah","Ma'idah","Surah Ma'idah","Chapter Ma'idah","Al Ma'idah","Surah Al Ma'idah","Chapter Al Ma'idah","Surah 5","Chapter 5","The Table Spread","المَائدة"],"ayahNumber":759,"juzNumber":7,"footnotes":"[1] (V.5:90) Animals that are sacrificed (slaughtered) on An-Nusub * and for the idols. Narrated ‘Abdullâh رضي الله عنه Allâh’s Messenger صلى الله عليه وسلم said that he met Zaid bin ‘Amr bin Nufail at a place near Baldah and this had happened before Allâh’s Messenger صلى الله عليه وسلم received the Divine Revelation. Allâh’s Messenger صلى الله عليه وسلم presented a dish of meat (that had been offered to him by the pagans) to Zaid bin ‘Amr, but Zaid refused to eat of it and then said (to the pagans), \"I do not eat of what you have sacrificed (slaughtered) on your stone-altars (Ansâb ) nor do I eat except that on which Allâh’s Name has been mentioned on slaughtering.\" (Sahih Al-Bukhâri, Vol.7, Hadîth No.407). [See also the footnote of (V.2:135)].\n* An-Nusub were stone-altars at fixed places or graves, whereon sacrifices were slaughtered on certain occasions in the name of idols, jinn, angels, pious men, saints in order to honour them, or to expect some benefit from them.\n[2] (V.5:90) What is said regarding the one who regards an alcoholic drink lawful to drink, and calls it by another name.\nNarrated Abu ‘Aamir or Abu Mâlik Al-Ash‘ari that he heard the Prophetصلى الله عليه وسلم saying, \"From among my followers there will be some people who will consider illegal sexual intercourse, the wearing of silk, the drinking of alcoholic drinks, and the use of musical instruments as lawful. And (from them), there will be some who will stay near the side of a mountain, and in the evening their shepherd will come to them with their sheep and ask them for something, but they will say to him, ‘Return to us tomorrow.’ Allâh will destroy them during the night and will let the mountain fall on them, and He will transform the rest of them into monkeys and pigs and they will remain so till the Day of Resurrection.\" (Sahih Al-Bukhâri, Vol.7, Hadîth No.494B)","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"yāayyuhā alladhīna āmanū innamā al-khamru wal-maysiru wal-anṣābu wal-azlāmu rij'sun min ʿamali al-shayṭāni fa-ij'tanibūhu laʿallakum tuf'liḥūna ","translations":["O you","who","believe","Verily","the intoxicants","and [the] games of chance","and (sacrifices at) altars","and divining arrows","(are an) abomination","from","(the) work","(of) the Shaitaan","so avoid it","so that you may","(be) successful","(90)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","innamā","al-khamru","wal-maysiru","wal-anṣābu","wal-azlāmu","rij'sun","min","ʿamali","al-shayṭāni","fa-ij'tanibūhu","laʿallakum","tuf'liḥūna",null],"verseTiming":[[1,0,3030],[2,3030,3990],[3,3990,5970],[4,5970,7050],[5,7050,7970],[6,7970,9220],[7,9220,11270],[8,11270,12840],[9,12840,13460],[10,13460,14580],[11,14580,15230],[12,15230,17959],[13,17959,19029],[14,19029,20099],[15,20099,20709],[16,20709,22059],[17,22059,23459],[18,23459,24779],[19,24779,27394]]}}