{"name":"68:42","price":" 42. (Remember) the Day when the Shin[1] shall be laid bare (i.e. the Day of Resurrection) and they shall be called to prostrate themselves (to Allâh), but they (hypocrites) shall not be able to do so.","arabic":"يَوۡمَ يُكۡشَفُ عَن سَاقٖ وَيُدۡعَوۡنَ إِلَى ٱلسُّجُودِ فَلَا يَسۡتَطِيعُونَ","category":["68 (Al-Qalam)","Al-Qalam","Surah Al-Qalam","Chapter Al-Qalam","Qalam","Surah Qalam","Chapter Qalam","Al Qalam","Surah Al Qalam","Chapter Al Qalam","Surah 68","Chapter 68","The Pen","القلم"],"ayahNumber":5313,"juzNumber":29,"footnotes":"(V.68:42).\na) Narrated Abû-Sa‘îd رضي الله عنه: I heard the Prophet صلى الله عليه وسلم saying, \"Allâh will lay bare His Shin and then all the believers, men and women, will prostrate themselves before Him; but there will remain those who used to prostrate themselves in the world for showing off and for gaining good reputation. Such a one will try to prostrate himself (on the Day of Judgement) but his back (bones) will become a single (vertebra) bone (so he will not be able to prostrate). (Sahih Al-Bukhari, Vol.6, Hadîth No.441).\nb) See the footnote of (V.3:73) صفات الله .\nc) Narrated Abu Sa‘îd Al-Khudrî رضي الله عنه: We said, \"O Allâh’s Messenger! Shall we see our Lord on the Day of Resurrection?\" He said, \"Do you have any difficulty in seeing the sun and the moon when the sky is clear?\" We said, \"No.\" He said, \"So you will have no difficulty in seeing your Lord on that Day as you have no difficulty in seeing the sun and the moon (in a clear sky).\" The Prophet صلى الله عليه وسلم then said, \"Somebody will then announce, ‘Let every nation follow what they used to worship.’ So the people of the Cross will go with their Cross, and the idolaters (will go) with their idols, and the worshippers of every god (false deities) (will go) with their god: till there remain those who used to worship Allâh, from the righteous pious ones and the mischievous ones, and some of the people of the Scripture (Jews and Christians). Then Hell will be presented to them as if it were a mirage. Then it will be said to the Jews, ‘What did you use to worship?’ They will reply, ‘We used to worship ‘Uzair (Ezra), the son of Allâh.’ It will be said to them, ‘You are liars, for Allâh has neither a wife nor a son. What do you want (now)?’ They will reply, ‘We want You to provide us with water.’ Then it will be said to them ‘Drink’, and they will fall down in Hell (instead). Then it will be said to the Christians, ‘What did you use to worship?’ They will reply, ‘We used to worship Messiah, the son of Allâh.’ It will be said, ‘You are liars, for Allâh has neither a wife nor a son. What do you want (now)?’ They will say, ‘We want You to provide us with water.’ It will be said to them, ‘Drink,’ and they will fall down in Hell (instead): till there remain only those who used to worship Allâh (Alone), from the righteous pious ones and the mischievous evil ones, it will be said to them, ‘What keeps you here when all the people have gone?’ They will say, ‘We left them (in the world) when we were in greater need of them than we are today; we heard the call of one proclaiming - Let every nation follow what they used to worship, - and now we are waiting for our Lord.’ Then the Almighty will come to them in a shape other than the one which they saw the first time, and He will say, ‘I am your Lord,’ and they will say, ‘You are our Lord.’ And none will speak to Him then but the Prophets. And then it will be said to them, ‘Do you know any sign by which you can recognise Him?’ They will say, ‘The Shin,’ and so Allâh will then uncover His Shin whereupon every believer will prostrate himself before Him and there will remain those who used to prostrate themselves before Him just for showing off and for gaining good reputation. Such a one will try to prostrate himself but his back (bones) will become a single (vertebra) bone [like one piece of a wood and he will not be able to prostrate]. Then the bridge will be brought and laid across Hell.\" We (the Companions of the Prophet صلى الله عليه وسلم) said, \"O Allâh’s Messenger! What is the bridge?\" He said, \"It is a slippery (bridge) on which there are clamps and (hooks like) a thorny seed that is wide at one side and narrow at the other and has thorns with bent ends. Such a thorny seed is found in Najd and is called As-Sa‘dân. Some of the believers will cross the bridge as quickly as the wink of an eye, some others as quick as lightning, or a strong wind, or fast horses or she-camels. So some will be safe without any harm; some will be safe after receiving some scratches and some will fall down into Hell (Fire). The last person will cross as if being dragged (over the bridge).\" The Prophet صلى الله عليه وسلم said, \"You (Muslims) cannot be more pressing in claiming from me a right that has been clearly proved to be yours than the believers in interceding with Almighty for their (Muslim) brothers on that Day, when they see themselves safe. They will say, ‘O Allâh! (Save) our brothers (for they) used to pray with us, fast with us and also do good deeds with us.’ Allâh will say, ‘Go and take out (of Hell) anyone in whose heart you find Faith equal to the weight of one (gold) Dinar.’ Allâh will forbid the Fire to burn the faces of those sinners. They will go to them and find some of them in Hell (Fire) up to their feet, and some up to the middle of their legs. So, they will take out those whom they will recognise and then they will return. And Allâh will say (to them), ‘Go and take out (of Hell) anyone in whose heart you find Faith equal to the weight of one-half Dinar.’ They will take out whomever they will recognise and return. And then Allâh will say, ‘Go and take out (of Hell) anyone in whose heart you find Faith equal to the weight of an atom (or a small ant), and so they will take out all those whom they will recognise.\" Abû Sa‘îd said: \"If you do not believe me then read the Holy Verse: ‘Surely Allâh wrongs not even of the weight of an atom (or a small ant) but if there is any good (done), He doubles it.’ (V.4:40).\"\nThe Prophet صلى الله عليه وسلم added: \"Then the Prophets and angels and the believers will intercede, and (last of all) the Almighty (Allâh) will say, ‘Now remains My Intercession. He will then hold a handful of the Fire from which He will take out some people whose bodies have been burnt, and they will be thrown into a river at the entrance of Paradise, called the Water of Life. They will grow on its banks, as a seed carried by the torrent grows. You have noticed how it grows beside a rock or beside a tree, and how the side facing the sun is usually green while the side facing the shade is white. Those people will come out (of the River of Life) like pearls, and they will have (golden) necklaces, and then they will enter Paradise whereupon the people of Paradise will say, ‘These are the people emancipated by the Gracious. He has admitted them into Paradise without (them) having done any good deed and without sending forth any good (for themselves).’ Then it will be said to them, ‘For you is what you have seen and its equivalent as well.’\" (Sahih Al-Bukhari, Vol.9, Hadîth No.532B).","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"yawma yuk'shafu ʿan sāqin wayud'ʿawna ilā al-sujūdi falā yastaṭīʿūna ","translations":["(The) Day","will be uncovered","from","the shin","and they will be called","to","prostrate","but not","they will be able","(42)"],"transliterationArr":["yawma","yuk'shafu","ʿan","sāqin","wayud'ʿawna","ilā","al-sujūdi","falā","yastaṭīʿūna",null],"verseTiming":[[1,0,570],[2,570,1370],[3,1370,1950],[4,1950,3710],[5,3710,4810],[6,4810,5190],[7,5190,6220],[8,6220,6750],[9,6750,10415]]}}