{"name":"6:108","price":" 108. And insult not those whom they (disbelievers) worship besides Allâh, lest they insult Allâh wrongfully without knowledge. Thus We have made fair-seeming to each people its own doings; then to their Lord is their return and He shall then inform them of all that they used to do.[2]","arabic":"وَلَا تَسُبُّواْ ٱلَّذِينَ يَدۡعُونَ مِن دُونِ ٱللَّهِ فَيَسُبُّواْ ٱللَّهَ عَدۡوَۢا بِغَيۡرِ عِلۡمٖۗ كَذَٰلِكَ زَيَّنَّا لِكُلِّ أُمَّةٍ عَمَلَهُمۡ ثُمَّ إِلَىٰ رَبِّهِم مَّرۡجِعُهُمۡ فَيُنَبِّئُهُم بِمَا كَانُواْ يَعۡمَلُونَ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":897,"juzNumber":7,"footnotes":"(6:108) The tale of the cave:\nNarrated Ibn ‘Umar رضي الله عنهما: Allâh’s Messenger صلى الله عليه وسلم said, \"Once three persons (from the previous nations) were travelling, and suddenly it started raining and they took shelter in a cave. The entrance of the cave got closed (suddenly by the falling of a huge rock) while they were inside. They said to each other, ‘O You! Nothing can save you except the truth, so each of you should ask Allâh’s Help by referring to such a deed as he thinks he did sincerely (i.e., just for gaining Allâh’s Pleasure).’ So one of them said, ‘O Allâh! You know that I had a labourer who worked for me for one Faraq (i.e. three Sâ‘)of rice, but he departed, leaving it (i.e. his wages). I sowed that Faraq of rice and with its yield I bought cows (for him). Later on when came to me asking for his wages, I said (to him), ‘Go to those cows and drive them away.’ He said to me, ‘But you have to pay me only a Faraq of rice.’ I said to him, ‘Go to those cows and take them, for they are the product of that Faraq (of rice).’ So he drove them. O Allâh! If you consider that I did that for fear of You, then please remove the rock.’ The rock shifted a bit from the mouth of the cave. The second one said, ‘O Allâh, You know that I had old parents whom I used to provide with the milk of my sheep every night. One night I was delayed and when I came, they had slept, while my wife and children were crying with hunger. I used not to let them (i.e. my family) drink unless my parents had drunk first. So I disliked to wake them up and also disliked that they should sleep without drinking it, I kept on waiting (for them to wake) till it dawned. O Allâh! If You consider that I did that for fear of You, then please remove the rock.’ So the rock shifted and they could see the sky through it. The (third) one said, ‘O Allah! You know that I had a cousin (i.e. my paternal uncle’s daughter) who was most beloved to me and I sought to seduce her, but she refused, unless I paid her one-hundred Dinârs (i.e. gold pieces). So I collected the amount and brought it to her, and she allowed me to sleep with her. But when I sat between her legs, she said, ‘Be afraid of Allâh, and do not deflower me but legally.’ ‘I got up and left the hundred Dinârs (for her). O Allâh! If You consider that I did that for fear of You then please remove the rock.’ So Allâh released them (removed the rock) and they came out (of the cave).\" [This Hadith indicates that one can only ask Allâh for help directly or through his performed good deeds. But to ask Allâh through the dead or absent (prophets, saints, spirits, holy men, angels) is absolutely forbidden in Islâm and it is a kind of polytheism]. (Sahih Al-Bukhâri, Vol.4,Hadith No.671).","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"walā tasubbū alladhīna yadʿūna min dūni al-lahi fayasubbū al-laha ʿadwan bighayri ʿil'min kadhālika zayyannā likulli ummatin ʿamalahum thumma ilā rabbihim marjiʿuhum fayunabbi-uhum bimā kānū yaʿmalūna ","translations":["And (do) not","insult","those whom","they invoke","from","other than","Allah","lest they insult","Allah","(in) enmity","without","knowledge","Thus","We have made fair-seeming","to every","community","their deed","Then","to","their Lord","(is) their return","then He will inform them","about what","they used to","do","(108)"],"transliterationArr":["walā","tasubbū","alladhīna","yadʿūna","min","dūni","al-lahi","fayasubbū","al-laha","ʿadwan","bighayri","ʿil'min","kadhālika","zayyannā","likulli","ummatin","ʿamalahum","thumma","ilā","rabbihim","marjiʿuhum","fayunabbi-uhum","bimā","kānū","yaʿmalūna",null],"verseTiming":[[1,0,630],[2,630,1510],[3,1510,2500],[4,2500,3520],[5,3520,4340],[6,4340,5400],[7,5400,6240],[8,6240,6980],[9,6980,8080],[10,8080,9700],[11,9700,10510],[12,10510,11620],[13,11620,12640],[14,12640,14750],[15,14750,15580],[16,15580,17480],[17,17480,18550],[18,18550,19850],[19,19850,20470],[20,20470,21420],[21,21420,24240],[22,24240,25630],[23,25630,26220],[24,26220,27220],[25,27220,29180],[26,29180,31610],[27,31610,32180],[28,32180,33040],[29,33040,35995]]}}