{"name":"6:143","price":" 143. Eight pairs: of the sheep two (male and female),[1] and of the goats two (male and female). Say: \"Has He forbidden the two males or the two females, or (the young) which the wombs of the two females enclose? Inform me with knowledge if you are truthful.\"","arabic":"ثَمَٰنِيَةَ أَزۡوَٰجٖۖ مِّنَ ٱلضَّأۡنِ ٱثۡنَيۡنِ وَمِنَ ٱلۡمَعۡزِ ٱثۡنَيۡنِۗ قُلۡ ءَآلذَّكَرَيۡنِ حَرَّمَ أَمِ ٱلۡأُنثَيَيۡنِ أَمَّا ٱشۡتَمَلَتۡ عَلَيۡهِ أَرۡحَامُ ٱلۡأُنثَيَيۡنِۖ نَبِّـُٔونِي بِعِلۡمٍ إِن كُنتُمۡ صَٰدِقِينَ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":932,"juzNumber":8,"footnotes":"(V.6:143) Narrated Abu Hurairah رضي الله عنه: I heard Allâh’s Messenger صلى الله عليه وسلم saying, \"While a shepherd was amongst his sheep, a wolf attacked them and took away one sheep. When the shepherd chased the wolf, the wolf turned towards him and said, ‘Who will be their guard on the day of wild animals when nobody except I will be their shepherd’*. And while a man was driving a cow with a load on it, it turned towards him and spoke to him saying, ‘I have not been created for this purpose, but for ploughing.’\" The people said, \"Glorified be Allâh.\" The Prophetصلى الله عليه وسلم said, \"But I believe in it and so does Abu Bakr and ‘Umar رضي الله عنهم.\" (Sahih Al-Bukhâri, Vol.5, Hadîth No.15).\n* It has been written that a wolf also spoke to a shepherd during the Prophet’s lifetime near Al-Madinah, as narrated in Musnad Imam Ahmad in the Musnad of Abu Sa‘îd Al-Khudri رضي الله عنه (Vol.3, Page 83): Narrated Abu Sa‘îd Al-Khudri رضي الله عنه: (While a shepherd was in his hered of sheep), suddenly a wolf attacked a sheep and took it away, the shepherd chased the wolf and took back the sheep, the wolf sat on its tail and addressed the shepherd saying: \"Be afraid of Allâh, you have taken the provision from me which Allâh gave me.\" The shepherd said: \"What an amazing thing! A wolf sitting on its tail speaks to me in the language of a human being.\" The wolf said: \"Shall I tell you something more amazing than this? There is Muhammad صلى الله عليه وسلم the Messenger of Allâh in Yathrib (Al-Madinah) informing the people about the news of the past.\" Then the shepherd (after hearing that) proceeded (towards Al-Madinah) driving his sheep till he entered Al-Madinah, cornered his sheep in a place, and came to Allâh’s Messenger (Muhammad صلى الله عليه وسلم and informed the whole story. Allâh’s Messenger صلى الله عليه وسلم ordered for the proclamation of a congregational salat (صلاة جامعة) then he صلى الله عليه وسلم came out and asked the shepherd to inform the people (about the story), and he informed them. Then Allâh’s Messenger صلى الله عليه وسلم said: \"He (the shepherd) has spoken the truth. By Him (Allâh) in Whose Hands my soul is, the Day of Resurrection will not be established till beasts of prey (سباع) speak to the human beings, and the stick lash and the shoe-laces of a person speak to him and his thigh inform him about his family as to what happened to them after him.","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"thamāniyata azwājin mina al-ḍani ith'nayni wamina al-maʿzi ith'nayni qul āldhakarayni ḥarrama ami al-unthayayni ammā ish'tamalat ʿalayhi arḥāmu al-unthayayni nabbiūnī biʿil'min in kuntum ṣādiqīna ","translations":["Eight","pairs ","of","the sheep","two","and of","the goats","two","Say","(Are) the two males","He has forbidden","or","the two females","or what","contains","[in it]","(the) wombs","(of) the two females","Inform me","with knowledge","if","you are","truthful","(143)"],"transliterationArr":["thamāniyata","azwājin","mina","al-ḍani","ith'nayni","wamina","al-maʿzi","ith'nayni","qul","āldhakarayni","ḥarrama","ami","al-unthayayni","ammā","ish'tamalat","ʿalayhi","arḥāmu","al-unthayayni","nabbiūnī","biʿil'min","in","kuntum","ṣādiqīna",null],"verseTiming":[[1,0,1460],[2,1460,4360],[3,4360,5120],[4,5120,5910],[5,5910,6780],[6,6780,7350],[7,7350,8270],[8,8270,11480],[9,11480,11830],[10,11830,16440],[11,16440,17280],[12,17280,17810],[13,17810,19970],[14,19970,21290],[15,21290,22340],[16,22340,23260],[17,23260,24170],[18,24170,28320],[19,28320,29750],[20,29750,30880],[21,30880,32170],[22,32170,34100],[23,34100,38135]]}}