{"name":"6:159","price":" 159. Verily, those who divide their religion and break up into sects (all kinds of religious sects)[2], you (O Muhammad صلى الله عليه وسلم) have no concern in them in the least. Their affair is only with Allâh, Who then will tell them what they used to do.","arabic":"إِنَّ ٱلَّذِينَ فَرَّقُواْ دِينَهُمۡ وَكَانُواْ شِيَعٗا لَّسۡتَ مِنۡهُمۡ فِي شَيۡءٍۚ إِنَّمَآ أَمۡرُهُمۡ إِلَى ٱللَّهِ ثُمَّ يُنَبِّئُهُم بِمَا كَانُواْ يَفۡعَلُونَ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":948,"juzNumber":8,"footnotes":"(V.6:159) It is said that the Prophet صلى الله عليه وسلم recited this Verse and said: \"These people are those who invent new things (Bid‘ah) in religion and the followers of the vain desires of this Muslim nation, and their repentance will not be accepted by Allâh.\" (TafsirAl-Qurtubi).\n[It has been narrated in the Hadîth Books (At-Tirmidhi, Ibn Mâjah and Abu Dâwûd) that the Prophet صلى الله عليه وسلم said: \"The Jews and the Christians will be divided into seventy-one or seventy-two religious sects and this nation will be divided into seventy-three religious sects, - all in Hell, except one, and that one is: on which I and my Companions are today, i.e. following the Qur’ân and the Prophet’s Sunnah (legal ways, orders, acts of worship, statements)\"].","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"inna alladhīna farraqū dīnahum wakānū shiyaʿan lasta min'hum fī shayin innamā amruhum ilā al-lahi thumma yunabbi-uhum bimā kānū yafʿalūna ","translations":["Indeed","those who","divide","their religion","and become","sects","you are not","with them","in","anything","Only","their affair","(is) with","Allah","then","He will inform them","of what","they used to","do","(159)"],"transliterationArr":["inna","alladhīna","farraqū","dīnahum","wakānū","shiyaʿan","lasta","min'hum","fī","shayin","innamā","amruhum","ilā","al-lahi","thumma","yunabbi-uhum","bimā","kānū","yafʿalūna",null],"verseTiming":[[1,0,1640],[2,1640,2740],[3,2740,3980],[4,3980,5140],[5,5140,6260],[6,6260,7020],[7,7020,7840],[8,7840,8630],[9,8630,9150],[10,9150,12020],[11,12020,15780],[12,15780,16850],[13,16850,17310],[14,17310,18210],[15,18210,19510],[16,19510,22020],[17,22020,22560],[18,22560,23520],[19,23520,26625]]}}