{"name":"6:61","price":" 61. He is the Irresistible, (Supreme) over His slaves, and He sends guardians (angels guarding and writing all of one’s good and bad deeds) over you,[1] until when death approaches one of you, Our Messengers (angel of death and his assistants) take his soul, and they never neglect their duty.","arabic":"وَهُوَ ٱلۡقَاهِرُ فَوۡقَ عِبَادِهِۦۖ وَيُرۡسِلُ عَلَيۡكُمۡ حَفَظَةً حَتَّىٰٓ إِذَا جَآءَ أَحَدَكُمُ ٱلۡمَوۡتُ تَوَفَّتۡهُ رُسُلُنَا وَهُمۡ لَا يُفَرِّطُونَ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":850,"juzNumber":7,"footnotes":"(V.6:61):\na) Whoever intended to do a good deed or a bad deed.\nNarrated Ibn ‘Abbâs رضي الله عنهما: The Prophet صلى الله عليه وسلم narrating about his Lord عز وجل said, \"Allâh ordered (the appointed angels over you) that the good and the bad deeds be written, and He then showed (the way) how (to write). If somebody intends to do a good deed and he does not do it, then Allâh will write for him a full good deed (in his account with Him); and if he intends to do a good deed and actually did it, then Allâh will write for him (in his account) with Him (its reward equal) from ten to seven hundred times, to many more times: and if somebody intended to do a bad deed and he does not do it, then Allâh will write a full good deed (in his account) with Him, and if he intended to do it (a bad deed) and actually did it, then Allâh will write one bad deed (in his account).\" (Sahih Al-Bukhâri, Vol.8, Hadîth No.498).\nb) Narrated Abu Hurairah رضي الله عنه: The Prophet صلى الله عليه وسلم said, \"Angels come (to you) in succession by night and day, and all of them get together at the time of Fajr and ‘Asr prayers. Then those who have stayed with you overnight, ascend unto Allâh Who asks them (and He knows the answer better than they): \"How have you left My slaves?\" They reply, \"We left them while they were praying and we came to them while they were praying.\" The Prophet صلى الله عليه وسلم added: \"If anyone of you says Amîn (during the prayer at the end of the recitation of Sûrat Al-Fâtihah), and the angels in heaven say the same, and the two sayings coincide, all his past sins will be forgiven.\" (Sahih Al-Bukhâri, Vol.4, Hadîth No. 446)","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"wahuwa al-qāhiru fawqa ʿibādihi wayur'silu ʿalaykum ḥafaẓatan ḥattā idhā jāa aḥadakumu al-mawtu tawaffathu rusulunā wahum lā yufarriṭūna ","translations":["And He","(is) the Subjugator","over","His slaves","and He sends","over you","guardians","until","when","comes","(to) anyone of you","the death","take him","Our messengers","and they","(do) not","fail","(61)"],"transliterationArr":["wahuwa","al-qāhiru","fawqa","ʿibādihi","wayur'silu","ʿalaykum","ḥafaẓatan","ḥattā","idhā","jāa","aḥadakumu","al-mawtu","tawaffathu","rusulunā","wahum","lā","yufarriṭūna",null],"verseTiming":[[1,0,650],[2,650,1900],[3,1900,2580],[4,2580,4530],[5,4530,5620],[6,5620,6710],[7,6710,7810],[8,7810,10150],[9,10150,10790],[10,10790,12890],[11,12890,13940],[12,13940,14830],[13,14830,16180],[14,16180,17420],[15,17420,20470],[16,20470,21120],[17,21120,23650],[18,23650,24640],[19,24640,25550],[20,25550,26920],[21,26920,27990],[22,27990,28710],[23,28710,29100],[24,29100,33270]]}}