{"name":"6:93","price":" 93. And who can be more unjust than he who invents a lie against Allâh, or says: \"A revelation has come to me\" whereas no revelation has come to him in anything ; and who says, \"I will reveal the like of what Allâh has revealed.\" And if you could but see when the Zâlimûn (polytheists and wrong-doers) are in the agonies of death, while the angels are stretching forth their hands (saying): \"Deliver your souls! This day you shall be recompensed with the torment of degradation because of what you used to utter against Allâh other than the truth. And you used to reject His Ayât (proofs, evidence, verses, lessons, signs, revelations, etc.) with disrespect![1]\"","arabic":"وَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبًا أَوۡ قَالَ أُوحِيَ إِلَيَّ وَلَمۡ يُوحَ إِلَيۡهِ شَيۡءٞ وَمَن قَالَ سَأُنزِلُ مِثۡلَ مَآ أَنزَلَ ٱللَّهُۗ وَلَوۡ تَرَىٰٓ إِذِ ٱلظَّٰلِمُونَ فِي غَمَرَٰتِ ٱلۡمَوۡتِ وَٱلۡمَلَٰٓئِكَةُ بَاسِطُوٓاْ أَيۡدِيهِمۡ أَخۡرِجُوٓاْ أَنفُسَكُمُۖ ٱلۡيَوۡمَ تُجۡزَوۡنَ عَذَابَ ٱلۡهُونِ بِمَا كُنتُمۡ تَقُولُونَ عَلَى ٱللَّهِ غَيۡرَ ٱلۡحَقِّ وَكُنتُمۡ عَنۡ ءَايَٰتِهِۦ تَسۡتَكۡبِرُونَ","category":["6 (Al-An'am)","Al-An'am","Surah Al-An'am","Chapter Al-An'am","An'am","Surah An'am","Chapter An'am","Al An'am","Surah Al An'am","Chapter Al An'am","Surah 6","Chapter 6","The Cattle","الأنعَام"],"ayahNumber":882,"juzNumber":7,"footnotes":"(V.6:93) A. What is said regarding the punishment in the grave. And the Statement of Allâh عز وجل:\n\"If you could but see when the Zâlimûn (polytheists and wrong-doers) are in the agonies of death while the angels are stretching forth their hands (saying): \"Deliver your souls. This day you shall be recompensed with the torment of degradation.\" (V.6:93)\nAnd also the Statement of Allâh تعالى : \"Twice shall We punish them and thereafter, they shall be brought back to a great (horrible) torment.\" (V.9:101).\nAnd also the Statement of Allâh تعالى :\n\"While an evil torment encompassed Fir‘aun (Pharaoh)’s people; the Fire, they are exposed to it morning and afternoon, and on the Day when the Hour will be established (it will be said to the angels): ‘Cause Fir‘aun (Pharaoh)’s people to enter the severest torment.’\" (V.40: 4546).\nNarrated Al-Barâ’ bin ‘Âzib: The Prophet صلى الله عليه وسلم said, \"When a faithful believer is made to sit in his grave, then (the angels) come to him and he testifies that Lâ ilâha illallâh wa Anna Muhammad-ur-Rasuûl Allâh (none has the right to be worshipped but Allâh and Muhammad صلى الله عليه وسلم is the Messenger of Allâh). And that corresponds to Allâh’s Statement: ‘Allâh will keep firm those who believe with the word that stands firm.’ (V.14:27).\" (Sahih Al-Bukhâri, Vol.2, Hadîth No.450).\nB. Narrated Anas رضي الله عنه: The Prophet صلى الله عليه وسلم said, \"When a human being is laid in his grave and his companions return and he even hears their footsteps, two angels come to him and make him sit and ask him: ‘What did you use to say about this man, Muhammad صلى الله عليه وسلم ?’ He will say: ‘I testify that he is Allâh’s slave and His Messenger.’ Then it will be said to him, ‘Look at your place in the Hell-Fire. Allâh has changed for you a place in Paradise instead of it.’\" The Prophet صلى الله عليه وسلم added, \"The dead person will see both his places. But a disbeliever or a hypocrite will say to the angels, ‘I do not know, but I used to say what the people used to say!’ It will be said to him, ‘Neither did you know nor did you take the guidance (by following the Qur’ân).’ Then he will be hit with an iron hammer between his two ears, and he will cry and that cry will be heard by whatsoever is near to him except human beings and jinn.\" (Sahih Al-Bukhâri, Vol.2, Hadîth No.422)","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"waman aẓlamu mimmani if'tarā ʿalā al-lahi kadhiban aw qāla ūḥiya ilayya walam yūḥa ilayhi shayon waman qāla sa-unzilu mith'la mā anzala al-lahu walaw tarā idhi al-ẓālimūna fī ghamarāti al-mawti wal-malāikatu bāsiṭū aydīhim akhrijū anfusakumu al-yawma tuj'zawna ʿadhāba al-hūni bimā kuntum taqūlūna ʿalā al-lahi ghayra al-ḥaqi wakuntum ʿan āyātihi tastakbirūna ","translations":["And who","(is) more unjust","than (one) who","invents","about","Allah","a lie","or","said","It has been inspired","to me","while not","it was inspired","to him","anything","and (one) who","said","I will reveal","like","what","(has been) revealed","(by) Allah","And if","you (could) see","when","the wrongdoers","(are) in","agonies","(of) [the] death","while the Angels","(are) stretching out","their hands (saying)","Discharge","your souls","Today","you will be recompensed","(with) punishment","humiliating","because","you used to","say","against","Allah","other than","the truth","and you were","towards","His Verses","being arrogant","(93)"],"transliterationArr":["waman","aẓlamu","mimmani","if'tarā","ʿalā","al-lahi","kadhiban","aw","qāla","ūḥiya","ilayya","walam","yūḥa","ilayhi","shayon","waman","qāla","sa-unzilu","mith'la","mā","anzala","al-lahu","walaw","tarā","idhi","al-ẓālimūna","fī","ghamarāti","al-mawti","wal-malāikatu","bāsiṭū","aydīhim","akhrijū","anfusakumu","al-yawma","tuj'zawna","ʿadhāba","al-hūni","bimā","kuntum","taqūlūna","ʿalā","al-lahi","ghayra","al-ḥaqi","wakuntum","ʿan","āyātihi","tastakbirūna",null],"verseTiming":[[1,0,22704],[2,22704,23606],[3,23606,25135],[4,25135,25898],[5,25898,26573],[6,26573,27194],[7,27194,27798],[8,27798,28407],[9,28407,28960],[10,28960,29858],[11,29858,30687],[12,30687,31262],[13,31262,31969],[14,31969,32711],[15,32711,33840],[16,33840,34718],[17,34718,35797],[18,35797,37697],[19,37697,38364],[20,38364,40339],[21,40339,41569],[22,41569,43716],[23,43716,44965],[24,44965,47245],[25,47245,47822],[26,47822,49122],[27,49122,49698],[28,49698,50592],[29,50592,51550],[30,51550,54669],[31,54669,57548],[32,57548,59216],[33,59216,62664],[34,62664,65329],[35,65329,66502],[36,66502,69091],[37,69091,71548],[38,71548,73060],[39,73060,74104],[40,74104,74993],[41,74993,75844],[42,75844,76502],[43,76502,77896],[44,77896,79181],[45,79181,79686],[46,79686,80523],[47,80523,81287],[48,81287,82007],[49,82007,83626],[50,83626,84170],[51,84170,85792],[52,85792,88805]]}}