{"name":"77:48","price":" 48. And when it is said to them: \"Bow down yourself (in prayer)!\" They bow not down (offer not their prayers).[1]","arabic":"وَإِذَا قِيلَ لَهُمُ ٱرۡكَعُواْ لَا يَرۡكَعُونَ","category":["77 (Al-Mursalat)","Al-Mursalat","Surah Al-Mursalat","Chapter Al-Mursalat","Mursalat","Surah Mursalat","Chapter Mursalat","Al Mursalat","Surah Al Mursalat","Chapter Al Mursalat","Surah 77","Chapter 77","The Emissaries","المرسلات"],"ayahNumber":5670,"juzNumber":29,"footnotes":"(V.77:48)\nA) Narrated Anas bin Mâlik رضي الله عنه: Allâh’s Messenger صلى الله عليه وسلم said, \"I have been ordered to fight the people till they say: Lâ ilâha illallâh (none has the right to be worshipped but Allâh). And if they say so, perform As-Salât (the prayer) like our Salât (prayers), face our Qîblah and slaughter as we slaughter, then their blood and property will be sacred to us and we will not interfere with them except legally and their reckoning will be with Allâh.\"\nNarrated Maimûn bin Siyâh that he asked Anas bin Mâlik, \"O Abu Hamzah! What makes the life and property of a person sacred?\" He replied, \"Whoever says, Lâ ilâha illallâh (none has the right to be worshipped but Allâh), faces our Qîblah during the Salât (prayers), perform As-Salât (the prayer) like us, and eat our slaughtered animals then he is a Muslim and has got the same rights and obligations as other Muslims have.\" (Sahih Al Bukhari, Vol.1, Hadith No.387).\nB) Narrated Abu Hurairah رضي الله عنه: Allâh’s Messenger صلى الله عليه وسلم said, \"If the people knew (the reward for) pronouncing the Adhân and for standing in the first row (in congregational prayers) and found no other way to get that except by drawing lots they would draw lots, and if they knew (the reward of) the Zuhr prayer (in the early moments of its stated time) they would race for it (go early) and if they knew (the reward of) ‘Ishâ and Fajr (night and morning) prayers in congregation, they would come to offer them even if they had to crawl.\" (Sahih Al-Bukhari, Vol. 1, Hadith No.589).","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"wa-idhā qīla lahumu ir'kaʿū lā yarkaʿūna ","translations":["And when","it is said","to them","Bow","not","they bow","(48)"],"transliterationArr":["wa-idhā","qīla","lahumu","ir'kaʿū","lā","yarkaʿūna",null],"verseTiming":[[1,0,840],[2,840,1470],[3,1470,2060],[4,2060,2850],[5,2850,3230],[6,3230,6445]]}}