{"name":"7:31","price":"31. O Children of Adam! Take your adornment (by wearing your clean clothes), while praying[1] and going round (the Tawâf of) the Ka‘bah, and eat and drink but waste not by extravagance, certainly He (Allâh) likes not Al-Musrifûn (those who waste by extravagance).","arabic":"۞ يَٰبَنِيٓ ءَادَمَ خُذُواْ زِينَتَكُمۡ عِندَ كُلِّ مَسۡجِدٖ وَكُلُواْ وَٱشۡرَبُواْ وَلَا تُسۡرِفُوٓاْۚ إِنَّهُۥ لَا يُحِبُّ ٱلۡمُسۡرِفِينَ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":985,"juzNumber":8,"footnotes":"(V.7:31) It is obligatory to wear the clothes while praying. And the Statement of Allâh عز وجل: \"Take your adornment [(by wearing your clean clothes) covering completely the ‘Aurah (covering of one’s ‘Aurah means: while praying, a male must cover himself with clothes from the umbilicus of his abdomen up to his knees, and it is better that both his shoulders should be covered. And a female must cover all her body and feet except face, and it is better that both her hands are also covered)], while praying and going round (the Tawâf of) the Ka‘bah.\nIn how many (what sort of) clothes a woman should pray? ‘Ikrimah said, \"If she can cover all her body with one garment, it is sufficient.\"\nIt is agreed by the majority of the religious scholars that a woman while praying should cover herself completely except her face, and it is better that she should cover her hands with gloves or cloth. but her feet must be covered either with a long dress or she must wear socks to cover her feet. This verdict is based on the Prophet’s statement (Abu Dâwûd).\nNarrated ‘Âishah رضي الله عنها: Allâh’s Messenger صلى الله عليه وسلم used to offer the Fajr prayer and some believing women covered with their veiling sheets used to attend the Fajr prayer with him, and then they would return to their homes unrecognized. (Sahih Al-Bukhâri, Vol.1, hadîth No.368).","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"yābanī ādama khudhū zīnatakum ʿinda kulli masjidin wakulū wa-ish'rabū walā tus'rifū innahu lā yuḥibbu al-mus'rifīna ","translations":["O Children","(of) Adam","Take","your adornment","at","every","masjid","and eat","and drink","but (do) not","be extravagant","Indeed, He","(does) not","love","the extravagant ones","(31)"],"transliterationArr":["yābanī","ādama","khudhū","zīnatakum","ʿinda","kulli","masjidin","wakulū","wa-ish'rabū","walā","tus'rifū","innahu","lā","yuḥibbu","al-mus'rifīna",null],"verseTiming":[[1,0,2580],[2,2580,3380],[3,3380,4050],[4,4050,5320],[5,5320,6450],[6,6450,7130],[7,7130,8700],[8,8700,9610],[9,9610,10640],[10,10640,11190],[11,11190,12400],[12,12400,14600],[13,14600,15020],[14,15020,15880],[15,15880,19025]]}}