{"name":"7:87","price":" 87. \"And if there is a party of you who believe in that with which I have been sent and a party who do not believe, so be patient until Allâh judges between us, and He is the Best of judges.\"[1]","arabic":"وَإِن كَانَ طَآئِفَةٞ مِّنكُمۡ ءَامَنُواْ بِٱلَّذِيٓ أُرۡسِلۡتُ بِهِۦ وَطَآئِفَةٞ لَّمۡ يُؤۡمِنُواْ فَٱصۡبِرُواْ حَتَّىٰ يَحۡكُمَ ٱللَّهُ بَيۡنَنَاۚ وَهُوَ خَيۡرُ ٱلۡحَٰكِمِينَ","category":["7 (Al-A'raf)","Al-A'raf","Surah Al-A'raf","Chapter Al-A'raf","A'raf","Surah A'raf","Chapter A'raf","Al A'raf","Surah Al A'raf","Chapter Al A'raf","Surah 7","Chapter 7","The Heights","الأعرَاف"],"ayahNumber":1041,"juzNumber":8,"footnotes":"(V.7:87):\nA). Narrated ‘Abdullâh bin ‘Umar رضي الله عنهما: Allâh’s Messenger صلى الله عليه وسلم said, \"Surely! Everyone of you is a guardian and is responsible for his charges: The Imâm (ruler) of the people is a guardian and is responsible for his subjects: a man is the guardian of his family (household) and is responsible for his subjects: a woman is the guardian of her husband’s home and of his children and is responsible for them; and the slave of a man is a guardian of his master’s property and is responsible for it. Surely, everyone of you is a guardian and responsible for his charges.\" (Sahih Al-Bukhâri, Vol.9, hadîth No.252).\nB). Narrated Tarîf Abî Tamîmah: I saw Safwân and Jundub and Safwân’s companions when Jundub was advising. They said, \"Did you hear something from Allâh’s Messenger صلى الله عليه وسلم?\" Jundub said, \"I heard him saying, ‘Whoever does a good deed in order to show-off, Allâh will expose his intentions on the Day of Resurrection (before the people), and whoever puts the people into difficulties, Allâh will put him into difficulties on the Day of Resurrection.’ \" The people said (to Jundub), \"Advise us.\" He said, \"The first thing of the human body to purify is the abdomen, so he who can eat nothing but good food (Halâl and earned lawfully) should do so, and he who does as much as he can that nothing intervene between him and Paradise by not shedding even a handful of blood, (i.e. murdering) should do so.\" [Sahih Al-Bukhâri, Vol.9, hadîth No.266].\nC) Narrated Anas bin Mâlik رضي الله عنه: While the Prophetصلى الله عليه وسلم and I were coming out of the mosque, a man met us outside the gate. The man said, \"O Allâh’s Messenger! When will be the Hour?\" The Prophetصلى الله عليه وسلم asked him, \"What have you prepared for it?\" The man became afraid and ashamed and then said, \"O Allâh’s Messenger! I haven’t prepared for it much of Saum (fasts), Salât (prayers) or charitable gifts but I love Allâh and His Messenger.\" The Prophetصلى الله عليه وسلم said, \"You will be with the one whom you love.\" [Sahih Al-Bukhâri, Vol.9, hadîth No. 267].\nD). Narrated Abu Dharr رضي الله عنه : Once I went to him (the Prophetصلى الله عليه وسلم) and he said, \"By Allâh in Whose Hand my life is (Or probably said, \"By Allâh, except whom none has the right to be worshipped)\" whoever had camels or cows or sheep and did not pay their Zakât, those animals will be brought on the Day of Resurrection far bigger and fatter than before and they will tread him under their hooves, and will butt him with their horns, and (those animals will come in circle): When the last does its turn, the first will start again, and this punishment will go on till Allâh has finished the judgements amongst the people.\"\n[Sahih Al-Bukhâri, Vol.2. hadîth No.539].","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"wa-in kāna ṭāifatun minkum āmanū bi-alladhī ur'sil'tu bihi waṭāifatun lam yu'minū fa-iṣ'birū ḥattā yaḥkuma al-lahu baynanā wahuwa khayru al-ḥākimīna ","translations":["And if","(there) is","a group","among you","(who has) believed","in that which","I have been sent","with [it]","and a group","not","they believe","then be patient","until","judges","Allah","between us","And He","(is the) Best","(of) [the] Judges","(87)"],"transliterationArr":["wa-in","kāna","ṭāifatun","minkum","āmanū","bi-alladhī","ur'sil'tu","bihi","waṭāifatun","lam","yu'minū","fa-iṣ'birū","ḥattā","yaḥkuma","al-lahu","baynanā","wahuwa","khayru","al-ḥākimīna",null],"verseTiming":[[1,0,570],[2,570,1980],[3,1980,6180],[4,6180,7700],[5,7700,8540],[6,8540,10980],[7,10980,11600],[8,11600,14490],[9,14490,14970],[10,14970,16120],[11,16120,17270],[12,17270,18730],[13,18730,19430],[14,19430,20380],[15,20380,21310],[16,21310,22360],[17,22360,23510],[18,23510,24090],[19,24090,28915]]}}