{"name":"8:73","price":" 73. And those who disbelieve are allies of one another, (and) if you (Muslims of the whole world collectively) do not do so [i.e. become allies, as one united block under one Khalifah (a chief Muslim ruler for the whole Muslim world) to make victorious Allâh’s religion of Islâmic Monotheism], there will be Fitnah (wars, battles, polytheism) and oppression on the earth, and a great mischief and corruption (appearance of polytheism).[2]","arabic":"وَٱلَّذِينَ كَفَرُواْ بَعۡضُهُمۡ أَوۡلِيَآءُ بَعۡضٍۚ إِلَّا تَفۡعَلُوهُ تَكُن فِتۡنَةٞ فِي ٱلۡأَرۡضِ وَفَسَادٞ كَبِيرٞ","category":["8 (Al-Anfal)","Al-Anfal","Surah Al-Anfal","Chapter Al-Anfal","Anfal","Surah Anfal","Chapter Anfal","Al Anfal","Surah Al Anfal","Chapter Al Anfal","Surah 8","Chapter 8","The Spoils of War","الأنفَال"],"ayahNumber":1233,"juzNumber":10,"footnotes":"(V.8:73) It has been mentioned in Tafsjr At-Tabari, that the best interpretation of this Verse: - [\"And those who disbelieve are allies of one another, (and) if you (Muslims of the whole world collectively) do not do so (i.e. become allies, as one united block V.8:73).\"] is \"That if you do not do what We (Allâh) have ordered you to do, [i.e. all of you (Muslims of the whole world) do not become allies as one united block to make Allâh’s religion Islâm) victorious, there will be a great Fitnah (polytheism, wars, battles, killing, robbing, a great mischief, corruption and oppression.)\"]. And it is Fitnah to have many Khalifahs (Muslim rulers), as it has been mentioned in Sahih Muslim by ‘Arfajah, who said: I heard Allâh’s Messenger صلى الله عليه وسلم saying: \"When you all (Muslims) are united (as one block) under a single Khalifah (chief Muslim ruler), and a man comes up to disintegrate you and separate you into different groups, then kill that man.\"\nAlso there is another narration in Sahih Muslim: Narrated Abu Sa‘îd Al-Khudrî رضي الله عنه: Allâh’s Messenger صلى الله عليه وسلمsaid: \"If the Muslim world gave the Bai‘a (pledge) to two Khalifah (chief Muslim rulers), the first one who was given the Bai‘a (pledge) first will remain as the Khalifah, then kill the latter (the second) one.\" So it is a legal obligation, from the above-mentioned evident proofs (from the Qur’ân and the Prophet’s statement), that there shall not be more than one Khalifah (a chief Muslim ruler) for the whole Muslim world or otherwise there will be a great Fitnah (mischief and evil) amongst the Muslims, the ultimate results of which will not be worthy of praise.","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"wa-alladhīna kafarū baʿḍuhum awliyāu baʿḍin illā tafʿalūhu takun fit'natun fī al-arḍi wafasādun kabīrun ","translations":["And those who","disbelieve","some of them","(are) allies","(to) another","If not","you do it","(there) will be","oppression","in","the earth","and corruption","great","(73)"],"transliterationArr":["wa-alladhīna","kafarū","baʿḍuhum","awliyāu","baʿḍin","illā","tafʿalūhu","takun","fit'natun","fī","al-arḍi","wafasādun","kabīrun",null],"verseTiming":[[1,0,1370],[2,1370,2320],[3,2320,3450],[4,3450,6120],[5,6120,7230],[6,7230,8010],[7,8010,9370],[8,9370,10650],[9,10650,12520],[10,12520,12810],[11,12810,13640],[12,13640,16000],[13,16000,18655]]}}