{"name":"9:119","price":" 119. O you who believe! Be afraid of Allâh, and be with those who are true (in words and deeds).[1]","arabic":"يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱتَّقُواْ ٱللَّهَ وَكُونُواْ مَعَ ٱلصَّٰدِقِينَ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1354,"juzNumber":11,"footnotes":"(V.9:119) The Statement of Allâh تعالى : ‘O you who believe! Be afraid of Allâh, and be with those who are true (in words and deeds).’ (V.9:119).\nAnd what is forbidden as regards telling of lies.\na) Narrated ‘Abdullâh رضي الله عنه : The Prophet صلى الله عليه وسلم said, \"Truthfulness leads to Al-Birr (righteousness) and Al-Birr (righteousness) leads to Paradise. And a man keeps on telling the truth until he becomes a truthful person. Falsehood leads to Al-Fujûr (i.e. wickedness - evil-doing), and Al-Fujûr leads to the (Hell) Fire, and a man keeps on telling lies until he is written as a liar before Allâh.\" (Sahih Al-Bukhâri, Vol.8, Hadîth No.116).\nb) Narrated Abu Hurairah رضي الله عنه : Allâh’s Messenger صلى الله عليه وسلم said, \"The signs of a hypocrite are three: Whenever he speaks, he tells a lie; and whenever he promises, he breaks his promise; and whenever he is entrusted, he betrays (proves to be dishonest).\" (Sahih Al-Bukhari, Vol.8, Hadith No.117).\nc) Narrated Samurah bin Jundub رضي الله عنه : The Prophet صلى الله عليه وسلم said, \"I saw (in a dream), two men came to me.\" Then the Prophet صلى الله عليه وسلم narrated the story (saying): \"They said: The person, the one whose cheek you saw being torn away (from the mouth to the ear) was a liar and used to tell lies and the people would report those lies on his authority till they spread all over the world. So he will be punished like that till the Day of Resurrection.\" (Sahih Al-Bukhari, Vol.8, Hadith No.118).","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"yāayyuhā alladhīna āmanū ittaqū al-laha wakūnū maʿa al-ṣādiqīna ","translations":["O you who believe","O you who believe","O you who believe","Fear","Allah","and be","with","those who are truthful","(119)"],"transliterationArr":["yāayyuhā","alladhīna","āmanū","ittaqū","al-laha","wakūnū","maʿa","al-ṣādiqīna",null],"verseTiming":[[1,0,2810],[2,2810,3870],[3,3870,4780],[4,4780,5700],[5,5700,6390],[6,6390,7510],[7,7510,7950],[8,7950,12135]]}}