{"name":"9:121","price":" 121. Nor do they spend anything (in Allâh’s Cause) - small or great - nor cross a valley, but is written to their credit that Allâh may recompense them with the best of what they used to do (i.e. Allâh will reward their good deeds according to the reward of their best deeds which they did in the most perfect manner).[3]","arabic":"وَلَا يُنفِقُونَ نَفَقَةٗ صَغِيرَةٗ وَلَا كَبِيرَةٗ وَلَا يَقۡطَعُونَ وَادِيًا إِلَّا كُتِبَ لَهُمۡ لِيَجۡزِيَهُمُ ٱللَّهُ أَحۡسَنَ مَا كَانُواْ يَعۡمَلُونَ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1356,"juzNumber":11,"footnotes":"(V.9:121)\na) Islâm demolishes all the previous evil deeds and so do migration (for Allâh’s sake) and Hajj (pilgrimage to Makkah). (Sahih Muslim, Vol.1, Chapter 52, Page 18)\nb) What is said regarding the superiority of a person who embraces Islâm sincerely.\nNarrated Abu Sa‘îd Al-Khudrî رضي الله عنه: Allâh’s Messenger صلى الله عليه وسلم said, \"If a person embraces Islâm sincerely, then Allâh shall forgive all his past sins, and after that starts the settlement of accounts: the reward of his good deeds will be ten times to seven hundred times for each good deed, and an evil deed will be recorded as it is unless Allâh forgives it.\" (Sahih Al-Bukhari, Vol.1, Hadith No. 40A)\nNarrated Abu Hurairah رضي الله عنه : Allâh’s Messenger صلى الله عليه وسلم said, \"If anyone of you improves (follow strictly) his Islâmic religion, then his good deeds will be rewarded ten times to seven hundred times for each good deed and a bad deed will be recorded as it is.\" (Sahih Al-Bukhari, Vol.1, Hadith No.4DB)","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"walā yunfiqūna nafaqatan ṣaghīratan walā kabīratan walā yaqṭaʿūna wādiyan illā kutiba lahum liyajziyahumu al-lahu aḥsana mā kānū yaʿmalūna ","translations":["And not","they spend","any spending","small","and not","big","and not","they cross","a valley","but","is recorded","for them","that Allah may reward them","that Allah may reward them","the best","(of) what","they used (to)","do","(121)"],"transliterationArr":["walā","yunfiqūna","nafaqatan","ṣaghīratan","walā","kabīratan","walā","yaqṭaʿūna","wādiyan","illā","kutiba","lahum","liyajziyahumu","al-lahu","aḥsana","mā","kānū","yaʿmalūna",null],"verseTiming":[[1,0,760],[2,760,2920],[3,2920,4610],[4,4610,6030],[5,6030,7270],[6,7270,8610],[7,8610,9860],[8,9860,11100],[9,11100,12340],[10,12340,13170],[11,13170,13920],[12,13920,15110],[13,15110,15890],[14,15890,16640],[15,16640,17200],[16,17200,18740],[17,18740,19710],[18,19710,20590],[19,20590,20940],[20,20940,21910],[21,21910,25665]]}}