{"name":"9:20","price":" 20. Those who believed (in the Oneness of Allâh - Islâmic Monotheism) and emigrated and strove hard and fought in Allâh’s Cause with their wealth and their lives are far higher in degree with Allâh. They are the successful.[1]","arabic":"ٱلَّذِينَ ءَامَنُواْ وَهَاجَرُواْ وَجَٰهَدُواْ فِي سَبِيلِ ٱللَّهِ بِأَمۡوَٰلِهِمۡ وَأَنفُسِهِمۡ أَعۡظَمُ دَرَجَةً عِندَ ٱللَّهِۚ وَأُوْلَٰٓئِكَ هُمُ ٱلۡفَآئِزُونَ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1255,"juzNumber":10,"footnotes":"(V.9:20).\na. Narrated Abu Hurairah رضي الله عنه : The Prophet صلى الله عليه وسلم said, \"Whoever believes in Allâh and His Messenger صلى الله عليه وسلم performs Salât (Iqamât-as-Salât) and observes Saum (fasts) during the month of Ramadan, then it will be a promise binding upon Allâh to admit him to Paradise, no matter whether he fights in Allâh’s Cause or remains in the land where he is born.\" The people said, \"O Allâh’s Messenger! Shall we acquaint the people with this good news?\" He said, \"Paradise has one hundred grades which Allâh has reserved for the Mujahidûn who fight in His Cause, and the distance between each of two grades is like the distance between the heaven and the earth. So, when you ask Allâh (for something), ask for Al-Firdaus which is the middle and highest part of Paradise.\" [the subnarrator added, \"I think the Prophet صلى الله عليه وسلم also said, ‘Above it (i.e. Al-Firdaus ) is the Throne of the Most Gracious (i.e. Allâh), and from it gushes forth the rivers of Paradise].\" (Sahih Al Bukhârî, Vol.4, Hadith No.48).\nb. The wish for martyrdom.\nNarrated Abu Hurairah رضي الله عنه: The Prophet صلى الله عليه وسلم said, \"By Him in Whose Hand my soul is! Were it not for some men amongst the believers who dislike to be left behind me, and whom I cannot provide with means of conveyance, I would certainly never remain behind any Sariya (army unit) going out for Jihâd in Allâh’s Cause. By Him in Whose Hand my soul is! I would love to be martyred in Allâh’s Cause and then come back to life, and then get martyred and then come back to life again, and then get martyred and then come back to life again, and then get martyred.\" (Sahih Al-Bukhâri, Vol.4, Hadith No.54).","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"alladhīna āmanū wahājarū wajāhadū fī sabīli al-lahi bi-amwālihim wa-anfusihim aʿẓamu darajatan ʿinda al-lahi wa-ulāika humu al-fāizūna ","translations":["Those who","believed","and emigrated","and strove","in","(the) way","(of) Allah","with their wealth","and their lives","(are) greater","(in) rank","near","Allah","And those ","they","(are) the successful","(20)"],"transliterationArr":["alladhīna","āmanū","wahājarū","wajāhadū","fī","sabīli","al-lahi","bi-amwālihim","wa-anfusihim","aʿẓamu","darajatan","ʿinda","al-lahi","wa-ulāika","humu","al-fāizūna",null],"verseTiming":[[1,0,1270],[2,1270,2670],[3,2670,4040],[4,4040,5370],[5,5370,5840],[6,5840,7140],[7,7140,7820],[8,7820,9650],[9,9650,11790],[10,11790,12690],[11,12690,13800],[12,13800,15160],[13,15160,18690],[14,18690,21710],[15,21710,22140],[16,22140,25060],[17,25060,27215]]}}