{"name":"9:5","price":" 5. Then when the Sacred Months (the 1st, 7th, 11th, and 12th months of the Islâmic calendar) have passed, then kill the Mushrikûn (See V.2:105) wherever you find them, and capture them and besiege them, and lie in wait for them in each and every ambush. But if they repent and perform As-Salât (Iqâmat-as-Salât), and give Zakât, then leave their way free. Verily, Allâh is Oft-Forgiving, Most Merciful.[1]","arabic":"فَإِذَا ٱنسَلَخَ ٱلۡأَشۡهُرُ ٱلۡحُرُمُ فَٱقۡتُلُواْ ٱلۡمُشۡرِكِينَ حَيۡثُ وَجَدتُّمُوهُمۡ وَخُذُوهُمۡ وَٱحۡصُرُوهُمۡ وَٱقۡعُدُواْ لَهُمۡ كُلَّ مَرۡصَدٖۚ فَإِن تَابُواْ وَأَقَامُواْ ٱلصَّلَوٰةَ وَءَاتَوُاْ ٱلزَّكَوٰةَ فَخَلُّواْ سَبِيلَهُمۡۚ إِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ","category":["9 (At-Tawbah)","At-Tawbah","Surah At-Tawbah","Chapter At-Tawbah","Tawbah","Surah Tawbah","Chapter Tawbah","At Tawbah","Surah At Tawbah","Chapter At Tawbah","Surah 9","Chapter 9","The Repentance","التوبَة"],"ayahNumber":1240,"juzNumber":10,"footnotes":"a) (V.9:5) See the footnote of (V.2:193).\nb) Narrated Abû Hurairah رضي الله عنه : When the Prophet صلى الله عليه وسلم died and Abû Bakr became his successor and some of the Arabs reverted to disbelief, ‘Umar said, \"O Abû Bakr! How can you fight these people although Allâh’s Messenger صلى الله عليه وسلم said, \" I have been ordered to fight the people till they say: La ilâha illallâh (none has the right to be worshipped but Allâh), and whoever said La ilâha illallâh will save his property and his life from me, unless (he does something for which he receives legal punishment) justly, and his account will be on Allâh?\" Abû Bakr said, \"By Allâh! I will fight who ever differentiates between Salât (prayers) and Zakât, as Zakât is the right to be taken from property (according to Allâh’s orders). By Allâh! If they refused to pay me even a kid they used to pay to Allâh’s Messenger صلى الله عليه وسلم, I would fight with them for withholding it,\" ‘Umar said \"By Allâh! It was nothing, but I noticed that Allâh opened Abû Bakr’s chest towards the decision to fight, therefore I realized that his decision was right.\" (Sahih Al-Bukhâri, Vol.9, Hadîth No 59).","lang":"en","version":{"key":"english_hilali_khan","direction":"ltr","language_iso_code":"en","version":"1.1.0","last_update":1577394000,"title":"English Translation - Hilali and Khan","description":"Translation of the Quran meanings into English by Taqi-ud-Din Al-Hilali and Muhsen Khan"},"meta":{"transliteration":"fa-idhā insalakha al-ashhuru al-ḥurumu fa-uq'tulū al-mush'rikīna ḥaythu wajadttumūhum wakhudhūhum wa-uḥ'ṣurūhum wa-uq'ʿudū lahum kulla marṣadin fa-in tābū wa-aqāmū al-ṣalata waātawū al-zakata fakhallū sabīlahum inna al-laha ghafūrun raḥīmun ","translations":["Then when","have passed","the sacred months","the sacred months","then kill","the polytheists","wherever","you find them","and seize them","and besiege them","and sit (in wait)","for them","(at) every","place of ambush","But if","they repent","and establish","the prayer","and give","the zakah","then leave","their way","Indeed","Allah","(is) Oft-Forgiving","Most Merciful","(5)"],"transliterationArr":["fa-idhā","insalakha","al-ashhuru","al-ḥurumu","fa-uq'tulū","al-mush'rikīna","ḥaythu","wajadttumūhum","wakhudhūhum","wa-uḥ'ṣurūhum","wa-uq'ʿudū","lahum","kulla","marṣadin","fa-in","tābū","wa-aqāmū","al-ṣalata","waātawū","al-zakata","fakhallū","sabīlahum","inna","al-laha","ghafūrun","raḥīmun",null],"verseTiming":[[1,0,670],[2,670,2290],[3,2290,3350],[4,3350,4180],[5,4180,5030],[6,5030,6500],[7,6500,7330],[8,7330,9010],[9,9010,10360],[10,10360,11950],[11,11950,13000],[12,13000,13720],[13,13720,14330],[14,14330,15160],[15,15160,17370],[16,17370,18520],[17,18520,19530],[18,19530,20780],[19,20780,21880],[20,21880,23060],[21,23060,24080],[22,24080,26120],[23,26120,27560],[24,27560,28560],[25,28560,29420],[26,29420,32505]]}}